{"id": "8624bc36e1b45604e9ed5df194950f0f", "url": "https://www.bonappetit.com/story/houston-texas-restaurants", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "Houston Restaurants You Need to Check Out Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEvery Single Place to Eat (and Drink) Right Now in HoustonAmerica's most diverse city is home to addictive Cajun-spiced crawfish, an insane spaghetti sandwich, and a whole lot more.By Christina ChaeyMarch 22, 2018FacebookTwitterEmailSpicy crawfishPhoto by Wynn MyersFacebookTwitterEmailBy some measures, Houston is now America’s most diverse city—which also makes it one of the country’s most exciting places to eat. Here, Viet-Cajun crawfish and pho have clinched a place in the modern culinary canon alongside Tex-Mex and barbecue; even better, you can conquer it all in a long weekend. And as the city rebuilds itself in the aftermath of Hurricane Harvey, the restaurant scene continues to become more and more vibrant. Chefs and bartenders are crafting delicious cocktails, getting us excited about brunch (spaghetti sandwich!), and shucking plump Gulf oysters. So dig in to our favorites—and don’t forget to pack your stretchy pants.The New Spot You Need to HitHow do you pick out the industry folks at Nancy’s Hustle, a buzzy new neighborhood bistro in East Downtown? It will be late (the kitchen is open until midnight), and they’ll be geeking out over the natural wines. They’ll also be snacking on tender lamb dumplings and Nancy cakes—a kind of johnnycake topped with trout roe. You should join them.Murder Point oysters at One Fifth.\nPhoto by Wynn MyersYes, You Should Be Eating Gulf OystersIf you spot Murder Point oysters on a menu, don’t think twice: Order a dozen. Chefs are falling for these creamy Gulf bivalves, which are cultivated by Murder Point Oyster Co. in the waters of southwestern Alabama. The unique harvesting process creates strong, deep shells that cup the plump, buttery, not-too-big meat within. Look for them at restaurants that include One Fifth and State of Grace.4 Dishes You Need to Try in AsiatownThere’s no better way to experience the diversity of Houston’s restaurants than to devour Bellaire Boulevard, a six-mile stretch home to the city’s most adventurous bites. Chef Justin Yu of Theodore Rex is a regular, so we asked him to share his can’t-miss spots.Chicken hara masala at Himalaya Restaurant.\nPhoto by Wynn MyersHimalaya RestaurantYes, order spicy goat biryani and airy garlic naan, but whatever you do, don’t skip the chicken hara masala at this always-bustling Indian/Pakistani spot just north of the main Asiatown strip. Tender chunks of chicken float in a fragrant herb-packed spicy and tangy green curry sauce that begs for an extra order of naan for sauce mopping. “It’s the one thing I get every time I go,” Yu says.Salt-and-pepper pork spareribs at Shanghai Restaurant.\nPhoto by Wynn MyersShanghai RestaurantDespite its name, this unassuming family joint (where Yu has been eating since he was a kid) serves classic Cantonese-style dishes like the transcendently crispy salt-and-pepper pork spareribs, lightly breaded and fried with batons of green onion and dried red chiles. “They’re a perfect example of the simplicity and technique that define this incredible region’s cooking,” Yu says.Butter-doused crawfish at Crawfish & Noodles.\nPhoto by Wynn MyersCrawfish & NoodlesTie on a plastic bib and grab the nearest roll of paper towels—it’s about to get messy. The order at this sprawling restaurant with communal tables is the namesake ruby-red crawfish, boiled and doused in a butter sauce spiked with Cajun spices and garlic. Get them extra-spicy for the tear-inducing levels of cayenne; eat them without the optional latex gloves for the street cred. (“If you see someone wearing gloves, they either don’t know what they’re doing or they just got a manicure,” Yu says.) Take breaks to try chicken wings in a fish sauce–spiked glaze and a tower of cracker-crisp Gulf blue crabs, stir-fried and served whole with a pair of shell crackers.Pho ga at Pho Binh Bellaire.\nPhoto by Wynn MyersPho Binh BellaireIn a city where you can find an exceptional banh mi or a bowl of pho at every turn, this family-owned Vietnamese noodle joint stands out for its clean, restorative broths. Yu favors the fortifying yet light pho ga with plenty of dark- and white-meat chicken or its beef counterpart with brisket and crispy fat, which is rich with the heady scent of cinnamon and anise. “I’ll come here in the morning on my day off if I’m feeling the effects of a late night out,” Yu says. Dress your bowl with all the fresh accompanying toppings: crunchy bean sprouts,  sliced jalapeño, and torn fresh Thai basil, sawtooth leaves, and cilantro. Finish it all with a squeeze of bright lime.Brenda Loza of Nany's Hustle and the lamb tartare with flatbread.\nPhoto by Wynn MyersGet to Know MontroseIt’s no surprise Houston’s hippest neighborhood is also home to some of its best bites. Here are five places to hit.BlacksmithStart your day with an expertly pulled espresso at Blacksmith and a pastry from Morningstar, Blacksmith’s sister café, whose crazy creations (think black-and-white mochi doughnuts) have developed a cult following.La Guadalupana Bakery & CaféAll-day Mexican breakfast is the specialty at this longtime local favorite, where you can find chilaquiles and egg-chorizo tacos. Pair with the Vampiro, a layered elixir of carrot, beet, and orange juices.One FifthChef Chris Shepherd closed his popular Underbelly earlier this year (he’s opening steakhouse Georgia James in the space soon). In the meantime, Shepherd is keeping busy at One Fifth, his restaurant that will change concepts annually for five years. For its second iteration, One Fifth Romance Languages, Shepherd is playing with Italian, French, and Spanish cuisines, with blue crab chitarra and snails en croûte on the menu. This fall the flavors will become eastern Mediterranean.The House of Lancaster cocktail at Anvil Bar & Refuge.\nPhoto by Wynn MyersAnvil Bar & RefugeYou can’t tour Westheimer Road, Montrose’s main drag, without stopping by Anvil Bar & Refuge, Houston’s OG cocktail bar that opened in 2009. Its famous 100 List features a flawless version of nearly every classic drink imaginable from an Absinthe Frappe to a Zombie.West Alabama Ice HouseIf you’ve got a lazy afternoon to kill, head to the famed West Alabama Ice House and set up at a shaded picnic table with an icy Lone Star (it’s said they sell more than almost any bar in the entire state). At lunchtime, cross the street to the Tacos Tierra Caliente truck for barbacoa, lengua, and al pastor tacos to bring back with you to the bar.Lunch at Tacos Tierra Calienta.\nPhoto by Wynn MyersScore the Best Brunch in TownThe last place you’re trying to go after a night out is a bar. But the neon-lit Better Luck Tomorrow isn’t just a bar, it’s also home to one of the city’s most inventive brunches. The spaghetti sandwich—red sauce, noodles, and burrata griddled between pain de mie—is hangover-food gold.Drink Up On a Downtown Bar CrawlIf You Want Wine... Public Services Wine & WhiskyAt Public Services, Sommelier Justin Vann keeps it weird in a good way with a huge selection of natural wines you’d be hard-pressed to find elsewhere in town, plus dozens of sherries and Madeiras by the glass.Peter Jahnke of Tongue-Cut Sparrow.\nPhoto by Wynn MyersIf You Want Cocktails... Tongue-Cut SparrowTo find this speakeasy, look for the plain door in the back room of the Pastry War, a boisterous mezcal bar that’s worth its own visit. Behind the secret door and upstairs, dark wood and jazz standards mix with classic cocktails (try the rum-filled Swizzle).If You Want Beer... ConservatoryConservatory is the city’s first food hall. You can choose from more than 60 beers on tap, many from local breweries such as Saint Arnold, 8th Wonder, and Buffalo Bayou. Pair your brew with snacks from one of the hall’s pop-up food stands.Find the rest of our City Guides here.Explore Bon AppétitHoustonCity GuidesRestaurants + TravelTexasRead MorecultureWhat It's Like to Work at Franklin BBQ for 24 Hours StraightBy Alex DelanycultureWhat It Takes to Open the Next Big Barbecue Joint in TexasBy Mike SutterPhotography by Robert Jacob LermaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-22", "author": ["Condé Nast", "Christina Chaey"]}