{"id": "8625266c58386c8ffcc439dc9ff53dd3", "url": "https://www.bonappetit.com/story/kaleo-kanahele-maclay", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "How Paralympian Kaleo Kanahele Maclay Gets Through Training, Motherhood, and Running a Coffee Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Paralympian Kaleo Kanahele Maclay Gets Through Training, Motherhood, *and* Running a Coffee ShopIt all starts with gratitude, cinnamon cookies, and a whole lot of cold brew.By Ali FrancisJuly 13, 2021FacebookTwitterEmailPHOTOGRAPH BY RACHEL MAUCIERIFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Kaleo Kanahele Maclay, Paralympic volleyball player, coffee shop owner, and cookie decorator.“My coach always says, ‘You can have one sip of coffee if you take one sip of water,’” Kaleo Kanahele Maclay says, holding up a can of grapefruit seltzer in one hand and a cold brew with oat milk in the other. “I don’t know if you’d consider this water,” she cocks her head toward the pink can, “but it’ll be fine.” Maclay’s coach had tried cutting her off entirely, but she wouldn’t have it. “I was, like, “Well, that’s not gonna work; I will not be awake,” she says.It’s a humid day in downtown Oklahoma and I can see Maclay’s beverages condensing through the Zoom screen as she shows me a new green and yellow macramé piece on the apartment wall behind her. A short walk away, Maclay’s husband is churning out drinks at their coffee, bakery, and floral shop, Flour & Flower, which is where she’d be right now if she wasn’t talking to me. Running a business in and of itself would make a person busy, but the 25-year-old Maclay is also a mom and a cookie decorator and a setter for the U.S. sitting volleyball team, which she has been training with since she was 12. At the time we’re chatting, they’re currently gearing up for the Paralympic Games, starting August 24 in Tokyo.Off the court I learn that Maclay is every bit as optimistic and capable as her sport demands. “My mom raised me as though I didn’t have a disability,” she says. “I was born with a club foot and had surgery at eight months, but she didn’t want the focus to be on my limitations. So I grew up doing ballet, gymnastics, basketball, softball, volleyball—all the things.” Where volleyball is all competition, baking and cookie decorating is Maclay’s alone time. “I can listen to podcasts or audio books, have my personal space, and just lose myself in the task,” she says.Just before Maclay’s set to leave for Tokyo, she tells me how she deals with the pressure, why teamwork is everything, and which Trader Joe’s snack she’ll never leave home without.I started baking… right after the 2016 Rio Paralympic Games. I asked myself, What do I want to do, who do I want to be, when all of this is over? Growing up I always thought my sister was the artist and I was the athlete—that’s the box I put myself in. So I started experimenting with cookie decorating to rediscover my creative side.I fell in love with Hawaii’s coffee culture... while we were living there in 2019. My husband and I opened Flower & Flour back in Oklahoma City last October with a friend, to house everything we loved: pastries, coffee, and flowers. We signed our lease just before the pandemic, the games were postponed, and we only just opened in October. We didn’t have all the money we needed, but it was just about starting somewhere and doing what we could, where we were, with what we had.The menu is full of… nostalgic favorites. We have a raspberry jam bar, which I always ate after practice during high school. We also make a lot of scones and fresh croissants on the weekends; those are a real labor of love. I also make sure we always have something gluten-free because my mom has an autoimmune disease. She milks it so hard and is like, “You’ve got three muffins? Give them all to me, I can’t have anything else!”My day starts at 4:30 a.m.… when I head to the shop to bake whatever we need for the day. Then I’m back home around 6:30 a.m. to get my son, Duke, ready for school and hang out with my husband. (I love making avocado toast for breakfast; avocado all day!) By 8 a.m. I’m on the court training, and after lunch with the team, I’m back at the shop.My husband is such a good cook… so he usually makes dinner. We eat a lot of salmon, vegan tacos with cashew cheese, and Spam, rice, and eggs, which is a Hawaiian specialty. The other night he said, “When we retire, you’re cooking every meal.” And I was like, “Okay, we’ll just eat out every night; it’s cool!”The snack I’m definitely packing for Tokyo is… Trader Joe’s Speculoos Cookies—they’re so cinnamony and so good! Our team dietitian is all about balance; there’s no real sense of restriction.Being grateful takes the pressure off… before matches. I can have this tunnel vision, like, “I have to win.” Right before the game we line up as a team. I’m number 14, so I’m usually pretty close to the end. Seeing my team in front of me, and the court in the distance, helps me really appreciate being there—because I know it won’t last forever. When I can take that step back and see the broader view of what I’m doing, I remember that even if we don’t win it’s not the end of the world.Teamwork is central… to my life. Even if I don’t agree with my business partners all the time, we have this common goal for the coffee shop to succeed. It’s the same with volleyball, where we’re all on the same path trying to win gold, and in my family, where at the end of the day we just want one other to be happy. It’s all about finding common ground.Explore Bon AppétitPerson of InterestHealthyishprofileRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-13", "author": ["Condé Nast", "Ali Francis"]}