{"id": "8639ac258a754dffe544207e8dee7be9", "url": "https://www.bonappetit.com/recipe/chile-and-citrus-rubbed-chicken-with-potatoes", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Chile-and-Citrus-Rubbed Chicken with Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueChile-and-Citrus-Rubbed Chicken with PotatoesBy Katie Jackson, Nick Perkins, and Aaron CrowderMarch 19, 20194.7(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIt's never a bad move to cook chunks of potato underneath a chicken as it roasts. But here, we boil Yukon Golds and tear them into craggy pieces: It makes for tender, buttery pieces that can better soak up the tomatoey spiced pan sauce. Do be sure to let the chicken rest: Letting it sit for 45 minutes helps prevent the juices from running out of the meat as soon as you slice into it.Ingredients4 servings13½–4-lb. chickenKosher salt1Tbsp. coriander seeds1Tbsp. fennel seedsZest of 1 small orangeZest of 1 medium lemon¼cup extra-virgin olive oil1Tbsp. mild red pepper flakes (such as Aleppo-style, Maras, or Urfa)1Tbsp. smoked paprika¾cup low-sodium chicken broth or water½cup dry white wine1Tbsp. tomato paste4garlic cloves, crushed2lb. medium Yukon Gold potatoes, peeled2Tbsp. finely chopped parsleySpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Pat chicken dry with paper towels and season generously inside and out with salt. Tie legs together with kitchen twine. Place on a rimmed baking sheet and let sit 1 hour at room temperature.Step 2Preheat oven to 425°. Coarsely grind coriander and fennel seeds in spice mill or with mortar and pestle. Transfer to a small bowl and add orange zest, lemon zest, oil, red pepper flakes, and paprika; mix well. Pat chicken dry with paper towels, then rub all over with spiced oil.Step 3Whisk broth, wine, and tomato paste in a cast-iron skillet or 3-qt. enameled cast-iron baking dish to combine. Place chicken in the center and scatter garlic cloves around. Roast chicken, turning pan halfway through and adding an additional ¼ cup water if pan looks dry, until chicken is golden brown and an instant-read thermometer inserted into the thickest part of breast registers 155°, 50–60 minutes (temperature will climb to 160° as chicken rests). Transfer chicken to a cutting board and let rest 45 minutes.Step 4Meanwhile, strain liquid left in pan through a fine-mesh sieve into a heatproof measuring glass or small bowl; discard anything in sieve. Taste; season sauce with salt if needed. Set aside.Step 5Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until potatoes are fork-tender, 25–30 minutes. Drain and transfer potatoes back to pot.Step 6Cut potatoes into large pieces (or, if you can handle the heat, break up with your hands). Pour reserved sauce over potatoes. Add parsley, season with salt, and gently toss to combine.Step 7Place chicken on a platter and serve potatoes alongside.How would you rate Chile-and-Citrus-Rubbed Chicken with Potatoes?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleExcellent.  Only change was to use 2 game hens and cut roasting time down. Easy to cut them in half and serve. Sauce is outstanding\n AnonymousOrcas, WA3/8/2021Absolutely adored the flavors here. The scent of the citrus mingled with the fennel and coriander was heavenly. The potatoes tossed in the thick, tomatoey citrusy spicy sauce was perfect. The only negative was that some of the eaters love their chicken piping hot, so the 45 minute rest seemed excessive. Would definitely make again. Served with some sautéed mixed greens. Susan PohlHouston, TX1/9/2021Explore Bon AppétitChickenPoultryPotatoVegetableYukon Gold PotatoMainDairy-FreeGluten-FreeNut-FreeRoastHanukkahPassoverRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Katie Jackson", "Nick Perkins", "Aaron Crowder"]}