{"id": "8641363b944235c8af688a5ceba9c8d9", "url": "https://www.bonappetit.com/story/shrimpy-shrimp-risotto-recipe", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "The Shrimpiest Shrimp Risotto That Ever Shrimped | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Shrimpiest Shrimp Risotto That Ever ShrimpedNot for, uh, people who don’t like shrimp.By Emma WartzmanMarch 13, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiFacebookTwitterEmailThere is a difference between shrimp risotto and this shrimp risotto. Let me explain:  This one is better. Let me explain further: This one uses a simple shrimp stock to cook the arborio rice (as opposed to the usual water or chicken broth), which makes the whole situation extra shrimpy. Extra shrimpy sounds like an insult a bully would throw on an elementary school playground, but in reality it’s what happens when there’s not only shrimp mixed into risotto, but the flavor of shrimp imparted into every tender grain. Concentrated shrimp flavor, people.Now, shrimp stock may seem like a pain-in-the-butt process, but it’s not so bad. I did it this weekend! It takes time, as all stock does, but minimal effort. And once it’s finished, simmering away on the stovetop, the rest of the dish is a cinch to put together.The first step is finding head-and-shell-on shrimp, which is the base of the stock. You have to take the heads off and peel the shells off—but don’t throw them away like usual! That’s the good stuff. Get your hands a little dirty and never look back. The heads and shells go into a large saucepan over medium-high heat with olive oil until they turn a deep pink, almost-red color. Bonus: squish the heads down to let out their delectable inside juices (sorry).(Sidenote: When I made this, my grocery store didn’t have any head-and-shell-on shrimp, so I opted to buy extra pieces of shrimp and use only the still-attached tails. The risotto still turned out quite shrimpy, but get the whole darn shellfish if you can help it.)Once the heads and shells are cooked and the oil is warm and fragrant, build the rest of the stock in that same pan. This means 2 tablespoons tomato paste, cooked until starting to brown and ⅓ cup white wine, cooked until the alcohol evaporates. Then add in aromatics and spices, which are the usual suspects—an onion, one stalk of celery, a carrot, almost the entirety of a head of garlic, a few springs of thyme, and some whole black peppercorns—along with 8 cups of water. Bring that to a boil and then down to a simmer for an hour or so. It will definitely make your kitchen/apartment smell like a shrimp festival. You’ll love it! (And maybe burn some incense later.)While the stock is going, chop up another onion and four cloves of garlic (reserved from that head that went into the stock). Then do something else, like snack on leftover celery, because hopefully it didn’t take you an hour to chop an onion and some garlic, and because YOU CAN NEVER BUY JUST ONE STALK OF CELERY.There are actually other ways to use up your celery besides snacking.\nPhoto by Alex LauOnce the stock is finished, strain it through a fine mesh sieve and discard the solids, leaving behind fragrant, delicious shrimp stock. It can stay warm over low heat on the stove for however long you need (or make it ahead and keep it covered in the fridge).Start the risotto about a half an hour before you want to eat. First, sauté onion and garlic until translucent (you don’t want any color on there). Then add in the rice, stirring that around, too, until translucent. Some more wine comes next and then, finally, that super shrimpy stock. Add it in cup by cup as it absorbs into the rice, never letting go of the spoon. Constant stirring is a good time to practice deep breathing while also bulking up your arm muscles. By the end, 30-minutes-or-so later, the risotto should be loose, creamy, and saucy, but thick enough that you can see bottom of pot when stirring. If you run out of stock, use a bit of water until it reaches the right consistency. Stir in the shrimp and allow them to cook through fully, about two minutes.There are two mix-ins that come at the very end once the heat is off, taking this dish more over-the-top than even the shrimp stock could on its own. There is some butter, yes, as well as thick mascarpone that makes the whole thing not only rich, but creamy and tangy at the same damn time. Some lemon zest brightens the whole thing up and keeps the dish from feeling heavy.Serve with an extra dollop of mascarpone on top, some chopped chives, and lemon wedges for squeezing over. Maybe have some more celery for dessert.Get the recipe:Creamy Shrimp Risotto with MascarponeYou make a shrimp stock so that this decadent risotto (hello mascarpone) is bursting with shrimp flavor.View RecipeExplore Bon AppétitShrimpRisottoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Emma Wartzman"]}