{"id": "864d17947c5ed93c0d3f46bc0180eea4", "url": "https://www.bonappetit.com/recipe/chicken-drumsticks-with-savory-caramel", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Chicken Drumsticks with Savory Caramel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Chicken Drumsticks with Savory CaramelBy Chris MoroccoMay 22, 20184.1(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this grilled chicken recipe, cooking the legs over indirect heat gives them time to render fully and start to crisp so they won’t become gluey when glazed. Try this savory caramel glaze on whole fish or lamb kebabs.Ingredients4 servingsVegetable oil (for grill)4garlic cloves, finely grated1lemongrass stalk, top third trimmed, tough outer layers removed, finely grated½cup sugar¼cup unseasoned rice vinegar2tsp. crushed red pepper flakes2tsp. ground cumin1tsp. freshly ground black pepper3Tbsp. fish sauce12large chicken drumsticks (about 3 lb.)Kosher saltPreparationStep 1Prepare a grill for high indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side); oil grate. Bring garlic, lemongrass, sugar, vinegar, red pepper flakes, cumin, black pepper, and ½ cup water to a boil in a small saucepan, stirring occasionally, and cook until reduced to ½ cup, about 8 minutes. Let cool and stir in fish sauce. Transfer half of sauce to a small bowl and set aside for serving.Step 2Season chicken with salt. Place over indirect heat and cover grill with vent open (if you have one) and positioned over chicken. Grill, turning once or twice, until skin is browned and crisp and meat is nearly cooked through, 25–30 minutes. Uncover and move chicken to hotter part of grill. Continue to grill, turning often and basting with remaining sauce, until lacquered and lightly charred in places, 6–8 minutes longer. Serve with reserved sauce alongside.How would you rate Grilled Chicken Drumsticks with Savory Caramel?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI’ve made this 3 times, and we always enjoy it. I agree with cutting back cumin. RobMedSC9/29/2021Cumin is not a Vietnamese spice so leave it out or it would overpowering the others.  Lemon grass is the main authentic ingredient, in addition to garlic and red pepper flakes.  In Vietnam they used finely chopped fresh red pepper, which you can find in the Asian supermarkets as Thai's hot pepper.  AnonymousHouston TX6/28/2021This is easy and tasty..  We like the straightforward chicken flavor with the intense glaze layered on top. As others have pointed out the cumin is overwhelming. So I backed off that and added juice of half lime. Also reduced sugar by 3 T.  AnonymousAustin TX6/6/2020WOW - my partner and I ate these in no time. Super flavorful sauce that doesn't make sense on paper (to me, at least) but was so enjoyable. Spicy, salty, peppery - really interesting. My only complaint is the entire chicken isn't well seasoned if following the instructions to a 'T'. Next time I will brine the chicken for a bit then prepare. Looking forward to it. benjamin.powell.4742959Saint Louis, MO2/21/2019The cumin in this recipe overpowers all the other flavors, and it could have used some marinating time. The flavors were just on the surface, and didn't penetrate the meat. If I were to make it again, I would seriously cut down or omit the cumin. I will likely not make again, not a keeper.Michelle TrombettaMinneapolis, Minnesota11/1/2018Is there any added benefit to marinating it? Is it bad to do so?like2cookNorthern California8/21/2018I've used this recipe for both drumsticks and then on chicken wings. Hands down the fastest/easiest sauce to make and it tastes so good you don't feel like you've earned it. \nNaturemanpgAlbany New York8/15/2018Simple, easy, and absolutely delicious! Subbed soy sauce in place of fish sauce. Cooking varied due to indirect heat on a gas grill but man oh man, was it good! AnonymousRhode Island — USA 7/17/2018Very simple to prepare and great flavor. Easy to adjust the heat to taste, but definitely needs some heat in the balance of the sweet, sour, funky blend of ingredients. Took a little longer to cook than stated, but once the chicken was to temperature, the glazing, crisping part went quickly. Good choice for a summer crowd. Much more satisfying than goopy BBQ sauce.Val ZMirror Lake, New Hampshire6/23/2018I was a little worried about this recipe because you don't marinate the chicken, and I am so glad I tried it anyway. It tastes delicious, smalls delicious, and is really easy. My wife and I each ate three drumsticks in the blink of an eye. Definitely adding this recipe to my rotation. CzarKingKaiserNorthern Virginia6/21/2018No marinating?!\nJust Cook the chicken with only salt before basting? Sounds odd but just want to make sure before I try this as written and ruin my dinner Like2CookCalifornia6/5/2018Explore Bon AppétitVietnameseSoutheast AsianAsianChicken DrumstickChickenPoultryLemongrassHerbs & SpicesEasyWeeknight MealsMainNut-FreeGluten-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}