{"id": "866b7a6e37b44fe475cdf987a4943db9", "url": "https://www.bonappetit.com/story/this-spaghetti-pomodoro-recipe-is-a-pasta-master-class", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "This Spaghetti Pomodoro Recipe Is a Pasta Master Class | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Spaghetti Pomodoro Recipe Is a Pasta Master ClassIf you want to learn the ins and outs of making restaurant-worthy pasta at home, this beyond-simple weeknight recipe covers all the bases.By Amiel StanekSeptember 12, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailFor the first, oh, 25 years of my life, I thought that spaghetti pomodoro—or really any version of pasta with a vegetarian tomato sauce—was a Dumb Food. Capital D. Capital F. Nothing seemed quite as depressing as a bowl of mostly-stuck-together pasta with a pot of dumped-and-stirred store-bought marinara riding shotgun. To me, it epitomized Dinner as Disappointment, weeknight suburban ennui, post-collegiate despair, something that happened when eating was a problem to be solved rather than a joy to be captured. Hard pass.But at some point in my mid-twenties, everything changed. In the midst of a kitchen kick in which I became hellbent on revisiting dishes I'd previously turned my nose up at, I decided it was time to give the ol' spaghetti and red sauce thing another shot. And after cooking through a proper pasta pomodoro recipe—one like the latest Basically recipe—I realized that, if you follow all of the basic rules that separate mediocre pasta dishes from mind-blowing, groan-inducing ones, you end up with the kind of simple, eminently crave-able plate of pasta that one could gleefully eat once a week. Not only that, but that this basic recipe offers a perfect crash course in what makes good pasta, well, good. Allow me to explain.First of all, when you make sure to salt your pasta water aggressively, so it's almost seawater-salty, you guarantee that every single strand of spaghetti you cook in it will be seasoned through and through. You realize that pasta is more than just a starchy, flavorless vehicle for sauce—it's a delicious ingredient in its own right, and you can't taste it without salt. (Just remember to taste your pasta water before you dump the pasta in—the \"almost\" in \"almost seawater-salty\" is key.)And when you start with quality whole peeled canned tomatoes (the only canned tomatoes worth buying, IMHO, separate the solids from the juices, and let the tomatoes brown in plenty of garlicky olive oil, you concentrate their flavor, capitalizing on all of the natural umami that tomatoes have to offer. You get that this is what making a sauce is all about: using heat to caramelize ingredients, rendering them more complex and savory, and repeating the process to build overlapping layers of flavor.And when you pull the cooked pasta not when it's al dente, but actually a couple of minutes before it reaches al dente, you give yourself plenty of time to finish cooking the spaghetti in the sauce before it gets mushy. Also, instead of going through the unpleasant process of pouring a giant pot of boiling water and noodles into a colander sitting in your (probably dirty, TBH) sink, you use tongs to transfer the pasta directly from the boiling water to the Dutch oven that the sauce is cooking in along with a good splash of that starchy, salty, good-as-gold pasta water. Of all the steps, this is the one that makes the biggest difference, the thing that separates \"meh\" pasta from eyes-rolling-into-the-back-of-your-head pasta. Letting the noodles finish cooking in the sauce a) allows the starches in the pasta to thicken and enrich said sauce and b) ensures that every single strand is completely suffused with saucy flavor. It's not spaghetti with tomato sauce on top; it's spaghetti and tomato sauce, united to form an incorporated, beautiful whole.Granulated cheese, bit by bit.\nPhoto by Heidi's BridgeAnd when you use the right kind of Parm—the granulated kind, what you get pre-grated from the store or from using the weird pokey side of a box grater rather than a Microplane—and make sure to incorporate it into the sauce little by little, tossing the whole time, it will never clump up to form a weird mass in the pot. Instead, it will disappear seamlessly into the pasta, adding richness and aged cheese funk to the equation.And when you throw a couple of pats of butter into the pot just before you serve it...well, that's fairly self explanatory. Nobody every complained that their pasta was too glossy, did they?If any of the above is news to you, one bite will not only convince you of how good spaghetti with a dumb-simple homemade canned tomato sauce can be, but of how much better every pasta dish—be it a sausage, beans, and greens situation or a decadent vodka sauce—can be if you follow The Rules.So, yeah: I take back all the bad things I ever said about spaghetti pomodoro—but not one word about all of the sad, not-delicious versions that give it a bad name.Go ahead, see for yourself:Basically Spaghetti PomodoroAlmost as easy as opening a can of the store-bought stuff, and one hundred times more delicious.View RecipeExplore Bon AppétitBasicallyPastaSpaghettiCanned TomatoesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-12", "author": ["Condé Nast", "Amiel Stanek"]}