{"id": "866e9be484943d371eab78c58be718b7", "url": "https://www.bonappetit.com/story/how-to-make-lattice-pie-crust-photos", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Master the Lattice Pie Crust With This Step-by-Step Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaster the Lattice Pie Crust With This Step-by-Step GuideWeave your way to a classic lattice crust.By Christina ChaeyJuly 14, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailThis article on how to make a lattice pie crust was originally published in May 2015 in a slideshow format, but we’ve updated it for your summer pie baking needs in 2018.Venting and crimping the top crust of your pie doesn't just make it look beautiful; it also releases steam and keeps the filling sealed inside. And no venting style is more impressive than the lattice crust. For this strawberry-lemon lattice crust pie, author Alison Roman explains how to weave your way to success.Christopher TestaniStart with chilled dough from our Flakiest Pie Crust recipe. Working on a piece of parchment paper will make it easier to transport the lattice crust strips later on.Christopher TestaniA ruler will help you get perfectly even strips. We chose a beginner-friendly wide lattice for our Strawberry-Lemon Lattice Pie, but feel free to make your lattice strips as wide or thin as you'd like.Christopher TestaniSave the little rounded ends of dough—they come in handy if you need scraps to patch up one of the lattice strips.Christopher TestaniStart with the longest strips first, and work with one piece at a time rather than trying to arrange them all at once.Christopher TestaniUnder, over—it doesn't matter which order you go in, just don't be scared to get 'er in there.Christopher TestaniKeep going.Christopher TestaniYou want to work fairly quickly, as softer pie dough is much harder to work with. Each lattice strip should make contact with the edge of the crust—no need to get it perfect, as you'll fold all the edges in later.Christopher TestaniA simple fold-over crimp ensures none of those good pie juices will escape during the baking process.Christopher TestaniThose scraps you saved earlier? They'll come in handy if you need a patch-up or two while folding over your crust.Christopher Testaniif you want a cleaner look, you can always trim the edges of the crust before folding it in. But Roman prefers a more rustic, galette-style crust.Christopher TestaniA simple egg wash with a splash of water will get the top of your pie nice and golden.Christopher TestaniA sprinkle of turbinado sugar, granulated sugar, or demerara sugar gives you that crackly, sparkly look and crunchy texture.Christopher TestaniBake pie until crust is deep golden brown on top and bottom and juices are bubbling, about 1½ hours. This time is not a typo: That's how long it takes for the crust to perfectly brown and the fruit to properly thicken. There's an epidemic of underbaked pies in America. It's time to put an end to it!Christopher TestaniMost importantly, wait—at least 4 hours! This may seem like torture, but it's just the truth; the filling needs this time to properly set. If you can wait even longer, we firmly believe that pie is better the day after it's baked.Christopher TestaniGet the Recipe:Strawberry-Lemon Lattice PieBig fat strips of dough make for a rustic and modern-looking pie (and they’re easy to weave into a lattice). View Recipe1 / 61ChevronChevronApple-Cheddar PieView RecipeExplore Bon AppétitPieSummer DessertsPie CrustRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-14", "author": ["Condé Nast", "Christina Chaey"]}