{"id": "8673b9c1d201494117d7ceadbdaf3d1e", "url": "https://www.bonappetit.com/story/vegan-pasta-beans", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Creamy Vegan Pasta…and 9 Other Ways to Turn a Can of Beans Into Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCreamy Vegan Pasta…and 9 Other Ways to Turn a Can of Beans Into DinnerIt’s creamy, it’s beany, and you don't even have to break out a blender.By Sarah JampelFebruary 24, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat BoytsovaFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.I cannot tell a lie: Dried beans beat canned beans on taste, texture, variety, and appearance. But canned beans beat dried beans on convenience. And on any given weeknight, convenience is queen.Canned beans, though...they need our help. They need fat, flavor, and finesse. They need salt, spice, and substance.They don’t need to go to boot camp or start dopamine fasting, though: All that’s required to make canned beans resemble dried ones is a bit of care. When I take even a fraction of the time I would have spent soaking and boiling dried beans and donate it to my canned bean cause, I’m rewarded with improved texture (softer or crispier, depending on the circumstance) and taste (they taste...more like beans!).My Pantry Pasta with Vegan Cream Sauce recipe began as a challenge to coax out the best qualities from canned beans—white beans, in this case. By gently frying the cannellinis in garlic- and rosemary-infused olive oil, you build a foundation of great flavor. As the pasta cooks, you’ll fish out 1 cup of the pasta water, and add it to the beans. You’ll then mash up most of them in order to bring out their starches, which will thicken the pasta water into a creamy cream-free sauce. At this point, it pays to be gentle: If you’re familiar with puréed beans’ tendency to dry out (hello, hummus skin), you know that bean starch likes to get crusty. When you mash, do so with tenderness, not gusto, and make sure the pasta liquid doesn’t evaporate. Once the beans are mostly broken down, you’ll add the pasta, more pasta water, and cook, stirring, until the sauce clings to the noodles. It’s creamy, it’s beany, and you didn’t even have to break out a blender.But if you’re not in the mood for pasta, these nine other ideas will slip-slide a can of beans (plus some other stuff) into dinner. All of the following add something to the canned beans that they’re otherwise missing.Marinate them like you would olives or cheese. Sauté a sliced leek, shallot, or onion in plenty of oil. Add spices—mustard/fennel/cumin/coriander seeds in the oil, along with chile flakes and lemon peel—and cook until fragrant. Remove from heat and grate in garlic. Pour over any kind of drained and rinsed beans (or even cooked lentils). Let them hang out for 20 minutes or an hour or as long as you can handle. Add a squeeze of lemon juice or a splash of vinegar. Spoon over toast.Chana chaat a.k.a. the chaat treatment. I love how Priya Krishna distilled the essence of chaat—a huge category of Indian snacks—into a handy chaat formula that’s easy to apply and modify. I start by warming up canned chickpeas by pouring over boiling water from the kettle (this also helps to soften them!). As they hydrate, I’ll prep the toppings: cilantro- and lime-chutney (or your green sauce of choice), tamarind chutney (or date syrup or pomegranate molasses or kecap manis—something sour/tangy/barely sweet), finely chopped red onion, something crunchy (sev, Fritos), yogurt, and chaat masala. It all gets strewn atop the drained chickpeas. I’ve also added boiled fingerling potatoes, whatever leftover roasted vegetables are nudging me, and, in the summer (remember that?), chopped tomatoes.Confit them. Remember these slow-roasted vegetables from a couple of summers ago? I think about them a lot. You can either add beans or replace the vegetables with beans (I like chickpeas or white beans best). Essentially, you’re covering the beans with oil and adding all sorts of aromatics that will flavor that oil (and, consequently, the beans): sliced lemon/orange, curry leaves or bay leaves, garlic (smashed or halved heads), cracked peppercorns. I like to serve this over cooling yogurt, with pita for scooping.Stew them. Heat oil, add rosemary/garlic/chile. Add drained beans, stir them around, then add veg stock (or just water), Parm rinds, and chopped winter greens like mustard, escarole, kale, chard. Maybe a dried mushroom or two! Bring to a simmer and cook, covered, until broth is flavorful and beans are tender. Serve with lemon. While the beans are stewin’, I like to fry a piece of bread in olive oil, then rub it with a halved garlic clove. Spoon beans over the bread, which will absorb their liquid and become wonderfully soggy.Crisp them in the oven. Pat your chickpeas dry on kitchen towels, then season generously with salt, pepper, and olive oil and bake at 425° F, stirring frequently, until crispy. Sometimes I’ll get wild and add stuff like za’atar or harissa powder. I thought this only worked with chickpeas until Anna Stockwell showed me it could happen with white beans, too.Or pan-fry them on the stove. With enough oil and patience, your chickpeas can also get crispy on the stove. The beauty here is that once the beans are out of the pan, you can wilt down veg—torn kale, shredded brussels sprouts or cabbage, blanched and chopped RABE—in that same pan right after. My friend Ali Slagle also has a recipe where you brown butter in the pan once the chickpeas are crisp, then sort of baste them with all of the nutty goodness. It’s brilliant.Dip for dinner! (But if it’s not chickpeas, don’t call it hummus.)Refry them. Sauté an onion with smoked paprika and olive oil, coconut oil, or, if you’re Rick Martinez, bacon fat. Add a can of black or pinto beans (and the liquid too, if it tastes good—you’ll have to check to see!). Bring the liquid to a simmer, smashing as the beans soften. Your mixture will thicken. Spoon it into charred tortillas or tostadas. Top with fried eggs, tofu or tempeh crumbles, salsa, squeeze of lime, sliced avocado...Sandwich them. This recipe from Molly Baz pairs smashed chickpeas with harissa yogurt, a lemony dressing, and chopped celery and pepperoncini. If you don’t have those exact ingredients, do like Aliza Abarbanel and make sure you’re adding at least one ingredient from that’s briny/acidic, one that’s punchy/spicy, and one that’s creamy/rich when you’re smashing those chickpeas into a bread topper.I could go on, but there are beans to cook—and there’s your pantry to re-organize. How else are you going to fit all of those cans, huh?First, pasta:Pantry Pasta With Vegan Cream SauceMany vegan cream sauces rely on blended nuts or steamed cauliflower, but this sauce is made of beans and pasta water alone—no soaking or blending necessary. It’s important that the beans are adequately hydrated: Once you start mashing, make sure there’s plenty of pasta cooking liquid in the pot and don’t let it evaporate.View RecipeExplore Bon AppétitThe Not Depressing VegetarianWhite BeanCannellini BeanPastaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Sarah Jampel"]}