{"id": "86793638d2ecc4aee849fe8e081dca5f", "url": "https://www.bonappetit.com/story/trans-line-cook", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "I'm a Trans Line Cook: Here's What My Life Is Like | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat It's Like to be Queer, Trans, Black, and a Line CookI was tired of working in an industry that didn’t understand or respect who I was.By  Charlie AnderleMay 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery weekend around 3 p.m., I left my morning shift at a restaurant in Manhattan took the subway to a restaurant in Brooklyn, where I worked evenings. My back ached, and sweat pooled under my arms from the heat trapped in my coat. I tried to relax, anticipating the tension and pain that I dreaded taking root in my body the moment I arrived for my evening shift. My blood pressure rose, and the dry heat from the oven cracked the skin of my nostrils and made my nose bleed. Pimples bloomed across my face from the cortisol coursing through my veins. At night, I had nightmares about forgetting key ingredients in the tiramisu and woke up tangled in sheets, my arms and legs heavy with fatigue. My body was protesting—I knew this.I’m a 23-year-old trans person of color, and, until recently, I had two restaurant jobs and another cooking gig on the side. Cooking has been an important part of my daily life since I was a toddler at my mother’s hip. My relationship to food and its preparation has changed radically since I began working in the restaurant industry at 19. Today, I’m still immersed, and maybe a little obsessed.There was the prep cook's sleazy commentary on the fit of my new jeans and my manager's wandering hands reaching to the back of my thighs as he leaned in for a hug from his barstool.From my first day on the job as a line cook in Brooklyn, I felt self-conscious about the ways that I broke social codes. I didn’t spend half my paycheck at the bar, brag about lack of sleep, or come to work wasted. I declined the occasional offer of a bump of coke in the bathrooms. As a non-binary femme person, I was almost always the odd one out in the back of house. No one asked for my pronouns nor respected them once I’ve made clear that I go by “they” and “them.” It’s difficult enough to get through a shift while being constantly misgendered, but there was a minefield of other triggers to navigate. There was the prep cook's sleazy commentary on the fit of my new jeans and my manager's wandering hands reaching to the back of my thighs as he leaned in for a hug from his barstool. The attention was always given as praise; rejecting it labeled me as “overly sensitive” or “bitchy”—two judgements I’d been dodging through every male-dominated workplace I ever endured.The last gender-non-conforming person to work in this restaurant was fired shortly after the same manager had sex with them in a supply closet. Most of my cis male coworkers relay this incident as a funny piece of gossip, but, for me, it’s a disturbing reminder of my own vulnerability within the hierarchy of power that’s so deeply rooted in this industry.I learned that the only way to handle harassment at this job was to take a masculine-centered approach. As someone who is sometimes read as female and sometimes as male, on top of being racialized, I am an expert code-switcher. Hiding any emotion under a facade of cool, I’d invite someone outside with a cigarette as an excuse, and I explain nonchalantly as possible why it’s inappropriate and harmful to ask questions about my genitals, make jokes about rape, or promote racist stereotypes. (This approach only worked one-on-one; in front of an audience, masculine egos would tend to flare with embarrassment and give way to defensiveness, denial, and retaliation.)In my first months on the job, I formed a natural alliance with the few other queer-identified employees who work in front-of-house, and we kept an eye out for one another. But it became difficult to hold each other up when our attempts to affect change waned under the weight of continuous disappointments. A typical shift at my restaurant job started with prep. Each cook in the kitchen was responsible for ensuring that their station is well stocked with ingredients, hot foods are cooked or brought to temperature, and any utensils are readily available for a fast-paced service. We would often inherit the disorderly chaos left behind by our morning staff, and we were always expected to pick up the slack where they left it. Without a break in service between brunch and dinner, I would find myself—week after week—cleaning up after other people well into the dinner rush.Fortunately, my other job created a much more tolerable space for me in the restaurant industry. Lalito, a  loveable little restaurant in lower Manhattan, was like a different world. I got there early in the morning, downing an espresso to kickstart my double-shift days. Rubbing four or five hours of sleep from my eyes, I used the key I was given my first week to begin setting up before my coworkers arrive. I was hired by Gerardo Gonzalez, a queer chef of color with whom I worked side-by-side during brunches. Our professional relationship was both inspiring and intentionally nurturing. His mentorship and demonstration helped me learn more in my first week than in the three months that I had been cooking at the Brooklyn restaurant before I got this second job.Everything in this little kitchen was thoughtfully structured. Our mise en place was rich in colors and textures and arranged strategically for ease of access. Clipboards lined one wall of the kitchen with essential notes on what needed to be prepped, which deliveries to expect, and schedules of cooling temperatures for the walk-in refrigerator downstairs. It seemed we were able to juggle a hundred tasks at a time, moving with urgency and deliberation. It was dizzying and motivating. I was given responsibilities and independence, and this trust was empowering. It drove me to be more efficient and confident every shift I worked.From the day I started balancing these two jobs, I knew that I would take the first opportunity I had to leave my Brooklyn job. At Lalito, I felt sane for having better expectations of my work environment. I felt that “better” was in reach. The opportunity came not long ago, and I leapt.Like someone fleeing an abusive relationship, I felt conflicted about quitting my first job.All of these beliefs are challenged by the life-affirming, queer presence at Lalito where I’m now, thankfully, employed full-time.Here, we taste everything to assess freshness and quality while preparing for the day’s service. Between little mouthfuls of chips, house-made ricotta, olive oil cake, and ube french toast, we catch up on what’s giving us life outside work: music, news articles, personal projects, friends’ projects, ideas for future events and collaborations, and the latest on Black Twitter. During service, we move swiftly with a synchronized, choreographic grace. We commiserate with our front-of-house staff over bad tippers and racist customers. We trade coffees for nibbles from the kitchen. We demonstrate an awareness of the potential for our verbal and nonverbal communication to either disempower or to reinforce respect and personal agency when practiced with intention. No one is ever punished for their mistakes.Apart from the enduring patriarchal hold on the industry, things change quickly in the restaurant world. Coworkers come and go. Such is inevitably the case for us, too. Creating a queer/femme/trans-affirming space in the industry requires everyone involved—and particularly those in positions of power—to be uplifting us and recognizing our labor. It requires a commitment to hire employees who will amplify our efforts to empower the most marginalized amongst us.Queer spaces are few and far between in the industry, and they rely on close alliances to thrive. Working with chefs like Gonzalez and Devonn Francis of Yardy (the queer-owned, pop-up Jamaican food events company with whom I also work) has taught me to be creative about reclaiming space for myself and others like me in the industry. The ideals that Gonzalez inspired at Lalito allow us not only to create an equitable space as workers, but also to offer a unique and affirming experience for our guests. A few weeks ago, I met and had the pleasure of cooking for Kia Damon of Kia Cooks, a Black queer chef based in Tallahassee. We shared a moment at her table, and she told me about her choice nearly two years ago to leave the restaurant industry after enduring endless abuse in white, cis-hetero dominated kitchens. “I feel more safe and at home in this restaurant than I have felt anywhere before,” she told me. It’s in moments like these, when I’m itching to sign my angry letter to the industry, that I remember that my presence in the kitchen—queer, trans, Black, femme, anti-capitalist, and unapologetic—is the best shade of all.Explore Bon AppétitHealthyishChefsessayRead MorecultureHow a Women-Only Bathhouse Helped Me Find My Female SelfBy Meredith TalusanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-03", "author": ["Condé Nast", "Charlie Anderle"]}