{"id": "8690f817be805f0f2eb5a7aa0ff1b368", "url": "https://www.bonappetit.com/story/what-is-allspice", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "What Is Allspice? And What Can I Use if I Don’t Have Any? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAllspice Is the Berry—Yes, Berry—That Can Do It AllEnigmatic, warm, and versatile, allspice is a true triple threat.By Ali FrancisDecember 1, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.What is allspice? For starters: It’s versatile. It swings sweet and savory. It refuses to be put in a box (except literally, of course, to be mailed to your door). Whenever my pumpkin pies, pickling brines, soups, or braises need a little warmth and pizzazz, it’s enigmatic allspice that I reach for first.Moving beyond function and into form, the allspice we know and love is actually a berry. Also known as a Jamaica pepper, myrtle pepper, or pimento, allspice is the unripe fruit of the Pimenta dioica, an evergreen tree in the Myrtle family native to the West Indies, Southern Mexico, and Central America. Once dried, the fruits look like peppercorns but fresh and unripe, the green berries more closely resemble olives. As my colleague and food editor Shilpa Uskokovic explains, allspice is “picked unripe and then fermented and dried before being packaged and sold.”What allspice isn’t, despite the gotcha name, is a whole bunch of spices mixed together, says Caroline Schiff, pastry chef at Gage & Tollner, executive chef at Slow Up, and author of the cookbook The Sweet Side of Sourdough. “That’s a common misconception.”So, what’s the flavor of allspice?It makes sense that allspice is often mistaken for a blend like Chinese five-spice or pumpkin spice—because the flavor profile is multidimensional, featuring notes of cloves, nutmeg, star anise, fennel, black pepper, and cinnamon. It’s warming, with a peppery and savory backbone, says Schiff. “Like pumpkin spice’s cool, sophisticated cousin who subscribes to The Paris Review, drinks natural wine, and claims to have never been to Starbucks.” You know the one.How do I cook with allspice?Cooks around the world use allspice in both sweet and savory recipes, like “Jamaican jerk seasoning, Middle Eastern baharat, Swedish pickled herring, Mexican mole, Portuguese beef stew, and corned beef,” Uskokovic says. You’ll also notice traces of its characteristic complexity in aromatic liqueurs like Chartreuse and Bénédictine.In recipes that call for pumpkin spice, Schiff loves to use allspice instead—“I think it adds some more complexity,” she says—and she’ll often toast whole allspice berries in a dry pan before simmering in mulled cider or wine or infusing into milk and cream for ice cream. Uskokovic uses allspice most commonly in sweet recipes, adding “a fat pinch or two to a thick, glossy caramel sauce that’s good over ice cream, under a flan, or layered between rounds of cake.” Come summer, she cooks whole allspice berries with apricots, sugar, fresh ginger, and lemon “for a heady jam” that lasts her through the rest of the year.Allspice joins its friends cloves, cinnamon, and star anise in this warming-yet-tart cocktail.\nPeden + MunkAs a rule of thumb, the whole berries are most often deployed when a liquid is present: They’ll infuse brines, stock, warm drinks, gravy, soups, simple syrups, stews, and sauces. The ground spice is ideal for baking—add it straight to cookie doughs and cake batters—and wherever else the spice will be directly consumed, like marinades, spice rubs, and meatball mixtures. Either way, “adding allspice at the beginning of the cooking process maximizes its flavor release,” Uskokovic says. “And allspice almost always benefits from the application of heat (i.e., cooked in a custard rather than sprinkled on top of a pie).”Ready to experiment? Swoosh this Spiced Labneh under fried eggs, smear it on toast, or use it as a dip for crudités and pita bread. Make an allspice-spiked Amaro Cocktail and sip it until spring. Give your cold winter soul a warm hug via these Caribbean braised oxtails. Sip on hot Cashew Chilate (enjoy it with a slice of sweet Salvadoran Quesadilla). Brew a peppy Iced Café de Olla and pretend it’s summer. Double this batch of Palestinian Musakhan (your future self will thank you). And, of course, classic apple pie is a no-brainer.Should I buy ground or whole allspice berries?According to Schiff, don’t bother with the pre-ground stuff. “It has a fraction of the flavor as the whole berry,” she says. Like coffee, ground allspice will lose potency and freshness over time, which is why it’s always best to buy whole berries and process them in an electric spice grinder as needed. This is the case for all spices, but it’s “doubly true for allspice,” adds Uskokovic, “which most of us may not be using as frequently.” In other words: Be careful not to grind more than you can use or it’ll go stale. Lucky for us, whole allspice berries are available at the click of your mouse:Whole Allspice$5.68 at SpicewallaWhat can I substitute if I don’t have allspice on hand?Allspice is enigmatic, warm, and versatile—one of a kind, really. Irreplaceable. But if you’re in a bind, you can make a knock-off spice blend using an equal mix of ground clove, ground cinnamon, and ground nutmeg, Uskokovic says.All in on AllspiceCharred Cabbage and CarrotsCabbage deserves more credit—char it, braise it, spice it, and turn it into the best thing on the table with a little help from a maple-lime dressing.View RecipeExplore Bon AppétitcookingAllspiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-01", "author": ["Condé Nast", "Ali Francis"]}