{"id": "8691114451115146a6ab57ffb553230e", "url": "https://www.bonappetit.com/recipe/coconut-harissa-meatballs", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Coconut-Harissa Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueCoconut-Harissa MeatballsBy Sahara BohoskeyNovember 23, 20214.7(43)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintIn this hearty weeknight meal from recipe developer Sahara Henry Bohoskey, juicy pork meatballs get seared in a skillet, then simmered in a rich sauce of coconut milk and harissa. Henry Bohoskey’s preferred harissa is New York Shuk brand—it’s thick, punchy, and just spicy enough—but for bonus points go ahead and make your own. We like these saucy meatballs over mashed white beans, but they’re also good with polenta or orzo.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonWooden Spoon$6 At AmazonCan Opener$14 At AmazonSieve$18 At AmazonIngredients4 Servings2medium shallots4garlic cloves1tsp. garam masala½cup finely chopped cilantro, plus leaves for serving2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided, plus moreFreshly ground black pepper1lb. ground pork1Tbsp. plus ¼ cup refined coconut oil, room temperature⅓cup harissa paste113.5-oz. can unsweetened coconut milk215-oz. cans white beans, rinsed½tsp. sumac, plus more for servingPreparationStep 1Finely chop shallots and garlic. Combine garam masala, half of the shallots, half of the garlic, ½ cup cilantro, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a large bowl; season with pepper. Add pork and mix gently until just combined. Divide into 12 pieces and roll into balls.Step 2Heat 1 Tbsp. oil in a large skillet over medium-high. Cook meatballs, turning occasionally, until browned in spots, 5–8 minutes. Transfer to a plate.Step 3Reduce heat to medium; cook remaining shallots and garlic in skillet, stirring often, until garlic is softened, about 2 minutes. Stir in harissa paste, coconut milk, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; season with pepper. Bring to a simmer, reduce heat to medium-low, and cook until slightly thickened, 6–8 minutes.Step 4Nestle meatballs into sauce; cover and cook 10 minutes. Turn meatballs over; cook, uncovered, occasionally spooning sauce over, until sauce is about the consistency of marinara, 8–10 minutes.Step 5Meanwhile, heat remaining ¼ cup oil in a medium saucepan over medium-high. Add beans and ½ tsp. sumac; season with salt and pepper. Cook, stirring and mashing beans and adding up to ¼ cup water a little at a time to loosen if needed, until heated through and almost completely mashed, about 3 minutes.Step 6Divide beans among plates; top with meatballs and sauce. Scatter cilantro leaves and sumac over.How would you rate Coconut-Harissa Meatballs?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleThe base of this recipe is great, but it definitely needs a few tweaks! The meatballs as written were a bit bland, so we upped the salt, pepper, and garam masala quite a lot. We also added an egg and a scoop of yogurt to moisten them up and bind them together properly. I might add fresh breadcrumbs next time, too. The sauce was so simple that I didn't think it would work, but it did! Since the harissa is such a major part of the sauce, the one you choose can make a huge difference here. We used New York Shuk which is complex but pretty mild in heat, and also added a little bit of tomato paste for umami. We served the meatballs over polenta instead of beans. For a healthier version, I think it would work nicely with sautéed kale!lasagnaqueenPortland, Oregon3/15/2022This meal is hearty and warm for a winter night but it was really spicy! I used 1/4 cup Trader Joe’s harissa paste and had to tame down the heat with Greek yogurt. I would like to try it again with less heat so I could taste the flavors of the meatballs. I really liked the mashed beans as a base.Angela ACCentral Coast, CA3/1/2022Like another reviewer mentioned, the sauce was super oily. I would reduce the oil, and drain in between the meatballs and veggies. I also listened to another reviewer and upped the seasoning in the meatballs themselves. AmySeattle, WA1/25/2022Loved this recipe! The flavors in the harissa sauce were bold and flavorful but not over powering. Especially like the mashed beans with the sauce.Cherie FarrellDanville, CA1/6/2022I had high hopes for this one given the reviews but it was just ok to me. The coconut-harissa sauce was different, but not in a good way. The flavor profile seemed almost overpowered by the sumac. The meatballs themselves lacked flavor. Maybe I needed to punch up the garam masala or add chilies, but something was missing. Not a bad meal but not something I would ever make again. Shane New York, NY1/3/2022Warm, fiery, and filling! Perfect on a freezing winter night. Trader Joe’s harissa did the job, but I imagine it is milder in flavor than other brands. I substituted ground pork for turkey, and even with a leaner meat the dish was a bit too rich, so I cut it with acid (fresh lime) like other reviews mention. AnonymousSeattle 12/30/2021Echoing other comments, I suspect the brand of harissa makes a big difference. Cooks should add two-thirds at first and adjust accordingly. We were fine with the heat but felt it lacked bright notes, so added a tsp of sumac to the sauce. I also upped the garlic and garam masala in the meatballs 50%. We did one can of beans (with the full compliment of spicing) and added rice as a side. Meatballs were with ground turkey and a 1/4 cup of panko to help with texture. Eric WDurham, NC12/25/2021Loved this recipe so much.. tweaked it a little, added extra sumac and a grated garlic clove to the beans because they were tasting a little bland.  Also added a couple of tablespoons of ketchup to the sauce at the very end after tasting and realizing I was looking for a little more acid and didn’t have any tomato paste— the harissa I used could be the reason for that, every brand I’ve ever tried has been so different from the last.  Can’t wait to make it again and add some vegetables.. I’m thinking spinach or peas AnonymousBrooklyn, NY12/18/2021Did anyone else have trouble with excess oil? I only could find Harissa sauce, not paste, but, it seems like the coconut oil is the true culprit. Now I'm skimming oil and will try to freeze some and remove from sauce. (Harissa sauce from TJs has olive oil in it- )and the color is nothing as deep as this recipe- hummmm? will try to find a paste or lower the coconut oil by a LOT.\nAnonymousSanta Monica CA12/11/2021This was delicious, but the brand of harissa must make a huge difference in the color of the sauce! Mine turned out quite beige/pinkish in the end so I was surprised at the bright-red color in the photo. Love the beans as a more interesting serving option than plain rice or pasta.Anonymous12/8/2021Flavorful, filling, fabulous! Every element (sauce, meatballs, beans) of this dish would taste great made separately - combine it all - delicious. In a pinch, I had to use ground beef but still tasty. Looking forward to eating the leftovers! Anonymous12/7/2021This is a great recipe with tons of flavor! It's nice to have a healthy base that isn't cauliflower. Easy to make this with pork or even with the Beyond meat substitute. I added mushrooms to the simmer and it was great. Also, if you can find a mild harissa it's nicer for those who can't handle as much spice. Would make this again for sure!BetsyDallas, TX12/6/2021Wow, amazing! \n\nI made minor tweaks but this is pretty perfect. I used 1lb ground beef, 1 lb ground turkey, onion instead shallots, 1 tbsp garam masala, 2 tbsps harrisa spice, instead of paste and 2 cans of coconut milk. Just because I was working with what was in my house. I also served it over buttery, smoky rice instead of beans!\n\nMy in-laws raved and my father in-law usually doesn't like \"fancy\" flavors.  Nika SMontana12/1/2021I'm so thankful for this cozy, cold weather recipe (especially the day after getting home from Thanksgiving with my little cousins' cold). I used it as a guide and raided the freezer and pantry- subbed ground lamb and wagyu for the pork and ranchero sauce for the harissa. Sautéed sliced red peppers and cabbage before adding the coconut milk and served it over yellow peas. My sweetheart says, \"better write that one down!\" Thanks for a excellent inspo!LeahNantucket, Massachusetts11/30/2021Anything I can substitute sumac for? Can't seem to find it in the store around here. \nmahalogleekailua, HI11/30/2021Explore Bon AppétitMeatballHarissaCondiments, Sauces & PastesCoconutFruitWeeknightEasyDinnerGround PorkPorkMeatCoconut MilkOther IngredientsGluten FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Sahara Bohoskey"]}