{"id": "86985190474adf516ed1f9c2a355856b", "url": "https://www.bonappetit.com/story/these-vegan-mushroom-tacos-are-the-only-recipe-i-make-every-week", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "These (Vegan) Mushroom Tacos Are the Only Recipe I Make Every Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese (Vegan) Mushroom Tacos Are the Only Recipe I Make Every WeekWhen life is chaotic, your tacos should be simple.By Shilpa UskokovicOctober 20, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’ve always wanted to be the person who plots their meals meticulously, with particular days for pizza, roast chicken, and meatless dinners. Instead, I’m the sort that runs to the store twice in one hour because I forgot the lemons the first time, and I rarely eat the same meal with any degree of frequency. There is, however, a beacon of strict order among all of this chaos—a biweekly taco night, never to be missed and always fervently anticipated.Lately, the Adobo Mushroom Tacos from Edgar Castrejón’s book Provecho: 100 Vegan Mexican Recipes to Celebrate Culture and Community are my taco night go-to. With toasty tortillas wrapped around crispy-chewy, spicy-sweet mushrooms and piles of toppings of your choice, no two tacos are ever the same. They taste smashing, yes, but even more compelling is how dead easy they are to make. Step 1: Toss mushrooms—any kind!—with Castrejón’s adobo spice blend, a splash of lime juice, and oil. Step 2: Roast them in a hot oven until crisp. Step 3: Gather your cadre of toppings, like sour cream, salsa, cilantro, and/or hot sauce. Step 4: Eat tacos; live your best life. That’s it. That’s the recipe!Provecho$32 $22 at AmazonUsing a mix of mushrooms makes for the most interesting flavor with a variety of textures. Aim to have at least one frilly, fluted type, such as chanterelle (the author’s favorite), maitake, or oyster, and one meatier kind, like crimini or king trumpet, which will retain their heft. Then tear them by hand so that the irregular pieces get crisp around the edges in the heat of the oven. I usually double the mushrooms because they’re good for so many meals. I’ll scoop leftovers over ricotta toast the next morning, build a giant lasagna, or tuck a spoonful into a grilled cheese. (When scaling up, I split the mushrooms over two baking sheets for the most even cooking.)If you’re a meat eater, you won’t miss it here. Throughout his book, Castrejón sets out to make delicious, satisfying recipes that pay homage to the flavors and traditions of Mexican and Latin cooking and just so happen to be plant-based. There’s a bold coliflor asada, an ingenious coconut aguachile, and jackfruit tinga tostadas, the first vegan dish Castrejón debuted to his family. By taking away the animal protein, a dish might become a distillation of pure flavor and technique. Or, as is the case of these mushroom tacos, it might become simple enough to persevere in my weekly meal rotation, against all odds.Get the recipe:Adobo Mushroom TacosMeaty mushrooms get spiced to perfection and roasted until crisp before they're tucked into warm corn tortillas.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-20", "author": ["Condé Nast", "Shilpa Uskokovic"]}