{"id": "86b252dcce0a0a46b7b1527d64eece5d", "url": "https://www.bonappetit.com/story/drinking-guide-super-bowl-sunday", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "A Play-By-Play Guide to Drinking on Super Bowl Sunday | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Play-By-Play Guide to Drinking on Super Bowl SundayMake Monday's hangover worth it.By Alex DelanyFebruary 2, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThe Super Bowl is the holiest of beer-drinking holidays, and it should be respected as such. This is not the night to explore vintage port. Tell Sarah to leave her amaro at home, and when Brian asks for the corkscrew, tell him it’s in the backyard…somewhere. Fine, you can drink other booze (I’m not a totalitarian.), but in my eyes, nothing beats the low-alcohol, sip-on-repeat, “Grab-me-one-while-you’re-up!” quality that can only come from beer. So...how do you drink it to maximize pleasure on such an important day?Glad you asked. I have some thoughts, which I have conveniently compiled into the Delany’s All-Day Drinking Guide for Your Super Bowl Sunday Football Extravaganza. Not the most streamlined name, but that’s what we're going with. You can take it or leave it. I’m here to make some suggestions, not tell you how to live your life.Making an Ass of U and MeFirst, I’m going to assume a couple things. I’m assuming that you’re hosting a Super Bowl party (or hanging out with at least one other person to watch the game). I’m assuming that you’ll be preparing food and consuming alcohol, and I’m assuming that you have access to public transportation, a ride sharing app, or a designated driver to get home (if you’re not at your place). Drinking and driving is not cool. Please, never do it.Bob Armstrong queso dip should be involved in your day.\nLaura MurrayRise and Shine, Ya Freaks!You wake up. It’s Super Bowl Sunday. Birds are singing. The sun is shining. Nonsensical, misleading, deeply insecure tweets are being blurted out by our president. You should start the day like any other: Eat breakfast. Brush your teeth. Look at your to-do list. If you have a lot of queso prep to finish before kickoff, get the annoying small stuff out of the way (read: use sharp knives to chop things before you start drinking). Safety first.You are either the kind of person who a) remains sober while preparing food or b) drinks while preparing food. If you are the former, much respect. If you are the latter, welcome back. The bottle opener is hanging on the fridge.Start with something light and American. I’m not the kind of dogmatic craft beer evangelist that preaches the CRAFT BEER ONLY, BRO lifestyle. Elongated drinking days turn out best when you mix highs and lows, quality craft brews and easy-drinking macro lagers. A water-like High Life is the perfect company for the shreds of cheese, slices of avocado, and tortilla chip crumbs you will be “taste-testing” before people show up.Pork sandwich prep happens in the AM, so you can eat in the PM.\nPhoto by Chelsie Craig, Styling by Claire SaffitzMeet My Friend, the Chore BeerDrink casually throughout the afternoon, as you get your place ready for other human beings. Keep these beers under 5% ABV. I call these Chore Beers. Not because it’s a chore to drink them, but because they help with the chores. They boost morale, while accomplishing the not-so-amazing parts of hosting a party. What makes vacuuming more fun? A Chore Beer. What helps with putting the dishes away? Another Chore Beer. What facilitates putting all the shoes thrown haphazardly across the floor, as if to purposely trip potential intruders, back onto the shoe rack? Yup. Chore Beer.The chores and the Chore Beers that accompany them are finished. The wings are marinating. The pork is in the slow cooker. The dips have been made and emptied into their respective dip bowls. The food is in good shape. Your buzz is in good shape. Everything is in good shape.Get that cooler ready. Your friends are thirsty.\nAlex LauLooks Like Those People You Invited Showed UpThe game starts at 6:30, but that person in your life who always shows up 15 minutes early, shows up 15 minutes early. No surprise there. You have a drinking partner now. This is your final Chore Beer. As the rest of your guests pile in, ask where they can hang Eagles or Patriots coats, establish couch territories, and make sure everyone who needs a beer gets one.People will bring booze. Because you asked them to. Remember, any good party has a surplus of alcohol. Jill, bring a six pack of IPAs. Jason, bring a couple bombers of stout. Jenna, bring some of that saison we had at your cousin’s 30th birthday that one time. Hmm. All your friends have names that start with J’s? That’s weird. Once everyone has arrived, start to ask if people want to open some of the craft stuff. Fill glasses, toss cans, and get everyone what they need.Get your game beer ready before you’re settled in on the couch.\nPhoto by Matt HaasI Pledge Allegiance to the BeerAt some point in the night, you need to consume a beer from the geographical region of the team you support. Welcome to football superstition 101. If you’re an Eagles supporter, maybe a barrel-aged saison from Fermentery Form or an everyday Prima Pils from Victory Brewing. If, for whatever reason, you happen to be a Patriots fan, downing 16 oz. cans of Narragansett Lagers or sipping a dry-hopped New England style IPA from Bissell Brothers are both acceptable moves.Did You Win the Coin Toss? Doesn’t Matter. The Game Is Starting Either Way.The first half of the game should be a mix of higher ABV brews you want to try, balanced with the lighter American lagers you were crushing earlier. Oh, and maybe some water. You don’t want to go pedal to the metal and rip four double IPAs in the first quarter. That’s not a good look.Keeping a steady buzz is the best way to drink through the first half. Don’t let your emotions get the best of you. Keep a steady pace of about 2-3 beers-per-quarter for the first two quarters. Does this sound like a lot to you? Fine. Drink less. You don’t want to be the person who’s drinking because you’re sad. And you don’t want to be the person who ends up being too drunk to actually appreciate a win. This is the first half. Your team can still turn it around or squander a lead. There’s so much football left to play, and there’s still so much beer to drink. This should be a gradual, comfortable climb into drunkenness.It also goes without saying that you’ll be eating throughout the first half. Super Bowl food has a tendency to fall on the fattier, cheesier, saucier side of the food spectrum, so beers with a lighter body, higher acid content, or fruitier flavors are good choices. Salty, tart goses, fruited Berliner Weisses, dry-hopped pilsners, and Belgian saisons are all good choices to keep the brew lineup interesting and food-friendly rolling into halftime.Buffalo popcorn. Just saying.\nJarren VinkThe Halftime Show ComethAh yes. Halftime. Even when the halftime show is good, it’s not really good. It’s a stunt to retain viewers. I’m sorry if you love the halftime show, but these are the facts. I don’t even know who’s performing this year, and I’m certainly not going to look it up for the sake of this article. You’re blessed with a short period of time where your eyes don’t need to be glued to the screen. Use it wisely. Get off the couch. Take some friends to the backyard to “take the edge off,” if you’re into the great outdoors. Admire the saison in your glass. Maybe even bop your head to the surprisingly catchy pop music coming from inside.If there aren't any wings at your party, it's not really a party.\nAlex LauSecond Half StrategeryWe’re back! Football! Beer! Yes! The third quarter of the game is our metaphorical bridge. We’re crossing over into the Realm of Intensity. The beers you drink are going down more and more smoothly. There’s an underlying aura of excitement surrounding you. Wait. That might actually be anxiety. Shit. Yeah, it’s anxiety. Football is stressful. Regardless, the third quarter is your escalation. And then, the fourth quarter hits.This is your emotional epicenter. The beginning of the fourth quarter is where the game becomes real, and if you’ve timed your drinking right (which you have, because we’ve been doing this together), it’s also where alcohol’s effect on the human body becomes real.Alex LauLooks Like We Made ItRide that vibe throughout the fourth quarter. Cheer. Yell. Scream. Cry. Laugh. Think about the good times and the bad times, the nail-biting and the joyous. If you’re a fan of either the Pats or the Eagles, this is the time to appreciate the fact that your team made it this far. Remove yourself from the game for a second and enjoy the experience. Taste the beer you're drinking, whatever it may be. Breathe. Then get right back in there, because someone just won. The Super Bowl is over. There is a new world champion.Maybe Have Some WaterIf your team lost, I’d probably stop drinking. You don’t need that hangover to intensify, on top of the end-of-season depression. You’ll be better off if you call it quits. There's work tomorrow—and a small city’s worth of dishes in the sink.If your team won, have another drink. Celebrate with the players on the screen. You’re practically there! They’d probably be friends with you if you ever met! You could say things like, “Hey bud, want to go have a catch?” And they’d be like, “Oh, for sure, pal. You’re basically family.” Congrats. You won a Super Bowl. You had an amazing party. This is a truly great night that your friends will remember fondly.If you take one thing away from this long-winded, mostly trivial guide, let it be this: The purpose of Super Bowl drinking is not to have the most mind-blowing, flavor-enhanced, thought-provoking drinking night of your life. The purpose of drinking during the Super Bowl is to enjoy the Super Bowl. And to know that Monday’s hangover was absolutely worth it.LET’S. GO. BIRDS.If you make these roast pork sandwiches, people definitely won't be upset:Slow-Cooker Roast Pork SandwichesThis slow-cooker version of the Philly classic has all the makings of a great sandwich: sharp provolone, garlicky broccoli rabe, and lots of jus from the pork for dipping.View RecipeExplore Bon AppétitBeerSuper BowlPartiesEntertainingAlcohol & Other DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-02", "author": ["Condé Nast", "Alex Delany"]}