{"id": "86b4fa4c35a0ba539ad30d8adbb5510c", "url": "https://www.bonappetit.com/story/euphoria-cocktails", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "We Try Kin Euphorics and How to REALLY Get the Glow | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Try 'Euphoria Cocktails,' and How to REALLY Get the GlowProduct reviews, recipe recommendations, and other thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroDecember 6, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,A couple days ago, Healthyish editorial assistant Aliza Abarbanel and I tried our first-ever “euphoric” beverage courtesy of Kin Euphorics, a new company promising to bring us “the future of revelry.” Kin’s first product is called a social tonic, which sounds like your grandma’s word for her before-dinner G&T, but there’s no alcohol in this (very pretty) bottle. Instead Kin is supposed to give you all the nice effects of booze (relaxation, friendliness) and none of the bad (hangovers), thanks to something called “nootropics,” which as far as I can tell are what Bradley Cooper took in Limitless to make him Superman. The drink tasted like grapefruit pith and licorice and made me feel extremely...alert, but I couldn’t tell if that was the noots (can I call them that?) or the, uh, caffeine.Reads of the WeekI loved editing Khushbu Shah’s story on how Indian food and culture got co-opted and turned into a health trend. Like many things in this weird wellness world, one woman is at the root of it—and she seems well aware of her über-influencer status.Emily Schildt’s piece on how “glowing” is an anti-feminist trap is a cheery one too: “If wellness is to 2018 what “having it all” was to the ’80s,” she writes, “then glowing is the modern equivalent of showing up to the potluck with a perfect perm, two well-behaved children, and a croquembouche.” (If you’re wondering where my glow comes from, it’s French fry grease.)Make This StatSpeaking of croquembouche, I think food editor Molly Baz is actually making one for tonight’s BA cookbook club featuring Martha Stewart’s Entertaining. Tune in to the BA Instagram Story to see how it turns out. For the record, I chose to make the carrot loaf for its health (all those carrots) and its -ish (two sticks of butter). Martha calls it a “firm, slightly dense loaf that is an excellent base for open-face hors d'oeuvres (it doesn’t crumble),” and now I can’t stop wondering what food you’d possibly serve on top of carrot bread.  Martha, if you're reading this, ENLIGHTEN ME!Last night was full of cooking wins and losses. A win was that I made kimchi udon for the first time, and it was as good as everyone says. A loss was that I took off a piece of my thumb with a mandoline while making quick pickles. A win was that my roommate decided to bake chocolate chip cookies. A loss was that our electric beaters gave out partway through. A win was cookie dough.The 5-Star ReviewI drizzle all day, whether it’s honey on my a.m. toast or sesame oil on my lunchtime noodle bowl. So when Laka Living came out with a pretty line of condiments called Drips, I put aside my post-nasal associations and gave them a try. Totally delicious and somehow totally unsweetened, the cookie drip is great on oatmeal or yogurt, and I was tickled to discover that the chocolate pearl drip turns into a magic shell on ice cream thanks to the coconut oil, which hardens when it gets cold. The drips are infused with adaptogens and said to boost stamina and combat stress, but TBH I’d be drizzling either way.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterRead MoreLifestyleThe Soup That Saved Me and an Epic Thanksgiving TartBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Amanda Shapiro"]}