{"id": "86b94155203ab8660ed37624f773d7c9", "url": "https://www.bonappetit.com/recipe/cantaloupe-with-sugar-snap-peas-and-ricotta-salata", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Cantaloupe with Peas and Ricotta Salata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueCantaloupe with Sugar Snap Peas and Ricotta SalataBy Anna StockwellMay 21, 20194.4(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintSalty and sweet, crunchy and juicy, this throw-it-together summer side has it all. It's also one of the only instances where you should seek out a slightly underripe cantaloupe: Firmer flesh means it will be easier to slice into ribbons.Ingredients4–6 servings ½small cantaloupe or Honey Kiss melon (about 1½ lb.)8oz. sugar snap peas, strings removed, thinly sliced on a diagonal8oz. ricotta salata (salted dry ricotta), thinly sliced into strips with a vegetable peeler or mandoline3Tbsp. tarragon leavesExtra-virgin olive oil, lemon wedges, flaky sea salt, and Aleppo-style pepper (for serving)PreparationStep 1Scoop out seeds from melon half and place, cut side down, on a cutting board and remove rind by slicing down along the curve of the melon with a sharp knife, rotating as you go. Cut in half again, then very thinly slice the flat side of each piece on a mandoline (to make half-moons) or use a vegetable peeler to make ribbons.Step 2Toss melon, peas, ricotta, and tarragon on a platter. Drizzle with some oil, squeeze some lemon juice over, and sprinkle with salt and Aleppo-style pepper.How would you rate Cantaloupe with Sugar Snap Peas and Ricotta Salata?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis spectacular salad was simple to prepare but packed complex, layered, flavor. It’s earned a spot in my regular rotation. The cantaloupe makes it appropriate for breakfast as well as lunch or dinner. Make sure you taste your snap peas, because if they’re not flavorful, the whole dish falls apart. I added a dash of paprika and highly recommend. I would give six stars if I could!     EdithProvidence, Rhode Island 3/26/2022I wish your recipes included nutrition information.Anonymous5/27/2021I found this to taste much like fruity cottage cheese with salt and vegetables on top. In my opinion cantaloupe is too sweet a fruit for this preparation. Also, Aleppo pepper was SO hard to find and IMO could have easily been replaced with paprika or crushed red pepper. AnonymousMountain View CA7/2/2019This was a beautiful salad and it was very fresh and tasty.  However, it took a lot of chopping prep.  We couldn’t find the ricotta salada and used Parmesan pecorino which worked just fine.  The Aleppo-style pepper was more of a decorative item which is also hard to find.  You could substitute papr ika.puzzledMinnesota6/30/2019Made this salad for my Memorial Day BBQ.  It was very good. Make sure to mix the aleppo pepper, flake salt, lemon and tarragon on to appreciate the full flavor profile.  It was a hit.  Can’t wait to try the other melon salad recipes from Bon Appetit!AnonymousNew York suburbs 5/27/2019Explore Bon AppétitSaladCantaloupeMelonFruitSugar Snap PeaPeaVegetableRicotta SalataRicottaCheeseSummerQuickEasyWeeknight MealsSideGluten-FreeNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}