{"id": "86c8f815927c2dce0c733e575a97a42c", "url": "https://www.bonappetit.com/story/nancy-meyers-loves-ina-gartens-sun-dried-tomato-dip", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Nancy Meyers Won’t Throw a Party Without Ina Garten’s Sun-Dried Tomato Dip | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNancy Meyers Won’t Throw a Party Without Ina Garten’s Sun-Dried Tomato DipThe director-screenwriter-producer on her decades-long love affair with Ina Garten’s first cookbook.By Nancy MeyersNovember 1, 2018FacebookTwitterEmailFacebookTwitterEmailIn honor of Ina Garten's guest editing week, we asked chefs and celebrity fans to share their favorite Barefoot Contessa recipes as part of our series “How Easy Is That?” Below, director-screenwriter-producer Nancy Meyers waxes poetic about the sun-dried tomato dip she’ll never host without. \n Choosing my all-time favorite Ina Garten recipe is not easy. I have almost every one of Ina’s cookbooks, which makes her my most collected author. And, I doubt I’ve missed any episodes of Barefoot Contessa. Is there anything better than a half hour in the barn with Ina?I remember going into the real Barefoot Contessa in East Hampton many years ago, hoping to catch a glimpse of her. I bought chicken salad and a cupcake and ate them both on a bench outside the store. They were just as amazing as I had imagined.I even wrote a scene in Something’s Gotta Give that was to take place in the store, but by the time we started shooting it was no longer there, so we recreated it in Los Angeles. I hope she approved!I’m clearly a huge Ina fan. Her first cookbook, The Barefoot Contessa Cookbook has been on a shelf in my kitchen for more than 20 years. It has a broken spine and opens almost by itself to two recipes, so those must be my favorites.One is Ina’s foolproof, works-every-time, everyone-loves-it sun-dried tomato dip. It was the first recipe of Ina’s that I ever tried, back when sundried tomatoes were a brand new thing—at least to me. It’s an irresistible dip that works great with crackers or cut-up veggies, and I always double the recipe for parties because it goes fast. It’s smooth, a little tangy, and unexpected, so it’s impossible not to go in for a second—or third!—taste. People often gesture an “OMG” face when they’re eating it.The recipe says to put all ingredients in a food processor and puree them, and then add scallions and pulse twice. How specific and easy is that? She also advises that room temperature cream cheese ensures that the dip won’t have lumps. Directions like that make it feel like Ina’s right by your side as you’re making it.I can’t remember the first time I made it, but remember the last. It was the 4th of July, and when I placed Ina’s dip on the table, I saw my friends, their now-adult kids, and their little ones eyeing it. I tripled the recipe that day because I knew what was going to happen. A crowd formed around the table and never moved until I brought out the second bowl. Three generations, all brought together by the love of one amazing dip. Ina Garten’s Sun-Dried Tomato DipFrom The Barefoot Contessa CookbookMakes 2 cupsHere is the most popular dip we make at Barefoot Contessa. Reminiscent of Russian dressing, it is updated with the intense flavors of sun-dried tomatoes and fresh scallions. This takes virtually a minute to make and can be served with crackers, chips, and fresh vegetables. Room-temperature cream cheese ensures that the dip won’t have lumps. The white part of the scallion has the most flavor, but the green also has flavor and it adds color and texture to the dip.¼ cup sun-dried tomatoes in oil, drained and chopped (8 tomatoes)8 ounces cream cheese, room temperature½ cup sour cream½ cup good mayonnaise10 dashes Tabasco sauce1 teaspoon kosher salt¾ teaspoon freshly ground black pepper2 scallions, thinly sliced (white and green parts)Purée the tomatoes, cream cheese, sour cream, mayonnaise, Tabasco sauce, salt, and pepper in a food processor fitted with a metal blade. Add the scallions and pulse twice. Serve at room temperature.Recipe reprinted from The Barefoot Contessa Cookbook. Copyright © 1999 by Ina Garten. Photographs copyright © 1999 by Melanie Acevedo. Published by Clarkson Potter/Publishers, an imprint of Penguin Random House LLC.Explore Bon AppétitIna GartenHow Easy Is That?CelebritiesDipSundried TomatoesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Nancy Meyers"]}