{"id": "86d2182174b6a075b45034de818374d1", "url": "https://www.bonappetit.com/story/types-of-vinegars-decoded", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "All the Types of Vinegar, Decoded (You're Welcome) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll the Types of Vinegar, Decoded (You're Welcome)Red wine? White wine? Apple cider? Here's what to use when.By Alex DelanyApril 23, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailMaybe you sit around all day and dream about vinegar. Or maybe you don’t. Maybe it’s your favorite ingredient in your kitchen. Or maybe it’s just another thing on the list of stuff you need to pick up at the store for your vinaigrette.It really doesn’t matter. Because whether you've always got a bottle within arms reach or keep it stashed deep in the pantry, you should know the difference between all the types of vinegar. Because using the right one at the right time can take a perfectly fine meal and turn it into something remarkable. It pays to have the right vinegar for the right situation.And while we’re not saying you have to possess all of the types of vinegar in your pantry at once, you should try to keep more than one on hand. Variety is the spice of life! Plus, they all have their strengths and weaknesses. One note: The word \"all\" in the title of this story is a bit misleading. There are dozens of other types of vinegar out there, many of which (Sherry in particular) we love here at BA. That said, these are the ones that we call for most often in the context of Basically recipes. And here’s what you need to know about each:Photo by Chelsea KyleRed Wine VinegarRed wine vinegar is made from, yup, red wine. This means that the secondary flavor (behind all that tang) is fruit. Of the wine vinegars, red wine tends to be punchier, with more vibrant grape flavor. The flavor is hot and robust, the opposite of delicate. In the same way you’d pair red drinking wine, we like red wine vinegar in marinades for red meat, stirred into hearty lentils or gazpacho, and mixed into zingy vinaigrettes, especially when the salad has a creamy or cheesy component. If we’re talking about an Italian salad, we’re reaching for red wine vinegar.Photo by Chelsea KyleWhite Wine VinegarRed and white wine vinegars are different in the same way red and white wines are. Sure, they both taste like grapes. But you want to use them with and for different things. White wine vinegar tends to be a bit lighter and more delicate in flavor, which means it won't pair as well with big ingredients like red meat. We like using white wine vinegar for deglazing pans to make a buttery pan sauce, marinating poultry, or dressing more delicate salads. If you’re ever torn between red and white wine vinegar ask yourself, What type of wine do I want to drink with this food?Photo by Chelsea KyleApple Cider VinegarApple cider vinegar is a medium-sharp vinegar that carries a very fruity quality. Like wine vinegars, apple cider vinegar tastes like the fruit that was used to make it. If you haven’t put two and two together yet...apple cider vinegar tastes like hard apple cider. And that means you need to think about how that flavor will taste with everything else in the dish before you use it. You can use apple cider in pretty much the same way you would wine vinegars, but we like it especially in salads that already feature apples, pork marinades, and braised pork dishes.Photo by Chelsea KyleDistilled White VinegarWhite vinegar is the cleanest, sharpest, cheapest vinegar of the bunch. There really isn’t anything else going on here, except for acidity, and that means that white vinegar is a blank canvas, waiting to be painted by other flavors. Since it welcomes other ingredients and is cheap enough to use in high volume, white vinegar is our favorite for pickling vegetables or making chicken adobo. It’s also our official pick for using as a non-toxic household cleaner, and adding to baking soda to make papier-mâché volcanoes erupt.Photo by Chelsea KyleRice VinegarMade from fermented rice, a.k.a. rice wine, this kind of vinegar is a prominent ingredient in Japanese, Korean, Chinese, and Vietnamese cuisine, and is slightly different everywhere it is made. The mild, barely sweet flavor is the least sharp of the bunch, and that mellowness also makes it the most versatile to cook with, bringing a slight hit of acid that won’t overpower the rest of your dish. Whether we’re seasoning sushi rice, making a marinade, seasoning cooked vegetables, or dressing salads, rice vinegar is a real workhorse in our kitchens. It’s also important to note that rice vinegar comes in regular and seasoned (with added salt and sugar) varieties. For the clean rice vinegar flavor we love, we almost always reach for the regular.Photo by Chelsea KyleMalt VinegarMalt vinegar might not be thought of as an “essential” vinegar, but we’d be willing to bet you’ve seen it on a table or two in your lifetime. This darker vinegar leans toward the mellower side of the acid spectrum and is made from ale. The flavor is nutty and toasty, which makes malt vinegar an absolute killer on any potato product imaginable. Malt vinegar on roasted potatoes or French fries will convince you that you are on this planet for a reason. Malt vinegar is also useful for blending with other types of vinegar to create a more unique flavor in a vinaigrette or marinade.You know what you need vinegar for? Sweet and sour pork!Sweet-and-Sour Pork TenderloinThe tangy, mouthwatering sauce here is inspired by agrodolce, an Italian sweet and sour sauce made by reducing vinegar, sugar, and spices.View RecipeExplore Bon AppétitBasicallyIngredientsVinegarred wine vinegarApple Cider VinegarRice VinegarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-23", "author": ["Condé Nast", "Alex Delany"]}