{"id": "86d49b851edab56ea56151cc1345af10", "url": "https://www.bonappetit.com/story/butterkase-cheese", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Butterkäse: The Best Cheese You’ve Never Tried | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureButterkäse: The Best Cheese You’ve Never TriedAn absurdly creamy, fatty German cheese that you need to seek out. Like now.By Posie HarwoodJanuary 22, 2018FacebookTwitterEmailFacebookTwitterEmailI confess: I didn’t know what the word butterkäse meant when I first saw it. It was on the menu New York City’s Upland restaurant listed as a component of a chicken dish. I leaned across the table at my friend and pronounced it in an exaggerated, faux German accent. “It probably just means butter cheese, right?” I said, jokingly. The waiter hovering behind me politely leaned in and informed me that yes, it in fact does loosely translate as such.After taking a deep sip of wine to recover from my embarrassment, I considered this. Butter cheese sounds delicious in a vaguely lowbrow way, like Cheese Whiz. Yet Upland is a very nice restaurant. Obama has eaten here multiple times! There must be more to it.Reader, I ordered the chicken.I swooned at the first bite, the crispy skin smothered in melted cheese. The truth is that butterkäse tastes like a fancy version of mass-market processed dairy (think American cheese) that you love, but know you shouldn’t. Mild and intense at the same time, it’s like a more complex, nuanced version of Havarti.“Butter cheese” tastes exactly as good as it sounds. Popular in Germany and Austria, it’s a creamy, semi-soft, sliceable cheese with a golden rind. It’s decadent—the fat content hovers around 50% (nearly as high as triple-cream cheeses). The flavor doesn’t hit you over the head like a sharp Cheddar or a bold blue cheese. It’s savory and buttery but also teasingly subtle, making you want to take another bite. And another. And suddenly you’ve polished off a block of it and need to lie down to reconsider your life choices on the couch. It happens! We’ve all been there!You can buy a 4-pack of super creamy Cedar Grove butterkäse from WisconsinMade.com for $24.\nHappily, you can now find butterkäse in most specialty cheese shops and at plenty of upscale grocery stores. Whole Foods often carries it, and Boar’s Head has even started offering their own version at chain supermarkets. For a more premium style, order it online from places like igourmet or Amazon (where I’m fond of this one, $20 from the Wisconsin Cheeseman and this one, $20 from Ammerlander).Exceptionally versatile, butterkäse is an ideal melting cheese. Use it in grilled cheese sandwiches alongside stronger-flavored cheeses like cheddar or Gruyère. Add it to a pot of fondue. Fold cubes of it into an omelet. Top a burger with a gooey layer of it: the mellow, buttery taste is a perfect match for ground beef. Melt it into mac and cheese. Sprinkle it onto pizza dough with pancetta, garlic, and basil. Butterkäse quesadilla? Why not! (Throw some avocado and sautéed mushrooms in there for good measure.)Slice it into cubes and pile it on your next cheese tray: As soft and luscious as a Brie or Camembert, it’s a prime topping for crackers or crostini. Centuries of cheese-loving Germans have cooked spaetlze and strudel with it.And don’t stop at savory dishes. (Did you ever neglect dessert before?) Since the flavor of butterkäse is so mild, you could add it to a classic custard-based ice cream recipe, bake it into a Danish, or mix it with sugar and spices for a creative take on a babka or sweet roll filling.I can’t promise that it tastes better when you pronounce it in deep, guttural German accent. But I can assure you that it’s worth a shot.Use butterkäse in this absurdly cheesy stovetop mac and cheese recipe:Explore Bon AppétitCheeseRead MorecultureThe Best Boar's Head CheesesBy Tia KeenancultureGarlic Bread-Grilled Cheese Combines Two Beautiful ThingsBy Meryl RothsteincultureHow to Pair Cheese with Cheese Crackers for Double the CheeseBy Tia KeenancookingThe Best Thing to Do to Your Trader Joe’s Cheese? Marinate ItBy Tommy WernerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-22", "author": ["Condé Nast", "Posie Harwood"]}