{"id": "86da7d1a124c297e3fcf39035ba30520", "url": "https://www.bonappetit.com/story/upstate-glasses", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "The Perfect Glass Cup for Morning Espresso and Evening Pét-Nat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Perfect Glass for Morning Espresso and Evening Pét-NatThese hand dyed glass-blown tumblers fulfill just about every drinking need I encounter with supremely low-key style.By Amanda ShapiroJuly 13, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Since I moved a few months ago, my glassware shelf is in a sorry state, populated by a ragtag team of Mason jars, repurposed condiment jars, and those cute sake cups with the panda. That's why these kokomo cups from Upstate, Kalen Kaminski's line of hand-dyed goods, are at the tippy-top of my wish list.At just three inches tall, the glass-blown tumblers fulfill just about every drinking need I encounter, from morning espresso to evening pét-nat to late-night nips of mezcal—and they do so with supremely low-key style. You could even use them as dinner-table water glasses (just keep a pitcher on hand for refills).If I were in a higher income bracket, I'd replace my entire shelf with kokomo glasses. For now, I'd be content with a set of two—okay, maybe four—so I can finally retire a few of those condiment jars. The panda cups, on the other hand, are staying. —Amanda Shapiro, Healthyish editorBuy it: Hand Dyed Kokomo Cup, $68.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingRead MoreLifestyleThese Linen Napkins Make Me Feel Way Fancier Than I AmBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-13", "author": ["Condé Nast", "Amanda Shapiro"]}