{"id": "8700066089e43e7d175789a0d512d825", "url": "https://www.bonappetit.com/recipe/carrot-and-habanero-tamales", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Carrot and Habanero Tamales Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueCarrot and Habanero TamalesBy Maricela VegaJanuary 12, 20213.9(10)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Tamales, to me, are the ultimate comfort food,” says Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous diaspora. “They originated in Mesoamerica long before colonization and have been evolving ever since. Because farmers tend to cure and store the maíz that tamales are made from by November, they’ve become a staple dish for the cold winter months. This particular tamal, filled with carrots, habaneros, and garlic, is my celebration of how the harvest from summer and fall floats into wintertime.”IngredientsMakes 8Dough1cup masa harina (about 5 oz.; preferably Bob’s Red Mill or Masienda)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼tsp. baking powder2½cups vegetable stock or low-sodium vegetable broth2Tbsp. grapeseed or vegetable oilCarrot Filling4medium carrots (about 1 lb.), preferably rainbow, scrubbed, sliced ¼\" thick on a diagonal1habanero chile, halved3garlic cloves1Tbsp. grapeseed or vegetable oilKosher saltAssembly8dried corn husks, soaked in hot water 5 minutes, or eight 10x5\" pieces parchment paper1carrot, preferably rainbow, peeled½cup Pumpkin Hot Sauce4cups mizuna or arugulaFlaky sea saltPreparationDoughStep 1Whisk masa harina, salt, and baking powder in a large bowl to combine. Whisk stock and oil in a medium bowl to combine, then gradually add to dry ingredients, mixing with your hands until thick and oozy (dough should be about the consistency of fresh ricotta)—you may not need all of the stock mixture. Cover dough tightly and let sit at room temperature until ready to use.Carrot FillingStep 2Place a rack in middle of oven; preheat to 450°. Spread out carrots, chile, and garlic in a single layer on a rimmed baking sheet. Drizzle vegetables with oil; season with salt. Turn to coat, then roast until carrots are tender and starting to brown, about 10 minutes.Step 3Let vegetables sit until cool enough to handle, then transfer to a food processor and pulse to a coarse purée. Taste and season filling with more salt if needed. Transfer to a medium bowl.AssemblyStep 4Place a steamer basket inside a large pot and pour in water just until it reaches basket. Bring to a simmer.Step 5Working one at a time, lay a corn husk vertically on your work surface. Place a golf-ball-size amount of dough just above the center of the husk. Spoon about 1 Tbsp. filling on top and enclose in dough. Fold sides of corn husk up and over dough, then fold the flap closest to you upward to meet the top edge of the upper flap. Turn over so tamal stays closed. Repeat with remaining husks, dough, and filling.Step 6Arrange tamales in steamer, flap side down (it’s okay if you need to layer them). Reduce heat to medium, cover pot, and steam tamales 30 minutes.Step 7Meanwhile, fill a medium bowl with ice water. Using a vegetable peeler, shave carrot in long ribbons into bowl and let sit until ready to use.Step 8To serve, place 2 tamales on each plate and unwrap. Drizzle some Pumpkin Hot Sauce over and top with a big mound of mizuna and some carrot ribbons; sprinkle with sea salt.How would you rate Carrot and Habanero Tamales?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleKind of odd. Full disclosure, this was my first time making tamales and I did the parchment paper hack because I couldn't find corn husks anywhere and I was wanting to make these SO BAD. I feel like I might have had high expectations and the missing extra corn flavor really messed it up for me. I was also a little surprised by the amount of work that went into these for the small serving size and how mediocre my finished product was. This recipe makes 8 small tamales, (If you're doing this for dinner I'd expect 3 tamales per plate + a side) incredibly far from the freeze ahead experience I was expecting. I should have read this more closely.\n\nThese tasted very healthy, if I spend this much time on something I just want a bigger flavor payoff. When I was finished making these I started researching other tamales recipes and I think the biggest thing I was missing was the lard in the masa mixture, the texture with veg oil was odd and it reminded me of playdough rather than a beautiful tamale experience. I'd agree with the others below, the hydration of the masa mixture was hard to get right. The carrot filling was really yummy, but I think it just threw it off further as all the textures were really similar. If tamales are your comfort food and you're trying to be a little healthier then yes go for it, but if you're expecting what you get from your favorite farmer's market food stand this isn't close. I won't be making this one again, I'll just start with a more traditional recipe I think.  gmckenzieSeattle, WA2/23/2021I'm hoping someone at BA can verify this recipe.  After reading the previous review I only added 1 1/2 cups of veg stock to 5 oz. of masa harina, and I ended up with masa soup.  I had to add a bit more than 1 additional cup of masa to get the correct texture.  I've made tamales before, so I'm pretty sure the masa should be as described in the directions as \"like ricotta.\"  vbannVirginia Beach, VA2/2/2021Such lovely earthy flavors. The recipe is less intimidating than it seems, and most of the prep is in the sauces. Accidentally added too much vegetable broth as I assumed I should add all the wet to the dry before reading \"you may not need all the veg broth,\" but was able to balance it out pretty quickly with more masa harina, thankfully, the tamale itself is perfectly simple. Served this with some non-vegan ingredients including cotija which was a great complimentary flavor. Also served with the the leftover alium confit from making the pumpkin hot sauce, straining some of the oil and adding yummy garlicky leeks on top. Added some oaxacan hot chocolate on the side (I think this was mentioned in the print edition), which was a superb way to get my kids to love the entire experience, habanero and all. Thanks Maricela and BA!ChristinaBrooklyn, NY1/22/2021Explore Bon AppétitMexicanLatin AmericanCarrotVegetableMasaRice & GrainsMainDairy-FreeNut-FreeGluten-FreeVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}