{"id": "8704b5488c1003aaced17c0d3744338b", "url": "https://www.bonappetit.com/story/sonia-were-into-it", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Sonia Chopra Will Not Be Parted from Her Toaster Oven and Block-Print Napkins | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSonia Chopra Will Not Be Parted From Her Toaster Oven and Block-Print NapkinsBA’s executive editor Sonia Chopra shares her at-home obsessions.By Sonia ChopraFebruary 9, 2022FacebookTwitterEmailIllustration by Damien CuypersFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.BA editors love to shop as much as we love to eat. In our column We’re Into It, we share our most important standbys and favorite new finds.When you tell people you’re the executive editor of a food magazine, they often picture something slightly more glamorous than the reality of the gig. Instead, find me wearing my cozy Fines Herbes sweatshirt (from Atlanta designer Megan Huntz) for multiple days in a row, shaking my favorite hot sauce onto last-minute lunch toasts. These and the other products below—the block-print napkins I keep strewn around my home and in at least three different tote bags, the ceramic spoon rest I gift to everyone, and the mugs I own in seven? eight? different colors—are some of my tried-and-true favorite goods.Let’s Toast!Everyone in my family owns this Panasonic FlashXpress toaster oven. It’s the best kitchen appliance out there. I use mine to roast veggies, reheat leftovers, and even bake cakes.Courtesy of PanasonicPanasonic FlashXpress Toaster Oven$170 $146 at Amazon$176 at Michael'sGive It a RestNever thought I’d call a spoon rest elegant, but here we are. These carved sgraffito ceramics from D.C.–based Kuzeh bring order and beauty to my kitchen.Courtesy of Kuzeh PotteryLeaf Lined Sgraffito Spoon Rest$38 at Kuzeh PotteryFlower PowerI am always looking for candles that freshen up my kitchen without making it smell fake. The light floral scent of this Gulab candle smells like rosewater: clean and not at all overpowering.Courtesy of KishmishGulab Red Rose Candle$30 at KishmishSpice Up Your LifeI like a heavy hot sauce, and many here in the U.S. are a little too light or limey for me. This warming West Indian Curry sauce is what I want to eat on just about anything.Courtesy of Shaquanda's Hot Pepper SauceShaquanda's West Indian Curry Hot Pepper Sauce$10 at Shaquanda Will Feed You$15 at AmazonAccessorize the TableHand-block-printed in Rajasthan, India, these colorful linen napkins are so pretty I keep ordering them as gifts—and then deciding to keep them for myself.Courtesy of Sunday MondaySunday Monday Jaali Linen Napkins$32 at Sunday Monday (Set of 2)Morning RitualI’m from the South, so I try to support brands across the region; a favorite is East Fork in Asheville, N.C. We’ve written about their ceramic dinnerware, but the mugs are also perfect. I love them for their smooth heft and beautiful hues ranging from amaro to panna cotta.Courtesy of East Fork PotteryEast Fork Mug$38 at East Fork$38 at Bloomingdales'sExplore Bon AppétitShoppingWere Into ItRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-09", "author": ["Condé Nast", "Sonia Chopra"]}