{"id": "87080ad14f17894a771f621d7eba1c0c", "url": "https://www.bonappetit.com/story/worlds-ugliest-dog-zsa-zsa", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "What Does the World’s Ugliest Dog Like to Eat? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Does the World’s Ugliest Dog Like to Eat?Wondered one person: me.By Alex BeggsJuly 1, 2018FacebookTwitterEmailJosh Edelson/Getty ImagesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior web editor Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy Wilson4th of July...brisket?One side of my family is made up of antisocial introverts (really fun at parties, jk we don’t usually show up) who love to watch 4th of July fireworks on TV. So now I have this weird tradition of grilling with family in the afternoon and then going home as soon as possible to avoid seeing any fireworks actually in the sky, where mosquitoes live. There’s something equally hypnotising and sad about watching fireworks on TV—I highly recommend it. Why not Instagram the screen too? Dazzling. Also dazzling (go with it): this grilled brisket recipe.Chris Morocco came up with this as part of a series on “grilling your braises”—the long-cooking meats you save for winter, thrown on the grill. When I tried the brisket in March during recipe testing, well, I ate a lot of it, straight from the platter, going back for spoonfuls of the scallion peanut “salsa” (loose interpretation if you ask me) on top. I’ve made it at home now. Twice. You freeze the brisket for an hour, which makes it easier to slice thinly. Then you marinate it in garlic, lime juice, oyster sauce, soy sauce, brown sugar, and oil, for at least an hour. On the grill, it cooks SO FAST. A minute and a half on one side, 30 seconds on the other, but you’re going for slightly more well-done than usual, otherwise the brisket will have some chew. You fry peanuts on the stove with garlic, sesame seeds, red pepper flakes, adding lime juice, honey, and scallions, and watch people lose all sense of decorum going after it. DO NOT SKIP THE SPRINKLES.Get the recipe here.Want this letter before it hits the website? Sign up for our newsletter!Josh Edelson/Getty ImagesAnother important holidaySome people mark time with Far Side tear-off calendars, but I like to keep track of the passing years by the The World’s Ugliest Dog contest. And it was last week! The winner was Zsa Zsa, a rusty pipe-colored English bulldog with a tongue perpetually trying to mop the floor. She has the ethereal beauty of a stranger’s morning breath. Her guardian Megan Brainard told the New York Times that Zsa Zsa wooed the judges because “She was eating part of a Slim Jim on the table and just sneezed all over them and was drooling on them.” I knew there was a way to make this about food. Slim Jims, a beauty pageant secret weapon since the dawn of time. Probably!WOJUThis is another recipe I’ve already made twice. Molly Baz’s salted watermelon juice, aka Woju. With tequila or not, it is the most refreshing drink you’ll have this summer. No added sugar!Get the recipe:Salted Watermelon MargaritaIt’s refreshing, naturally sweet without added sugar, and just look at that PINK!View RecipeIf your favorite meat is hot dogHere is our supermarket hot dog of choice.Poor ClaireClaire Saffitz conquered YouTube again with her week-long mission to recreate Lucky Charms. When I was a kid, one morning I ate all of the cereal and left the marshmallows in the bowl to eat after school. My mom threw them away and taught me a valuable lesson in living in the moment. This is why I have no savings. This is not what the video is about, but it’s a thrilling ride and you should watch it. Claire suffers for her art, but she always comes through!Watch it below:Amiel’s ant farmThis week we all followed the saga of Basically editor Amiel Stanek’s ant farm. One wine-soaked night, Amiel ordered an art farm on the internet. It arrived to the office on a Friday, and on Monday, he had a box of dead ants. The box is still on his desk, as is a glass vial of dead ants amidst papers, cookbooks, and “adult” probiotics. How long will it last? Stay tuned, friends. Stay tuned.Unnecessary food feud of the week“F*** grape tomatoes!” steamed Chris Morocco. He was presenting a beautiful forthcoming Healthyish dish and fire was coming out of his ears. “ALWAYS cherry tomatoes, always.” What’s the difference? I asked Chris. Well, cherry tomatoes are sweeter, while grape tomatoes have a tougher skin and are much more watery inside. WHO WOULD WANT THAT? Everyone in the Test Kitchen agreed: grape tomatoes 👎. No one was on side grape tomato, and it was a rare moment of unity, before Andy realized that Brad didn’t order his halibut and Brad realized that Andy never requested the halibut and chaos was restored in the Test Kitchen, where it rightfully belongs.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-01", "author": ["Condé Nast", "Alex Beggs"]}