{"id": "870a257fd6d4d373c25e83e597706157", "url": "https://www.bonappetit.com/recipe/brothy-seafood-chowder", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Brothy Seafood Chowder Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrothy Seafood ChowderBy Alison CarrollSeptember 28, 20183.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Olivia Anderson, Prop Styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintThe homemade stock makes all the difference in this flavorful, savory, perfectly smooth chowder. Look for a trusted seafood monger who filets and debones the fish themselves. They usually will have plenty of fishbones left over.Ingredients8 servingsStock3Tbsp. extra-virgin olive oil2lb. fish bones, rinsed1small onion, unpeeled, quartered2stalks celery, chopped1leek, dark green parts chopped, rinsed, white parts cut into ¼\" rounds, rinsed, reserved for stew1dried chile de árbol or ½ tsp. crushed red pepper flakes1garlic clove, smashed6thyme sprigs2bay leaves (optional)½cup dry white wine or sake1Tbsp. fennel seedsStew1lb. small Yukon Gold potatoes, quarteredKosher salt1fennel bulb, halved lengthwise, thinly sliced crosswise, fronds reserved for serving1½lb. boneless, skinless white fish (such as cod), cut into 1\" pieces2cups Sun Gold tomatoesExtra-virgin olive oil (for drizzling)Freshly ground black pepperPreparationStockStep 1Heat oil in a large pot over medium. Add fish bones and cook, stirring occasionally but being careful not to smash down on bones, until lightly browned in spots, 6–8 minutes. Add onion, celery, dark green leek pieces, chile, garlic, thyme, and bay leaves (if using). Cook, stirring occasionally and scraping bottom of pot to make sure nothing is sticking, until onion is golden brown, 4–6 minutes. Add wine and cook, stirring occasionally, until reduced by about half, about 1 minute.Step 2Add fennel seeds and 12 cups cold water to onion mixture and bring to boil. Reduce heat to medium-low, bring to a simmer, and cook, skimming off any foam that rises to the top, until stock is nicely flavored and bones are still intact, 40–50 minutes. Let cool 30 minutes. Strain through a fine-mesh sieve into another large pot or bowl; discard solids.Step 3Do Ahead: Stock can be made 3 days ahead. Cover and chill.StewStep 4Place potatoes in fish stock in a large pot, season with salt, and bring to a boil. Reduce heat to medium, bring to a simmer, and cook, stirring occasionally, until potatoes are almost tender, 10–14 minutes. Add sliced fennel and white leek parts and cook, stirring occasionally, until vegetables are barely tender, 4–6 minutes. Add fish and cook, stirring occasionally, until fish is opaque, about 4 minutes. Remove from heat and stir in tomatoes; taste and adjust seasoning.Step 5Ladle chowder among bowls and top with fennel fronds. Drizzle with oil; season with pepper.How would you rate Brothy Seafood Chowder?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglePet peeve.  When the ingredients list doesn;t match the photo.  No toatoes on the list, but are in the pic!  Wont make this recipe as I wonder what else is missing.\nAnonymous2318812/27/2021Explore Bon AppétitChowderSoupSoups and StewsNew EnglandAmericanLeekVegetableCodFishSeafoodTomatoFennelCeleryPotatoYukon Gold PotatoStarterHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Alison Carroll"]}