{"id": "870dcc561c8a61ac5f41d943293f236b", "url": "https://www.bonappetit.com/story/reviewing-my-own-cooking", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Reviewing Maggie's Townhouse, the Only Restaurant I've Been to All Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusReviewing Maggie’s Townhouse, the Only Restaurant I’ve Been to All YearFilling if repetitive Italianish fare from a slightly deranged-seeming chef.By Maggie HennessyApril 23, 2021FacebookTwitterEmailIllustration by Oscar Bolton GreenFacebookTwitterEmailI haven’t gotten out much this past year, except to one place: Maggie’s Townhouse. This restaurant has a knack for cooking exactly what I want for dinner (mostly carbs), though redundancy is an issue. It’s pretty exclusive—I’m one of fewer than six customers who has eaten there since last March. I suspect they do this to amp up intrigue; on its own I’m not sure the food will win many awards.A narrow mint green house tucked between hulking brick apartment buildings in Chicago’s Logan Square, Townhouse exudes a homey “West Elm meets Wayfair clearance section” vibe. Inside, recessed lights cast a yellow glare over the reclaimed-wood dining table, which is crowded with a beat-up MacBook, a weekly planner, and an ivy the length of a boa constrictor that has given up hope of being repotted. Heaps of unfolded laundry sometimes obscure the lounge seating near the entryway, but I’ve come to enjoy sipping my pre-dinner Negroni on the floor. The playlist is pleasant enough, though the restaurant leans a little hard on that old Alabama Shakes album—which clashes with errant car alarms outside and the gentle buzz of those recessed lights.You might call Townhouse’s food broadly Italian; think Olive Garden accented with the chef’s indiscriminate flashes of creativity. Salad begins every meal whether you ordered it or not, which creates an obligatory, sometimes soul-deadening effect. It’s presented in a giant metal mixing bowl with two tiny forks that we usually have to fish out from beneath the lettuce. Staple pastas like toothsome bucatini in sometimes-scrambled carbonara and spaghetti in butter-roasted tomato sauce satisfy me enough that I don't mind seeing them on the menu week after week. The house focaccia is especially pillowy, crunchy, and good. However, entrée portions border on irresponsibly large; I frankly worry about Townhouse’s financial viability because every time the chef deposits food, she cries, “There’s more!” before we’ve even tasted anything.Mapo tofu, another staple, has improved as the chef has upped the fat content from turkey to lean beef to finally pork, whose oils form a reddish slick that mingles luxuriously with the soft cubes of tofu. The dull-knifed scallion garnish comes in a single chain, like a construction paper garland. Whimsical!The chef’s romances with certain ingredients and techniques tend to hit customers like a tidal wave, almost like she had never thought to use them before that very moment. One week it’s cauliflower “steak,” charred cabbage “steak,” roasted carrot “steak”; another it’s chile crisp on the congee, chile crisp on the fried eggs, chile crisp on the charred, old-ass green beans the texture of dragon hide.Meat cookery is a mixed bag. The simmered-whole-chicken phase has produced mostly juicy, nourishing results. But when a mustardy pork tenderloin came late out of the kitchen, the chef announced, “It’s f*#%ing overcooked,” as she set it on the table. And, indeed, it was.Which brings me to perhaps the strangest thing about Townhouse: the chef’s troublingly personal investment in diners’ feedback. A few nights back, my date suggested she’d gone a little OTT on the fresh ginger in the curry. “Oh, so suddenly you’re a curry expert?” she spat before slipping into sullen silence for the rest of the night. She also gets really offended whenever we ask for to-go containers, hovering over us asking if it’s because we didn’t like the food.Diners should beware of Townhouse’s uneven wine pairings too. A $10.99 Target Cabernet served with a fiery curry made both taste metallic and bitter. On another night they got the wine right—a fresh, easy-drinking Montepulciano still bearing the price sticker, served alongside seared broccolini and pillowy ricotta gnudi in garlicky tomato gravy. The chef droned on about how Ina Garten says to put 20 whole garlic cloves in the olive oil to start the sauce and wasn’t it the best thing we’d ever tasted? Unfortunately, the evening’s triumph dimmed as I excavated thin, short hairs from both courses. I suspect they’re bang hairs; I’ve never once seen that fringed chef wear a hairnet.Despite the occasional victories, I get the sense that the monotony of nightly service is starting to take a toll on Townhouse. When a salad featuring home-canned Hatch chiles made a guest ask if they should’ve been cooked first, the chef screamed and slapped the fork out of his hand, then spent hours down an internet black hole reading about botulism. Shortly thereafter, her scratch-made pizza sent a volcanic river of mozzarella onto the oven floor, which set off the fire alarm. As the alarm wailed and Alabama Shakes sang on, the chef waved a tea towel with one hand and swigged wine with the other, muttering something about being underappreciated.“Why don’t we just order pizza from somewhere else?” my date shouted as he dashed around opening all the windows.I think we could all use a break from Townhouse.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-23", "author": ["Condé Nast", "Maggie Hennessy"]}