{"id": "87168f314bf75c612ce320505bfd8c4f", "url": "https://www.bonappetit.com/story/banana-snack-feud", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "A Fond Farewell to Our Wonderful Amiel  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Fond Farewell to Our Wonderful AmielMake Amiel’s great bean recipes, find a good Father’s Day present idea, and read more food news from the week.By Alex BeggsJune 15, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Farewell, sweet princeOnce, in a very formal pitch meeting, Amiel Stanek stood up and started talking in a funny voice, pausing his speech in odd places, and turning what could have been a boring presentation into a performance piece. About three seconds in, I was laughing so hard, as quietly as I could, that I was crying. Tears. My colleagues were secretly filming me. Amiel makes me laugh-cry, he is so funny. Now Amiel is LEAVING us for a new life adventure in Hudson, New York. He’s going to keep writing and doing video for Bon Appétit, but he’s not going to be sitting across from me, eating hair-health gummies and buying ant farms full of dead ants on Amazon. I’m going to miss that lovable weirdo. The perfect gentleman. The fashion icon. At a going away party at Di Fara in Brooklyn, Amiel was lifted on a chair for the Horah, like it was his bar mitzvah. Christina Chaey made two gallons of banana pudding and served it with the gigantic, human-sized spoon that’s been at Amiel’s desk for years. Adam Rapoport in a cowboy hat and Julia Kramer did an award-winning rendition of “Shallow.” This time, Amiel is going to make me cry-cry.What is that picture? Amiel cooking an egg in a sauna for his hilarious video on cooking an egg...every single way. Watch it here.Want this letter before it hits the website? Sign up for our newsletter!Alex LauAmiel loves beansMy favorite Amiel recipes: this new bean soup, his marinated beans (pictured above), the whole fried fish, spicy grapefruit shandy, and his foolproof beets.The man who cooksMy dad loves to cook as much as he loves to diet as much as he loves to watch American Ninja Warrior. Every time I talk to him—after a quick weekly summary of the weather in Houston—he’s telling me about some new eating plan he’s following, and what he’s cooking tailored to it. A gluten-free diet => time to experiment with gluten-free pancakes! I’ve learned to stop even trying to suggest Bon Appétit recipes, he won’t listen. He prefers his cookbooks like he prefers CDs to Spotify, the most beloved being Bobby Flay Fit. Just look at Bobby on that cover. The snug henley. The dish that looks salad-like but is next to some grilled protein. The hint of back deck he appears to be standing on. My father’s favorite recipes are the flatbread, oatmeal breakfast cookies, and quinoa con pollo. Maybe for Father’s Day this year, I’ll get him a henley.An aging caterpillarThe Very Hungry Caterpillar turned 50 years old this week. When I was in kindergarten, I played the chocolate cake in a musical performance of the book. I had to wear all brown (yeek), but I was delighted to be the first junk food the caterpillar ate after all the wholesome fruits and vegetables. It was as if somehow, five-year-old me knew that life wasn’t worth living without chocolate cake. I stand by that sentiment.No commentPumpkin spice SPAM arrived in our office recently. We all gave it a sniff and pass. I just need you to know it exists.Photo by Flashpop/Kraft HeinzSalad what now?In this week’s preordained viral story, Kraft introduced “salad frosting,” which is ranch dressing in a pouch. I have a feeling this is going to be as big of a hit as blue ketchup.Unnecessary food meme of the weekUnnecessary food feud of the weekIs it normal to eat a banana as a snack at 5:30 p.m.? We noticed Alex Delany started peeling open a banana in the late afternoon, and I for one, was concerned. What about dinner? This doesn’t seem like the appropriate hour for a banana, I said. Emily Schultz cackled and pointed her phone at Delany, capturing the moment for posterity and Instagram. Meryl Rothstein said 4:30 was a perfectly fine time for a banana cut into coins with peanut butter. Amanda Shapiro agreed, preferring hers pre-frozen, eaten like a popsicle. “It’s only weird to eat a banana after the sun goes down IMO,” said Christina Chaey. When Delany mentioned how important it is to get your “daily fiber intake,” Jesse Sparks made a look of horror and disgust, as if he’d pooped right there in the middle of the office. What do you think?Sort of related: Delany’s new series started this week! He ate “one of everything” at one of New York’s most famous burger spots. Watch it here...but maybe don’t try at home.Explore Bon AppétitBeggs NewsletterRead MoreLifestyle30-Something Dinner Parties Are the Best Dinner PartiesBy Amiel Stanek and Lauren SchaefercookingThis Entry-Level Whole Fish Recipe Made Me Who I Am TodayBy Alex BeggscultureCrispy-Gone-Soggy Is the Finest Texture of Food There Is, Fight MeBy Amiel StanekcookingThe Homemade Ranch Dressing I Make More Often Than I Call My MotherBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-15", "author": ["Condé Nast", "Alex Beggs", "Lauren Schaefer"]}