{"id": "871e050247968267b4d438718ee1ef28", "url": "https://www.bonappetit.com/story/best-ways-to-cook-zucchini", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "The Two Best Ways to Cook Zucchini | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Fix Your Relationship with ZucchiniIt’s cheap and it’s everywhere, so you might as well learn to love it.By Sarah JampelAugust 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailZucchini deserves our apology.We’ve called it bland, watery, mushy, slimy, worthless. We’ve said that the only good thing about it is that it’s abundant and cheap—always around but never what you want. We’ve said that if we were drafting a team for summer produce kickball, it’d be our last pick. Even the striped or wacky-shaped zucchini still tastes like...nothing.“Zucchini is basically horrible and there are no exceptions,” wrote food director Carla Lalli Music. “Sad,” said editor in chief Adam Rapoport.Sorry, zucchini. It’s not you—well, it kind of is you—it’s mostly us. Just because a zucchini isn’t a tomato (slice, salt, eat, done), doesn’t mean it can’t be wonderful, valuable, and worthwhile. There are two guaranteed good ways to cajole zucchini into deliciousness.First up: lots of heat, which will produce seared or charred surfaces and blistered skins. Zucchini is 94 to 95% water. In this case, “watery” is not an insult but a fact. Introducing it to heat early on, either on the stove or on the grill (or even in the oven at a high temp), allows you to get big pieces of zucchini nice and browned before the water seeps out and impedes the process. Once the zucchini is caramelizing, you’ll continue to cook it until it's until tender all the way through—a paring knife or a fork should slip in without much resistance—but not yet mushy.This marinated zucchini might be the best thing about summer.\nPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenThis method gives you zucchini that’s sliceable (not spoonable!) and, since some of the water has cooked off, primed to absorb intense dressings and marinades (we like them garlicky, herby, spicy, and glaze-y). For extra insurance, salt the sliced zucchini ahead of time to jumpstart the water-wicking process.The second great way to cook zucchini: to death. By which we mean low and slow, until much of that moisture seeps out and bubbles away, leaving the zucchini to fall apart into a jammy sauce with a concentrated zuke flavor (earthy, vegetal, sweet!) that’s perfect for spreading on toast or tossing through pasta. In this Ratatouille Pasta, pieces of zucchini are cooked for around 30 minutes, until they’re nearly unrecognizable (in a good way).No matter which road you’re taking—hot and fast or low and slow—don’t forget the acid: Zucchini needs brightness in the form of citrus juice, vinegar, or even pickle brine to wake the heck up after being blasted with heat.And if all else fails, bow to the great redeemer: zucchini bread.Zucchini + pasta = a match made in heaven:Ratatouille PastaIf we were to round up an all-star team of summer's greatest produce, it'd look a little something like ratatouille: Eggplant and zucchini. Peppers and tomatoes. The gang's all here!View RecipeExplore Bon AppétitZucchiniSummer SquashYellow SquashRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-14", "author": ["Condé Nast", "Sarah Jampel"]}