{"id": "8744204ad6108a0e6fb7ff8356031588", "url": "https://www.bonappetit.com/story/what-is-sweetened-condensed-milk", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "What Is Sweetened Condensed Milk, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Sweetened Condensed Milk, Anyway?It's sticky and milky and kind of gnarly looking, but it's a key player in some of our favorite desserts and drinks.By Alex DelanyJuly 17, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailDON’T DRINK THE MILK! Not because it’s bad. But because it’s not regular milk. It’s sweetened condensed milk. Which begs the question: What is sweetened condensed milk, anyway? It’s weirdly thick (thicccc) and sticky and kind of looks like Elmer’s glue. In short: It looks gross. But if you’re putting it in things, not just drinking it from the can, it’s not gross at all. Let’s break down the two words in the name and learn a bit about this dairy-based concoction.Condensed: How do you condense milk? You don’t shove it into a small room (or a trash compactor, for all you Star Wars heads out there). And you don’t abbreviate it to MLK in the fashion of some millennial tech start-up. Milk is condensed by removing water via heat. You’ll probably recognize that process as evaporation. Yes! The part of the water cycle where liquid water turns to a gas that we learned about in fifth grade science! Condensed just means that the milk was cooked down in order to remove some of the water from it, the same way you would cook down a stock or a sauce to concentrate its flavor.Sweetened: Yeah, you guessed it. There’s sugar added to sweetened condensed milk. The main purpose of adding sugar is to prolong the shelf life of condensed milk, which can sit on room temperature shelves for years. Sugar prevents microorganisms from growing in the milk and helps to thicken it even further—it's added after the milk has been boiled, reduced, and effectively pasteurized.It’s also worth noting that there is unsweetened condensed milk, but that’s usually referred to as \"evaporated milk.\" You shouldn’t substitute one for the other. They are apples and oranges, as the saying goes.No sweetened condensed milk, no rich, delicious shakerato.\nAlex LauSo why do we use this thick, sticky stuff? Well, if you read the stuff we wrote above, you kind of already know. It provides a concentrated creaminess and sweet, milky flavor to whatever you put it in, without all the excess moisture that you get from regular old milk. That makes it perfect for creamy things that you want to set to a near-solid, like key lime pie, fudge, frozen margarita pie, or caramel. It’s also one of the three milks in tres leches cake and a common addition to homemade ice cream. And on the drink front, it shows up frequently in coffee drinks like Vietnamese iced coffee or a Spanish café bombón, both of which are excellent dessert beverages.But here’s the basic rule: You can use sweetened condensed milk in any scenario where you want both sugar and cream. Coffee. Tea. Coconut curries. Toasts. Fruit. Pies. Ice cream. It’s a versatile ingredient that no one give that much thought to. Except for you. With this knowledge, you’re the champion of the sweetened condensed milk universe. But remember: Don’t drink it straight. Please.Now, how about you crack open a can and make some Frozen Margarita Pie?Frozen Margarita PieYour favorite cocktail in pie form—what's not to love?View RecipeExplore Bon AppétitBasicallyMilkDessertCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Alex Delany"]}