{"id": "87494f6b26211a180da5e7079022d84a", "url": "https://www.bonappetit.com/recipe/coconut-flan-commanders-palace", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Coconut Flan Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCoconut FlanBy Commander’s Palace, New Orleans, LAFebruary 9, 20184.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintYou’ll see whispers of smoke when you make the caramel, but don’t panic! You want that complex, bitter flavor; it will counteract the sweetness of the custard. This recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings1cup sugar3large eggs, room temperature114-oz. can sweetened condensed milk113.5-oz. can unsweetened coconut milk¾cup evaporated skim milk1tsp. vanilla extract¼tsp. kosher salt⅓cup toasted unsweetened coconut flakesSpecial EquipmentA layer of cheeseclothPreparationStep 1Place a rack in middle of oven and preheat to 325°. Set a 10”-diameter glass pie dish in a roasting pan.Step 2Bring sugar and ¼ cup water to a boil in medium saucepan, stirring to dissolve sugar, about 3 minutes. Cook, swirling pan occasionally and brushing down sides with a wet pastry brush (do not stir), until sugar turns deep amber, 10–12 minutes. Immediately pour caramel into pie dish and swirl to coat to the bottom. Let sit 10 minutes to allow caramel to set.Step 3Blend eggs, sweetened condensed milk, coconut milk, evaporated milk, vanilla, and salt in a blender until smooth. Skim off any thick foam that may have risen to the surface. Strain custard through a fine-mesh sieve lined with cheesecloth into pie dish.Step 4Transfer roasting pan with pie dish to oven and carefully pour hot water into roasting pan to come halfway up sides of dish (if you have one, a tea kettle makes this easy).Step 5Bake flan until just set in the center but still a little wobbly when gently jiggled and barely pale golden on top, 50–55 minutes. Carefully remove pie dish from roasting pan and transfer to a wire rack. Let cool 15 minutes. Chill until cold, 2–3 hours.Step 6Just before serving, run a knife along edges of flan, set a plate on top of pie dish, and carefully invert flan onto plate. Top with coconut flakes.Step 7Do Ahead: Flan can be made 1 day ahead. Keep chilled.How would you rate Coconut Flan?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis recipe was very good. We did the full recipe and used 6 ramekins, it was a pretty perfect amount. We tasted the custard before we baked it and it was overly sweet, so we added the juice of 1 lime, this made it really good! (Next time we might use 1.5 limes) The texture on the finished flans was creamy and had zero bubblage, awesome!austen.paulsen4022Plano, TX1/6/2020Explore Bon AppétitCustardDessertCoconut MilkOther IngredientsGluten-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}