{"id": "875030e5074cdf4c5abe3862c5108017", "url": "https://www.bonappetit.com/story/restaurant-chairs-comfort", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Are Restaurant Chairs Getting More Comfortable? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAre Restaurant Chairs Getting More Comfortable?A look at what goes into a comfortable restaurant chair: the cost, the cushions, and the consequences.By Alex BeggsMay 3, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere’s something I think about a lot, and that’s butts. Specifically: How is mine doing? Is it feeling good today? And lately my butt’s been saying, “Yes, actually! Very!” Because I swear, after so many years, restaurant chairs have finally gotten comfortable. Could it be true? What does it all mean?Simple economics tells us that the cheaper the chair → the less comfy the chair → the shorter the duration of the meal → the more tables a restaurant can turn → $$$. To invest in a better chair means you expect people to stay awhile. There will be after-dinner amaro. There will be cheese. There will be nice Yelp reviews. With all those extras, who needs a table turn? (Similarly, think about the plush new movie theaters with recliners to lure viewers away from Netflix. We’re in a Comfort Age, people!)Double-cushioned custom chairs in Detroit’s San Morello.\nCourtesy of Noho Hospitality Group/Nicole FranzenMy own chair epiphany began when I noticed the double-cushioned chairs at San Morello in Detroit, the Andrew Carmellini–helmed Italian joint inside the new Shinola Hotel. These wide bistro-style chairs, designed by Gachot Studios, support your achin’ back at the perfect rounded angle. At other tables there are long banquettes and authoritative leather chairs the color of melted chocolate. Catch me swirling a Negroni, ordering the 30-day prime bistecca, and talking about my cat drama in one of those.I called up designer Christine Gachot to get her read on my comfortable chair theory—untested by science, purely butthetical at this point. She confirmed my suspicions: “Our dining experiences outside of our home and our dining experiences inside our home are starting to blend. People are expecting the comfort level of residential in a public dining room,” she said. “I think a lot of it has to do with the way people stay in hotels too. We design hotels as if they were pied-à-terres. We design residences as if they were hotels.”For San Morello, Gachot designed a chair with a removable, customizable top cushion, and a slightly higher-than-usual back, for upper lumbar support even when you sink into it a bit. It has a wider-than-usual seat (23 inches), which Gachot said reflects the size of Shinola owner Tom Kartsotis, who’s 6’4”. The legs are sturdy wood on casters that won’t dut-dut-dut when you pull the chair out to sit. The leather on the banquettes will stretch and get even more comfortable as more butts sit in them, and the fabric will mature into a beautiful worn patina.The leather chairs at San Morello.\nCourtesy of Noho Hospitality Group/Nicole FranzenAbout those wider-than-usual chairs. As we talk about restaurants getting more inclusive, there’s more to be said about restaurant design, which can seem to favor the aesthetic over the customer. (For more on that, read this recent New York Times report on how larger diners eat out.) “A lot of restaurants are designed for—you know—skinny people,” said Stephani Robson, a senior lecturer at the Cornell School of Hotel Administration who teaches a course called Principles of Food Service Design. The biggest thing to remember when you’re designing a restaurant, she told me, is the kindergarten lesson too many have forgotten: “Guests come in different shapes and sizes.” A chair with arms might look stately at the head of the table, but it also might bruise a person’s obliques, or prevent some diners from sitting there at all. We photographed the custom-made chairs at Benno in New York, navy Bellagio velvet cushioned beauties with cushioned armrests (see up top). The restaurant also offers armless bucket-style chairs and spacious, curving booths.Robson also introduced me to the most important technical term I learned about chair design: butt depression. Picture a barstool with a rounded indentation to settle your cheeks into. When a stool’s too flat, you’ll slide off. If the butt depression’s absurdly small, you’ll feel the edge of the seat cutting into your thighs. “A restaurant that does it right is Marta,” Robson said of Danny Meyer’s Manhattan pizza spot. “The tops of those stools are oval-shaped, almost like a football as opposed to a pure circle, because that’s how our butts are designed, right? You have a bit more width when you sit down.”Then she got me thinking about the angles of the back of chairs. If the back’s too upright, you’ll feel like you’re on an airplane tarmac. “There should be a slight slope to it, somewhere in the order of 20 degrees or so,” Robson said. At the new Momofuku Noodle Bar in Midtown—the first location downtown was famously uncomfortable for butts—there are straight-backed booths padded with hot-dog-like rolls that squish a little when you lean into them, reminding me of a massage chair in a very good way. You’re not just here for a quick lunch bowl of ramen, but some mushroom buns, a bottle of sake, and sure, we have room for soft serve.One of the chair options at Benno, made in Milan by Colber and designed by Parts and Labor Design.\nPhoto by Alex LauSo far we’ve been mostly talking about a certain tier of restaurant—the two hour meal, not the 20 minute one. “In the restaurant industry, we don’t sell food,” said Robson, “we rent space.” The more comfortable you are, the longer you’ll hang, the more you’ll spend, the more space you’re renting. A cheaper, uncomfortable chair—maybe it’s aluminum or even plastic—is a signal to eat and go.Then there’s the “the four-hour chair,” Robson’s nickname for a seat so luxurious you’ll practically be snoring in it by the time the meal’s over. These are the widest chair—because you’re renting more real estate with your Chase Sapphire—allowing you to cross your legs and shift positions while the waiter tells you the mythic legend behind the pork belly. I myself had a test-sit on a four-hour chair at the new Four Seasons Restaurant, armchairs that increased my net worth by millions the second my butt brushed the custom tweed. They come in three warm-toned colors that complement the five shades in the restaurant’s terrazzo tile floors. Divine.After she broke down the details on the chairs at San Morello, Gachot told me about some of her favorite places to sit in New York. The original Harry Cipriani uptown, with buttery soft wooden chairs and worn leather cushions. Dreamy white wooden chairs with rounded backs and ivory upholstery that looks like buttercream cupcake frosting at Jean Georges’ JoJo. I took a turn to complain about one of my favorite restaurants, where the booth seats are so narrow I nearly disappeared under the table. Why is this cool restaurant so good at food and so bad at butts?! “There’s no excuse for it,” said Gachot. “Well, unless you’re waiting in line for a slice at Joe’s Pizza. Then it’s excusable. Anywhere else, you should be comfortable when you’re dining.”Explore Bon AppétitDesignRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-03", "author": ["Condé Nast", "Alex Beggs"]}