{"id": "875198b7b95139b8a09ac34a911b676f", "url": "https://www.bonappetit.com/story/coconut-whipped-cream", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "Coconut Whipped Cream Is the Long-Lasting, Vegan, 1-Ingredient, Keto-Friendly Whipped Cream Alternative | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Long-Lasting, Vegan, 1-Ingredient, Keto-Friendly(?!) Whipped Cream Coconut does it again.By Sarah JampelDecember 23, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailAs an erstwhile dairy lover who has recently entered the dairy-free world, I can tell you that some dupes are better than others: The “sour cream” isn’t fooling anyone, but the shredded “mozzarella”? I would—and do—eat it by the handful. And one of the very best dairy imitators of all requires no nuts and no heavy processing: It’s coconut whipped cream, and you can make it with one can and a bit of arm strength. Chill a can of coconut cream (or milk), skim off the creamy white layer, discarding the watery remains, and then whip the fatty part by hand or with a mixer. Add sugar and vanilla if you like, and that’s that.Before you rush to the kitchen to crack open your can of coconut cream, consider these keys to success. Begin by choosing a high-quality coconut product—some will whip up whiter, while others will take on a gray hue. Christian Reynoso, who serves coconut whipped cream with his Tropical Babas, likes Let’s Do Organic; vegan cookbook author Gena Hamshaw usually turns to Native Forest. You can use either coconut milk or coconut cream, but Reynoso and Hamshaw both go with cream—because you’ll be getting rid of all of the watery stuff anyway, cream generates less waste.Whatever you choose, chill it thoroughly to encourage the separation of fat and water and promote easy whipping. Hamshaw recommends chilling the can for two full days, though Reynoso takes a shortcut and sticks the can in the freezer for 30 minutes. Set a timer, though—if you leave it in the freezer too long, it will become too solid to manipulate.Follow all of these guidelines and you’ll get a glossy, voluptuous mass—thicker than real whipped cream and with more body and weight—that holds its shape beautifully and makes a logical accompaniment to pie, ice cream (dairy-free or not), and cake. When I tell you that I enjoyed a hefty dollop of unsweetened coconut whip on a slice of a very rich dairy-free chocolate tart, I am NOT—I repeat NOT—lying.But coconut whipped cream isn’t simply a stand-in for dairy-ful whipped cream—it also has distinct advantages. First, it’s nearly impossible to overwhip—you won’t get to the same weird buttery place you would if you took heavy cream too far. “I’m no coconut cream scientist,” admits Reynoso, “but it seems like coconut cream can’t be overwhipped. It only whips to soft or medium-soft peaks.”Second, coconut whipped cream tastes, well, distinctly coconutty. Whereas whipped cream is a bland, milky-rich backdrop, coconut whipped cream is bold, adding an element of flavor that makes plain or simple desserts—like a pile of fresh berries, a slice of unadorned pound cake, or a tender biscuit—feel special and complex.And, finally, coconut whipped cream won’t weep (a.k.a. exude moisture) over time, which means you can store it in the fridge for several days. Re-whisk it before serving to breathe in new life and then use it on more desserts or to make your morning coffee or afternoon snack luxurious. “When I have any whipped coconut cream around,” says Reynoso, “I’ll add it to iced or hot coffee. I dip bananas and whatever fruit I have in it too.”It’s probably not socially acceptable to dip a piece of fruit into whipped cream in the middle of the day. But dip a banana into coconut whipped cream? That’s basically a healthy snack.Get the recipeTropical Babas With Whipped Coconut CreamWe took the classic yeasted French dessert cakes known as babas on a tropical vacation with a boozy pineapple-rum sauce and pillowy whipped coconut cream.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-23", "author": ["Condé Nast", "Sarah Jampel"]}