{"id": "87527c37f3e559cba93af2e09eb28bc6", "url": "https://www.bonappetit.com/story/galettes-forever", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Summer Is Over but Galettes Are Forever | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSummer Is Over But Galettes Are ForeverFruit + dough = the most forgiving dessert for non-bakers out there.By Carla Lalli MusicSeptember 5, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When it comes to desserts, there are real bakers, like The Great Claire Saffitz, and there are savory cooks who also enjoy making sweets, like me. Real bakers make pie, and when they do, the crimping is always perfect and the bottom is never soggy. The rest of us make galettes.I love galettes because they let me be everything I want to be as a maker of desserts and as a hostess. They’re photogenic and they smell great, but they’ve got that casual “Oh I just threw this together” vibe, like the silk pajama top and cozy pants I hope I’m wearing when you come over for dinner. Galettes let you celebrate the seasons without being precious about it—a fact I set out to prove with a recipe that lets you use any fruit and a single dough. No matter what filling you choose, the method, oven temperature, and baking time all stay the same. We’re in stone fruit season now, but apples and pears are just around the corner, and you can swing into berries again next spring. Unlike perfect pies that disappoint when they don’t come out perfectly, galettes are molto rustico, a little unpredictable, casual but inviting. Is it the galette or is it my super laid-back entertaining vibe?! Who can say!Want this letter before it hits the website? Sign up for our newsletter!Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiGalettes are purposely achievable: All you need is a rimmed baking sheet, a bench scraper, and a rolling pin, and I keep those in reach. And because I’m a believer in getting great at one thing instead of being sort of okay at a lot of things, I’ve leaned into a single dough technique that outperforms itself every time. Instead of cutting or pulsing the butter into the flour so it forms little beads, you roll the butter into the flour so it creates long, flexible sheets. Not only do you not need a food processor, but those thin sheets of butterfat create a crisp, layered, flaky crust that breaks into shards when your fork hits the edge. It’s really something. And the more you practice, the better it gets. Best of all, each galette is an original—pastry acceptance means we embrace every shape. Ovals, rounds, oblongs, and even square-ish outcomes are all welcome here.Considering every galette is built on fresh fruit, sugar, flour, and butter, you’re always off to a good start. But the true beauty of a picture-perfect galette is that other people will taste it and swear you have special talents and abilities. When that happens, just nod and smile—a good host can take a compliment, too.Get the recipe:Peach-Plum GaletteYou can use any combo of stone fruit in this galette, so dream big! Apricots and cherries would be divine. Peaches and nectarines make good friends…View RecipeExplore Bon AppétitCarla NewsletterGaletteRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-05", "author": ["Condé Nast", "Carla Lalli Music"]}