{"id": "8759e2db8b56685b9210aa7e2521324d", "url": "https://www.bonappetit.com/recipe/blueberry-saffron-tea-cake", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Blueberry-Saffron Tea Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueBlueberry-Saffron Tea CakeBy Samantha SeneviratneJuly 6, 20214.6(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis dead-simple blueberry tea cake features a pop of saffron for an aromatic cake with a lovely yellow crumb. Expert baker and recipe developer Samantha Seneviratne recommends trying a slice for breakfast, topped with a dollop of yogurt or sour cream sweetened with a little sugar.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonRound Cake Pan$12.99 At AmazonWire Rack$23 At BA MarketIngredients8 - 10 Servings6Tbsp. unsalted butter, room temperature, plus more for pan½cup buttermilk, warmed⅛tsp. crushed saffron threads1½cups (188 g) all-purpose flour1tsp. baking powder¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. ground cardamom¼tsp. baking soda1cup (200 g) granulated sugar2large eggs, room temperature2cups fresh blueberries, divided; plus more for serving (optional)Sanding sugar (for sprinkling)Sweetened sour cream (for serving; optional)PreparationStep 1Preheat oven to 350°. Butter a 9\"-diameter cake pan. Line bottom with a parchment paper round; butter parchment. Combine buttermilk and saffron in a small bowl; let sit 5 minutes.Step 2Meanwhile, whisk flour, baking powder, salt, cardamom, and baking soda in a medium bowl to combine.Step 3Using an electric mixer on medium speed, beat granulated sugar and remaining 6 Tbsp. butter until light and fluffy, about 3 minutes. Add eggs one at a time, beating after each addition until combined and scraping down sides of bowl as needed. Reduce mixer speed to low and beat in half of dry ingredients. Add buttermilk mixture and beat just to combine, then mix in remaining dry ingredients (be careful not to overmix batter). Gently fold in 1 cup blueberries.Step 4Scrape batter into prepared pan and smooth surface. Sprinkle remaining 1 cup blueberries over top of cake, then sprinkle with sanding sugar. Bake cake until a tester inserted into the center comes out with a few moist crumbs attached, 50–65 minutes. Transfer pan to a wire rack and let cake cool 20 minutes. Turn out cake onto rack, then turn right side up.Step 5Serve slices of cake warm or at room temperature, topped with sweetened sour cream and more blueberries if desired.How would you rate Blueberry-Saffron Tea Cake?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis is a nice recipe but the saffron adds nothing, in fact it detracts.  Next time I will leave it out.AnonymousNew York, NY2/5/2022Any suggestions for a replacement for the cardamom?AnonymousLong Beach, CA1/30/2022I wonder if browning the butter would bring additional flavor?  What do people think?AnonymousSeattle11/14/2021This recipe is fantastic! I've made it twice with some changes. Instead of the 6 tbsp, I browned one whole stick of butter (8 tbsp, 113g) and once the water evaporated it came out to about 85 g, which is 6 tbsp. I let it cool but didn't wait for it to solidify when whisking with sugar. I also reduced the sugar to180 g the first time (a little too sweet), then160 g the second time. You can probably reduce it a little more to 3/4 cup (150 g), but amount of sugar depends on your preferences. The second time making it, I added sliced almonds in the batter and on top, with fewer blueberries. They came out beautifully delicious each time!Mary LArlington, VA8/28/2021Needed some inspiration so I took this recipe even though we were out of saffron. We added just a bit more cardamom and really enjoyed this recipe. Nice rise to it, moist, and fantastic with your favourite drink.KeithVancouver8/8/2021This was just wonderful. We didn't eat it with the optional extra blueberries or sweetened sour cream. After making the buttercream, I heated the buttercream in a small pan with the saffron, to draw out more saffron flavor.RonPReston, VA7/22/2021Delicious and a nice change in spices from the common cinnamon etc.\nI used a combination of blueberries & other seasonal fruits. Terri Victoria BC 7/21/2021This is wonderfully simple with an amazing result. I was dubious about the cardamom and saffron, and about using frozen blueberries instead of fresh, but we were very happy with this recipe. I will go a bit lighter on the saffron next time, or just leave it out since it won't affect the bake. I rinsed the ice off the thawed berries and let them drain so as not to add additional moisture when folding them in. This cooked in exactly 50 minutes in our gas oven, had a nice rise, and came out golden brown. This goes into our dessert rotation now! Thanks, BA!Kevin RAtlanta, GA7/17/2021Really delicious and so easy to make! Crunchy on the top and super moist cake. Loved the saffron and cardamom with the blueberries. LucyChicago 7/13/2021Explore Bon AppétitCakeDessertButtermilkOther IngredientsSaffronHerbs & SpicesBlueberryBerryFruitCardamomNut-FreeVegetarianBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Samantha Seneviratne"]}