{"id": "875bdd523cee9fb8af5f2f33f1b9e83d", "url": "https://www.bonappetit.com/recipe/charred-watermelon-punch", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "Charred Watermelon Punch Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesCharred Watermelon PunchFacebookPinterestTwitterEmailWatermelon slices on the grill adds summer BBQ vibes to this cocktail featuring Don Julio Blanco.PrintIngredientsServing size: 4 glasses¾ cup Don Julio Blanco, chilled¾ cup of seltzer, chilled⅓ cup fresh lime juice⅓ cup granulated sugarVegetable oil, for grill(1) 4lb baby seedless watermelonKosher saltIceSliced limeRecipe PreparationCut one watermelon in half, followed by ½-inch rounds.Preheat grill or grill pan over high heat and grease grates with oil. Add watermelon halves, cut side down, and cook until grill marks form, turning a few times to get a nice char all over, about 8 minutes. Remove to a plate and let cool.Add watermelon rounds to grill and cook just until grill marks form on one side, about 2 minutes. Remove from grill to a plate, char side up. Slice into wedges.For the remaining watermelon half, remove the flesh from the rind and discard rind. Transfer the flesh into a blender. Add lime juice, sugar, and a few pinches salt and purée until smooth. Strain through a fine mesh sieve into a punch bowl. Stir the Don Julio Blanco tequila and seltzer into the watermelon juice.Fill cups with ice. Ladle drinks into cups and garnish with lime slices and watermelon wedges.Recipe by Don Julio TequilaRelated VideoCharred Watermelon PunchReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredDon JulioMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Don Julio Tequila"]}