{"id": "875ec3328b1efaf09238d51c298afe03", "url": "https://www.bonappetit.com/recipe/spice-crusted-carrots-with-date-and-herb-salad", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Shawarma-Spiced Carrots With Date and Herb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueShawarma-Spiced Carrots With Date and Herb SaladBy Zaynab IssaMarch 15, 2022EmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintThese carrots get their crisp-tender texture from high-heat roasting and their earthy flavor from the shawarma-style spice blend. Dates add sweetness and chew to the herby, spicy salad that goes on top.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4–6 servingsCarrots¼cup extra-virgin olive oil2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt½tsp. ground cinnamon½tsp. ground coriander½tsp. ground cumin½tsp. ground turmeric½tsp. sweet paprika¼tsp. freshly ground black pepper⅛tsp. ground cardamom⅛tsp. ground cloves2garlic cloves, finely grated1½lb. medium carrots, tops trimmed to ½\", scrubbed, halved lengthwiseSalad and assembly2Tbsp. (or more) fresh lemon juice1Tbsp. extra-virgin olive oil1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, divided1small red onion, thinly sliced7Medjool dates, pitted, coarsely chopped2jalapeños, seeds removed, coarsely chopped1cup coarsely chopped tender herbs (such as cilantro, dill, or parsley)1cup labneh or plain whole-milk Greek yogurtPreparationCarrotsStep 1Place a rack in middle of oven; preheat to 450°. Stir oil, salt, cinnamon, coriander, cumin, turmeric, paprika, pepper, cardamom, cloves, and garlic in a small bowl to combine.Step 2Toss carrots with oil mixture on a large rimmed baking sheet to coat. Roast until carrots are crisp-tender and deeply browned, 15–20 minutes. Let cool.Salad and assemblyStep 3While the carrots are cooling, whisk lemon juice, oil, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a medium bowl. Add red onion, dates, jalapeños, and herbs and toss to coat. Taste salad and add more lemon juice if needed.Step 4Stir labneh and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a small bowl.Step 5To serve, spread labneh on a platter; top with carrots. Scatter salad over.How would you rate Shawarma-Spiced Carrots With Date and Herb Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerSideEasyVegetarianGluten-FreeNut-FreeHealthyishRoastSaladCarrotVegetableDateDried FruitFruitCilantroHerbs & SpicesParsleyRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Zaynab Issa"]}