{"id": "87670dba6af4f069d30fb8616e139cea", "url": "https://www.bonappetit.com/story/there-will-always-be-oysters", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "There Will Always Be Neptune Oyster | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWe Needed Our Routine. And We Needed a Lobster Roll.My partner and I both lost our jobs within a week of one another. So we got oysters. And a lobster roll.By Korsha WilsonJune 6, 2018FacebookTwitterEmailNeptune Oyster - Night time shotsPhoto by Ana M. ReyesFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.When I’m seeking comfort, I go to the cool marble countertop at Neptune Oyster. And I really needed it in 2011 after my partner and I had both lost our jobs within a week of one another. After sitting in our apartment for hours, too numb from being laid off to cook and too scared to start to look for new jobs, we found the energy to take the subway to Neptune in the North End neighborhood of Boston. We posted up on backless stools at the bar and ordered some much-needed wine.Neptune Oyster is known for having some of the most pristine seafood in the city, and with the exception of Fenway, has the most coveted 37 seats in all of Boston more than a decade after it opened in 2004. There is always a wait for a seat at the bar or one of the tables in the tiny dining room decorated in nautical shades of white and blue with plenty of mirrors. It’s a pragmatic brasserie, stripped to efficiency in a pleasant way that pulls no punches, much like New England.Neptune manages the impossible task of being a destination restaurant that feels like a neighborhood restaurant thanks to the familial warmth of the staff and a menu of local seafood and dishes that please both regulars and tourists. It’s gained national acclaim for dishes like the warm buttered lobster roll or the cornmeal johnnycake drenched in honey butter and topped with smoked bluefish and sturgeon caviar.The scene at Neptune's.\nPhoto by Alex LauAs we settled into two seats at the bar, we said hello to the servers, most of whom have worked there for years. We looked over the menu. It was the same as it always was. “Sea Urchin” was written on the “DAILY SPECIAL” chalkboard sign behind the bar. I started to panic. We’d both lost our jobs and we were about to spend money on a meal to make us feel better? Was this a wise financial decision? We picked the cheapest bottle of white wine on the list and ordered oysters, a johnnycake, and a lobster roll.The expectation was that we would discuss our next steps while sitting on those bar stools, but we didn’t. We talked about our families, how we wanted to go to the beach soon, anything but unemployment. This was our routine at Neptune Oyster and probably the reason that we needed to eat here on this day. We needed a reminder that amid the upheaval in our lives some things are constant, and fixed energy can be grounding when you need it most. It was the only thing we could think to do after having the rug pulled out from under us.At the end of our meal we walked onto Salem Street toward the Greenway, a public park at the edge of the North End, and sat on the grass. Fortified with wine and seafood, we were ready to take the unsteady steps into our future. I looked over at my partner and saw that his eyes were closed. He opened them and let out a heavy sigh, “So what’s next?”Korsha Wilson is the host of the podcast A Hungry Society and lives in New Jersey.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsBostonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Korsha Wilson"]}