{"id": "8767b2c9b71092af2a64c50526524701", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/fishermans-terrace", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Fisherman’s Terrace Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverFisherman’s TerraceDestination-worthy dim sum in a Chinese-food capital (a.k.a. Richmond)FacebookPinterestTwitterEmailGrant HarderGO HERE: for quality dim sum in Richmond, Vancouver’s easily accessible neighbor known for having the best Chinese food outside of China. Fisherman’s Terrace’s palatial space is located in a mall—as all good Richmond restaurants are—and stays busy from open to close.ORDER THE: shredded chicken cold plate (which you’re right, does not sound inspiring, but you won’t regret this savory-crunchy-pickle-y salad); Chinese doughnut rice rolls; flaky barbecue pork pastries; and deep-fried taro balls. The shrimp with leek dumplings, pan-fried eggplant with shrimp paste, and turnip cakes with preserved meat are also excellent, as is the XO sauce (go ahead and ask for another tiny bowl of it). The menu is very reasonably priced, so don’t hold back.THE VIBE IS: bustling, with the steady hum of clinking dishes, large families conversing, and small cousins chasing each other around the tables.PRACTICAL STUFF: Open every day, from 10 a.m. to 2:30 p.m. for dim sum; and from 5:30 p.m. to 9 p.m. for dinner. Reservations by phone are strongly recommended. In terms of getting there, hop on the SkyTrain (any headed south on the Canada Line to Richmond Brighouse) and exit at Aberdeen Centre. The station is connected directly to the mall where the restaurant is located.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVERodney’s Oyster HouseSerious oyster curation in Yaletown, but that’s about where the seriousness endsKishimotoThe Drive’s no-frills standby for impeccable sushiGranville Island Public MarketAll the Canadian food (smoked salmon!) under one roof Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}