{"id": "8778904a14d3c8655471c91defd0d0a6", "url": "https://www.bonappetit.com/story/cruse-wine-co-sparkling-valdiguie", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Cruse Wine Co's Sparkling Valdiguie Is the Wine That Never Changes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleEverything Is Different So I'm Drinking a Wine That Doesn't ChangeIt’s celebratory and it’s dreamy, and by the time you look down at the glass, you’ll realize it’s halfway gone.By Marissa A. RossMay 12, 2020FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.What wine do I want to drink right now? It’s a simple question and one that I’ve asked myself thousands of times. In fact, it’s the question that started this column. This month, however, I had to ask myself a much harder version: What wine do I want to drink after I’ve recovered from [every expletive ever] shingles?Spending nearly a month on the couch chowing down on antivirals, opiates, vitamins, and every season of RuPaul’s Drag Race gave me a lot of time to think about it. The day before my rash went from garden-variety hives to blistering hell, I’d bought three mixed cases of wine. My wine fridge overfloweth with Italian reds and German blends while I panicked over which bottle I would write about in the two to six weeks these [every expletive ever] shingles were going to take to heal.But on the day the doc cleared my health, I knew exactly what I wanted to drink. I immediately opened the fridge and popped Cruse Wine Co.’s Valdigué pétillant naturel. It’s a wine I always relish in the long spring-into-summer afternoons. The naturally sparkling wine made from California’s historically beloved grape Valdguié (once known as “Napa Gamay” for its light, fruity juice) pours into the glass all peachy and pink. It fizzes with the fond aromas of strawberry shortcake, playful and warm, inviting you to take a sip. It tastes like a dessert you might find at Disneyland—let’s call it Whipped SweetTarts—made of sour blackberries, strawberries and oh-so-soft hibiscus cream. It’s celebratory and it’s dreamy, and by the time you look down at the glass, you’ll realize it’s halfway gone.Here’s the thing about award-winning California winemaker Michael Cruse’s sparkling wines: They are fantastic, at times even fantastical, but they are also reliable. Consistency, whether it be from bottle to bottle or vintage to vintage, has become an underrated quality in the natural wine world; one could argue that it’s even maligned. I’m not innocent in this—I’m the one who buys mixed cases looking to discover bottles that taste unlike anything I ever have before. But I didn’t even think of those wines when I had finally kicked shingles. I opened a bottle I love and always go back to this time of year—year after year.Buy it: 2019 Cruse Wine Co Sparkling Valdiguie, $41All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishUnfiltered essayRead MoreLifestyleThis Perfectly Balanced White Wine Connects Me to My CommunityBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Marissa A. Ross"]}