{"id": "87a42c38c30f6e4b8b4d116e74b301a5", "url": "https://www.bonappetit.com/recipe/tahini-rice-crispy-treats", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Rice Crispy Treats Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTahini Rice Crispy TreatsBy Sarah JampelDecember 11, 20194.3(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintRice Krispies Treats meet sesame halva in these savory-sweet six-ingredient bars (salt doesn’t count!). Use whatever brand of crispy brown rice cereal you can find, avoiding the “puffed” varieties, which have a tendency to be more squishy than crunchy. You can even use regular Rice Krispies cereal instead of crispy brown rice cereal, but since Rice Krispies are smaller and less dense, your bars might be a little bit softer than intended, though still delicious. For the sturdiest bars, be sure to really compact them and keep them in the fridge so they stay firm. IngredientsMakes 163¼cups (130 g) crispy brown or white rice cereal¼cup (30 g) cacao nibs1Tbsp. virgin coconut oil¾cup (185 g) tahini¼cup plus 1 Tbsp. (90 g) honey¾tsp. kosher salt½tsp. vanilla extractPreparationStep 1Line an 8\" or 9\" square pan with parchment paper, leaving an overhang on two sides. Toss cereal and cacao nibs in a large bowl to combine.Step 2Melt oil in a small saucepan over medium-low heat. Add tahini, honey, and salt and whisk until warmed through, smooth, and slightly thinner, 45–60 seconds. (Don’t be tempted to cook this longer—the tahini can start to crystallize, which will make it grainy.) Remove from heat and whisk in vanilla.Step 3Pour tahini mixture over cereal mixture and stir to coat. Transfer to prepared pan and press down very firmly (seriously, give it your all!) with the bottom of a heavy glass or measuring cup to compact. Chill bars until firm, 30–40 minutes.Step 4Lift out bars using parchment overhang and cut into 16 squares.Step 5Do Ahead: Bars can be made 1 week ahead. Cover and chill.How would you rate Tahini Rice Crispy Treats?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleLoved these! Made with my kid - very fun as a cooking project with a little one. Easy to adapt and pretty healthy, plus can take as a school snack as it’s nut free. We used rise krispie cereal, mighty sesame organic tahini (comes in a squirt bottle, easy to work with), coconut manna and some olive oil (no coconut oil on hand), honey, salt, vanilla paste. We made two versions: one with raisins and cinnamon, one with dehydrated raspberries crushed up. Both were so delicious! They were a little crumbly so we added a little more tahini and honey and remixed them - pushed them FIRMLY into a small pan and chilled again. Came out much better. The raspberry tahini was kind of like PB&J and the raisin was like a crispy oatmeal cookie.AnonymousNYC10/9/2021These really hit the spot, and are relatively low calorie. I used chocolate chips instead of cacao nibs (which I couldn't find) and the chocolate melted but they were still so good (or even better?). They held together very well.  I used a piece of parchment paper on top and used my hands/palms to really press them down.Matt M.New York3/22/2021The first time I tried this, it didn't hold together, and was a little salty.  I made it again with less salt, and added (forgive me) chocolate chips.  Then, I pressed it into a cookie sheet and put another cookie sheet on top and sat on it!  Finally, I brushed the top with more melted chocolate and refrigerated it overnight.  It cut beautifully, almost no crumbles, and might I add that it tastes great?KlezMomIllinois9/21/2020Made these using chocolate rice krispy cereal, toasted sesame seeds mixed in instead of cocoa nibs and a dark chocolate drizzle on top. Quick and delicious but don’t stay together very well. Anonymous3/25/2020Made these during quarantine to use up a weird amount of tahini I had in the fridge (also somehow had rice crispy cereal?). Made half a batch, used chocolate chips instead of cacao nibs, and tasted the tahini mixture before combining with the cereal (added a little more salt). Absolutely loved them! Thought I would like them enough, but did not expect to be blown out of the water.AnonymousChicago3/23/2020These are so addicting! Made them for a dinner party and we couldn't stop picking at them even though everyone was stuffed. Might try a drizzle of semisweet chocolate over the top next timeAnonymousBoston, MA3/7/2020Wow, this recipe is truly great! Canadians, the \"puffed\" rice I bought was crispy and didn't become squishy.\n\nOne difficulty with the recipe is trying to compact everything. The tahini/honey mixture is very sticky. I would recommend having enough parchment overhang that it fully covers the top of the pan. Fold that overhang over and press down to avoid a sticky mess.AnonymousToronto1/22/2020Oh my god, these are incredible!! Super easy and yummy. To prevent crumbling, I put a piece of parchment paper down and then a book and stood on them (as savannahtabitha suggested) before putting them in the freezer, and that worked perfectly. I also kept them in the freezer when I wasn't eating them to help keep their structure. Def going into my dessert rotation!Boston, MA1/21/2020Yes, these are a little crumbly, but are also fully delicious.  Especially when you allow them to crumble over a bowl of chocolate ice cream.Brooke  EverettPhiladelphia, PA1/20/2020This is a fantastic recipe... IF YOU HAVE GOOD TAHINI. I made it with Joyva and they were awful (granted now I think Joyva is inedible). I made them a second time substituting cashew butter (since my new tahini is still en route) and they were so much more delicious. You really have to press hard to form them - I placed a small book in my 8x8 pan and stood on top of it to make sure they were firm. Voila! They held together perfectly! savannahtabithaPhiladelphia, PA1/11/2020Holy mackerel, I can't stop thinking about this bars. Made them earlier this week for preschool communal snack (omitted the cacao nibs to increase chances that 4 year olds would eat them), and just made another batch today for home. The kids universally loved them (which always feels like a win) and the fact that they're nut-free was a nice bonus to make them school-friendly. Obsessed.chelseamorseAstoria, NY1/10/2020I wanted to make this so badly however I could not get past how much it looked like “bug/maggots” \nAnonymousKansas1/8/2020These sounded so promising. Try as I might, to PACK the mixture into the pan, they still crumbled and after 2-3 days took on a strange (fermented?) tinge. The grand kids would not eat them. They left a crumbled mess everywhere.AnonymousTerrace BC Canada1/6/2020These are perfect! Used maple syrup instead of honey to make the recipe vegan and let the bars solidify overnight. My friends and I have already made these twice!Philadelphia12/19/2019I  bake with tahini all the time and I want to love these - but they came out dry and crumbled too easily. They were rather addicting but I wouldn't make them for friends.AnonymousToronto12/16/2019Explore Bon AppétitCookieDessertBar CookieTahiniCondiments, Sauces & PastesEasySnackDairy-FreeGluten-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-11", "author": ["Condé Nast", "Sarah Jampel"]}