{"id": "87af9ec39a9ba554d599ee0fbbf98ae6", "url": "https://www.bonappetit.com/story/sharon-richardson-just-soul-catering", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Sharon Richardson Learned to Cook in Prison. Now, She’s Bringing Those Lessons Outside | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSharon Richardson Learned to Cook in Prison. Now She’s Taking Those Lessons OutsideThe founder of Re-Entry Rocks and Just Soul Catering is using food to support women through life after incarceration.By Bettina MakalintalNovember 8, 2021FacebookTwitterEmailPhotography by Isa ZapataFacebookTwitterEmailIn Person of Interest we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Sharon Richardson, founder of nonprofit Re-Entry Rocks and sister company  Just Soul Catering.Work with Just Soul Catering for an event and you’ll get not only bubbling trays of mac and cheese or stewed oxtails and jerk chicken, but also a stake in founder Sharon Richardson’s vision: one in which she—and other formerly incarcerated women—build their futures through food. Raised in Brooklyn’s Bedford-Stuyvesant in a Caribbean family and surrounded by friends from the South, Sharon has always known good food. And in 2016, when she founded Just Soul, she took hold of its transformative power.Richardson came home in May 2010, after 20 years of incarceration for the murder of her abuser. Reentering the world was a challenge. Even seemingly banal tasks, like sending email, had evolved while she was inside, and the label of being formerly incarcerated was a barrier of its own. But when she was offered a role in a performance of The Vagina Monologues in 2016, the producers recognized Richardson’s determination and suggested she become an entrepreneur. That seemed an unlikely possibility to her; after all, she didn’t have money or good credit. Still, the seed was planted, and that same year Richardson joined an entrepreneurship program led by Defy Ventures, a nonprofit organization that provides employment and business training for formerly incarcerated people—a group who experiences an unemployment rate nearly five times higher than the general population.Richardson had been working at another nonprofit called Steps to End Family Violence since 2010. It was her “molding ground,” she says, where founder Sister Mary Nerney encouraged her to grow and stand on her own. After Nerney passed away the program’s new director pushed Richardson to do her own thing, promising that Steps would always be there if she wanted to come back. “And look at me now,” Richardson says. Before starting Just Soul she’d also founded the sister nonprofit Re-Entry Rocks to provide job training, creative outlets, community, and counseling to formerly incarcerated women with histories of domestic violence.I visited Richardson at the office space she shares in Queens to learn more about how food has changed not only her life but also the lives of the women she works with—and to understand her dream for Just Soul’s future.Our mission at Re-Entry Rocks is to… help all women and nonbinary people who are coming home and want to create a new life moving forward. I always tell people, “We need to change the way the world sees formerly incarcerated individuals, sees women, sees mothers, daughters, friends—all that we are.” We want to be able to help you not go back to the way life was. What better way to do it than through a group of people who have already paved the way? Having an executive director who’s formerly incarcerated—having a Black woman who’s gone through what I've gone through, actually run the nonprofit—I think is quite different.Reentry is a difficult journey… but we hold the hands of the sisters coming behind us and we create a chain that can never be broken. I thank God every day for this gift of community that was given to me. It didn’t seem like a gift when I was going through it, but now that I’m home, I give this gift away freely. I will bring women along with me.When I was on the inside… my mom got really sick. It was during my 18th year, going into my 19th year. I had a choice to either go to her bedside and say goodbye or to the funeral. I chose to go to the bedside visit. I lived on an honor unit and the officer allowed the women to cook, so when I came back, we all sat around and we ate and we cried, and we laughed, and we ate. Just Soul Catering and Re-Entry Rocks come from that moment.The cafeteria food inside... was so bad. That processed food is almost like part of the punishment—maybe it is. You’re given this food that could eventually give you high blood pressure, diabetes, possibly cancer. It’s horrible. But when you’re hungry, you eat. Just Soul is definitely helping to change the way formerly incarcerated women eat.When we got food packages from the outside… we would cook and share with the people who didn’t get visits, didn’t get packages. Food is a life-changer, it's a motivator. It's a means of sharing, a means of giving. For incarcerated women, we used that; we didn’t know what we were doing, what it meant, and how it could be utilized in life after.While inside, I learned how to make… chicken, fish, and curry, and different styles of foods I was already exposed to growing up. Sometimes you’re sitting around eating something really good—let’s just say mac and cheese and some good barbecue chicken—and having a day of laughter and talking about being free. Right in that moment where everyone’s so happy, the memory comes back of someone losing their child, or losing mommy while I was inside. The food’s there—it did its job—but the sadness comes over, and then the happiness comes back. It’s like yin and yang.Sharing food feels… healing. Incarceration, domestic violence, trauma. People say, “Food? How does food have anything…” It's everything to do with it. Even though those things are going on, you must eat, you must live. Someone may be laying on their bed who just got that 25-years-to-life. You take the food to them: “Baby, you’ve got to eat.” “I don’t feel like it.” “But you have to. It’s going to give you strength. And after you finish that, there's more. Come in the kitchen with us, hang out. We’ll cry with you.”We're just a small nonprofit right now… and a small catering company, but we’re big in spirit. Once you’re a part of Re-Entry Rocks and Just Soul Catering, you are an alum forever. When we hopefully become, one day, an amazing organization that can turn into a foundation, we can fund the women who are going to become entrepreneurs. We want to be able to tell them, “You don’t have to stay under Re-Entry Rocks and Just Soul forever. Do your own thing; we got you.”To keep doing this work we need… our own space. It would look like this amazing commercial kitchen. You could see the sign that says, “We made it.” It would have an office space where we conduct relationships with people from the outside; we don’t even have our own phone now. We would have our computer room. We’d have a lunchroom where we could all eat, separate from the kitchen, and possibly a café to invite the community in—grab three or four people off the street, introduce them to Just Soul, and say, “We’re going to teach you how to make cornbread today.”We would have pictures on the wall… of our graduation ceremonies and the women walking out the door with a certificate and letter in their hands, starting their own businesses. We’ve got the pictures already; we just need our own wall to put them on.Explore Bon AppétitCulturePerson of InterestRead MorecultureHey, It's Your Korean DadBy Bettina MakalintalLifestyle‘Kid of the Internet’ Quinta Brunson Wants Us to Keep Growing (and Growing and Growing)By Leigh-Ann JacksoncultureThis Book Is Making Life With Endometriosis a Whole Lot BetterBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-08", "author": ["Condé Nast", "Bettina Makalintal"]}