{"id": "87b11afe30aff1060aa053b17cd16f3f", "url": "https://www.bonappetit.com/story/philadelphia-cream-cheese", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "How Philadelphia Cream Cheese Took Over the World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Philadelphia Cream Cheese Took Over the WorldThere’s something about that recipe that made it number one…or is it something else?By Priya KrishnaJanuary 14, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailWhen it comes to baking, everyone has an opinion on the superior brand of butter (President? Kerrygold? Finlandia?) or flour (King Arthur? Gold Medal? Bob’s Red Mill?). But there is only one cream cheese, and that is the brick-shaped silver package with the bright blue lettering: Philadelphia.“I only believe in Philly cream cheese,” wrote BA’s Claire Saffitz immediately after I’d emailed her. “It’s just the best, and nothing else tastes right.”“I don’t think there is anything else like it,” says Priscilla Scaff-Mariani, the executive pastry sous chef at Gabriel Kreuther in New York, about its flavor and texture. “Even when I was in culinary school, it was like, ‘Oh, we need cream cheese?’ It’s Philadelphia. It wasn’t even a second thought.”Philadelphia cream cheese’s dominance isn’t a happy accident. Its cult popularity is likely the result of equal parts clever marketing and good timing.The brand dates back to the late 1800s, when Pennsylvania dairies became known for their soft, creamy cheese made with whole milk. New York dairies, on the other hand, were making a version with skim milk that was much chalkier. One scheming New Yorker named William Lawrence started selling his own cream cheese (it was actually made of skim milk, with some lard mixed in for richness) under the label “Philadelphia,” hoping the Pennsylvania association would attract customers. He even trademarked the words “Philadelphia” and “Pennsylvania” in conjunction with cheese products. It worked—and sold. When the company merged with Kraft Foods in 1928 and developed a pasteurized version of the product, Philadelphia cream cheese became a household name.Philadelphia cream cheese was both the first product of its kind—a shelf-stable, rich, tangy, spreadable soft cheese—and “one of the first branded food products in America,” says Stella Parks, author of the nostalgic baking book, BraveTart. “Philadelphia has been in the cream cheese game for so long that it became synonymous with cream cheese.”The second stroke of genius on Philadelphia’s part was marketing to home bakers. During the 1900s, recipes were beginning to be distributed through magazines, newspapers, and advertisements. In 1937, Philadelphia was publishing ads that included a recipe for \"Philadelphia cake,\" a vanilla-flavored confection that called for five and a half packages of Philadelphia cream cheese in the batter. Women’s magazines framed Philadelphia cream cheese as a fancy ingredient for entertaining. In an April 1909 article in the Perry Daily Chief, cookbook author Emma Telford extols the benefits of using cream cheese in cheesecake: “As formerly made, there was a tedious separation of curds and whey, but the housewife of today eliminates that by taking a Neufchâtel or cream cheese as the foundation.” Countless cookbooks that followed called for bricks of Philadelphia cream cheese in baking but also for savory dips, spreads, and stuffings.“People liked the recognizable brand names,” Parks says. “They felt good about it regardless of quality.” Philadelphia became the most trusted cream cheese, even as others entered the market. According to a spokeswoman for the company, it currently occupies 68 percent market share in the U.S. alone.But its continued popularity isn’t due to the nostalgia factor alone. Thanks to a good amount of stabilizers and an almost alarmingly silky texture, Philadelphia cream cheese just works really well in desserts.Alex Raij, chef at New York Spanish restaurants La Vara, El Quinto Pino, Txikito and Saint Julivert Fisherie, loves the cream cheese’s “plasticity,” she says. “You can mold it in your fingers. It has that particular body that makes it easy to cream ingredients with. It naturally emulsifies.” She even uses it in ice cream—a move she learned from Jeni Britton Bauer of Jeni’s Ice Cream—to create an eggless base that isn’t vulnerable to icicles.Philly cream cheese is what makes the frosting on Basically’s sheet cake easy to swoosh into pretty waves.\nSaffitz says she can’t count how many times she has whipped Philadelphia cream cheese into birthday cake frosting or baked it into a cheesecake. “I love how it whips up so creamy and smooth,” she says, “but also adds such wonderful heft and density. The flavor is tangy and balanced.”Scaff-Mariani points to the high silkiness and low moisture content of Philadelphia relative to other brands. “It mimics the consistency of butter in a lot of ways,” she says. In addition to using it for cheesecakes, she has also tried it in macaron fillings and in cookies. She’s heard of bakers using it to make puff pastry.There’s also the consistency factor. Jessica Craig, pastry chef at L’Artusi in New York, says she uses Philadelphia more than any other brand because it is “the same texture every single time,” which is important in a fast-paced, high-volume kitchen environment. She works in an Italian restaurant, but when customers order cheesecake, she doesn’t turn to ricotta or mascarpone—she uses Philadelphia.American bakers aren’t the only lovers of soft, spreadable cheese. Philadelphia has cultivated the same brand loyalty across the world, primarily in countries that love cheesecake as much as us. (A Philadelphia spokeswoman declined to share the top countries for cream cheese sales.)Norie Uematsu, executive pastry chef at Cha-An Tea House in New York, grew up in Japan, where Philadelphia cream cheese is well-known and used to make Japanese soufflé cheesecake, which is much airier than a traditional iteration, as well as a rare cheesecake, a no-bake dessert consisting of cream cheese, sugar, heavy cream, and gelatin.Two pounds of cream cheese go into this Basque-style cheesecake. Two. Pounds.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensRaij described a “Basque love affair with Philadelphia cream cheese,” pointing to the custardy black-topped burnt Basque cheesecake. Spaniards also put it in savory dishes, like cream-cheese-stuffed Piquillo peppers. In Spain it’s often spelled like “Filadelfia,” and pronounced “Pea-la-del-pia,” Raij says.And yet, despite its fame, Philadelphia’s primacy hasn’t gone completely unchallenged either.Noah Bernamoff, who runs Black Seed Bagels in New York, swears by Ben’s, a brand of cream cheese popular in New York, because it “has the actual flavor of fresh cheese” and produces fluffier cheesecakes without a long list of mystery ingredients. “Philadelphia is really just a texture,” with no flavor, he says.Parks shares that skepticism. She tests her recipes with Philadelphia because she knows that’s what most people use. But aside from her cream cheese frosting recipe (where Philadelphia’s thickeners and stabilizers prevent the cream cheese from turning into soup), she has tried each of her desserts with other brands of cream cheese and did not find a major difference in quality.“On a personal level I can’t say that I have some deep affection for Philadelphia,” Parks says. Using it is “just a way to lock down variables.” Other than that, she doesn’t really understand bakers’ deep affection for it. “People stick with what they know.”Explore Bon AppétitCream CheeseGroceryRead Morerecipes27 Cream Cheese Recipes To Use What's in the Back of Your FridgeGallery27 SlidesBy Bon AppétitcookingWhat is Vanilla (And Why Is It Sooo Expensive)?By Sarah JampelEasy Sheet Cake with Chocolate-Cream Cheese FrostingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-13", "author": ["Condé Nast", "Priya Krishna"]}