{"id": "87bccc9425f6821e69f96ec7c2eb7437", "url": "https://www.bonappetit.com/recipe/coconut-chia-tapioca-pudding", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Coconut Chia-Tapioca Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueCoconut Chia-Tapioca PuddingBy Claire SaffitzJanuary 11, 20184.0(5)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintHealth food stores often sell already shelled fresh coconut meat. If you can’t find it, buy a whole coconut instead. Look for one that’s heavy for its size and filled with liquid (give it a shake to be sure).Ingredients6 servings½cup large pearl tapioca (not instant or quick-cooking)1tablespoon white chia seeds213.5-ounce cans unsweetened coconut milk½teaspoon kosher salt⅓cup light agave nectar, plus more for serving1cup chopped fresh coconut meat½cup chopped fresh pineapple, plus more for servingSliced mango and toasted unsweetened shredded coconut (for serving)PreparationStep 1Combine tapioca and 2 cups water in a medium bowl. Combine chia seeds and ½ cup coconut milk in a small bowl. Cover both bowls with plastic wrap and chill overnight. Pour remaining coconut milk in open can into an airtight container or another small bowl; cover and chill until ready to use.Step 2Drain tapioca pearls. Combine reserved coconut milk and coconut milk from remaining can in a medium saucepan; add salt and ⅓ cup agave. Bring to a boil over medium, reduce heat, and simmer, stirring constantly, until reduced by one-quarter, about 5 minutes. Add tapioca and cook, stirring constantly, until tapioca is translucent and tender but still chewy in the center, about 5 minutes. Set saucepan in a bowl of ice water and let cool, stirring occasionally.Step 3Stir soaked chia seeds, coconut meat, and ½ cup pineapple into pudding and scrape into a large bowl. Cover with plastic wrap, pressing directly onto surface, and chill until thickened and cold, at least 2 hours.Step 4To serve, stir pudding well and divide among bowls. Top with mango, shredded coconut, and more pineapple and drizzle with some agave.Step 5Do Ahead: Pudding can be made 2 days ahead. Keep chilled.How would you rate Coconut Chia-Tapioca Pudding?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made this recipe today. I thought it looked interesting, healthy and different. I had the chia seeds, I love coconut and wanted to try tapioca. So I took the plunge. It was fun making this BUT, as I told my husband while we were eating it, \"it's like the dessert from a different planet\". Just not impressed. With all the fruit prep, it looks pretty but not worth making again. Taste is just ok with a strange twist because of the texture. CFooteSouthern California3/28/2019I really liked this! It makes a really tasty dessert, and it's easy to make apart from the overnight soaking.\n\nNotes: I did omit the 1/3c agave initially, because I like things less sweet and I find that coconut milk and pineapple already have a bit of sweetness to them, and I just drizzled a little over the top to serve - it was quite sweet enough for me. I also served it without the extra toppings because I was lazy and didn't have more pineapple or mango on hand, and it was delicious regardless! I used black chia seeds instead of white because I have a surplus. Other than making it a slightly gray color in places with the swollen seeds, it didn't affect the taste at all.\n\n(For Anonymous below, I used Hoosier Hill Farm Large #40 Tapioca Pearls from Amazon.com, and they worked really well. I even left them soaking for two days in the fridge without them disintegrating.)eurystomusSeattle WA1/17/2019The large pearl tapioca that I've been able to find locally would not work in this recipe. When I add them to any liquid to soak, they immediately start to dissolve and break down. Within 30 minutes, they are a layer of white grainy smush at the bottom of the bowl. Where can I find the type of pearls which you use and what are they called? I've purchased to different brands and they've both done the same in liquid.AnonymousColumbia, MO4/15/2018Explore Bon AppétitPuddingDessertTapiocaOther IngredientsChiaSeedCoconutFruitCoconut MilkPineappleQuickDairy-FreeGluten-FreeVeganHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-11", "author": ["Condé Nast", "Claire Saffitz"]}