{"id": "87bed6ef6666a6eb82f4950f1bdd4780", "url": "https://www.bonappetit.com/recipe/earl-grey-yogurt-cake", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Earl Grey Yogurt Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEarl Grey Yogurt CakeBy Molly BazFebruary 16, 20204.7(311)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan Spungen EmailPinterestPrintEmailPinterestPrintSay hello to the second recipe in the Basically Guide to Better Baking, our 10-week, 10-recipe series to help you become a better, cooler, more confident baker. A tea cake that's true to its name, it harnesses the power of citrusy Earl Grey tea for its distinct flavor. Lemon poppyseed can't hold a candle. Because high quality loose-leaf tea is often much more fragrant and flavorful than tea bags, you won’t need as much of it. If you’re using tea bags, just snip them open and measure out the tea inside. More questions about the recipe? You can ask them on our baking forum and receive a response from one of us or your fellow bakers. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLoaf Pan$15 At AmazonParchment Paper$3 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonLarge Bowl$18 At AmazonSpatula$12.99 At AmazonStainless Steel Skewer$5.89 At AmazonWire Rack$23 At BA MarketSmall Offset Spatula$6 At AmazonIngredientsMakes one 9x5\" or 8½x4½\" loaf1cup vegetable oil, plus more for pan2cups (250 g) all-purpose flour1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt½tsp. baking powder½tsp. baking soda2large eggs1¼cups (250 g) granulated sugar1cup plain whole-milk yogurt3Tbsp. loose-leaf Earl Grey tea or ¼ cup tea from bags2tsp. vanilla extract1Tbsp. raw or granulated sugarPreparationStep 1Preheat oven to 325°. Lightly coat a 9x5\" or 8½x4½\" loaf pan with vegetable oil and line with parchment paper, leaving overhang on long sides. If you’re not sure what size your loaf pan is, measure it with a ruler from inside edge to inside edge for both the length and width. If you measure from the outside edge, you’ll get an inaccurate reading of the width of the pan, and your cake may end up overflowing! It's the actual empty space of the pan where the cake bakes that matters here, not the width of the entire pan including its edges.Step 2Whisk 2 cups (250 g) all-purpose flour, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, ½ tsp. baking powder, and ½ tsp. baking soda in a medium bowl to combine.Step 3Vigorously whisk 2 large eggs and 1¼ cups (250 g) granulated sugar in a large bowl 1 minute (seriously, time it!); mixture should be pale yellow and frothy. Whisk in 1 cup plain whole-milk yogurt, 3 Tbsp. loose-leaf Earl Grey tea (or ¼ cup tea from bags), and 2 tsp. vanilla extract.Step 4Gradually stream in 1 cup vegetable oil, whisking constantly until incorporated. (Place a kitchen towel under your bowl to stabilize it so that you have two free hands.) Add dry ingredients and whisk to combine. Scrape batter into prepared pan and smooth top. Gently tap pan against surface to eliminate any air bubbles.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Sprinkle evenly with 1 Tbsp. raw or granulated sugar. Bake cake until a skewer or toothpick inserted into the center comes out clean, about 1 hour.Step 6Let cool 15 minutes in pan, then run a butter knife or offset spatula between the cake and pan to release. Lift it out using parchment overhang and transfer to a wire rack. Serve warm or room temperature (or even better, toast slices and slather them with butter!).How would you rate Earl Grey Yogurt Cake?Leave a ReviewTell us what you thinkReviews (202)Back to TopTriangleI've made this cake a few times now and it never disappoints! I lost my loaf pan somewhere during a move and have just been using the aluminum ones instead. They are a little smaller and angled so I split the batter between two and wind up with one that I keep for myself, and one that I either give away or bring into work to enjoy. It's a win win either way!  Also, I've always used Twinnings tea bags instead of loose tea (I rarely have loose tea on hand) and the flavor has been great, the earl grey taste comes through no issue. Best served with a little whipped butter and tiny dash of sea salt ;) AliPhiladelphia, Pa2/4/2022I made this following the recipe with only one modification (lowfat yogurt instead of whole-milk, just because that's what I had on hand!), and the cake turned out with a lovely texture and flavor. The only issue was that the loose tea leaves really are a little too big to chew comfortably -- next time I'll either cut open a bag and use finer tea, or else put my loose-leaf in a mortar and pestle before adding.\n\nThis cake goes nicely with a simple lemon glaze, if you're looking to add a little extra zing!Wendy G.Philadelphia, PA1/29/2022Amazingly delicious and so easy to prepare. I made as instructed and had no problems. Will definitely make this again.CityCooking New York, NY1/22/2022I’m shocked that there’s a little baking powder and baking soda and yet reviewer said it goes beautifullyThat’s pretty amazing. Anonymousil.1/10/2022This was delicious. I made a couple of changes based on the comments, and it still turned out great. I used 1/2 cup melted butter with 1/4 cup olive oil for a total of 3/4 cup oil. I used 1% milk fat yogurt. I used 175 grams of sugar. I also added zest from a full lemon, 1/8 teaspoon of cardamom, and a tablespoon of lemon juice. It turned out to have a nice lemony balance. I may even cut down the oil/butter combo to only half a cup next time. I found that there was a lot of oil left in the pan after I removed the cake. OliaNew York1/8/2022What a delightful cake! I used a loose leaf black tea blend that I ground up with a mortar and pestle but I plan on experimenting with different teas and spices when I make this again (some ideas off the top of my head - pumpkin spice chai, hibiscus and citrus, rose tea and chocolate, etc etc). I cut the oil to 3/4 c and sugar to 1 c as the other reviews have recommended. Used pastry flour and 2% greek yogurt so my batter ended up being quite thick, but the end result was incredible - not too dense nor light. I did skip the sugar topping and instead made a lemon lavender glaze, which complemented the earl grey flavor quite well and kept the cake from being too dry. A word to the wise - the loaf rose beautifully in my 9x5 pan but batter might spill over in a 8.5x4.5.Evie1/7/2022This recipe looked good except for way-too-much sugar for me, so I never tried it.\nPlease, olive oil, whole grain flour (like whole wheat pastry flour), and lowest amount of sugar possible.  Is coconut sugar healthier because it does no cause sugar spikes?AnonymousNew York city11/15/2021I like the recipes and have saved many, some to make for our holiday meals. I'm just wondering if they can be made downloadable for easier printing. I haven't found a way to do that and what I'm doing is cut/paste then reformat the word document so I can print in 1 - 2 pages. Digna Irizarry CassensFlamingo Heights, CA11/14/2021This cake is always far superior with chai teas than with earl grey. Additionally, I will add to the chorus of people saying to cut the oil. I did  3/4 of a cup and it was perfect. I also followed some comment suggestions and made it in a bundt pan, which is lovely, but I would recommend greasing your bundt pan (if you so chose to use one) with either crisco or butter. I used a canola pam spray and it left a bit of an unpleasant oil slicky taste and mouthfeel all on the crust. I also usually add a bit of a boost on the spicy factor by adding some extra cinnamon, ginger, and black pepper (or whatever spices are already in my chai) to enhance the flavor of the cake. Excellent recipe, but I always make it with my own quirks!Anonymous11/2/2021excellent cake. I did cut the oil down to 3/4 cup and had no issues and the cake remained moist. I used Tetley decaf earl grey tea bags that I cut open to measure 1/4 cup and baked the cake in a 10 cup Nordicware bundt pan and found it was fully baked at 45 minutes- I'm not a big fan of baking cakes in loaf pans as the centre of the loaf takes far too long to bake through, sometimes resulting in dry edges, and the bundt pan often fixes this issue for me. I'd definitely bake this cake again and next time, plan on using Chai flavour leaves. NatFalOntario, Canada10/20/2021I’ve made this several times now, both as loaf and as muffins. I’ve learned that if your loaf is too salty, make sure you didn’t add sea salt. I use regular table salt because I don’t have anything fancy, maybe like a half tsp, and it works just fine. I’ve tried loose leaf and bagged tea; I found bagged didn’t have as strong of flavor but was still good. I chop the loose leaf tea up on a cutting board (yes, it’s a mess) but a mortar and pestle would be ideal here, as the whole tea leaves really are too big and don’t have enough time to soften. I’ve never tried cutting the oil down, but I did try Greek yogurt thinned out with some milk and it wasn’t ideal. Like I still ate them because yum but I’ll never do it again. My friends beg me to make this for them for any occasion and it’s so easy and just absolutely delicious. And I suck at baking. JenBaltimore, MD7/30/2021I made this twice, once as a loaf and once making muffins using the extra batter as a smaller loaf. It’s a beautiful treat with robust flavors. After making it the first time, I cut the oil and sugar by 1/3. It still turned out great and was a bit more palatable for my household. ZestOakland, California 4/6/20211) You can't use loose leaf tea in baking. You need to grind it til very fine, almost like tea dust. \n2) The amount of oil is way too much. Cut it to 3/4 cup.\n3) The vanilla extract is unnecessary. It doesn't complement the bergamot flavour. Don't add it.MeGain3/26/2021It made it almost as is except i used coconut oil because it’s what I had, and I used about 2 tbsp of tea from tea bags and one loose leaf tea bag I had. I don’t think 1/4 cup is necessary.  Next time I would only use tea from tea bags as the loose leaves are too big. I do question the amount of oil. Next time I’m going to try less as other recommended. It is deliciously moist, but I have an after-effect of oil coating my mouth. Perhaps I’ll try an infused olive oil next time... maybe mandarin. Bonnie Edmonton, Ab3/5/2021The cake was delicious.  I followed others advice and cut the oil to 3/4 cup.  I used 1/4 cup tea from tea bags.  I also changed the extract to orange extract and added two teaspoons of orange zest.  It was really, really good and will become a regular at our house.  Wonderful as an afternoon tea accompaniment TomjpenPutnam Valley, NY2/28/2021Explore Bon AppétitLoaf CakeCakeDessertEarl GreyAlcohol & Other DrinksYogurtOther IngredientsEasySnackNut-FreeBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-16", "author": ["Condé Nast", "Molly Baz"]}