{"id": "87c26b662933841fb00c293580f69267", "url": "https://www.bonappetit.com/story/wellness-influencer", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "I'm a Wellness Influencer and This Is One Thing I Hate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe One Thing I Hate About Being a Wellness InfluencerMy philosophy on food makes me an outlier in the wellness world.By Kathryn BudigMarch 13, 2019FacebookTwitterEmailIllustrations by Annalee SoskinFacebookTwitterEmailLast year, I spent approximately 80 nights on the road traveling to lead lectures and workshops and to film yoga and food content. On one of those nights, while ordering room service in Los Angeles, I posted a major dilemma to Instagram: curly fries or truffle? (Verdict: truffle, in a landslide.)I believe a glass of red wine and french fries cures most ills, and when combined with a green salad, creates the ideal room-service order: balanced, tasty and healthy-ish. I fully embraced my hotel alone time. I wrapped myself in a robe, launched Netflix, and waited for my food delivery. Meanwhile, the comments started coming in:“I never used to be afraid of food but now I’m afraid of all things not raw and green,” wrote one user.“Don’t you find drinking alcohol affects your yoga practice? I sometimes feel guilty if I have a glass of wine but still enjoy yoga. Help,” wrote another.I routinely post my food adventures to Instagram. Many people follow me because of my long career as a yoga teacher, from my classes on my site, Glo, or from my books The Women’s Health Big Book of Yoga and Aim True. Then they learn along the way about my passion for food and recipe development. And while I receive plenty of responses from people who want to dive face first into a pool of cacio e pepe with me, I also get plenty of comments (not all of them kind) like the ones above.The reality is that my philosophy on food—i.e. enjoy food, always!—makes me an outlier in the wellness world, and I understand why: The health world is wired to lean into extremes. “Nutrition plan” is all too often a euphemism for a diet, and I know from experience. I’ve done everything from vegetarian to grain-free to paleo.These strict plans can be beneficial and effective, but they can also cast a dark shadow. On some wellness plans, I’ve gone from a slightly heavier, strong, “little engine that could” to a skinner, more seemingly “fit,” little engine that couldn’t…eat a whole bunch of stuff because it would ruin everything. The truth is that these diets did give me a body closer to what culture tells us is healthy: lean, tight, and muscular. But I wasn’t busting out more push-ups or getting my endurance up—I just looked good. And when I’d go out to eat, I had to brush past so many of my favorite foods: pasta, sourdough toast, any kind of beans. I would go to a sushi restaurant and leave without eating any rice. Can you imagine? My life revolved around what foods lacked instead of what they offered.I was living in a world of limitations, telling myself these were the necessary sacrifices to live healthy, to look just a little bit better.The dirty secret about the wellness world circa 2019 is that it’s talking about “balance” while showing you bodies that, for the most part, take extreme, unbalanced discipline to achieve. We hear the phrase, “Everything in moderation,” but many of the nutrition and fitness pros that we idealize often treat their aesthetic like a full-time job.Before I lose the paleo, the keto, the Whole 30 eaters, let me acknowledge: Yes, health benefits can be found in these diets, and many people need to follow specific guidelines for medical issues. But as someone who has explored almost every approach in pursuit of the magical je ne sais quoi, I want to remind you that they are, in fact, diets. And being healthy doesn’t mean hitting a number on a scale or following strict rules. It means listening to your individual needs—which can fluctuate like seasons—and finding contentment and strength from following that intuition.For me, it means moving my body and trying to sweat once a day. It means putting greens and healthy foods into my body, but not treating food solely as fuel. Because food is an experience. I never want my tastebuds to lose an opportunity to sing; to laugh with my friends over pizza and beer, or to enjoy a beautifully prepared meal by a fantastic chef simply because it doesn’t fall into the category of foods that are ‘safe’ to eat.Sure, I may not be washing laundry on my abs any day soon, but that’s okay because I want to remember to stay awake, to experience my food without judgment, and to remember that being healthy isn’t an aesthetic. Oh yes, and when in hotel rooms, always enjoy truffle fries, a gorgeous bowls of greens, and a glass of wine.Explore Bon AppétitHealthyishTrendsessayRead MoreLifestyleI Tried 'Wellness Coworking' and It Made Me Feel Profoundly AloneBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-13", "author": ["Condé Nast", "Kathryn Budig"]}