{"id": "87cb71e18762224c2869955f9e7a17dd", "url": "https://www.bonappetit.com/story/breathing-exercise", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "A 4-Step Breathing Exercise to Cope With Difficult Emotions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA 4-Step Breathing Exercise to Cope With Difficult EmotionsRelax so you can recharge with breathwork healer Regina Rocke’s seven-minute routineBy The Healthyish TeamJune 3, 2020FacebookTwitterEmailPhoto by Kirstin HuberFacebookTwitterEmailInhale. Exhale.As people across the country come together to protest a racist legacy of police brutality, it’s crucial to find ways to process this moment. Processing requires stillness and awareness, which in turn restores the energy we need to keep doing the work. One way of finding this awareness is breathwork, a powerful meditation technique with roots in pranayama and Buddhist meditation. Breathwork uses sustained breathing to facilitate self-exploration—which a lot of us are needing right now.“What is the impact of days of exposure to violence, media, and social media? You can breathe to find different ways to cope with that and try to calm your nervous system, your adrenals [glands that produce stress hormones], and your mind,” says Regina Rocke, the breathwork instructor and owner of Wolf Medicine Magic, a yoga and meditation studio. Rocke also facilities breathwork sessions that encourage centering, self-exploration, and catharsis, and is currently holding space for Black people in her virtual classes.Here, Rocke outlines a simple breathwork practice to do at home.Find a comfortable placeFind a soft place to lie down: your bed, a couch, a supportive yoga mat. Rocke recommends beginners start with a short, seven-minute session, and you can use an instrumental song or chant to denote the time without relying on a jarring alarm. When you’re all set up, lie down on your back with one hand on your belly and one hand on your chest.Set an intention“I believe people get a lot more out of the session when you have an intention to help you go deeper into the root cause of an issue and what it’s there to teach you,” says Rocke. “Whether quarantine has you agitated, police brutality or racism has you agitated—go even deeper into any shame or fear around that. What do you fear? What has your life experience been like to bring up those fears?” Focus on a question that resonates with you, and start to breathe.Start to breatheForget your nose—breathwork hinges on breathing only through your mouth. Gently open your mouth (no need to stretch it wide open) and inhale, letting your belly swell. Allow the breath to float into your chest, and exhale through your mouth. Repeat for seven minutes.“Find a pace that you can sustain,” says Rocke. “You shouldn't be holding your breath so you feel like you're hyperventilating. Breathe with ease.”Journal to processWhen your session is finished, take a few moments to write down any thoughts that came to mind. “Even if you only do seven minutes, it really reminds you what can be released or left behind, and shifts your focus to what is truly important for you right now,” says Rocke. “Breathwork is connecting with your body and coming back to your souls’ true purpose. It’s like coming home.”Rocke offers private breathwork classes online and will be leading a group Zoom breathwork class with the Maha Rose Center for Healing this Friday, June 5.Explore Bon AppétitHealthyishSelf CareInterviewsRead MoreLifestyle7 Virtual Mental Health Resources Supporting Black People Right NowBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-03", "author": ["Condé Nast", "The Healthyish Team"]}