{"id": "87dc16aca26afbf16f302cf0a22e4c71", "url": "https://www.bonappetit.com/story/how-to-brown-meat", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Brown Meat So It's Actually, You Know, Brown | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Brown Meat So It's Actually, You Know, BrownNo matter what your mom told you, gray taco meat does not count as \"browned.\" Here's how to brown meat so it's crispy and delicious.By Claire SaffitzJanuary 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailFor the record, when you brown ground meat in a pan, it should be, well, brown and crispy. If it's gray and mealy like mom’s taco meat used to be, you're not really browning your meat. Those are just the facts. Learning how to brown meat the right way will leave you with a crispier, juicier, more interesting protein. Here's how to show that ground beef, pork, or lamb the respect it deserves.We want what's on the left, not the right.\nPhoto by Alex Lau1) Dry the raw meat on paper towels and let it come up to room temperature. This prevents it from steaming in the pan and moving from cool to hot too quickly. It basically ensures that it cooks more evenly.Photo by Alex Lau2) Add the meat to a hot, lightly oiled cast-iron pan and smash it into an even layer—then don’t touch it. You don't want to break up your ground meat before it has time to gain some texture.Photo by Alex Lau3) Once you see crisp edges, use a spatula to divide the patty and flip it in pieces. Brown the other side, then break into bits—getting a full brown on both sides is what you're aiming for. Then, make sure that you season the whole thing generously with salt—since ground meat tends to be pretty fatty, you'll need to use a couple of good pinches to make it sing. That will give you the flavor, texture, and juice factor that will take you straight to the top of the ground beef game.Now it's time to actually use the technique. Ground meat is extremely versatile, shining in salads, tacos, lettuce wraps, casseroles, and just about everything else. Well, maybe not smoothies. Here are a few dishes that benefit from perfectly browned ground meat:Lamb LarbLarb is hailed as the national dish of Laos. Traditionally the salad starts with extremely finely chopped lean meat or fish and is seasoned with lime juice, chiles, fish sauce, and toasted ground rice. This recipe calls for ground lamb, a fattier protein than what’s usually used, and subs ground peanuts as a nod to the texture of the rice.View RecipeWe're also big fans of this weeknight chicken larb.Beef, Black Bean, and Corn TacosView RecipeYup. The classic ground beef application. Getting those crispy edges really will change you as a person. They bring a whole new meaning to the word \"Taco Tuesday.\"Crispy Thai Pork with Cucumber SaladView RecipeThis Thai inspired salad highlights the crispy fatty pork with clean cucumbers and lettuce. Basically, it's a way to tell you're body that eating all of this ground meat is actually healthy. Maybe.More Ground Meat Recipes, Right This Way:1 / 45ChevronChevronGinger-Chicken Meatballs with Chinese BroccoliView RecipeAnd while we're at it, more crispy meat, IN BURGER FORM:Explore Bon AppétitBeefMeatPorkLambTacoTest KitchenCooking TipsBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-01-13", "author": ["Condé Nast", "Claire Saffitz"]}