{"id": "87f2ab149024fe67e419fb52b9794501", "url": "https://www.bonappetit.com/story/dry-rubs-are-better-than-marinades", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Dry Rubs Are Better Than Marinades. There. We Said It. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFact: Dry Rubs Are Better Than MarinadesThere. We said it.By Alex DelanyAugust 16, 2018FacebookTwitterEmailLennart WeibullFacebookTwitterEmailWe usually don’t like to use the word \"dry\" when talking about our food. But there are exceptions. A dry martini? Sure. Dry-aged steak? Absolutely. Dry rubs? Oh, yes. We love dry rubs. We prefer them to marinades almost every time. That's right: When it comes to seasoning meat and developing a exceptionally-textured exterior, nothing beats a dry rub.What is a dry rub though? Well, it’s exactly what it sounds like: A dry rub is a blend of seasonings and spices, without any wet ingredients, that you rub on meat. This might sound kind of like a dry brine, but we’re talking about something else entirely. Unlike a dry brine, which stays on a piece of meat for a long period of time before being rinsed off, a dry rub is usually applied to meat shortly before it is cooked.There are varying degrees of involvement when it comes to dry rubs. The simplest dry rub we find ourselves using is made from salt, pepper, and brown sugar, which delivers a solid dose of seasoning, flavor, and sugar to be caramelized. But that’s just the baseline. You can go in just about any direction with a dry rub, as long as you include a good dose of salt and sugar.As far as the other flavor enhancers we like to include, some heat is usually welcome—cayenne offers plenty of kick, but we also like the fruity muskiness of both sweet and hot paprika, or even mustard powder. A little bit of cumin, coriander, or black pepper lends some nice earthiness to the mix, and onion or garlic powder are almost always welcome. Crushed toasted fennel seeds, good dried oregano, tangy sumac—you can go in whichever direction you please, as long as you remember to keep a balance between all of the components. You don’t want a dry rub that’s 90 percent heat. No one’s going to enjoy that.Dry rub, or art? Your call.\nPhoto by Marcus NilssonThe big advantage of dry rubs, and the reason we love using them so much, is that they don't add any additional moisture to the exterior of a piece of meat the way that a marinade does. Whenever you apply heat to chicken thighs, pork chops, or any other piece of protein, the moisture on the surface needs to evaporate before a sear can start to develop, so dousing them in liquid beforehand doesn't make a whole lot of sense. A dry rub—which is, naturally, dry—is going to put you on a faster track to the beautifully-caramelized crust you're after.But while a dry rub is our preferred pre-cooking treatment for meat, there's nothing wrong with incorporating a liquid element after you've gotten some browning going. We love brushing a glaze, be it a mixture of maple syrup and soy sauce or just some store-bought barbecue sauce, onto chicken thighs during the last few minutes that they're on the grill or in the oven, creating layers of complex, concentrated flavor. And we're all about finishing a grilled skirt steak with a pungent sauce once it's cooked, rested, and sliced—nobody's ever gotten mad about a drizzle of bright, herby salsa verde or chimichurri. So, yeah: It's not that we have a problem with liquids, it's just that we don't want to apply them to proteins until after it's gotten its sear on.That’s not to say a dry-rubbed piece of protein needs a secondary element. It doesn’t. If you balance all of the elements of a dry-rub correctly, that aggressively-seasoned crackly exterior will hold its own. And by hold its own, we mean make you forget about marinades all together. Which you probably should do.Speaking of dry-rubbed and glazed...Oven-Barbecued ChickenNo backyard? No problem. All the sticky-sweet goodness of barbecued chicken without having to leave the house.View RecipeExplore Bon AppétitChickenBasicallySeasoningSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Alex Delany"]}