{"id": "87f845b1ecd45aa99fbf9f8721c09e2e", "url": "https://www.bonappetit.com/story/rockette-maile-makaafi", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "How Radio City Rockette Maile Makaafi Gets Through the Kicks, Costume Changes, and Four Shows in a Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Rockette Maile Makaafi Gets Through the Kicks, Costume Changes, and Four Shows in a DayThe dancing queen relies on supplements and ten-minute power naps. By Aliza AbarbanelDecember 19, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn our series Office Crush, we're asking people with the coolest jobs to take us to work. Up next, Maile Makaafi, a second-year dancer with the Radio City Rockettes, lets us shadow her for a day of athletic training, high kicks, and French twists.Maile Makaafi’s job hinges on high kicks. The 22-year-old is in her second year dancing with the Radio City Rockettes—the iconic armada of statuesque women whose seasonal Christmas Spectacular has topped New York City tourists’ to-do lists since 1932.Makaafi was born in Hawaii and grew up in Arizona, where she first saw the Rockettes perform on tour. “I totally fell in love,” she says with a laugh. “It was special to see tall women in particular doing something so powerful together—I hit a growth spurt in 7th grade and at thirteen I was already a giant!” She moved to New York to study dance at Pace University in 2015, and two years ago, a professor encouraged her to skip class to attend the annual Rockettes audition. She made the cut and spent her senior year writing her honors thesis backstage.Technically being a Rockette is a seasonal gig: A grueling six weeks of rehearsals starts in October, and performances begin in November and run through the new year. Each show, the six-thousand-seat hall is filled with the promise of kick lines, lifesize toy soldiers, and Santa—while, backstage, a cast of 36 dancers flies through quick-changes and steals power naps between performances, which can climb to four per day.“The work we do here is really athletic, though I think from the audience it doesn’t read that way—because half of our job is making it look easy,” she says. “We’re doing up to 200 kicks in a show, on top of all the other precision choreography.” Here’s how Makaafi gets through a day of performances, from practicing mindfulness backstage to perfecting the signature Rockette French twist.Photo by Emma FishmanBreakfast and BCAAsMy alarm goes off at 8 a.m., so I actually get out of bed at 8:30 a.m. I make coffee and eggs over easy on toast—something filling but not too overwhelming, because we’re moving around so much—and get out the door ASAP. I like to get to Radio City about an hour and a half before the first show, if the trains are running in my favor.Normally when I get to the hall I take a second to decompress, because there's always something happening on the subway. I always drink water with a couple scoops of BCAAs (branched-chain amino acids) because it helps me a lot with muscle fatigue. If I’m feeling under the weather, I'll also mix in a packet of Emergen-C. I’m trying to get the other girls hooked on this combo and, so far, nobody has gotten too sick.Photo by Emma FishmanPerfecting the French twistWe do all our own hair and makeup, and there’s a lot of conversing in the dressing room about what we did the night before and who is coming to the show. Everyone has their own technique, but the rule of thumb is a lash, a liner, and a Rockette red lip. Oh, and we have our signature French twist. I totally YouTubed it before I auditioned for the Rockettes for the first time. I have huge curly hair, and we wear so many hats and wigs during the show, so the twist is practical as well.Photo by Emma FishmanMuscle warm ups and backstage quick changesI've been having trouble with my ankles recently, so I like to come up to the athletic training department before the show. We have foam rollers, gym equipment, and warm whirlpools, so I dip my legs in there to warm up my muscles. I try to warm up my feet especially because we wear 2.5–3 inch heels the whole performance, and we dance on a steel stage, which is hard on your joints.I’ll do one last makeup check to make sure my lipstick didn’t get ruined from my BCAA Emergen-C magic, and I put on my costume on. Everything during the next 90 minutes will happen on stage or just off it. I think it’s more common for dancers to go to their dressing rooms, but we have a lot of fast costume changes during the show so we’ll just go to a hallway or booth. It’s the most efficient way to get on and off stage without running into traffic. We have lots of moving parts: singers, ice skaters, aerialists, and the most amazing ensemble.Photo by Emma FishmanFamily meal, power naps, and embroideryAfter the show we’ll take off our costumes and wipe all the sweat off, because that’s when it really hits. I try to make my makeup last as long as possible because taking it off and reapplying it puts my skin through a lot. Then we always gather upstairs for a family meal and eat together. I love anything that’s build-your-own, whether it’s Mediterranean or Mexican, because everyone gets the chance to customize it. Some meals are catered from local vendors around Radio City, which is nice.If I can squeeze in a ten-minute nap between shows, I feel so refreshed that the next show feels like a new day. You forget you just did 90 minutes of hard cardio! I’m a fall-asleep-anywhere kind of girl, but I like listening to guided meditations on Headspace. I'll put my headphones in and try to cover my eyes with a blanket because if I wear an eye mask it messes up my makeup too much. If I don’t have time to nap I’ll just chill. My mom bought me an embroidery hoop for my birthday, and I'm learning the satin stitch right now. I also have a cactus pattern that I’m working on next. It’s my ode to home.Photo by Emma FishmanCool down and fuel upAfter the last show, I like to take all my makeup off and let my hair loose. Sometimes I’ll shower here too. I’ll definitely take a quick stop at athletic training so I can get into the ice or a cold whirlpool to cool down my muscles and help them recover for the next day.I like to eat as soon as the show ends to replace all the energy I was just expending, and I get especially hungry if I don't. I really like making my own Hawaiian comfort food because it’s hard to find that here in New York. I love a chicken mix plate with a mac salad (marinated grilled chicken with macaroni salad), but my ultimate comfort food at the end of a long work day is loco moco. I think it was put together by surfers one day; it’s just rice with a beef patty, gravy, and a fried egg on top. Very high carb and high protein.After a really long show day, I’ll use Headspace to unwind at home. You get such a rush of adrenaline when you're on stage, and it’s hard to run home, and turn that off.Explore Bon AppétitOffice CrushHealthyishInterviewsRead MoreLifestyleAriana Grande's Brooklyn Tattoo Artist Is Winning at Work and Basically Everything ElseBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-19", "author": ["Condé Nast", "Aliza Abarbanel"]}