{"id": "881b1b99a1f71ca504e3fbc737da207e", "url": "https://www.bonappetit.com/recipe/endive-glazed-with-coffee", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Endive Glazed with Coffee Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDEndive Glazed with CoffeeSponsored by NespressoFacebookPinterestTwitterEmailCAVANAUGH2 servingsWho needs an endive salad when you can sauté the leafy veg in a coffee ‘jus’? Chef Daniel Rose uses shallots, sherry vinegar, and Nespresso Master Origin Mexico coffee to give the green a savory glaze.PrintIngredientsFor the endives:2 endives, halved lengthwisePinch of sugarPinch of salt1 Tbsp. olive oil2 Tbsp. orange juice1 Tbsp. lemon juiceFor the sauce:1 Tbsp. finely chopped shallots1 Tbsp. sherry vinegar2 Tbsp. sugar¼ cup chicken or duck demi-glace¼ cup brewed Nespresso Master Origin Mexico coffeeRecipe PreparationFor the endives:Season the endives with the sugar and salt.Heat the olive oil over medium-high heat in a medium skillet. Place endive halves, cut side down, in the pan. Cook until lightly brown then deglaze the pan with the orange and lemon juice. Cook for another 1-2 minutes until the liquid thickens slightly.Remove the endives from the pan and leave to cool.For the sauce:Bring the shallots, vinegar, and sugar to a boil in a small pot. Add the demi-glace, bring to a boil and cook until the liquid is reduced by half. Add the brewed Nespresso coffee, turn the heat to low and simmer for 1 more minute.Warm the endives in the coffee ‘jus’ and serve alone or as a side to duck, chicken, or fish.Recipe by chef Daniel RoseSponsored by NespressoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}