{"id": "881e78a5d134a742b95e7eb0a5bd9b5e", "url": "https://www.bonappetit.com/story/tacos-are-my-resistance", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Tacos Are My Resistance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureTacos Are My ResistanceIn the kitchen, I teach my kids how to be Mexican and proud.By Manuel GonzalesFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel Shepard FacebookTwitterEmailThe morning after Donald Trump was elected president, I wrote out a list of things to prepare my kids for the coming storm. I included items such as how to fight with words, which rules are breakable, how to break them unnoticed, and how to be the kind of Mexican who people forget is Mexican at all.I realize now, three years later, that this list—and how I conceived of it—is flawed, born out of fear rather than indignation, a desire to hide from the world’s events rather than resist them. If I were to write out a new list, it would be much different. And it would start with how to make tacos.After the climate strikes and local protests against Trump’s Muslim bans and his draconian immigration policies, after shouting and marching in the streets of Lexington, Kentucky, and Williamstown, Massachusetts, cooking might seem like a weak form of resistance, or like no form at all. But as far as I’m concerned, teaching my kids how to cook—not just any food, but Mexican food, and not just any Mexican food, but the kind of slipshod Tex-Mex my mother made for me and my sister when we were kids—might be the strongest form of resistance I can give them. This food reminds them where they come from, who they are, and, more importantly, to be proud of who they are. Because without this pride, resistance—the kind of sustained resistance we need now—is almost impossible to maintain.Maybe here you could formulate a metaphor: The ever-present taco—adaptable, crowd-pleasing, resilient, pliable—made with ingredients as simple as beans and rice, or as extravagant as scallops or ribeye or fried chicken strips and gravy or Korean barbecue and kimchi. Fold a tortilla around practically any ingredient and suddenly that combination becomes a taco. Maybe that’s like Mexicans too: ever-present, adaptable, resilient. But if I told my kids this, they’d roll their eyes or stare blankly. They’d say, “You’re being weird again, Dad.” So instead, I’ve decided to teach them to cook.I’m not sure which night the lessons began. Maybe the one after Trump told Representative Alexandria Ocasio-Cortez to “go home” (she was born in New York). Maybe the one when we found out a sixth child died in custody at the border. It’s hard to say; they all start to bleed together. But on this night, we start simply: ground beef tacos. The boy, who is nine, is on stirring-and-pouring duty. Stir these beans on the stove, pour this salt into the picante. The kitchen smells like my mother’s, the mingling garlic and onions and comino. I give my son a wooden spoon and show him how to break up the ground beef sizzling in the skillet. The girl chops onions. I’m nervous when she grabs the knife—she’s loosey-goosey with it, the way that gangly 13-year-olds are prone to be—but she does not slip.“Perfect,” I tell her, as she slides them gently into the skillet to brown.Fresh into teenagerhood, my daughter is very aware of this strange political moment. When we lived in Kentucky, she stood up to the fifth-grade boys in her classroom practically every day. She argued against cruelty, against injustice. She argued for protecting the most vulnerable in society: immigrants, refugees, the poor. She argued so fiercely, the boys began scratching her name off any list they found it on—whiteboards, class rosters. It was their way of trying to silence her, I suppose. It was a difficult year, but not once did she back down or silence herself when it came to what she believed was right.My son, though still in elementary school, is not far behind. But I worry that, while my kids grasp the large-scale problems of this moment in our country’s history and are willing to go to the mat for their beliefs, they don’t understand the singular bearing this moment has on them, specifically. I worry they don’t realize that what the president says about Mexicans—that we’re rapists and drug dealers and thugs—he’s saying about them too.I made a mistake three years ago, wanting my kids to be the kind of Mexicans people forget are Mexican. Being Mexican is one of my favorite things about me, about us. Mexicans are loving, caring, full of grit. We have a dark sense of humor, an ability to laugh and cry in the same breath. We know how to hustle. And the most Mexican thing about me is the food I cook, which is the same food my mother learned to cook from her mother. Teaching my kids to do it too is my way of telling them, “Look, people didn’t want your great-grandmother here, and some of those same people didn’t want your grandmother here, and some of those same people don’t want us here either, but here we still are. This is our food, and we are still us.”On this particular night, whichever night it was, the meat is cooked and ready. After chopping onions, our daughter made the guacamole and our son stirred some more. I did the rest. The kids’ attention spans are limited and they quickly got bored of the process, the waiting. But when we bring the food to the table, they both chime in: “We helped.”We sit and eat and laugh and talk about school and what we want to do this weekend. We talk about things that make us happy and safe. We talked about how good these tacos are. We don’t talk about Trump. And that’s resistance too.Manuel Gonzales is the author of The Miniature Wife and Other Stories, which won the Sue Kaufman Prize for First Fiction and the John Gardner Prize for Fiction, and the novel, The Regional Office is Under Attack! He teaches writing and literature at Bennington College in Vermont.Want More Stories From Taco Nation? Right This Way...Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayWhy Korean Tacos Are Margaret Cho’s American DreamHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Danny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?And so much more!Explore Bon AppétitTaco NationFirst PersonMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Manuel Gonzales"]}