{"id": "8828fb1bc5043d5acf65b04ab50213ef", "url": "https://www.bonappetit.com/story/the-grey-market-chopped-liver-sandwich", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "A Killer Chopped Liver Sandwich in Savannah, Georgia? Yes, Really | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Killer Chopped Liver Sandwich in Savannah, Georgia? Yes, ReallyGrab a stool and dig in at the Grey Market, where southern diner meets New York deli.By Hilary CadiganApril 30, 2019FacebookTwitterEmailPhoto Courtesy of The Grey MarketFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.One of my dad’s favorite sayings when he’s feeling emotionally ignored is, “What am I, chopped liver?” As in, “What am I, the thing nobody wants?” Liver rarely gets a day in the sun, unless it’s mousse-ified or cooked down into pate, which usually means its somewhat metallic (okay, blood-like) flavor gets buried beneath a healthy dose of herbs, wine, butter, or all three. Chopped liver, on the other hand, is often a harder sell. Especially in the South, where Jewish delis—some of the best places to find the stuff—are few and far between. So, imagine my surprise (and delight; did I mention I love liver?) when I walked into chef Mashama Bailey’s newest Savannah restaurant to find a chopped liver sammie on the menu front and center.The Grey Market is an extension of The Grey, Bailey’s first restaurant, which is located in a dolled-up former Greyhound station just down the street. There, chef created a very-adorable-but-not-to-the-point-of-being-saccharine market/eatery that falls somewhere between New York deli and southern diner, making good on both her NYC roots and Georgia heritage in one spot. You can buy Sour Patch Kids and non-organic dish soap and good wine and local butter, and then you can sit on a cushy diner stool, sip egg creams, and nosh on a perfectly executed chopped liver on rye with a side of crunchy pickle.So, yes, dad, you are chopped liver. And that’s a compliment.Go There: The Grey MarketExplore Bon AppétitHighly RecommendRestaurantsSavannahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-30", "author": ["Condé Nast", "Hilary Cadigan"]}