{"id": "8829dbcdb0858420b4ad1ad7acccc033", "url": "https://www.bonappetit.com/recipe/easy-gomae-japanese-style-spinach-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Easy Gomae (Japanese-Style Spinach Salad) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueEasy Gomae (Japanese-Style Spinach Salad)By Amiel StanekMay 24, 20183.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis simple Japanese side dish recipe is usually made with fresh mature spinach, but you have to buy so many bunches in order to get a substantial yield—that’s where the frozen stuff comes in handy. Just make sure to buy whole-leaf frozen spinach instead of chopped.Ingredients10 servingsKosher salt2lb. frozen whole-leaf spinach, divided¼cup sesame seeds (not toasted)¼cup low-sodium soy sauce or tamari¼cup unseasoned rice vinegar3Tbsp. mirin (Japanese rice wine)PreparationStep 1Bring a large pot of water to a boil; season generously with salt. Stir in half of frozen spinach and cook, stirring, until warmed through, about 30 seconds. Using a spider or slotted spoon, transfer spinach to a rimmed baking sheet and spread out in an even layer. Return water to a boil, then repeat process with remaining spinach. Chill spinach at least 30 minutes and up to 3 hours.Step 2Meanwhile, toast sesame seeds in a dry small skillet over medium-low heat, shaking skillet occasionally, until slightly darkened in color and fragrant, about 4 minutes. Transfer seeds to a plate and let cool slightly. Pour into a resealable plastic bag and seal pressing out air. Using a rolling pin or wine bottle, crush seeds until mostly mashed but with some whole seeds remaining; transfer to a large bowl. Add soy sauce, vinegar, and mirin and whisk to combine.Step 3Working over the sink, grab one small handful of spinach at a time and squeeze out as much water as possible with your hands, then transfer to bowl with dressing. Once all spinach has been added to bowl, toss with your hands, taking care to break up any clumps so that spinach gets well-coated.How would you rate Easy Gomae (Japanese-Style Spinach Salad)?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGomae .. sesame , horenso ... spinach = horemso gomaé philouDüsseldorf 5/25/2018Explore Bon AppétitSaladJapaneseEast AsianAsianSpinachLeafy GreensVegetableEasySideDairy-FreeGluten-FreeVegetarianVeganDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Amiel Stanek"]}