{"id": "88378f0598af6a5a6e13394d0cb228f2", "url": "https://www.bonappetit.com/story/drifters-wife-napa-cabbage-salad", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "The Napa Cabbage Salad I Can’t Stop, Won’t Stop Making | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Napa Cabbage Salad I Can’t Stop, Won’t Stop MakingIs “pure joy” on the ingredient list? Because it sure seems like it.By Elyse InamineSeptember 13, 2018FacebookTwitterEmailFacebookTwitterEmailI come from a family of people who love things a little too much. When the movie version of Phantom of the Opera came out, we only listened to the soundtrack for months in the car, long before James Corden. And then there’s Sunset magazine’s Cowboy Caviar, a.k.a. a black-eyed pea, tomato, and avocado dip, which my mom makes for all occasions, a fierce loyalty that’s withstood decades. And then there was the phase when my dad watched the cerulean scene from The Devil Wears Prada every night as he flossed his teeth and got ready for bed. He can still quote almost every line.That fanaticism switched back on once I was in the Test Kitchen recently and senior associate food editor Molly Baz presented this napa cabbage salad. Chef Ben Jackson dreamed it up when he had too much cabbage on hand at Drifters Wife in Portland, Maine (no. 9 in our Hot 10 list!). It’s a simple thing: salted napa cabbage (more on that later), a honey-apple cider vinegar dressing, toasted pistachios fragrant with orange peel and thyme, some chives, some parsley, lots of Parm.The napa cabbage salad at Drifters Wife.\nElizabeth CecilI’ve grown up on only a couple kinds of cabbage preparations. Soupy napa cabbage that’s soggy and flimsy after being boiled to death in hot pot or fermented cabbage (kimchi from Korean supermarket chain Galleria). But once I stuffed a few huge, Parm-flecked shards of cabbage into my mouth, I was Inamine-level obsessed. The salad was textural and refreshing like the lovechild of a wedge and coleslaw. You get iceberg-like crunch from the napa cabbage, which is a bit fleshier than regular cabbage though rigid and flavorless when raw and unadorned. After being salted a few minutes ahead of time, its spines slacken and the thick leaves become slightly pliable and plump but still crisp overall. You also get the zing and slight creaminess of coleslaw with a vinaigrette of honey, apple cider vinegar, and a good amount of salt and pepper, and the generous mound of thinly shaved Parm crowning the salad. I wanted to eat more—but on my own time.Since then, I’ve made the napa cabbage salad about four times, which is a lot for someone who usually moves on to new recipes and new cookbooks as they come out. Recently, I brought it to a friend’s place for a barbecue, and it was a hit. Not because anyone literally told me so, but because once I put the salad on the table where forks weren’t yet laid out, people starting to eat it with their hands. Even now that summer barbecue season is over, I’ve been making this napa cabbage salad, like the clockwork of Cowboy Caviar. For a potluck. For a lazy late summer dinner. For just me.Get the recipe:Napa Cabbage Salad with Parmesan and PistachiosCrunchy, salty, sweet, and vinegary, this is more of a salad than a slaw.View RecipeRead MorecookingThe Secret to the Drifters Wife's Crispy-Skinned Roast Chicken Involves Salt and... Scuba DivingBy Molly BazFried-Bread Panzanella with Ricotta and HerbstechniquesThis Is the Savory Cashew Butter of My DreamsBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-13", "author": ["Condé Nast", "Elyse Inamine"]}