{"id": "8837db6b491462cb93f94a1ee55af297", "url": "https://www.bonappetit.com/story/1971-food-innovation-timeline", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "The Best and Worst Food Innovations From 1971 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou’d Never Guess These Food Brands Are 50 Years OldCount Chocula, you haven’t aged a bit.By Alex BeggsMarch 23, 2021FacebookTwitterEmailPhoto by Silver Screen Collection/Getty ImagesFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.If you want to know what was going on in 1971, the best way to find out is to hop in your digital DeLorean (ProQuest, it’s ProQuest), flip through mildewed old magazines and newspapers, and call a few historians. That’s what we did to track down the biggest food launches and moments of the year, brought to you here.Photo Courtesy Getty Images / LMPCCharlie and the Sponsored ContentWilly Wonka & the Chocolate Factory, starring Gene Wilder, was the first—and perhaps only—movie to be produced by a food corporation, Quaker Oats, which launched two candy bars alongside the film’s release. Willy Wonka Super Skrunch Bars and Willy Wonka Peanut Butter Oompas never made a profit, though, probably because they were basically the same flavor and not at all based on candy in the movie. Oompa oops!Cuppa CapitalismIn 1971 a mug of coffee at the newly opened Starbucks in Seattle cost a whopping…nothing. The free samples seduced customers into paying $1.25 a pound (expensive!) for freshly roasted beans—and maybe some spice blends and “fancy oolong” tea. Eventually, the store would change ownership; the mermaid mascot would lose her belly button; and Starbucks would become the latte-slinging $26.7 billion publicly traded global Goliath it is today.Photo courtesy Wanda Martinez; Marianos Hacienda 1991Margaritas 2.0Destiny struck Dallas when restaurant owner Mariano Martinez’s customers complained that his margaritas weren’t cold enough—one of life’s bigger letdowns. Inspired by the Slurpee machines at 7-Eleven, Martinez fashioned a frozen margarita maker out of a soft-serve machine, and the rest is history. Literally. The machine is in the Smithsonian. “This was my one chance in life to be somebody,” Martinez told the Dallas Morning News.Photo by Bettmann / Getty ImagesYou’ve Got MailFedEx was founded in 1971, and its unheard-of overnight shipping soon made it possible for anyone (with the funds) to order California citrus and Memphis barbecue overnight. By the ’80s, “a white truffle collector could call a restaurant in London or Los Angeles, Houston or Tokyo, and have his product showered over fettuccine the following evening,” writes John F. Mariani in How Italian Food Conquered the World.Photo Courtesy the General Mills ArchivesChocolate VitaminsGeneral Mills bestowed the world with two “vitamin-charged” cereals: Count Chocula and Franken Berry, while Post gave us both Cocoa and Fruity Pebbles. Meanwhile, consumer advocates were testifying before Congress about cereal’s high sugar content and lack of nutritional value. The cereal companies were like, “but vitamins!” We bet you can guess who won that one.Photo Courtesy the Coca-Cola CompanyPeace, Love, CaffeineCoca-Cola debuted its “I’d Like to Buy the World a Coke” commercial, a subtly subversive call for peace during the Vietnam War wrapped in a catchy tune that’s now stuck in your head. Things are a little more overt now (see Kendall Jenner x Pepsi circa 2017).Photo Courtesy the General Mills ArchiveJust Add BeefHamburger Helper hit store shelves with perfect timing: Food prices were high due to post-Vietnam inflation, and the boxed mix helped stretch a pound of ground beef. Sales took off. But don’t get us started on the four-fingered 1977-born mascot, Lefty, who still haunts our dreams.Photo Courtesy B Christopher / Alamy Stock PhotoMeanwhile, in JapanOsaka-born “Cup Noodles” were the first instant ramen in cup form and arrived in the U.S. two years later as “Cup O’Noodles,” soon dominating the dry soup–mix market. Campbell’s and Lipton tried to launch their own dry soup mixes a decade later, but they were late to the party. Instant ramen was a million dollar industry by the late ’80s with Nissin, which makes Cup Noodles, at the top. Cup Noodles inventor Momofuku Ando’s name lives on at David Chang’s Momofuku restaurants, which serve the opposite of instant ramen (the broth takes 8–10 hours to make).Photo Courtesy Retro AdArchives / Alamy Stock PhotoA Hamburglar Is BornThe year 1971 was huge for McDonald’s, which changed its slogan to “You Deserve a Break Today,” and introduced the Quarter Pounder as well as the characters of McDonaldland—the Hamburglar, Grimace, you know ’em—all part of an evil-brilliant ad campaign based on a study that revealed how influential children were in deciding where a family ate. (Oh! And 1971 saw the first PlayPlaces too.) The campaign also kicked off “The Big Meal.” A precursor to supersizing, the order was “a Big Mac, a very large order of fries, and a great big drink” and arguably one small unbuttoning on America’s pants.Photo Courtesy All-CladThis Old PotThe cream-of-the-crop cookware company All-Clad was founded in Pennsylvania by a metallurgist who decided to make himself a pot when he wasn’t designing coins and airplane parts. The pans are a patented design of five alternating layers of bonded aluminum and stainless steel. The material can conduct heat evenly (while somehow maintaining a cool handle). Chefs and home cooks have been geeking out over All-Clad for over 50 years; reviewers at The Wirecutter and Cook’s Illustrated constantly bestow the pans with their highest praises, and we at BA have called the frying pan an “investment piece” that we’re buying and keeping for life.Photo by Michael KrausChart-Topping CookbooksCookbook sales were so high this year—the Julia Child, post–WW II effect—that one newspaper hyperbolized they “probably outsold the Bible…for the first time in publishing history.” The top seller was the plaid-covered Better Homes and Gardens cookbook (first published in 1930), which outsold the top best-selling fiction and nonfiction books combined, with over 600,000 copies. Cookbooks published in 1971 to acclaim included: The New York Times International Cookbook, by Craig Claiborne, The Art of Armenian Cooking, by Rose Baboian, and A West African Cookbook by the celebrated journalist Ellen Wilson Gibson. Ruth Reichl published her first cookbook Mmmmm: A Feastiary, which is going for $1,003.96 on Amazon right now and whose cover featured a marching band of cartoon produce, including a lemon playing the cymbals and a watermelon on the tuba.Manly SoupHE COOKS! was the name of a recurring column in Better Homes and Gardens. (“We want recipes that YOU—the man-of-the-house—prepare yourself.”) Men were cooking more at home, notes historian Helen Veit, even if that meant just opening a can of soup: Products like Campbell’s “Manhandlers” (the regular soups, but chunky) helped rake in the company’s first billion dollars that year.How CelestialAfter selling baggies filled with homemade herb blends out of a van, as one does in the late ’60s, the founders of Celestial Seasonings opened up headquarters in Boulder, Colorado, brewing up “hibiscus flowers, lemongrass, spiritualism, and capitalism,” per the New York Times. They were selling tea blends, the first of their kind in a country steeped in Lipton: Red Zinger, Sleepy Time, Mellow Mint. Four year later, they passed the million dollar mark.Photo by Frank Hurley/Daily News Archive via Getty ImagesSweet, Sweet ImpeachmentAlong with its first installment of the Pentagon Papers, the New York Times published a page one story about Tricia Nixon’s wedding and wedding cake, which caused a three-day investigation as food writers tried to figure out why the recipe, released by the White House, made “baked sludge.”Dept. of RIPThey can’t all be winners. Some 1971 kitchen innovations never quite took off…Roasting WrapReveal’s “roasting wrap” didn’t last long after its 1971 debut. Perhaps because it was essentially plastic wrap you, uh, put in the oven.Presto PizzaKellogg’s mysteriously shelf-stable pizza-filled Pop-Tart, was, frankly, ahead of its time.The BaconerRedbook’s bacon-only toaster promised to contain the scent of bacon. But why?!Crisp-i-TatersThese snacks promised “potato chip taste with a french fry shape” but were the least of both worlds.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Alex Beggs"]}