{"id": "8852e5853edbda09589defc5ed23be1c", "url": "https://www.bonappetit.com/story/chickpea-and-lentil-stew", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "This Creamy Red Lentil Soup with Coconut and Ginger Deserves Allllll the Toppings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Creamy Chickpea and Red Lentil Stew Deserves Allllll the ToppingsUse it to lure friends and family over for a fall stew party.By Aliza AbarbanelOctober 19, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethFacebookTwitterEmailAs an extrovert from Southern California, winter poses a real problem: I love seeing my friends, but I hate going outside. I’ve invested in a practical (read: hideous) coat and even considered lacing my morning coffee with tequila for an extra shot of warmth, but now I have a new ploy: stew parties.For the uninitiated, a stew party is, well, exactly what it sounds like. You make a heaping pot of stew and an array of fixings, then invite people over to eat, and eat, and eat. The concept is timeless, but was recently updated and celebrated by the wonderful Claire Saffitz. She developed a quartet of warming, stick-to-your-bones stews, but this coconut-ginger chickpea soup called my name.The real genius of throwing a stew party lies in the prep: You can make the whole stew days in advance, leaving you to actually hang out with your guests when they arrive instead of hovering over the stove. So, on a quiet weekday evening, I brought out my Dutch oven to sauté garlic, onions, and ginger in coconut oil and warm spices before adding soaked chickpeas and water to get a broth going. I hung out by the stove with a book, skimming foam off the top and maintaining a gentle simmer until the chickpeas were swollen but still crunchy. I added the red lentils and coconut milk, which simmer until the lentils have broken down to form a thick, creamy broth. Then I fished out the garlic cloves and slid the whole thing into the bottom of my fridge to chill and await the stew party. I wrote DO NOT EAT STEW on the door, then spent the next two days scowling at the message.When the day of the dinner arrived, I spent fifteen minutes throwing together the toppings. (You could also prep most of them a day in advance.) Stew is the obvious centerpiece, but the toppings are really where flavor is built. I took a maximalist approach with mustard seeds sizzled in turmeric oil, cilantro-raisin chutney, toasted coconut flakes, fiery serrano chile rings, and a tangle of herbs. When I was somehow still worried about my guests going hungry, I grabbed a stack of naan.My anxieties soon landed on a new topic: servingware. Did I have enough bowls for eight people? I did not. (I ended up borrowing some from the BA Test Kitchen.) When everyone arrived, we filled the jumble of bowls with warm, creamy stew and compared notes on the best topping combinations. (Spoiler: All of them combined.) Fresh cilantro and spicy-sweet chutney cut through the silky coconut milk and creamy chickpeas. Of course we went back for seconds, and when some extra guests unexpectedly appeared outside my apartment, I didn’t panic. I thinned out the dal with a bit of water, toasted up some more naan, and cut up a stray avocado lurking in the back of my fruit bowl. That’s the real magic of stew—there always seems to be enough to go around.Throw a stew party:Coconut-Ginger Chickpea SoupThe dal is vegan but full of hearty protein thanks to the chickpeas, lentils, and coconut milk.View RecipeExplore Bon AppétitHealthyishSoupStewChickpeaLentilCurryCoconut MilkRead MorecookingThese 6 Brothy Stews Are Our New Winter ClassicsGallery6 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-19", "author": ["Condé Nast", "Aliza Abarbanel"]}