{"id": "8853de433989d0887c592f3f531af0b8", "url": "https://www.bonappetit.com/recipe/mini-eton-mess", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Strawberry Eton Mess Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueStrawberry Eton MessBy Claire SaffitzMay 22, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintA classic British dessert made of whipped cream, store-bought meringues, and strawberries, this recipe is as easy to make as it is impressive. The meringues will soften as they sit, giving just the right amount of texture.Ingredients4 servings1lb. strawberries, hulled, sliced into thirds, plus whole berries for serving⅓cup sugar1½cups heavy cream2.5 oz. store-bought meringuesPreparationStep 1Toss half of sliced berries with sugar in a medium heatproof bowl. Cover tightly with plastic wrap and set over a medium saucepan filled with 1\" of barely simmering water. Let sit until berries are soft and juices have accumulated in bowl, 25–30 minutes. Let cool, then toss in remaining sliced berries.Step 2Whisk cream in a medium bowl to soft peaks. Layer cream, meringues, then strawberry mixture in four 8-oz. glasses. Chill 20 minutes. Top with whole strawberries to serve.How would you rate Strawberry Eton Mess?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleMade this to take to a friends for dinner, it was a big hit!  Light and fresh.\nToniMaryland9/10/2018Explore Bon AppétitParfaitFruit DessertDessertBritishEuropeanStrawberryBerryFruitSpringSummerEasyGluten-FreeNut-FreeFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}