{"id": "885471b4426eb944ca491be73a6b3c41", "url": "https://www.bonappetit.com/recipe/snickerdoodle-party-cookies", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Snickerdoodle Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueSnickerdoodle Party CookiesBy Chris MoroccoNovember 20, 20184.6(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe helped the old-fashioned snickerdoodle get party-ready by upping the spices (cinnamon, cardamom) and adding texture with toffee, cornflakes, and a sparkly finish.IngredientsMakes about 241cup (2 sticks) unsalted butter2cups all-purpose flour1tsp. baking soda1tsp. kosher salt2½tsp. ground cardamom, divided2tsp. ground cinnamon, divided1cup (packed) light brown sugar½cup granulated sugar, divided2large eggs1tsp. vanilla extract or paste21.4-oz. chocolate toffee bars (preferably Skor), finely chopped3cups cornflakes, lightly crushedGold or rainbow disco or luster dust (for serving; optional)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Cook butter in a medium saucepan over medium heat, stirring often, until it foams, then browns, 5–8 minutes. Scrape into the bowl of a stand mixer. Let brown butter cool slightly.Step 2Meanwhile, whisk flour, baking soda, salt, 1½ tsp. cardamom, and 1 tsp. cinnamon in a medium bowl.Step 3Add brown sugar and ¼ cup granulated sugar to brown butter. Fit bowl onto stand mixer fitted with paddle attachment and beat on medium speed until thick, about 1 minute. Add eggs one at a time, beating well after each addition. Continue to mix just until smooth, about 1 minute longer. Beat in vanilla. Reduce speed to low and add dry ingredients; beat until nearly combined. Add Skor bars and beat just long enough to bring dough together (it will be a little loose). Cover and let rest 5–10 minutes to let flour hydrate (dough will thicken).Step 4Place cornflakes in a small bowl. Mix remaining ¼ cup granulated sugar, 1 tsp. cardamom, and 1 tsp. cinnamon in another small bowl. Working one at a time, scoop out 2-tablespoonfuls of dough (they don’t need to be perfect balls) and toss in cornflakes to coat well; squeeze lightly to adhere. Move to bowl with spiced sugar and toss to coat. Divide between 2 parchment-lined baking sheets, spacing 3\" apart.Step 5Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until edges are set, 13–16 minutes. Let cool on baking sheets. Brush with gold dust if desired.Step 6Do Ahead: Cookies can be baked 5 days ahead. Store airtight at room temperature.How would you rate Snickerdoodle Party Cookies?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis is one of my super favorites. One thing: the cornflakes never fully adhered to the cookie no matter the size of the crumb-I baked 3 different batches. . Finally I stirred them into the batter. I find them extra delicious because they have a crunch factor. LoriKalamazoo., MI1/3/2021Great recipe! My sisters thoroughly enjoyed these cookies and I followed the recipe with the exception of a little less cardamon in the sugar mixture and added chocolate chips with the toffee chips. It was a delicious additive! (:ykangREDLANDS, CA12/31/2020Fantastic! I reduced the cardamom in the sugar-cardamom mixture that the cookies are rolled in, but I did not need to. Otherwise, I followed the recipe exactly and I don’t think the cardamom is overwhelming at all. The brown butter in these is so good. I will be making these again and sharing with my neighbors! KellyS1015Maryland 12/30/2020Unfortunately underwhelming. Maybe there's too much baking soda because the texture was too puffy & crunchy, not chewy & buttery. The amount of cinnamon & cardamom was fine but they needed to be a bit sweeter & have a little more salt because they were kind of bland. Wouldn't make these again.LaurenVirginia12/27/2020Just made these again. I love these cookies because I love the cinnamon, the browned butter, the toffee candy and the crunch of the corn flakes. I can never find cardamom but I think they are great anyways. I use some silver edible glitter flakes on top and it makes the cookies look so cool and festive. This is my favorite cookie recipe, especially for snickerdoodles. AnonymousArizona5/22/2020My all-time favorite party cookie! They’re fun and crunchy and gooey and buttery and addictive. Pro-tip: try swapping out the cornflakes for Golden Grahams, adding in marshmallows, and/or sprinkling with flake salt to give them that extra something something ;-) Go make you some.bedtimemacaroniportland, or5/4/2020Baked as isand they are great. Cardamom is spot on.AnonymousSan Jose, CA4/6/2020This is a great cookie - honestly one of my favorites of all time. Cardamom isn’t too much; don’t be scared. Definitely really press in the cornflakes, and you’ll be good to go. Thanks, Chris!Nashville 12/27/2019I want to make this recipe. SO. BAD. Unfortunately, Skor Choclate Toffee bars (and every possible replacement for them) have Soy Lecithen in them, to which both myself and the two people who would potentially eat these if I made them - have a pretty serious allergy to. Bummer.madison_CSan Francisco, CA12/21/2019this cookie was delicious + perfect. I followed the recipe exactly.  \nit won our cookie contest! will definitely make again. AnonymousBrooklyn, NY12/17/2019Unlike what seems to be the popular opinion, I loved the amount of cardamom in these cookies. I think that the cornflakes really added to what would have been a more regular cookie. I used Heath bars instead of Skor bars because that's what we have where I am in California. I made these cookies close to four times over the course of a month because my cookie eaters (coworkers) loved them so much. They're relatively easy to make for an excellent pay out. I'm planning on adding this recipe to my regular cookie making and not just save it for holidays. kgibsonCalifornia12/2/2019I might make these again, like others said it was heavy on cardamom so I used more cinnamon. I did 1.5 Skor bars - I should've done the full two and I recommend not chopping too finely, it was much better for taste and texture to have the Skors rough cut. My main concern is it feels like there may have been too much baking soda in the recipe...the texture/taste were definitely affected. Also don't let the instructions intimidate you it's actually a very simple recipe, just a couple extra steps!AnonymousSeattle, Washington11/22/2019Hello everyone. I really thankful to you for this recipe. I want to make this cookies for weekends. But my husband is sportsman and always I cook protein cookies for him. He like them so much! I found  recipe of protein cookies here club.cooking/recipe/protein-cookies/SweetPeachCanada8/29/2019I made a batch of these and took them to work - the plate was totally clean within 40 minutes.  I made two versions - one with the cornflakes and one without and both were delish.\nWe don't have Skor bars in Australia so I used a Hershy's pretzel and peanut bar which added a nice bit of salty sweetness. I also dialed backed the cardamom a bit. \nGolden and crunchy with soft centres - these are a delicious cookie and my coworkers definitely agree.Australia8/1/2019These cookies came out delicious. Many compliments, especially the \"very buttery, but still crunchy\" taste was a winner. My only comment is that the cinnamon got lost. The cardamon was strong, which I LOVE, possibly because the spice was fresh for this batch. I just wouldn't call this a 'snickerdoodle', did not really come across as a fancy updated 'snickerdoodle' but a completely different cookie. I would up the cinnamon (or check myself, I could have made a mistake) and I would keep everything else. The cornflakes were extra effort, but they were worth it for the crunch. A+ for a great cookie.AnonymousNew Jersey12/27/2018Explore Bon AppétitCookieDessertCardamomHerbs & SpicesCinnamonToffeeOther IngredientsBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}