{"id": "88543a334a0306d0bc3e268d549897f4", "url": "https://www.bonappetit.com/story/how-to-ripen-avocados-when-theyre-too-hard", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "How to Ripen Avocados When They're Too Hard | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Ripen Avocados When They're Too HardYou've been there: It's the morning before you need to use an avocado and it's solid as a rock. Don't panic. There's still hope.By Alex Delany and Antara SinhaJune 7, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailAvocados seem to be working against us. When a BLT (or an ABLT, as it were) calls for slices of the green stuff, or some tortilla chips are asking for a monster bowl of guacamole, the avocados at the local grocery store are never as ripe as we want them to be. It’s almost as if they know what we’re going to make and are determined to make sure we don’t succeed. But life is too short to accept this as truth. There are ways to make sure you have a ripe avocado when you need one. Here’s how to pick out the perfect avocado at the store, and how to jumpstart the ripening process when things get dire.The road to a successful avocado experience starts at the grocery store. It’s all about choosing the right avocado. And we’d like to offer some general advice: It’s okay to be the person who touches every piece of fruit or every vegetable. You want to find the best. Don’t worry about taking too much time or getting your germs on someone else’s potential pick. Find the best avocado. Do it.The best avocado will be dark. Light brown skins are signs that an avocado is not ripe. You want the deep brown, bordering on black, skins. Those will be ready to eat in the very near future. Once you find the dark ones, feel them. If the avocado is squishy, you can bet that it will be brown and oxidized when you slice it open. You should never buy a squishy avocado.Instead, look for avocados that are firm with a sight bit of give, and keep in mind when and how you’ll be using them. If you’re going to slice the avocado or aren’t going to use it for a day or two, you want to pick a firmer one. If you’re going to mash or purée the avocado or are going to use it that night, you want to pick a softer one. Go into the store with a good idea of when and how you’ll be using your spoils. It helps.Crispy. Chicken. Bowl. With. Avocado. Yes.\nNow, what if you pick the perfect avocado and it’s still not ripe enough the morning before you want to use it? What about an hour before you want to use it? If it’s game time and your avocado isn’t ripe enough, we’re sorry. There’s nothing you can do. You’ll have to use an underripe avocado or no avocado at all. If it’s the morning before you want to use the avocado and it’s still pretty hard, don’t fret. There's still hope.Have you ever heard that thing about putting underripe fruit in a brown paper bag to ripen it faster? Well it actually works! Throwing a too-firm avocado in a paper bag with a ripe banana will make its ripening process accelerate. It’s all about ethylene gas and ventilation. When some fruits ripen, they give off ethylene gas (which also gives a musty, sweet odor that smells like ripe fruit). This gas is a byproduct of ripening, but it also encourages ripening in surrounding fruits. By increasing the avocado’s exposure to the gas in a semi-porous bag, it will be able to breathe and ripen more quickly. Wow. Science is cool.And while science can help you to accelerate the ripening process, it's no substitute for starting with perfect avocados. You want to set yourself up for success from the start. Don’t trust just anyone to grab your avocado. Find the right one. You know how.Some sliced avocado wouldn't hurt this tostada.View RecipeExplore Bon AppétitBasicallyAvocadoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-07", "author": ["Condé Nast", "Alex Delany", "Antara Sinha"]}