{"id": "885a0c7f57495a553e8a1f9ed131cb0f", "url": "https://www.bonappetit.com/story/what-is-apple-butter", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "What Is Apple Butter, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Apple Butter, Anyway?Is apple butter made from butter? Apples? Is it everything or nothing at all? We have the answers.By Alex DelanyMarch 6, 2018FacebookTwitterEmailFacebookTwitterEmailApple butter is not a combination of apples and butter. Let’s just get that out of the way. There is no butter in apple butter, which does make it seem like whoever named the stuff could have done a slightly better job. But if it has nothing to do with the creamy dairy product, then what is apple butter? And what the hell do we do with it?Apple butter is essentially concentrated applesauce. It’s usually flavored with the usual suspects—think cinnamon, cloves, nutmeg, nutmeg or a handful of other “warming spices\"—and the cooking process is similar. The only difference is that apple butter is milled, pureed, or finely chopped and then cooked for a longer period of time, which gets out more water and allows it to caramelize. What you’re left with is a dark brown, deeply caramelized spread packed with intense apple flavor.The only thing apple butter has in common with regular butter is its spreadability. But it’s actually more comparable to preserves or jam than it is butter; it's really just concentrated fruit, maybe a bit of sugar, with no dairy in sight. And like jam, apple butter is actually pretty damn delicious spread across a buttered piece of bread, with a little flaky sea salt. It also works well dolloped on a cheese plate to lend a little sweet, fruity contrast to funkier specimens, or stirred into yogurt.But while we're happy to use apple butter in any instance where jam or preserves would be welcome, it has a lot of other applications too. We reach for a jar when we want to add concentrated apple flavor to baked goods without all of the water that the fruit itself brings to the party. It also works when mixed into braising liquids, marinades, or glazes to bring sweetness and complexity to grilled and roasted meats. Apple butter and apple cider braised pork shoulder? Yeah. We want that.Mmmmm...spreadable.\nAlex LauWhen you want that autumnal vibe, regardless of the the season, preserved apple butter delivers. And while it is actually pretty easy to make, it's a bit of a project; you're probably better off just buying it at the store unless you've got a lot of apples and time. Make sure you keep it in the fridge after you open it though.No, apple butter is not as versatile or important in the world of home cooking as good ol’ butter-butter, but that doesn’t make it any less fantastic. It makes it special. Like, bake-an-apple-butter-cake-on-a-Tuesday-night special. Sounds like you’ve got plans.Yeah, there's that cake:Apple Butter Spice Cake with Cinnamon CrumbleCINNAMON. CRUMBLE.View RecipeExplore Bon AppétitBasicallyAppleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Alex Delany"]}