{"id": "8864e4f18e6d34d5961f3704fa422b40", "url": "https://www.bonappetit.com/recipe/seared-halloumi-with-peanut-dukkah-and-honey", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Seared Halloumi with Dukkah and Honey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSeared Halloumi with Peanut Dukkah and HoneyBy Maydan, Washington, D.C.August 14, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintSalty, lacy-edged Halloumi covered in warm honey and sprinkled with nutty dukkah—what’s not to love? This recipe is from Maydan in Washington, DC, our No. 2 Best New Restaurant 2018.Ingredients8 servings ¼cup skinless raw peanuts2Tbsp. toasted white sesame seeds1Tbsp. black sesame seeds1tsp. coriander seeds1tsp. cumin seeds½tsp. finely ground black pepper28-oz. packages Halloumi cheese¼cup (or more) extra-virgin olive oil¼cup honey, warmedSpecial EquipmentA spice mill or mortar and pestleIngredient InfoHalloumi cheese can be found in Greek markets, natural foods and specialty foods stores, some supermarkets, and online.PreparationStep 1Preheat oven to 350°. Toast peanuts on a rimmed baking sheet, tossing once, until golden brown, 8–10 minutes. Let cool. Crush with a mortar and pestle or finely chop. Transfer to a medium bowl, add both sesame seeds, and toss well.Step 2Toast coriander seeds and cumin seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes; let cool. Coarsely grind in spice mill or with mortar and pestle and add to peanut mixture along with pepper; mix dukkah well.Step 3Cut each piece of Halloumi in half on a diagonal. Working with 1 piece at time, place Halloumi cut side down on a cutting board and slice lengthwise into triangular planks. (You should have 12 total.) Pat dry with paper towels.Step 4Heat oil in a large heavy skillet, preferably cast iron, over medium-high. Working in batches and adding more oil as needed, cook Halloumi until golden brown, about 2 minutes per side. Transfer to fresh paper towels to drain.Step 5Arrange on a platter; drizzle with honey and sprinkle with some dukkah.Step 6Do Ahead: Dukkah can be made 2 weeks ahead. Store airtight at room temperature.How would you rate Seared Halloumi with Peanut Dukkah and Honey?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleQuite yummy, though this is a little more work than it's worth for the final dish. I haven't bought dukkah before, but I imagine it would have a more complex taste than grinding up just peanuts, coriander and cumin. If you can find some at the speciality store, I'd definitely make this combination again.AnonymousNew Haven, CT8/27/2018Explore Bon AppétitGreekEuropeanNorth AfricanAfricanHalloumiCheeseStarterSnackHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Maydan", "Washington"]}