{"id": "888b84e78c0ea6f569aba753b3894601", "url": "https://www.bonappetit.com/recipe/seared-lamb-with-marinated-halloumi-and-herbs", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Seared Lamb with Halloumi  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSeared Lamb with Marinated Halloumi and HerbsBy Carla Lalli MusicFebruary 12, 20194.3(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliEmailPinterestPrintEmailPinterestPrintLamb is naturally earthy and a little grassy, and its flavor won’t get buried despite this big pile of fresh herbs and salty marinated cheese. If you are sensitive to even a whiff of gaminess, seek out domestic, grain-finished lamb, which is sweeter and milder than the 100 percent pasture-raised imports from New Zealand and Australia. And because ground lamb contains a generous percentage of fat, you can smash it into a hot skillet and let it develop a nice crust without worrying about it drying out. This recipe is from Where Cooking Begins by Carla Lalli Music.Ingredients6 servings6oz. Halloumi cheese, torn into small pieces1tsp. fennel seeds1tsp. mustard seeds2Tbsp. pumpkin seeds (pepitas)4Tbsp. extra-virgin olive oil, divided, plus more for drizzling½tsp. Aleppo-style pepper2tsp. finely grated lemon zestKosher salt2lb. ground lambFreshly ground black pepper2cups mixed tender herbs (such as dill, cilantro, and/or mint)Flaky sea saltLemon wedges (for serving)Special IngredientHalloumi can be found at Greek markets, natural foods and specialty foods stores, and some supermarkets.PreparationStep 1Place Halloumi in a small heatproof bowl. Cook fennel seeds, mustard seeds, pumpkin seeds, and 3 Tbsp. oil in a small saucepan over medium-low heat, stirring occasionally, until oil is sizzling, pumpkin seeds are golden brown, and some of the mustard seeds start popping, about 5 minutes. Add Aleppo-style pepper and immediately scrape seasoned oil over Halloumi. Toss to combine, then add lemon zest; season with kosher salt. Let Halloumi marinate while you cook the lamb.Step 2Heat a large skillet, preferably cast iron, over medium-high, 3 minutes. Pour in 1 Tbsp. oil, add lamb, and use a heatproof rubber spatula or a wooden spoon to smash down, spread out, and flatten meat onto pan’s surface. You’re making a big flat lamb patty at this point. Season surface evenly with kosher salt and black pepper and cook, undisturbed, until underside is very browned and you can see fat and juices start to pool on surface, 6–8 minutes. Toss lamb, using spatula to scrape it up and break into smaller pieces. Cook just to lightly brown rare side, 1–2 minutes more.Step 3Transfer lamb to a platter. Spoon marinated Halloumi over, along with infused oil, pumpkin seeds, and spices. Top with herbs and drizzle with olive oil. Season with sea salt. Serve with lemon wedges for squeezing over.How would you rate Seared Lamb with Marinated Halloumi and Herbs?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI discovered this recipe in one of my Bon Appétit’s cookbook. It’s definitely one of my favorites and super easy to do. I normally double up on the mustard and the fennel seeds, use mint... and instead of Halloumi I use feta (very recommended). These flavors are amazing!! ManuelaColombia4/29/2021I've made this several times and I think this recipe is excellent. I originally discovered it in Carla's cookbook but wanted to leave a review here. If you love lamb and love halloumi then this meal will make you very happy. I usually double the dried spices because I love their flavor and love biting into them. This meal takes no time at all to prepare and looks really pretty on the table.AnonymousLos Angeles9/30/2019I should've gone with my gut and used only a pound of lamb. I knew two pounds would be too much and render the dish extremely unproportional and bland, as the marinate is enough to flavor just one pound of meat. I ended up reserving half of the lamb to use with another dish and suggest anyone who makes it do the same. Two pounds is way too much unless you plan on doubling the halloumi marinade as well. Four stars with correct proportions. Two stars as the recipe is written. AnonymousLos Angeles, California6/25/2019Explore Bon AppétitMediterraneanHalloumiCheeseGround LambLambMeatEasyWeeknight MealsMainGluten-FreeKetoFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Carla Lalli Music"]}