{"id": "888bd3026d55a7ce550f63df5d3939de", "url": "https://www.bonappetit.com/story/hesperios-autumn-hruby-cafe", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Hesperios NYC Founder Autumn Hruby Just Opened a Cafe in Her Dreamy Manhattan Shop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHesperios Founder Autumn Hruby Just Opened a Cafe in Her Dreamy Manhattan ShopHousemade sodas, House of Waris teas, and an epic Saxelby cheese plateBy Aliza AbarbanelMay 21, 2018FacebookTwitterEmailSelma Slabiak and Autumn Hruby at Hesperios cafe.Photo by Emma FishmanFacebookTwitterEmailOn a Nolita street frequented by European tourists in wide-leg jeans, a wormhole has opened. Time slips away inside Hesperios, the all-white shop where racks of soft knitwear line the walls alongside Lena Willhammar ceramics and perfume oils straight from the Madini family in Tangier. This is Hesperios, Autumn Hruby’s highly-curated kingdom and, as of last week, it’s also home to her new cafe.Hesperios began as Hruby’s fashion label, best known for creating cozy minimalist knitwear, as well as a biannual journal of literature and culture. She opened the brick-and-mortar location earlier this year as a calm, utterly lovely “city retreat.” “I didn’t want to have a stagnant retail environment where people are just sitting around selling the clothes,” Hruby says. “Yes, it’s the clothes, but it’s a whole world.”The cafe's full cheeseplate\nPhoto by Emma FishmanThe new cafe, tucked to the side past a shelf of her signature knitted sweaters, is helmed by Selma Slabiak, former head bartender of the much-lauded New Nordic restaurant Aska and its downstairs bar Edda in Brooklyn. Slabiak and Hruby met at the Union Square Greenmarket two years ago, when they were introduced by chef Chris Fischer, a mutual friend. “I will forever remember that she was lugging so many hyacinths around,” Slabiak says with a laugh. “I just knew immediately that we would be friends, because we share the same love for the same things. I think that it was just meant to be.”Last week, Slabiak and Hruby happily orbited each other behind the cafe’s marble counter, chatting and passing ceramic dishes as a timer counted down the seconds to ensure my cup of milky oolong tea was steeped to perfection. A sleek water filtration system, programmed with specific temperatures for each variety of tea, glowed quietly in the corner.A wine and beer license is in the works, but, for now, Slabiak’s fleet of non-alcoholic offerings are compelling enough to warrant a trip. The blueberry lavender shrub is lightly floral and explosively juicy, finishing with a restrained note of vinegar. A seabuckthorn and citrus concoction is fresh and just slightly sour, comforting enough to channel a childhood glass of Orange Crush.Then there’s the tea list from white-hot bespoke tea brand House of Waris, “Scandinavian-style” pour-over coffee from Irving Farm, and crusty loaves of bread from Meyers Bageri, the artisanal Danish bakery run by Noma co-founder Claus Meyers. Slices of white chocolate cherry blossom cake and mint macarons are available from Burrow patisserie in Dumbo. And, truly, the cheese plate is something to behold.The eclectic shelves lining Hesperios shop\nPhoto by Emma FishmanSaxelby Cheesemongers provides the dairy: fresh goat cheese from Seal Cove Farm in Maine, cow and sheep’s milk triple crème from Old Chatham upstate, and a thick wedge of blue d'auberge from Hervé Mons in France. The lingonberries and sea buckthorn used in Selma’s homemade sodas find new life as preserves, which are paired with tiny vintage Scandinavian oyster forks and sturdy spelt crackers. There are dehydrated orange slices and scattered berries and a dollop of golden local honey to drizzle over it all.The rest of the menu will change, particularly as summer brings fresh produce to the farmers’ market. “Everything had to earn its place on the menu, very much,” Slabiak says. “But because it’s such a small operation, it’s really nice that whatever we find we can put on the menu—” “Or whatever we have room for,” Hruby adds.In a classic story of New York real estate, Hesperios used to be a vape shop. That day, it was hard to picture clouds of Cool Cucumber billowing through the neat rows of artisanal jam. Two clementine trees frame the entrance, and a fig tree just waking up from winter marks the entrance to the backyard. Soon there will be a garden here, designed by landscape architect Miranda Brooks. It will bloom with plants like Hesperis and Wisteria and, much to Slabiak’s delight, a herb garden.“It’s like an oasis. I love that if you’re shopping for a lovely sweater or if you want to sit and read this amazing book that you bought from the bookshop, then you can also sit down and have something really lovely to drink and eat,” Slabiak says. “You can treat yourself so well here.”Explore Bon AppétitHealthyishTrendsNew YorkNew York CityShoppingRead MorecultureThis Brooklyn Shopkeeper Is Totally Reading Our MindsBy Elyssa GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-21", "author": ["Condé Nast", "Aliza Abarbanel"]}