{"id": "888f35e4f240dba913ef660b8c32a031", "url": "https://www.bonappetit.com/story/tart-celery-vinegar", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Move Over ACV, There's a New Vinegar in Town | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMove Over ACV, There's a New Vinegar in TownTart Vinegar is my secret weapon for dressings, marinades, and even cream cheese frosting.By Kyle BeecheyJune 10, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.As a longtime salad enthusiast, I understand the importance of vinegar. I respect it. I use it with a light hand, carefully and deftly, ensuring that my leafy greens are delicate and bright rather than mouth-puckeringly sour. For maximal salad enjoyment, I always keep a few varieties on hand—ACV, balsamic, wine vinegar, maybe a champagne, a rice, or a sherry—to add that craveable finishing pop. Just a touch! But then I discovered Tart celery vinegar, and now, instead of being a predictable supporting player, vinegar is the star of every show.If you’re thinking, “Celery vinegar? Is that like the raspberry balsamic in the back of my parents’ pantry?” know that Tart has nothing in common with those flavored vinegars from the ’90s. Tart’s founder, Christina Crawford, makes small-batch, double-fermented vinegar at her Red Hook factory using produce carefully sourced from foragers and farms that practice regenerative agriculture. She doesn’t just add juice to vinegar and put a cork in it. Instead, Crawford blends celery stalks together with filtered water, a vinegar mother, natural yeast, and sugar, then leaves it to ferment for up to two years. What lies in that green bottle is alive and raw (most commercial vinegars are pasteurized), savory and vegetal with just the right amount of pucker.Since bringing my first bottle home, I’ve used Tart’s celery vinegar not only in salad dressings, but also in marinades (for the ultimate flavor absorber, tofu), cocktails (try it in a G&T), and sauces (hello zingy salsa verde). It’s my go-to for finishing a pot of beans or raw, grilled, and roasted vegetables, and my perfect summer beverage is Topo Chico with a healthy splash of celery vin. I’ve even used it to subtly flavor a cream cheese frosting for a parsnip ginger cake.While celery remains my favorite, I also scoop up Crawford’s market-inspired, limited-edition, “can’t believe these actually exist flavors” like persimmon, Japanese knotweed, oro blanco, and coriander whenever there’s a new drop. At $20 a bottle, I try to exercise restraint and portion out Tart vinegars like a rare species of truffle. Except I can’t. Heading into salad season, I’m already plotting how I’ll use my next bottle. Maybe a slaw of celery on celery on celery on celery. Shaved stalk, torn leaf, sprinkled seed and, of course, a heavy dash of vinegar.Photo by Isa ZapataTart Celery Vinegar$24 at Tart VinegarExplore Bon AppétitShoppingHighly RecommendVinegar GuideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-10", "author": ["Condé Nast", "Kyle Beechey"]}