{"id": "88927cf53043e3e2e9ab5b9729470f31", "url": "https://www.bonappetit.com/story/porch-chicken-salad", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "The Healthy Chicken Salad I’m Eating on My Porch All Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Chicken Salad I’m Eating on My Porch All SummerI can eat a big plate of this chicken salad in 80-degree weather and still feel great afterward.By Christina ChaeyMay 23, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery other week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish friends,While summer has never been my season (too sweaty!), summer food has always been some of my favorite. And so I’m sliding into Memorial Day weekend feeling bittersweet, thinking of all the cookout hot dogs, park picnics, and beach hoagies I won’t be enjoying with friends this year. I’ve made halfhearted plans to try to bike to the beach by myself over the long weekend, but I’m not sure what I’ll do once I get there. Wave to it?One saving grace for me right now is that my apartment has ample porch space for me to safely, distantly host one or two visitors at a time. My building has a small, concrete walkway where my roommates and I have started setting out a rotting old bench we found as seating “for company.” Once or twice a week, we have a friend over, usually to open a bottle of wine to mark the end of a long day.With the wine, there are always snacks. When we first started hosting these impromptu stoop hangs, I didn’t set out anything too elaborate: a handful of crackers and some olives and a wedge of cheese were novel enough to make it feel special. But now that we’re a few weeks into hosting mode, I’ve slowly upped the ante on my porch spreads. I’ve now graduated to full-on meals, which I bring downstairs on a half-sheet tray with plates, napkins, glasses—basically everything but the tablecloth (though that might be my next step).It's definitely chicken salad season.\nPhoto by Emma Fishman, Plate by Meilen Ceramics One recent such stoop meal featured this brand-new Healthyish Chicken Salad, which is the kind of chicken salad I can eat a big plate of in 80-degree weather and feel great afterward. If you’ve never gently poached a chicken breast in salted water until the meat is juicy and pull-apart tender, let this be the recipe that gets you there. (Although rotisserie or roast chicken would be great here, too.) Crunchy lettuce and cucumber planks keep things super refreshing, scallions add gentle bite, and a crunchy-creamy sesame dressing inspired by Japanese gomae adds texture and richness to every bite.I made this for my roommate Emma and our friend Belle on one of the first super-hot days of the season, along with iced black sesame milk lattes (from one of my favorite cookbooks, Amy Chaplin’s Whole Food Cooking Every Day). We hung up our masks and ate and drank and talked for hours, and it was so joyous as to feel almost...normal. In the absence of regularly scheduled summer programming, I, like everyone else, am trying to figure out how to socialize in quarantine right now. I’ve written about it here before, but Rachel Khong’s essay about opening a pretend restaurant in her kitchen is inspiring me to think of other little touches I can add to bring our little porch set to life. On my list so far: a Bluetooth speaker, candles, paper umbrellas for piña season. I suppose there’s no rush, though. I have all summer to figure it out.Waving from my stoop,Christina ChaeyAssociate editorGet the recipe:Healthyish Chicken SaladThis is the summery chicken salad you could eat plate after plate of without feeling like you’ve downed a jar of mayonnaise—because you didn't! Tender poached chicken breast, crisp greens, cukes, and scallions get tossed with a gomae-inspired dressing, with pops of crunch from sesame seeds and the creamy nuttiness of tahini in every bite.View RecipeExplore Bon AppétitWhat's Chaey Cooking?HealthyishChicken SaladRead MoreLifestyleMy Pantry Spreadsheet Is Bringing Me So Much Joy Right NowBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-23", "author": ["Condé Nast", "Christina Chaey"]}