{"id": "8897b746ffdd25ec41384f64efdd1494", "url": "https://www.bonappetit.com/story/difference-between-a-calzone-and-a-stromboli", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "What Is the Difference Between a Calzone and a Stromboli? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is the Difference Between a Calzone and a Stromboli?Both are made with pizza dough and stuffed with cheese, but you'd be a fool to call them the same.By Alex DelanyMay 2, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailA stromboli and a calzone are not the same thing. Please, I beg you, trust me. I tell that to people quite frequently (because I am the type of person who talks about stromboli a lot) and no one seems to believe me. I give them a nice explanation as to what stromboli is and what a calzone is. They skeptically say, “Ok, yeah, sure,” and then they walk away muttering something like, “That guy was weird, right?”That’s not how this is going to go. I’m going to tell you what the difference between a calzone and a stromboli is, and then you’re going to write it in your journal and make it your mantra. Maybe you’ll even get it tattooed on your body. Who’s to say?Both calzones and stromboli are pizza derivatives. They utilize the same ingredients to achieve different versions of a sealed, portable pizza. There’s pizza dough, cheese, and fillings. Sometimes there’s sauce. We’ll get into that in a second. Here’s how they’re different:The Sealing TechniqueThe major difference between a calzone and a stromboli is how they are sealed. If you wanted a very straightford comparison, here you go: a calzone is like a taco, and a stromboli is like a burrito. Tacos and calzones are always folded. Burritos and stromboli are always rolled. You seal a calzone by folding it in half and crimping the edges. You seal a stromboli by rolling it in a spiral and folding some extra dough back over the stromboli. Both get an egg wash to make sure the dough stays out.Calzones, sliced in half, are smaller and shaped like half-circles.\nPhoto by Chelsie CraigThe Shape and SizeThe different sealing techniques mean that calzones and stromboli start as different shapes. When shaping dough for a calzone, you shape a circle. The folded circle creates a small half-circle. Calzones are generally single serving.When you shape dough to make a stromboli, you shape an elongated rectangle. The rectangle is rolled to create a long, skinny, cylindrical pizza cigar. Stromboli is meant to be sliced for multiple people.The OriginAnother difference is where they come from. Calzones are Italian. Actually, legitimately, 100%-certified, Italian. They originated in Naples as a casual, standing-on-the-street way of eating pizza, and they vary in terms of ingredients and techniques in different regions in Italy.Stromboli is Italian-American. It originated in Philadelphia, from the depths of the Italian-heavy neighborhood of South Philly. It was named after the Italian Isle of Stromboli. On the Isle of Stromboli, there’s a giant volcano called Mt. Stromboli. If that doesn’t get you stoked to be alive, I don’t really think I can help you.Cross-sections of stromboli, filled with ingredienTs like spinach, pepperoni, fennel, and sausage.\nPhoto by Chelsie CraigThe FillingsThere’s a lot of crossover in the filling category. Ingredients like cured meats, vegetables, and herbs can be used in both calzones and stromboli, but there are two things that set them apart. Calzones use ricotta cheese, and stromboli does not. Stromboli is made with mozzarella cheese (preferably low-moisture) to keep moisture at a minimum. This helps the interior dough cook fully. Calzones usually use a blend of cheese that almost always incorporates ricotta.And then there’s sauce. Calzones never have tomato sauce inside the dough. They’re always dipped. While stromboli is also dip-able, it’s totally cool to put some sauce inside stromboli, pre-roll.Whether you’re team stromboli or team calzone, these distinctions shouldn’t inspire hate. We’re here to appreciate the differences, not yell about them. This whole thing is about growing as human beings. And finding ways to eat more pizza.OK. That should be it. You believe me. Or at least you should. Good luck with that tattoo.Yeah, let's make some stromboli.This Tax Season Stromboli Recipe Is My Only DependentIt's basically just a pizza rolled up into a giant log. And when you're paying rent AND taxes in the same month, it's here for you.View StoryExplore Bon AppétitBasicallyPizzaDoughCheeseItalianItalian AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Alex Delany"]}