{"id": "889d9080d671682dccb97c27aaddb65d", "url": "https://www.bonappetit.com/recipe/ancho-mole-cookies", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Ancho Mole Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueAncho Mole CookiesBy Rick MartinezNovember 19, 20194.2(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintLooking for a cookie that leans savory? How about a deconstructed Mexican mole visually inspired by the Mesoamerican pyramids? Hold these cookies up to the light to appreciate the stained-glass effect of the dried fruit. And inside? Chocolate, hazelnuts, the subtle burn of ancho chile…IngredientsMakes about 481cup (140 g) nuts (such as  blanched hazelnuts, blanched almonds, or walnuts)1¼cups (185 g; or more) raw sesame seeds, divided⅓cup (54 g) ancho powder (pure ground ancho chiles, not ancho chile powder, which has added salt, cumin, and other spices)¼cup agave syrup, preferably dark2cups (256 g) all-purpose flour¼tsp. baking powder¼tsp. ground cinnamon12Tbsp. unsalted butter, room temperature½cup (100 g) sugar1¾tsp. kosher salt3large egg yolks1Tbsp. vanilla extract or vanilla bean paste¾cup (130 g) dried fruit (such as papaya, mango, or pineapple), cut into ¾\" pieces¾cup (110 g) bittersweet chocolate wafers (disks, pistoles, fèves; preferably 72% cacao)1large egg white, lightly beatenPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Toast nuts and ¼ cup sesame seeds on a rimmed baking sheet on upper rack, tossing halfway through, until golden brown, 8–10 minutes. Let cool.Step 2Stir together ancho powder and agave syrup in a small bowl. Whisk flour, baking powder, and cinnamon in a medium bowl to combine. Using an electric mixer on medium-high speed, beat butter, sugar, and salt in a large bowl, scraping down sides and bottom of bowl as needed, until light and creamy, about 3 minutes. Add egg yolks and vanilla and beat until incorporated, about 1 minute. Scrape in ancho mixture and beat until smooth and creamy, about 1 minute. Reduce speed to low, add dry ingredients, and beat to combine. Add dried fruit, chocolate, and toasted nuts and sesame seeds; mix with a wooden spoon until evenly distributed.Step 3Divide dough in half. Working one at a time, roll each piece into a 10\"-long log. Wrap each log tightly in plastic and roll across work surface to make as smooth and cylindrical as possible. Place on a rimmed baking sheet and freeze until surface is firm, about 20 minutes.Step 4Slap a log down onto counter to create a flat side; roll over and slap again to flatten another side (you’re aiming for a triangular shape). Repeat to create third side of the triangle. Tap against counter to smooth if needed, then tap ends to flatten. Repeat with second log. Return logs to baking sheet; freeze until firm, about 15 minutes.Step 5Working one at a time, unwrap logs and brush sides with egg white. Working on baking sheet, sprinkle sides with remaining 1 cup sesame seeds and gently press to coat. Surface should be covered; use more sesame if needed. Freeze logs on baking sheet, uncovered, until surface is very firm but not frozen solid, about 1 hour.Step 6Preheat oven to 350°. Slice a log crosswise into ¼\"-thick triangles and divide cookies between 2 parchment-lined baking sheets, spacing 1\" apart. (If dough is soft or starts to lose its shape, freeze 10 minutes before continuing.) Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are just set, about 10 minutes. Let cool on baking sheets. Transfer cookies to a platter or airtight container and line baking sheets with fresh sheets of parchment paper. Repeat process with remaining dough.Step 7Do Ahead: Dough can be rolled into logs 3 days ahead; refrigerate. Transfer to freezer 30 minutes before slicing. Cookies can be baked 1 day ahead; store airtight at room temperature.How would you rate Ancho Mole Cookies?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI loved these cookies! A little bit sweet, but with this great exotic ancho flavor at the finish, which is so unexpected. This is definitely a way to change up your usual Christmas cookie gifting! I made them two years ago and am making them again!!!G. Lopez-PattonChino, Ca12/23/2021These fell into the weird category for me.   Used chili, almonds, raisins, and 70% dk chocolate.  Loved the idea, but result was a mix between a salty biscotti and shortbread.  Flavor was strange, and this comes from someone who likes a little smokey chili in sweet things.Anonymous803028/17/2020Made a double batch of these cookies and they were totally worth it. If you have less adventurous eaters they maybe aren’t the way to go, but my colleagues at work really appreciated them! One said they “broke his brain” with the contrast of savory and buttery chile goodness contrasted with the sweetness of mango and chocolate. Solid win.Tyann CherryDupo, IL12/21/2019Freddster -- it says in the recipe: \"preheat to 350°. Bake cookies, rotating baking sheets top to bottom and back to front halfway through, until edges are just set, about 10 minutes.\" :) Anonymous12/18/2019Spicy cookies!!! Rick, I love you!AnonymousAtlanta12/18/2019Making these tomorrow, already have the dough made but just realized no where in the recipe does it say how long to bake them for and at what temperature.....help! At least for future people that may want to try them out! FreddsterChicago12/18/2019This recipe does not say what temperature to cook the cookies. Just the nuts before you make the cookies.  Any ideas?  Anonymouscrownsville12/17/2019So good. Huge difference when I kept them in the oven until they became noticeably brown - definitely longer than 10 minutes. They got much more chili-y and buttery delicious with the extra time, at least with my oven. Anonymous12/17/2019These are really good. Though I’m curious about how his are so light colored. Mine are extremely dark. AnonymousMinnesota 12/15/2019To me, this was a bit of a highwire act. It took a lot of preparation and I wasn't sure it would actually work until I tasted the finished product. Great crunch, pleasing visual colors, and a nice sweetness with savory notes. I made it with hazelnuts and dried papaya and chocolate chunks because I didn't have fèves on hand. I also didn't find ancho powder at my local store, but they did have ground California chiles. I used half of what was called for (mostly out of fear that it would still be too much), and found that the burn came through, but subtly enough to make it a lingering afterthought.AnonymousSacramento, CA12/10/2019I can't stop eating these cookies. AnonymousBerkeley, CA12/4/2019Explore Bon AppétitCookieDessertAncho ChileChileVegetableHazelnutNutChocolateOther IngredientsAlmondWalnutBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}