{"id": "889f4b6e8cadb15c95608452d61439ce", "url": "https://www.bonappetit.com/story/doufu-gan", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Doufu Gan Is a Braised Five-Spice Tofu With Countless Applications | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen You See Five-Spice Doufu Gan, Grab It!With this flavor-packed braised tofu in the fridge, you’re moments away from a meal.By Cathy ErwayFebruary 11, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.You can almost consider five-spice doufu gan (a.k.a. dougan or tofu gan), which is available at Asian groceries, a separate food from the off-white blocks of tofu you’ll find in a supermarket. Whereas water-packed white tofu is mild and squishy (or silken), dry-packed doufu gan is dense, chewy, and nutmeg-colored. It’s pressed until it’s firmer than any block of extra-firm tofu (gan means “dry” in Mandarin) and then braised in soy sauce and spices until it’s stained and flavored throughout. And it takes a lot of the work and time out of making a tasty meal.This stuff was so ubiquitous in my refrigerator growing up that I’d steal a slice to gobble up cold as a snack. In Taiwan, where my mother grew up, it was probably just as common a sight—my grandfather often cut it into cubes to stir-fry with shelled edamame and maybe a dollop of chili oil for an inexpensive yet protein-packed topper for rice. And in homes and restaurants throughout Taiwan, you’ll often find it cut into long slivers and stir-fried alongside slivers of garlic chives, yellow chives, Chinese celery, or thinly sliced pork—or all of those together. Its firm yet yielding texture plays well against any crisp vegetable you want to slice into thin shards and toss around in a smoking-hot wok alongside it—like bell peppers, bean sprouts, or green beans.With five-spice doufu gan, there’s no need for the manipulation that many recipes often instruct for water-packed white tofu blocks. There are those who recommend freezing tofu first, which allows some water to leach out once it’s thawed, making it drier and pocked with air bubbles that soak up sauce. There are those who press it down with something heavy for days, marinate it for hours, and bake it. And then there’s the salt water soak or blanch, which Fuchsia Dunlop has advocated for in her Chinese cookbooks.But when I want super-pressed, dry, and flavorful tofu, I’ll simply buy five-spice doufu gan in the refrigerated aisle of an Asian grocery. You might find smoked or unflavored versions of doufu gan too. It freezes well, so when I find it, I stock up. (And when I want soft white tofu for a dish, like mapo tofu or soondubu jjigae, I’ll buy it and keep it that way.)Because doufu gan doesn’t break apart easily when tossed in a pan, you can cut it into matchsticks or cubes and crisp them up golden brown all around—it makes a great snack. Or mince it up for the foundation for a vegetarian dumpling filling with chopped alliums and maybe carrots and cabbage. Serve it cold in a salad with marinated cucumbers and pickled mustard greens, dressed with some vinegar and sesame oil, or pair it with a small amount of twice-cooked pork belly to stretch it—doufu gan is often a meat complement rather than a substitute.While I’ve never met anyone who didn’t love five-spice doufu gan on the first try, supposed tofu-haters included, I have found that those who didn’t grow up with it often just don’t know that it exists. And even if you are aware of it, it can be harder to find. But once you do find it, the hardest part of preparing it is over.Cathy Erway is a cookbook writer, podcast host, and blogger living in New York.Explore Bon AppétitTofuTaiwanChineseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-11", "author": ["Condé Nast", "Cathy Erway"]}