{"id": "88a47a52df2c0d484b6e106db174fe17", "url": "https://www.bonappetit.com/recipe/toasted-garlic-herb-blender-sauce", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Garlic–Herb Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueToasted Garlic–Herb Blender SauceBy David TamarkinJanuary 8, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintYour new everything sauce is like pesto, but better. Roasting the garlic takes the edge off, while a hit of mint adds a dose of contrasting coolness. To roast a whole head of garlic in a fraction of the time, separate the cloves from the bulb, then cook them on the stove rather than in the oven. Reprinted With Permission From COOK90: The 30-Day Plan for Faster, Healthier, Happier Meals By David Tamarkin, Published By Little, Brown and Company, 2018.IngredientsMakes about 1½ cups1head of garlic, cloves separated, unpeeled2cups parsley leaves with tender stems1cup mint leaves1cup extra-virgin olive oil1tsp. finely grated lemon zest4tsp. fresh lemon juice1tsp. crushed red pepper flakes¾tsp. kosher saltPreparationStep 1Heat a medium heavy skillet, preferably cast iron, over medium. Toast garlic, tossing occasionally, until skins are darkened on all sides and cloves are softened, 12–15 minutes. Let cool.Step 2Peel garlic; discard skins and transfer cloves to a blender. Add parsley, mint, oil, lemon zest and juice, red pepper flakes, and salt. Blend until a pesto-like sauce forms.Step 3Do Ahead: Sauce can be made 1 week ahead. Cover and chill.How would you rate Toasted Garlic–Herb Blender Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleAmazing!  Great way to use a plethora of herbs from the garden.  Added 1 C of fresh Basil as well.  The toasted garlic was fantastic.  Only used 1/2 C of oil.  Have drizzled it on potatoes, salmon, and have made a pasta salad.  A great recipe.Anonymous6/28/2021Explore Bon AppétitSauceCondimentGarlicVegetableParsleyHerbs & SpicesMintNut-FreeGluten-FreeDairy-FreeVeganVegetarianKetoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "David Tamarkin"]}