{"id": "88a9a02c2060fde24dcea8e2765593c7", "url": "https://www.bonappetit.com/story/fatafat-digestive-pills", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Pop These Digestive Pills Like Candy (Because They Basically Are) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Pop These Digestive Pills Like Candy (Because They Basically Are)Shoutout to all the other Indian kids who snuck Fatafat packets out of the pantry after dinner.By Priya KrishnaSeptember 7, 2019FacebookTwitterEmailPhoto by Aliza AbarbanelFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!According to the packaging, Fatafat is an “Ayurvedic digestive pill.” So technically, it’s health food. But as me and all the other Indian kids who grew up sneaking packets out of the pantry after dinner know, Fatafat is basically candy. Round, soft, chewy black orbs made of salt, sugar, cumin, amchur (mango powder), and ajwain (carom seeds) that happen to aid in digestion. Digestive snacks, or churan, are a whole category in India, and I can’t think of anything else that packs so much umami in a single package.Fatafat has the I-can’t-stop-eating-these quality of Reese’s Pieces, the electrifying tang of Sour Patch Kids, and the salt-sugar ratio of Chewy SweeTARTS. Plus, it really does help settle your stomach! Fatafat was in such high demand in my house growing up that my older sister tricked me into thinking Fatafat was actually just little pieces of poop (to be fair, that’s what it looks like) so she could hog our limited stash. Only Indians would be so bold as to make candy and label it as medicine, and my acid reflux and I are forever here for it. —Priya Krishna, contributing writerBuy it: Fatafat Ayurvedic Digestive Pills, $10 for 10 13 oz packs.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishIndianHealthyish Loves ItShoppingRead MoreLifestyleThis Coconut Oil Floss Turned Me Into a Daily FlosserBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-07", "author": ["Condé Nast", "Priya Krishna"]}