{"id": "88b79c0b688e721be86cc37c3b64120d", "url": "https://www.bonappetit.com/story/carrot-feud", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Thoughts on Carrots, Caullini, and Jack Dorsey’s Drab Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThoughts on Carrots, Caullini, and Jack Dorsey’s Drab DinnerWhat's the new “it” vegetable? Let's find out.By Alex BeggsApril 13, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you’ll see it before everyone else.Self-fulfilling propheciesThis week, I found out that a majority of the Bon Appétit staff foretold their own futures. When Rachel Karten was in second grade, she wrote her first recipe...for a martini. (See above.) And while she spelled “Beefeater” wrong, I’m impressed at the generous three olives. Clearly, Little Rachel was destined for great things! Then I read an unnamed, embarrassed Test Kitchen editor’s college thesis on 17th century cookery books in England, which was—at times—fascinating. “I wrote a report in 7th grade about how the best dinner was Campbell's cream of chicken soup,” said Hilary Cadigan, arbiter of good taste. For a feature writing class, Christina Chaey interviewed a former BA food editor! Anna Stockwell made a recipe book with her Czech host mother when she was an exchange student in Prague. Aliza Abarbanel wrote a paper on the rise of tea in Britain and how tea shops provided a “third space” for the exchange of ideas. Emily Schultz photographed and produced her own food magazine, blatantly recreating a BA feature on toast. As you might have guessed, Amiel Stanek wrote his thesis on “on the intertextuality of recipes,” lol. (Amiel: “There is no original recipe! Every text is shot through with references to other texts!”) Before that, he made a magazine about cooking organ meat, called Gutsy. And me? Well..Peden + MunkWhat’s Jesse cooking?Last weekend, Jesse Sparks made Claire Saffitz’s babkallah (hybrid challah x babka). I always thought that was an intimidating recipe, but “it was incredibly simple, approachable, and definitely boosted my baking confidence,” said Jesse.Get the recipe: Chocolate-Cinnamon “Babkallah”Have you pre-orderedIndian-ish, yet? If you’re in the New York area, I hope to run into you at Priya’s dinner at Bombay Bread Bar (her mom Ritu will be cooking too!!). There are more great dinners—all over the country—if that one sells out by the time you read this. (Here’s the full book tour.) If I still lived in Houston, I wouldn’t miss the event at Chris Shepherd’s UB Preserv. And a final if: If she isn’t coming to your town at all, guess you’ll have to host an Indian-ish cookbook club!Buy it: Indian-ish: Recipes and Antics from a Modern American Family, $19 on amazon.comY thoWhat’s the point of inventing a start-up, making beaucoup bucks, and then...not spend all of it eating lobster for breakfast, Wagyu steak for lunch, and Roberta’s frozen pizza for dinner? Twitter founder Jack Dorsey revealed on a podcast this week that he eats one meal a day and fasts all weekend. I guess the character limit on Twitter makes more sense, in this context. Dude likes limits. I like lunch.Elizabeth CecilSpeaking of lunchAmiel Stanek said he made boiled potatoes with green goddess dressing recently and it brought him joy/happiness/fulfillment. OF COURSE IT DID. It’s green goddess season, folks! What have you done to bring this creamy, anchovy-y, herby dressing into your life? NOT ENOUGH.Use this recipe and dream big: Little Gem Lettuce with Green Goddess DressingHave you heard?Hold onto your butts, there’s a new “it” vegetable in town!!! “Move over cauliflower and broccoli! Caulilini is the new ‘it’ vegetable with stems like broccoli, florets lacier than cauliflower and even pretty enough to put in a vase,” began a press release that Emma Fishman forwarded me this week, knowing very well how important it is for me to be on top of the food trends—in case I ever get picked up by the Cash Cab. Caullini, a brassica with a registered trademark, looks like pale broccoli with yellow buds. It is my understanding that it is “insta-worthy.” It seems fine!Unnecessary food meme of the weekPhoto by Chelsie Craig, Food Styling by Kate BuckensUnnecessary food feud of the weekOur hotly debated new matzo ball soup recipe brought out the staff’s deep-seated issues with carrots. Carrot coins = good. Mushy carrots = bad. Baby carrots = unspeakable. “Why are people hypnotized by this vegetable?!” fumed Amiel. “If I see another menu with roasted carrots on yogurt with some seedy BS on top, I’m going to scream.” “I like them nice and burnt,” countered Meryl Rothstein. “They shouldn’t be the star,” said Christina Chaey, “but I like huge hunks of carrots, inappropriately soft, in a braise or pot pie.” “Why are we doing this again?” whined Molly. “I only put them in the matzo ball soup out of nostalgia. Okay? And those carrot coins are perfectly cooked, I might add.” Ryan Walker-Hartshorn told me that raw carrots give her an allergic reaction that makes her throat nearly close up...but she likes them so much she eats them with hummus all the time, tempting fate. (Worrisome, Ry!!) Gaby Melian told me a true tale: When she sold a table recently, it was picked up by a psychic medium who petted Gaby’s dog and said, \"He’s telling me he loves carrots.\" And she was right! Gaby’s dog loves raw carrots!! In the corner of the conference room, a certain vegetarian was suspiciously silent. Sarah Jampel, confess! She burst out: “SOMETIMES I EAT BABY CARROTS HERE JUST AS AN ACT OF REBELLION!”Gahhhhhhhhh!Get your sweet beta-C’s this weekend,Alex BeggsSenior Staff WriterExplore Bon AppétitBeggs NewsletterRead MorecultureIs It Ever Okay...To Call Out a Mansplaining Waiter?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-13", "author": ["Condé Nast", "Alex Beggs"]}