{"id": "88ba2de003896bf67454a8a8e785dac4", "url": "https://www.bonappetit.com/story/sticky-toffee-bundt-cake", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "This Sticky Toffee Pudding Cake Is an Old-Fashioned Dessert with a New Look | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Thing Better Than This Cake Is the Toffee Sauce You Drench It InEverything you love about sticky toffee pudding cake, but with a whole new lewk.By Sarah JampelMarch 6, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWhen it comes to cake, you take what you can get.Think about it: You can choose how much queso is on a chip, or how much butter is on toast, or how much cream is in coffee, or how much dressing is on greens—but cake? If it’s already frosted or glazed or crumb-topped, you’re stuck. In polite society, it’s frowned upon to lop off some icing or streusel from another slice to get more of the good stuff. (Don’t learn this the hard way.)That’s why a cake recipe that’s designed with sauce on top and on the side is a game-changer. Senior associate food editor Molly Baz—who, as you’ll remember, gave us Pumpkin Bread with salted maple butter to slather on as liberally as you’d like—has created a Sticky Toffee Date Cake to empower you to choose your own eating adventure.You can slice a piece and eat it as is—it’s not too sweet, it’s dotted with pockets of juicy dates, and it’s coated with enough sauce to drip elegantly down the ridges of the bundt—or go all in.  For a dessert more akin to traditional sticky toffee pudding—sauce-logged and  sticky-sweet—drown your piece in the extra sauce so that it’s a mere buoy in a sea of buttery caramel.This cake was a sponge (albeit, a delicious one) in another life: Thanks to the reverse creaming method, which we’ve turned to for foolproof cakes before, it’s fine crumbed: plush and springy, with no gaping air pockets—the perfect sauce sopper-upper. And the sauce, though its name is intimidating, involves no melting sugar or candy thermometers: It’s actually as simple as cooking butter and brown sugar until thick and smooth (this technically makes it butterscotch, then adding vanilla, flaky salt, and sour cream, which brings some welcome tang to an otherwise rich sauce.Want to dollop your cake, saturated with salted toffee, with more sour cream? Well why the heck not! This is your cake experience, after all—who are we to control it?Get the recipe:Sticky Toffee Date CakeWhy shouldn’t sticky toffee pudding be baked in a classic Bundt shape and bathed in a salted toffee sauce? Yep, we couldn’t think of a reason either.View RecipeExplore Bon AppétitCakeDessertRead MorecookingThe Burnished, Fluffy Cheesecake That’s Closer to CloudcakeBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-06", "author": ["Condé Nast", "Sarah Jampel"]}