{"id": "88c7b89218963c1bcb0a1eac18db5d74", "url": "https://www.bonappetit.com/story/memes-diner-brooklyn", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "MeMe’s Diner Is Serving Queer Hospitality, One Patty Melt at a Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Diner That’s Serving Queer Hospitality, One Patty Melt at a TimeIn an era of dwindling LGBTQ+ spaces, MeMe’s champions queerness in an inclusive, progressive, practical way, infusing equality in every aspect of the Brooklyn restaurant’s operations.By Melissa KravitzMarch 9, 2018FacebookTwitterEmailPhoto by Noah FecksFacebookTwitterEmailIt wasn’t the bubbling mozzarella on chicken cutlets or the everything-bagel babka I spotted on Instagram that lured me into MeMe’s Diner. These were just a bonus. I had to check out MeMe’s because this restaurant is, well, super gay.MeMe’s Diner, a new Brooklyn restaurant specializing in comfort foods like meatloaf, patty melts, and Velveeta mac and cheese stands in contrast with nearly every other buzzy opening. Expensive handmade ceramic plates are nowhere in sight, and the kitchen isn’t shy about using Heinz and Hellmann’s in lieu of artisanal substitutes. These are the foods we want to eat—let’s face it, all the time—but especially on long, lazy weekend afternoons at tables crowded with your friends.Noah FecksMeMe’s was born out of a pair of friends’ love for entertaining and hospitality. After working together at Ovenly, a Brooklyn bakery known for its vegan chocolate chip cookies and blackout cake, Bill Clark left with the dream of opening a Brooklyn bar, while Libby Willis started a catering company. The duo began hosting dinner parties in Brooklyn, which eventually became the model for MeMe’s, their first restaurant together. Beyond serving playful dishes like brunch-time migas served in a sliced-open Fritos bag, the diner was created as a beacon of queer hospitality. Guests would be treated like friends or acquaintances dining in the founders’ homes, and staff would be treated with the same respect Willis, Clark, and countless other out LGBTQ+ restaurant workers deserve.Willis and Clark.\nNoah Fecks“The hospitality industry is hard, but it doesn’t necessarily have to be. We want to come to work and be happy,” Clark says. He and Willis, a third-generation restaurateur (all her relatives told her not to do it), opened the door to MeMe’s in late 2017 with no advertising or formal PR—just the “gay whisper network.” Tables and barstools remain packed throughout dinner each night and especially during brunch on weekends. MeMe’s has already lapped up acclaim and media attention that countless larger, more established and hyped-up New York restaurants only hope for. In an era of dwindling LGBTQ+ spaces, MeMe’s champions queerness in an inclusive, progressive, practical way, infusing equality in every aspect of the restaurant’s operations.In some ways, the strategy is formulaic. MeMe’s menu offers tasteful, unpretentious food in a gentrifying neighborhood (Prospect Heights). The dining room, with its tufted brown-leather banquettes (crafted by Willis’ Hudson Valley–dwelling brother), artsy oil portraits of strangers (painted by Willis’ grandfather and rescued from his barn), and unfinished-wood shelves displaying Mastering the Art of French Cooking, evokes the seemingly effortless blend of “chill” that every restaurant is chasing in 2018. At its core, MeMe’s, named after Clark’s grandmother, is what a restaurant opening in today’s Brooklyn looks like, but at its heart, it’s a proudly queer space. “We’re not just a queer space [or] an exclusively gay space—we’re a space for everybody, [run] by gays,” Clark says.Queerness is organically infused into every element of MeMe’s hospitality, from the gender-neutral greeting (think: “Welcome, folks” rather than “Hey, ladies”) when diners walk in, to not questioning someone’s gender identity when it comes to a credit card or ID that may not match their appearance, to Willis’ zero tolerance policy for deprecating language in the kitchen. On a recent evening, the restaurant quickly filled up with LGBTQ+ couples and families, along with a handful of straight-presenting couples; several groups of friends crowded in the doorway in hopes of getting a seat. In the small bubble of NYC’s queer social circle, it felt to me that there was a high likelihood someone you knew would walk in the door at any time.“When we talk about queer hospitality, this is less about making a traditional gay bar or a space for gay people,” Clark says, “but we’re creating a very welcoming, easy, and desirable place for queer people to work in. When your staff is comfortable and not worried about not being able to be themselves or express who they are as people, that translates directly to your hospitality.”The peanut butter pie at Meme’s.\nPhoto by Noah FecksWillis and Clark operate off an inherent sense of how they’d want to be treated at work, knowing that tolerance for inappropriate behavior often trickles from the top down. “As a femme-presenting female, male coworkers and owners saw me as a sexual object first,” Willis says of her prior experience. “And then when they found out I was queer, they would suggest I just hadn’t met the right man yet and that if they had it their way I would absolutely be straight. Working in an environment where you have to constantly out yourself and shut down sexual harassment is exhausting.”Meanwhile Clark felt the “culture of competitive masculinity” ingrained in professional kitchens and feared appearing “soft or weak at work,” especially since he focused on pastry rather than on the more-masculine-deemed grill station. All potential MeMe’s employees are informed that the company culture is rooted in queer inclusion and compassion. “If people seem to not get it right away and don’t understand why it is so important in the interview process, they are probably not right for this restaurant,” Willis says.Willis doesn’t prioritize hiring women or LGBTQ+ people, necessarily, though her original team was built through a network of friends and supplemented by workers from GOSO (Getting Out and Staying Out), a program that helps formerly incarcerated men transition back into life in New York.The goal is that the restaurant becomes a neighborhood staple, “where you can pop in a couple nights a week, get a plate of meatloaf and some greens or a big supper salad,” Clark says. And so far, it is. “It’s really shocking how quickly we had regulars.” The storefront that houses MeMe’s stood empty for more than two decades, and the fact that a proudly LGBTQ+ partnership and business model infused a new, nonstop energy into the space shouldn’t be overlooked. The restaurant business is undeniably tough, and New York restaurants, as most businesses do, rely on straight people to stay in business. Despite the massive progress LGBTQ+ people have achieved in recent years, latent and blatant discrimination is still prevalent. MeMe’s has to face all of that as well as the lingering stigma that a gay space is for gay people only.To bring the LGBTQ+ food community closer together, the second Monday of every month MeMe’s hosts a “Family Meal” (only drinks and the bar’s signature complimentary cheese puffs are served) to which LGBTQ+ people working in the food and restaurant industry are invited to network and mingle in the otherwise closed restaurant until 2 a.m. Ideally, the values that launched MeMe’s business will trickle out to restaurant workers across the city.“It’s a space for everyone who understands what you’re going through, like-minded people,” Willis says. “The best way to change is through community. Maybe someone will pay attention and go back to where they’re working and say, ‘Hey, I know that other people do this differently. Can we try to be different?’ The best way to do that is to be an example, so that’s what we’re trying to be.”Related: Let Hamburger Mary’s Take Over the WorldExplore Bon AppétitBrooklynRestaurants + TravelNew YorkRead Moreculture'Battle of the Sexes' Star Natalie Morales Is Queer, Vegetarian, Cuban, and ProudBy Alyse WhitneycultureHamburger Mary's: The Drag Queen Burger Joint That's Planning World DominationBy Melissa KravitzPhotography by Amy LombardcultureA History of Meatloaf, Long May It ReignBy Frank Bruni and Jennifer SteinhauerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-09", "author": ["Condé Nast", "Melissa Kravitz"]}