{"id": "88c85f3638e816ee18c3714cd0d8c2ed", "url": "https://www.bonappetit.com/recipe/short-rib-and-daikon-soup", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Five-Spice Short Rib and Daikon Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFive-Spice Short Rib and Daikon SoupBy Jessie YuChenFebruary 17, 20224.4(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintBeef and daikon are a classic pairing in Asian soups. Daikon brings a pleasant sweetness to the broth—it’s so juicy and soft when done right—while beef contributes richness and depth. To make this soup, you’ll start with bone-in short ribs, separating the meat from the bones and browning both with aromatics to build deep caramelized flavor. Then you’ll deglaze the pot with rice wine and cook everything down with added spices. The end result is a comforting soup brimming with cubes of fall-apart beef and super tender daikon that will get you through the last leg of winter. —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonLadle$8 At AmazonTongs$13 At AmazonIngredients4–6 servings2lb. English-style bone-in beef short ribs2Tbsp. vegetable oil12\" piece ginger, scrubbed, thinly sliced2garlic cloves, smashed1medium onion, thinly sliced1bunch scallions, trimmed, halved crosswise1large daikon (about 1 lb.), peeled, cut into ½\" pieces2bay leaves1cup michiu or dry sake2Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt, plus more2tsp. five-spice powder2tsp. (or more) ground white pepper1tsp. MSG1bunch cilantro, leaves with tender stems picked, coarsely choppedToasted sesame oil (for serving)PreparationStep 1Pat dry 2 lb. bone-in beef short ribs. Separate meat from bones and cut into ½\" pieces; set bones aside.Step 2Heat 2 Tbsp. vegetable oil in a large Dutch oven or other heavy pot over medium-high. Cook one 2\" piece ginger, scrubbed, thinly sliced, and 2 garlic cloves, smashed, stirring often, until golden, about 4 minutes. Push ginger and garlic to one side of pot and add short rib meat and reserved bones. Cook, turning occasionally, until meat and bones are lightly browned, 5–7 minutes. Stir in 1 medium onion, thinly sliced, and 1 bunch scallions, trimmed, halved crosswise, and cook until heated through, about 2 minutes.Step 3Add 1 large daikon (about 1 lb.), peeled, cut into ½\" pieces, 2 bay leaves, 1 cup michiu or dry sake, 2 Tbsp. Diamond Crystal or 1 Tbsp. plus ½ tsp. Morton kosher salt, 2 tsp. five-spice powder, 2 tsp. ground white pepper, 1 tsp. MSG, and 8 cups water. Stir to combine and bring to a boil. Reduce heat to a simmer, cover pot, and cook until beef and daikon are tender and flavors have melded, 40–50 minutes. Skim fat from soup; remove and discard bay leaves, scallions, and bones (if desired). Taste and add more salt and/or white pepper if needed.Step 4Ladle soup into bowls. Top with 1 bunch cilantro, leaves with tender stems picked, coarsely chopped, and drizzle with toasted sesame oil.How would you rate Five-Spice Short Rib and Daikon Soup?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis was ok, but I won't be adding it to the rotation. I much prefer phở. soy23stolen Catawba land3/19/2022It turns out very delicious! I made a mistake buying flanken style beef short ribs and I don't have MSG so I use 1 tbsp of beef base Better than Bouillon instead. I crank up the heat a bit with more white pepper and dash of pepper flakes. Maybe next time I'll add two or three Thai chili when cooking the onion to add some kick.PatarSeattle, WA2/28/2022An easy super flavorful weeknight stew, reminiscent of ‘Pho’. If you want to make it heartier, serve over kelp, shirataki, or rice noodles. So delicious! Laura M. Santa Fe2/25/2022Explore Bon AppétitSoupSoups and StewsBeefMeatShort RibRadishVegetableDaikonNut-FreeGluten-FreeDinnerMainOne-Pot MealsAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-17", "author": ["Condé Nast", "Jessie Yuchen"]}