{"id": "88dfafddf3c7e3c0f3bd2b78d8093b72", "url": "https://www.bonappetit.com/story/these-restaurants-define-new-york-for-me", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "These Restaurants Define New York for Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Restaurants Define New York for MeRestaurant recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroJuly 11, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I didn’t expect to be so in love with the NYC 100, our highly subjective, hardly exhaustive, extremely opinionated guide to New York City’s food scene. Aside from writing up a few of my favorite spots, I didn’t have much of a hand in bringing it to life. (That credit goes to associate editor Alex Delany and bonappétit.com editor Sasha Levine.) So when I scrolled through the finished product, reading each tiny, specific endorsement for the first time, I was flooded with memories: of a certain dish, of the people I ate with, of days and nights and very late nights spent in the city I love.I remembered myself as a twentysomething at Lovers Rock (#73), arguably Bed Stuy’s loudest bar, downing rum punches and dancing with strangers. I remembered biking all the way down to Tanoreen (#52), the temple to Middle Eastern food in Bay Ridge, on my birthday with someone I loved. A bad first date at Chilo’s (#80) but at least the huitlacoche tacos were amazing. I’ve trekked through a winter storm for the pancakes at Tom’s (#7). I’ve corralled groups of friends to wait for a table at Win Son (#51), where the Lazy Susans spin with platters of new-Taiwanese specialties. (Like Emily Schultz, I dream about their fried eggplant on the regular.) I’m never more happily tipsy than when I’m at tiny Bushwick pizza joint Ops (#56), where I couldn’t tell you what natural wine I’m drinking but I’m always thrilled to be drinking it.I swoon for the rosewater-scented, pistachio-topped knafeh at Tanoreen.\nAlex LauSpeaking of natural wine, I wrote about Simple Syrup (#96), the tiny, hyper-curated wine shop in Crown Heights where I make an almost-weekly pilgrimage for whatever new bottle they’ve put on the shelf. And speaking of pizza, is there any place that defines Bon Appétit staffers’ taste more than Scarr’s (#34), the low-key, Lower East Side slice joint that just happens to mill the grains for its naturally leavened dough in the basement? You could go to Saraghina (#86) in Bed Stuy for pizza too, but recently I’ve found myself there in the mornings, buying sea-salt-and-olive-oil granola, loaves of whole-wheat miche, and fancier coffee beans than I care to admit at the adjacent bakery.Even fancier coffee exists at Sey (#84). If I happen to be in Bushwick in the morning, the sunlit, plant-filled space is as reviving as the oat milk latte. Also reviving: The Food Sermon (#41), the Caribbean counter-service/takeout joint I order from when navigating the Seamless app takes about all the energy I’ve got.I could go on. (How many Hola Yola cocktails have I drank at Honey’s (#64)? How many times have I convinced the servers at Ugly Baby (#43) that I can handle the “stay-away” duck salad? How do you drink the shochu cocktail at Bar Goto (#62), the one that comes in a wooden box?) The point is, the NYC 100 is a scrapbook of my and many of my colleagues’ New York lives. It’s proof that you can get a good meal anywhere in this city, but the places we go back to (and back to and back to) are memorable for so much more than the food.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterNew York CityessayRead MorerestaurantsThe NYC100 - March 2020 EditionBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-11", "author": ["Condé Nast", "Amanda Shapiro"]}