{"id": "88eb14fcad00939ce0e278841486b055", "url": "https://www.bonappetit.com/story/peanut-butter-powder", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Peanut Butter Powder Sounds Weird But Is Secretly Great for Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestylePeanut Butter Powder Sounds Weird But Is Secretly Great for CookingStay with me.By Gabrielle CampagnanoJune 11, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI credit a fitfluencer for first introducing me to the good stuff.  It was an extra-warm August day, and she was making a sweet potato peanut butter smoothie on camera. Except she wasn’t using regular peanut butter. She was spooning in what looked like tiny ant hills of fawn-colored dust. She said it tasted just like peanut butter, and claimed it to have a third fewer calories and 90% less fat per serving. Translation: I could eat a lot of it.Look, I have a reputation for getting down with nut butters. I once consumed a third of a 32 oz. jar of a luxuriously smooth roasted almond varietal...with my fingers...in one sitting. I’m also a Crossfitter, a wellness enthusiast (whatever that means — manhandling monounsaturated fat is not a surefire path to health, but it’s about the journey, right??), and recipe developer interested in the intersection of nourishment and pleasure. I needed to get my hands on some peanut butter powder, ASAP.But first, I Googled. I had recently sworn off all artificial sweeteners and was working to overhaul my makeup bag to only contain “safer skincare” items. I wondered if this was something that fell in line with my more health-conscious approach. If I ate it and loved it, would I automatically be added to a Doomsday Preppers listserv? Worse, would it make me want to turn my back on my beloved fatty jars?Powdered peanut butter, ready to be used.\nHere’s the 411: In order to make the powder, you must de-fat the peanut. This essentially means that after being roasted, mass amounts of peanuts get pressed to remove the majority of their oil and fat. From there, the once fully-fatty peanuts are ground into a very fine powder. So, yes, a bit of an unnatural process, but not enough to make me denounce it to the level of a Frankenfood and run the other way.My First Time involved a tablespoon and my mouth. During this experience I learned two things. 1) If you want to eat peanut butter powder on its own, you have to hold your breath. I’m serious. It was my first case of Peanut Lung. 2) Peanut butter powder is the ingredient you didn’t know you needed. You know that episode of Made where the girl wants to become homecoming queen and makes her dress out of duct tape? No? I’m the only MTV superfan here? Well, peanut butter powder is that duct tape. A pleasantly-granular, kinda-fleecy, metallic-but-not-in-a-bad-way, FULL PEANUT BLAST wonder ingredient.While the general prescription is to mix four parts powder with one part water to create a peanut butter \"substitute,\" a 1-to-1 replacement it is not. And while people like my fitfluencer friend-I’ll-never-meet mix it directly into smoothies or stir the powder into their overnight oats for a flavor boost, that’s really base-level usage.A 50/50 ratio of powder to full-fat plain yogurt creates a wonderfully-creamy spread that’s perfect for toast or using as a substitute for that weird whipped cream cheese dip that comes in the middle of supermarket fruit platters. The same ratio, but with the addition of a splash of Coconut La Croix (trust me) results in a fluffy, fizzy, mousse-like substance that’s fun to snack on (or shape onto a coconut pie crust). Peanut butter powder + sriracha + lime juice + olive oil + honey = an incredible Thai-inspired dipping sauce or marinade. A dream frozen mudslide-esque cocktail can be created in a blender with a frozen banana + a creamy milk substance of your choice + vodka + cacao and peanut butter powders. That braised chicken you’ve been tending to for hours still need something? Stir some peanut butter powder into the braising liquid, then finish it with lemon juice. Do you see the possibilities opening up before you??Sadly, despite its extreme adaptability, I don’t think peanut butter powder is the next frontier of the wellness world. Once the fat is extracted from the peanut, so too goes the vitamin E, folate, and iron. In this ever-expanding realm of superfoods and adaptogens and bio-hacking, however, I’m looking for an ingredient that can serve at the intersection of my personal nourishment and pleasure. Peanut butter powder, my can-do-anything pantry staple, hits it every time.Buy powdered peanut butter, $4All products featured on Bonappetit.com and Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitHealthyishPeanut ButterPeanutTrendsRead MoreLifestyleThe Nut Butter Company Helping Formerly Homeless and Trafficked Women Build New CareersBy Hannah WallaceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-11", "author": ["Condé Nast", "Gabrielle Campagnano"]}