{"id": "88f7ee66be88428fd08794cd1ca6d578", "url": "https://www.bonappetit.com/story/chubby-fish-charleston", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "I Didn’t Think a Charleston Seafood Spot Could Surprise Me, Until I Went to Chubby Fish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIn a City Full of Seafood Spots, This One Manages to Stand ApartGo to Charleston’s Chubby Fish for the kitschy-fun caviar service. Stay for the perfectly grilled b-liner snapper.By Hilary CadiganApril 2, 2019FacebookTwitterEmailPhoto by Mira AdwellFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Despite living in New York, I spend a lot of time in Charleston. It’s where my fiancé hails from, where my future in-laws live, and where I’ll be getting married in T-minus 25 days (no, not freaking out at all, thanks for asking). This means I spend a lot of time eating in Charleston and what that means is an endless array of trendy new seafood spots.Don’t get me wrong: They’re all good (it’s hard to mess up fresh-caught seafood when you’re surrounded by water) but they do tend to blend together. Which is why I was surprised by how much newcomer Chubby Fish surprised me.Chef James London’s dishes change often—a smoky and well-balanced mackerel curry, a grilled b-liner snapper doused in fresh ginger and scallions—but maintain a consistent degree of playfulness that could come off as hokey if it weren’t so well-executed. We’re talking crunchy-meaty chicken-fried cobia collar, caviar service with “bo rounds” (fried potato medallions in the style of beloved Southern fast-food institution Bojangles), and local sweets peddler Cynthia Wong’s “not fried chicken” (a drumstick-shaped chunk of waffle-flavored ice cream wrapped around a chocolate-covered Cadbury finger biscuit “bone” and dusted in crushed cornflakes ). Standbys like Nicaraguan beer and housemade plum mignonette for the perfectly-shucked oysters complete the experience: fun, unexpected, yet approachable enough not to scare off the aforementioned in-laws.Go there: Chubby FishExplore Bon AppétitHighly RecommendCharlestonSeafoodRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Hilary Cadigan"]}