{"id": "88fb92afbc5387a9f8aa6563fdc129c8", "url": "https://www.bonappetit.com/recipe/greens-and-beans-sandwiches", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Greens-and-Beans Sandwiches Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueGreens-and-Beans SandwichesBy Kat BoytsovaFebruary 12, 20194.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintYes, you should bring your lunch to work because the plastic clamshell holding your Santa Fe salad will still be on this planet when your great-great-grandchild is born. But also, it’s probably healthier, tastier, and cheaper than your to-go default. Sassed-up canned beans become a creamy layer in this vegetarian sandwich, while thick-cut feta provides something to sink your teeth into. Ingredients2 servings 115-oz. can cannellini (white kidney) beans, rinsed2Tbsp. Sesame-Scallion Sauce1Tbsp. fresh lemon juice (from reserved ½ lemon)Kosher saltLeftover fennel stems and fronds from Big Batch Chicken Thighs4slices dark rye bread, toasted5oz. French feta, sliced into thick planks1cup Chile-Garlic CucumbersPreparationStep 1Mash beans, sauce, and lemon juice in a medium bowl until combined and mostly smooth; season with salt. Thinly slice about ⅓ cup fennel stems and tear fronds to measure ¼ cup.Step 2Divide mixture between 2 slices of bread. Layer feta over and top with cucumbers. Scatter fennel stems and fronds over. Close up sandwiches with remaining slices of bread.How would you rate Greens-and-Beans Sandwiches?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThe block feta, cucumbers, and smashed beans equal sandwich magic, however the scallion sesame sauce was much too sweet for my taste. The 1 tbsp honey in the sauce totally overpowered the entire mixture and the lemon juice in the beans wasn't enough to tart out the sweetness. I would make it again but with a different BA green goddess sauce instead of the sesame one. CarolinepartyrockIndiana6/1/2020Let me say first that I am not a vegetarian but I love vegetables. I made this sandwich, tossing in small chunks of avocado into the bean mixture. What a beautiful sandwich! The next morning, I made a \"breakfast\" sandwich adding cooked egg white and thinly sliced tomato to the sandwich. Wow! Thank you Bon Appetit!mamawscookinNorth Carolina3/3/2019Explore Bon AppétitSandwichCannellini BeanWhite BeanBeanVegetableFetaCheeseHealthyishLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}