{"id": "88fcebd128c02b6e1248b793c34b892a", "url": "https://www.bonappetit.com/story/picnic-etiquette", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Picnic Etiquette for Dining Outdoors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay…to Bring a Single Serving to a Picnic?Solicited advice for outdoor dining from indoor person Alex Beggs.By Alex BeggsAugust 17, 2020FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.My spouse is FREAKED OUT about mayo sitting in the sun, but I’m not. Do I have to leave the egg salad at home? —Curdled CarlDid you know that mayo has vinegar in it that actually PREVENTS microbial growth from happening? So it’s not the mayo you should fear but the egg, tuna, or chicken you’ve got bathing in it. The Department of Agriculture gives you a two-hour time limit on leaving those out of the fridge, but a few of us at BA have been known to extend that, shh.Illustration by Cari Vander YachtWhat is the best way to camouflage booze when you technically shouldn’t have it in the park? —Incognito IvyThe capital-B best way? Paint the wine bottle with Elmer’s rubber cement and then carefully apply sticks and leaves until it blends in with the landscape. Don’t have an artist’s eye? I pour (non-sparkling) wine or prebatched Negronis into a Corkcicle canteen, which keeps it cold for hours.I picked a nice shaded isolated spot to picnic with my family by a lake, but another group showed up and sat waaay too close to us. Now what?! —Socially Distant SanjayOooooh the shady spot by the LAKE. I can see why you don’t want to gather your blanket and move along. Time for what I call Gentle Confrontation. Kindly address your intruders, “Hi there! I’m so sorry to bother you, but we’re still a bit spooked about germs given that whole thing. I don’t mean to be rude, but would it be possible to shift your blanket a few yards to the right?” Keep your tone warm and a little desperate. If they get hostile, move over yourself—no huffing!—and double down on having a good time.Illustration by Cari Vander YachtWe adhere to a strict picnic rule: no disposable products. Can we ask our friends to do the same when we picnic together, or should we supply these items for them? —Optimistic OpalYou’re doing a good thing, keep doing that. I’d bring silverware for everyone to avoid the whole kerfuffle. Because this is the kind of tiny issue that snowballs the more time you dwell on it. If you’re sitting and stewing over a friend’s plastic spork, grudging and judging, you’re misplacing your outrage. Direct that at the larger forces to blame for earth-ruining out there, like ExxonMobil. Enjoy this time with the people who make you happy; the cutlery isn’t going to help you clean out a flooded basement or dispose of a body. You know, the stuff real friends do.Illustration by Cari Vander YachtHow do you keep all the random dogs people brought from eating the food? —More-of-a-Cat-Person MinSeeing a soft-eared canine running off with my perfectly charred Ball Park Frank is just the trigger to unravel a month’s worth of self-help podcasts. But as with toddlers and Labatt-drunk boyfriends, you can’t tell a person how to control their creature. You can pull this line out, though: “Oh hey, Stefani? Is there a command or something I can say to keep Captain Peppercorn from stealing the franks?” Maybe she’ll step in to do something. Maybe.I’ve gotten caught bringing something to a picnic and then eating it all myself. So now I just bring two vegetarian calzones or whatever so I can share one and still have one for myself (I’m an only child, shut up). Is that acceptable? —Single-Serving SylviaI’m a middle child, YOU shut up! I cherish my friends’ weirdo tendencies, but you can’t keep something for yourself and then turn around and smash on my Fritos Scoops. A picnic is inherently a sharing event, unless you have a food allergy or it’s the midst of a global pandemic, in which case, NO SHARING. But in normal times, bring something that everyone can easily enjoy (is the calzone sliced? I have so many questions). How about a pitcher of sweet tea. Or a bucket of sour cream and onion dip. Personal growth comes in many forms. Dip is one of the best.Illustration by Cari Vander YachtWhat are the best Bon Appétit recipes to bring to a picnic? —Subscribin’ ShermanBasically’s Big Ass Beach HoagieNo-Brainer Corn SaladSpicy Kimchi SlawBroccoli Salad With Peanut DressingCaramelized Shallot DipMasala Fried ChickenJammy Pepper Pasta SaladSalad RamenA mini tin of Maldon saltExplore Bon AppétitEtiquetteIs It Ever OkayPicnicSummerRead MoreLifestyleThe Chicken Salad I’m Eating on My Porch All SummerBy Christina ChaeycookingYour Summer Needs More Cottage CheeseBy Amiel StanekcookingThe Pasta Salad That Won’t Get Weird at the PicnicBy Alex BeggscookingBet You Can’t Eat Just One Slice of This Strawberry Snacking CakeBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-17", "author": ["Condé Nast", "Alex Beggs"]}