{"id": "88fe17683345017794a2b3cf0edf0c20", "url": "https://www.bonappetit.com/story/important-get-recipes-right", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Why It’s So Important to Get Recipes Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy It’s So Important to Get Recipes RightOn taking pride in food and community.By Sonia ChopraDecember 18, 2020FacebookTwitterEmailFacebookTwitterEmailEvery week, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.On BA earlier this month, we published a pumpkin soup recipe from a cookbook. For the cookbook author, the soup was an expression of a historic Haitian dish, soup joumou, which is eaten every year in Haiti and the diaspora on January 1, the day in 1804 enslaved people gained independence. The cookbook’s soup recipe departed from important, foundational versions of soup joumou, and when we ran the recipe on Bon Appétit, we failed to provide enough context about either recipe, and BA’s recipe name and headnote did not accurately represent the recipe we ran. Along with my team, I’ve been working to understand the mistakes we made and how we can learn and improve. I have also been speaking with people in the Haitian culinary community, including L’union Suite CEO Wanda Tima and Haitian Culinary Alliance founder Stephan Berrouet Durand.Tima created L’union Suite when she was looking for ways to connect with “Haitian hyphens” like herself, and says her platform focuses on “the best of the best of our history and our country, what’s going on in and outside the community, and, most important, education.” Chef Durand first started Gout et Saveurs Lakay, a food and spirits festival in Haiti, and then launched the Haitian Culinary Alliance, which aims to promote Haitian cuisine across the globe. They graciously took the time to speak with me for this interview, in which we talk about Haitian food, the importance of both preserving and changing recipes, and more.There is a lot of nuance to the idea of “adapting” dishes. How can people make sure they are understanding and respecting the traditions or the foods while cooking with the ingredients they have on hand?Stephan Berrouet Durand: I think a perfect example is the French bouillabaisse. Bouillabaisse is from a very specific region in France. You can’t make bouillabaisse any other way than the way they make it there. They’ll tell you it’s not bouillabaisse. Now, obviously, you can adapt certain ingredients to where you come from, but the essence of the dish has to be the same if you’re going to call it that. Otherwise don’t call it bouillabaisse. Call it something else. That’s being respectful of tradition.Even if I’m doing a variation of soup joumou or I’m using a different protein, the essence stays the same. The preparation of the dish stays the same. I’m not deviating or completely changing the dish. So even if I’m using another protein, like seafood, I keep it the essence the same. And the flavor has to be the same. To the moment you put the spoon in your mouth, you know it’s soup joumou. And that’s important.Wanda Tima: Another thing that people don’t even realize is that there are regional differences among Haitian cuisine. [There are foods Haiti is “known for”] but certain places in Haiti are known specifically for certain dishes, and there are some dishes people might not eat if they’re not from that area. Or there’s a different recipe, depending on where you’re from. Chef Nadege Fleurimond’s books helped me understand a lot about the culinary side of Haiti and that a lot of these dishes come from different places in Haiti.When is it okay to change recipes—or I guess, specifically, who should be able to change them?WT: We see people take the traditional recipes and change them every year. Like Chef said, we’ve had people do the soup joumou with seafood only, or a vegan version of it. We’ve seen people do it with salmon.People don’t take away from the recipe, but they will add these other things. And we know, it’s home, it’s family. We understand that’s happening and we create conversation around it. We ask our communities: Is this okay? Are we okay with this? And the comments are always 50-50. Some people are like, yes, we can remix it a little. And others say no, you do not mess with the recipe.The Haitian community has this saying: What happens at home, stays at home. The streets do not need to know our business. But inside the Haitian community, they’ll talk. If I want to go viral for a week, I know I should do something with food, and I will go viral that week. I know it. It never fails. Haitians are so proud of our food.Wanda, you told me that every year around this time, at the start of the holidays, you start to hear from food writers. Is that a good thing or a bad thing?WT: We know around soup joumou time, there’s going to be a lot of stories. A lot of publications want to write about it, or they’re going to create their own. Every year you see the interest growing and growing more about this dish and the history that’s tied behind it. And a lot of different chefs and people have an opportunity to tell that story. So we’re happy. We’re excited that’s happening, but we want to make sure it’s done right. We want to make sure they’re reaching back home and tapping in Haitian chefs and speaking to Haitian chefs.We’re happy now that we are getting attention from other areas in the world, and that it isn’t just about politics or charity or giving back. We’re happy that they have an interest in who we are now. But if you want to know who we are, we’re happy that you’re interested in us now on this level, but you have to come home.That’s why you started L’union Suite—to highlight stories about the community from the community?WT: If you want to tell our story, you have to understand the core of it. You have to go to the people. I started L’union Suite to find myself. I wasn’t raised in the culture, and it was a journey for self-discovery, to connect with my people and find out as much as I could about this country me and my family are from. One of the biggest reasons why we are not connected is because we don’t know, we’re not educated enough. We don’t know our own history. We don’t know our contributions to the world. We grow up hearing so much of what people don’t like, or whatever narrative the news is telling us about Haiti. And now we’re invested in telling our story. We’re invested in making sure that our narrative is clear about who we are.How does fighting negative stereotypes play a role in that?WT: Who we are is just as important as everyone else. We are so used to people not paying attention to us, or if they do pay attention to us, it’s for their own benefit or spreading false narratives of who we are.I mean, our current president started his term in office talking bad about us, and bringing up all these false stereotypes. And we spent four years trying to fight some of these stereotypes that our ancestors fought to get away from.SBD: It is absolutely important because we carry this pride of being the first Black republic in the Western hemisphere. But we also carry the stigmas that all through the years have been put upon Haitian people. We’re the one who created AIDS. We’re the “shithole” country. Never been a conversation when they talk about Haiti, where they don’t say it’s the poorest country in the Western hemisphere. All of these things, they weigh on us.Is there anything else you want people to be thinking about?WT: For us as a community, this is brand-new. Seeing different chefs written about and on TV shows—all of them are still trying to get their spotlight. [If it’s a competition show], we don’t care if they win or lose—we’re happy they were on the show. We’re already excited.And if someone wins, forget it. They’re one of our treasures. So it’s not time for “homages”—we don’t even have that much to begin with. That’s a reason why we’re protective of it. We’re still building it. We’re still growing it. We can’t afford to let anyone take away from it, because we’re still building it ourselves.SBD: If you’re going to give homage to something, do it right. Make sure that you in some place give recognition to who and where you took inspiration from. The story of our revolution itself is such an amazing story. This soup becomes more than a celebration—it becomes almost part of our DNA.This interview has been edited and condensed for clarity.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-19", "author": ["Condé Nast", "Sonia Chopra"]}