{"id": "8904640089f421cce1a1100af50a82af", "url": "https://www.bonappetit.com/story/shingled-sweet-potatoes", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Why Casserole Your Sweet Potatoes When You Can Shingle Them? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy Casserole Your Sweet Potatoes When You Can Shingle Them?Further proof that Thanksgiving sweet potatoes belong in camp savory.By Carey PolisNovember 17, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailThe most divisive food decision at Thanksgiving isn’t white meat or dark meat, pecan or pumpkin, stuffing inside or outside the bird. It’s if your guests are Team Sweet Potato With That Marshmallow Topping Situation or well, not.Here’s a couple things we should hopefully all agree on:Sweet potatoes can skew sweet or savory.When you put marshmallows on them, they are a dessert.If you want to serve them as a side dish with the main course, consider a more savory approach.Enter, shingled sweet potatoes with harissa. Putting taste aside for a second, this is a superior sweet potato aesthetic—layered discs of sweet potatoes nestled close together to create the perfect messy-chic arrangement. It looks like something that takes a long time to put together, even though the mandoline really does most of the heavy lifting. You peel the potatoes, slice on the mandoline, and then stack ‘em like coins on their side in concentric circles.This particular recipe leans a bit spicy thanks to a mixture of harissa, olive oil, and white wine vinegar. And, the dukkah (a mixture of pistachios, sesame seeds, and fennel seeds) add a nice crunch. It’s simple, it’s flavorful, it works.But, if you’re really feeling the Thanksgiving spirit, you could use this as a (very good, rigorously tested) template more than a must-follow. As in, shingle your sweet potatoes with whatever fat you like, plus any spice combination your heart desires—just make sure there’s enough oil to keep the potatoes from drying out in the oven. And, as the recipe instructs, check on them every 15 minutes to brush any accumulated oil in dish back onto the sweet potatoes.When it all comes out looking toasty and impressive, you’ll forget there was ever any other way to cook them. And your guests? Well, they won’t even miss the marshmallows. Sorry, marshmallows.Get the recipe:Shingled Sweet Potatoes with HarissaThe classic savory-sweet side gets a makeover with the addition of harissa for an extra hint of spicy-earthiness. We promise you won’t miss the marshmallows.View RecipeExplore Bon AppétitSweet PotatoThanksgivingHarissaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-17", "author": ["Condé Nast", "Carey Polis"]}