{"id": "891727de010d6c209ead9be36b26c462", "url": "https://www.bonappetit.com/story/vietnamese-egg-coffee", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "How to Make Vietnamese Egg Coffee With Whipped Egg Yolks and Sweetened Condensed Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make Vietnamese Egg Coffee When I Want Caffeine and Dessert at the Same TimeTopped with egg yolks whipped with sweetened condensed milk, it tastes almost like coffee meringue.By Dzung LewisSeptember 23, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When we were younger, my parents would often take the family out for pho on the weekends in San Jose. Before the soupy noodles arrived at our table, we always had a moment to watch the other diners. As my parents talked, my older sister Tram and I would scout for the people ordering something a little different: Vietnamese egg coffee.It’s similar to regular Vietnamese coffee, which has a layer of sweetened condensed milk at the bottom, but instead it’s topped with a mixture of whipped egg yolks and sweetened condensed milk, which winds up tasting almost like meringue. I fondly describe it as something close to tiramisu in a cup. The rich, soft topping creates a fascinating beverage that triggers my nostalgia for our family’s weekend pho trips.According to Atlas Obscura, the drink originated in Hanoi in 1946, when the First Indochina War caused a milk shortage in the city. A resourceful bartender at the Sofitel Legend Metropole Hotel named Nguyen Van Giang used some whisked egg as a substitute, and the result was a success. The coffee shop he opened in the city, called Café Giang, still serves their famous version, but the drink has spread across the country, where people enjoy it in cafés at all hours of the day.Vietnamese egg coffee is a popular café specialty in Vietnam, but when I was developing recipes for The Honeysuckle Cookbook, I learned that it’s not so hard to make in a home kitchen. It starts, of course, with Vietnamese coffee, which has a very distinct taste that’s strong and slightly bitter. Sweetened condensed milk is typically paired with the coffee to create a perfectly balanced bittersweet flavor. You’ll want to source Vietnamese coffee—look for a ground coffee variety by Trung Nguyên or Café du Monde, available in many Asian grocery stores. (Café du Monde is not Vietnamese coffee, but it’s often used to make Vietnamese coffee because the chicory provides a strong and robust flavor even when paired with condensed milk.) If you can’t find those, substitute strong French roast coffee beans in a coarse grind. To brew it, you need a Vietnamese phin, a small cylindrical metal coffee filter.Start by placing the filter on top of a mug or glass. Add 3 Tbsp. ground Vietnamese coffee into the filter and press it down with the removable tamp (if you’re using a screw-on type, twist just until there’s a slight resistance). Add 1 tablespoon boiling water and let the coffee grounds bloom, about 1 minute. Continue to pour boiling water into the filter about three-quarters of the way up and let it drip. You’ll use 4 to 6 Tbsp. water total, depending on how strong you like your coffee. Place the lid cover on the filter and let the coffee slowly drip for 3 to 5 minutes. Flip the lid cover and use it as a trivet for the filter. Remove the filter from the mug. (Alternatively, you can also make two shots of espresso.)Meanwhile, in a small bowl, with a hand mixer, whip 2 large fresh organic egg yolks on medium speed until frothy and pale yellow, about 30 seconds. (You can also whisk by hand for 2 to 3 minutes until the eggs are a shade lighter in color than when you started.) Add 1 tablespoon sweetened condensed milk and ½ tsp. vanilla extract and mix again until just combined. (Transfer the leftover sweetened condensed milk to a glass jar, seal it, and then keep it in the fridge, where it will last for 2 weeks.)Gently pour the egg mixture over the brewed coffee (it will float on top), and dust with unsweetened cocoa powder. Drink immediately. Then contemplate making another.Dzung Lewis is the recipe developer and video host behind The Honeysuckle Kitchen. This recipe is from her first cookbook, The Honeysuckle Cookbook: 100 Healthy, Feel-Good Recipes to Live Deliciously.Explore Bon AppétitIt's That SimpleCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-23", "author": ["Condé Nast", "Dzung Lewis"]}