{"id": "891b1966160b15727f843103d6643906", "url": "https://www.bonappetit.com/recipe/cucumber-tomato-and-green-bean-salad", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Cucumber, Tomato, and Green Bean Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCucumber, Tomato, and Green Bean SaladBy Leela PunyaratabandhuJuly 6, 20214.4(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis refreshing summer side is a mash-up of two variations of the sour-salty-sweet Thai salad som tam: the most famous version made with shredded green papaya and another Thai favorite version made with cucumbers. This streamlined version skips the traditional process of pounding the ingredients in a clay mortar and wooden pestle; instead, you cut and chop the ingredients more thinly and finely, then use your hand to mix and squeeze them just until lightly wilted—the way this salad is supposed to be. Serve this as part of cookbook author Leela Punyaratabandhu’s summery menu for Grilled Pork Shoulder Steaks With Green Pepper Relish, Khao Niao (Thai Sticky Rice), Cantaloupe with Spicy Bacon-Cashew Crumble, Grilled Scallops With Peach Sweet Chili Sauce, and Lime-Lemongrass Slushies. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCutting Board$10 At IKEASerrated Knife$14.99 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonIngredients4 - 6 Servings1lb. Persian or English cucumbers, halved lengthwise, sliced on a steep diagonal ¼\" thick6oz. cherry or grape tomatoes, halved or quartered4oz. green beans, trimmed, sliced ona steep diagonal into ⅛\"-thick strips3large garlic cloves, finely chopped1Fresno chile, seeds removed, finely chopped¾cup unsalted roasted peanuts, divided3Tbsp. (or more) fresh lime juice1Tbsp. (or more) light brown sugar1Tbsp. (or more) fish sauce (such as Megachef, Squid, or Three Crabs)PreparationStep 1Combine cucumbers, tomatoes, green beans, garlic, and chile in a large bowl. Finely chop ½ cup peanuts to the size of lentils and add to bowl.Step 2Whisk lime juice, brown sugar, and fish sauce in a small bowl until sugar is dissolved.Step 3Pour dressing over vegetables and toss with your hands, gently squeezing as you go, until well coated and vegetables have wilted slightly, about 30 seconds. Taste salad and season with more lime juice, brown sugar, or fish sauce if needed. Salad should be equal parts sour and salty, with sweet close behind.Step 4Transfer salad to a platter. Coarsely chop remaining ¼ cup peanuts and scatter over salad.How would you rate Cucumber, Tomato, and Green Bean Salad?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was a very good salad with lots of umami and crunchy textures. A previous review mentioned an alternative to fish sauce. Soy sauce or Braggs Liquid Aminos would make a flavorful substitute both which are vegan.Chef KenBoquete, Panama10/12/2021A vegetarian  alternative to fish sauce would be appreciated, also dislike the taste of it! Any alternative?AnonymousAustin, TX8/25/2021This was so delicious! It definitely needed more fish sauce and lime. But I’ll definitely add it to the rotation. Had it with roasted chicken.  AnonymousOakland, CA8/18/2021Delicious and bright salad!!  I used jalapeño instead of freso...all the veg was in my CSA box this week.\nPeggyMinneapolis, MN8/17/2021Explore Bon AppétitSaladThaiSoutheast AsianAsianCucumberVegetableTomatoGreen BeanCherry TomatoGrape TomatoPeanutNutFresno ChileChileSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}