{"id": "8921c916af4790f4a47fa10511329cbb", "url": "https://www.bonappetit.com/story/el-ruso-los-angeles-taco", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "I Will Always Have Room for El Ruso’s Extremely Dialed-In Tacos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Will Always Have Room for El Ruso’s Extremely Dialed-In TacosThis little truck in Los Angeles makes the carne asada tacos of my dreams.By Elyse InamineFebruary 27, 2020FacebookTwitterEmailPhoto by Angelo AlmonteFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I had already eaten lunch by the time we pulled into El Ruso, a tiny taco truck nestled in a tiny parking lot in L.A.’s Boyle Heights neighborhood. Was I hungry? Not at all. Was I, perhaps, not in the best mood because just hours ago I had taken a 5 a.m. flight from New York City to Los Angeles? Ask my husband and my mom. These delicate situations—combined with me forcing them, just as stuffed and lethargic as I am, to eat a second lunch, hobbit style—seemed perfectly primed for a game of passive-aggressive complaining. (This is what conflict looks like for my family!) And that might have very well happened, if the tacos at El Ruso weren’t so incredible.It starts with the tortilla, a diaphanous round of vegetable shortening, water, salt, and Mexican flour. Julia Silva, El Ruso’s tortilla maestra, drives down to Mexicali for this specific flour, which she thinks is softer than the American variety, and flattens each tortilla by hand, the same way she’s always done for 40 years. The result is the perfect pliable, fat-laced vessel for chef Walter Soto’s fillings.Finessed over 17 years of making tacos—both professionally in his native Sinaloa and for fun at family gatherings once he moved to L.A.—Soto’s tacos hit all the right notes. He serves them costra style, throwing Monterrey cheese underneath Silva’s already perfect tortillas, and then griddles it, so the cheese fuses to the tortilla and becomes simultaneously scorched, crunchy, and melty. The ideal texture! The carne asada is simply seasoned (just sea salt) and expertly grilled to an actually juicy medium. On top, Soto spoons a ladleful of red beans, plump and velvety after simmering for hours with a little bit of chile and sea salt.The second I started spooning from the truck’s choose-your-condiment adventure—salsa roja, guacamole, cilantro-laced raw onions, pickled onions, and a few lime wedges—it didn’t matter how grumpy, full, and sleep-deprived I’d felt just minutes earlier. And the moment the tacos hit our plastic table, it was clear my mom and husband had forgotten, too. We ate in blissful silence, soaking up the L.A. sun and some dribbling meat juices. Second lunch at El Ruso truly does wonders.Go there: El RusoExplore Bon AppétitHighly RecommendRestaurantsLos AngelesRead MorerestaurantsI’m From Texas and This Is the Best Quesadilla I’ve Ever HadBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-27", "author": ["Condé Nast", "Elyse Inamine"]}