{"id": "892b603405674104dc37e291a584afb0", "url": "https://www.bonappetit.com/story/homemade-cake-mix-chocolate", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Make Homemade Cake Mix, Be Ready For Anything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Homemade Cake Mix, Be Ready For AnythingWhen you have a stash of this homemade cake mix on hand, a celebratory chocolate cake is just a whisk away.By Kat BoytsovaMay 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWhen you need to whip up a last-minute celebratory dessert, store-bought cake mix is the obvious choice. But I'm here to convince you to ditch the box—because homemade cake mix is a lot easier to make than you might think, and produces a cake that is worlds more delicious than the grocery store alternative. Crazy, right? With a little bit of foresight, you can have a stash of pre-portioned dry ingredients on hand, ready to be magically transformed into the ultimate party-ready dessert.This whole situation is based on my Easiest Chocolate Birthday Cake recipe, and produces a rich, tender, super-chocolatey cake that puts boxed devil's food to shame. The only ingredients that you need for your own cake mix are all pantry staples like flour, sugar, cocoa powder, and leavening (i.e. baking powder and baking soda). And that's the big disadvantage when it comes to most boxed cake mixes: They don’t stop there, incorporating industrial ingredients like modified corn starch, palm oil, sodium stearoyl lactylateblahblah…what even IS this stuff? Keeping everything in your D.I.Y cake mix simple, clean, and pronounceable is what makes it all the more delicious.Essentially, all you need to do to make homemade cake mix is to combine all of the dry ingredients included in a cake recipe, and then stop there. (Think about it: Isn't that really the only thing the boxed mixes are promising in the first place, that you don't have to mix dry ingredients together? Yeah, it is.) In this case, you simply whisk together 1⅓ cups all-purpose flour, 1¼ cups granulated sugar, 1¼ tsp. kosher salt, 1¾ tsp. baking powder, and ¼ tsp. baking soda in a large bowl. Then you sift ½ cup unsweetened cocoa powder right into that bowl and whisk everything to combine. That's it! At this point you can place the mixture into a dry, airtight container and store it in your pantry for up to three months, ready for whenever the need for a cake might arise.When you're ready to bake, you just pick up where you left off in the recipe, adding all of the wet ingredients and proceeding from there. How easy is that? Making the dry mix will take you all of five minutes—which, when you think about it, is much quicker than taking a trip to the grocery store and waiting in line. Got a lot of parties on the horizon? Is it that time of year when it seems like ALL of your friends have birthdays? Mix up a few rounds of the dry mix and portion them out into separate containers, and you'll be a cake-making machine.Plastic takeout containers are perfect for storing batches of homemade cake mix.\nChelsie CraigBut the real selling point here is not how much time you’ll save—it's about quality. This chocolate cake recipe is just so much more complex in flavor than anything that comes out of the box. A lot of store bought cakes are filled to the brim with sugar, and end up tasting more sweet than anything else. My recipe dials back the sugar a bit, and incorporates a little extra salt which balances the sweetness. Also, you can control what kind of cocoa powder you use—springing for the good stuff is always worth it, in my opinion—which will in turn make it taste more rich and chocolatey.So for your next office birthday, bake sale, pet adoption, going-away party, or whatever occasion calls for cake, pass on the box. With a stash of mix on hand, you'll only ever be a few whisks away from a moist, chocolatey homemade cake you can really be proud of—and that's something worth celebrating.Get the recipe:Easiest Chocolate Birthday CakePure homemade birthday love. If you've got a bowl, a cheap hand mixer, and a couple of measuring cups, you can make this rich, chocolatey cake.View RecipeExplore Bon AppétitBasicallyCakeChocolateBirthdayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Kat Boytsova"]}