{"id": "8939274eaa5a888756abf7435ac58eea", "url": "https://www.bonappetit.com/story/el-jardin-san-diego", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "El Jardin Is the Reason I Love San Diego | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Go to San Diego Just to Visit This One RestaurantThe hyper-regional Mexican food at El Jardín slays, even by California standards.By Priya KrishnaJune 12, 2019FacebookTwitterEmailPhoto by James TranFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I used to only associate San Diego with strip malls and a zoo. After my most recent trip though, I realized that was ignorant. That’s because San Diego is home to the place where I had one of my favorite meals of this year: at El Jardín.I can’t think of a single thing I disliked about my experience at the hyper-regional Mexican restaurant, overseen by the bold, endlessly energetic chef Claudette Zepeda Wilkins. We sat in a large outdoor patio with heat lamps. Half an hour into the meal, a server saw that I was still chilly and brought out a big, colorful blanket. My friends and I drank a bottle of red from Bichi winery in Tecate that tasted like funk and cranberries. And the food! Fideos secos that are the most addictive plate of garlic noodles you’ve ever had. Tlacoyos with cheese fondue, hoja santa, and broccoli that taste like inhaling a garden. Even the guacamole—a cliché at many Mexican restaurants—was crafted with care: fruity, smoky, and slightly spicy all at once. And best of all? The basket of warm tortillas was constantly being replenished. Even by California standards, this Mexican food was unforgettable.Perhaps the only thing I dislike about this restaurant is that I live in New York...and there aren’t enough direct flights to San Diego.Go there: El JardínExplore Bon AppétitRestaurantsCaliforniaMexicanHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Priya Krishna"]}