{"id": "894906b18a9cfdac2dd50347ad5fe563", "url": "https://www.bonappetit.com/recipe/beans-and-greens-salad-with-cranberry-sumac-dressing", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Beans and Greens Salad With Cranberry-Sumac Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueBeans and Greens Salad With Cranberry-Sumac DressingBy Brian YazzieApril 20, 20215.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jaida Grey Eagle, prop and food styling by Rose DanielsEmailPinterestPrintEmailPinterestPrintFor Brian Yazzie, the executive chef of Gatherings Cafe inside the Minneapolis American Indian Center, this textural salad represents his two homes: the Southwest and Minneapolis. The tender Tepary beans and crumbles of goat cheese remind him of his Navajo roots. The beans are native to the Sonoran Desert, and goats are essential for food and clothing for Diné people. Dandelion greens are a local Minneapolis species that elder Hope Flanagan of Dream of Wild Health farm recently showed him and his team how to forage for. In his recipe, Yazzie seeks out the brown varieties of the Tepary beans—he loves the ones from Ramona Farms—because they excel at holding their shape and are native to the American Southwest. To balance their creaminess and the dandelion greens’ bitterness, he uses a combination of cranberries and sumac to create a bright, acidic vinaigrette.Ingredients4 ServingsDressing1scallion½cup extra-virgin olive oil or sunflower oil2sprigs mint1garlic clove½cup unsweetened cranberry juice or 1 cup fresh or frozen cranberries1Tbsp. sumac, preferably wild American2tsp. honey1½tsp. onion powder¼tsp. freshly ground black pepperKosher saltBeans and assembly2Tbsp. amaranth (optional)1½cups drained cooked brown tepary or other beansKosher salt6cups dandelion or turnip greens (from about 1 bunch)1cup microgreens (optional)2oz. fresh goat cheese, crumbledPreparationDressingStep 1Separate dark green top from scallion and chop. Finely chop remaining white and pale green parts; keep separate. Heat oil, mint, and dark green scallion top in a small saucepan over medium-low until just warm; let cool.Step 2Strain oil mixture through a fine-mesh sieve into a blender; discard solids. Add white and pale green parts of scallion, garlic, cranberry juice, sumac, honey, onion powder, pepper, and a couple pinches of salt. Purée until dressing is smooth. (If using whole cranberries instead of juice, strain dressing.) Taste and season with more salt.Beans and assemblyStep 3If using, toast amaranth in a dry medium skillet over medium heat, tossing often, until most of the grains have popped open, about 5 minutes. Transfer to a small bowl.Step 4Toss beans with ¼ cup dressing in a medium bowl; season with salt. Arrange greens on a plate; spoon beans over. Top with microgreens (if using), goat cheese, and amaranth and drizzle a little more dressing over.How would you rate Beans and Greens Salad With Cranberry-Sumac Dressing?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleYummy! We went a bit heavy on the micro greens (pea shoots) and skipped the amaranth as we didn’t have it on hand. The The dressing was great though I think using cranberries instead of cranberry juice would’ve been better. Pairs well with salmon for dinner!AnonymousSt Paul, MN5/4/2021Explore Bon AppétitSaladNative AmericanAmericanSumacHerbs & SpicesBeanVegetableGoat CheeseCheeseQuickEasyWeeknight MealsMainSideNut-FreeGluten-FreeVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Brian Yazzie"]}