{"id": "8951c3d06b9a9a88be82da2697d9f587", "url": "https://www.bonappetit.com/story/french-soda-recipes", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "French Sodas Taste Like Liquid Creamsicles, and We Are Here for It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFrench Sodas Taste Like Liquid Creamsicles, and We Are Here for ItOui, the most refreshing (and fizzy!) drink of the summer has arrived. Find out how to make one at home.By Emma WartzmanJune 21, 2018FacebookTwitterEmailPhoto by Ashley SullivanFacebookTwitterEmailWe all want to live life like we’re on vacation in France, and though that is sadly not possible, we’ve found a way you can be one step closer: French sodas. The combination of fizzy water, flavored simple syrup, and a splash of half-and-half over ice is exactly what you want in between your morning cold brew and your it’s-finally-late-enough-to-start-drinking rosé sangria.At Bellecour in Wayzata, MN, they started serving French sodas last year as a summertime treat. “They’re increasingly popular,” says general manager Jeanie Janas. “People are asking about them, learning what they are. And now that summer has arrived we’re excited to try new combinations.” On the menu right now they have rosemary-berry, cocoa nib-coriander, lavender-vanilla, and—while it’s in season—a rhubarb-orange zest, using syrup from roasted rhubarb they use in another dessert.A pro pouring half-and-half from up high at Bellecour.\nAshley Sullivan CreativeThe execution is easy and the possibilities are pretty much endless, which is what makes us excited to play around with them at home. You start by choosing a flavor base, which can be as simple as fruits like nectarines, peaches, or plums. Then add other ingredients like citrus zest, or spices like cinnamon or cardamom. Take inspiration from pie fillings if you’re feeling overwhelmed.You then take your chosen flavors and bring them to a boil in a pot along with water and sugar, just like you would a normal simple syrup. In this case, though, Janas recommends changing up the normal 1:1 ratio since whatever fruit you’re using will bring its own sweetness. “About 60 percent water to 40 percent sugar is what you want,” she says. Once the sugar has dissolved, you let everything steep and cool, and then strain through a fine-mesh sieve.Now, time to make a drink. Grab a glass and fill it with ice. Pour in 1 oz. of half-and-half, and ½ oz. of the cooled syrup, then top it off with about 6 oz. of fizzy water. For those who can’t have dairy, milk substitutes work just fine (they offer almond and macadamia milk at the restaurant).“The best thing about these is that they are refreshing but satisfying at the same,” Janas explains. “You have the fizzy water which lightens the drink up, and then the cream which makes it richer and gives it a nice mouthfeel. Basically, it’s not heavy even though it has depth to it. It’s like a creamsicle.” And you don’t even have to chase down the ice cream truck to get one.Explore Bon AppétitSodaFrenchSummer DrinksFruitRead MorerecipesOur 43 Best Summer CocktailsGallery43 SlidesBy Mehreen KarimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Emma Wartzman"]}