{"id": "89520234c710487b5276497cc5eabb3a", "url": "https://www.bonappetit.com/story/crispy-air-fryer-brussels-sprouts", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Air Fried Brussels Sprouts Are Charred, Crispy Perfection | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Crispiest Brussels Sprouts Are Made in an Air FryerThis Thanksgiving save your oven for turkey and pie.By Amanda ShapiroNovember 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The first time I tried to make Air Fryer Crispy Brussels Sprouts With Honey Butter, my brussels sprouts were already air-frying by the time I realized I was out of turmeric. And butter. So I thought to myself, What would FoodTok put on air-fryer brussels sprouts? And the answer was ranch seasoning. And it was so so good. But, at the insistence of my editor, this article is not about ranch seasoning—it’s about air-frying.While I’m still new to the world of air-frying, I do know that brussels sprouts and air fryers are meant to be. That continuous blast of hot air gets the sprouts crispy on the outside while keeping the insides tender, and the leaves that get blown off will be even more brittle and charred. As long as you make sure there’s enough oil coating the vegetables for them to sizzle and brown (in this case, two tablespoons is sufficient), an air fryer does a better job than most ovens ever could. I’m not hosting Thanksgiving this year, praise be, but if I were I’d put my air fryer to work on this recipe and free up my oven to handle what it does best—the turkey—and the stove to take care of…too many other things.COSORI Air Fryer Max$120 at AmazonThe brussels sprouts alone might be crispy-charred perfection, but the butter is the real reason I keep telling everyone I know about this recipe. On our air-fryer episode of “Food People,” Rachel described it as “a sweet, sticky, tangy, golden sauce,” and ever since then I’ve been dreaming about it. First, fresh ginger and ground turmeric get sizzled in a little olive oil, then comes butter, honey, crushed red pepper flakes, salt, and, finally, lemon juice. If it sounds like an explosion of flavors packed into a luscious amount of butter that gets poured over your hot, crispy sprouts, well, that’s exactly what it is.No shade to ranch seasoning, but this recipe is better. A total cinch and a Thanksgiving savior, all you need to do is steal a burner long enough to make that sauce and you’re golden. And crispy. And buttery. Perfection.Get the recipe:Air Fryer Crispy Brussels Sprouts With Honey ButterThese Brussel sprouts are a textural masterpiece: crisp on the outside, tender inside, and drizzled with an indulgent honey butter. View RecipeExplore Bon AppétitcookingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-22", "author": ["Condé Nast", "Amanda Shapiro"]}