{"id": "895f955c4578bf5c78e40d70fdb867f1", "url": "https://www.bonappetit.com/recipe/butternut-squash-and-chorizo-hash", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Squash and Chorizo Hash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueButternut Squash and Chorizo HashBy Anna StockwellSeptember 18, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintTop this sweet and spicy hash recipe with eggs for breakfast or fold it into tortillas for a taco with some sour cream and hot sauce on top and you’ve got dinner.Ingredients4 servings1Tbsp. (or more) extra-virgin olive oil8oz. fresh chorizo, casings removed1lb. butternut squash (about ½ of a medium squash), peeled, cut into ½\" pieces (about 4 cups)1medium onion, coarsely choppedKosher saltLime wedges and cilantro leaves with tender stems (for serving)PreparationStep 1Heat oil in a large heavy skillet (preferably cast iron) over medium-high. Cook chorizo, breaking up into small pieces with a wooden spoon, until browned and cooked through, about 5 minutes. Transfer to a bowl with a slotted spoon; reserve skillet with fat.Step 2Add butternut squash and onion to reserved skillet and cook over medium-high, adding more oil if needed and stirring occasionally, until golden brown and tender, 10–15 minutes. Stir in chorizo and season with salt. Squeeze a lime wedge over and top with cilantro. Serve with additional lime wedges for squeezing over.How would you rate Butternut Squash and Chorizo Hash?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis recipe is fantastic. If you don't like butternut squash as you find it too sweet, this recipe will totally change your mind. Don't miss out any of the ingredients, as they all play a part in making this great. We've done it a couple of times when we didn't have cilantro to hand, or didn't have an egg, and both times we realized how much they brought to the dishAnonymousNY9/27/2021LOVE this recipe, especially since I'm always looking for new breakfast recipes that include some spice. I used the Cacique pork chorizo so it's a softer consistency but I like how it stayed almost creamy and homogenous mixed with the squash. I also topped with a little avocado and an extra egg for a filling dinner. It keeps and reheats well.Nate GLos Angeles, CA9/27/2019Explore Bon AppétitSpanishEuropeanAmericanButternut SquashSquashVegetableChorizoSausageMeatFallWinterSideSautéBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Anna Stockwell"]}