{"id": "89975bf6a89acdb69e4122e2d8477b35", "url": "https://www.bonappetit.com/story/spiked-seltzer-debate", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Cinderella Lattes, Lonely Tomatoes, and Butter Boys | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCinderella Lattes, Lonely Tomatoes, and Butter BoysAll of this and a spiked seltzer debate.By Alex BeggsSeptember 7, 2019FacebookTwitterEmailPhoto by Transcendental Graphics/Getty Images (Edited by Beggs)FacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Cinderellie CinderellieAfter escaping to Northern Michigan for the tail end of August where I mostly read the Jack Reacher canon, I returned to a flood of food news. The biggest story is that there’s an off-menu Cinderella Latte at Starbucks—you just need to know how to order it. “According to HappiestTeesOnEarth,” Bustle reported, “the simplest way to get a Cinderella Latte is to order a Pumpkin Spice Latte and sub in White Chocolate Mocha Sauce for half the pumps of Pumpkin Sauce.” So simple! You just need to hitch up your scooter to a flock of singing mice, have them pull you to the nearest Starbucks, find a fairy godmother barista to fulfill your wish, and fling your shoes at an unsuspecting cutie trying to get outta there with his Venti Americano unscathed. Not today, prince! Today I’m getting the Cinderella Latte and there’s no stopping me!!!Four things I cooked recentlyA delicious sour cherry pie that I made holes for the crust with the cherry pitter’s plastic guard, which I thought was pretty clever until the Instagram comments started rolling in. 530, to be exact. “Triggered!” “Trypophobia alert!!!” “This terrifies me!” “This pie ain’t even cute” “I HATE THIS” “Hide image.” Oh I’m sorry, you’re scared of FALLING INTO GOOEY SWEET CHERRY AND LIME GOO? Is that so scary?! I’m fine to believe a small portion of the population has a fear of holes, maybe of the earth-opening-up variety, or Michigan potholes that swallow up Subarus. But I’m NOT BUYING that my innocent little pie is doing it. Also, wahhhh!Danny KimThese corn and jalapeño fritters (double the recipe).Basically’s incredibly easy corn salsa. There’s a cool step where you mash the corn with a potato masher to release some juices and starches so it clings to each salty Tostito. Genius, Claire Saffitz!Healthyish’s cauliflower rice pilaf. Not really a carb-avoiding type, but this sounded so good I had to make it—and it was! You toast almonds in butter and then stir in cinnamon and red chile flakes to begin...and what else do you need to know, really.Want this letter before it hits the website? Sign up for our newsletter!Photo by Marcus Nilsson, Food Styling by Frances Boswell, Prop Styling by Amy WilsonMy dad told me he made the September issue cover star pork chops!! Rock on, dad!This tomatoIs me at every party.Butter boyIs alive and well.Half-carafe kind of weekI finally made it to Sloane Crosley’s favorite neighborhood restaurant, Sevilla, this week. Have you read her book, The Clasp? It’s very good! You should! Anyway, at Sevilla, I had fantastic mussels in a spicy garlic-and-fish stock broth that I soaked up with bread, and a half-carafe of my favorite varietal, “house red.” The carafe arrived and looked...pretty big. “How many glasses is this?” I asked the waiter who was wearing a starched burgundy suit. “About two,” he replied. Reader, it was four. I’ll be back!Explore more beloved neighborhood restaurants across the country here.Josh, you’re rightI just want to mentionThat Carla Lalli Music (see a week of her dinner recipes here!) has been calling me “Alexisss” in a pitch-perfect impression of Catherine O'Hara as Moira in Schitt's Creek all week and I’ve never been happier.Photography © 2019 by Tang & Nakimushi Peanuts.Why notSushi cats from the upcoming wonderfully kooky Land of the Rising Cat: Japan’s Feline Fascination © 2019 by Manami Okazaki. Photography © 2019 by Tang & Nakimushi Peanuts. Published by Prestel.Unnecessary food meme of the weekUnnecessary food feud of the weekIt may have been cut from a past article for reasons I can’t disclose, but I’m not an alcoholic seltzer gal. The mystery grain alcohol plus flavored water—all for the sake of lower calories—I can’t support that kind of double lie. Also, I prefer tequila. However, it turns out a portion of the Bon Appétit staff, mostly a natural wine and craft beer drinking snobby bunch, had a White Claw Summer I didn’t see coming. “Black raspberry tasted like a melted popsicle,” noted Emily Schultz. Alex Delany had a Strong and Confidently Correct opinion: “Black cherry is the best flavor. But I’ve only had them after having...a few other drinks,” he hedged, “So do with that info what you will.” I’ll publish it! Rachel Karten was team black cherry. Christa Guerra noted that after two black cherries, you won’t be able to tell what flavor any of them are. Jesse Sparks took a case to the beach with a friend: “Black cherry and grapefruit were easily the faves. All the others were hot trash.” And before things went too far, Carla Lalli Music chimed in: “I know we’re in a safe place with no judgment, but this thread is really activating my maternal protective instincts and I feel like telling you all that just because your friends drink White Claw doesn’t mean you have to, too. Just have a shot and then drink a seltzer, okay?” Okay, Carla!Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-07", "author": ["Condé Nast", "Alex Beggs"]}