{"id": "89ac65563f83081c1ee1a108ed2727f1", "url": "https://www.bonappetit.com/story/every-kitchen-in-america-needs-a-y-peeler", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Every Kitchen in America Needs a Y-Peeler | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEvery Kitchen in America Needs a Y-PeelerThe Y-peeler will cut down on your prep time... not on your fingers.By Julia BlackJanuary 3, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If humans always acted in our own best interest, the world would be a different place indeed. We'd all sleep eight hours a night, hydrate regularly, and spend 90% less time comparing ourselves to the rich and famous on Instagram. And we'd all be using Y-peelers.It's a genuine mystery to me why so many of us are still using swivel peelers—or worse yet, paring knives—when the alternative is not only cheap and easy-to-use but also the preferred standard in professional kitchens across the country. But like I said, humans don't always get it right. There's no better time to rethink your peeling approach than winter, when the seasonal produce—from carrots to squash to sweet potatoes—is all so peeler-friendly.I suppose you'll be wanting some evidence to back up these claims of the Y-peeler's greatness. Well, for starters, you can buy a pack of three for under $10 on Amazon (and at these prices, just toss 'em when they get dull and move onto the next). Then, consider the grip. With a swivel peeler, you're forced into an awkward, elbows-out stance, where the rotating blade always seems to swivel away from where you need it to go. With a Y-peeler's ergonomic design, you can comfortably hold whatever needs to be peeled—be it a cucumber, a mango, a kiwi, an eggplant, a potato, or a carrot—in one hand, and pull the peeler down from below with the other in one swift, fluid motion. No carpal tunnel. No nicks and cuts. No sloppy, jagged peels.\"Simplicity is the key to brilliance.\" —Bruce Lee, about this Y-peeler, we assume.\nFor the fancy chefs among us, there's a Y-peeler for every occasion. We're fans of this Tovolo three-pack ($12 on Amazon), which includes one regular peeler, one for julienning, and one with a serrated blade to dig into fruits and veggies with delicate skins. With these (magnetic! stackable!) bad boys in your kitchen drawer, you can shred green papaya for a Thai salad, peel potatoes for mashing, or even zest a lemon for a drink.Of course, there are a few peeling jobs you can even do with a spoon. But for the vast majority of your peeling needs, the Y-guy has got you covered. So fine, stay scrolling on Instagram. But please, for your own sake, get yourself a Y-peeler already.Kuhn Rikon Y-Peeler, Set of Three$14 at AmazonAnd then peel some stems for a broccoli quinoa salad, why dontcha?:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitBA RecommendsStaff PicksToolsShoppingRead MorecookingThis Humble Dish Is the Unsung Hero of Baking SeasonBy Alex Delanycooking$7 Gets You the Only Wine Opener You Ever NeedBy Alex DelanycookingYou Don't Need a Knife SetBy Sarah Jampel and Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Julia Black", "Alex Delany"]}