{"id": "89af9498ce6785002398bee73835cee8", "url": "https://www.bonappetit.com/recipe/black-bass-with-coconut-herb-salad", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Black Bass With Coconut-Herb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueTamarind-Glazed Black Bass With Coconut-Herb SaladBy Andy BaraghaniFebruary 11, 20204.4(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintTamarind concentrate makes this sweet-and-sour glaze sticky, glossy, and amazing. Plus, the glaze will work on other proteins besides fish. If you’re using it on grilled meats like chicken, steaks, or ribs, brush on the glaze toward the end of the cooking process so the sugars don’t burn.Ingredients4 servings½cup unsweetened shredded coconut3Tbsp. virgin coconut oil or a neutral oil (such as grapeseed or vegetable)2medium shallots, thinly sliced into ringsKosher salt12\" piece ginger, scrubbed, thinly sliced lengthwise4garlic cloves, crushed1Tbsp. double-concentrated tomato paste¼cup tamarind concentrate2Tbsp. honey1Tbsp. low-sodium soy sauce21½–2-lb. head-on whole black sea bass or red snapper, cleaned3Thai chiles or 2 serrano chiles, thinly sliced1cup mint leaves, torn if largeLime wedges (for serving)Ingredient InfoTamarind concentrate, often labeled “concentrate cooking tamarind,” can be found at Asian and Thai markets and online. We like Tamicon Tamarind Concentrate, $7. You can also use tamarind paste, a dense brick of dried tamarind pulp that isn’t as concentrated in flavor and needs to be thinned with water until spoonable. Use the same amount as you would concentrate.PreparationStep 1Toast coconut in a dry medium saucepan over medium heat, stirring often, until golden brown, 5–7 minutes. Transfer to a small bowl.Step 2Wipe out saucepan. Combine oil and shallots in saucepan and set over medium-high heat. Cook, stirring often, until shallots are golden brown and crisp, 8–10 minutes. Using a slotted spoon, transfer shallots to paper towels to drain; immediately season with salt.Step 3Reduce heat to medium and add ginger and garlic to saucepan. Cook, stirring occasionally, until browned in spots, about 4 minutes. Add tomato paste and cook, stirring constantly, until paste splits and color darkens slightly, about 2 minutes. Add tamarind concentrate, honey, and soy sauce and cook, stirring constantly, until glaze is smooth and just beginning to bubble, about 1 minute. Remove pan from heat; taste glaze and season with salt.Step 4Place a rack in upper third of oven; preheat to 425°. Place 1 fish on a cutting board and thoroughly pat dry inside and out with paper towels. Using a sharp knife, make slashes crosswise on a diagonal about every 2\" along length of body (make sure to cut all the way down to the bones as this will help the fish cook evenly). Turn fish over and repeat process on the other side. Transfer fish to a parchment-lined baking sheet, then repeat with remaining fish.Step 5Season both fish all over with salt. Brush both sides with about half of the glaze, leaving the garlic and ginger behind. Roast fish, brushing with remaining glaze halfway through, until glaze is sticky and flesh flakes easily with a fork, 16–20 minutes.Step 6Arrange fish on a large platter or 2 smaller platters and scatter toasted coconut, crispy shallots, chiles, and mint evenly on top. Serve with lime wedges alongside for squeezing over.How would you rate Tamarind-Glazed Black Bass With Coconut-Herb Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWow! What a recipe! I'm always excited by Bon Appetit recipes that introduce me to something new, and I was so excited to try cooking with the tamarind concentrate. I used some frozen fish fillets that I had on hand -- will definitely be making this with the full fish one day to impress my friends. When I tasted the sauce out of the pan, it was quite tart, but when I took my first glorious bite of the fish with the sauce, toasted coconut, mint, shallots, and chilis... WOW, what a meal! I felt like I was eating something from a trendy restaurant, but it's just me quarantine cooking. I truly feel like this recipe is perfect, minus some discrepancy with the cooking time of the fish. \n\nMy friends and I are all subscribed to Bon Appetit and share what we cook with each other... I blew up the group chat with this one. jahgurlremyPortland, OR4/3/2020The ingredients can make or break the recipe. The quantity of tamarind concentrate (Not sauce) is too high. It overpowered the entire fish and eliminated any taste of the toasted coconut and crispy shallots. If I try it again, because I love making whole fish, I will use 1 teaspoon of tamarind and 1/4 the amount of coconut. At 425 degrees F., The fish takes closer to 23-24 minutes because it takes a while to baste the fish on both sides at the half way point. I also felt that there was too much honey in this recipe. The Serrano peppers were too hot, but thankfully easy to pick off the fish.KiloWattSan Diego, CA3/10/2020This recipe turned out great. If you're wary of tackling cooking  whole fish.... don't be! It's actually much easier than you think. I used whole red snapper for this, and the only \"special\" ingredient I had to get was the tamarind sauce, which I was able to find at my local Asian market. I found the glaze came together really nicely, and I had plenty to coat the fish. My fish took a bit longer than 20 minutes to cook through, probably because mine was closer to 3 pounds. It's fairly easy to tell with snapper when it's cooked because the flesh turns white rather than pink when it's cooked. We ate this with steamed white rice and sautéed greens, and it made a delicious dinner. AnonymousCleveland, Ohio3/3/2020Explore Bon AppétitSoutheast AsianAsianCoconutFruitTamarindCondiments, Sauces & PastesBassFishSeafoodSnapperMainDairy-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Andy Baraghani"]}