{"id": "89b8ed035828b926ec65570988d4ee8b", "url": "https://www.bonappetit.com/story/triple-corn-polenta", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "This Polenta Recipe Takes a While and Has Three Kinds of Corn and Is Totally Worth It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTriple Corn Polenta: An Elaborate Dish That Didn’t Need to Exist, Until It DidCorn is in season—but corn is also for all seasons. Which is why we have triple corn polenta.By Amiel StanekAugust 28, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailBasically editor Amiel Stanek spends all day every day trying to help readers get dinner on the table as quick and efficiently as possible. So when he gets to cook at home, he likes to slow things down and be a little...extra. Welcome to Not So Fast, a monthly column about what he’s cooking.Corn is right now; corn is forever. It’s simultaneously one of the most hyper-seasonal, get-it-while-it’s-good-and-then-it’s-gone players in the summer farmers’ market scene and, in its dried forms, a year-round, evergreen pantry staple. And it’s all delicious—the comforting nuttiness of grits and polenta; chewy, curious, savory-funky nugs of hominy; and, obvs, the fleeting firework sweetness of fresh kernels shaved from farmstand cobs. Trippy, huh?I was thinking about that the other day while I was on my way home from work, knowing that I had a half-dozen ears of that August good-good sitting on the counter begging to be cooked. Oh, the possibilities! I could just boil the cob in some salted water and eat them with a shocking quantity of butter, but I’ve always found eating corn on the cob indoors to be kind of depressing. I could shave off the kernels and sauté them quickly in a hot pan with a bit of olive oil, but that would take no time at all, and if cooking dinner doesn’t take at least a couple of hours I won’t know what to do with the rest of my night. So, I came up with a way to turn what could have been a simple side dish into an elaborate, all-evening affair: Make hominy, make polenta, and mix it together with the fresh stuff. A polenta recipe that celebrates everything that the humble corn has to offer. TRIPLE. CORN. POLENTA. Party time!Here’s how it went down. I knew that hominy, which usually needs to be soaked overnight and then simmered for hours to get tender, was going to take the longest. So as soon as I got home I threw a cup of the stuff into my pressure cooker, covered it with water, got the thing going, and set a timer for 40 minutes. While the pressure cooker shuddered and sputtered on the stove, I shucked and shaved the kernels off of 5 ears of corn, which yielded about 3 cups. I still had a half hour to kill so instead of throwing out the now-denuded corn cobs like a regular person, I made a quick corn broth. I ran the edge of a knife over the surface of each cob to rough them up a bit, broke each one in half, and put it in another pot over medium heat with just enough water to cover and a pinch of salt. It may have looked like the saddest pot of cartoon soup of all time—a handful of spent corn cobs in murky water—but within 15 minutes the liquid went cloudy and took on a starchy sweetness. Waste not, want not, or whatever!Corn cobs still have a lot of love to give once you’ve cut those kernels off.\nPhoto by Alex LauWhen the hominy was finished, I strained its cooking liquid into the pot with the corn broth and got ready to bring my dream dish together. I put a big honkin’ high-sided skillet on the stove, heated a generous glug or two of olive oil over medium heat, and sizzled four smashed garlic cloves and a sliced Fresno chile until they relaxed and started to brown slightly. In went the corn kernels, which I sautéed along with a four-fingered pinch of salt for a few minutes to take a little bit of the edge off, and then added the cooked hominy. Then I transferred enough of that flavor-packed hominy cooking liquid-corn broth hybrid into the skillet to cover the solids generously—about 5 cups—and when the whole situation started bubbling I gradually streamed in ½ cup of stone-ground polenta, stirring constantly for the first five minutes to make sure that it didn’t clump up in a weird way. It looked cool as hell! Big, blown-out pieces of fuzzy hominy, shiny little bits of fresh corn, and flecks of golden polenta floating all suspended in that rich, corny liquor. TRIPLE. CORN. POLENTA!A star is born! A polenta recipe that tastes like 365 days of corn!\nPhoto by Alex LauI let the whole mess cook, stirring occasionally and topping off with more of that corn juice when the mixture got too thick, until the polenta lost its grittiness (about 35 minutes), and stirred in a couple tablespoons of butter for good measure. It tasted like 365 days of corn: Eating it on the cob, typewriter-style, while getting eaten alive by mosquitoes in the middle of August; slurping up the chewy bits of hominy in October’s first bowl of fiery posole; and the puddles of soft, nutty polenta that serve as the base of braise-y things all winter long. And there was absolutely no better time to be eating it.Table for one.\nPhoto by Alex LauWhen the polenta recipe was finally finished, it was 10 p.m. and I had forgotten to make anything else for dinner. So I sat down with a big bowl of my T.C.P., slapped on a fat dollop of sour cream and added a few lashes of hot sauce, and went to town. Not bad for a Tuesday night, if I say so myself.More maximalist corn love:These Extra-Corny Cornbread Muffins Are No JokeA new recipe you can make for breakfast, slathered with honey butter, or as an all-purpose barbecue side.View StoryExplore Bon AppétitNot So FastCornPolentaHominyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-27", "author": ["Condé Nast", "Amiel Stanek"]}