{"id": "89d2264e09bb84ee311459cdf09a49fc", "url": "https://www.bonappetit.com/recipe/turmeric-and-coconut-braised-cabbage-with-chickpeas", "year": 2020.0, "month": 11.0, "day": 5.0, "content": "Turmeric and Coconut-Braised Cabbage With Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurmeric and Coconut-Braised Cabbage With ChickpeasBathe seared cabbage in turmeric-accented coconut milk until it’s meltingly tender and sweet. By Hetty McKinnonNovember 29, 20204.7(183)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrint“Cabbage has emerged as the hero of weeknight pantry cooking,” writes cookbook author and recipe developer Hetty McKinnon. “Inexpensive and infinitely versatile, with an impressively long shelf life, one head of cabbage goes a long way. This recipe, where wedges are bathed in a turmeric-accented coconut milk until meltingly tender and sweet, uses just half a cabbage. It’s enough to feed a family of four (with rice on the side), but you could easily use a whole one if you are feeding more mouths or catering to bigger appetites. To adjust the recipe, increase the stock or water to 1 cup to create more braising liquid—you may also have to sear the wedges in batches and use a bigger pan to simmer. You could also double the amount of chickpeas or substitute with cooked lentils instead.” And for the other half of the cabbage? We recommend saving it for another night: Shave it finely, toss with mint, dress with lemon juice and olive oil, and top with lots of grated Pecorino and freshly ground black pepper for a quick salad.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Skillet with Lid$40 At AmazonSpatula$12.99 At AmazonCan Opener$14 At AmazonColander$11 At AmazonWooden Spoon$6 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 Servings½medium head of green cabbage (about 2 lb.)2medium shallots (about 4 oz.)11\" piece ginger2garlic cloves1serrano or other green chile3Tbsp. extra-virgin olive oil, divided1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more113.5-oz. can unsweetened coconut milk115.5-oz. can chickpeas1tsp. brown mustard seeds1tsp. ground cumin1tsp. turmeric powder½cup vegetable stock or waterFreshly ground black pepperSteamed white rice, cilantro leaves, and lime wedges (for serving)PreparationStep 1To start, prep your ingredients: Slice ½ medium head of green cabbage (about 2 lb.) through core to make 4 wedges. Peel and finely chop 2 medium shallots (about 4 oz.). Peel one 1\" piece ginger with a spoon and finely chop. Using the side of your knife, crush 2 garlic cloves, remove and discard papery skins, and finely chop. Halve 1 serrano or other green chile lengthwise and, if you don’t want it too hot, scrape out seeds and white membrane with the back of the knife; discard. If you prefer some heat, leave as is. Finely chop chile. Set shallots, ginger, garlic, and chile aside.Step 2Heat 2 Tbsp. extra-virgin olive oil in a large high-sided skillet with lid or wide Dutch oven over medium-high. Add cabbage, cut side down, and season with kosher salt. Cook, undisturbed, until lightly charred underneath, about 5 minutes. Turn over and cook, undisturbed, until charred, about 5 minutes. Transfer cabbage to a plate.Step 3Shake one 13.5-oz. can unsweetened coconut milk to ensure it’s well mixed; open can. Open one 15.5-oz. can chickpeas and rinse in a colander under running water.Step 4Heat remaining 1 Tbsp. extra-virgin olive oil in same skillet over medium-high. Add reserved shallots, ginger, garlic, and chile, and cook, stirring with a wooden spoon, until fragrant, about 1 minute. Add 1 tsp. brown mustard seeds, 1 tsp. ground cumin, and 1 tsp. turmeric powder and cook, stirring, until mustard seeds are popping, about 1 minute.Step 5Add coconut milk, chickpeas, ½ cup vegetable stock or water, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt. Stir to combine.Step 6Place cabbage wedges back into pan and, using a large spoon, baste cabbage with coconut milk; bring mixture to a boil. Cover, reduce heat to low, and cook until cabbage is tender, 15–20 minutes. Taste and season with salt and freshly ground black pepper.Step 7Scoop some steamed white rice into each bowl and divide cabbage and chickpeas over; top with cilantro leaves. Serve with lime wedges, for squeezing over.How would you rate Turmeric and Coconut-Braised Cabbage With Chickpeas?Leave a ReviewTell us what you thinkReviews (48)Back to TopTriangleGreat recipe when altered a bit, I didn't have a mustard seed, so I just used a little dijon mustard. I added a little red curry paste and a lot of nutritional yeast (great cheesy flavor). Added a lot more seasoning, vegetable stock, and some corn starch. Kinda hard to eat with the big pieces of cabbage. I might blend it up into a smooth soup later.Rae Kamp3/20/2022Great recipeAnonymous3/17/2022Can we please have this in metric?Vladmire Putipovancouver2/23/2022Delicious and super healthy! I mostly followed the recipe and  except, per comments, I roughly doubled spices and made sure the cabbage had a really good char on it. I also cheated a bit added a big spoon of Brooklyn Dehli Tomato Achar (an amazing condiment for anything and especially things with this flavor profile) to up the flavor and umami. I will make this routinely, the only further adaptation I would make is cutting the cabbage into 1/8s and cook in two batches, instead of 1/4s to increase char area. I let it all fall apart in the dish--wasn't as pretty but still as delicious. AnonymousPortland, OR1/6/2022I made this today: when I tasted it I thought the taste was a bit flat and watery. I added a few additional ingredients and that worked better for me. I wanted to keep it vegan so I added 2 tbsp of almond butter and 1 tbsp of nutritional yeast. The broth improved in texture and it was a little thicker/creamier. I also added 1 tsp of ground coriander. I served it with coconut rice and the final result was delicious. Another alternative would be to make it with coconut cream instead of milk or maybe use the garbanzo beans juice and forgo rinsing them.RolalaLos Angeles, CA12/16/2021I modified this recipe to suit me and it was subtle but tasty. I decided to have this with chicken thighs (skin on). Cook the chicken thighs before you char the cabbage wedges, making sure to render the skin well. Remove from the pan and set it aside on a plate. Carry on with the recipe as usual, but halve the amount of coconut milk without adding any extra liquid (I used water, not stock). Add the chicken thighs back to the pan at the point you also add the charred cabbage. Cook for 15 minutes with a lid on, then remove the lid, turning the heat up to medium and cook for a further 5 minutes to allow the sauce to reduce a little. I would say that if you're cooking this recipe without the chicken, you should opt for stock over water and possibly add fish sauce like others have previously mentioned.ReganNSW, Australia12/14/2021We love this recipe. It’s easy, cheap and quick to make — what more could you ask for. \nEven better as left overs. Yum! Denise GNY 12/12/2021In these dark times, the sun setting ever earlier in this cold fall, this recipe brought the light and warmth back into our hearts. The yellow tones of the turmeric livened our weary spirits. So cozy, so milky, so curry, so satisfying, so would make again. Heed not the naysayers, this dish is fun to make, simple, while somehow also being very rich. It is a BA classic. Looking forward to leftovers tomorrow, ya'll. Added extra turmeric, used fresh ground cumin, and kicked up the spice a bit with red chili flakes. PrikonDurham, NC11/16/2021I made this today incorporating some of the suggestions below: I doubled the spices, added garam masala, and chili flakes. I doubled up on aromatics and the chickpeas as well. I let the cabbage get really brown in my cast iron, and chopped it up a bit before adding it back in. I also added some fish sauce with the coconut milk. I'd up the spices even more next time, roast the chickpeas and add them at the end, and chop up the cabbage more before browing to get more of those tasty burnt ends. AnonymousOAKLAND CA10/7/2021I've made this a few times. People do like this dish but somehow they don't eat all that much. I think it might be too outwardly healthy for the \"I'll eat vegan but don't make it look vegan\" set. Perhaps the gas-bage (as my mom calls it) is just filling us up. Fear not, I have a solution: THE LEFTOVERS MAKE AN EXCELLENT DIP. Blitz it into a hummus-y coconut mixture: Trick them all into leftovers; trick yourself! Spread it on sandwich, eat it with aged baby carrots, spoon it into your insomniac head at 2 AM, or thin in it out and mix it with pasta...speaking of blitzing, ingredients 2-5 can be chopped together in a device. make the robots serve you for a change.\n\nThe beauty of this recipe is it's so forgiving, buildable, and has ingredients that are all shelf stable. It works with red cabbage if that's all you have. You can put whatever spices in that you like (I find it needs something): I always add a bit of msg in the form of bouillon powder or asafetida / hing. Sometimes I top it with Chinese fried shallots at the end or I add smoky dried peppers at the beginning. Miso might be a really good addition, too, since it seems to need salt!\nGalus CassiusLos Angeles, CA9/30/2021Extra Chilli if you please. Otherwise perfect CaitlinLondon9/27/2021Has a lot of room for potential but needs some work.  Used a full jalapeno sans seeds and it's really not the spicy.  I used canned coconut milk but still found it underwhelming.  I sprinkled some garam masala at the end but would probably add: whole cumin seeds, hing, maybe some curry leaves.  Also love the searing of the cabbage and it's beautiful presentation wise but annoying eating wise.  Next time will probably sear and cut up on cutting board before adding back in.  Despite the numerous ways I was let down I did actually enjoy it and seems like a good off the cuff meal since cabbage can last weeks in the fridge.Desiree8/2/2021This recipe sounded like it would be perfect, but truth be told, I was under-whelmed by the lack of flavour. I had to add a lot of salt to make it worth eating. Maybe the mustard seeds in my pantry are a bit old, or I should have used canned coconut milk instead of from a carton. But even so, I would probably prefer a more complex variety of spices, per some of the other comments below re: doubling garlic, adding cumin seeds, garam masala, chilli flakes, etc.AnonymousAuckland, New Zealand4/22/2021FAMTASTIC-translated -Family loved it! I cut the cabbage in sixths and rubbed with olive oil and grilled to desired char. Worked great. I simmered for about 15 minutes while caramelizing some cauliflower and carrots in the oven. I added them about the ten minute mark. I added some curried mustard as I didn’t have the seeds. Also upped the spices a pet pet other notes. Loved it!Donna Chicago 4/17/2021Delicious!DonnaYellowknife, NT Canada4/16/2021Explore Bon AppétitChickpeaBeanVegetableCoconut MilkOther IngredientsGreen CabbageCabbageLeafy GreensEasyOne-Pot MealsQuickWeeknight MealsMainVegetarianVeganDairy-FreeGluten-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-29", "author": ["Condé Nast", "Hetty Mckinnon"]}