{"id": "89d7dc453ae3a13808757ce7b3fe91b5", "url": "https://www.bonappetit.com/story/fat-miilk-phin-filter", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Vietnamese Coffee Brand Fat Miilk Has Refreshed My Daily Caffeine Ritual | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis New Vietnamese Coffee Brand Has Refreshed My Daily Caffeine RitualRobusta beans and my Fat Miilk phin filter are giving my mornings life.By Joseph HernandezDecember 10, 2020FacebookTwitterEmailPhoto courtesy Fat MiilkFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My routines have gotten boring. Day in, day out, it’s the same thing: Wake up, brush my teeth, exercise (LOL), make my first mug of pour-over and, eventually, get on with the day. Where I once found constancy and stability in these micro-rituals, my routines had become rote. They were officially stale.I knew I needed to shake things up, but switching up my workout from yoga to HIIT exercises felt excessive (and I’m a lazy person who doesn’t like to sweat—no thanks). Changing the coffee in my grinder and my process of brewing it felt like a gentler way to introduce change, however small.Enter Fat Miilk, a new coffee company whose goal is to introduce Vietnamese coffee culture, tradition, and flavor to Americans. Founded by Lan Ho and Tuan Huynh earlier this year and launched in September, the brand leans in on the founders’ upbringing, highlighting Huynh’s family’s coffee farm in Buôn Ma Thuột, the capital city of Đắk Lắk Province in the Central Highlands of Vietnam.In a world seemingly full-to-the brim with artisan craft coffees, Fat Miilk stands apart in one major way: They embrace coffee’s robusta variety. Arabica, which is the species grown at higher altitudes in lower quantities and typically described as fruitier and sweeter, is much more common in specialty coffees, but at a higher price. For a while, robusta (which can be grown at lower altitudes and can be nuttier in flavor) was considered “inferior,” but Ho and Huynh want to change that narrative.“Where my family grows our beans, the majority of those farmers grow robusta,” says Huynh. “It is authentic to who we are to embrace these beans. We’re not super-versed in coffee culture—we’re new to the coffee game—but one thing that always struck me was that robusta was always treated secondary to arabica, and that narrative hurts farmers like my family,” who hand-harvest and process the beans before they are roasted by Càphê Roasters, a Vietnamese specialty coffee roaster in Philadelphia.“It was important for us to get the roasted flavors right, too,” says Ho. “When we were looking to partner with roasters for our robusta beans, (Càphê Roasters) knew what we were going for because there was this shared experience. They understood what we wanted, because they’re Vietnamese, too.”That collaboration resulted in the brand’s first offering, the Blue Roast. Available ground or as whole beans, the coffee is all toasty almonds with kind of a grassy aroma on the nose, an eye-opener for sure. Besides having a different flavor profile from arabica, robusta also has the distinction of boasting more caffeine than its counterpart, if you need to be further sold on giving it a try.Further highlighting the Vietnamese coffee experience, the Fat Miilk team also sells phins, the adorable pour-over adjacent brewing vessels found throughout Vietnam. Easy to use, the phin is not too much a departure from my standard pour-over ritual.Like a pour-over, you place the phin on top of your mug. You allow the coffee grounds to bloom a bit with an initial splash of hot water—just enough to dampen the grounds. This releases trapped carbon dioxide, which can taste sour, but also inhibits the extraction of aromatics and oils. (Blooming is recommended no matter how you brew your coffee, to enhance your flavor experience.) After the initial bloom, you fill the phin to the top and cap it off with the filter press—the whole production, which doesn’t take longer than 5 minutes, is like a combination of pour-over and French press methods. (Fat Miilk also provides a useful how-to on its website.) Et voila, you have an, ahem, a robust cup of joe to fuel whatever the day may bring. The whole process is familiar but enough of a difference that reminds me change is fun and good. Even better? I can use the phin to make iced Fat Miilk coffee in the afternoon—Ho and Hunyh nearly insist. Vietnamese iced coffee has long been my favorite excuse to enjoy a generous spoonful of sweetened condensed milk in, well, anything, so who am I to say no? Rich, creamy and sweet, it is the perfect foil for robusta’s flavors, which tend toward chocolatey when iced.You better believe I introduced a leisurely coffee ritual to my afternoons.Fat Miilk Blue Phin Filter$10 at Fat MiilkExplore Bon AppétitHighly RecommendCoffeeShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-10", "author": ["Condé Nast", "Joseph Hernandez"]}