{"id": "89de2d792a3d87c715f30ef1c1ebe960", "url": "https://www.bonappetit.com/recipe/eggplant-adobo", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Adobo-Style Eggplant Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAdobo-Style EggplantBy Sohla El-WayllyAugust 23, 20204.7(61)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintAdobo—both a style of preparation as well as the name of a dish—is one of the most widely known foods of the Philippines, often referred to as its national dish. As Nicole Ponseca and Miguel Trinidad write in I Am a Filipino: And This is How We Cook, adobo originated as a preservation technique and “can be broadly defined as anything cooked in vinegar. […] Depending on the region, the province, the city, or even the cook, the dish changes due to the Philippines’ own ocean-to-farm-to-table foodways.” To make adobo, which can be wet (very saucy) or dry (crispier and less soupy), pork, chicken, tubers, vegetables, squid, lamb, shrimp, or even duck, is simmered in vinegar, often with soy sauce, black peppercorns, and bay leaves. This recipe channels the same flavors of bright vinegar and dark soy sauce, using eggplant as the base, with the addition of ground pork for extra richness. Although this dish will work well with any eggplant, try it in late summer when they reach their peak at the farmers market. Serve alongside plenty of steamed rice to sop up all the sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonIngredients2 main-course servings or 4 side-dish servings 1lb. small Japanese or Italian eggplant (about 3)2Tbsp. (or more) sugar, divided1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided, plus more1½tsp. freshly ground black pepper, divided8garlic cloves3Tbsp. (or more) vegetable oil4oz. ground pork3Tbsp. coconut vinegar or unseasoned rice vinegar2Tbsp. soy sauce2bay leavesCooked white rice (for serving)PreparationStep 1Slice 1 lb. small Japanese or Italian eggplant (about 3) into quarters lengthwise, then cut crosswise into 2\"-wide pieces. Place in a medium bowl. Add 1 Tbsp. sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. freshly ground black pepper. Toss to evenly coat eggplant and let sit at room temperature at least 20 minutes and up to 2 hours.Step 2Peel and thinly slice 8 garlic cloves. Add 3 Tbsp. vegetable oil and half of garlic to a medium Dutch oven or other heavy pot. Cook over medium-high heat, stirring constantly with a wooden spoon, until light golden and crisp, about 5 minutes. Using a slotted spoon, transfer garlic chips to a plate; season lightly with salt.Step 3Place 4 oz. ground pork in same pot and break up into small pieces with wooden spoon. Season with ¼ tsp. Diamond Crystal or Morton kosher salt and cook, undisturbed, until deeply browned underneath, about 5 minutes. Using slotted spoon, transfer to another plate, leaving fat behind in pot.Step 4Place eggplant on a clean kitchen towel and blot away any moisture the salt has drawn out.Step 5Working in batches and adding more oil if needed, cook eggplant in same pot until lightly browned, about 3 minutes per side. Transfer to plate with pork.Step 6Pour 1½ cups water into pot and scrape up browned bits from bottom with wooden spoon. Add remaining garlic, 3 Tbsp. coconut vinegar or unseasoned rice vinegar, 2 Tbsp. soy sauce, 2 bay leaves, 1 tsp. freshly ground black pepper, and remaining 1 Tbsp. sugar. Bring to a simmer, then return pork and eggplant to pot. Reduce heat to medium-low, partially cover, and simmer until eggplant is tender and silky and sauce is reduced by half, 20–25 minutes. Taste and season with more salt and pepper and add a little more sugar if needed.Step 7Top with garlic chips and serve with cooked white rice.How would you rate Adobo-Style Eggplant?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleI make this recipe with ground chicken or ground beef. It's super delicious. One of my favorite cooking methods: adobo!!!AngelAlbania 1/29/2022I make this recipe with vegetarian sausage and it is heaven. AnonymousCleveland Ohio12/10/2021Second time ever cooking with eggplants (they're intimidating okay!) and I was not disappointed. This recipe is a gem, except for the portion size. I did not make nearly enough for how delicious it was, and how much the fam loved it.TaylaAlexandria, VA11/23/2021Thank you Sohla!\nIf I had that in a Restaurant, I wld say “I HAVE to learn how to make this!” Everyone loved it and said-make this again!\nI crisped smoked bacon, cooked the garlic chips in that, set aside, then browned the eggplant with a little more oil. I used one cup of water per comments. Cut the sugar to 1/2 T. Simmered a few minutes w 2extra bay leaves, vinegar and soy. Then added eggplant for 10 min. Superb!VintagebabeChicago 10/23/2021This is way better than any adobo I've made and I'm Filipino. \n\nThe only alterations to the recipe I did:\n- I used sliced pork belly instead since that's what I had. \n- I added string beans (sitaw) as I wanted to be a vegetable heavy dish. It's also a common Filipino dish, Adobong Sitaw. Cut them 2in length.\n- I ran out of coconut vinegar and used sherry vinegar instead. \n\nPERFECTION!! The sauce was perfectly balanced. I followed the simmer time and the sauce was thicker, just the way I like it. Andy PieFairfield's CA10/6/2021Really, really good. I added a touch of fish sauce to round out the flavor. Also I doubled the recipe and doubled the amount of pork to make it a main dish. Excellent and will be making this again.AngelaSF Bay Area7/20/2021Loved this recipe! Doubled it so we could have leftovers. I subbed pressed tofu + fish sauce for the pork and that worked well. The sauce never really got “silky” maybe because I didn’t have any animal fat in there, but it was delicious with lots of rice! This will definitely become a repeat dish for us. MargotHollis, ME5/2/2021This was great, though very sweet especially the longer it stat on the stove (so when I went back for seconds) . Will probably do a bit less sugar next time. I also did half a pound of ground pork because that's what I had. For two people, maybe not the biggest meal. CharlotteLos Angeles, CA 2/7/2021Great flavor overall, and loved the special little crispy garlic chips for texture and crunch! I used 8 oz ground turkey bc it’s what I could find, and it was delicious! Did the full amount of water and time, and it was great, not too mushy, perhaps because I used Japanese eggplant. The only thing is that it didn’t get sticky and caramel-y like it looks in the photo...maybe needed to add a little more sugar or cook even longer? I also will probably only use one bay leaf next time. Otherwise really yummy! KPOakland12/11/2020This is soooo good - I’ve made it twice now, once with Italian eggplant and once with Chinese. It was much better with Chinese, and I probably wouldn’t make this if I couldn’t find them. I used ground veal because I couldn’t find ground pork and it was great. Will be making again!AnonymousPhiladelphia, PA12/11/2020I've made this twice already, without deviating from the recipe. I'm not usually a fan of eggplant (I'm using italian, that's all I can find), but here I enjoy the mushy texture folks in the reviews are trying to avoid, so I simmer for the full 20-25 mins. It's super good, I'll be making it again and again.Paula PérezSpain11/29/2020Lol I just bought 9 aubergines since the recipe says you need about 3 (doing the recipe x3) but it turns out 4 average aubergines is about 3 lb. Don't make the same mistake! Looking forward to a tasty dinner though SiiriLondon, UK11/22/2020I'm going to try this recipe, and instead of pork, I will be using vegan sausage or just the Japanese Eggplants I have growing in my garden!Alice GoodloeLong Beach, CA11/3/2020Made this with double the pork (8 oz) and only 3 italian eggplants (they were large), plus rice vinegar instead of coconut vinegar. It was delicious! Everyone loved it. Next time I'll skip on the garlic chips, though. AnonymousBoston10/28/2020I wanted to make this recipe tonight but it looks like the recipe disappeared? Where did it go?Anonymous10/13/2020Explore Bon AppétitFilipinoSoutheast AsianAsianEggplantVegetableGround PorkPorkMeatSummerEasyMainSideDairy-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-23", "author": ["Condé Nast", "Sohla El-Waylly"]}