{"id": "89e8c472a03c637b250e3fc5065a815d", "url": "https://www.bonappetit.com/recipe/tomato-braised-rotisserie-chicken", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Tomato-Braised Rotisserie Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueTomato-Braised Rotisserie ChickenBy David TamarkinJanuary 8, 20194.2(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintGive a store-bought bird a new identity by simmering it in a quick tomato-bacon braise. Reprinted With Permission From COOK90: The 30-Day Plan for Faster, Healthier, Happier Meals By David Tamarkin, Published By Little, Brown and Company, 2018Ingredients4 servings2tsp. extra-virgin olive oil4oz. bacon (about 4 slices), sliced crosswise ¼\" thick2shallots, thinly sliced⅓cup dry white wine2garlic cloves, finely chopped2tsp. finely chopped rosemary114.5-oz. can diced tomatoes1cup low-sodium chicken broth½tsp. kosher salt¼tsp. crushed red pepper flakes12½-lb. rotisserie chicken, cut into 8 pieces1bunch curly kale, ribs and stems removed, leaves torn into bite-size piecesPreparationStep 1Heat oil in a large Dutch oven or skillet with a lid over medium. Cook bacon, stirring occasionally, until starting to brown, about 5 minutes. Add shallots and cook, stirring occasionally, until shallots are softened and bacon is brown and crisp, 8–10 minutes.Step 2Increase heat to high and add wine, garlic, and rosemary to pot. Cook, stirring, until wine is reduced by half, about 1 minute. Add tomatoes along with their juices, broth, salt, and red pepper flakes and bring liquid to a boil. Reduce heat to medium; nestle in chicken, skin side up. Top with kale, cover pot, and cook until kale is wilted, 5–7 minutes. Stir kale into sauce and continue to cook, uncovered, until chicken is warmed through, about 5 minutes more.How would you rate Tomato-Braised Rotisserie Chicken?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleSo easy and soooo tasty! I love any recipe where you can get in more veggies. Next time I make it I might add a couple tablespoons of tomato paste to make the sauce a little thicker but it really was delicious exactly as writtenAnonymousDenver, CO11/29/2020This was very easy and very tasty! \nMy family enjoyed it. I used canned diced tomatoes in basil and lemon peppered rotisserie. BeeOrlando, FL11/10/2020Very easy to try. Beginner friendly lol. Ritz80California7/26/2020I was kinda disappointed by this recipe. The chicken ended up super soggy, and the tomato wasn't flavorful to me. Maybe I did wrong, but I don't think so.AnonymousLos Angeles, CA4/17/2020This was awesome! Really easy and tasty. We used lacinto kale which I find not as tough to eat. So good!AnonymousLos Angeles4/8/2020Just made this except with a whole chicken butchered into pieces. It was SO GOOD and easy! I closed the lid on my Dutch oven and put it in the oven for 350F for 30-45 min. I ladled the broth over orzo and it was delicious and hearty without being heavy like beef stew. h.wongChicago, IL4/2/2020This is stupidly good and stupidly easy. I was pleasantly surprised how tasty this was. Great weekday meal! AnonymousIdaho3/10/2020This one was one of the easiest and most delicious meals I've ever made! Anonymous12/7/2019I modified this a bit and it was great. Broiled the chicken to crisp up the skin, put the kale in the sauce, chicken on top and didn't cover. Unfortunately, I didn't have bacon and it was still delicious. Chicken was nearly falling off the bones. Definitely will use bacon next time! Woodbury, CT4/13/2019My whole family loved this. Quick and delicious. Made the recipe exactly as is. The kale was delicious in the rich broth. I only left the chicken in long enough to heat it back up. Next time will serve with a loaf of crusty bread.AnonymousDenver1/28/2019I had to modify this for my kale hating husband. I used a 10 ounce bag of baby spinach which I randomly tore. When I was grocery shopping for the ingredients (which were on the list I left at home) I thought there were also cherry tomatoes. So, having them, I added about 1 1/2 cups of halved cherry tomatoes along with the spinach. I agree with a previous review that the skin, especially on the breast was soggy but presented well and easily came off the meat. Would definitely make this again.AnonymousNashua NH1/27/2019The tomatoes need to cook longer. The skin on chicken gets soggy. Any help with that? It didn't really enhance my rotisserie chicken, just cooked it way more.AnonymousCalifornia1/25/2019Explore Bon AppétitChickenPoultryBaconCured MeatMeatKaleLeafy GreensVegetableCanned TomatoTomatoFallWinterQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeNut-FreeGluten-FreeKetoBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "David Tamarkin"]}