{"id": "89eb86f3026a21b8a6432cfe2763d3f1", "url": "https://www.bonappetit.com/recipe/greek-wings-with-lemon-and-feta", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Greek Wings With Lemon and Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueGreek Wings With Lemon and FetaBy Mashama BaileyJanuary 12, 20214.7(66)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintIn her new cookbook co-authored by her friend and business partner John O. Morisano, Black, White, and The Grey, Mashama Bailey explores the joy and pain of opening a restaurant and delivers this irresistible recipe for lemony, crispy wings. These wings, inspired by the Greek wings at Bailey’s local bar, Crystal Beer Parlor, require at least two hours to marinate, so make sure you plan accordingly.Ingredients4 ServingsWingsZest and juice of 1 lemon6garlic cloves, crushed½cup extra-virgin olive oil1Tbsp. cracked black pepper2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt2tsp. dried oregano3lb. chicken wings or 32 separated flats and/or drumettesassembly½cup extra-virgin olive oil3Tbsp. fresh lemon juice1small garlic clove, finely grated½tsp. cayenne pepper½tsp. cracked black pepperKosher salt¼cup chopped parsley3oz. feta, crumbledPreparationWingsStep 1Whisk lemon zest and juice, garlic, oil, black pepper, salt, and oregano in a large bowl to combine. Add wings and toss to coat. Cover and chill at least 2 hours and up to 12 hours.Step 2Place racks in upper and lower thirds of oven; preheat to 375°. Line 2 large rimmed baking sheets with foil; set a wire rack in each one if you have them. Remove wings from marinade; arrange on baking sheets. Bake wings, rotating baking sheets front to back and top to bottom halfway through, until deeply browned and crisp, about 1 hour.assemblyStep 3Whisk oil, lemon juice, garlic, cayenne, and black pepper in a small bowl; season dressing with salt.Step 4To serve, stir parsley into dressing. Arrange wings on a platter, drizzle dressing over, and scatter feta on top.Excerpted with permission from Black, White, and the Grey by Mashama Bailey and John O. Morisano (Lorena Jones Books, a division of Penguin Random House, LLC). Copyright © 2021.\n\nBuy it from AmazonHow would you rate Greek Wings With Lemon and Feta?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleThis is a staple in our recipe drawer. It's so delicious. We cut out the the oil coating last step, tbh. We felt like it didn't add enough to make the effort worth it. Don't skip the feta though. With or without the oil coating, the a bite of feta with each wing is what makes this dish stand out.erikaAustin, TX10/4/2021Awful, seriously? heating virgin olive oil? throw in some garlic and lemon zest and call it Greek. I'm embarrassed that I went along with  cooking this as far as I did. What is the deal with Google nowadays? Very dysfunctional algorisms.AnonymousBoston MA9/22/2021Seriously this has become my go-to marinade for chicken!  That being said, I have also used it for shrimp (only marinated one (1) hour though as to not have lemon juice cook the shrimp).  Grilled the shrimp - unbelievably good!  Andress BlackwellNew Orleans7/28/2021These wings were so delicious! I bought chicken drumsticks from Costco thinking I would have leftovers. but they were so good, I didn't end up having any left overs. I followed the recipe as is, but had my husband grill them instead and they were fantastic. We served them with shishito peppers and arugula salad.BrookeSan Clemente, CA6/28/2021Totally agree with all other reviewers - this is amazing, and I don't even like wings, as a rule!!! Not sure what attracted me to this recipe, but sure glad I tried it - what a nice change of pace in chicken dinners. Marinated over 2 hrs, but next time, will attempt to go longer, like overnight, for all the flavors to be absorbed and might even try fresh oregano.  My oven runs pretty true, so only took about 10 more minutes to brown and crisp up when I upped the heat to 425. Didn't have quite enough lemon for the dressing, so used a lemon infused EVOO (but forgot the seasonings) and served with a small greek salad. Next time, will try on the grill and maybe add some pita or something else to sop up that great sauce! Plan to make over the summer (when it finally arrives in the great PNW) for a light but flavorful dinner!Lia FinneyCoupeville, WA4/17/2021OMG!!!!!!  These are awesome.  I used goat cheese instead of feta.  I used my air fryer @400F for 40 minutes, with the drumlets on top (closer to heating element, 30 min.), swapped tray for last 10 minutes.  They looked burnt, but they weren’t. Added dressing and crumbled goat cheese. It vanished. I served it with a lime coated cucumber and cilantro salad.  Perfect. NLasiukWaukesha, WI3/25/2021We made this for the NCAA Georgetown-Colorado game. Results of the game were disappointing, but these wings were a winner. They were super easy to prepare and serve. We used fresh chicken wings and next time I'll experiment with frozen. I'd definitely make this again and wouldn't change anything. YazBeanSaysMeowAlexandria, VA3/20/2021I’ve made this 4 times since seeing the recipe, once with thighs. This is going to be on permanent rotation at my house, it’s really spectacular. I make it with smitten kitchen oven fries so I can dip the fries in the leftover wing sauce! (Note- I sub the parsley for dill, as I prefer dill and don’t usually have parsley in the house anyway.)KellyBethesda, MD3/6/2021These were a huge hit. Tweaked the recipe a bit to add a generous squeeze of hot honey to the dressing, which gave the wings a beautiful tang. Next time I'll also decrease the oil from 1/3 cup to 2 tbsp in the dressing bc the recommended amount was too much.AnonymousNew York, NY2/21/2021OMG. This recipe is so delicious, I made a couple of changes that elevated the recipe:\n\n1. Use chicken thighs\n2. Marinate overnight \n3. Coat chicken with falafel mix (Trader Joe's) before putting it in the oven\n\nAnd served with sweet potato fries with feta & garlic yogurt dip on the side. Bomb meal!AnonymousBrooklyn, NY2/19/2021These were ridiculously delicious.  I typically don't eat chicken wings, but wanted some type of diversion for Super Bowl.  I will definitely be making these again - soon!   I did take the reviewer's suggestion and give this a little more cooking time - 20 min at the end at 425.  Made them so nice and crispy.  KarinSan Clemente, CA2/8/2021Agree with all previous reviews, really good and really, really easy.  The final sauce really does the trick, the paprika adds a really nice warmth to the dish.AnonymousArlington Heights, IL2/7/2021Amazing!  Just about to make them for the second time (in two days I might add!)RoseVancouver Island BC2/3/2021It gives me untold joy to imagine that somewhere in Georgia Mashama Bailey is cooking in her kitchen while I am trying out one of her recipes in our cottage here in Louisiana. This recipe is ridiculous. RIDICULOUS. I followed all the steps to the tee, marinated for 6 hours, and had them in the oven 1hr15 minutes before our close friends arrived for dinner. What makes these wings indescribable is the dressing you toss them in at the end. The acid from the lemon and the cayenne turn the brightness wayyyyyy up and it's salted perfectly. What I did notice: 375F for my oven was a little too low, they weren't browning at a nice pace, so I baked them for 375F for 50 minutes to cook them through and then turned my oven up to 425F for the last 25 minutes, turning them just as instructed. Big FanNew Orleans, Louisiana. 2/3/2021We loved these wings!  They're super flavorful and were a great addition to a mezze style dinner!  They'll definitely become part of our regular rotation...and would be a fun thing to build a Greek dinner party around!  CynSherman Oaks, CA1/25/2021Explore Bon AppétitChicken WingChickenPoultryFetaCheeseEasyWeeknight MealsSheet-Pan DinnersMainStarterNut-FreeGluten-FreeKetoRoastSuper BowlFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Mashama Bailey"]}