{"id": "89f5cf1bf7ab1cdd2906ee642dcfa703", "url": "https://www.bonappetit.com/story/sub-rosa-bakery-quiche", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "I’ll Eat Anything at Sub Rosa Bakery, But the Quiche Blew My Mind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ll Eat Anything at Sub Rosa Bakery, But the Quiche Blew My MindAnd I’m not the kind of person who goes to a bakery and orders the quiche.By Priya KrishnaMarch 10, 2020FacebookTwitterEmailPhoto Courtesy Sub Rosa BakeryFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I had barely taken a few steps into Sub Rosa Bakery, a cozy corner spot in Richmond, Virginia, and I already knew that this was my kind of place. I had read that owners Evin and Evrim Dogu source grains from local farms and then mill them in house to create a more intense, unique flavor in their baked goods. But seeing everything IRL was almost overwhelming (in the best way). There were plump loaves of sesame rye perched like trophies on the wall. Glossed morning buns, whose layers of pastry were coiled together tightly like a slinky. Even the lighting was perfect, casting this beautiful, sun-freckled shadow over everyone’s breakfasts. But the thing I fell the hardest for was the quiche.I’m not the kind of person who goes to a bakery and orders the quiche. It’s not that I don’t like quiche. It’s just that I have other priorities. I’ll do a croissant, a cookie, or even a cake (better indicators of a bakery’s abilities, I’ve always thought) before I’ll go for the quiche. But when I asked the woman behind the counter what everyone in the bakery loved the most, she immediately gestured toward the quiche. The ingredients change regularly, she explained. Today’s were fennel and onion. So I tacked on a quiche to my order. It arrived warm, the top slightly puffed and golden brown, buttery crumbs falling off the sides. The interior had that custard-y creaminess. The slices of onion and fennel had practically melted into the egg. The crust was light. Most importantly, the ratio of crust to filling was exactly right—neither element overwhelmed the other. I forgot about everything else I had ordered, and turned my attention squarely on polishing off that quiche.Later that day, I Instagrammed my morning bun because it was the prettiest picture I had taken at the bakery, with the laminated layers catching the light streaming through the window. Sure it was something to admire, but really, all I was thinking about was the quiche.Go there: Sub Rosa BakeryExplore Bon AppétitHighly RecommendRichmondRead MorerestaurantsWhere to Eat in Richmond, America’s Next Great Restaurant-Obsessed TownGallery9 SlidesBy Stephanie GanzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-10", "author": ["Condé Nast", "Priya Krishna"]}