{"id": "8a1c69fa3096bbac958b900f235c74d8", "url": "https://www.bonappetit.com/recipe/green-chile-shrimp-scampi-with-spaghetti", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Green Chile Shrimp Scampi With Spaghetti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueGreen Chile Shrimp Scampi With SpaghettiBy Kendra VaculinFebruary 8, 20224.4(27)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Kendra VaculinEmailPinterestPrintEmailPinterestPrintThis recipe uses the time-tested trio of garlic, butter, and lemon to coat spaghetti and seafood in a glossy, flavorful sauce. Along with fresh jalapeño, canned roasted green chiles—an oft-overlooked pantry superstar—lend bright vegetal heat.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonColander$11 At AmazonLarge Skillet$84 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonHeatproof Measuring Cup$18 At AmazonTongs$13 At AmazonIngredients4 servings10oz. spaghettiKosher salt1lb. shrimp, peeled, deveined, tails left on4Tbsp. extra-virgin olive oil, divided1jalapeño, seeds removed if desired, thinly sliced4garlic cloves, thinly sliced34-oz. cans diced green chilesFreshly ground black pepper2tsp. finely grated lemon zest, plus more for serving⅓cup fresh lemon juice6Tbsp. unsalted butterChopped parsley (for serving)PreparationStep 1Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving ¼ cup pasta cooking liquid.Step 2When the pasta is nearly done, pat shrimp dry with paper towels; season with salt. Heat 2 Tbsp. oil in a large skillet over medium. Cook shrimp until pink but still slightly undercooked, about 1 minute per side. Transfer to a plate.Step 3Add remaining 2 Tbsp. oil to same skillet. Cook jalapeño and garlic, stirring often, until garlic starts to soften and turn golden, about 1 minute. Add green chiles and season with salt and pepper. Cook, stirring occasionally, until liquid has evaporated, about 2 minutes. Add lemon juice and cook, stirring often, until combined and mixture is jammy, about 1 minute.Step 4Add pasta, shrimp, butter, reserved pasta cooking liquid, and 2 tsp. lemon zest and cook, stirring often, until butter is melted, sauce is combined, and pasta is coated and glossy, about 2 minutes. Remove from heat; taste and season with more salt and pepper.Step 5To serve, divide pasta among shallow bowls and top with parsley and more lemon zest and pepper.How would you rate Green Chile Shrimp Scampi With Spaghetti?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleSimply delicious and even better the next day!AnonymousSanta Barbara, CA3/18/2022I have to say, I couldn't print the recipe either using the icon on the left. There is an overlay over Step 1 and 2. Some people do print recipes. Is that something to criticize? It's not a big deal but BA probably could do better. Enough said.Janet3/15/2022Its's 2022 who is still printing recipes?? Anonymous3/8/2022and I learned nothing because there is nothing but arguments about how to print the recipe.  what about the icons on the left-hand side of the screen?  these comments are ridiculous!  did anyone actually make the recipe?  what is your actual opinion except for whining about the print function?  mmca8West Texas 3/8/2022I  agree with Jason. I have written several times about the inability to print a recipe. And taking a 'screen shot' is not the answer. I too will not renew my subscription for this reason\n\nSurely you have a technical staff capable of fixing this problem. Or do you read the comments?\n\nUsing the print icon on the left, one of the advertisements overlays the first para of the recipe.\n\nShame on you bon appetit. You can do better.AnonymousAlexandria, VA3/8/2022Hatch Brand Green Chiles is the Go-To.AnonymousChicago, IL3/8/2022Why don’t  all who desire a printable format take a screen shot on your computer and print???Alexis RoseMiami,Fl3/8/2022Really, really good.  Surprised with the heat, we'll have to use less fresh chile next time (you never know when you'll accidentally get a hot one).Anonymous3/3/2022This was ok, but after following the recipe exactly, I'd charge the green chili. I used the organic Luna brand whole foods carries - it just has so little flavor. Unless you know of a great canned brand, just roast your own anaheims and chop them up in its place. That would give some nice green chili flavor. I avoid conventionally grown peppers of all kind - they're a heavy pesticide crop. James RManhattan Beach2/20/2022What is recommended for canned \"diced green chiles\"? Jalapenos?Allison2/20/2022Janet, don't give up! either use the print tool on the left but WAIT for the system to load, OR (on a Mac) just press COMMAND-P, and you can print or create a pdf. RichardHermosa Beach, CA2/17/2022I am able to print these recipes using the tool on the left.JanetLaramie, WY2/17/2022Honestly this is my complaint about every single recipe bon appetit had to offer... You literally NEVER give printable recipes. I will not renew my subscription because of this. I HATE trying to use my phone or tablet so I can fix a recipe. Not giving a printable format is just dumb. This can't be about intellectual property rights because you know I could write it down or type it out and reproduce it. This is just refusing to accept reality.\n\nI love bon appetit but I will not be renewing my subscription and I'm more than happy to savage the publication on Twitter. This is as dumb as Donald Trump's wall.\n\nThanks for saving me another years subscription cost. Jason HafendorferLexington, KY2/10/2022Explore Bon AppétitDinnerWeeknightEasyNut-FreePastaSpaghettiPasta & NoodlesShrimpShellfishSeafoodChileVegetableJalapeñoMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}