{"id": "8a31a7b981c5eec70a97227d5f2e5936", "url": "https://www.bonappetit.com/story/how-three-aussie-gents-brought-australian-cafe-culture-to-new-york-city", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "How Three Aussie Gents Brought Australian Café Culture to New York City | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow Three Aussie Gents Brought Australian Café Culture to New York CityWhere, exactly, do we draw the line between a café and a restaurant?By Wine AustraliaJuly 8, 2019FacebookTwitterEmailCourtesy of Banter WorksFacebookTwitterEmailThink of a café, and you might envision a hangout––a comfortable, casual space in which socializing holds as much importance as culinary merits. (Although great coffee doesn’t hurt, either.) A restaurant, on the other hand, is defined by the caliber of its food and wine.But what about bridging the two––an all-day eatery with the affable charm of the best cafés and the culinary chops of a proper restaurant? It’s a distinctly Australian sort of concept, and one that three Australian gentlemen––Banter co-founders, Nick Duckworth and Josh Evans, and executive chef, Jake Hawkins––have brought to Manhattan. It's a philosophy that defines both Banter in the West Village and Sonnyboy on the Lower East Side, opened just this year with co-founder Stefano D’Orsogna.From LEFT to RIGHT: Josh Evans, Nick Duckworth and Jake Hawkins\nCourtesy of Banter Works“We’re about friendly service and fun, accessible food and drink at an affordable price,” says Evans. “I think that’s the gap in the whole New York restaurant scene at the moment, and we’re trying to make the most of that opportunity.”Duckworth, originally from Sydney, and Evans, raised in Melbourne, met in New York, managing the two locations of the Australian-inspired Two Hands. “We struck up a friendship,” says Evans, “and we knew we wanted to do our own thing.” Six months later, they found a West Village space, and Banter was born as a daytime café. A year later, the two met chef Jake Hawkins, and saw that his culinary talent could only expand Banter’s appeal, allowing them to launch a more ambitious evening menu.“Jake brought fine dining talent to Banter,” says Evans. “But we don’t do it in a fine dining environment.” Even as Hawkins upped their culinary cred, they wanted Banter to remain an easygoing neighborhood favorite, a friendly local that regulars could pop in anytime.This hybrid café-restaurant––or, perhaps, a café that’s evolved the sophistication of a restaurant ––felt familiar to these three Aussies. For more than a decade, according to Evans, Australia has had a robust coffee scene. “Cafés and café culture have been strong for years,” he shares, driven both by third-wave coffee culture and Australia’s robust Italian population with their own, more traditional coffee scene. “In some ways, we modernized it,” he says. “And it was all complemented by the fresh food and produce we have in Australia.”At the same time, workplaces were becoming less formal, with many people looking to take meetings outside the office and use cafés as a sort of home base. There was a healthy market for relaxed, all-day venues that happened to serve excellent meals. “Over time, it really grew into something,” says Evans. “You’ll see meetings during the week, families on the weekends. And the food’s only gotten better. Some cafés back home really are more like restaurants now, reinventing themselves.”And it was clear, in their minds, that New York was ripe for such an establishment.Hawkins’s approach to the menus reflects his Australian roots––which is to say, it’s inherently international and delightfully experimental. “There’s not one thing that defines Australian food,” he says. “We’re a young country, with migration from so many cultures. We’re not held down by tradition, hammering away in dedication to a traditional art.”Their own art is in embracing what’s exciting, interesting, and unexpected. And in embracing quality, according to Evans. “We find what’s fresh and delicious, and put it on the menu.”Case in point: Banter’s burrata dish, with asparagus, radicchio, and currants agrodolce. “You can see multiple international influences just on that plate,” says Hawkins. “In a way it’s Italian, but it’s new-age and exciting and different.”Banter’s Burrata Dish\nCourtesy of Banter WorksOr the beef tartare, which nods to tradition while maintaining its own point of view. “We can all admit that a whole raw egg yolk is a bit gross,” Hawkins says. “So we use a confit garlic aioli, with fresh horseradish on top, and shaved raw cashews, which create the creamy texture you’d get from egg yolk. If one person orders it, everyone at the table will eat it.” Novel, yet unintimidating.“Whenever I make a new dish, I want to make sure my mum can eat it when she comes,” Hawkins laughs. It’s a true reflection of their ethos––unconventional and approachable in equal measures.That enthusiasm for the unexpected extends to their wine philosophy, as well. “We have so many open-minded winemakers in Australia,” says Hawkins, citing trailblazers including Mac Forbes, Airlie Bank, Delinquente Wine Co., and Ben Haines. “We have the opportunity to grow as a culinary scene alongside these winemakers. It’s incredibly exciting.”At a recent Sunday Roast meal, Sonnyboy featured the wines of the unconventional Mac Forbes, “who’s breaking away from commercial winemaking tradition,” says Duckworth. In choosing wines to serve alongside the four-course meal, they wanted to take a few creative liberties, eschewing basic pairing rules in favor of playing around with pure flavor. “We’re not afraid to do that,” says Hawkins.The Mac Forbes Yarra Valley Chardonnay, for instance, echoed many flavors in the burrata dish, not necessarily presenting a pure contrast, while still cutting against the burrata’s creaminess. “We played with the whole Australian new-age way of thinking.”Hawkins is a particular fan of Ben Haines and his natural wines. “He has the kind of underdog story that’s common in Australia. I think we’ll hear a lot more about him.” While he admires the winemaker’s radical approach of minimal-intervention natural wines that buck tradition, he doesn’t need a sommelier-level understanding of a given wine to be inspired by what’s in the glass.“I drink it, and I feel some way about how to wrap the menu around it,” he says. “What excites me is how it doesn’t taste like, say, French wine.”It’s an appreciation for the unconventional, the respectful disregard of tradition, and the willingness to go a little rogue that defines Banter and Sonnyboy, and the wines the three men love. And, of course, creating a genuinely welcoming space that’s free of attitude. At the end of the day, “it’s a relaxed place with a fun vibe,” says Duckworth. “We want you to come in and feel comfortable, like you’re at someone’s home.”“That’s what Australia is all about,” Hawkins agrees. “We make our cuisine fun, easy and interesting, which, in a way, gives us more time to enjoy the food and wine. With family and with friends. It’s all about having a good time.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-08", "author": ["Condé Nast", "Wine Australia"]}