{"id": "8a32c0e1403f32e54a0831ad45e8e3da", "url": "https://www.bonappetit.com/story/canned-tuna-recipe-ideas", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "12 Canned Tuna Recipes That Aren’t Just Tuna Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking12 Things to Do With a Case of Canned Tuna (A CASE!)One can only handle so much tuna salad.By Alex BeggsSeptember 10, 2020FacebookTwitterEmailPHOTO BY LAURA MURRAY, STYLING BY JUDY MANCINIFacebookTwitterEmailI scored a deal on canned tuna fish during Zingerman’s summer sale a few weeks ago. This is what I live for, in my 30s. ANNUAL SALES. And it was the good stuff! Ortiz, in olive oil! A case of 12 cans. Art critics may note how the signature yellow tins are sort of shaped like fish. But more important, I saved money, and now I have a healthy protein ready on the fly, if fish flew, which they do not. Tuna salad is in my future, but I don’t want 12 cans’ worth. So, uh, what else can I do with all this tuna?! I asked the Test Kitchen and Bon Appétit editors which recipes they thought I could swap in, or add tuna to, beyond the obvious niçoise/tuna salad usual suspects. This is what we came up with.(You can get a massive 30-can case from Zingerman’s for $200—wow—or find the 12’er on Amazon for $69, nice. OR! Ask your local grocers if they sell by the case; they might give you a discount.)First, I will make a batch of the best tonnato I’ve ever blended. Then I’ll spend a week spreading it on toast with sliced hard-boiled eggs for breakfast. Or pouring it over roasted sweet potatoes and broccoli for lunch. Or tossing it with grilled green beans at dinner. Tonnato has range!The premise of Claire Saffitz’s anchovy and garlic-breadcrumb pasta is to let the anchovy shine. I’ve made it many times and wouldn’t dare stray. But I will add in some tuna for extra fish points.Not just any tuna salad, but GREEN GODDESS tuna salad is calling. I can’t believe this calls for both mayo and sour cream. Fine, I’ll do it!A little tuna on Andy Baraghani’s fancy tomato toast would be divine.Tuna and avocado, what a combo. Make this dip, grab a box of Triscuits, and call it lunch.Tuna would be great in place of rotisserie chicken in this rice bowl with a lip-smacking scallion sauce.Will I go all out, defrost the puff pastry, invest in HAM, and make epic tuna empanadas? Maybe!String up some Christmas lights, make a pot of black coffee, and re-create my favorite diner with a cheese-oozing tuna melt. Side of too many chips.Sure, tuna in any ol’ salad is probably going to work, but especially up against the shallot vinaigrette, feta, and dill in this chopped number.Another salad, forgive me, but this escarole Caesar was developed by Molly Baz with tinned fish in mind. It’s meant to be. Crispy lettuce against crunchy nuts against sharp cheese—tuna will be a no-brainer swap for sardines here.We’ve got mere days left with summer’s best tomatoes, and this tomato salad with Alabama white sauce would kill with some bonus tuna.Okay, fine! Tuna casserole, it is.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitTunaRead MoreCoronavirus86 Bean Recipes to Always Keep in Your Back PocketGallery86 SlidesBy Bon Appétitrecipes43 Ways to Cook With Canned Tomatoes, Your Pantry HeroGallery43 SlidesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-10", "author": ["Condé Nast", "Alex Beggs"]}