{"id": "8a34001c44d9eaa1453517c874e290ae", "url": "https://www.bonappetit.com/story/thank-restaurants-durham-nc-my-twenties", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "8 Durham, NC Restaurants That Got Me Through My Twenties | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’d Like to Thank the Restaurants of Durham, NC, for Getting Me Through My TwentiesA true story of my hapless dating life…and where I ate through it all.By Amanda ShapiroJune 6, 2018FacebookTwitterEmailPhoto by Chrissy DealFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.When I was 24, I left the bedbug-infested apartment I was sharing with six roommates in Brooklyn and moved to Durham, North Carolina. Another thing I left in Brooklyn? A relationship. “Why break up when you can leave the state?” was my mantra those days. Hey, it worked!My rent in Durham—for a large portion of a three-bedroom house with a wide front porch on a tree-lined street—dropped in half. For the first time as an adult, and despite being grossly underemployed, I had a little money, so I used that money to eat out and to date people, usually at the same time. My life, as one can only say about their twenties once they’ve survived them, was both a disaster and amazing.It helped that Durham’s food scene circa 2012 was also in a golden age: reliable and affordable, thriving but not out of control. A handful of local restaurants played key supporting roles in my various romance-sagas. I’d like to endorse them here.1. Cook OutVibe: 1950s trans-fat-casualOrder: Watermelon milkshake, two strawsGreat for: Innocent, retro first dates; convincing yourself that dating will be easier down here.2. Happy ChinaVibe: Luxe suburbia—dark wood, tall pleather booths, instrumental covers of ’90s hitsOrder: General Tso’s tofu, dry sautéed string beans, extra fortune cookiesGreat for: Letting your two best friends know that you’ve met your soulmate and what he’s like in bed.3. Bull City Burger and BreweryVibe: Tech bros in Rainbows with screaming toddlers, something called the Tower of Beer PowerOrder: Joan Jett veggie burger for him, cheeseburger in a lettuce wrap for you, sweet potato friesGreat for: Seeing yourselves 10 years from now; quietly panicking.4. Fishmonger’s [NOW CLOSED]Vibe: Linoleum fabulous, Bulls game blaring, reportedly unpaid back taxesOrder: Grilled whatever’s-on-the-specials-board, baked potato, buttered snap peasGreat for: Staring across the table on Valentine’s Day and knowing it’s only a matter of time.5. Geer Street GardenVibe: Converted gas station–chic, makes parents feel coolOrder: Cobb salad, creamy vinaigrette on the side; glass or three of ChardonnayGreat for: Meeting your two best friends immediately post breakup and smoking cigarettes on the patio even though you definitely quit.6. Dos PerrosVibe: Getting drunk alone, but in a classy wayOrder: Three tacos for $12 and at least two $5 margaritas (Sunday and Monday nights only)Great for: Convincing yourself that you’re fine, totally fine, you just need to be alone for a while, and hey, who is that very attractive bartender who is definitely new in town?7. Pizzeria ToroVibe: Wannabe Brooklyn, including the wait; eye-rollingly worth itOrder: Pizza with Meyer lemon, Saracena olives, dried chiles, and Crescenza; wishing they had pepperoniGreat for: Snagging a window seat with the person you met on Tinder, hoping your ex (or at least his friends) walk by.8. The FederalVibe: Apathetically cooler than you, just townie enoughOrder: Nachos (add guacamole); whatever draft beer is cheapest tonightGreat for: Running into your ex totally by accident, you swear, you had no idea he’d be at this place that happens to be his favorite, then letting him buy you a drink because it’s Wednesday, and why the hell not? You’re moving back to New York soon anyway.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsDurhamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Amanda Shapiro"]}