{"id": "8a359f00d44632ffd1fabcf970fea7b4", "url": "https://www.bonappetit.com/recipe/pan-seared-scallops-with-chorizo-and-corn", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Pan-Seared Scallops with Chorizo and Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssuePan-Seared Scallops with Chorizo and CornBy Molly BazAugust 14, 20184.8(69)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Molly BazEmailPinterestPrintEmailPinterestPrintTreat scallops to the flavorful oil left behind when you cook chorizo—it’s basically liquid gold.Ingredients4 servings 3ears of corn, husked3Tbsp. extra-virgin olive oil, divided2oz. smoked Spanish chorizo, finely chopped12scallions, white and pale green parts only, thinly sliced4garlic cloves, thinly sliced½–1serrano chile (depending on heat), finely chopped¾tsp. kosher salt, plus more1cup buttermilk⅓cup chopped cilantro12large sea scallops (about 1 lb.), side muscle removed, patted dry2Tbsp. unsalted butter1lime, halvedLime wedges (for serving)PreparationStep 1Cut kernels from corncobs and place in a medium bowl. Using the back of a chef’s knife, scrape milk from cobs into the bowl; discard cobs.Step 2Heat 1 Tbsp. oil in a medium saucepan over medium. Cook chorizo, stirring occasionally, until it starts to get crisp, about 2 minutes. Carefully pour chorizo oil into a small bowl (use a slotted spoon to hold back chorizo); set chorizo oil aside. Return chorizo pan to medium heat and add scallions, garlic, chile, 1 Tbsp. olive oil, and ¾ tsp. salt. Cook, stirring occasionally, until vegetables are softened but not browned, about 2 minutes. Add corn kernels and cook, stirring occasionally, until bright yellow and softened, 5–7 minutes. Remove from heat and let corn mixture cool in pan 5 minutes. Gently mix in buttermilk and cilantro. Taste and season with more salt if needed.Step 3Season scallops generously with salt. Heat reserved chorizo oil and remaining 1 Tbsp. olive oil in a large skillet over medium-high until just beginning to smoke. Cook scallops on one side, reducing heat if they are taking on too much color and moving around in pan for even browning, until a golden brown crust forms on the bottom, about 3 minutes.Step 4Reduce heat to medium-low and turn scallops over. Add butter to skillet and, using a spoon, baste scallops with butter 30 seconds. Transfer scallops to a plate. Squeeze halved lime over.Step 5Divide corn mixture among plates and arrange scallops on top. Serve with lime wedges for squeezing over.How would you rate Pan-Seared Scallops with Chorizo and Corn?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleHave made this recipe 3 times now and have followed it to the letter, with the exception of adding diced red bell pepper tonight.  We will probably continue to make that addition going forward; we liked the added flavor and color the pepper gave the dish.  The recipe is also easy to increase, to serve more than 4.   We will definitely make this wonderful dish many, many times in the future.CynthiaBentonville, AR3/22/2022Molly Baz never fails to impress. Nice smoky flavor with the chorizo. I finished the dish with diced avocado to get my healthy fat into the meal. No one knew it was buttermilk…if you think you want to substitute for something else, don’t…it’s all in your head. Just do it!SCPmaryland7/31/2021I thought this was good, but I prefer the taste of scallops seared with a little olive oil and a bit of butter. I will not sear them in the chorizo oil next time. The buttermilk was a nice change of taste instead of cream or milk. I will make it again with a couple of changes.Deb KaneAthens, GA7/19/2021I've made this 3 times already and have finally perfected the flavor I've been looking for. I used the following substitutions: shrimp instead of scallops & jalapeno instead of serranos. I also added 4 strips of crumbled bacon into the mix. I only put enough buttermilk to make it creamy, but not watery. Lastly, I season it with salt, pepper, and onion powder to taste. Every household needs to make it the texture, flavor, spice they prefer, and I'm glad that i stumbled upon this recipe as a base. It deserves 10 stars all around. AnonymousHeaven4/24/2021Wonderful, flavorful sauce.   I used drained Mexican chorizo because Spanish is not available where I live.  JacquieCrozet4/23/2021One of my favorite recipes of all time! This dish is as delicious as it is beautiful. The flavors are perfect. I keep coming back to it lgehgaAustin, Texas9/24/2020Great recipe but I thought the buttermilk was a little overwhelming.  Will definitely make again, however will probably replace with whole milk in the future. Stephanie BrownChicago9/21/2020This was absolutely amazing!  The corn chorizo mixture was so tasty and flavourful.  The seared scallops were divine.  pilarlunaHuntington Beach California 9/9/2020LOVE THIS! I made it with local Long Island Corn and freshest Scallops. Since I was sipping (gracefully chugging) white wine while cooking, I deglazed the pan with 1/4 cups of the wine and added a little more butter, then I poured it over the scallops in the dish. YOU MUST MAKE THIS RECIPE!TheyCallMeCharleySag Harbor, NY9/7/2020This turned out yummy and felt very much like a restaurant dish.  I subbed soyrizo for chorizo and added a lot of extra soyrizo .. which I think made it a little too heavy/rich.  But flavors were great and very easy!AnonymousCalifornia8/21/2020Absolutely delicious! I think the 12 scallions listed could be a misprint? We used 2 and it was perfect. The flavors were robust but well-balanced. We grilled the corn and recommend that method if you have time to do so. We may try grilling the scallops next time. laurenml23Crested Butte, CO8/16/2020Very very good.    I  made this twice.   The first time exactly as written and it was good.     The second time, I couldn't get cilantro or chorizo, so I made an italian version with basil and hot italian sausage with all the remaining ingredients identical.        Lots of possibilities here.    You could even do kielbasa and dill or pancetta and parsley.    Do yourself a favor and have all your ingredients chopped and ready to use.      And have the scallops dry and well salted     AnonymousMontclair NJ8/12/2020Going to try with Coconut milk because that's all I have! Stay tuned...\nAnonymousNYC7/13/2020I have been salivating at this picture and every time I watch Molly's video, I can't wait to try it. I got my list ready and will make it next week sometime! Such great content BA, thanks!Omaha, Nebraska7/10/2020This was just absolutely phenomenal. Our grocery store at the beach didn't have chorizo in stock so we went ahead and substituted it with andouille sausage and it came out great (next time I'll keep an eye out for chorizo at Wegman's before coming down to South Jersey :)). \nDefinitely an awesome restaurant quality dish for while dining out still isn't entirely an option.Catherine AndersonHoboken, NJ6/14/2020Explore Bon AppétitAmericanScallopShellfishSeafoodChorizoSausageMeatCornVegetableSerrano ChileChileScallionOnionButtermilkOther IngredientsSummerMainGluten-FreeSautéSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Molly Baz"]}