{"id": "8a37e53a01e568a1a14bafb45a65f8a2", "url": "https://www.bonappetit.com/story/my-moms-pot-brownies", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "My Mom's Pot Brownies Were Legendary During the AIDS Epidemic. This Is Her Recipe. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Mom's Pot Brownies Were Legendary During the AIDS Epidemic. This Is Her Recipe.At its height, my mom's San Francisco bakery was producing 10,000 cannabis brownies every month.  By Alia VolzApril 20, 2020FacebookTwitterEmailPhoto by Laura Murray, styling by Anna BilingskogFacebookTwitterEmailThis excerpt comes from Home Baked: My Mom, Marijuana, and the Stoning of San Francisco by Alia Volz.If you haven’t heard of Sticky Fingers Brownies, here’s why: we got away with it. For more than twenty years—from the disco-mad seventies through the AIDS crisis and the dawn of medical marijuana—my mom and her collaborators produced potent, chocolatey edibles in an underground marijuana bakery, and in defiance of the law. And I grew up watching.My mom had catered to San Francisco’s LGBTQ+ community since the seventies. By the mid ‘80s, HIV/AIDS was rampant. There was no cure, no effective treatment. In those days, diagnosis was considered a death sentence.Early in the epidemic, people noticed that cannabis eased some AIDS-related symptoms—especially the deadly wasting syndrome that rendered people unable to eat. Marijuana diminished nausea, pain, insomnia, and depression. Some people couldn’t smoke due to pneumocystis pneumonia, so brownies became a lifeline.An underground network of dealer-healers—including Dennis Peron and Brownie Mary Rathbun—came together during the crisis. My mom made home deliveries to customers who were too sick to go out, though many came to us, and she never charged more than a couple dollars for a brownie most people split into four doses. At its height, Sticky Fingers was producing 10,000 cannabis brownies per month.The baking process unfolded inside our home—a cavernous warehouse in the Mission district of San Francisco. Sunlight blasted through skylights thirty feet overhead. My mom tells me that because the warehouse was impossible to heat, she used to nurse me beside the antique oven during weekly baking marathons. These brownies were messy. Handling them tarred your hands, hence the name Sticky Fingers.On weekends, salespeople fanned out into the city. Mom hung duffel bags of brownies from the back bars of my stroller and wheeled me through the Castro. Rather than selling to strangers, she served a regular clientele that worked in restaurants, boutiques, and offices on her route. Harvey Milk’s camera shop and campaign headquarters was a weekly stop, as was the home of Sylvester, the disco star. At a café called the Village Deli, my mom would leave a bag holding hundreds of brownies with the manager, who sold them over the counter. Hours later, she’d collect the bag again—now full of cash. Customers fawned over me while my mom did her deals.I was too young for specific memories then. But something from these early outings stays with me. It’s a peculiar type of nostalgia, undiluted, different from my remembrances of later years. I somehow understood, even then, that my mom and I belonged to our community; we were part of the city’s fabric.The aroma of our bakery is sharp in my mind. My folks used outdoor sinsemilla grown in secret gardens on sunbaked hillsides in Humboldt and Mendocino counties. (This was before hybridization created strains smelling of girl scout cookies, cheddar cheese, and blueberry muffins.) The odor was round and earthy: notes of crushed ponderosa pine needles, redwood tree bark, algae from the lazy Eel River, dust kicked up from dirt roads. It smelled like a place. Now add butter, Baker’s chocolate, and gas from an antique oven. I’d know it anywhere.Cannabis was all over our house. Raw plants bulged from oversize garbage bags or cured on wire racks until the leaves crumbled in my fist with an autumnal crunch; sticky buds left fairy-dust crystals on coffee tables; avocado-green dust billowed around my dad’s lanky frame as he ground marijuana in a food processor and then cranked it through a flour sifter with a chk-ah, chk-ah rhythm.No, I didn’t totter around stoned. Consuming marijuana was grown-up stuff—like balancing a checkbook or watching the nightly news. Cannabis was so ubiquitous that it lacked mystique. The chocolate was more appealing. As a reward for keeping my fingers out of the spiked batter, my parents often made a pan of kid-friendly brownies for me.After my parents divorced when I was nine, I started helping my mom bake. She wasn’t meticulous in the kitchen. Our baking sessions were slapstick, like Lucy and Ethel trying to bake bread on I Love Lucy. I can still see my mom splattered with chocolate, eyebrows scrunched with laughter, eyes gleaming. Thinking back on it, I wonder if we were messier than strictly necessary. Maybe we went overboard because we needed to laugh.The heart of our home was my mom’s king-size bed, nicknamed “the barge.” Longtime customers would climb aboard, nibble a brownie, and float with us for hours—unpacking relationship problems, telling stories, grieving.Recently, someone posted a lovely tribute to Brownie Mary in a nostalgic Facebook group. A long comment thread followed. People shared memories of Mary, her kindness, her delicious ganja treats.I couldn’t help but notice that a few of the comments were actually about Sticky Fingers. One woman wrote, “I had PLENTY of her brownies back in the day. She had that storefront in the Mission, and every Friday we would gather a group, and everyone would grab a dozen. The first and best edibles ever, and they were pretty affordable as I recall too, I think 20 or 25 a dozen!! The bags used to have cute sayings on them too, I may have one in storage. RIP Mary.”I decided to respond only because her memory is so specific (and my mom is not dead). “You’re thinking of my family’s business,” I wrote. “Sticky Fingers Brownies.”The commenter seemed dubious. “Ok,” she wrote, “I know how I can tell for sure. What was the last message printed on the paper bags when they closed?”That’s easy: Give it up and you get it all.Next thing I knew, she was messaging me to ask for the recipe. Sure, she could buy all kinds of cannabis products at legal dispensaries now. But as she put it, “The good old days of edibles have changed.” The Brownie Mary/Brownie Lady confusion pops up regularly, though I almost never say anything. They were part of the same zeitgeist. And if my mom slipped through the cracks of history, that’s just fine.It means she got away with it.The one and only Sticky Fingers Brownies' recipe:Courtesy of Meridy VolzFrom Home Baked: My Mom, Marijuana, and the Stoning of San Francisco by Alia Volz.Explore Bon AppétitCannabisHealthyishessayRead MoreLifestyleThe Healthyish Guide to Cooking With, Eating, and Truly Enjoying WeedGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Alia Volz"]}