{"id": "8a384d94a84a9f82c7745e1d5f86b5cc", "url": "https://www.bonappetit.com/story/keitra-bates-marddys-atlanta", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Keitra Bates and Other Black-Owned Food Businesses Are Banding Together to Survive—and Thrive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn Gentrifying Atlanta, Black-Owned Food Businesses Are Banding Together to Survive—and ThriveKeitra Bates lost her restaurant due to a rent hike. Now she’s fighting to protect other Black entrepreneurs from the same fate.By Hilary CadiganFebruary 22, 2021FacebookTwitterEmailMarddy's founder Keitra BatesPhoto by Emma FishmanFacebookTwitterEmailDriving her minivan through Atlanta’s historic West End, Keitra Bates points out the signs of change. There are patterns, she tells me, when it comes to determining which houses are occupied by long-term Black residents and which ones belong to the mostly white newcomers. Patterns you might not notice if you don’t know what to look for.“This one kind of throws you off,” she says, nodding toward a squat gray bungalow. “’Cause you’re like, ‘That’s an inside couch, out on the porch. Maybe it’s not gentrified?’ But then you see the Prius, and then you see the landscaping. And you’re like, ‘Oh, okay. That’s more like it.’”Through the passenger window, riding past block after block patchworked with renovations and “For Sale” signs, I begin to notice the patterns too. Soon they become impossible not to notice. “Yep, the colors of gentrification,” Bates sighs. “Blue houses, gray houses, yellow doors, red doors. It’s like a smoke signal.”We pull onto Ralph David Abernathy Boulevard, the neighborhood’s commercial artery. “Now look there,” Bates says. “African hair braiding, wig shop, fried fish, chicken wings. There’s a guy selling oils out of a tent.” She smiles and waves to him. “My response to anybody who’s like ‘this is just a neighborhood’ is, ‘okay, well, guess what, according to the census this is a Black neighborhood, because we are 87 percent of the people that live here. A wing shop is not just some whatever nothingness. These are the places that let us know where we are.”A former rail crossroads not far from Downtown Atlanta, West End and its surrounding neighborhoods have been home to mostly Black residents since the 1960s, when desegregation and the civil rights movement prompted white flight to the northern suburbs. The sense of community is strong, which is notable in a city with a long history of segregating neighborhoods with racially motivated highway construction and redlining. (West End’s northern border is Interstate 20, which in the late 1950s was purposefully plotted as a “boundary between the white and Negro communities,” according to then mayor Bill Hartsfield—co-namesake of the world’s busiest airport.)Today, the area still boasts the oldest and largest consortium of historically Black colleges and universities in the country, one of the nation’s oldest and largest Black-owned bookstores, a multitude of urban farming initiatives, and a thriving network of Afrocentric plant-based restaurants. There’s Soul Vegetarian, a cozy cafeteria that’s been doling out black-eyed pea burgers and veggie gyros since 1979; Tassili’s Raw Reality, where you can order a shockingly tasty kale wrap the size of your forearm; and relative newcomer Slutty Vegan, a food truck turned brick-and-mortar phenomenon where people wait hours in line for jazzed-up Impossible Burgers topped with sweet jerk plantains and vegan bacon.Marddy’s vendor Desmond Miller, a.k.a. Chef Boss Hog, created his dairy-free, nut-free, soy-free Yes Chef Vegan Cheese Sauce so that even folks with allergies could share in the creamy, cheesy goodness we all deserve.\nPhoto by Emma FishmanOver the past decade, however, migration patterns have reversed and white folks have returned to the neighborhood in droves, buying up hundred-year-old Craftsman bungalows to flip or inhabit. Property values have doubled or even tripled, which is good for people trying to sell, but bad for renters who want to stay, thanks to the property taxes and rental prices that balloon as a result. The emergence of the BeltLine, Atlanta’s “glorified sidewalk” (or “river of gentrification,” if you ask Bates), which opened its Westside Trail at the end of 2017, has sped the deluge. And with a kind of chicken-or-the-egg synchronicity, businesses catering primarily to new white residents have popped up with a quickness, replacing what was there before under the coded banner of “revitalization.”Bates, a mother and former schoolteacher who has lived in the neighborhood for more than a decade, doesn’t begrudge the newcomers themselves, but knows the changes they bring all too well. A sudden rent hike from new owners is what forced her to close her restaurant, Westview Pizza Cafe, back in 2016. And the resulting period of reflection—about culture and community and visibility and displacement—is what led her to buy a new piece of property in Ashview Heights, a small neighborhood that abuts West End’s historic district to the north, the following year. Knowing that properties like this one weren’t going to stay affordable for long, the purchase was Bates’ way of staking claim before it was too late—not just for her but for the Black community as a whole.Today, that property is Marddy’s (short for Market Buddies), a shared kitchen, marketplace, and education center for Black food entrepreneurs. Here, Bates nurtures the kind of under the radar commerce that has long characterized Black communities around the country. Mothers who cater as a side hustle while their kids are at school and cookie bakers who set up shop in beauty salons and barbershops. Teasha Chestnut of Sugarholic Desserts, who sold her colorful Caketinis out of the back of her car before joining Marddy’s; Georgette Reynolds of Juiced Up Inc, who found customers for her fresh-pressed elixirs at the gym. “These fledgling bootstrap business owners are the keepers of our culture,” Bates says. “They are sustainable as long as you don’t disrupt the system, but the second you come in and close a barbershop, well, now you’re messing with their business model.”When her son was diagnosed with Autism Spectrum Disorder, Georgette Reynolds turned to fresh-pressed juices as way of maintaining healthy gut bacteria to aid in his wellness. Today, as a Marddy’s vendor, she helps others do the same with her company, Juiced Up Inc.\nPhoto by Emma FishmanNikishka Iyengar, founder and CEO of the Guild, an Atlanta-based social enterprise focused on community-led real estate development, concurs: “The people making products out of their homes or cars are also the people who might not otherwise have the means to do it in the most institutionalized, professionalized way, so they’re the first to get displaced from an income and wealth standpoint,” she says. “A place like Marddy’s changes that.”Atlanta is by no means the only North American city in the throes of rapid displacement. According to a 2019 report published by the National Community Reinvestment Coalition, New York City, Los Angeles, Washington, D.C., Philadelphia, Baltimore, San Diego, and Chicago account for nearly half of the country’s gentrification. The patterns of West End mirror those of these other major cities, where shifting populations (namely, wealthy people moving into poorer urban areas) disproportionately displace Black and Latino residents.This makes Bates’s work to preserve West End’s cultural legacy that much more powerful, Iyengar says. “Yes, there’s the physical displacement of Black people that happens with gentrification. But because of that, there’s also cultural erasure, where the Black-owned restaurant is replaced by the brewery or some other culturally white place.”In 2017, at the West End’s southern border, the Atlanta branch of Dallas-based company Stream Realty opened a 23-acre mixed use property called the Lee+White Food and Beverage District. Here, you’ll find a collection of breweries, a distillery, a kombucha bar, and shops selling gelato and artisanal pickles. Its website makes much of “supporting local businesses” and “growing community.” Yet soon after the opening, when I asked co-managing partner Ben Hautt if any of the businesses are owned by Black people, he paused so long I thought the line had gone dead. “No,” he finally said.“I call it bro-based gentrification. Nothing is meant for the people there already. It’s meant for the people who are coming.”The property has since been sold to a different firm, Ackerman & Co., but the demographics remain much the same.King Williams, an Atlanta-based journalist and documentarian who has been studying the effects of gentrification on the city for more than a decade, has his own name for this particular phenomenon. “I call it bro-based gentrification,” he tells me. Those breweries and restaurants geared toward “replicating that college feel” that mostly white, educated newcomers enjoy. “They’re essentially frat houses,” he says. “Nothing is meant for the people there already. It’s meant for the people who are coming.”Louis Deas, a 31-year-old Morehouse College graduate who left his nonprofit career to become a Marddy’s vendor, understands why the changes have happened but has mixed feelings about the results. Ultimately, he concludes, you can’t fight progress. But you can be strategic about keeping your cultural heritage intact. “Keitra is a business owner, but she’s still blackity-Black and she’s not going to change. I appreciate that. It helps me know what progress can look like for our city.”Inspired by his grandparents and their bountiful backyard pecan tree, Marddy’s vendor and Deas Nuts founder Louis Deas coats his cashews, almonds, and pecans in addictive dessert flavors like cinnamon sugar and red velvet.\nPhoto by Emma FishmanBates says intentionality is more important now than ever, “with things all the way down to paint colors as representations of our culture. Because if not, we lose visibility.” And if they lose visibility, well, there goes the neighborhood.I found a clear example of this paradigm in two separate conversations with Bates and Hautt describing the same strip of property along White Street, where the Lee+White development now stands. When I asked what had been there before, Hautt, the developer, replied: “We had a tire retreader; a guy selling 60 socks for $5; we had basically like a—I don’t know how to describe it, but a used junk store.” He laughed. “Basically the people that drive around on trash day and grab a bunch of stuff. That guy compiled all of it in there and then would sell the working stuff. I mean, we had just a total mess. It took a long time, but we cleared that out entirely.”Asked the same question, Bates said: “There was nothing but Black businesses and warehouses here. For years, this place was where you’d go and get socks and white tees, and then one day all of a sudden you see ‘going out of business, everything must go.’ There was an importer of shea butter and black soap, things that Black people like. Gone.”Painted on Marddy’s exterior wall is a mural by Atlanta artist Fabian Williams, who goes by the moniker Occasional Superstar. The young, wide-open faces of Bates’s son and Fabian’s daughter are surrounded by a tableau of older folks, hands cupped around their mouths like they’re telling secrets, skin painted in swirling Day-Glo pinks, greens, and blues. These are those ancestors, Bates says. The ones Marddy’s honors by refusing to disappear. “Our mission is to make sure we have a permanent place. That no matter how much this neighborhood changes, we never have to seek permission to exist.” The building itself was erected in 1949 by a woman named Leila Williams, who turned it into one of the few full-service Black-owned restaurants in Atlanta at the time. For almost 40 years, Leila’s Dinette served steaming plates of fried chicken and greens to locals and icons like John Lewis and Spike Lee. After that it was a fried fish shop and later a convenience store. “As far as I know, it has always been owned by Black people,” Bates says. “There’s a lot of power in this space. You can feel it.”When she was first starting out, Georgette Reynolds sold her fresh-pressed juices, wellness shots, and cleanse packages at the local gym; now, thanks to help from Marddy’s, she’s able to ship them all across the country.\nPhoto by Emma FishmanThe building’s remodeled interior is bright and cozy: cream walls, potted palms, blonde wood shelving lined with old photos. Williams’s original lunch counter remains at the center of it all, and a painting gifted by her goddaughter Charlotte Riley Webb hangs on the wall. Until she passed away this month, Williams herself lived in a nursing home across town; in November, Bates joined the family in celebrating her 108th birthday.Once cooks are accepted into the Marddy’s program and have completed the coursework for their food safety certificates (which Bates helps them acquire at a reduced rate), they get access to the kitchen and other resources for $15 per hour, about half the average rate for other shared kitchen spaces. The certification is an important step toward legitimizing these homegrown businesses in a commercial sense, allowing them to take on larger catering jobs and sell their food in more formal settings.Marddy’s vendors Cris Ravarre and Megan Leigh of RAVARRE+CO offer catering, meal-planning, small-batch plant-based spice blends, and dehydrated fruit garnishes for making fancy cocktails at home.\nPhoto by Emma FishmanFor Louis Deas, these practicalities were important, but it was Bates’s bold mission that ultimately drew him to Marddy’s. His company, Deas Nuts (pronounced “deez”—get it?) was inspired by his grandparents, who used to box up pecans from a tree in their backyard and send them to family members as gifts. Marddy’s offered the affordable commercial kitchen space he was looking for—and so much more. “It’s an incubator that’s specifically tailored for food entrepreneurs, but it’s not just about the money,” he says. “Keitra empowers us to give back to the community where we live in similar ways that she herself has given back.” That’s why, as Deas expands his business model from candy-roasted nuts (red velvet pecans! cinnamon sugar cashews!) to coffee and nut milks, he’ll also factor in ways to donate a portion of his proceeds to charity.Marddy’s, then, is a disruption to the disruption—this kitchen, with its giant Hobart mixer and a gleaming six-burner stovetop, is a place where Deas can roast his nuts and partners Cris Ravarre and Megan Leigh of RAVARRE+CO can mix up their small-batch herb blends without worrying about rent hikes or displacement. It’s a place where Bahamian caterer Vera Browne of V’s Taste of 700 Islands can develop her grandmother’s famous coconut and pineapple tarts into a frozen product line and chef Desmond Miller can come up with a business plan for getting his vegan cheese sauce on grocery store shelves.“At Morehouse,” Deas says, “I was really involved in activism, but so many of my heroes died poor or broke. Keitra showed me I didn’t have to make a choice between being impactful and being stable and successful.”Bahamas-born caterer Vera Browne has been whipping up coconut and pineapple tarts from her grandmother’s traditional recipe for decades. Marddy’s helped her develop V’s Taste of 700 Islands, a line of frozen, ready-to-bake mini tarts she’ll sell nationally.\nPhoto by Emma FishmanAtlanta has long been a majority Black city with a history of Black leadership and activism, nationally resonant cultural output, and its newest claim to fame—turning Georgia blue. But Iyengar points out that Black majorities have dwindled in other cities, like Oakland and D.C., as a result of thoughtless development. Even here in the so-called Black Mecca, Black residents are being pushed to the suburbs and even out of the city entirely; West End is just one example of a historically significant Black neighborhood experiencing that uncertainty firsthand.In fact, other areas, like Atlanta’s Old Fourth Ward—the birthplace of Martin Luther King Jr.—are much further along in what can feel like an inevitable process. There, gentrification began in the 1980s, but the story was the same: new development leads to skyrocketing property taxes leads to rapid displacement of a historically Black community. Now the neighborhood is less than half Black—a fate that Bates, Williams, Iyengar, and others fear could befall many more Atlanta neighborhoods if flashy food halls appealing to wealthy gentrifiers continue to be the norm.But must notions of “progress” always lead to displacement and cultural erasure? Or could there be such a thing as good development—the kind that benefits long-term residents rather than steamrolling over them? In a South Atlanta neighborhood just 10 minutes from Marddy’s, a massive new project called Pittsburgh Yards hopes to answer that last question in the affirmative.“We want a space that will reinvigorate the community, not ‘revitalize’ it or redefine it.”The project is a partnership among the Annie E. Casey Foundation and local real estate companies including Columbia Ventures, a leader in the affordable housing field. (It should be noted that Stream Realty, the company that originally developed Lee+White, has stake in the project too.) At first glance, the 31-acre mixed-use complex, located alongside the BeltLine’s soon-to-be Southside Trail, looks a lot like other developments in Atlanta: a series of sleek white edifices with big industrial windows, a shipping container marketplace, a centralized grassy lawn. But unlike Lee+White or Ponce City Market or the rest of the city’s new retail juggernauts, this space will include low-cost shared workspaces for local residents (starting at $350 a month) and apartments priced at 60 percent of the area median income.“The idea was that it needed to be evident that we appreciate and respect existing residents and businesses, and that we want a space that will reinvigorate the community, not ‘revitalize’ it or redefine it,” says Erika Smith, AECF’s Senior Associate of Economic Opportunity and a key player in the Pittsburgh Yards project. With an impressive résumé of equitable economic development work under her belt, Smith is clear about the coded buzzwords so often attached to big developments like food halls and breweries. “We see often, with developments that are targeting Black and brown communities, that they’re attracted to the low cost of land or building, but they don’t see the existing community as an asset. They will curate their business tenants to essentially attract new homeowners, which results in increased property values and a new demographic mix.”Pittsburgh Yards aims to do the opposite, Smith says, by making hyper-local community engagement a core tenet. The development team hosts monthly meetings for local business owners and residents, with committees focused on art and history and entrepreneurship to give residents “a sense of agency and ownership.”It’s no coincidence then that Bates is in talks to become one of the development’s anchor tenants, which would come with a new 2,000-square-foot commercial kitchen, café, and marketplace for Marddy’s vendors. “The attraction to Marddy’s is that it’s a Black-owned business rooted in the community and committed to addressing food entrepreneurs’ needs,” Smith says. “It’s a business that’s cultivating other businesses and harnessing the economic power that allows funding to circulate within the community.”“After joining a commercial kitchen and receiving guidance from Marddy’s, we were able to catapult our name and brand reputation by working directly with the community,” says Cris Ravarre of small-batch spice company RAVARRE+CO.\nPhoto by Emma FishmanBates, for her part, is thrilled by the possibility of a partnership. “This is how development should be,” she says. “This is development for all—including the people who are already here. I want [Pittsburgh Yards] to be a flagship, a beacon, a prototype. Proof that you can get it done without everybody losing.” In the new space, Marddy’s would be able to significantly increase its number of vendors (from the current dozen to 30 or more) along with exposure and sales, because Pittsburgh Yards has built-in retail space, with indoor-outdoor café seating and regular business hours. “It means double the impact,” Deas says.As far as Smith knows, Pittsburgh Yards’ approach is unique not just to Atlanta but the country at-large. But she believes it can and will be used as a model for other cities and neighborhoods. “I think we have the opportunity to demonstrate the value of being a people-centric, mission-related design,” she says. This approach could help not only gentrifying boomtowns like Atlanta but low-to-middle income cities, like those along the Rust Belt, suffering from stagnation and disinvestment—a problem both highlighted and significantly worsened by the COVID-19 pandemic.Giving communities a say in the development of their neighborhoods is not just ethical but smart business as well, Smith says. For example, if residents say they need an affordable grocery store, building one offers an immediate financial advantage to developers—a built-in, localized, and loyal customer base. Strong local brands that already have a following, like Marddy’s, also act as a destination for those outside the community while still reflecting the community’s values. Paired with affordable office and retail space that prioritizes local residents (a studio for a fledgling music producer, a shipping container stall for a small ice cream business), the development becomes a business that investors see as worthy.Of course, notes Iyengar, there are drawbacks to any major development, no matter how good its intentions, and some local organizers in Pittsburgh have doubts about the project’s long-term benefits. “Any time you create value in a neighborhood, property prices go up, and when property prices go up, that’s usually a signal for displacement,” she says. And because private developers will profit from Pittsburgh Yards, the project does not challenge traditional ownership structures in a way Iyengar believes to be radically transformational. (Iyengar herself is working on a smaller mixed-use development in South Atlanta’s Capitol View neighborhood called Groundcover, which through a unique collective ownership structure will put equity entirely into the hands of local residents rather than any developers at all.)But still, considering how large and ambitious Pittsburgh Yards is, Iyengar feels cautiously optimistic. “In an ideal world, we’d completely dismantle capitalist systems, and maybe that’s possible in the future,” she says. “But a lot more intentionality and thought has gone into this project than any other development I’ve seen. It paves the way for a better kind of development.”Only time will tell how Pittsburgh Yards fares in the coming months, years, decades, and what changes it will bring in the long-term. But the seeds it has planted—the very idea that Big Development can have a conscience—paired with its interest in partnering with grassroots organizations, is not insignificant. “The Casey Foundation is a behemoth,” Bates says. “You can’t ignore their power or their presence, and they’re in a position to work with partners like Marddy’s that are not willing to be quiet about displacement or gentrification or disrespect for what our ancestors have done.”V’s Taste of 700 Islands mini tarts come in coconut and pineapple and will soon be sold on grocery store shelves.\nPhoto by Emma FishmanSince the pandemic hit last spring, Marddy’s, like most businesses, has been forced to adjust. Gone are the large-scale catering gigs that once brought significant income to their vendors (Bates is now planning to install a carryout window at the original West End location so vendors will have a safely distanced retail space). Negotiations on the Pittsburgh Yards expansion are taking longer than expected, though Bates is hopeful that the new space will open by early summer. But in the wake of challenges, new opportunities have sprung up.This past summer, Marddy’s partnered with an urban farming initiative for the low-income community of Thomasville Heights. Students there, in partnership with students from a wealthy private school called Paideia, harvested vegetables together from a collection of Black-owned urban farms. Marddy’s chefs then took the produce and turned it into healthy boxed meals not just for Thomasville Heights students but for their families as well. “We were producing 1,800 meals a week out of 1,600-ish pounds of local fresh produce from Black farmers,” Bates says. “It was by far one of our proudest moments. Our vendors could earn money while helping families that needed it.”In a changing world, where inequity is a constant yet ever moving target, perhaps there is no better illustration of what Marddy’s is all about than this: tackling systemic problems with mutually beneficial, small-but-scalable initiatives that just make sense. Being the connective tissue that bends but does not break.“It proves that it’s possible to get past bureaucracy and red tape when people are really determined,” Bates says. “When people are really determined, we can do anything.”Want to help support Marddy’s? Click here.This story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-22", "author": ["Condé Nast", "Hilary Cadigan"]}