{"id": "8a4baaafa407ad0aa54a1d2aaba60318", "url": "https://www.bonappetit.com/story/never-fail-whole-fried-fish", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "This Entry-Level Whole Fish Recipe Made Me Who I Am Today | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Entry-Level Whole Fish Recipe Made Me Who I Am TodayI overcame my fear of cooking whole fish by—you guessed it!—making this whole fish recipe. Wow!By Alex BeggsAugust 16, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I’m not sure why people buy expensive throw pillows or work 80 hours a week when you can impress people just as much by cooking a whole fish. A whole damn fish! WOW!That includes impressing yourself, Lonely Joe. On a Thursday.I love the ceremony of it all. The shiny scales, the actual head, the tender meat, the requirement to own a platter, the interactive picking-around while eating that slows things down a bit. (When did we start eating so fast anyway?)Reasons that might be keeping you from cooking a whole fish at home: Bones. The actual head. The big, weird shape. The fishy smell that threatens to take over your entire living quarters. It seems hard. It seems mysterious. It seems expensive.Well, I'm here to tell you: RELAAAAAAX! Did you know the fishy smell can go away? (It’s called incense and an open window.) The bones, yeah, you might be dealing with some of those (more on that later!), but again, it slows you down and makes you appreciate every bite. Regarding size, you get to pick the fish with your own eyes, so just get a small guy, something that you know will fit in a pan you own, like branzino or red snapper—don’t overthink it. The head, well, the head just sits there, judging you! You don’t have to pluck out the eyeballs and eat them like Skittles, but you definitely can. You can tease out the cheek flesh and brag to everyone at the table that it’s the best part, actually. The cost really depends on your store and the type of fish, but it’s still cheaper than steak, so there's that! And mysterious? With this whole fish recipe, it won’t be anymore.Fried Whole Fish with Tomatillo Sauce. Sounds fancy, no? But it’s from our Simple Issue a few summers ago, which required every recipe to be under five ingredients (not counting salt or cooking fat). It also sounds fried as in \"deep-fried,\" but it’s a shallow fry (and it’s less scary in your Dutch oven versus the called-for cast-iron skillet), and when I had only a cup of oil instead of three, it still totally worked. Fried here = crispy skin all around, fast cook time. The whole fish-frying process takes around 8 minutes. Yep.You heat oil until it’s shimmering, and then lower the fish in slowly, head first (you’re holding it by the tail.) Maybe the tail is out of the oil, no big deal. It sizzles and fries for four minutes-ish, until the skin on the bottom is browned and crispy. Then get in there, Operation-style, with a fish spatula (aka the only spatula you need) and tongs and slowly turn it to the other side. While you’re standing around, use your time wisely and baste hot oil onto the fish head and tail, which makes sure that those get some love if they're not making direct contact with the oil.That’s the fish part. You’ll grab it out with the spatula + tongs technique, and put it on a wire rack to stay crispy, sprinkling it with salt. (I honestly think I've skipped that and put it on a cutting board, and everything was just fine.)Pickled jalapeños, FTW.\nChristopher TestaniPart two is a ridiculously easy, lime-green sauce that doubles as salsa. I make this recipe on its own all the time: tomatillos, cilantro, pickled jalapeños and some of their juice. Blended, done. (I’ve also riffed on it by adding a clove of garlic, and fresh jalapeño instead of pickled for more heat—do you!)SERVE TIME. If you’re entertaining, serve the fish on a platter of the green sauce alongside a kitchen towel stuffed with warmed tortillas. For my nuclear family, we do side bowls of green sauce so we can spoon it on every bite, or uh, just dip the fish right into it. Everyone will say things like: Such crispy skin! Tender, moist fish! Spicy, bright and zesty sauce! Pass me another tortilla!Okay: About those bones.You don’t need to know the names for the parts of the fish, but it’s true, cutting into this thing is awkward and messy. Sometimes I don’t have time for ceremony and we hack into it, grabbing chunks of fish flesh, every woman for herself. If you’re serving this to 80-hour workweek dinner guests, watch a few YouTube videos and then slice it all nice. Basically you make a cut between the head and the rest, another cut down the top, and you can do a third down the center, where the spine and THOSE BONES are. You pull up the skin and can spoon the flesh off the spine, taking note of the bones that might be coming with. You can even remove the head, pull the spine out of there entirely, and serve only the cut fillets, which is very restaurant-y of you. This is where the medium of video, with its revenue-generating mid-roll ads, is better than any written description.But know this: It’s NOT A BIG DEAL, and YOU’VE GOT THIS!!Get the recipe:Fried Whole Fish with Tomatillo SauceCutting those slits in the fish is key. They help the fish cook more quickly and make it easier to tell when it's done.View RecipeExplore Bon AppétitNever FailFishWeeknightTomatilloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-11", "author": ["Condé Nast", "Alex Beggs"]}