{"id": "8a550e57e81bab2e4565f70e624bf907", "url": "https://www.bonappetit.com/story/cake-stand-punch-bowl", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "I Thought This Cake Stand Would Be a Waste of Space, But I Use It for Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought This Cake Stand Would Be a Waste of Space, But I Use It for EverythingDid I mention it’s also a punch bowl?By MacKenzie Chung FeganOctober 14, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Like an expensive blender or a fondue set, a cake stand is an aspirational purchase. “Soon,” you whisper softly, “soon I will be the type of person who bakes layer cakes with frequency and nonchalance.” Months later, the cake stand sits, still inside the box, a sharp reminder of your unrealized ambition.So when friends gifted me an Anchor Hocking cake stand, I thought for sure it would end up on the curb. Eleven years later, I am here to tell you that it is one of the most useful pieces of servingware I own.It does, of course, come in handy on the two occasions a year when I actually do bake a layer cake. The cloche protects my hard-won frosting from smudges and smears as I move the stand from counter to refrigerator to table. It’s also ideal for the humbler cakes I bake with more regularity, keeping pumpkin loaves and banana breads moister longer. But cake stands aren’t just for cakes! Use it in any serving situation where you need a little drama. While you could simply present your cheese platter on a series of plates and cutting boards, add some height with this stand and all of a sudden you’re hosting.However, the best part of this specific cake stand, the thing that compels me to recommend it not just to bakers but to anyone who throws the occasional party, is that it doubles as a punch bowl. Simply turn the base upside down and place the dome inverted on top. It immediately elevates a gathering—even if gatherings these days consist of two friends on the other side of a firepit. My only regret is that, when my cake stand is in use as a punch bowl, I can’t use it to display cheese and charcuterie. Maybe it’s time for a second one...Anchor Hocking Cake Plate With Dome$41 at AmazonExplore Bon AppétitShoppingCakeHighly RecommendPunchRead MorecookingThis Ingredient Makes Any Cake Look Like It Came From A Fancy BakeryBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-14", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}