{"id": "8a6f30a5d1dcce507d551de74ba00ab2", "url": "https://www.bonappetit.com/recipe/grape-tarragon-spritzer", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Grape-Tarragon Spritzer Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueGrape-Tarragon SpritzerBy Bryant Terry August 10, 20215.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintThis flavorful drink is perfect for a fall garden party. The idea for it came about after I used frozen grapes from our freezer to cool down some sparkling water since we didn’t have any ice. The anise-like flavor of tarragon syrup goes well with sweet, refreshing grape juice. Topping off the concentrate with sparkling water and adding frozen grapes makes it a modern, fun treat. —Bryant TerryAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonSmall Saucepan$155 At AmazonSieve$18 At AmazonCitrus Juicer$7 At AmazonIngredients4 - 6 ServingsTarragon Syrup1cup raw sugar¼cup (packed) finely chopped tarragonSpritzer1½lb. seedless red grapes, preferably organic3Tbsp. fresh lemon juice4cups sparkling water, chilled until almost frozenTarragon sprigs (for serving)PreparationTarragon SyrupStep 1Heat raw sugar, tarragon, and ½ cup water in a small saucepan over low heat, stirring, until mixture is hot to the touch and sugar is dissolved, about 3 minutes. Let cool, then strain through a fine-mesh sieve into an airtight container or small bowl. Cover and chill until cold, at least 30 minutes.Do ahead: Syrup can be made 1 week ahead. Keep chilled.SPRITZERStep 2Freeze one third of grapes on a large plate until frozen solid, about 3 hours.Step 3Purée remaining grapes in a blender until mostly smooth. Strain through fine-mesh sieve into a pitcher, pressing on solids to release as much juice as possible; discard solids. (You should have about 1¼ cups juice.)Step 4Stir in lemon juice and ¼ cup tarragon syrup. Pour in sparkling water and stir gently to combine. Taste and add more syrup if needed to sweeten further.Step 5To serve, place a handful of frozen grapes in each glass, pour in spritzer, and garnish each with a tarragon sprig.Adapted with permission from Black Food: Stories, Art, and Recipes From Across the African Diaspora by Bryant Terry (4 Color Books). Copyright © 2021.\n\nBuy from Amazon or Bookshop.orgHow would you rate Grape-Tarragon Spritzer?Leave a ReviewTell us what you thinkExplore Bon AppétitCold DrinkDrinks AllTarragonHerbs & SpicesGrapeFruitFallSummerEasy5 Ingredients or FewerDrinksVeganVegetarianNonalcoholicSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Bryant Terry"]}