{"id": "8a706ab00e51678e49a7061a5175126e", "url": "https://www.bonappetit.com/recipe/loaded-sweet-potatoes", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Loaded Sweet Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueLoaded Sweet PotatoesBy Chris MoroccoDecember 26, 20184.5(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe like to roast the sweet potatoes ahead of time then rewarm them by flattening and crisping them in a skillet until lightly charred. This recipe calls for two, but feel free to make extra. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right. It's pictured above on a plate by ceramicist Helen Levi.Ingredients2 servings2small to medium sweet potatoes5Tbsp. extra-virgin olive oil, dividedKosher salt½cup black lentils (but let’s face it, you can use any kind you like and feel free to make lots extra)¼cup unsalted peanuts, coarsely chopped½tsp. crushed red pepper flakes1Tbsp. fresh lemon juice1½cups sliced citrus fruits from peeled grapefruit, oranges, and/or clementines¼cup crumbled fetaCilantro leaves with tender stems (for serving; optional)PreparationStep 1Preheat oven to 400°. Roast sweet potatoes on a small rimmed baking sheet until skins are browned and potatoes are tender all the way through, about 45 minutes. Remove from oven and, using a heavy spatula or small pot lid, smash potatoes, then drizzle with 1 Tbsp. oil; season with salt. Continue to roast until flesh is lightly browned, 12–15 minutes longer.Step 2Meanwhile, cook lentils in a small pot of boiling salted water until tender, 20–25 minutes. Drain and transfer to a small bowl. Let cool until just warm. Add 1 Tbsp. oil, season with salt, and toss to combine.Step 3Heat peanuts and 3 Tbsp. oil in a small saucepan over medium. Cook until peanuts are toasted and golden brown, about 2 minutes from the time they start bubbling. Transfer to another small bowl. Add red pepper and a pinch of salt; let cool. Stir lemon juice into peanut dressing just before using.Step 4Top sweet potatoes with lentils, citrus, and feta. Drizzle with dressing.Step 5Do Ahead: If you want to roast sweet potatoes ahead of time as part of your meal prep, let cool, wrap in foil, and chill up to 4 days while they’re still intact, then smash and reheat in olive oil in a nonstick skillet over medium heat until crispy on both sides.How would you rate Loaded Sweet Potatoes?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleLove this dish!!! It’s on repeat in my kitchen!Isabel9/13/2021dish tasted fine but was more work than I think it was worth it. Cécile5/19/2021Delicious!!! I have been preparing this recipe since you first posted it. It is what’s for dinner this evening. I’m cooking the sweet potatoes and lentils this morning and going on a nice long hike. When I’m ready to assemble for dinner it will take only 15 minutes. SuzanneArkansas 4/5/2021This recipe was definitely out of my comfort zone. The mix is rather different, however I did enjoy it. I followed another reviewer’s advise and added the lemon juice after taking it off the heat. The peanuts were probably the best part. I probably wouldn’t make it again, but still worth trying. PAPhiladelphia3/30/2021This was pretty good, and not too complicated. I made it for lunch on a day when I didn't have a lot of work. I enjoyed it, my boyfriend said it was \"like a Chopped basket\" (he's not wrong) but he still ate the whole thing.XTBrooklyn, NY12/19/2020Trying to do more vegetarian and though this recipe seemed like an unusual combination of ingredients was intrested given the high rating and positive reviews. Quite glad I tried it. Flavors came together nicely and was pretty quick & easy to make - made for a real satisfying & filling meal (that's saying a lot, coming from a meat-loving eater!). Next time will probably up the red pepper flakes otherwise will keep the recipe as-is. fitzrobAustin, TX8/4/2020Question: I detest sweet potatoes. Is there a good regular potato to substitute? Waxy or floury?LaReineOntario, Canada6/20/2020Just made this for dinner for my family. I used a tin of canned lentils and flavoured them with lemon, 2 tsp coriander powder, 1 tsp paprika, 1tbsp lemon juice and a garlic clove. V nice and good if you've got lots of cans lying around. \n\nCooked sweet potatoes for 45 mins and they were perfect. I poked holes in them before baking which helped.\n\nOverall yummy and easy recipe. Will definitely do it again.!AnonymousLondon UK5/2/2020I made this the other night and thought it was very good.  Nearly a pantry recipe in our house.  I had French green lentils so that's what I used.  I also had some fresh Mandarin oranges.  The citrus lightens up what could be a pretty heavy dish.   I'm not a fan of feta, but bought some anyway.  Next time I think I will try Cotija.  Unlike some reviewers, I thought the mixture of textures and flavors were interesting together.AnonymousAshland, OR4/9/2020Delicious! Very different from what we normally have, but very tasty. The toasted nuts were truly delicious, and since I poured the lemon juice in right after I took the pan off the heat, it boiled and emulsified perfectly. Followed the recipe exactly—except my sweet potatoes were on the larger side, so cooked them a bit longer. AnonymousRedmond, WA3/30/2020My husband and I really enjoyed this dish. We liked all the different flavors and textures. We will definitely make this again. It's a little labor intensive but most really good dishes are in my opinion. I followed one reviewer's idea to add the lemon juice to the oil when cooking the peanuts. I also added green onions and cilantro to the dressing.  I cut the sweet potatoes in half so they would cook faster. Thanks for a great recipe!AnonymousGeorgia8/28/2019absolutely loved this recipe! I thought the flavor combos were so clever and it came together so easily as you can prep all the toppings while the sweet potatoes roast & lentils simmer away. I couldn't find black lentils so used French green ones and they came out great. I took the reviewer's advice who suggested adding the fried peanuts and lemon to a jar and shaking it for improved emulsification instead of merely stirring and that worked beautifully (also makes for easy storage if you have leftover).  I substituted cilantro for chopped green onion and parsley and found that worked just fine. My favorite part of this recipe was the addition of the peanut lemon dressing -- I so enjoyed the crunch of the roasted peanuts (also disagree with a few reviewers and feel strongly that the process of browning them on the stove top makes all the difference in bringing out the peanut flavor) on top of the roasted sweet potato -- the textures just all worked together so nicely. Great job, BA! Will be adding this to my regular weeknight dinner rotation. AnonymousRaleigh, NC1/23/2019I loved this recipe! The black lentils were worth seeking out. I used tangelos and navel oranges and the flavors melted perfectly. \nI added avocado slices and toasted some seeds (coriander, cumin, and mustard) to throw on top with the peanuts. So good! AnonymousHouston, TX1/14/2019This one was a miss for me, too! Bummer in the week of all 5 star reviews - Just wasn't coming together flavor - wise for me. I normally love all the combos y'all throw at me but this one didn't work. Stoked that sweet potatoes are so cheap so at least I didn't spend too much. To each their own though! Still big love for all the FGFP recipes! :)kmarxmarxchicago, il1/14/2019I thought this was pretty good! Contrary to the other reviewer I actually liked the oranges. Also used french green lentils from whole foods, couldn't find black lentils. If I gave a recommendation it'd be to pour the oil into a jar, add the lemon in the jar, and shake it up to emulsify it. Just squeezing in the lemon and stirring and pouring that over the whole thing didn't really add anything. And honestly I kind of agree that frying the peanuts didn't do much for me, it'd probably be easier for most to just combine oil, salt, red pepper, and lemon into a dressing without using any heat. AnonymousOakland1/14/2019Explore Bon AppétitSweet PotatoPotatoVegetableLentilCitrusFruitEasyWeeknight MealsMainVegetarianGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}