{"id": "8a7613b55b24532e939fbb9c43b7db74", "url": "https://www.bonappetit.com/story/nyc-misi", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Misi NYC Is All About Pasta, But I'm In Love With This Vegetable Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsNYC's Misi Is All About Pasta, But I'm In Love With This Vegetable DishMissy Robbin's new pasta spot is the hardest reservation in town, but you can make the stunning roasted tomatoes at home.By Priya KrishnaOctober 17, 2018FacebookTwitterEmailPhoto by Evan SungFacebookTwitterEmailThere are very few restaurant openings that excite me enough to set a calendar alert for when reservations go live. Misi, the new restaurant from pasta whisperer/James Beard Award winner Missy Robbins (she co-owns Lilia, the sleek Italian place where even Jennifer Lawrence had to wait to get a table) was one of those openings.At Lilia, Robbins is known for putting ambitious twists on pastas you thought you knew that somehow make them even better (pink peppercorns in cacio e pepe; saffron and honey in ricotta-filled agnolotti). At Misi, the pastas are similarly fantastic —but, for me at least, the most exciting dish on the menu is not a pasta at all. It’s a plate of roasted tomatoes.What’s so great about a roasted tomato? This very website contains dozens of recipes that involve roasting tomatoes! But this particular dish—saturated with aromatic fennel and coriander seeds, laced with chili-spiked honey, and topped with fresh basil leaves—made me immediately forget about all the other versions out there.We all know that roasting tomatoes is an excellent technique for bringing out the natural umami of the fruit. But adding the sweet-spicy element of the honey, the freshness of the herbs, and the complexity and texture of the spices somehow enhanced that umami while allowing each component to stand out on its own, flavor-wise. Also, the dish looks really pretty.Misi’s roasted tomatoes are a riff on the slow-roasted tomatoes with coriander and fennel seeds in Robbins’ cookbook, Breakfast, Lunch, Dinner…Life! My first thought looking at this recipe was: I will cook this tomorrow. One, because it felt very accessible; and two, my farmers’ market was still selling tomatoes, and this seemed like an ideal way to wring the last flavor out of the late summer supply.  Long story short: I nailed the dish.All you’re doing is slicing 12 or so heirloom tomatoes in half, arranging them cut side up on a baking sheet, seasoning them with salt, olive oil, cracked coriander, and fennel seeds and roasting them for two hours in a 275° oven. When they’re done, they should have shriveled along the edges, but they should still be juicy and retain some of their bright color. I arranged the tomatoes in my nicest-looking plate (because, you know, this is a presentation-forward dish), and drizzled them with about a tablespoon of hot honey (if you don’t have hot honey, it’s very easy to make yourself), then I scattered basil leaves on top.And that’s it! I planned to eat my tomatoes over toast, but they were so good that I forgot about anything else and polished them off in about five minutes. That said, these tomatoes would make for a great sandwich filler, pasta base, or dip (just throw them in the blender).But, for now, I’ll be making and eating these on repeat...long after tomato season is done.Explore Bon AppétitHealthyishBrooklynRoasted VegetablesTomatoRestaurantsNew YorkRead MorerestaurantsHow One Chef Trades Pasta For Produce... Some of the TimeBy Missy RobbinsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Priya Krishna"]}