{"id": "8a76713eb583982ae093c2f9f8da68e8", "url": "https://www.bonappetit.com/recipe/roasted-sweet-potatoes", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Roasted Sweet Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Sweet PotatoesFirm yet tender veg is simply a matter of getting the quantity, time, and temperature right—and this roasted sweet potato recipe has all three.By Rick MartinezPhotography by Alex LauDecember 16, 20204.0(55)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintEditor’s note: This recipe was originally published on November 12, 2015.We could never get tired of this roasted sweet potatoes recipe. Sweet potatoes are incredibly versatile as a side dish for whatever protein you’re serving, or as an add-on to salads so you stay satisfied for longer. What’s more, they’re easy to prepare and knock out of the park when you follow this straightforward recipe. Cutting the sweet potatoes into large pieces before roasting cuts down on cook time while also allowing each piece to caramelize but stay creamy on the inside. You can stick with salt and pepper, but this method is a blank slate for adding other flavors, too. Try tossing 2 tsp. ground spices such as cumin or coriander, or blend such as za’atar, berbere, or chili powder with the potatoes along with salt and pepper before sliding them into the oven.One word of caution: The natural sugars in sweet potatoes mean they can brown very quickly depending on your oven setup, so keep an eye out and toss them occasionally to make sure they don’t burn. Bake them this way once and roasted sweet potatoes are sure to become a staple on your table.Ingredients4 to 6 Servings3pounds sweet potatoes, peeled, cut into 1½-inch pieces¼cup olive oil2teaspoons kosher salt½teaspoon freshly ground black pepperPreparationStep 1Preheat oven to 450°. Toss potatoes, oil, salt, and pepper on a rimmed baking sheet.Step 2Roast, tossing occasionally, until tender and browned, 35–45 minutes.How would you rate Roasted Sweet Potatoes?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleWorked great. Definitely keep them full thickness! 35 min did it. I also left the skins on and stood them up sideways. Maybe that helped. The inside was sweet and yummy as advertised. Good quick recipe. If you want less crispy, you need more time to bake or steam them longer at lower temps. Kevin KohrtMinneapolis, MN1/5/2022This recipe is a winner! We've made this 3 times and is gonna be a staple in our house. The creamy texture inside with the browned outside is awesome! We added zaatar salt to it and was fantastic!Anonymous8/10/2021Is this recipe a joke. who does not know this.fr?Santa Fe, NM5/8/2021I enjoyed this recipe. I just used one sweet potato and reduced the measurements accordingly. I also put a dash of garlic powder and curry powder for some extra flavour. Yum!MiriHalifax, NS1/14/2021Loved this. I doubted the high oven temperature at first, but the potatoes came out perfectly. This will become a standard in our house.KittyAustin, TX1/1/2021I guess I didn't properly adjust the cooking time for the amount of sweet potatoes I had.  I only had one potato--so I guess if I estimate that would be about 1 lb...? Vs. 3 lbs.  And I must have also cut them into pieces smaller than 1.5 inches.  I set the timer for 35 minutes.  Totally burned.  Would be so much more helpful if recipes frequently included a way to titrate down the portions and thus cooking times.  All I know is I've roasted sweet potatoes before and I haven't burned them like this. sortofokaycookerLos Angeles 5/24/2020Not sure what I did wrong but when I wrote the great review the stars don’t reflect a 5 star rating as it should.\n\nIt’s a definite 5 I would even rate it a 10\n\nCC Texas Cassandra ColemanTexas12/25/2018Love this recipe it is super simple and very tasty!  Used it for Christmas dinner worked out perfect, my oven took a little longer, but it was great.  Took about 50 minutes.AnonymousTexas12/25/2018I would back off on the salt a scunch next time.  Otherwise, this was perfect. pols005 Tulsa 9/7/2018Potatoes came out perfect! Loved that they were a bit crispy on the outside and soft in the middle. Measurements for olive oil was on point.AnonymousTemecula, California 4/15/2018Very easy and very good. This is a staple for dinner in our house. JohnJohnsonCharlott, NC12/11/2017Explore Bon AppétitSweet PotatoPotatoVegetableEasy5 Ingredients or FewerSideGluten-FreeDairy-FreeNut-FreeVeganVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-11-12", "author": ["Condé Nast", "Rick Martinez", "Alex Lau"]}