{"id": "8a79ec916e5acbf1d6ce27b0116b177f", "url": "https://www.bonappetit.com/recipe/brown-butter-wedding-cookies", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Brown Butter Wedding Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrown Butter Wedding CookiesBy Kat BoytsovaDecember 2, 20184.5(35)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThese cookies—a richer version of Mexican Wedding Cookies, Russian Tea Cakes, and Snowballs thanks to the brown butter—are made for people who don't think they can bake cookies. You can whip up a batch with only six ingredients (!!!), and the recipe doubles beautifully, meaning you can easily make one batch to hoard and one batch to share. Plus, it's infinitely riffable. Add a pinch of warming spices like ground cinnamon or black pepper, replace the walnuts with pecans or peanuts, swap the vanilla extract for almond or orange—the world is your oyster. While this version on the All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Skillet$40 At AmazonSpatula$12.99 At AmazonLarge Bowl$18 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAElectric Mixer$40 At AmazonPlastic Wrap$9.84 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketParchment Paper$3 At AmazonSieve$18 At AmazonWire Rack$23 At BA MarketIngredientsMakes 241cup (2 sticks) unsalted butter1cup walnuts½tsp. kosher salt1½cups powdered sugar, divided2cups all-purpose flour1tsp. vanilla extractPreparationStep 1Melt 2 sticks butter in a small skillet over medium heat. Cook, stirring often with a rubber spatula, until butter foams, starts to smell nutty, and the milk solids—the sandy bits at the bottom of the pan underneath the liquid butter—are turning golden brown, 6–8 minutes. Don’t walk away; the butter can go from perfectly golden to burnt very quickly! Once butter is golden, immediately pour it into a large heatproof bowl (it will keep cooking if you leave it in the pan) and chill until starting to solidify, about 30 minutes. That's brown butter, people! That's all it is!Step 2Meanwhile, very finely chop 1 cup walnuts (they should be about the size of a lentil). Don't like walnuts? Any nut will be delicious here.Step 3Add ½ tsp. salt and ½ cup powdered sugar to bowl with butter. (If you've ever been tempted to leave salt out of a baking recipe, DON'T—you can't taste the sweet properly without a bit of salt.) Using an electric mixer on high speed, beat until mixture is lightened in color and very fluffy, about 3 minutes.Step 4Scrape down sides of the bowl with rubber spatula. Add 2 cups flour and beat on low speed until dough is thick and smooth.Step 5Using rubber spatula, fold chopped nuts and 1 tsp. vanilla into batter, scraping bottom and sides of bowl, until incorporated. (Swapping the vanilla extract for almond or orange extract would be fun, too.) Cover bowl with plastic and chill dough until firm, about 1 hour.Step 6Place a rack in middle of oven; preheat to 325°. Line a rimmed baking sheet with parchment paper. A note about parchment paper. It's a great thing to have for baking situations such as these—it is essentially nonstick, and makes cleanup a breeze—but if for whatever reason you forgot to buy it, you can always grease your baking sheets well and bake directly on the metal; the cookies might brown a little more quickly, so keep an eye on them. Also: Under NO CIRCUMSTANCES can you substitute wax paper for parchment! Roll dough into 1\" balls and arrange on prepared pan.Step 7Bake cookies, rotating pan halfway through, until firm and beginning to look dry but haven’t taken on any color, 20–22 minutes. Let cookies cool on sheet until they're just cool enough to handle but still warm.Step 8Sift remaining 1 cup powdered sugar into a large bowl. Toss warm cookies in powdered sugar. Transfer cookies to a wire rack and let cool completely. Toss one more time in powdered sugar.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9The cookies are best if you have some patience—store them in an airtight container and let them sit out at room temperature overnight. They're best after they've sat for a bit...but they also definitely don't suck when they're still warm.Step 10Do Ahead: Cookies can be made 5 days ahead. Transfer to an airtight container and store at room temperature.How would you rate Brown Butter Wedding Cookies?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis is basically the same cookie recipe I've used for years from a great aunt.  That recipe is called 'Russian Drops'.  The difference is that the butter in that recipe is not melted , and it is salted.  It's the only cookie recipe I have with no egg and no leavening.  A great Holiday Cookie.AnonymousEureka, Ca.4/13/2021These cookies were delicious but spread quite a bit. Next time I would use more flour, maybe 1 1/4 cups. Also, a weight measurement for the flour would be helpful here - that could've been part of the problem. AnonymousLos Angeles, CA12/26/2020This recipe is FANTASTIC!!! I am not sure why dome are saying it took a bit to make. Most phenomenal things do, don’t they?\n\nThe texture is Very true to the traditional wedding cookie. These were gone in a heartbeat at my house!NateruTampa7/12/2020I made these with half cashews, half pecans because I didn't have walnuts. The flavour is delicious, but the texture is incredibly unsettling. It's so dry and makes such a scraping sound when you chew it that my hair stands on end eating them - and now even thinking about them. I almost never review things, but I've never had that reaction to a cookie before. I'll be looking for recipes with similar flavours but more moisture. Also, this is not an easy recipe if you were linked here from one of those lists. It takes hours.drphilismydaddyA horse farm5/27/2020I think these are pretty good, and definitely matched my expectations given the \"snowball cookies\" I have had in the past. Note that there is a lot of butter per cookie if you do the math. I found that the dough was pretty dry and would fall apart when trying to shape them, but once you managed to shape them, they turned out fine.AnonymousGeorgia5/17/2020I make a version of the recipe every year since I was about 16 and my mom has made it every year I've been alive. This is by far the best recipe I've come across. I always have a problem with the butter making the cookies spread while baking but not with this recipe. I always substitute pecans for walnuts because myself and half my family are allergic to walnuts and it's amazing. Best cookie of the Christmas season. AnonymousVegas12/17/2019These are next level amazing! I'm going to have to make another batch to share with all my friends and neighbors since we ate most of the first batch. Yum!AnonymousColorado 12/12/2019These were the hit of the entire Christmas dinner. These are the best cookies ever.AnonymousColorado5/20/2019These take a while to make because of all the resting so plan ahead! They were damn delicious though. I toasted the walnuts because why wouldn't you, and chopped them in a food processor out of laziness. I used both almond extract and a vanilla bean. It took a solid hour for the butter to begin to resolidify and I don't think it was even as solid as it should have been but I was impatient. Likewise I only let the finished dough rest about 30 minutes before I started baking because it was getting late. I like a bit more browning (even though this recipe says not to) so I did 350 degrees for 15 minutes instead and got the nice crispy bottom I was looking for. They still turned out fantastic though and got rave reviews from the party I brought them to. I will definitely be making these again. AnonymousBerkeley4/16/2019These cookies are so tasty and simple to prepare! I used almond extract with a mix of pecans and walnuts. I also added a 1/4th cup of milk to help the dough form into the balls. They were awesome with coffee this morning after a night of rest. I highly recommend! kenzitoMassachusetts2/16/2019My kiddos dig these cookies. My dough was rather dry, so I had to add 1/4 cup of milk. Turned out yummy. Will make again with different nut. Thanks Bon Appetit HayatiBatam Island1/24/2019I made these with gluten free all purpose flour and they turned out delicious, albeit a little more crumbly. A keeper recipe!! \nAnonymousnorth carolina1/10/2019I made these with cashews and they are incredible. It took closer to an hour for my butter to firm up in the fridge.AnonymousChicago1/9/2019Wow are these addicting.  I didn't exactly nail the brown butter part, got nervous and basically just ended up with melted butter but I am definitely making these again maybe with pistachios?   So easy, so delicious these are my new favorite Christmas ccookies. julia.k.dumaine5223Connecticut12/5/2018So festive and nutty! I chopped walnuts with food processor out of laziness. I thought I burned my brown butter, but just strained out the black bits and everything was fine. My dough was a little crumbly, so I shaped them into balls with my fingers. You know they're done when the cookie almost looks dried out (and not as soft/sticky as the raw dough looked). alexbeggsBA.com 12/2/2018Explore Bon AppétitCookieDessertWalnutNutPeanutAlmondPecanEasySnackBakingChristmasBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-02", "author": ["Condé Nast", "Kat Boytsova"]}