{"id": "8a8a89b20be0f15152e32caf553f705e", "url": "https://www.bonappetit.com/story/high-on-the-hog-review", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "'High on the Hog' Is About More Than Food– It’s About Homecoming | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture'High on the Hog' Is About More Than Food—It’s About HomecomingThe new Netflix series untangles the culinary and cultural links between the two continents that Black Americans call home.By Chala Tyson TshitunduMay 24, 2021FacebookTwitterEmailPhoto courtesy NetflixFacebookTwitterEmail“It was strange to come home to a place I had never been,” Stephen Satterfield says in the opening episode of High on the Hog: How African American Cuisine Transformed America. “Fragments of a lost memory were everywhere.”Satterfield, the food writer turned documentary-host, is speaking quite literally, as he walks along the red clay roads of Benin where many Africans took their last steps as people before being shipped across the Atlantic as cargo. The sentiment he expresses is one that many across the Black diaspora will find intimately familiar: homecoming.At historically Black colleges and universities (HBCUs), homecoming is a weeklong marathon of marching band battles, step shows, and school spirit. But the tradition is about more than college pride. To experience a sense of homecoming as a Black person is to be in community and communion with your people. It is a deeply spiritual feeling of belonging and joy felt when the rich complexities of Blackness and Black culture are centered and celebrated in a space—something most of us don’t encounter in our everyday lives. It’s an idea so crucial to Black culture that it’s inspired acclaimed novels, megawatt Coachella performances, and now one of the most powerful food documentaries ever made.Host Stephen Satterfield (left) enjoys Texas barbecue at a rodeo with former country singer Larry Callies in the Netflix series High on the Hog, How African American Cuisine Transformed America. \nPhoto courtesy NetflixPremiering May 26 on Netflix, HOTH is based on the 2012 book of the same name by award-winning author Dr. Jessica B. Harris. A visually stunning pastiche of Black foodways, oral traditions, and celebrations, the show deftly weaves homecoming into each of the four hour-long episodes as Satterfield eats his way across Black history. While sampling everything from grilled lamb with spicy moyo sauce in West Africa to rice grits with chicken crackling and caviar in Texas, he breaks bread with prominent Black chefs and scholars like chef Omar Tate, historian Adrian Miller, baker and cookbook author Jerrelle Guy, and Dr. Harris herself. Unlike the typical travel show host, Satterfield isn’t a tourist “discovering” cuisines for the first time. In HOTH, he is the prodigal son returning home, becoming a surrogate for generations of African Americans who have felt alienated from their own ancestry and who have been searching their entire lives for it.To say I’ve been waiting for a show like this one is, at best, an understatement. An obsessive amateur food scholar since age four, I spent much of my youth glued to the Food Network. I’d watch wide-eyed as Emeril Lagasse bam!-ed his way through a brown butter sauce and Alton Brown elocuted the science behind soufflés. But when I had to turn off the TV every night to have dinner, I would quietly resent my Black American mother’s shrimp and okra gumbo and my Congolese father’s beloved fufu and pondu (stewed cassava leaves). As a kid in the early ’00s, I automatically labeled anything that I didn’t see on television as “uncool,” including my own culinary heritage.Within the first two minutes of the opening episode, I felt two decades of residual childhood guilt melt away. Watching as Satterfield eats mashed yam (a cousin to fufu) and lamb with his hands in Benin and slurps crab and okra stew in South Carolina, I was overcome with a profound sense of familiarity, comfort, and belonging—my own sense of homecoming.Satterfield, who is also the founder of Whetstone, a magazine and media company, is both more reserved and more vulnerable than any documentary host I’ve seen. Never seeking the spotlight or centering himself, he has a journalist’s ability to observe and listen, making it all the more powerful when his own emotions emerge. Through his innate empathy and genuine curiosity, he creates intentional space within conversations, allowing the spiritual magic of Black storytelling to shine brightly. The show’s spirituality isn’t particularly religious (though Satterfield does stop for Texas barbecue from a pastor slash pitmaster at a Baptist church), rather, it’s focused on honoring the indomitable spirits of the ancestors who continue to guide us forward—the very soul of African American heritage.“We are the only people who named our cuisine after something invisible that you could feel, like love and God,” culinary historian Michael Twitty says of soul food in the second episode. “Something completely transcendental. It’s about a connection between us and our dead, and us and those who are waiting to be born.” Twitty’s words open a necessary window into the mindset of our African American predecessors who poured every ounce of themselves into their cooking. By imbuing their food with their soul, our ancestors created a way to feel the comfort and safety of home no matter where they ended up or how horribly they were treated. “Despite the fact that we were in hell,” Twitty says, “that we were being worked to death, we created a cuisine.”HOTH doesn’t shy away from discussing the terrors of slavery, but it makes the conscientious choice to only broach the topic in key moments of the show—a welcome departure from the media’s obsession with broadcasting Black suffering. Instead, the series focuses on honoring the resilience of enslaved Africans who, despite living through constant physical and psychological torture, built culinary legacies out of a love for the distant descendants they would never meet.Many of HOTH’s guest stars carry the torch of these legacies today, like BJ Dennis, the chef preserving the Gullah culture of South Carolina’s Lowcountry one whole hog roast at a time; like Chris Williams, chef and owner of Lucille’s in Houston, named after his great-grandmother who was a successful food entrepreneur in the early 1900s; and like Gabrielle Etienne, a cultural preservationist who serves special farm-to-table dinners from her very own heritage garden on family land in North Carolina. “Our legacy isn’t found in statues or history books,” Satterfield says. “It lives on in the people who guard the gates of our culture who continue to share our stories.”It's impossible to overstate the power of seeing African Americans sharing our own history on HOTH. With an all-Black directing team led by Academy Award winner Roger Ross Williams behind the camera, the series not only shares Black stories authentically, but also serves to reject narrow minded assumptions of what African Americans can accomplish. “The limitations that are put on us by people’s framing of what Black hands can do is exhausting,” chef Chris Williams says to Satterfield in episode four. “We’re the innovators of everything that’s pop culture right now. It’s born out of us, and it’s taken, monetized, whitewashed, and sent out all over the globe, but it’s still ours.”Satterfield (left) learns the history of Ganvié, Benin from local tour guide Eric Kiki.\nPhoto courtesy NetflixHOTH posits, clearly and decisively, that American cuisine as we know and love it would simply not exist without the innumerable contributions of African Americans, past and present. Through the series, we learn that there would be no rice, okra, or black eyed peas if they weren’t brought over with the enslaved. There would be no mac and cheese, ice cream or french fries without the vision and skill of James Hemmings, the captive chef of Thomas Jefferson. There would be no beef industry without the help of Black cowboys who drove cattle from Texas to the North. There wouldn’t even be a catering industry without Black families like the Dutrieuilles in Philadelphia who pioneered culinary entrepreneurship.“The truth is,” Satterfield says in the show’s final episode, “when it comes to culture in America, there is very little we didn’t influence.” Yet it has taken centuries for this truth to come to light and for these legacies and traditions to come home. And while the release of HOTH is a watershed moment, the series is long overdue. In this pivotal moment of American history, as legislators across the country try to crack down on peaceful protesters and ban critical conversations on race in schools, the need for honest storytelling around Blackness in America is as urgent as it’s ever been.African Americans have lived through over 400 years of enslavement, lynchings, Jim Crow, redlining, gentrification, and cultural appropriation. Meanwhile, so much of our history has been destroyed, erased, and ignored by the white supremacist systems that dictate so much of American culture. But as Black people today fight to tell our truths—in the streets, the workplace, and now on Netflix—we are continuing our ancestors' unfinished work of liberation. By preserving and celebrating their legacies of resilience and spirit of resistance, we are building a world where they can finally find rest and freedom through us. “This is the first time in my life that I’ve ever been able to convene with them,” Satterfield says, overcome with tears as he pays homage to the enslaved at Benin’s Gate of No Return. “Finally, they get to come home.”Explore Bon AppétitNetflixFood TVPop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-24", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}