{"id": "8a8f89676a44f3323e79c7cd33aeb38c", "url": "https://www.bonappetit.com/story/tocabe-indigenous-market-online-shop", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "How Tocabe Indigenous Market Keeps Money in Native Communities | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Indigenous Marketplace Built for the FutureGrass-fed bison, heirloom beans, seasonings, and more Native ingredients you need to cook with.By Allyson ReedyFebruary 23, 2022FacebookTwitterEmailPhotograph by Paul MillerFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.With a “Native first” philosophy driving everything they do, Ben Jacobs, a member of Osage Nation, and partner Matt Chandra wanted to get the Indigenous-sourced ingredients they use at their fast-casual American Indian restaurants, Tocabe, into more hands. “Communities of color have to battle for any sort of representation,” Jacobs says. “So for us, why would we not support our own community in food production?” When the pandemic sidelined both of their Denver-area locations, they got to work launching Tocabe Indigenous Market, an online shop for Native-made and grown ingredients that fills a gap most of us have in our pantries. Besides stocking your kitchen with tasty foods—like grass-fed bison, heirloom beans, and rice—each time you click “add to cart,” you’ll be keeping money in Native economies and providing food for communities in need. (Tocabe donates one item for every two sold on the site.) “We wanted to create something that was really sustainable for the future,” Jacobs says. “We’re not just buying a bunch of ingredients; we’re building a relationship with the growers and producers and making sure we’re supporting the Indigenous economy.”Here, Jacobs highlights some of his favorite products. Séka Hills Extra Virgin Arbequina Olive Oil“The Yocha Dehe tribe near Napa Valley has one of the most sophisticated olive presses in the U.S., imported and built by Italian artisans. They grow incredible olives to make this earthy dark green olive oil. We use it in all of our salad dressings [at Tocabe] and I take it home and use it with bread all of the time. It’s not a precolonial ingredient, but we support all Native producers.”Photograph by Paul MillerSéka Hills Extra Virgin Arbequina Olive Oil$14 at Tocabe Indigenous MarketRed Lake Nation Lake Harvest Rice“We source three different rices from Red Lake Nation in northern Minnesota right now, but my favorite is the Lake Harvest. It has a much bigger grain that really puffs up and has some meatiness to it. It’s fantastic as the base of an entrée or mixed into salads. You get this really earthy flavor because of the size and how it’s grown.”Paul MillerRed Lake Nation Lake Harvest Rice$13 at Tocabe Indigenous MarketSéka Hills Northern California Wildflower Honey“It tastes like flowers. It’s so naturally sweet, and it’s almost to the point of crystallization that it’s like butter in some ways. This is another product from the Yocha Dehe Wintun Nation—they have such an amazing farm and ranch program.”Photograph by: Paul MillerSéka Hills Northern California Wildflower Honey$10 at Tocabe Indigenous MarketRamona Farms Heirloom Black Tepary Bean“These Sonoran grown beans are unlike any other. They have to simmer for up to six hours, but you can’t overcook them—they retain their bite and creaminess and are super nutrient packed.”Photograph by Paul MillerRamona Farms Heirloom Black Tepary Bean$10 at Tocabe Indigenous MarketTocabe House Dry Rub“Not all of the chile powder, smoked paprika, and fluffy sage that go into this are tribally produced, but we use it every day in the restaurants on all sorts of bison cuts. You can use it on any kind of meat—we like it on game meats and roasted vegetables to really elevate the flavor.”Paul MillerTocabe House Dry Rub$5 at Tocabe Indigenous MarketGrass-fed Bison“We use all sorts of bison cuts at the restaurants, but we wanted to redistribute the cuts we don’t use, like the tenderloin and New York strip. By bringing in our own bison, so respected and well cared for by Fred DuBray, a rancher and member of the Cheyenne River Lakota Tribe in South Dakota, we can use the bulk of the animal at Tocabe and give the community the opportunity to use the rest. It’s a Native process from start to finish, from the rancher to the processor to us.”Photograph by Paul MillerGrass-fed Bison$250 at Tocabe Indigenous MarketSpirit Lake Maple Syrup“If you’re from a maple syrup area, you know what real maple syrup should taste like: caramelly toffee but not overly sweet. This is true traditional syrup. Once you have it, you don’t go back; you can taste the nature within it.”Photograph by Paul MillerSpirit Lake Maple Syrup$12 at Tocabe Indigenous MarketNo Reservations Needed Tocabe T-shirt“This was our very first motto, and it’s a fan favorite for sure. ‘No reservations needed’ is a pun on restaurant reservations—and a political statement.”No Reservation Tocabe T-shirt$25 at Tocabe Indigenous MarketSakari Cedar Smoked Salt“Whatever you’re eating, this takes it up a notch. Spring Alaska Schreiner of the Valdez Native Tribe forages for the cedar leaves used to smoke this sea salt, which has the most amazing fragrance and taste. I use it at home as a smoky finishing salt.”Photograph by Paul MillerSakari Cedar Smoked Salt$12 at Tocabe Indigenous MarketExplore Bon AppétitShop TourCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-23", "author": ["Condé Nast", "Allyson Reedy"]}