{"id": "8a9475b5da7b67dd9cd41f20c9b7e1cc", "url": "https://www.bonappetit.com/story/vegetarian-meatballs", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "These Vegetarian Meatballs Are Our Spring Weeknight Obsession | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Vegetarian Meatballs Are Our Spring Weeknight ObsessionThere's no normal way to talk about meatless balls.By Aliza AbarbanelMay 2, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenFacebookTwitterEmailIt’s funny how meatballs—once the perfunctory, stodgy companion to a bowl of spaghetti—have become something of a healthyish staple. First came senior food editor Andy Baragahani’s exquisite lamb meatballs with raisin pesto that landed on the cover of BA's April issue. That warming spice blend! The bright, herby raisin pesto! We swooned. Then our friends over at Basically dropped a sheet pan chicken meatball recipe that made meal prep feel like no big thing. Game over.But not quite. We thought it was time to get vegetarians—and chickpea lovers—in on the fun. These meatless meatballs have a spicy soy-honey glaze that creates more nuanced flavor than other veggie balls, and their herby chickpea-mushroom base mimics a traditional meatball's heft without any grains or, you know, meat. “I wanted people to make these and not spend half a day on them,” says Baraghani. “They look good, are made from mostly pantry items, and still have a lot of flavor going on.” Served alongside a bright and crunchy celery salad, it’s fair to say these vegetarian meatballs are our spring meatball crush.Start creating your base by pulsing shiitake mushrooms in a food processor to make pieces no bigger than ¼\". Transfer the mushroom pieces to a lightly oiled, parchment-lined rimmed baking sheet and add chickpeas, then bake, tossing halfway through, until the chickpeas are slightly darker and the mushrooms have browned and slightly shrunken. It should take about 35–40 minutes, and you want to let them cool for as long as you can after to get the creamiest possible texture later. Keep the oven on, because you'll need it again soon.While the chickpea-mushroom mixture cools, you’re going to make a glaze on the stovetop. Mix together a thinly sliced red chile, soy sauce, honey, and a tablespoon of unseasoned rice vinegar, then bring the sauce to a boil. Reduce the heat and simmer, stirring frequently for about ten minutes until it’s slightly thickened and foamy.Next, it’s time to bring the rest of the meatballs together. While the glaze cools, use a food processor to pulse eggs, ginger, garlic, panko, scallion greens, cilantro, and oil until the mixture is fully incorporated. The aromatics add flavor, eggs acts as a binder, and breadcrumbs help bind while adding heft. Add the chickpeas and mushrooms and pulse again, then transfer the whole mixture to a large bowl and chill in the fridge for 20-25 minutes so they can firm up enough to be shaped.Now, the fun part. Roll the chickpea mixture into little golf balls, arrange them on a parchment-covered baking sheet, and brush with about a quarter of your spicy soy glaze.  Bake them until they're firm and slightly darkened, 18–20 minutes, and use this time to assemble a super fresh celery salad to contrast the creamy meatballs and sweet spicy glaze. Just toss together cilantro, celery leaves and stems, and the rest of your scallions with some vinegar. Drizzle some soy honey sauce over the finished meatballs, then serve the rest alongside.\"You can make these ahead of time and then bake them off when you need them, but once they’re cooked you should eat them right away,\" says Baraghani. We recommend keeping them, unbaked, in the fridge for no more than two days. To store them for longer, freeze the unbaked meatballs on a sheet tray to prevent sticking, then transfer them to a plastic bag and keep for up to a month. Frozen meatballs will need to bake a little longer, so keep an eye on them and watch until they are browned and cooked through.Once ready, these meatballs are an amazing cooking shortcut. Grab a few to go for a quick, high-protein snack, or serve them over whole grains or study greens for an easily assembled lunch bowl—that's also cheaper than any fast casual spot around.Get ready to roll:Vegetarian Meatballs with Soy-Honey GlazeThis vegetarian dinner features a spicy soy-honey glaze that caramelizes on the chickpea-mushroom balls as they cook.View RecipeExplore Bon AppétitMeatballMeatless MondaysVegetarianHealthyishRead MorecookingA Saucy, Crispy Tofu Recipe for People Who THINK They Hate the StuffBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-02", "author": ["Condé Nast", "Aliza Abarbanel"]}