{"id": "8a96e0902c2e3f607aaae5fcda621bcf", "url": "https://www.bonappetit.com/story/cheat-day-eating", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "I Stopped Cheat Day Eating Forever, and Here's Why | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCan We All Stop With This \"Cheat Day\" Eating Already?Doing away with \"cheat days\" saved my sanity and improved my relationship with food.By Jennifer Still June 19, 2018FacebookTwitterEmailIllustration by Bryan FountainFacebookTwitterEmailLike many American women, I’ve spent much of my life trying various diets and methods of losing weight, some quick and painless, others slow and arduous, most of them including the ubiquitous “cheat day.” The premise of the cheat day is simple: spend a week or a month in a state of caloric deprivation so that you can make it to that blessed day when you can eat with abandon anything your taste buds desire. From pints of Ben & Jerry’s and Snickers bars to bags of Doritos or a large Domino’s pizza, the cheat day makes these splurges not only okay but justified. After all, you earned it, right?The problem for me was that cheat days were never quite that. Either they became cheat weeks, which became cheat months and sometimes cheat years, or they filled me with so much dread of going off-track that I found I couldn’t truly enjoy them. The cheat day only furthered my dysfunctional relationship with food, and it sabotaged my attempts at finding balance in my approach to health and nutrition.The cheat day seems like it should fit neatly under the umbrella of moderation. In reality, it focuses more on extremes—both in terms of deprivation and overindulgence—and it turns food into a currency. You can’t have a cheat day unless you’ve avoided the designated cheat foods for a certain period of time. In essence, you’re hoarding all your calorie cash so that you eventually feel like you’ve “earned” a splurge and can enjoy it without guilt.Still, for many people, cheat days reinforce the dangerous idea that foods are intrinsically “good” or “bad,” an idea many of us have internalized, given that up to 30 million people in the US alone suffer from some form of eating disorder. Food, being an inanimate object, has no moral value. It is sustenance, intended to fill and nourish your body (hopefully it tastes good, too). That’s all. It took me many years to learn that simple lesson, and I still struggle with it from time to time.“The concept of a cheat day sustains a culture of guilt and shame around food. It keeps companies like Weight Watchers, Jenny Craig, and NutriSystem in business, not to mention all the authors who write diet books,” says nutritionist and dietician Mary Jane Detroyer. “Our bodies are hard-wired to have cravings as a mode of survival. In other words, it’s natural and even preferable to crave a wide variety of foods.”Cheat days are a naughty loophole in the health and wellness law of dietary restraint: just this once. Unfortunately, using food as a reward only serves to perpetuate unhealthy relationships with the things we eat. What happens if you “cheat” at the wrong time? Are you inherently weak, a failure? Do you go down a spiral of shame and regret because you had a brownie on a Tuesday when your cheat day is actually Saturday? For many people, sadly, the answer is yes—it certainly was for me for way too long.I have no doubt that the cheat day model works just fine for many of people, particularly those who have a naturally healthy relationship with food. Still, I question whether there can be anything inherently healthy about a cycle of deprivation and overindulgence, especially since studies have proven that while cheat days can help you achieve weight loss goals, they can wreak havoc on our approach to nutrition.The answer, says Detroyer, is to take a more relaxed approach. “Eating mindfully, honoring hunger and fullness cues, and intuitively eating what we desire while being mindful of our health results in a healthy relationship with food,” she explains. “If we never eat the foods we desire and stick to ones we think are ‘good,’ it can lead to binging and other disordered patterns of eating. It doesn’t have to come to that.”For me, doing away with cheat days for good saved my sanity and improved my relationship with food. I stopped chiding myself for “messing up” when I grabbed a croissant for breakfast instead of fat-free Skyr; I no longer felt sick from ingesting several days’ worth of calories on my “cheat day” since I just had to shovel it in before the day was done. I took a recent trip to Paris and didn’t think twice about the caramel pain perdu I enjoyed at Les Editeurs, or the honeyed duck I savored at Les Deux Magots. I simply ate and thought nothing more of it—and it felt great.In essence, I’ve started practicing true moderation. For me, that means making smart choices when deciding what to eat by filling my plate or bowl with lots of veggies, protein, and slow carbs like brown rice, quinoa, and sweet potatoes. It also means letting myself live a little and realizing that eating junk food for one meal or even several isn’t the end of the world. In fact, it’s just food, and I have better things to worry about. Shouldn’t we all?Explore Bon AppétitHealthyishessayRead MoreLifestyleA French Woman's Guide to Unabashedly Loving ButterBy Charlotte PalerminoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-19", "author": ["Condé Nast", "Jennifer Still"]}