{"id": "8a9ec183870861f851da9a82a592968a", "url": "https://www.bonappetit.com/story/wings-walkthrough", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Best Chicken Wings Recipes for Game Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Home Is the Sports Bar Now—Make Wings!Eating the wings > watching the game.By Alex BeggsOctober 23, 2020FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Jennifer OphirFacebookTwitterEmailYou can drag me to the sports bar with the stickiest floor, the rudest fans, and the worst beer selection and I will be happy. Because I LOVE WINGS. My favorite preflight meal is Buffalo Wild Wings. So with the return of Big 10 football this weekend, my home will transform into the sports bar of 2020, better than any other sports bar because it’s just me and my pod and my cat. We have a clean bathroom. And a great beer selection.Back to the wings. Bon Appétit has many recipes for them. Some are more complicated than others. I’ve been practicing, and I took notes, so that we can figure out which wings YOU should make. Go Blue!You want to be true to the experience, you purist youTo re-create bar-style Buffalo wings, what you really need to do is deep-fry them in the grease of 1,000 wings past. I don’t do that at home because of the amount of oil required and my general laziness. But if you MUST, this recipe is the truest expression of those wings you so desire. Super-crispy skin, drenched in sauce, an absolutely delicious mess.BA's Best Buffalo WingsView RecipeYou want Buffalo wings but don’t want to fry themWhy go to the trouble of deep-frying when the wings get sogged in sauce anyway? When you bake them you can achieve a pretty damn crispy skin and no one will be the wiser once they’re smothered in ranch that’s all over your face and couch cushions. Steam cleaner’s coming next week, don’t worry about it. NOTE ON THIS RECIPE: Some commenters do NOT like the brown sugar in the Buffalo sauce, which is “untraditional” and “blasphemous” depending on your wing religion. I made them with the sugar and have to agree: not necessary. I want straight buttery Frank’s Red Hot heat.Basically Buffalo WingsWant crispy-spicy chicken wings without having to deep-fry at home? We got you.View RecipeYou want to grill The weather’s nice and you have one of those outdoor setups with a TV on the patio! This is a nice recipe for the occasion. The soy-honey marinade is easy and lip-smacking, I’ve made these about once a summer since the recipe came out. Plus shishitos! If you want.Grilled Chicken Wings with Shishito Peppers and HerbsSteady medium heat is best for grilling wings; they need time for the fat to render and the skin to crisp.View RecipeYou want crispy wings but don’t like them “wet”Sorry, not sure how else to say it. But after some time in the boiler, these peppercorn wings get a texture  I’d compare to a salt-and-pepper-flavored kettle chip. The recipe’s also super flexible—play with whatever spices you have around the house, as long as you go HARD on the pepper for those crunchy bits.Crispy Peppercorn Chicken WingsThese super-flavorful, no-fry chicken wings turn out best when they’re seasoned ahead of time. You can do this as little as 1 hour in advance, but letting them hang out with salt and those spices overnight is a complete game changer.View RecipeYou want a sweet, glaze-y wingWithin this recipe there’s a traditional Buffalo sauce and the option of a simple glaze with ginger, honey, garlic, and soy sauce. I hate to mention B Dub’s “Asian Zing” sauce because that name, oof, but these really did remind me of them. (I add sambal.)Crispy Baked Chicken WingsBaking wings yields crisp skin without the mess and constant tending of frying.View RecipeYou want crispy wings AND leftover chicken fatAndy Baraghani’s wings have a couple of cool cooking-technique things going on. The wings get covered in spices and a ginger-garlic oil and sit for 30 min-to a full day to season them deeply. THEN you bake them starting from a cold oven, which makes the chicken fat slowly drip off into the pan (which you can save and use later) and leaves you with super-crispy skin. It’s a bit of a process but with restaurant-worthy results. Very Andy.Crispy Turmeric-and-Pepper-Spiced Chicken WingsWings so crispy you won’t believe they were baked in the oven.View RecipeYou want “mind-altering” wingsThis is a recipe from a Texas restaurant, Hot Joy, know for its crab-fat caramel wings. I haven’t made these because there’s frying involved, but there’s also a fish sauce and crab paste caramel for glazing the wings. So I’m thinking maybe I’ll make THAT and then bake the wings to be more user-friendly. I’ll report back soon. Crab Fat–Caramel WingsThe funky flavor in these mind-altering chicken wings comes from a jarred condiment that’s pretty easy to find at Asian markets.View RecipeSee you on the sidelines!Explore Bon AppétitChicken WingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-23", "author": ["Condé Nast", "Alex Beggs"]}