{"id": "8aa0c83a8b658c0998a09d8a8c9c1854", "url": "https://www.bonappetit.com/recipe/cardamom-cream-filled-sugar-doughnuts", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Cardamom-Cream-Filled Sugar Doughnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCardamom-Cream-Filled Sugar DoughnutsBy Samantha SeneviratneJuly 2, 20214.5(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintDeep-frying doesn't need to be scary. Make sure to use a pot that can hold a couple inches of oil and still have another inch or two of empty space above it, and lay the dough into the oil gently before letting go so it slides right in. Cracking your own green cardamom pods is essential both for freshness and for infusing plenty of flavor into the cream filling without adding any texture, keeping it silky and light. (Get Samantha’s recipe for Cardamom-Cream-Filled Doughnuts here, and watch her make both recipes here!)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonDeep-Fry Thermometer$29 $16 At Amazon3\" Circle Cutter$7 At AmazonFrench Rolling Pin$17 At AmazonSpider$6 At AmazonIngredientsMakes about 1 dozenDoughnuts1Tbsp. active dry yeast¼cup sugar, plus more3½cups (or more) all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2large eggs2large egg yolks6Tbsp. unsalted butter, cut into pieces, room temperature, plus more for bowlFilling and Assembly2½cups whole milk2Tbsp. green cardamom pods, lightly crushed4large egg yolks¼cup cornstarch¼cup sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltAll-purpose flour (for dusting)Vegetable oil (for frying; about 8 cups)¾cup sugar⅓cup heavy creamSpecial Equipment3\" diameter biscuit cutterdeep-fry thermometerPreparationDoughnutsStep 1Heat milk in a small saucepan over medium just until warm to the touch (110°–115°). Transfer to a heatproof measuring glass. Top off with water to bring volume back to ¾ cup if needed. Immediately stir in yeast and a pinch of sugar; let sit until mixture begins to bubble and foam, about 4 minutes.Step 2Mix flour, salt, and remaining ¼ cup sugar in the bowl of a stand mixer fitted with the dough hook on low speed to combine. With motor running, pour in milk mixture, then add eggs and egg yolks one at a time, mixing well after each addition. Continue to mix, scraping down sides of bowl as needed, 3 minutes. (Dough should be workable but somewhat sticky at this point. You can add a little more flour by the tablespoon if needed, but resist the urge to add too much; you don’t want your dough to be tough.) Add 6 Tbsp. butter, a piece or 2 at a time, mixing after each addition until incorporated. (You might have to stop the mixer and knead butter in by hand to get it started.) Increase speed to medium and mix until dough is smooth, supple, and elastic (it will still be a little sticky), 6–8 minutes. (Alternatively, if you don’t have a stand mixer, mix dough with a wooden spoon in a large bowl, then knead in bowl about 6 minutes, dusting with additional flour if needed. Turn dough out onto a lightly floured surface and continue to knead by hand until smooth.)Step 3Lightly butter a large bowl and transfer dough to bowl. Cover with plastic wrap or a kitchen towel and let sit in a warm, draft-free spot until doubled in size, about 1 hour. (Alternatively, you can cover and chill at least 3 hours and up to 12 hours.)Filling and AssemblyStep 4Meanwhile, bring milk and cardamom to a simmer in a medium saucepan over medium heat. Remove from heat, cover, and let sit to infuse at least 10 minutes and up to 1 hour.Step 5Whisk together egg yolks, cornstarch, sugar, and salt in a large bowl. Gradually whisk in a small amount of milk mixture to gently warm yolks. Pour egg mixture into remaining milk mixture in saucepan and bring to a boil over medium heat, stirring constantly and adjusting heat as needed to avoid scrambling eggs. Cook, stirring constantly and scraping bottom of pan, until mixture begins to thicken, 3–6 minutes, then whisk vigorously until thick and glossy, about 1 minute more. Strain custard through a fine-mesh sieve into a medium bowl. Cover with plastic wrap, pressing directly onto surface and chill until cold, about 2 hours.Step 6Turn out dough onto a lightly floured surface and roll out to ½\" thick. Line 2 rimmed baking sheets with kitchen towels; dust towels well with flour. Punch out as many dough rounds as you can with cutter and transfer to prepared baking sheets. Gather scraps, reroll, and punch out additional rounds; transfer to baking sheets (you should have about 12 total). Lightly cover with plastic wrap and let sit in a warm, draft-free spot until nearly doubled in size and dough springs back slowly when gently pressed, at least 30 minutes and up to 2 hours, depending on temperature of your room (watch the dough, not the clock).Step 7When ready to fry, line 2 rimmed baking sheets (or a few plates) with paper towels. Fit thermometer to sides of a medium heavy pot and pour in oil to come 2\" up sides. Heat over medium until thermometer registers 350°. Working in batches of 2 or 3 doughnuts at a time and adjusting heat as needed to maintain temperature of oil, carefully slide doughnuts into oil with a spider or slotted spoon and cook until golden brown, about 2 minutes per side. Transfer to prepared baking sheets and let cool slightly.Step 8Place sugar in a medium shallow bowl. Working one at a time, toss warm doughnuts in sugar and return to baking sheets. Let cool completely.Step 9Using a chopstick or the handle of a wooden spoon, poke a hole through side into each doughnut. (Be careful not to go all the way through.)Step 10Whisk heavy cream in a large bowl until soft peaks form. Uncover cardamom custard and whisk to loosen, then fold in whipped cream. Transfer filling to a pastry bag fitted with a small round tip (a resealable plastic bag with 1 corner cut off will also work) and gently pipe cardamom cream into doughnuts to fill.How would you rate Cardamom-Cream-Filled Sugar Doughnuts?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleBA, you need to proofread your recipes, please! As mentioned multiple times by other reviewers, the amount of milk needed for the dough is omitted from the ingredient list. This is a very important ingredient for this dough (the very first thing to do is heat the milk to proof the yeast in). We're left to search for the correct amount of milk. The moisture content of a yeasted dough is extremely important, yet we're left to search for this amount. The only way I could find the correct amount is to go to the video, pause it when Samantha places her measuring cup on the table after warming the milk (minute 1:33), and expand the video to full screen. Only here can I clearly see there's 3/4 cup of milk in the measuring cup (\"S The Baker\" is correct). Jennifer DHudson Valley, NY12/5/2021I’m here for the cardamom cream. I plan to also make a white chocolate mousse and swirl the two together in a baked pie crust, or maybe in serving glasses. I might also make a cranberry balsamic reduction to drizzle over the top.Hollis RamseyVero Beach, FL9/17/2021Amazing doughnuts. So fluffy and pairs perfectly with the pastry cream. I didn't let the cardamom steep very long so I added a small pinch of ground cardamom. I will absolutely make these again!AnonymousNorthwest Arkansas8/30/2021I had so much fun making these and am pleased with the result! I would make some adjustments however (in addition to the previous reviews about the milk measurement at the beginning). I would use a bigger cutout than 3\", probably 4-6\". I got 2 dozen donuts with 3\" and they were smaller than I would've liked. Second, I ended up only doing about a minute on each side during frying. I would also add less heavy cream with the custard at the end. My filling came out much runnier than I would've liked, but I thickened it up with some confectioners sugar and flour. Nonetheless, really enjoying the reward after all the hard work for these donuts!!!RachelSan Antonio7/25/2021Fact check your recipe please, you are missing the amount of milk needed for the dough.  Do I divide the amount listed for the filling?\n\nOther than that, sounds really tasty\nAnonymousCalifornia7/20/2021I'm not a huge fan of a baking recipe that isn't by weight. I also had kinda guess from the instructions that you need 3/4 a cup of milk. It wasn't in the video either. It also just gave it five stars, and I wanted to give 4.S The BakerDayton, OH7/6/2021Explore Bon AppétitDoughnutDessertYeastOther IngredientsCardamomHerbs & SpicesNut-FreeVegetarianDeep-fryBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-02", "author": ["Condé Nast", "Samantha Seneviratne"]}