{"id": "8ab5191e066f1e9af8b287f8bc9430ca", "url": "https://www.bonappetit.com/story/sheldon-simeon-maui", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Sheldon Simeon's Maui Travel Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatSheldon Simeon’s Guide to MauiThe chef’s poke-and-shave-ice-filled stretch along the northwest side of the islandBy Sheldon Simeon, as told to Elyse InamineJuly 14, 2021FacebookTwitterEmailPhoto by Mark KushimiFacebookTwitterEmailWhat’s better than vacationing in Hawaii, where the waves are sky blue and the mountains are the definition of lush? Having Sheldon Simeon, the chef and owner of Tin Roof, as your guide. Here, he goes all in on Maui, specifically the northwest side of the island, sharing his ideal itinerary for taking in the island: eating poke, hitting the beach, sipping mai tais, and more. Check out more food-focused itineraries from our favorite food people here.The good stuff at Oki’s Seafood CornerPhoto by Mark KushimiShave ice is always in season at Ululani’s Hawaiian Shave Ice.Photo by Mark KushimiMauiI love starting my day with the whole family at Upcountry Farmers Market, smack in the middle of the island. All the cool stuff is out in the morning, like rambutan and flowering chives, plus I enjoy talking story with the farmers.We’d drive north to Makawao Town, known for paniolo—Hawaiian cowboys who live and work there—and walk around the main streets. Then let’s head west.Grab some poke from Oki’s Seafood Corner, which has fish you don’t normally see, like aku (skipjack tuna) and ono (wahoo). With our cooler full of poke, we’ll hit up Launiupoko Beach, which has kiddie pools, waves for my older kids to surf, and grills.You’ll notice we haven’t eaten much, and that’s because we’re saving up for Papa’aina, chef Lee Anne Wong’s freaking awesome brunch spot a couple miles north. She’s got noodles and cocktails like the bourbon-forward Miso Mashed, but my favorite thing is the French toast: Hawaiian sweet bread soaked in coconut milk, coated in cornflakes, and deep-fried.You might need to take a nap—or you could go to Ululani’s Hawaiian Shave Ice since there is always room for shave ice in my book. Locally run, locally owned, it’s known for its super soft snow. I’m a purist when it comes to syrups: the higher the fructose, the better. I love banana and bubble gum, but my kids always get mango with li hing mui powder on top.We’ll wander over to Kaanapali Beach to watch the sunset, then sneak over to Monkeypod Kitchen for one of their killer mai tais (the honey lilikoi foam on top is so good).To finish the night, we’ll sink into Sale Pepe, the most perfect Italian restaurant. The pastas are freshly made every day and the pizzas are baked in a stone oven. Shoot, that’s my perfect day.WHERE TO STAY:The Plantation Inn, an 18-room B&B that’s a hidden gemWHAT TO BRING BACK: Jewelry made of Hawaiian wood from Native IntelligenceExplore Bon AppétitMauiRestaurantsTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Sheldon Simeon", "As Told To Elyse Inamine"]}