{"id": "8ac7bc92763c70a39befdc1588d7f37f", "url": "https://www.bonappetit.com/story/cakelet", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "The Cakelet is a Cross Between a Pancake and an Omelet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Cakelet is the Pancake-Omelet Collab You Never Knew You Needed It defies all labels, which is exactly why I love it.By Ali FrancisMay 9, 2020FacebookTwitterEmailPhoto and Food Styling by Laura MurrayFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As someone who has, in recent times, gotten a little too comfortable with a slow morning, a hot, comforting breakfast is pretty much a given for me. But with this newfound commitment comes an evergreen dilemma: sweet or savory? On days when I can’t for the life of me decide between a cheesy omelet and a syrupy pancake, I opt for my Polish grandma’s solution: a lil’ bit of both.“Babcia’s Omelet” is essentially an egg-forward pancake (or a doughy omelet), laced with cheese and smothered in jam. The thing itself refuses to be labeled, which I think is very progressive, and the texture sits squarely between French toast and sponge cake. Only it’s savory. And it’s also sweet. Listen, the cakelet is simply transcendent.To make a cakelet, start by whisking together 2 large eggs. You want to get them to a point where there are no translucent whites bobbing around—they need to be totally combined. Add 2 Tbsp. self-rising flour (or 2 Tbsp. all-purpose flour and ¼ tsp. baking powder), a pinch of salt, and ¼ cup of grated cheese to the egg scramble. When it comes to cheese, my grandma swears by Swiss. I think a more zealous cheddar plays nice with the sweet jam, but even shredded Babybels will do if you’re in a bind. If you are going for a sharper cheese, though, make sure to omit the salt. Use a fork to whisk everything into a kind of loose batter.Place a smallish (ideally 8\") skillet over a medium-hot stove. You want your frying pan to be about the size of a small side plate, as the batter is going to fill the space. (If your pan is too big, you’ll end up with something like a sad, overcooked crepe.) Melt 1–2 Tbsp. of unsalted butter in the pan, swirl it to dispere, then pour in the batter. Once you see tiny bubbles forming on the surface, like a pancake, flip the cakelet and cook for another couple of minutes. You’ll know it’s done once it’s risen to double the size, both sides are golden, and it springs back when you poke the top.Photo and Food Styling by Laura MurrayTransfer to a plate and finish the cakelet with a liberal slather of raspberry or apricot jam, or, if you really want to lean savory, a swoop of hummus with some thick sliced tomato and lots of cracked pepper.Whichever direction you choose, the eating experience is both curious and delightful: springy, bready, and cheesy. And once you’ve made it a couple of times, you’ll never have to struggle through the omelet versus pancake debate again.Explore Bon AppétitIt's That SimplePancakeOmeletJamCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-09", "author": ["Condé Nast", "Ali Francis"]}