{"id": "8acfa4d445b03f45b92e8a70bd4aa4aa", "url": "https://www.bonappetit.com/story/how-to-save-tomatoes-from-getting-smushed-in-your-tote-bag", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "How to Save Tomatoes From Getting Smushed in Your Tote Bag | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Save Tomatoes From Getting Smushed in Your Tote BagThis easy trick keeps your tomatoes intact and your tote stain-free.By Sarah JampelSeptember 2, 2021FacebookTwitterEmailFacebookTwitterEmailAfter making the early morning trek to the farmers market, selecting the very best peak summer produce, and schlepping a bursting tote bag back home, finding a once-beauteous tomato smashed at the bottom of your bag is one of summer’s biggest little bummers. The solution: Make a tomato transportation device! Your heirlooms, cherries, and beefsteaks deserve it.The good news is that it’s not that big of a deal, and the payoff of flawless, unblemished tomatoes is very much worth the extra step. It’s simple: Next time you head to the market, bring along a large shallow food storage container or baking pan—whatever best fits in your tote bag—lined with a clean kitchen towel that is dedicated to tomato transport. Shop strategically by buying tomatoes last, nestle them securely in their special vessel, and stow said vessel at the top of your tote, carefully stacked on top of hardier produce items like ears of corn, heads of broccoli, and other heavy farmers market finds like jars of honey and pickles. If your tote is overflowing, you can always just carry the tray separately so that your tomatoes and other delicate things like stone fruit can be separated from the rest of your haul with padded protection.Whether you’re sliding your bag into the backseat of your car or hauling it on the subway, you can rest easy knowing that your tomatoes will be safe on the ride home. Not only does this method keep your ’maters intact, but it also helps to keep your tote organized, making unpacking that much easier. Thanks to your tomato transportation device, next time you’re assembling a tomato salad for a crowd, or taking a sunlit picture of your tomato toast for social media (no shame), you’ll no longer waste precious time and tomato by having to carve out bruised or mushy spots.Speaking of tomato toast…Tomato Toast with Chives and Sesame SeedsSprinkle the chives, sesame seeds, and flaky salt with abandon.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-02", "author": ["Condé Nast", "Sarah Jampel"]}