{"id": "8ae3f06a5dab8dfea3976dec793076de", "url": "https://www.bonappetit.com/recipe/tangy-vinegar-chicken-with-barberries", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Vinegar Chicken With Barberries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueTangy Vinegar Chicken With Barberries and OrangeBy Andy BaraghaniFebruary 11, 20204.8(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWhite wine vinegar, orange juice, and barberries combine in this fragrant, sweet-and-sour roast chicken. Dried barberries are incredibly tart, more so than any other dried fruit you’ll encounter. Look for them at Middle Eastern markets or specialty foods stores, or order them online. Dried tart cherries will also work.Ingredients4 servings3lb. skin-on, bone-in chicken legs (thigh and drumstick) or a mix of thighs and drumsticksKosher salt2Tbsp. vegetable or other neutral oil1medium onion, finely chopped4garlic cloves, thinly sliced½cup dried barberries or dried tart cherries, rinsed½tsp. ground turmeric¼tsp. crushed red pepper flakes⅓cup white wine vinegar1medium orange, halvedPreparationStep 1Preheat oven to 350°. Pat chicken dry with paper towels, then season all over with salt. Heat oil in a large skillet over medium-high. Cook chicken, skin side down, until golden brown underneath, 7–10 minutes. Transfer chicken to a plate, leaving any fat in the pan.Step 2Remove pan from heat and let fat cool down a little (about 3 minutes should do it). Return pan to medium heat and add onion and garlic. Cook, stirring often and adding a splash of water if needed to keep onion from getting too dark, until onion is softened and golden brown, 6–8 minutes. Stir in barberries, turmeric, and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Pour in vinegar and 1 cup water, season lightly with salt, and bring to a simmer.Step 3Arrange chicken, skin side up, in sauce, then nestle orange halves, cut side down, around chicken. Transfer skillet to oven and bake, uncovered, until sauce is reduced and chicken is cooked through, 30–35 minutes (or 20–25 minutes for separated things and drumsticks).Step 4Transfer chicken to a platter. Spoon sauce over, then squeeze juice from orange halves on top.How would you rate Tangy Vinegar Chicken With Barberries and Orange?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleWonderful. I have been reading an amazing Persian cookbook “food of life “ and this is very like the Orange Koresh in the book.  I did it on the stovetop covered rather than in the oven for an hour and it was tender and saucy. Had barberries from Kalyustans mail order. Added some carrots based on the recipe in the book. All n all great. EssieDee Stamford ct3/11/2022This was delicious! I didn't have Barberries.. Here in rural Michigan we have dried cherries, so I used them. Lovely! I served this with rice and and asparagus. Next time, more sauce.Jane BrodyGlendora, MI1/30/2022This was excellent! Next time I will add a little more vinegar, and slightly reduce the other liquid. Use chicken broth instead of water. CleargreenCA1/14/2021This looks so yum. I’m intrigued by vinegar with meat as a cooking method: like the Filipino “adobo” style (liver adobo 👌🏻).Canada10/31/2020This chicken is PERFECT. Sweet, tangy, and a little spicy form the red pepper flakes. I will definitely be making this recipe again and again. Plus it will be a tasty show stopper for a dinner party. Colorado5/15/2020Quite good, tangy and spicy. I had used boneless thighs, but otherwise followed the recipe. I ended up making it a day ahead, shredded and reheated the meat, and serviced with Naan. AnonymousChicago4/26/2020Loved this recipe and will add it to the monthly repertoire! I bathed the chicken in turmeric and ras al hanout before searing (I also used boneless skinless thighs, because that's what I had during quarantine life!) I used currants instead of barberries, and rice wine vinegar instead of white wine vinegar for a similar effect. Spoonable tasty sauce that I saved even though there was no more chicken! I look forward to having the sauce on a thick toasty slice of bread. AnonymousCalifornia4/17/2020This was fantastic. Fruity, savory and a little spicy. Can't wait to do it again. I will say, for all those like me who are stuck at home with what they have in the freezer: I didn't have bone-in chicken, so I used boneless thighs, had mandarins not oranges, and no barberries (really--barberries?), but did have sour cherries. I browned the thighs lightly on both sides, removed them to a plate while I did the rest of the recipe, then put them back in the pan, reduced the sauce with pan uncovered for 10ish minutes, then covered the pan and cooked for 5+ minutes more. Done. I wasn't sure the boneless thighs would stand up to the oven, which is why I did it all in the saute pan. I was good! wyl14/10/2020made following directions exactly, using dried cherries. very delicious!! will definitely make again. mhaightsternj3/9/2020Andy's recipes are consistently the best! Yummm and rarely too much prep Queens3/6/2020This is amazing! I used full chicken halves with the backbone removed and even the breast came out so juicy and flavourful. I served it with rice using Andy's saffron rice tachin recipe but omitting the barberries from the rice because there were enough in the chicken for me. AnonymousToronto3/6/2020this came out deliciously! would def make again. added in two chopped fresno peppers for a bit of extra heat and substance. and ate with couscous :)new york3/1/2020Explore Bon AppétitPersianMiddle EasternChicken LegChickenPoultryOrangeCitrusFruitChicken ThighChicken DrumstickEasyOne-Pot MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishPassoverHanukkahRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Andy Baraghani"]}