{"id": "8ae3e17514185104ded29d995f72bdec", "url": "https://www.bonappetit.com/story/tangy-cabbage-stir-fry", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "This Cabbage Stir-Fry is the Fastest Way To Turn a Head of Cabbage into Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tangy Stir-Fry Is the Fastest Way to Turn a Head of Cabbage Into DinnerMemorize this stir-fry sauce.By Betty LiuJanuary 25, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As a healthcare provider working in the midst of a global pandemic, I try to limit my trips to the grocery store, which means buying longer-lasting vegetables. A sturdy, reliable Napa cabbage, which lasts for weeks in the fridge, is one of my favorites. There are so many ways to use cabbage, but my standby is this deceptively simple cabbage stir-fry. It also comes together in less than 15 minutes.My dad made this dish for me all the time when I was a kid. Though he grew up in Shanghai, his parents and extended family are from Sichuan, so his palate and cooking incorporated a bit of both places: a balance of salty and sweet (though heavier on the latter), a love of black vinegar, a deep appreciation for warming aromatics, and the heat that Sichuan is famous for. This dish—slightly wilted but still crispy cabbage coated in a tangy sauce—is a great reflection of my dad’s cooking, as well as a gateway to simple vegetable stir-fries.Here’s how you make this cabbage stir-fry: Separate the leaves of 1 head Napa cabbage and rinse thoroughly. Tear into chunks and separate the leaves (the top two-thirds of the cabbage) from the stems (the bottom third). Thinly slice 3 cloves garlic. Coarsely chop 1 dried chile pepper. In addition to the garlic and pepper, use any other aromatic you desire: Sometimes I will toss in sliced ginger or scallions or a piece of star anise. In a small bowl, mix equal parts soy sauce and black vinegar with small amounts of salt, sugar, and cornstarch. I use 1 Tbsp. soy sauce and 1 Tbsp. black vinegar with ½ tsp. salt, 1 tsp. sugar, and 1 tsp. cornstarch. If you want a saucier dish, double these quantities. If you don’t have black vinegar, you can substitute with rice or balsamic vinegar. Or try punching it up with fermented black beans or pixian doubanjiang.Heat your wok over high heat until hot. Add about 1 Tbsp. neutral oil and swirl to cook, then add garlic, chopped dried peppers (toss in some Sichuan peppercorns if you’d like) and “explode into fragrance.” Reduce heat a bit, then add the cabbage stems first, cook for a minute, toss in the leaves, cook for 30 seconds, until just wilted, then add your sauce. Stir-fry quickly to combine. This general flow for stir-fry can be applied to many other greens, and the varieties are endless. I love doing this with bok choy, yu-choy, water spinach, chives, or bean sprouts.  If you're using a green that will take more time to cook (such as asparagus or broccoli), simply cover with lid and let the veg steam with the sauce for five minutes before serving. The resulting dish should have tangy sauce clinging to the cabbage, which still retains some crunch, with a slow heady heat from the pepper. I eat this with rice or congee, and the tangy flavor pairs wonderfully with meats such as beef, pork, or lamb. Cabbage does it again.Goes well with congee:Pork and Shiitake CongeeSince congee can take hours to make on the stovetop, we came up with a clever trick: Rinse the rice and freeze it overnight. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Betty Liu"]}