{"id": "8af9adb077c631f24fd2ab09bd012d76", "url": "https://www.bonappetit.com/story/kora-organics-turmeric-mask", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Kora Organics Turmeric Brightening Mask Works Great If You Use It Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Love This Turmeric Mask from Kora Organics Despite Its Unfortunate ColorThe 2-in-1 mask promises a lot of benefits, but will it turn me into Miranda Kerr?By Deanna PaiSeptember 4, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThese days, creating a beauty brand is a predictable move for supermodels, likely because they embody the sort of beauty that the rest of us can only get with the help of an introductory skincare kit starting at $39.95. Order now and you’ll qualify for free shipping! Cindy Crawford founded Meaningful Beauty, Lindsay Ellingson created Wander Beauty, and Tyra Banks developed Tyra Beauty, as Tyra would.But Miranda Kerr was one of the first to go green back in 2009 with KORA Organics, a line that offered organic skincare before clean beauty earned its own seal in Sephora (which, by the way, KORA Organics now sports). This summer, she added a turmeric mask to the lineup, and I was intrigued. Turmeric is one of those skincare ingredients that hasn’t broken into the mainstream the same way probiotics and argan oil have, even though it’s been used for centuries by brides in India, Pakistan, and Bangladesh to give skin a prenuptial glow.KORA Organics 2-in-1 Turmeric Brightening & Exfoliating Mask is all about it.  “I essentially wanted a product that delivered a post-facial glow that can be done at home or when traveling in one simple step and in under 10 minutes,” Kerr tells me. “But it’s still gentle enough for use on sensitive skin.” According to the brand, the spice—which is known as much for its golden color as its healing properties—does everything but plan your wedding. It calms inflammation, reduces redness, soothes sensitive skin, and minimizes the appearance of dark spots, leaving you with brighter, more even skin. Those are some pretty lofty claims, so I wanted to put it to the test.Upon my first use, I’m relieved to find that the mask, which feels and looks like a thick scrub, does not smell anything like turmeric. No offense to turmeric proselytizers, but I used to ruin green smoothies with a heaping teaspoon of the stuff back when I believed that it really had anti-tumor properties. (I no longer buy into this, seeing as I’ve been diagnosed with a rare liver cancer three times.) In fact, it smells minty and herbaceous. And it’s not yellow but an unfortunate brown color best described by my boyfriend kindly asking: “Did you fall into a toilet?”The granules keep it from going on evenly. I can’t tell exactly which ingredient gives it that grit, but the parade of powders—rosehip seed, arrowroot root, camellia leaf, noni fruit, and bamboo—on the list make me think it’s probably that combo. But, unlike a scrub, this mask dries and did so well enough that I forgot about it and left it on for a half hour. (The recommended timeframe is five to 15 minutes). But there was zero irritation or dryness. And while I did feel a slight tingling at first, which I’m guessing is from the papaya enzymes dissolving my dead skin cells, it subsided within a few minutes without ever getting close to stinging or burning.While rinsing it off, I began to massage it into my skin. If you have sensitive skin, you should probably avoid doing this, as you’re then getting double the exfoliation from both 1) the enzymes and 2) the granules, which can be harsh and potentially exacerbate sensitivity. My skin is like rhino hide, and even I had to switch to splashing water on my face. Save the scrubbing for when you’re using it only as an exfoliator, which, to be fair, is its second purpose—hence the 2-in-1 in its name.My skin definitely looked brighter and felt softer after that one use, although it didn’t do a damn thing for the clogged pores on my forehead, which result from stress and manifest as little bumps. But I noticed that some post-inflammatory hyperpigmentation on my skin, a.k.a. the dark spots that always follow a zit on my deep-olive skin tone, seemed lighter and less noticeable. Within two uses of the mask, they went from requiring an extra dab of concealer to disappearing seamlessly under my tinted SPF.Turmeric might really be the real deal. I’m sold—plus, it’s far less drying and stripping than the clay masks I used to slather on in high school. If anything, this mask serves as a nice break from the more intensive exfoliating acids I use on a regular basis, as long as I don’t scrub it in when I rinse.And, okay, while I haven’t yet transformed into a giraffe-like goddess, the smoother, brighter skin is good enough for now.Explore Bon AppétitOrganicTrendsHealthyishNatural BeautyShoppingRead MoreLifestyleHerbivore Prism Is the First Natural Exfoliator I've Tried That Really WorksBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast", "Deanna Pai"]}