{"id": "8afcdec5f6a53fe94efa24642f1d1dfa", "url": "https://www.bonappetit.com/story/new-school-cast-iron-skillets", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "The Best Cast-Iron Pans 2021: Lodge, Victoria, Smithey, and More | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Need a Cast-Iron Skillet for Nearly Everything It’s dependable, reliable, perfect. By Lauren JosephJune 16, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There are fussy, transient kitchen friends: your favorite sponge, for example, which needs to be replaced with annoying regularity, or that delicate stemware you purchased and broke within the same month. Then there are those few kitchen tools which need almost nothing from you and last long enough to become heirlooms. That’s your cast-iron pan. If you’ve already got one, move on! It never needs replacing. After all, the best cast-iron pan out there is really just any one you choose to love and hold for decades—because, with a little care and tenderness, that’s how long it’s going to last you. But if you’re in the market for one (or somehow still need to be convinced) read on; we’ve got you.  Why do I want a cast-iron pan again?This heavy-duty, even-heating, satisfyingly-weighty skillet is a kitchen staple because of its versatility. A regular, lightweight stainless-steel frying pan gets hot quickly, but it doesn’t have the heat retention capabilities of cast iron. And while a nonstick pan is ideal for scrambled eggs and crispy-skinned fish, many are not oven-safe, and the ones that are shouldn’t be exposed to super high temperatures. But a cast-iron pan is as useful on the stovetop as it is in the oven, as dependable for braising as it is for shallow-frying. It’s ideal for Dutch babies, frittatas, or these aromatic chicken thighs. Cornbread, obviously. Roast a whole chicken in your cast-iron, and you’ll find that the combination of low sides and great heat distribution leaves you with perfectly bronzed skin, jammy lemon slices, and gorgeous, already reduced drippings. And lastly, it’s pretty much unparalleled when it comes to getting a great sear on pork chops or a New York strip steak.Our very own Kendra Vaculin shows off all the ways to put it to work.\nBut what if I don’t know how to season it? When you first get your pan, you’ll want to season it (some pans will come labeled as pre-seasoned, but another coat doesn’t hurt). To do this, just lightly rub a bone-dry pan with a thin layer of neutral vegetable oil and place it upside down in a scorching oven—500°F should do the trick. Leave for an hour, remove, let cool, rub with a tiny bit more oil, and store. You can reseason as many times as you’d like to build up a glossy nonstick surface; when the pan looks dull or dry, it’s time to moisturize.All right, what’s the best cast-iron pan?First, a note on size. Ten or 12 inches is ideal here; anything larger and heavier, and you might have a hard time lifting it from cooktop to oven easily. Within the 10- to 12-inch cast-iron skillet category, you have plenty of options: starting with pre-seasoned or unseasoned. It doesn’t really matter which one you choose because we recommend seasoning your pan regardless.Then, as far as brands go, you’ve got choices. Classic, heritage brands like Victoria and Lodge have been making high-quality, traditional cast-iron cookware for over a century. But you could also opt for a new-school pan like those from Smithey Ironware or Field Company. If you skimmed right over that section on seasoning with a feeling of dread in your stomach, go for a pre-seasoned Lodge skillet, which will set you back less than twenty bucks. You’ll get a little leg up on the seasoning (sear a rib eye with it fresh out of the box!), and you might feel less anxiety as a cast-iron newbie.Lodge Cast-Iron Skillet$20 at AmazonA similar but slightly larger pan is the 12-inch Victoria. This one is beloved for its two pour spouts, a long handle that stays cool-ish plus a helper handle, and its smooth cooking surface, which heats incredibly evenly. It also comes pre-seasoned; the slick coating is 100% non-GMO flaxseed oil.Victoria Cast-Iron Skillet$20 at AmazonIf you often find yourself cooking for one (or just want a really high-end small cast-iron pan) consider this highly polished pan from Smithey Ironware. Smithey, which is a small maker based in Charleston, gives this pan such a glossy sheen that the surface is quite nearly nonstick.Smithey Cast-Iron Pan$160 at Food52Another one on the pricey but gorgeous side is the 13⅜-inch pan from Field Company, also made in the USA. Yes, it’s larger—but this one is lighter than most cast-iron pans, so if you’re after a roomy skillet, this is the one for home cooks who lack the upper-body strength of a rock climber.Photo by Alex LauThe Field Skillet$245 at Field CompanyHow do I wash it?You may not chuck it in the dishwasher, but it really doesn’t require much love. To clean it, simply wipe a damp rag across its surface after cooking, then dry thoroughly. Often, that’ll be enough. But if there are any crusty bits, try pouring coarse salt in there and going at it with a Tawashi scrubber, which has soft bristles that whisk away any detritus. Many will tell you to avoid soap at all costs lest you ruin your careful seasoning, but a little soap is fine—just don’t let it sit in hot water. Kamenoko Tawashi Scrubber$6 at AmazonFor really baked on crumbs, try The Ringer, a handy chain mail scrubber that easily rinses clean between uses. After cleaning, be sure to wipe your fry pan very dry—this is key for preventing any rust spots. Then take a teeny bit of neutral cooking oil, smear on a paper towel, and give it a light coating. Take care to get the handle and the bottom as well as the cooking surface, as rust can crop up anywhere. And you’re good to go! It sounds involved, but it really only takes a few minutes. (A well-seasoned pan takes virtually no time at all, so dutifully season and you’ll be rewarded.)The Ringer$18 at AmazonExplore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-16", "author": ["Condé Nast", "Lauren Joseph"]}