{"id": "8b01235ccc0a621c7aefc7d2bc29430c", "url": "https://www.bonappetit.com/story/amchur-powder-chicken-recipe", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Amchur Is The Reason I Make This One and Only Indian-ish Marinated Chicken | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe One and Only Indian-ish Marinated Chicken I MakeIt hinges on the power of one ingredient. By Priya KrishnaNovember 11, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Kat BoytsovaFacebookTwitterEmailWhen my cooking really impresses people—you know, those occasions when a person asks, “What is….that flavor?” while lapping up the sauce on her plate with an index finger—my response is usually the same.“It’s the amchur.”Amchur is the secret ingredient in the only chicken recipe I make. It’s what makes my chickpea stews complex and slightly tangy. My peach smoothies extra interesting. It’s the unassuming packet of brown stuff in my cabinet that I reach for more often than almost any other spice.Amchur is a bit of genius in Indian cuisine for which I salute my ancestors deeply. It is mango powder, made from taking unripe mangoes, letting them dry out in the sun, and then blitzing them into a powder. The result is intense and sour. It’s a flavor that hits you right in your salivary glands and makes you want to take another bite. Who would have ever thought to turn disappointing fruit into a spice? Enterprising Indians, that’s who.Watch Priya make her famous amchur chicken.\nI use amchur when a dish is in need of acidity and I don’t have lime or lemon on hand. Alternately, I use amchur when I want sour with a little more depth than citrus. In Indian cuisine, amchur is often added to dishes that need tanginess but not moisture: a batter for a pakora (a spiced, fried fritter), or a filling for a samosa. Amchur is the key ingredient in chaat masala, that funky spice blend that I also put on everything. The reason you find yogurt-slathered papdi chaat or aloo tikki so craveable is probably the amchur.The most inspired use for amchur that I’ve encountered is my aunt Sonia’s famous chicken recipe. When I say “famous” I mean famous among the 20 or so of my family members who she makes it for on vacations. It is the only chicken recipe in my cookbook, Indian-ish, because it is the only chicken recipe that I need in life. Amchur is the absolute best spice for imparting tons of flavor on the much maligned boneless, skinless chicken breast. But for years, Sonia would not share the recipe. On vacations, she would disappear into the kitchen and return with a resealable bag filled with chicken and the bright yellow marinade. None of us were allowed to know what was in it. Not even my cousin Isha, her only daughter!I asked her repeatedly for the recipe, and finally, she gave in. That’s when I learned that what makes the chicken so great is the small but mighty teaspoon of amchur in the marinade. The amchur plays double duty in this recipe: it not only adds this pungent, lively flavor to the chicken, but because of its acid content, it also tenderizes the meat during the marinating process.I doubt that I have even scratched the surface of all the things amchur can do. I want to mix it into a margarita for a refreshing cocktail. I want to add a pinch to softened butter and lather it onto grilled corn. I want to churn it into ice cream! Toss a spoonful into any winter stew to add a burst of brightness. What about sprinkling amchur straight onto ripe (or frozen) mango, for a mango-on-mango situation? Why not?! The winter is long and my amchur stash is large.Buy it: Amchur Powder, $7 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Get the recipe:Garlic-Ginger Chicken With Cilantro and MintBoth the marinade and the cooking method (low and sort of slow) have a huge payoff: Charred, spicy, juicy chicken.View RecipePriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, is now out from Houghton Mifflin Harcourt! Follow her on Instagram @PKgourmet.Explore Bon AppétitIndianishChickenSpiceRead MorecultureThe Indian Spice Mix I Put on Almond Butter Toast, and Everything Else HonestlyBy Priya KrishnacookingYour Baked Potatoes Need This Sharp and Spicy Indian-ish UpgradeBy Priya KrishnacultureThe Indian-ish Grilled Cheese That’s Even Better Than Grilled CheeseBy Priya KrishnacultureOur April Cookbook Club Pick Is Priya Krishna’s Fantastic and Fun ‘Indian-ish’By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-11", "author": ["Condé Nast", "Priya Krishna"]}