{"id": "8b055f64b064db41d735994d4c628417", "url": "https://www.bonappetit.com/story/madhouse-at-the-end-of-the-world", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Madhouse at the End of the Earth: a Doomed Antarctic Expedition, Insanity, and Penguin Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Doomed Antarctic Expedition, Insanity, and Penguin MeatIn Madhouse at the End of the Earth, men trapped in Antarctica for a long, cold winter realize they can’t subsist on canned meat alone. By Alex BeggsMay 7, 2021FacebookTwitterEmailIllustration by Klaus KremmerzFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I spent three days in Antarctica aboard the Belgica recently, well, in the only way that’s ever going to happen for me: with a book. I started reading Madhouse at the End of the Earth, Julian Sancton’s account of a dark and doomed expedition to the South Pole in 1897, and I couldn’t stop. I skipped all my weekend chores. I carved a groove into the couch, huddling under a big blanket because, I’m telling you, reading this book makes you feel cold. And scared. And hungry.The story of the Belgica, the name of the ship we’re on, is that a ragtag bunch of men led by the explorer Adrien de Gerlache sailed to Antarctica with the hopes of sticking a Belgian flag on the South Pole. By the time they get to Antarctica, though, winter is quickly encroaching and the ship gets trapped in the rapidly growing sea ice. They’re stuck. Food becomes the key to their survival, and the book is so detailed you can almost smell and taste it as you read. But what you’re smelling and tasting isn’t pretty.Men aboard the Belgica feasting on canned mush. Good thing they packed wine.\nPhoto courtesy Fram MuseumThe book reads like an adventure novel thanks to Sancton’s meticulous research. (Disclosure, I worked with Sancton a decade ago at Vanity Fair when I was an intern. I transcribed his interviews with celebrities, which were less exciting than this book.) We know almost everything that happened on the ship, including what crew members ate, because nearly all of them kept a diary—though one journal was burned for containing too many horrors.De Gerlache, the commander, stocked the galley with what he thought was a gourmet array of canned meals for every occasion: beef tongue, stewed hare, blanquette de veau. But the cranky French chef he hired to cook for them got kicked off the ship at an early port, so the only way they eat the canned food is heated into mush. Every night. For months.“How we longed to use our teeth!” wrote Frederick Cook, the American doctor on board who would later become a world-famous suspected con man (!) when he claimed to discover the North Pole (he didn’t). Cook had regular check-ins with his crewmates over the long Antarctic winter, during which the sun disappears for six months and so does a man’s sanity. He heard two major complaints from the men. “One was the absence of female companionship,” Sancton writes. “The other, more urgent, cause of dissatisfaction was the canned food the men now depended on almost exclusively.”“The soft, colorless gobs the men found on their plates every night bore little resemblance to whatever dish was promised on the can’s label. Particularly revolting to most were kjøttboller, the spongy meatballs that de Gerlache had purchased in Norway...In an effort to vary the flavors, Michotte [the appointed “chef”] would often mix the cans together into a nondescript stew, which was somehow less than the sum of its parts.”All they had to look forward to, for six sunless months, was dinner. But even that became hard to stomach.The first time they cooked up a slab of penguin meat, the only game in town (the town = huge glaciers of ice and nothing else), “it tasted somehow like both fish and fowl, with a gamey tang.” They decided never to eat it again. Until, that is, a few weeks go by, and the men’s health begins to deteriorate. Their heartbeats were speeding up and slowing down, some had droopy bags of liquid gathering under their eyes, lethargy was rampant. The ship’s first mate, Roald Amundsen, was getting especially sick.Cook recognizes their symptoms as scurvy, and without fresh fruit, vegetables, or meat, they could die of it. He convinces the Belgica boys to give penguin another try, along with seal meat. (Cook had spent time with the Inuit during a previous harrowing Arctic journey and observed that they survived the winter on meat and blubber, often raw.) Cook preferred his penguin steaks lightly seared, but recommended everyone eat them rare if possible.“Remarkably, after just a few days of guzzling down the cutlets, which had the consistency of fatty, uncooked chicken, Amundsen was almost back to normal,” Sancton writes. They didn’t know then what we know now, that the meat contains vitamin C, which is crucial to creating collagen in the body.Scurvy is one of a laundry list of nightmares encountered by the men on this big rat-infested ship in the middle of the Antarctic ice. But the rest are outside the purview of this food publication, so you’ll just have to read the book to find out.Courtesy Crown Publishing Madhouse at the End of the Earth$30 $16 at AmazonExplore Bon AppétitBooksAntarcticaTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-07", "author": ["Condé Nast", "Alex Beggs"]}