{"id": "8b0aee5b211d49abee8ce01d37ca5649", "url": "https://www.bonappetit.com/story/current-cassis", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "I’m Still Wearing Sweaters, But Current Cassis Liqueur Is My First Taste of Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Still Wearing Sweaters, But Current Cassis Is My First Taste of SpringThe herbaceous, ripe black currant liqueur is like liquid Daylight Saving Time.By Aliza AbarbanelMarch 15, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I promise I’ve tried to be a good sport this winter. I’ve brewed hot toddies, dodged toddlers while skidding off the side of Fort Greene park on a borrowed sled, and become besties with my Dutch oven. But there comes a time—March, to be exact—when my brain gives up on seasonality and starts to fixate on spring. But instead of pining for ramps and rhubarb, I’m pinning my hopes on Current Cassis.The Hudson Valley–made black currant liqueur is a take on crème de cassis, a specialty of Burgundy known for lending deep berry, syrupy sweetness to wine cocktails like a Kir Royale. Current Cassis owner Rachael Petach fell for the spirit while WWOOFing on organic farms in France, and years later, decided to make a new interpretation that goes big on herbaceous, almost savory flavor.Crème de cassis is traditionally made from macerating grain neutral spirits with just sugar and black currants (a.k.a. cassis), but Petach flavors her lightly fermented fruit with wild honey, whole green cardamom, lemon verbena, and citrus rinds. The process happens just a few miles from where the black currants are grown—a feat that would have been illegal (!) for most of the 20th century.While currants are popular across Europe, they have a limited fanbase stateside because the federal government banned currant-growing back in 1911. The fruit was thought to harbor a tree-damaging disease called white pine blister rust. Disease-resistant strains were cultivated over time. The federal government left regulation up to the states in 1966, and in 2003, a Hudson Valley fruit farmer named Greg Quinn pursued New York to lift the ban. His black currants form the base of Current Cassis today.As a die-hard fruit lover who awaits the arrival of winter citrus and summer peaches like a sneaker drop, I love that I’m supporting the resurgence of currants with this drink. But it won a permanent spot on my bar cart for taste and versatility, too. At 16% ABV, it’s perfect for sipping straight over ice or spiking a Tuesday night glass of seltzer. On Valentine’s Day, I poured a splash atop cava for a take on a Kir Royale, and when an unwelcome snow storm hit the following week, I even added some to a mug of hot apple cider. But most nights, I ignore the weather report and mix cassis with seltzer for a simple spritz that feels like spring.Current Cassis$27 at Dandy Wine and SpiritsExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-15", "author": ["Condé Nast", "Aliza Abarbanel"]}