{"id": "8b127f9e8d11298da3e79e2fc8fea2be", "url": "https://www.bonappetit.com/recipe/best-old-fashioned", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "BA's Best Old-Fashioned  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2016 IssueBA's Best Old-FashionedBy Rick MartinezMay 5, 20212.9(30)Read ReviewsTriangleEmailPinterestPrintHeidi's BridgeEmailPinterestPrintEmailPinterestPrintOriginally called the Whiskey Cocktail, this cocktail is one of the oldest around—and it never goes out of style. A great old-fashioned recipe is all about simplicity, ingredients, and technique. Start with the sugar and bitters (orange, if you please), and use warm water and plenty of stirring to help dissolve the sugar before adding ice. Opt for large ice cubes so they won’t melt quickly and dilute the drink. Though we prefer rye whiskey here thanks to its peppery, spicy bite, if you like a slightly sweeter, caramel flavor, use bourbon. Whichever spirit moves you, make sure to stir the drink for 20 seconds to fully incorporate the ingredients and chill it thoroughly.Editor’s note: This recipe was originally published December 8, 2016.IngredientsMakes 11teaspoon raw or granulated sugar3dashes bitters2ounces rye whiskeyOrange wedge (for serving)Maraschino cherry (for serving; optional)PreparationStep 1Stir sugar, bitters, and 2 tsp. warm water in a rocks glass until most of the sugar is dissolved. Step 2Add 3 ice cubes and pour rye over. Stir 20 seconds to chill cocktail and dilute whiskey. Garnish with orange wedge and cherry, if using.How would you rate BA's Best Old-Fashioned ?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleA wedge!? The whole point of an old fashioned is to blunt the whiskey and accentuate its flavor notes. An expressed peel is perfectly suited to do just that, I would only use a wedge if the whiskey was really low quality. Should really suggest types of rye whiskey as well, especially with Canadian rye becoming popular anyone reading this recipe would assume that would be fine as well without realizing how incredibly different Canadian rye taste to American rye crajoro5/26/2020Explore Bon AppétitCocktailDrinks AllRye WhiskeyWhiskeyAlcohol & Other DrinksEasy5 Ingredients or FewerDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-12-08", "author": ["Condé Nast", "Rick Martinez"]}