{"id": "8b18a66e086c5b13a2c61f0fad24097a", "url": "https://www.bonappetit.com/story/the-caker-box-cake-mix", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "The Box Cake Mix From The Caker Is So Luxe, No One Will Believe It Came From a Box | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Cakes Are So Luxe, No One Will Believe They Came From a BoxFor when you want a cake that looks like it’s from a $$$ bakery, but you def don’t own a stand mixer.By MacKenzie Chung FeganDecember 28, 2020FacebookTwitterEmailPhoto by Liz BarclayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Let’s not beat around the bush: This is a $25 box cake mix. That’s $23.71 more than a Betty Crocker SuperMoist vanilla cake mix at Target, and I am deeply sorry for introducing the word SuperMoist into your day. So, if their competition is another box cake mix, the Caker’s boxed kits are shockingly expensive. But if you accept that they have more in common with a $50 cake from a high-end bakery than they do with an industrially produced mix that contains “propylene glycol mono and diesters of fatty acids,” then they’re actually a pretty great deal.The Caker is the brainchild of Jordan Rondel, a self-taught baker from New Zealand who bears a resemblance to a young, tattooed Jane Birkin. She opened her Auckland bakery a decade ago, selling beautiful but unfussy cakes with naked sides, strewn with fruit and topped with pert roses. Now living in L.A., she saw a market for her lemon strawberry poppyseed, flourless dark chocolate, and matcha cherry cakes—but in mix form, without the stabilizers and additives found in many commercial boxed offerings.You—yes you!—can make this.\nPhoto by Liz BarclayThe fudgy and rich flourless chocolate cake is the runaway hit of the trio. Pop open the box and the price point starts to make sense. There’s the pouch with the dry ingredients—sugar, almond meal, and Dutch-process cocoa powder—but there’s also a bag of Callebaut dark chocolate callets and a sheet of edible gold leaf. Premium! You’ll need to provide your own butter, eggs, and cake pan, but a handy precut circle of parchment is included. After 50 minutes of bake time (the instructions say 40, but I found all three cakes needed longer in my oven), the cake is ready to be speckled with gold leaf and served, if you so choose, with a dollop of lightly sweetened crème fraîche (not included).The flourless chocolate cake is by nature gluten-free, and although the lemon strawberry poppyseed and matcha cherry cakes aren’t, they too contain some almond flour. This lends all of the cakes a moist (dare I say, SuperMoist?) consistency with a dense crumb—think custardy and tender, not light and springy. The poppyseed and matcha cakes can also be made vegan; simply swap in alt-milk and oil for cow’s milk and butter. And while you will need to provide your own fresh or frozen fruit for the non-chocolate flavors, the kit includes everything you need for decorating. That’s the gold leaf for the chocolate cake and a glaze and freeze-dried fruit for the other two. Even without Rondel’s signature fresh flowers, the cakes look like they’re straight from an expensive bakery. Who would believe a cake dripping in gold came from a box?Wini LaoThe Caker Cake Kits$25 at The Caker (Single)$150 $106 at The Caker (6-Pack)Explore Bon AppétitHighly RecommendShoppingproductCakeDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-28", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}