{"id": "8b1800a6d179c935bfd876e2aadf20b0", "url": "https://www.bonappetit.com/recipe/coconut-milk-braised-carrots-with-coconut-dukkah", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Coconut-Milk-Braised Carrots With Coconut Dukkah Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueCoconut-Milk-Braised Carrots With Coconut DukkahBy Andy BaraghaniFebruary 9, 20213.9(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Yudi Ela, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“This is something I do often: Take a spice and turn it into a dry, savory sprinkle,” says Andy Baraghani. “For this nut-free riff on Egyptian dukkah, I toast coriander seeds (the ones from Burlap & Barrel are especially fresh tasting) and sesame seeds, then crush them in a mortar and pestle with shredded coconut flakes and dried chiles. This lends heat, sweetness, and crunch to these tender coconut-braised carrots. And it lasts for a few days, so I dust it on everything: soups, stir-fries, oats.” Look for big, meaty carrots, which char nicely and won’t fall apart as they slowly braise in the spicy coconut milk mixture.Ingredients4 servings3Tbsp. virgin coconut oil or vegetable oil1½lb. large carrots (about 6), scrubbed, sliced on a deep diagonal into 5\"-long pieces1lemongrass stalk, tough outer layers removed, trimmed, finely chopped4garlic cloves, finely chopped1small red chile, finely chopped, or ½ tsp. crushed red pepper flakes11\" piece ginger, peeled, finely chopped113.5-oz. can unsweetened coconut milk2tsp. fish sauce (optional)Kosher salt⅓cup unsweetened coconut flakes1tsp. coriander seeds1tsp. toasted sesame seeds½cup mint leaves, torn if largePreparationStep 1Preheat oven to 400°. Heat oil in a large deep skillet over medium-high. Cook carrots, turning once, until golden brown in spots but still very firm and crunchy, about 6 minutes. Using a slotted spoon, transfer carrots to a plate. Reserve pan with oil.Step 2Mash lemongrass, garlic, chile, and ginger to a coarse paste with a mortar and pestle. (Alternatively, you can chop very finely with a chef’s knife.)Step 3Set reserved skillet over medium heat; add paste. Cook, stirring often, until paste starts to soften and is golden, about 3 minutes. Pour in coconut milk and fish sauce (if using). Season with salt; bring to a simmer. Remove from heat, add carrots, and bake in oven until carrots are tender and sauce is thickened, 25–30 minutes.Step 4Meanwhile, toast coconut flakes in a dry small skillet over medium heat, shaking pan occasionally, until golden, about 3 minutes. Transfer to a small bowl; wipe out skillet.Step 5Toast coriander seeds in same skillet over medium heat, shaking pan often, until slightly darkened and fragrant, about 2 minutes. Transfer to mortar and pestle and let cool, then coarsely grind (or lightly with flat side of chef’s knife). Add coriander and sesame seeds to coconut flakes; season lightly with salt. Crush coconut flakes with your hands until almost uniform in size with seeds.Step 6Transfer carrots to a platter and top with mint and some coconut dukkah. Reserve extra dukkah for another use.Do ahead: Coconut dukkah can be made 3 days ahead. Store airtight at room temperature.How would you rate Coconut-Milk-Braised Carrots With Coconut Dukkah?Leave a ReviewTell us what you thinkExplore Bon AppétitCarrotVegetableLemongrassHerbs & SpicesWeeknight MealsSideDairy-FreeGluten-FreeHealthyishBraiseRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Andy Baraghani"]}