{"id": "8b388834e5c7ca544fff05b0f2d198ad", "url": "https://www.bonappetit.com/story/its-that-simple-pork-and-cabbage-hot-pot", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "This Pork and Cabbage Hot Pot Is Mesmerizing—and Super Easy to Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pork and Cabbage Hot Pot Is Mesmerizing—and Super Easy to MakePork belly, Napa cabbage, repeat. I can't stop making it!By Elyse InamineApril 18, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.Every other text to my husband is some variation of this message: “Can you bring home some Napa cabbage and pork belly?” In fact, I texted him that just now (after sending screenshots of memes I thought were funny. We keep our marriage spicy!).That’s because tonight, like many nights in the Inamine household, is mille-feuille nabe night. What is mille-feuille nabe, you may be wondering? You could consult the Internet; it’s not going to help you that much. Instead, listen to me! It’s a nabe, or a kind of Japanese hot pot in which you quickly simmer raw ingredients in a light broth, but just way more beautiful. Hence, the “mille-feuille” part, which means a thousand layers in French, and here it refers to the mesmerizing presentation of this particular nabe: concentric circles of fat-rimmed pork belly and frilly Napa cabbage, organized into some kind of savory Edible Arrangement and simmered in dashi until slack and succulent.It’s my go-to recovery meal after too many days in a row eating out. “It tastes so clean,” I always tell my husband happily as I slurp the dashi-soaked cabbage and slippery bits of pork belly. I love how these few ingredients make the most fortifying meal, one that I crave just as much during the summer as I do during winter (that’s what A/C is for, people!). Plus, it just looks so...tidy—tidy, in that immensely satisfying way you feel when looking at color-coordinated cookbook shelves or watching Marie Kondo fold anything. Instagram agrees with me: Every time I post my nabe, pre-simmering, my few followers freak out, asking me how to make it. So, this is also for you, my loyal likers.But I also love the mille-feuille nabe because it couldn’t be easier to make, as you can tell from the last-minute dinner decision thing. First, you need dashi. I’m a big fan of legendary cookbook author Elizabeth Andoh’s recipe, which calls for heating up some kombu and water until it starts giving off steam. Then I turn off the heat, toss out the kombu, and throw in some bonito flakes to steep for a few minutes before straining. (You can find our very similar recipe here, but can also use whatever tasty broth you have on hand in a pinch!)It all starts with dashi, the easiest two-ingredient soup base ever.\nPeden + MunkNext is my version of self-care: prepping and assembling the mille-feuille nabe. I pull off, wash, and pat dry four leaves of Napa cabbage, then layer each one with thin slices of pork belly. (You can easily find this kind of cut in the hot pot meat section of any Asian grocery store, or just partially freeze some pork yourself and cut into thin, bacon-like slivers with a sharp knife.) I stack the pork-covered cabbage leaves, and then I cut the stack into thirds and delicately slip each section into a donabe or a small pot, cut side up, to create a radiating circle effect. Depending on how big the pot is, I repeat this process three or more times, using up about ⅓ of a huge Chinatown grocery-level cabbage and about ¾ pound of meat total. There’s a rhythm to putting it together, but also just looking at it makes me feel accomplished (does any other food encourage you in this way?). Once every inch of the pot is brimming with raw meat and cabbage, I add enough dashi to cover the ingredients and come to about an inch below the pot’s edge. Then I set it on the stove to simmer, covered, for about 5 to 10 minutes, just until the pork belly is cooked through and the cabbage is still a little crunchy. So fast!Still hot and gurgling, I bring out the mille-feuille nabe to the table and serve it with some hot rice or simply-cooked udon noodles and maybe some ponzu, a citrus-flavored soy sauce, or Japanese chile flakes. Dipping the velvety squares of pork belly and cabbage into the ponzu, lapping up the delicate broth, and slurping up some noodles in between—this is why most nights become mille-feuille nabe night.Other ways to get your fill of hot pork and cabbage:A Rent Week Lentil Soup Recipe to Improve Your Home DecorLentil soup is a Rent Week classic, especially when it's cold outside...and you have to buy a credenza.View StoryExplore Bon AppétitIt's That SimpleBasicallyPorkPork BellyNapa CabbageSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-18", "author": ["Condé Nast", "Elyse Inamine"]}