{"id": "8b3af041bcb69c3e2d7042acc0090e36", "url": "https://www.bonappetit.com/story/pearl-morissette", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "The Restaurant at Pearl Morissette Offers a Tasting Menu for the Climate-Conscious Era | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Restaurant at Pearl Morissette Offers a Tasting Menu for the Climate-Conscious EraRegenerative agriculture inspires exhaustive experiments in local flavor at Jordan Station’s fine-dining gem.By Aliza AbarbanelNovember 7, 2019FacebookTwitterEmailSuech + BeckFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.Should you ever find yourself in the (extremely privileged) position of scoring a table at a restaurant that’s perpetually booked up three months in advance, it’s best to arrive on time. But on the afternoon of my lunch reservation at The Restaurant at Pearl Morissette, fate intervened in the form of traffic sparked by the most precious of Canadian commodities: a magnificent late-summer day. And so the hour-long drive from East Toronto out to Jordan Station became a white-knuckled sprint in slow motion, dodging winery tour buses and minivans headed to a pirate-themed amusement park on Lake Ontario’s shore.To make matters worse, Google Maps fails somewhere between the farm stands advertising freshly picked Swiss chard and late-season strawberries. Finally, my partner (in life and fine dining) spots rows of sprawling grapevines with a giant metal red bird sculpture to mark the turn.Pearl Morissette first won acclaim for producing ethereally dry Rieslings and lush Cabernet Francs in a burgeoning wine region that, up until recently, was best known for ice wine—an ultra-sweet dessert wine pressed from frozen grapes. But vigneron and co-owner François Morissette’s low-intervention vineyards make up just one element of a regenerative agriculture ecosystem aimed at increasing biodiversity, both for all-important soil health and sheer idealism.Grapevines on the Pearl Morissette grounds.\nPhoto by Suech + Beck“I like life finding its own pathways,” Morissette says. “There’s nothing natural about a vineyard, so we try to balance it out with living organisms as much as possible.”The 60-acre property is lined with peach trees and fish ponds, flanked by two ominously buzzing bee boxes and a huddle of white Muscovy ducks. After lunch service, white-clad chefs toss vegetable scraps to the best-fed cows in Canada. A 38-seat dining room looks down upon it all, perched on the second floor of a sleek black barn once intended as tractor storage.I’m not a fine-dining devotee who collects tasting menu reservations like Girl Scouts badges, so I’m not quite sure what to expect from chefs Daniel Hadida and Eric Robertson, whose impressively lengthy résumés include stints at Pujol in Mexico City and the (now shuttered) Michelin-starred Belgian restaurant In de Wulf, respectively. As an American who last visited the Great White North as an admittedly clueless 11-year-old, it’s tempting to imagine endless courses of poutine. But Hadida and Robertson have grand plans, and they don’t include cheese curds.Chefs Eric Robertson and Daniel Hadida in The Restaurant at Pearl Morissette's dining room.\nPhoto by Suech + BeckFor six seatings a week, their tasting menu distills regional seasonality into nine (or sometimes, as in our case, 10) dishes, deploying food grown on-site, foraged from the surrounding forests, and sourced from the Maritime coasts. Each menu is carte blanche—a dramatic way of saying there’s no way to look it up ahead of time—which provides excellent opportunity for wild speculation as we ascend to the black barn house and head to our table. We immediately begin inhaling crusty bread smeared in cultured butter, then negotiate the wine pairings.The full 10-course tasting experience draws from international wine producers and select small-batch Pearl Morissette wines that can be difficult to find anywhere else, like the 2017 Cuvée Metis, a zesty, almost acidic Chardonnay that's anything but oaky. For teetotalers (and designated drivers like my dining companion) there’s a nonalcoholic pairing that includes ultra tart apple juice lifted with sage and rhubarb, plus earthy matcha-honey-mushroom kombucha for a mid-meal digestion boost.As it turns out, the first course feels like fairy food: Two delicate radicchio leaves harvested from the restaurant’s garden sandwiched together with sweet figs and striped bass roe, which burst into contrasting salty pops.Plenty of fine-dining restaurants preach the gospel of seasonal local food, but The Restaurant at Pearl Morissette goes a step further by rejecting foreign ingredients. You’ll never taste a dish there with olive oil or avocados, chocolate or vanilla. (Blessedly, coffee and wine are the rare conciliatory exception.) Instead, Niagara local Deirdre Fraser acts as the in-house forager and gardener, sourcing wild mushrooms from the neighboring forest while growing unconventional herbs like syrupy rabbit tobacco and tangy pineapple sage. Meanwhile Hadida spends hours on the phone with local sustainable farmers and east coast fishermen, coordinating cod and razor clam shipments to construct the week’s menu.In summer, there is an abundance of edible flowers.\nPhoto by Suech + BeckThe chefs illustrate the point by presenting their own dishes to the table, explaining the wild sockeye salmon on your plate was caught in British Columbia’s Skeena river and hung for 10 days before being served with egg cream and foraged wild prickly ash (a member of the citrus family native to the Ontario region). Oh, and those raw Newfoundland scallops were dressed with cultured cream plus cantaloupe grown on-site and scooped into tiny balls before being served in a plate-size shell held aloft by wet sand.Mid-bite, it’s easy to forget the ideology behind the food and focus on the pure pleasure of noisily crunching on confit lamb crisped in fat, or inhaling thick-cut brioche topped with an impossibly juicy apricot moon. But sometimes the constraints breed a specific kind of high-minded creativity that’s immediately apparent. Rejecting refined sugar for desserts is hard, but conjuring up caramel from blackberry juice to construct a tiny woven tart shell dolloped with sweetened yogurt and a few plump blackberries? The sheer complexity somehow results in simplicity: an explosion of pure flavor.For those tempted to track down a reservation on the merits of that blackberry tart, resign yourself to the fact that the ever-shifting menu means you might never taste it. Rather, your meal might end with wild juniper cakes, Bosc pear tarts with malted barley, or most likely, something that’s yet to be dreamed up.If it all sounds a little precious, well, you’re not wrong. Every dish is the result of an extraordinary amount of effort. Between the emails, the scouting, and the obsessive tweaking, Hadida estimates working 80 hours a week. Considering this estimate comes from a self-described masochist who can expound about the pitfalls of over-foraging ramps for several minutes and delights in the challenges of fine dining, that feels a bit conservative.“It’s about refining luxury, not as the most expensive or the rarest, but how authentic something is and how much it connects you to a sense of humanity and your place in the world,” Hadida says. “Why can’t we question every way that we can be working more intelligently, efficiently, carefully, honestly, with a greater sense of community and place and time?”Mooooo!\nPhoto by Suech + BeckCaught up in the waves of dishes and my bucolic surroundings, I keep coming back to the intersection of place and time. Morissette says that vineyards are lifelong commitments, and you usually only figure out what you’re doing in the second generation. But restaurants operate on an alternate timeline: In just two years, The Restaurant at Pearl Morissette doubled the length of its tasting menu. Establishing a supply chain of like-minded producers has made life easier, but the dishes themselves have only grown more considered. While I’m not in the camp that believes food has to be complicated to be delicious, the enormous amount of work and thought behind these 10 plates—each one an expression of this particular time and place—certainly doesn’t hurt.Those courses add up, even when scaled down to tasting menu proportions. When a server casually mentions the (optional!) regional cheese plate, we have no choice but to semi-gracefully bow out under the auspices of wandering the grounds. Mainly we take cheesy photos of ducks and amble through the neat herb garden, where hand-lettered stakes mark rows of sweet lavender, sturdy Egyptian onions, and red-veined sorrel. Before we make our way back to the car, I crouch down to touch the dirt.Regenerative agriculture—the driving source of everything on this property—comes down to soil health. It’s not just farming sustainably but maximizing biodiversity to turbocharge the buildup of carbon in the soil through carefully tended vineyards and wandering ducks. So while eating at a restaurant is unquestionably an act of consumption, and making wine is a bit like Bonsai, everything harvested here and placed onto those perfectly composed plates leaves a trace in the earth. The way that Pearl Morissette is able to do more with so much less is an idea that’s stayed with me long after I was back across the border.One final view of The Restaurant at Pearl Morissette before heading out of Niagara.\nPhoto by Suech + BeckSomehow, You’re Still Hungry. Head to These Toronto Hot Spots:Let’s be real: Even after a 10-course lunch, I didn’t fly to Canada to skip dinner. Instead of braving the hordes at Niagara Falls, we headed back to Toronto to decompress, digest, and check out the city’s excellent lineup of dining destinations. From casually romantic wine bars to hangover-curing bagel spots, these spots are worth turning your day trip into a long lazy weekend.Schmaltz AppetizingStart your day at Schmaltz, whose two locations in downtown Toronto and trendy Trinity-Bellwoods fill the bagel-shaped hole in Toronto’s heart (and dining scene). Like the old-school appetizing shops of New York, it offers up a fleet of cured fish and schmear alongside cookies and other goodies. Stuff your pockets with Soom tahini and chocolate rugelach.414 Dupont St., Toronto; Monday–Sunday, 8 a.m.–7 p.m.DreyfusZach Kolomeir, the former chef de cuisine at Montreal’s bacchanalian bistro Joe Beef, opened this French-ish bistro just a few months ago. It’s already made quick work of charming the city’s entire food scene. Chalk it up to the chic Québécois staff, stellar natural wine list, or the handwritten menus showcasing peak produce with classic French touches. (Read: butter, cream, and all other good things.) Grab a seat at the bar along with a plate of pommes dauphine stuffed with trout roe and then order at will.96 Harbord St., Toronto; Tuesday–Saturday, 6 p.m.–11 p.m.Imanishi Japanese KitchenCome here for home-style Japanese food like karaage fried chicken and anchovy potato salad washed down with tall pours of Sapporo. The crowd is young, the music is loud, and the food is ideal for ordering en masse. Don’t skip the single dessert on the menu: a raft of fried brioche with taro ice cream and chocolate crunchies on top. It’s just as indulgent as it sounds—and just as delicious too.1330 Dundas St. W., Toronto; Sunday–Thursday, 5:30 p.m.–11 p.m.; Friday–Saturday, 5:30 p.m.–12 a.m.Seven Lives TacosThis mini Toronto taco empire won an army of fans with its tacos Gobernador, a potent blend of shrimp, melted cheese, and smoked fish originated in Sinaloa, Mexico. Head to its tiny Kensington Market storefront for the full experience and take your precious cargo around the corner to feast in Bellevue Square Park if the weather cooperates.69 Kensington Ave., Toronto; Monday–Sunday, 12 p.m.–7 p.m.Bar RavalThe swooping Gaudi-inspired wood interior isn’t just about Instagram aesthetics—it’s a signal that you’re in the best tapas spot in town. Scour the extensive vermouth list to mix your favorite into a refreshing Spanish Fizz, then double down on orders of stracciatella-smeared toast layered with boquerones.505 College St., Toronto; Monday–Friday, 11 a.m.–2 a.m.; Saturday–Sunday, 10 a.m.–2 a.m.The Annex HotelIf your idea of luxury includes platform beds and Audio-Technica turntables, this is the hotel for you. There’s no bellhop, but text the 24-hour concierge service for late checkout or dining recommendations. Plus, order room service from Big Trouble Pizza and Seven Lives Tacos downstairs.296 Brunswick Ave., Toronto; Rooms from $213 CADWant more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Aliza Abarbanel"]}