{"id": "8b421f7f3665f096d08fd9ff45318e22", "url": "https://www.bonappetit.com/story/best-melting-cheeses", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "The 8 Best Melting Cheeses, For Your Cheese Pull Pleasure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe 8 Best Melting Cheeses, For Your Cheese Pull PleasureYou've got options.By Alex DelanySeptember 25, 2019FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailThere are two types of cheese. There’s cheese that you nibble off a platter, while saying things like, “Hmm, quite nutty.” And then there’s cheese that you melt and stretch and pull and gaze longingly at. But what's the best melting cheese? What varieties get you that gratuitous cheese pull you're after?Generally speaking, younger, fresher cheese is going to give you a better melt. You know, the softer stuff. Within that broad distinction we have some preferences. These are our 8 favorite cheeses to melt on top of sandwiches baked pasta, toast, and chili.BA's best breakfast sandwich is, well, the best.\nAmericanYeah, American is on this list, and yeah, we’re calling it cheese, and it’s the meltiest there ever was or will be. We don’t love this one-noted, creamy cheese on everything, but if you see us making a burger or a breakfast sandwich, we’ll be melting American all over it.Brad's eggplant parm is all about the mozzarella.\nAlex LauMozzarellaYou know the deal with mozzarella. It’s pizza’s best friend, the champion of the cheese pull scenario. Mozzarella, whether fresh or low-moisture, is extremely tame in flavor, so it makes a quick, clean, creamy hit to everything from meatball subs to roasted vegetables.Garlic bread grilled cheese. Enough said.\nPhoto by Josephine Schiele, styling by Ali NardiCheddarShredded cheddar is here for all your oozy dairy needs. Whether you’re topping some chorizo chili or making a classic grilled cheese, shredded cheddar melts extremely well. It also brings that slightly sharp quality to the table to keep things interesting. Speaking of sharpness: If you want melty, go for younger cheddars rather than the aged ones, which have less moisture and don't melt as well.French onion soup, it's French.\nEva KolenkoGruyèreIf you’re making a true French onion soup, gruyère is what you want for that molten, cheesy top layer. It gets bubbly, crispy, and browned under the broiler, and pulls beautifully with each spoon-led expedition into the bowl. Young gruyère is slightly sweet, salty, and nutty, but as you can probably guess, the driving flavor is milky creaminess.FontinaThis Italian cow’s milk cheese has a flavor that isn’t far from a mild provolone, but it is a little more grassy. We’re fans of fontina in frittatas, and grilled cheese.Provolone is killer on a cheesesteak too.\nAlex LauProvoloneNot just any provolone though. We’re talking deli-sliced provolone. And we love it melted over the protein in your sandwich. Roast pork. Chicken cutlets. Meatballs. Sausage. Anything, really. Get the stuff labeled \"sharp\" for a tangier, more aggressive kick.Sub in a little taleggio in a classic mac 'n cheese to keep things interesting.\nAlex LauTaleggioAnother Italian cow’s milk offering. Taleggio has a washed rind, which brings a more pungent aroma to the table, but it’s flavor is much more mellow, with hints of nuts, sweet fruit, and a bit of funk. We like blending in taleggio with other cheeses in dishes like macaroni and cheese, tomato pie, quiches, and savory tarts to make the flavor more complex.RacletteEver see a warmed half wheel of cheese scraped with a knife so all of it falls onto a mountain of potatoes or vegetables or meat below? Maybe in Switzerland? Yeah, that’s probably raclette. It’s a Swiss (or French) cow’s milk cheese that brings fruity, sweet notes to the table. Again, it’s creamy as hell, which seems to be the theme here.Lots of melty cheese things happening right here:Explore Bon AppétitCheeseBasicallyProvoloneMozzarellaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-14", "author": ["Condé Nast", "Alex Delany"]}