{"id": "8b5de5f16f27a53ed239aedb60b64531", "url": "https://www.bonappetit.com/story/meema-cotton-napkins", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "I’m Never Throwing Out Meema’s Upcycled Cotton Napkins | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Never Throwing Out These Upcycled NapkinsMeema’s textiles are made from soft denim that was heading for landfills—my napkins are staying far from the trash.By Jenna Adrian-DiazMarch 10, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Look, there’s no other way to say this: I like nice things. I like nice things that work really well and look great. I attribute this to being an unapologetic Taurus, which the not-at-all-subjective Co-Star astrology app backs up (confirmation bias be damned). But whether or not you believe in astrology, believe me when I say that Meema’s upcycled cotton napkins check all the boxes.For starters, the napkins come in two soothing, neutral hues: a creamy beige with bluish stripes and a blue-gray with ivory stripes. It’s hard to imagine them looking out of place anywhere. Plus there’s no hint of a rough or starchy handfeel; instead, they remind me of a favorite soft, perfectly worn-in linen blouse.But it’s not just how good they look next to leftover takeout or homemade duck confit that gives me the good ol’ warm and fuzzies. It’s how Meema itself is taking action against textile waste. Each napkin is made of at least 80 percent recycled cotton, according to cofounder Alejandro Torun. Torun started the company—named for his family’s nickname for his grandmother—as an extension of the textile business his grandfather founded in Guatemala City in 1945. But the family ties don’t end there. To procure the recycled fibers in each textile, Torun partnered with the New Denim Project, an initiative his uncle and cousin began in 2008 to upcycle yarn and fabric waste from denim mills in Guatemala and El Salvador, diverting them from landfills or incineration. The project is also responsible for the neutral hues of Meema’s napkins, dish towels, and aprons.“Our mission really is just to save as much material as possible so that it's converted into a product that will be used and reused,”  Torun explains. “Twenty thousand litres of water are needed just to grow a kilogram of cotton and process it.” Because Meema doesn’t have to grow, import, or dye 80 percent of the cotton used in its products, the water consumption, carbon emissions, and overall environmental impact is lowered considerably.And by using them, so will yours.It helps, of course, that they’re easy to care for. I’ve successfully lifted turmeric stains from my set with soap and water in just a few minutes. Plus, I launder them in my building’s commercial washers and dryers without a second thought—these napkins don’t need to be dry-cleaned or coddled on laundry day. Consider, too, that restaurants like Mercado 24 in Guatemala City and Santa Teresita in Uruguay, along with Swedish Hill Cafe in Austin, TX, and Austin’s, a coffee shop in Ripon, CA, get behind them. They can’t all be Tauruses!Co–Star or not, I’m sticking with these napkins.Meema Cotton Upcycled Napkins$28 at Meema$24 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-10", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}