{"id": "8b5d329c496136037d76372f9e0c4106", "url": "https://www.bonappetit.com/recipe/banana-bread", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "BA's Best Banana Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best Banana BreadBy Bon AppétitDecember 3, 20214.2(1250)Read ReviewsTriangleEmailPinterestPrintPhoto By Alex LauEmailPinterestPrintEmailPinterestPrintHere at BA everybody has their favorite banana bread recipe. We made every one of them—14 to be exact—until we came up with a collective favorite. Dark brown sugar is key (keeping the bread ultra tender and moist), and a dollop of mascarpone (which you can sub with sour cream or yogurt if desired) makes for superior tenderness in the crumb. Chocolate and walnuts are optional but encouraged, and if you like an extra crunch, follow former BA test kitchen director and cookbook author Carla Lalli Music’s recommendation and sprinkle the top with raw sugar just before you put the pan in the oven. Serve slices plain or slathered with cream cheese or butter.If you want something that gears more toward dessert than this simple banana bread recipe, this one brings in elements of blackout cake, including cocoa powder and bittersweet chocolate.Editor’s note: This recipe was originally published August 4, 2014.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLoaf Pan$15 At AmazonElectric Mixer$40 At AmazonParchment Paper$3 At AmazonWire Rack$23 At BA MarketCake Tester$3 At AmazonIngredientsMakes one 8½x4½\" loafNonstick vegetable oil spray1½cups all-purpose flour1¼teaspoons baking soda¾teaspoon kosher salt1cup (packed) dark brown sugar⅓cup mascarpone, plain whole-milk Greek yogurt, or sour cream¼cup (½ stick) unsalted butter, room temperature2large eggs4large very ripe bananas, mashed (about 1½ cups)½cup chopped bittersweet or semisweet chocolate (optional)½cup chopped walnuts (optional)PreparationStep 1Preheat oven to 350°. Lightly coat 8½x4½\" loaf pan with nonstick spray and line with parchment paper, leaving a generous overhang on long sides. Whisk flour, baking soda, and salt in a medium bowl.Step 2Using an electric mixer on medium-high speed, beat brown sugar, mascarpone, and butter in a large bowl until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend after each addition and scraping down sides and bottom of bowl as needed.Step 3Reduce speed to low, add flour mixture, and mix until just combined. Add bananas and mix just until combined. Fold in chocolate and/or walnuts, if using. Scrape batter into prepared pan; smooth top.Step 4Bake bread until a tester inserted into the center comes out clean, 60–65 minutes. Transfer pan to a wire rack and let bread cool in pan 1 hour. Turn out bread and let cool completely (if you can resist) before slicing.How would you rate BA’s Best Banana Bread?Leave a ReviewTell us what you thinkReviews (304)Back to TopTriangleThis is just an ok recipe, will not revisit. MewSan Francisco2/15/2022Awesome recipe! I didn't add the chocolate but used all of the rest of the  the ingredients. Makes a perfect loaf and so very tasty. Not too sweet and very moist. Its a keeper! KayKansas City2/8/2022I made this recipe dozens of times and it’s always perfect. I usually use Greek yogurt instead of mascarpone. Really the best banana bread ever!TessChicago1/29/2022I've made this multiple times for my family and to bring over to friends and it's always a hit.  I recently tried using my sourdough discard in place of the greek yogurt/sour cream/mascarpone (in the same amount listed in the recipe).  It adds some additional dimension to the flavour and is a great way for me to use up some of my discard.  Cait1/26/2022Good recipe! I halved it and turned it into muffins. It made 11 muffins with a scant 1/4 cup of batter each, baked for 25 minutes. I can't put my finger on it but this recipe has more depth of flavor rather than just a sweet and oily flavor that many banana bread recipes have. The process for making the batter is different from other recipes, but it worked well. I will be making these again. OhioStephanieHudson, oh1/22/2022great, it's pretty forgiving because the first time i screwed up it still tasted amazing. even better when you make it according to recipe instead of dropping the flour container in the batter and estimating how much i needed to fish out.Iris1/14/2022It is very tasty and easy to makeFatimah KSA1/6/2022I have had plenty of banana bread in my life and this truly lives up to it's name. It's so incredibly moist and flavorful. I used the mascarpone cheese and walnuts (skipped the chocolate chips). The dark brown sugar made the color darker than I'm used to which I'll admit, had me skeptical but wow, this was amazing. Cannot wait to make again. Jeremy BOklahoma City, OK12/27/2021To Sue of California, keep the liquid.  No additional adjustments necessary,  I do this all the time.  Richard FGainesville,  Florida 12/26/2021Using frozen bananas: should I pour off the liquid?  Keep the liquid but make other adjustments?  Suggestions?  Thanks!SueCalifornia12/26/2021I have made this banana bread a handful of times. Each time I have used sour cream because it is already in my fridge. Like many of the other reviewers, I bake a little longer than suggested. I am at sea level and this bread does best between 70-75 minutes. The chocolate chips and walnut chunks are necessary... but that's probably just my preference! Krissy GovertsenBoston, MA12/21/2021This is the recipe I use every time I'm making banana bread. There is something really culinarily magical that happens to the chocolate chips. The only thing I do to change the recipe is I sprinkle a good layer of Turbinado sugar on the smoothed out  top when the batter is poured into the pan. This adds a wonderful crunch to the top of the loaf. Sometimes if I have the time I will roast the walnuts in the loaf pan, and then let them cool. Andrew WingertNew Carlisle, OH12/21/2021This is my go to Banana Bread Recipe , hands down. Actually I never really enjoyed Banana Bread it always seemed to rubbery.  This is perfect I split white flour and whole wheat and it comes out perfect. \nMake this , trust me it will be the only recipe you will use. \nAnonymous12/12/2021I have to say I really disagree with the negative reviews. I thought this banana bread was perfect - moist, light, flavorful - especially with the chocolate chips and walnuts. I used about 2/3 the sugar, and added a few spoonfuls of applesauce, and thought it was plenty sweet. I also baked as muffins, about 25 min. To each they're own, I guess! I will definitely be saving this recipe and making again!AnonymousBoise, ID12/11/2021I specifically searched BA for a banana bread yesterday Bc many of my best recipes came from them.  This recipe disappointed greatly- first thing to make me wary was not having vanilla in this one.  However, I always first try recipes without alterations, and this one I followed Exactly.  I read Kelly’s review from July 31, 2021 and I concur 100%.  Therefore, I’ve copied and pasted it here:  “This is just an okay recipe. Easy to follow, but overall very bland. There's richness and moisture from the marscapone and eggs, but missing sweetness which is surprising because there's a full cup of brown sugar and 4 ripe bananas. I was also surprised by the lack of warm spices and vanilla extract, which this recipe could definitely use. For being a BA's Best recipe, this one is a dud. There are MUCH better recipes out there.”-Kelly SLC UT.Mary CRockville, MD11/29/2021Explore Bon AppétitBreadDessertBananaFruitSnackVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-08-04", "author": ["Condé Nast", "Bon Appétit"]}