{"id": "8b66b185f363bb36c5cfee9c9196c757", "url": "https://www.bonappetit.com/recipe/whipped-ricotta-dip-with-charred-jalapeno-and-roasted-garlic", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Whipped Ricotta Dip with Charred Jalapeño & Roasted Garlic Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDWhipped Ricotta Dip with Charred Jalapeño & Roasted GarlicSponsored by Stacy's®FacebookPinterestTwitterEmailLight, airy folds of whipped ricotta and lemon bouy sliced jalapeños in this bright summer dip to pair with Stacy’s® Parmesan Garlic & Herb or Multigrain Pita ChipsPrintIngredients1 head garlic4 whole jalapeños16 oz. whole milk ricotta2 tablespoons heavy cream1 lemon, zested then juicedpinch of saltpinch of pepperOne bag of Stacy’s® Parmesan Garlic & Herb or Multigrain Pita ChipsRecipe PreparationPreheat the oven to 400°F. Cut the top off the garlic bulb and place on top of a piece of foil. Drizzle the garlic with olive oil and season generously with salt and pepper. Enclose the garlic head in the foil and roast for 25-30 minutes on a small sheet tray, until garlic cloves are soft and golden.Drizzle the jalapeños with olive oil and season with salt and pepper. Place onto a separate small foil-lined sheet pan and roast for 25-30 minutes, or until the jalapeño skin is charred and bubbly. Remove from oven and let jalapeños cool. Once jalapeños are cool enough to handle, remove the stem, skin, and seeds. Roughly chop the flesh into small pieces.Place the ricotta in a bowl and add the heavy cream. Drizzle with 2 Tbsp. of olive oil and season generously with salt and pepper. Using a rubber spatula, beat the ricotta, heavy cream and olive oil until creamy and smooth.Squeeze the garlic cloves out of their skins directly into the ricotta. Fold in the chopped jalapeños, lemon zest, and lemon juice and combine thoroughly. Taste and season again if necessary.Garnish with thinly sliced jalapeños and enjoy with Stacy’s® Parmesan Garlic & Herb or\nMultigrain Pita Chips.Sponsored by Stacy's®GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitStacy's® Pita ChipsSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Stacy'S"]}