{"id": "8b67eba47c10dcef90ffb5771a32703f", "url": "https://www.bonappetit.com/recipe/red-wine-spaghetti", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Red Wine Spaghetti Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueRed Wine SpaghettiBy Janice TiefenbachNovember 19, 20194.0(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintIt’s a showstopper. Two bottles of red wine get cooked down to a glossy mahogany butter sauce that stains the spaghetti in addition to flavoring it. Use a very dry red wine that you enjoy drinking, such as a Sangiovese-based wine like Chianti, or Merlot, otherwise the dish will be too sweet. If this is sounding like “eating red wine” to you, don’t worry, it tastes like wine in the way beef bourguignon does, and is acidic yet creamy like our beloved pasta al limone. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8 servings12garlic cloves, finely chopped3Tbsp. extra-virgin olive oil, plus more for drizzling1tsp. crushed red pepper flakes16Tbsp. (2 sticks) unsalted butter, cut into 1\" pieces, divided2750-ml bottles red wineKosher salt2lb. spaghettiFinely grated Parmesan (for serving)PreparationStep 1Combine garlic and 3 Tbsp. oil in a small bowl. Heat a large Dutch oven or other heavy pot over medium; pour in garlic and oil. Add red pepper flakes and 2 Tbsp. butter; cook, stirring occasionally, until garlic is very fragrant but not browned, about 3 minutes. Add wine, increase heat to medium-high, and bring to a boil. Cook, uncovered, until reduced by two-thirds, 20–25 minutes; season with salt. Cover and keep warm.Step 2Meanwhile, cook pasta in a pot of salted boiling water, stirring occasionally, until very al dente, about 3 minutes shy of recommended cook time.Step 3Drain pasta and add to sauce, along with remaining 14 Tbsp. butter. Set pot over medium heat and bring sauce to a simmer. Cook, tossing often, until pasta is well coated and sauce is thickened, about 3 minutes. Taste and season with more salt if needed.Step 4Divide pasta among bowls; drizzle with oil and top with lots of Parmesan.How would you rate Red Wine Spaghetti?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleDon't do it! Personally, I don't think that it was worth the effort, and, more importantly, the wine.  Sure, the spaghetti was stained red and tasted of wine, but the end product feels showy and gimmicky for a result that tastes exceedingly average in both depth and flavor. \n\nIf you insist on moving forward with making this, do yourself a favor and reduce the butter by 1/2 otherwise you will be left with an excessively buttery, greasy bowl of pasta. Someone told me that traditionally red wine pasta is made with anchovies to add a bit of umami. You could probably throw some in or use anchovy paste - it could only help...Andrew P.North Conway, New Hampshire11/21/2021Amazingly easy and delicious! We prefer penne pasta, (less messy) and add cooked prosciutto or ham and black olives.  Magically delicious every time! 😋Lisa Graziano Porto, Portugal 10/3/2021This was OK, kind of more interesting to make than it was to eat.  Made a half recipe and used a $10 montepulciano.  The color was beautiful, but I didn't get a ton of wine flavor in the pasta--more like just pasta with butter and cheese.  I think I'd use half as much butter next time in order to let the wine flavor stand out more.  One commenter suggested using a blue cheese with this, and I also think either that or a tangy goat cheese would be a better complement than the parmesan.  Overall, I think the recipe is a good jumping-off point.JJSan Francisco, CA7/18/2021IT GAVE ME DIARHEA\nAnonymousBoston, MA1/26/2021This recipe was delicious! Super easy to assemble and definitely feels upscale. There’s two of us so we quartered the recipe and each had a glass of wine with dinnerCharlieColumbus, Ohio12/2/2020I made a similar risotto recipe years ago.  If you re sensitive to tannins, this is like mainlining wine tannins.  Decide for yourself.\nAnonymousChicago11/30/2020Top notch. Roast a bulb of garlic and use all ...not raw...\nAdd a Danish blue cheese just before serving with butter and a hint of lemon juice.\nBalance with a bit of pasta water...\nA rice based pasta is not as heavy as a gluten heavy choice...\nAs for heat, red pepper flakes are a poor choice.\nThis dish calls for a smoky medium liquid hot sauce instead... or if you have a fresh bit of deck planter hot summer peppers, kick it up... \nadd a small side bowl  of lemon arugula as a chaser.\nThank you BA...PJWBrandon, Manitoba 11/30/2020So, let me begin by saying that I am a HUGE fan of pasta al limone, that's why I was motivated by the intro to this recipe. However, it didn't do it for me... I picked out the suggested wine, a dry chianti that costs 6euros, everything else I followed to a T (though I did make it for 4 people so I measured accordingly) everything looked as planned but the taste was a flop. It's not a very interesting flavour to begin with but also, you don't want to continue eating it even. But it was easy to make overall. Wouldn't make it again...bridgethecloudsFrance10/6/2020so easy and literally amazing. i used cheap trader joe’s wine—not $2 chuck, but a $6 bottle. cut the recipe into a fourth for a dinner for me & my roommate. so good and so simple!!!ruthieruthieNew York9/10/2020this was delicious! I had a 1lt bottle of unfiltered dry red wine, poured a glass for myself and used the rest for the sauce. first off this is a great way to cook spaghetti as the texture came out perfect. the sauce tasted exactly like what was put into it, garlicky, buttery, with a twinge of raspberries which is what I though the wine tasted like. with the a little grated cheese on top boom! what else do you want!?!tomatotomatotexas4/30/2020I grew up on a similar recipe. It’s comfort food for me. We used plenty of ground fresh pepper and no cheese. I have been a recipe hoarder forever and never came across one like it. Thank you Bob Appétit for taking me back to my childhood.AnonymousNew York 4/29/2020First of all, this was a very easy recipe, that resulted in a dramatic presentation. However, the flavors were much more subtle than I would have expected. It had a little kick from the red pepper flakes, which was welcome, but otherwise it was a fairly mild dish.AnonymousPortland, OR3/30/2020Tastes like wine and butter, 10/10AnonymousNew Jersey3/8/2020Didn't care for this.  A little bit like vomit in your mouth.  I don't know if the wine was too acidic but the dish came off without balance.AnonymousLos Angeles, CA2/26/2020I didn't believe it at first but this is indeed a showstopper; screamingly easy and all ingredients you have lying around. Would love to try this again with fresh pasta.Anonymous1/19/2020Explore Bon AppétitPastaItalianEuropeanSpaghettiPasta & NoodlesNoodleGarlicVegetableMainNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}