{"id": "8b6a9072521b0fc56881a4e0cf200849", "url": "https://www.bonappetit.com/recipe/ricotta-panna-cotta-with-nectarines-and-honey", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Ricotta Panna Cotta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueRicotta Panna Cotta with Nectarines and HoneyBy Claire SaffitzJuly 10, 20184.1(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintTreat this spoonable dessert as a vehicle for piles of your favorite peak-season fruit. Swap out nectarines for plums, peaches, cherries, or blackberries. Using a food processor makes the ricotta ultra smooth and airy.Ingredients6 servings 1envelope unflavored powdered gelatin (about 2½ tsp.)Extra-virgin olive oil (for pan and drizzling)2cups whole-milk fresh ricotta⅓cup powdered sugar½tsp. vanilla extract½tsp. kosher salt1½cups half-and-half, divided2large or 3 medium nectarines, cut into ½\"-thick wedgesHoney (for drizzling)PreparationStep 1Pour ¼ cup cold water into a small saucepan and sprinkle gelatin evenly over; let sit 10 minutes to soften.Step 2Meanwhile, coat a 9\"-diameter pie or cake pan with a thin film of oil; set aside. Combine ricotta, powdered sugar, vanilla, salt, and 1 cup half-and-half in a food processor.Step 3When gelatin is softened, add remaining ½ cup half-and-half to saucepan and set over low heat. Cook, stirring with a heatproof spatula, until gelatin is completely dissolved (do not let mixture boil). Scrape mixture into food processor and process until completely smooth, about 30 seconds. Pour into prepared pan and chill until set, at least 4 hours (cover loosely with plastic wrap after 1 hour).Step 4Run a butter knife or small offset spatula around sides of panna cotta to loosen the edge and break the suction.Joe WilsonStep 5Fill a baking dish or similar vessel with hot water. Lower bottom of mold into water 5 seconds, then lift it back out.Joe WilsonStep 6Press a serving plate firmly over top. Quickly invert in one motion; set plate down. Use knife or spatula to gently lift up mold.Joe WilsonStep 7Top with nectarines; drizzle with honey and oil.Step 8Do Ahead: Panna cotta (without nectarines, honey, and oil) can be made 2 days ahead. Keep chilled.How would you rate Ricotta Panna Cotta with Nectarines and Honey?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI've made this cake a few times with varying ingredients. I have to say that the ricotta that you use makes a big difference. I found that generic ricotta that you can find in any grocery store tends to be grainy no matter how long you blend it. (It was still enjoyable though) The few times that I did use more expensive specialty ricotta it was great and worth it (if you can manage to hunt some down)! \n\nRegarding the dairy. I found that I like the cake much more with whipping cream, it is much more creamer than half and half.\n\nThis is such a great recipe and I can see making this throughout my life!AnonymousVancouver, BC11/25/2020Just made this last night! Blended with a Vitamix on smoothie function and poured into individual dessert bowls. Topped with honey and pistachios because we had no berries or stonefruit in the house. We LOVED IT!!! Super smooth and fluffy; not grainy at all. Will definitely make this again!CeremonyMaine4/7/2020I loved this recipe.  Yes, it did have a bit of a grainy ricotta texture (despite blending the mixture really vigorously in the Vitamix), but that was fine because I love ricotta.  The sugar level was perfect -- most of the sweetness came from the honey drizzled on top.AnonymousSan Francisco, CA2/4/2019Made it last night for a family dinner and it got rave reviews from a picky group. I used our delicious Colorado Palisade peaches and strawberries. Only thing i would do differently is use more fruit. Followed directions and panna cotta was not grainy at all...did use a high end ricotta though so maybe that made it creamier.TheHossesDenver Colorado7/30/2018I liked this, and it was reasonably easy to make, but everyone else in my family objected to the texture, even when forewarned it was ricotta (and all of them like ricotta).  The flavor is mild and creamy and wonderful but the graininess imparted by the ricotta was not well received.  I couldn't get good peaches so first let them sit in the honey a few hours, and I did not use olive oil, avocado oil to grease the pan and no oil for topping.  I can't quite wrap my mind around olive oil and peaches.  \n\nI would make it again, but a single serving size for me!  And even less sweet, would reduce the sugar, and probably use cream not half and half.  But for this go-round I did follow the recipe, except for the olive oil.Anonymousfarther south than the south7/30/2018We made this for a small dinner party this evening and it was fabulous! Rave reviews from all our guests! Yes, the ricotta gave the dessert a very slight grainy texture unlike most smooth panna cottas, however it was light, creamy and just perfectly balanced with the sweet honey and peaches.  I will most certainly make this again.  We also used individual ramekins which might have made it easier to remove from the dishes.AnonymousNew Jersey7/23/2018I took this to a dinner party.  My friends liked it but I thought the texture was not as luscious as I expected given how long I blitzed it to get it smooth.  I also found it salty, and it came out of the mold terribly.  If I were to make this again, I'd up the sugar to better balance the salt.aerieBainbridge Island, Washington7/22/2018I followed the recipe to a T. Not sure why after a day of refrigeration I was left with a lot of pricey milk product in soup form. Could you clarify about how long the gelatin needs to be heated on low with the half and half? Perhaps I needed more gelatin? Either way I'm peeved. AnonymousDenver, Co7/15/2018This was delicious. It was like a cloud. I used a vitamix instead of a food processor and really whipped everything super smooth, then poured in the gelatin mix at the end. Insanely good. It did come out of the pan terribly, but as my partner says “hooray! you’ll have to make this all the time until you get good at getting it out the pan so we can serve it to guests.”  The evoo/honey drizzle at the end was perfection.AnonymousRichmond, VA7/14/2018I thought this sounded delicious but the final texture is very weird - it has the graininess of the ricotta still, not the luscious, silky texture of most Panna Cotta. Very disappointing. Anonymous7/13/2018Can I swap half and half for 3.25% milk or maybe 15% cream. AnonymousQuébec city, Canada7/12/2018Explore Bon AppétitPanna CottaPuddingDessertItalianEuropeanRicottaCheeseNectarineStone FruitFruitSummerEasyGluten-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Claire Saffitz"]}