{"id": "8b6f90c25fd2f50d02f1a29bff4ea774", "url": "https://www.bonappetit.com/story/trader-joes-reviews-december-2020", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Trader Joe’s New Snacks Are As Festive As a Holiday Rom-Com | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s New Snacks Are As Festive As a Holiday Rom-ComWhich is VERY. By Alex BeggsDecember 21, 2020FacebookTwitterEmailFacebookTwitterEmailThis is it! My last roundup of Trader Joe’s new product reviews for the cursed year 2020. For many, many months I didn’t shop at my beloved TJ’s because the line wrapped around the block when it was still dark out in the morning. But things have reached a sanitized equilibrium, and unlike other grocery stores I frequent, TJ’s is still keeping a cap on the number of shoppers in stores and wiping down carts, and I feel safe shopping there.Trends I noticed this year were a huge uptick in new nut mixes, which I’ll take over previous years’ unending salad bags. There were some banging new salty snacks, like those jalapeño puffs, the bite-size cheesy crackers, and the fake Pringles “saddle” chips. This was a good year for dip: the Buffalo-style chicken dip still haunts my taste buds, everything-but-the-bagel dip delivers, the jalapeño-artichoke dip was great, as was the cauliflower-jalapeño dip—was it a generally big jalapeño year? Seems so. And the big shocker of the year was the innovative, amazing PB&J “snack duo,” which I would like to go back in time and pack in my lunch box from kindergarten to college graduation. The bad: still too much cauliflower disguised as bread if you ask me (just let cauliflower be itself!). Most of the new frozen foods kill you with sodium and yet remain bland. I consumed enough maple flavor this year to make even Buddy the Elf nauseated, and would never like to cross paths with the instant cold brew again.But none of these “bads” top the fact that employees at the grocery stores across the country had to come to work throughout this brutal, deadly pandemic and endure crowds of frantic shoppers, maskless jerks, and put their health at risk for a paycheck, no matter how many timed hand sanitizer breaks they take. I popped in for a few bags of chips, while the employees stocking them on shelves were reportedly scared to go to work. So I humbly bow to you, TJ’s employees.Well, here we go: What’s new in December, reviewed.Alex BeggsBougie NutsCocoa Chile Spiced PecansThese have a nice, slow heat, like a Netflix holiday romance, of which I’ve watched many this month. A great drinking snack with like an espresso martini or a white Russian, or the film Christmas Inheritance, which needed way more heat than a bag of nuts can offer. (A “party heiress” spends time in a small town to get in touch with reality—she learns to bake cookies and vacuum.)Caramel Coffee CashewsWHOA. I love these. There’s bitterness from a coating of near-burnt caramel and coffee powder, and it keeps these from being too suh-weet. They look like dirty troll knuckles, but that only makes me love them more.Over the River and Through the Wood Trek Mix Snack MixThe pumpkin pie–spiced pecans touch and overpower everything. Why even bother with the cranberries? Pass on these like The Christmas Chronicles: Part Two, because Santa and Mrs. Klaus should never, ever have this much sensual chemistry.Alex BeggsTruffle SnacksWhite Truffle PopcornThis giant puffy popcorn dusted in truffle powder makes me feel the kind of fancy you feel when you wear perfume with gym clothes, a little embarrassed but you might as well own it (come on, I’m not the only one who’s done this). The truffle scent similarly reeks from the open bag, which I finished while rewatching Casino Royale, not a Christmas movie, but a gift in itself.Black Truffle Cashew PestoIf you love truffles, try this. Smooth, oily cashew pesto that has plenty of salty Grana Padano. I ate it on Triscuits like a duchess in disguise as a commoner (The Princess Switch, fave), but you could have it with pasta or whatever. Figure it out.Alex BeggsThings in Square JarsOrganic Sweet & Spicy Mustard SauceSweet and CHUNKY mustard, this was polarizing in my household. Heavy on the molasses. The more I tried it, the more I liked it (especially with the boring charcuterie pinwheels that need all the help they can get—see below). My partner, though, BLECCHED in response and went running for the yellow mustard in the barrel-shaped bottle, but he’s a simpleton.Italian Style Soffritto Seasoning BlendDehydrated garlic and tomato flecks, cool. These really take me to Italy, like Christmas in Rome, in which a tour guide played by a Meghan Markle look-alike teaches a hot but sort of menacing American “businessman” to make pasta and stop working so hard and making so much money because IT’S THE HOLIDAYS. In a charmingly capitalist twist ending, he helps her make a business plan for her tour guide company. Hot.Spicy Chunky Tomato and Pepper Pasta SauceI had this with pasta, but it really, really is shakshuka material with all that cumin. Make shakshuka with it instead.Alex BeggsCylindrical NutsStepping It Up Snack Bar MixThere are two varieties of this bar mix—spicy and reg—but both are fantastic, sort of like any Christmas movie with Vanessa Hudgens. You KNOW it’s gonna be good. Love her. The Knight Before Christmas? Hilarious and delightful if historically inaccurate. The spicy mix is the bar mix I have with an ice-cold martini at home when I’m pretending to be at the bar at Keen’s—choose your own steakhouse fantasy scenario. In the superior spicy mix are broken pieces of jalapeño-dusted pretzels, mini rye chips, tiny sticks, and a few almonds as an afterthought.Three Almond MixAnother great nut mix!!! What a blessed month, like The Christmas Blessing, starring Neil Patrick Harris as a not-Doogie-Howser doctor who goes home for the holidays and has to find his mother’s red Christmas shoes??? Someone has a secret? (I only watched the trailer.) The sesame-coated crunchy honey almonds are a textured treasure, the coffee caramel almonds give you a jolt, and the regular roasted almonds are there to remind you of life’s blandness, like a TV drama distributed by a company that makes yoga mats.Holiday ShitAlex BeggsFestive Tortilla ChipsDespite the broken trees and bells you can see through the peekaboo window in the front of the bag, it’s pretty amazing any of these shaped chips remain whole—which is how a lot of us feel at the end of the year. Trees look like trees. Bells have distinct nipples. Stockings look like fluffy chefs’ hats.Alex BeggsDecked Out Tree CookiesMy nieces said the best part of these cookies is: “SPWINKLES!!!” They’re not wrong.Gluten-Free PanettoneAtrocious!Sugar Glazed Lebkuchen CookiesCookies based on the German Christmas cake. The chewy outer layer is like edible paper—into it—but these are heavy on the clove and orange peel with little chunks of dried something I did NOT like.Alex BeggsCookie Mug HangersLike you, these bowlegged gingerbread men are hanging by a limb at this point. Perch on the side of your mug and watch as their legs amputate into your hot cocoa, then dip the rest of the cookie torso into your cocoa and eat it because it’s DELICIOUS and disintegrates immediately on the tongue.Dark Chocolate Candy Cane Joe Joe’s BarWHY is there NOTHING at Trader Joe’s called HO HO JOE’S. This chocolate bar has Pop Rocks–esque shards of Candy Cane that have filled a hole in my heart—and in my molars.Alex BeggsFestive DrinksSugar Plum Sparkling BeverageWould love to know whether or not this is just prune juice Spindrift disguised as “sugar plum” beverage. It’s sweet and cloying and might have a dark secret, like Christmas With a View, in which a ski lodge kitchen manager falls in love with a hot famous chef, a romance sparked with the classic pickup line, “That’s a nice piece of Gruyère.”Nog Protein SmoothieIf this smoothie is so protein-packed, why does the snowman on it have such puny stick arms? This tastes pretty good for watered down eggnog, and it would be even better mixed with cold brew like I see all the kids doing on TikTok.Maple Espresso Black Tea BlendSo many flavors. All of them bad.Alex BeggsFrom the Refrigerated SectionHoliday Vegetable HashThis smells uncannily of Thanksgiving, what with all the thyme and rosemary and overhyped expectations of grandeur. The cubes of squash and potato are cut as perfectly as Kristen Stewart’s long bob in Happiest Season.Alex BeggsCharcuterie PinwheelsSquished and sad, somehow bland.Alex BeggsMixesStroopwafel Cake MixNifty jar. The brown sugar in mine was dried out and needed to be stabbed with a spoon until it gave way, when a whoosh of maple flavor filled the kitchen. The loaf cake with Stroopwafel cookie pieces throughout and on top is a cute idea! But that maple flavor is as believable as the scenes “in congress” in Operation Christmas Drop, about a political aide who is trying to stop the Air Force from the yearly tradition of dropping presents on Guam. They both mean well.Pfeffernüsse Cookie MixGinger molasses cookies as standardly satisfying as Christmas Wedding Planner, which has a casual surveillance subplot.Alex BeggsFrozenNon Dairy Mint & Chip Bon BonsIce cream buttons! A thin, crunchy chocolate shell snaps (fun!) and reveals a watery, coconut milk ice cream product inside. The whole experience was very exciting to me, person who sits on the couch all evening, waiting for excitement to show up at my doorstep like the bubbly blonde who has nothing better to do in Christmas Next Door.Alex BeggsBulgogi Beef Fried Rice With KimchiSeven minutes on the stove? Can’t beat it. The added fake grill flavor on the beef is amazing, never knew that was even an option in this beautiful, beautiful world. I’m baffled at the concept of freezing kimchi, which seems like a bad idea. However, I found no kimchi in my bag, so moot point. The rice is inoffensive, slightly sweet. You need to doctor it up to make it better. I added kimchi and chives.Alex BeggsBeef PhoWhaaat is happening. Frozen pho? How is this scientifically possible? Turns out it’s not. The broth was grainy and watery, the beef was floppy and chewy, and I’m not surprised about any of this. If you want a pleasant surprise, check out The Holiday Calendar, in which a lady inherits an antique Advent calendar that predicts the future, which reminds me of one of my favorite Twilight Zone episodes, “A Most Unusual Camera,” but with less murder.Alex BeggsBITE NIGHTFried Olive BitesOlive-y! I like to have a night of the week where I only eat foods called “bites” from Trader Joe’s. I call it BITE NIGHT! (Mac and cheese bites are a must.) The creamy cheese inside seeps through the breaded exterior like an infant’s diaper on the verge of blowout. Delectable.French Onion Soup BitesI’ve been waiting to catch these at a store and finally did. They are truly soupy inside with a shell that gets stuck in the container. Oh, man, remember parties with little “passed apps” as mediocre as these? I’d still wait by the swinging catering doors to get more.Alex BeggsBatonsBaton Lover’s QuartetI have had so many BATONS this year. Who in TJ’s corporate is trying to make batons a thing? Batons are break room snacks ONLY and should not be purchased for personal use. The dry, cardboard-like cookie exterior—they’re practically office supplies. So, in this giant, adorably decorated (Hi, Bobbi!) tube, there are four types of batons, including chocolate-orange, because someone wanted to make a bad thing worse, like A Christmas Prince: The Royal Baby. One franchise too far.Alex BeggsSalty tubsOrganic Almond ButterTub too small!Fleur de Sel Caramel SauceOops, this isn’t new, but I was curious. The tapioca syrup at the base of this sauce has a plasticky taste that made me crave homemade dulce de leche. The Frenchy branding—it’s salted caramel, LOL—is as convincing as the film Christmas in Paris, which was filmed mostly in Toronto. Happy Holidays! See you next year.Previously:November reviews here—huge news for cheese AND crackersSeptember and October reviews, at long lastMore 2020 reviews hereExplore Bon AppétitTrader Joe'sinlinenativeblockerRead MorecultureTrader Joe’s November Reviews: Huge News for CheeseBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-21", "author": ["Condé Nast", "Alex Beggs"]}