{"id": "8b702967ea4f64f76202c7a6126bf4b5", "url": "https://www.bonappetit.com/story/dining-table-souvenirs", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "I Buy Souvenirs for My Dining Table and So Should You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Buy Souvenirs for My Dining Table and So Should YouThis isn’t your grandma’s centerpiece situation.By Erika OwenJuly 25, 2018FacebookTwitterEmailJoseph GonzalezFacebookTwitterEmailI’ve spent a lot of my life eating off of things that weren’t actual dinner tables: beds, couches, counters, coffee tables, and desks. For years, I lived in a Brooklyn studio apartment with my partner and four bikes. “Do we want a dining table or a real bed?” we asked, a very real game of “Would You Rather?”My design daydreams center around a big, heavy wooden dining table, preferably with expansive leaves, just because we could. And that was exactly the first thing we bought when we moved into a one-bedroom apartment. Next, I set the table with a woven runner, a few flower vases, and a tray at one end holding a tiny sailboat, a few rocks, and a hand-embroidered postcard. Because a dinner table is a gathering place, and I like to decorate mine with reminders of where I’ve been with people I love. The “dinner table souvenir” scene is as much as conversation starter as a comforting reminder of some of the best moments of my life—and I like to keep those close at hand.Sit at our table, and you’ll find a map of our travels carefully placed in front of you. The most prominent (pictured up top) is a pair of planters, originally intended as bookends, housing colorful cacti, discovered at an Of a Kind sample sale. Next to that, you’ll find a round, black-and-white swirled candle holder from Reykjavik (it reminded us of the black sand beaches in Vík). Leaning against the planters, an antique silver tip plate from Charleston flanked by a pair of wooden salt-and-pepper shakers from Uganda. Pulling it all together is an embroidered postcard from Norway, and miniature model boat from Iceland named Litli.A small selection of my dining table souvenir collection, including a postcard from a museum in Norway, an antique silver tipping plate from Charleston.\nJoseph GonzalezThis scene is constantly changing, depending on anything from the weather to the people we’re hosting. Think of it as a manifestation of a phone background or computer desktop image; giving your eyes some variety is always a good thing. The mementos of vacation provide a dose of nostalgia or wanderlust, a welcomed distraction from the chaos of the city outside. Being able to pay a mental visit to a my favorite places with the help of a dining room trinket is something that has helped me appreciate my travels more—and has simultaneously made dinnertime more fun.It doesn’t have to be much to set up your own scene at home: a framed postcard, carefully carved serving spoons, hand-dyed napkins, a hearty succulent housed in a small planter from a far-flung flea market. This is more than a centerpiece; you’re going for a burst of personality, not your great-aunt’s tablescape. Get as far away from that latter as you possibly can. Here’s how:Grab 2-5 things that remind you of your favorite placesDon’t worry about consistency. It’s the idea that pulls everything together. Feel free to play with different colors, sizes, shapes, materials—the world is your souvenir-buying oyster. Maybe one of our souvenirs is an oyster shell.My glass container is currently filled with colorful terrazzo scraps, but it’s housed dried flowers and volcanic rocks in the past.\nJoseph GonzalezFollow the rule of thirdsThe rule of thirds works with more than photographs. If you’re looking to take up minimal space with your scene, stick to three items and make sure they’re all different heights. Science says that eyeballs are into that kind of thing.Say yes to clear containersGlass canisters make great homes for rocks, shells, or sand...I’m partial to these decorative glass canisters from IKEA in pretty, muted colors. We’ve got the pink one set up on our dining room table filled with beautiful scrap pieces of terrazzo from English designer Katie Gillies (they remind me of a café I love in Portugal).Be choosy about what you displayDon’t feel the pressure to display all of your souvenirs at once; pick a few from places that you’re particularly missing at the moment and work with those. I store the rest of my tchotchkes on a designated closet shelf. Lacking space? Find other places around your home to display souvenirs (think: the top of your bathroom vanity or a small shelf in your kitchen).Make Lazy Susan your friendIf you’ve got a small table, look to your friend lazy susan. Grab your favorite candle and build around it: try a beautiful matchbook from a bar visited on a recent trip or a tiny vase from a pottery studio you stumbled upon.Consider this an official excuse to plan a vacation—and buy yourself a few extra souvenirs.Erika Owen is the associate director of audience development for Bon Appétit and Epicurious, as well as a writer and design enthusiast. You can check out her own designs on Etsy at Erika Owen Makes Things.Suddenly feel the need to book a flight? Same.Explore Bon AppétitShoppingEntertaining + StyleRead MorecultureI Won a House in Detroit Then Cooked My Way into a HomeBy Liana Aghajanianculture10 Cult Nordic Design Brands That Will Transform Your KitchenBy Julia BlackcultureFruit Stickers Are Better Art Than Anything Andy Warhol Ever DidBy Alex DelanycookingThese Glass Tumblers Are the Only Ones You'll Ever NeedBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Erika Owen"]}