{"id": "8b76f56bdcbb3bdbd72984bc02e997b1", "url": "https://www.bonappetit.com/story/risotto-not-high-maintenance", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Risotto Doesn't Have to Be High Maintenance | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRisotto Doesn’t Have to Be High MaintenanceIt just takes two to make it happen.By Adam RapoportFebruary 11, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Kat Boytsova FacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Whenever my wife and I invite friends over, Simone almost always asks, “Can we make risotto?” And, almost always, my stock answer has been “No—it’s too much of a pain.”Well, turns out, as with most disputes in the RapoBuck household, I was wrong. Yes, risotto does require your mostly undivided attention (a ladle of stock...stir, stir, stir...another ladle of stock...). But if you’ve got a confident co-pilot, you can divide and conquer the cooking tasks and stir up creamy, tender risotto and the rest of your menu right on time.This past New Year’s, our friend Caitlin showed up with a mess of beautiful wild mushrooms and riffed on Carla Music’s no-fail mushroom risotto. Meanwhile, our friend Michael roasted a mustard-and-herb-coated rack of lamb. An indulgent, and absolutely perfect pairing.Want this letter before it hits the website? Sign up for our newsletter!And then, a few nights ago, when we had our friends Krissy and Chloe over, Simone and I basically cut our stove top in half. With the left two burners, she heated chicken stock on one, while constructing a buttery, cheese-free lemon risotto on the other. Standing elbow to elbow, I pan roasted two, thick-cut Berkshire pork chops, basting them with butter and garlic and thyme, similar to what Molly does on Bon App’s YouTube channel.Start to finish, we both had our respective dishes ready to go in about 20 minutes (the time it takes for the rice to release its creamy starchiness while retaining just a bit of bite.) I carved up the chops, Simone brought the risotto pot straight to table, and Chloe set out a big, green salad to cut through all that richness. Let’s just say there were no leftovers.So, yes, from now on, as long as I have a partner at the stove, my stock answer to what we’re making tonight is risotto.Get the recipes:Risotto With Mushrooms and ThymeThe path to perfect risotto is all about treating the rice right, but the added umami from torn mushrooms and thyme sure doesn’t hurt.View Recipe Cast-Iron Skillet Pork ChopsThough it may seem like a counterintuitive practice, extra flipping is the secret to the golden-brown crust on these pork chops.View RecipeExplore Bon AppétitAdam NewsletterRisottoPork ChopRead MorecookingHere’s What Makes BA’s Best Risotto Recipe So Damn PerfectBy Alex DelanycookingThe Shrimpiest Shrimp Risotto That Ever ShrimpedBy Emma WartzmancookingWeeknight Dinner Party? Start with Brown Butter-Basted SteakBy Adam RapoportcookingThis Pork Chop Recipe Is Preeeetty Much Impossible to Mess UpBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Adam Rapoport"]}