{"id": "8b7ae300e5ffca5b961b83bd90f399f6", "url": "https://www.bonappetit.com/story/vermont-country-deli", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Vermont Country Deli Is the New England Spot Two Bon Appetit Editors Can’t Stop Talking About | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe New England Deli Two Bon Appétit Editors Can’t Stop Talking AboutReally, their love for Vermont Country Deli is that deep.By Amanda Shapiro and Aliza AbarbanelOctober 9, 2019FacebookTwitterEmailPhoto by Hannah GanttFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.For, maybe the first time in Highly Recommend history, two people pitched the same thing! Instead of letting them duke it out, we let the two wax poetic about this one particular deli in Vermont. Here’s that conversation.Amanda Shapiro: So when I was a kid, my family would drive from Connecticut to Vermont to visit my grandparents, and almost every time we’d stop at this shop with a name I never knew because I just called it “the dip chicken place.” Turns out, it was the Vermont Country Deli in Brattleboro, VT—and there’s so much more to it than chicken.Aliza Abarbanel: So cute! So East Coast. I went for the first time two years ago on Labor Day. I was heading to Vermont for the first time and you told me to stop there. But wait, what’s dip chicken? I’m scared to even ask...AS: It’s like sesame chicken, the battered and fried kind you’d see on a Chinese takeout menu, but served cold, straight from the deli case. Does that not sound delicious to you? Trust me, it is.AA: But...how is it a dip?!  And what were you dipping in it anyway?AS: Don’t ask too many questions, Aliza. Tell the people about the sandos.AA: The sandwiches! Okay, honestly I’m usually not a big sandwich person, probably because of my low-key dislike of deli meat. But I fell hard for the Vermont Veggie, a careful construction of pickles, sprouts, and generous hunks of Cabot cheddar on pillowy slices of marbled rye layered with hummus and honey mustard (my forever fave). Then I laid eyes on the Route 9 Roast Beef: a leaning tower of cheddar, tomatoes, and roast beef jolted with horseradish sauce. Truly, it was awe-inspiring, and just what a car of slightly hungover, very hungry people needed to be able to power through the six hour drive back to Brooklyn.AS: Hope you didn’t forget a giant cookie from the incredible dessert case.AA: Oh, we got three. Two communal chocolate chip cookies for the car, and one peanut butter cookie that I refused to share with anyone. Plus a few bottles of Fable Farm cider, goat milk caramels, and every other Vermont-y snack you’d imagine.AS: Right. The place is stocked to the nines with Vermont-made stuff, but not the hokey kind. So much craft beer. The best maple candy. Local honey. Walpole ice cream. Champlain Valley cider. Even the coffee comes from a local roastery.AA: I still can’t believe we skipped the dip chicken.AS: Just another reason to go back.Go there: Vermont Country DeliExplore Bon AppétitHighly RecommendVermontRead MorecultureThe Best NYC Day Trip Is to a Japanese Grocery Store in New JerseyBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-09", "author": ["Condé Nast", "Amanda Shapiro", "Aliza Abarbanel"]}