{"id": "8b815bedea5f90c0d3986dec5ef738d0", "url": "https://www.bonappetit.com/story/sistema-microwave-plastic-containers", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Sistema Microwavable Plastic Containers Will Save You From Pasta Sauce Splatters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Life-Proof Containers Have Kept My Microwave Clean for 3 YearsMy secret weapon for reheating pasta sauce and tomato soup without fear.By Alyse WhitneyJanuary 31, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailNo matter how many tricks I use when reheating leftover tomato soup in the microwave, it always ends up splattering out of the bowl. When I cover the soup with a paper towel, it falls off as the microwave dish rotates, and when I try putting a ceramic plate on top, it gets so hot that I burn myself. And then there's plastic wrap, which always comes a little too close to melting into my food. I've found only one thing that works: Sistema microwave noodle bowls.I first bought a set of these BPA-free containers on an impulse while watching a QVC demo in early 2015 (my old roommate was really into it, and I got sucked in). For the last three years, I've used them to store leftovers in the fridge, carry lunch to work, and reheat it without making a mess. They're the superhero of microwave containers and store a quart of food (4 cups), which means a meal-sized portion of soup, a mix of Chinese takeout leftovers, or a hefty square of lasagna.It closes in a snap!\nAnd they never make a mess in the microwave thanks to the pop-up vent in the lid, which lets steam escape without allowing any liquid out. There are four locking snap closures that keep the lid on tight and a heat-resistant handle so you don't burn yourself, even after microwaving for four minutes. During those four minutes, you don't really need to stir because everything inside will heat evenly from the steam circulating throughout the container. Food doesn't dry out as much because of that steam, a theory I've tested with leftover overcooked turkey and gravy that my dad made for Thanksgiving. Miracles happen.I've dropped one of these containers from a few feet up and the top didn't come off, nor did it leak. The material wipes clean and doesn't retain stains or odors, whether you're microwaving turmeric-heavy curry or spaghetti and meatballs. If I loan one out to a friend, I'll hound them until they return it. I need it back immediately!NO SPLATTER ZONE!!!!\nSure, the Sistemas store salad too, but I like to use them for steaming vegetables without all the fuss. Add an inch or so of water, put broccoli florets in, and microwave for a few minutes. Crisp-tender and ready for salt and pepper as a simple side. Per the bowl's noodle namesake, you can also use it to cook instant ramen. You break the noodle brick (technical term) into quarters, cover with boiling water, and heat with the lid on for two minutes. The ramen comes out as springy and al dente as 40 cent noodles can, and I'll turn it into a quick, lazy dinner by adding miso paste, a soft-boiled egg, soy sauce, and scallions. Cooking and eating from the same vessel means one less thing to wash—and isn't microwaving all about laziness, anyway?Buy it: Sistema Microwave Noodle Bowls, $10.92 on AmazonAnd here's one of my favorite tomato soup recipes:Explore Bon AppétitmicrowaveShoppingLeftoversBA RecommendsRead Moreculture7 Office Microwave Etiquette Rules to Follow So Your Co-Workers Don't Hate YouBy Alyse WhitneycultureThis Funny-Looking Product Will Clean the Microwave for YouBy Alyse WhitneyCreamy Tomato Soup with Cheese ToastiesBA's Best Spaghetti and MeatballsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Alyse Whitney"]}