{"id": "8b8437a3b0f679d249b060a380abacfe", "url": "https://www.bonappetit.com/story/hangover-cures", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Hangover Cures: Do These New Flashy Ones Work? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Tried Those New, Flashy Hangover Cures to See If They WorkedMy Instagram feed thinks I have a drinking problem. By Kyle BeecheyOctober 25, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailRecently my web algorithms have been feeding me promises of a new best drinking buddy: a product claiming to be my “liver’s wingman.” With this new responsible friend I could “wake up feeling refreshed,” or even “like a million bucks”. I was amused though unconvinced. But the ads kept coming. Ever brighter, with more tightly branded packages and shinier websites targeted directly at me, the Millennial woman. I started to wonder if maybe, though I hadn’t realized it, what was missing from my life was a cure for the common hangover.To clarify, my drinking habits range from non-existent to light. Most weeks I can count the number of drinks I have on one hand. When I do drink I get pretty tipsy after about six sips of a martini, and I’m pleasantly buzzed after a glass of wine. However. I am no stranger to the hangover. Even my light drinking makes me groggy the next day, and sometimes, depending on how much fun I’ve had, a little nauseous.So, a hangover cure? A little tablet to stock in my medicine cabinet, a shot of a safe vitamins and herbs that I could throw in my purse, a CBD patch that promised to help get me through the next morning’s writing, spin class, or meeting sans headache and nausea? Bring it on. Besides, if these things were popular enough to be showing up on my social feeds there had to be some validity to them, right? I was dubious but intrigued.The next shiny ad that came for me I clicked. And so began my unscientific experiments with hangover recovery products.The first thing that I discovered was that there are dozens on the market. They range from capsules to IV drips to powders to shots, and have formulations from natural-leaning combinations of B vitamins and CBD, milk thistle and DHM, to the more chemically derived aspirin and synthetic caffeine. The four that appealed to me were the most ubiquitous as well as the most innocuous: Blowfish, Flyby, The Good Patch, and Morning Recovery. And all of them have legions of fans. Blowfish has a glowing reviews tab on its website. Flyby is an Amazon bestseller with over 2,000 reviews averaging 4.5 stars. Morning Recovery has a 4.9 star rating from hundreds of buyers on it’s own website. People love the stuff. There are anecdotes of instantaneous alertness; waking up feeling rested and sharp instead of nauseous and groggy. And one reviewer even claims to use Flyby as migraine relief.Though the origin stories of each remedy varies, I noticed a few similarities. Both Flyby and Morning Recovery for example were born in 2017 after their respective founders traveled to Asia. Sisun Lee, founder of Morning Recovery, and Eddie Huai, founder of Flyby, separately discovered the proliferation of supplements to help ease symptoms of heavy drinking in Korea and Japan. “Drinking is a huge part of corporate culture in Korea,” Lee told me over the phone. “After a late-night out in Seoul, I stumbled into a convenience store at 3:00 a.m. to stock up on bottle tonics promised to help prevent hangovers. Amazed by how effective they were, I began researching the ingredients and science behind them,” he said. Lee discovered that it was DHM (dihydromyricetin) that was the secret link between the tonics. DHM is an herbal compound found in the Japaneser raisin tree and is said to help support liver detoxification, a more powerful and immediate cure for the symptoms produced by too much alcohol than say, greasy eggs, aspirin, or even Pedialyte or Gatorade.Superficially I knew that too much alcohol leads to headaches, nausea, and exhaustion, but what I didn’t know was that, scientifically, an alcohol hangover is understood as when the blood alcohol concentration (BAC) level in a body returns to zero after being elevated while drinking. A hangover is the body struggling in misery to return to normal. The struggle is alcohol withdrawal  coupled with dehydration and the abundance of acetaldehyde, a substance produced by the body metabolizing alcohol, have historically been pointed to as likely culprits (though a recent Dutch study disputes their role). On top of all that, drinking affects brain activity during sleep, so that helps explain why waking up exhausted is typical of a hangover.In short, the more alcohol consumed, the harsher the drop in BAC and the worse the hangover. These new remedies claim to address all the symptoms in one fell swoop, and in one small dosage.“We find that many people tend to dismiss the product as ‘just aspirin and caffeine,’” Brenna Haysom of Blowfish told me. “The effervescent formulation is specifically designed for hangovers, which means it works fast and it’s gentler on your stomach than aspirin pills and a cup of coffee. And at $1.50 a hangover it’s cheaper than a cup of coffee.”Sports drinks and potassium rich foods can rehydrate, but they won’t cure exhaustion. The cysteine in eggs, bacon, and even broccoli might help with the absorption of acetaldehyde, and the nausea. But DHM, the so-called liver detoxifier, is one of the secret links that supposedly ties it all together and produces a so-called cure. Similarly, aspirin or acetylsalicylic acid and synthetic caffeine does the trick of combating headaches, drowsiness, and nausea. Similarly, products like aspirin, electrolytes, and caffeine do the trick of combating.After using Morning Recovery, the brand claims, you’ll feel 80 percent better. Less exhausted, less nauseous, less dizzy and less headachy. And More Labs, the company behind Morning Recovery, has done rigorous testing to support its product’s claims.Ok, I thought, sounds pretty reasonable. But what did the academics and the medical community have to say? I inquired about the four specific products and their formulations. The response I got was essentially the same from all the three experts:  “There are no scientific studies published that prove that these products are effective or safe,” said associate professor of pharmacology at Utrecht University, Joris C. Verster, Ph.D. “Currently, the only effective way to prevent alcohol hangovers is to moderate alcohol consumption.”I also checked in with three communities of academic researchers, two based in the UK and one in the Netherlands that study the effects of alcohol in humans. The response was unilaterally the same: Caffeine and aspirin merely act as Band-Aid solutions, masking the effects of a hangover. Vitamins and DHM may be effective in some cases, but because a hangover is metabolically complicated, varying from person to person, they can hardly be considered a solution for everyone.As much as many of these products wanted to claim relief, the medical experts I spoke to told me that the science behind the brand studies is not universally accepted, and more trials need to be done. And, of course—aside from Blowfish, which contains FDA-recognized ingredients—as with all herbal supplements, the brand claims have not been evaluated by the FDA.To be clear, though these researchers told me that the hangover cures’ claims weren’t recognized by the scientific community, that doesn’t mean that the brand studies are fake or unofficial. Blowfish can claim a degree of being FDA-sanctioned as its ingredients (aspirin, caffeine) are FDA-recognized, while the others are classified as herbal supplements, which don't require FDA approval. It’s all very complicated.But back to my unscientific study, where there were no double-blind, placebo-controlled randomized trials at all. Instead, I invited seven friends over for dinner and to drink plenty of alcohol. Most of the seven were runners or Pilates obsessives. All in their 30s, at least three considered themselves heavier social drinkers while the other four were the nurse-a-glass types. We all get hangovers, and many of us admittedly get very bad ones, the kind that leave you in a sad state of never getting out of pajamas and watching The Real Housewives of Whatever all day.When my guests and test subjects arrived, I handed out Morning Recovery, which comes in pretty little blue bottles and can be consumed right before your first alcoholic drink, between drinks, or up to one hour after your last one. It’s a mostly herbal mix of ginseng, electrolytes, vitamins, and DHM. I also supplied my guests with effervescent tablets of Blowfish, a mix of aspirin and caffeine, whose website has an illustration of a youngish looking person lying face down on the ground. “Upon waking [the morning after a night of drinking],” say the instructions, “dissolve one or two tablets in a 16 oz. glass water and drink.” All the guests used one of the two remedies as instructed.Over the course of dinner—which involved ample creamy hummus, sourdough, steak, and an apple cake for dessert—we drank eight bottles of wine, then followed it all with amaro.The next day I asked for feedback on the hangovers. The reviews were mixed. They ranged from “Worst hangover ever” to “Maybe? I feel like it worked? I’m less impaired than I would be ordinarily” to “It did something. I still feel groggy, but not nauseous and don’t have a headache.”I also heard, “I have no idea. Don’t feel any different, but I did go home and drink more beers than I can count with my roommate.”Nothing conclusive to report there.As for me, I went with Blowfish and it did absolutely nothing. Headache and near-vomiting were still present. Though I’d given it a chance, like Brenna Haysom said I should while cautioning not to consider it just an aspirin and caffeine, that’s exactly what it felt like.But I continued my unscientific studies. Over the next few weeks, any time I had three or four drinks, I tried a new hangover remedy.After using Flyby I woke up without a headache or a turning stomach. Still exhausted, but I wasn’t expecting miracles. And, Flyby is primarily a supplement made from a spectrum of B vitamins, amino acids, ginseng, and DHM, so I might start popping the capsules daily, drinking or not.My few swigs of Morning Recovery probably canceled out even a fair unscientific trial, but for what it's worth, I did try it, and I didn’t notice anything. My boyfriend and another of my party guests, however, thought it worked well.The Good Patch, comprised of B vitamins and 15 mg of premium hemp extract was my favorite, even though it itched when I first put it on. The day after using it I shocked myself by running a full eight miles on only four hours of sleep without a headache or nausea.But would Alka-Seltzer, a multivitamin, and a banana have done the same? Really hard to say.I do know that what might work for me might not work for you. Our hangovers are unique to our genetic makeup. Turns out some of us are more lucky in that regard than others. I will say that even though all the scientists told me it’s nonsense, I can see myself stocking a few Good Patches and Flybys for the holiday season, or maybe even for the occasional run-of-the-mill Saturday night. In fact, I might drink two glasses of cloudy pét-nat to that right now.Explore Bon AppétitHealthyishHangover CuresTrendsRead MoreshoppingThe Fruit That Doubles As My Hangover CureBy Kiki FlynnRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Kyle Beechey"]}