{"id": "8b8d04e08a629c36eb6dc6b338313be3", "url": "https://www.bonappetit.com/story/summer-block-parties-omar-tate", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Summer Block Parties Are Different This Year, But Black Joy Lives On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSummer Block Parties Are Different This Year, But Black Joy Lives OnNeither COVID-19 nor police brutality has stopped us from gathering—even when we’re collectively separate.By Omar TateSeptember 3, 2020FacebookTwitterEmailPhoto by mamadi doumbouya FacebookTwitterEmailUnder the whir of helicopters and the bursting blasts of fireworks, gunshots, or both, my summer celebrations have been different this year. COVID-19 and the continued lynching of the Black body in our country has snatched away from us the possibility of gathering the way we once did. These days, it is almost impossible to speak in explicit joy over anything not colored by the looming cloud of staid grief that hangs over us like leaves on the trees.I find strength in the resiliency of my people. Black folks have endured—and continue to endure—some of the harshest treatment this country has to offer. Our joy has always come with a price. The concept of mortality has been something that I’ve had to consider since I was a young boy growing up in Philadelphia. Yellow tape crossed through an intersection was usually a sign that something or someone was no longer with us. Police and sadness—with neighbors left to pick up the pieces.But in the long hot days of summer, those same intersections would be crossed with the same yellow tape for a different reason: block parties, springing up all around Philly’s innermost sections. From late June to Labor Day, smoke would hang in the air from grilled sausages, burgers, and hot dogs. Children would freely zip up and down the open streets on pedal bikes and scooters. Adults would sit under canopies, letting their hair down in laughter, afforded the opportunity to rest their ever watchful eyes over the younger ones. On these hot summer days that turned into hot, humid nights, I remember finding young love as an adolescent, whispering sweet nothings to a potential date, sharing wet cans of soda from a cooler full of melted ice.Once I became an adult, with my own adolescent son, I sat at the grown-up table, sipping punch and telling jokes not for the sensitive ear. My son played basketball or tossed footballs to his friends down the street—out of earshot but not out of eyesight.This year, however, there are no tables or grills or yellow tape signifying entry into this haven of joy. The children are inside with their parents and we’re all reconsidering what it means to gather. The coronavirus has closed summer camps, shut down swimming pools, and canceled all large events. Doubling down on the stress of this moment is the lack of problem-solving from government and institutions. Our future is uncertain.But instead of being angry with the state of the world, my family and I have come together at my aunt’s house in Overbrook, a middle-class Black neighborhood in West Philly. Here, amid the small townhomes with their neatly manicured lawns, we forgo the large parties but continue to celebrate life with intimate family barbecues. And that’s how I met my aunt’s neighbor Courtney, a tall, slender, jovial Jamaican man who came into the yard one day, lured by the sweet, smoky smell of some chicken I was cooking on the grill.Photo by MAMADI DOUMBOUYA, FOOD STYLING BY PEARL JONESCourtney is slightly older than I am. He has a wife and a family and he loves food. Upon introducing himself, he immediately told me that he also loves to cook, and before long we were sharing both the chicken and our intense passion for food, talking about our various specialties. I told him I’m in love with many things but have a special affinity for lamb. Courtney quickly landed on his most celebrated dish: jerk chicken.This conversation was not as tame and innocent as it sounds. We exchanged animated and colorful language, heard some egging on by my Uncle Eric, and engaged in a good bit of name-calling. Eventually we decided to have a cook-off—with jerk chicken being the final, deciding meal. As a professional chef, I was excited about this plan; it felt like my own version of Beat Bobby Flay.We set the date for the weekend of July Fourth. With weeks to prepare, I sourced my chicken from a local Black butcher shop in Overbrook called Waite Bros. Lamb came from my friends at Plowshare Farms in Bucks County. Days ahead I marinated both the lamb and chicken in a homemade jerk seasoning, dressed some pork ribs in Creole mustard, salt, sugar, and dry spices, and bought some prepared sausages to round out the proteins.When the day arrived, I stepped out of my car and was immediately met with a light smoke emanating from Courtney’s yard. It was about one o’clock in the afternoon and he seemed to have been cooking since dawn. Wearing a bright smile and an apron, Courtney was running both a smoker and a double-barreled grill; his burnt ends, ribs, chicken, and sausage had been rolling well before I rubbed the coal from my eyes. It was at this moment that I realized: I am not Bobby Flay.But what could I do? I sparked my grill and began to play catch-up. All the while Courtney and I exchanged sharp glances, beers, and laughs. It was a family affair: My aunt made a green salad, pasta salad, and deviled eggs, and my mother made three different punches. Under the summer heat we lay across a blanket on the lawn and others sat at tables just talking. The children gathered at the base of the stairs to jump rope on the curb and play hand games. My aunt’s gospel music blasted from the speakers set in her front window.We ate burgers and salads and ’dogs until it was time for the main dishes: meat and meat and more meat, hot off the grate, piled high onto plates. And then, finally, the jerk chicken—crackly on the outside, juicy on the inside, and sizzling with the fire of Scotch bonnet chiles. Portions were passed and mouths fell silent.It was then that Courtney and I realized: This competition we started was not being judged by anyone. Looking around, I saw barbecue-sauced fingers and lips, finished plates of chicken bones, and full bellies. Everyone was smiling and the sun was going down. As the full rose moon began to crest over the tops of the townhomes, the blasts from the fireworks started as well, booming in the sky with the moon—illuminance from both God and man.I wasn’t missing the block party that day because we still had it all. And when I looked around at the other front lawns lining this quaint Overbrook street, I saw that almost every other family was experiencing the same thing. The grills were smoking and the music was blasting. The nooks were filled. There were no gaps in the happiness that consumed this block. The distance that has been forced upon society did not stop us from gathering—collectively separate. The yellow tape was no more a gateway than our hearts would allow it to be. Black joy lives on regardless of circumstance. It always has.The children assembled on the grass as Courtney set up an outdoor projector to show a movie. Standing behind them on his lawn while the movie started, I extended my hand to congratulate him. Competition or no, he certainly had the better food. Looking directly into my eyes through his glasses, he took my hand in his. “We both won today,” he said. “We cooked food with love and our families received that love and everyone is happy and that’s all that matters.”We both won.Omar Tate is the chef and artist behind Honeysuckle, a traveling pop-up dinner series exploring the narrative of Black existence. He is currently raising funds to build a Honeysuckle Community Center in West Philadelphia, which will include a market, café, library, and supper club. Click here to donate.Explore Bon AppétitFirst PersonSummerRead MorecultureFor Three Philly-Born Chefs, This Juneteenth Is About Looking Back—and Pushing ForwardBy Michael W. TwittyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-03", "author": ["Condé Nast", "Omar Tate"]}