{"id": "8b93917b33ad64aeaaea96da47890686", "url": "https://www.bonappetit.com/recipe/roasted-sweet-potatoes-miso-tahini-sauce", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Roasted Sweet Potatoes with Miso-Tahini Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Sweet Potatoes with Miso-Tahini SauceBy Lauren SchaeferMarch 8, 20183.9(37)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis three-ingredient sauce can go on anything. Make a double batch and spoon the extras over just about any meat, your next grain bowl, or thin it out with a little extra vinegar and use it as a salad dressing.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketForkSmall Bowl$13 At AmazonSmall Skillet$40 At AmazonPlatter$29 At AmazonIngredients2 servings2small sweet potatoes (about 10 oz. total)2Tbsp. neutral oil, such as canola or grapeseed½tsp. kosher salt2Tbsp. tahini2Tbsp. white miso2tsp. distilled white vinegar1scallion1tsp. raw sesame seedsPreparationStep 1Preheat oven to 450°. Rinse 2 sweet potatoes, rubbing to remove dirt from skins.Step 2Cut potatoes into quarters lengthwise, then cut each wedge in half crosswise into 2\"-long pieces (think a nice size to eat with your hands).Step 3Toss potatoes, 2 Tbsp. oil, and ½ tsp. salt on a rimmed baking sheet. Roast, tossing every 5 minutes, until a knife easily pierces flesh but exterior is still crispy, 15–20 minutes total (really important since you are cooking them at such a high temperature!).Step 4Meanwhile, mix 2 Tbsp. tahini, 2 Tbsp. miso, 2 tsp. vinegar, and 1 Tbsp. water with a fork in a small bowl until smooth.Step 5Trim root end off 1 scallion, then thinly slice from bulb to dark green tip.Step 6Heat a small dry skillet over medium. Toast 1 tsp. sesame seeds, tossing constantly, until fragrant and golden, about 30 seconds.Step 7Spread tahini sauce on a platter. Arrange potatoes over. Top with sesame seeds and scallions.How would you rate Roasted Sweet Potatoes with Miso-Tahini Sauce?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleI definitely agree with the comments saying it was too salty! I found the sauce did not go well with the sweet potato. I opted for a greek yogurt based sauce and it was 10x better. I used 1/2 cup greek yogurt with 2 tbsp of lemon juice and a pinch of sugar. Game changer! Logan PToronto, ON1/20/2022Soooo good... a combination I would've never thought of, but that is so satisfying, and so easy.  My only alterations are that I use white wine vinegar instead of distilled, and I go lighter on the salt, especially so if the miso I have on hand is extra salty.  Family and friends have loved this dish!  Evan WLouisville, KY 1/12/2021I loved this recipe. I saw many reviews that said there was too much salt, but I thought the salt was perfect; it seems it’s up to personal taste. I didn’t have any tahini on hand, so I made my own with a googled recipe. I topped it off with Peruvian chicken sauce (also on Google) and the suggested scallions. Highly recommend!Hope UrbanTulsa, OK1/4/2021I love the concept for this dish! Unfortunately the sauce was so salty I couldn't stand it! The salty miso flavour was way too overpowering. I consulted a few similar miso-tahini dressing recipes to salvage the ingredients (added maple syrup, more tahini, water) but I still would've preferred to just start new with a different dressing. Still after changing the dressing, the dish was pretty tasty and I would make something like this again....we ate it with aubergine as well as sweet potatohelpless4halloumiST ANDREWS, SCOTLAND7/30/2020The sauce is definitely salty, not really in a bad way though because it comes from the miso. I do think the whole dish needs something to brighten it up, so I added some dollops of yogurt which cut the saltiness. My potatoes looked super charred (like in the gif) but tasted good, not bitter or burnt.AnonymousNew York4/22/2020another recipe listed with 66 recipes for passover that are not for passover.  tahini is made from sesame seeds and are not allowed during passover.  You need someone to check your recipes before you post them in a list of recipes for passover.sunhine4/1/2020The miso-tahini sauce is delicious! I used 1.5 Tbsp of the miso because it is quite salty on it's own and I didn't want to overdo it. I think this combo is great. mariahllacuna6017Bay Area, CA3/17/2020I have made this recipe several time and I love it more each time. VamarFairport NY1/15/2020So yummy - can't believe I haven't thought of using this dressing with sweet potahtoes before! When I make it again, I would use:\n-  red miso instead of white (I find it to be a little bit more umami). \n-  about half the tahini (I use un-hulled, stone-ground - not to be fancy but because it's healthier + yummier!)\n- I'd also use lemon juice instead of vinegar (just has a nice 'earthier', less jarring taste than vinegar imho).\n- Would boil until quite soft, then rub oil and salt onto unpeeled sweet pot's (the salt helps the caramelization)\n- Best to roast without oven fan in fairly hot oven - the longer the better, even when parboiled, say 20ish mins for that lovely, crunchy outside - mmmmmmm. (I don't turn at all - but keep an eye on 'em).\n- Oh and I'd also throw a few crushed cumin seeds, in with the sesame seeds when pan-roasting. Yum!\n- Lindy SavilleMornington Peninsula, Melbourne, Australia12/31/2019I wonder if people are using cheap instant miso or something. The sauce is on the saltier side, but not overly so, and we were really pleased with how it came out. This would be a great prep method for other root vegetables.janemontgomery12/30/2019Loved this recipe. The sauce was new to me but it was perfect with the sweet potato. VamarFairport NY12/26/2019Wasn't blown away by the sauce honestly. I didn't find it too salty, since 1/2 a teaspoon is very little salt. Not sure why people are finding that to be a lot. Also, it's definitely 2 tablespoons of oil, that's a reasonable amount to toss the sweet potatoes in for roasting. Didn't like the sauce much, but I'd probably use the same method for roasting sweet potatoes again. Might try it with the Miso Honey sauce from another basically recipe!AnonymousColumbia, SC10/22/2019Flavors work but it's way too salty if you follow their ingredient list.  I used 2 teaspoons miso: 4 tablespoons tahini and 4 tablespoons water and it was still too salty. I also substituted the white vinegar with rice wine vinegar. It's a little less tart. \n\n think 1 teaspoon miso, 4 tablespoons tahini + 4 tbsp water + 2  tsp rice wine vinegar might work. I also tossed with arugula to make a salad. I'm going to try again with adjustments. AnonymousNYC3/2/2019I agree with the comments that the dressing is too salty (and I like salty foods) and that the proportions seem to be off. I had to adjust the first time and add more tahini, vinegar and little more water. Then I thought it was great!\nWhite miso, also known as shiro, has 860 mg of sodium per tablespoon, a little bit over a third of the recommended daily limit! \nI made it a second time with the adjustments and would suggest staring with 1/2 Tbsp. miso, 1 Tbsp Tahini, 1 tsp vinegar (I used apple cider because that's what I have), and 1/2 Tbsp water. Whisk it together and then you can build it up from there adding more miso, etc., if you like. \nAlso, I skipped salting the potatoes before cooking, again, because miso is already so salty.\n\nLately I've seen a lot of recipes on these larger food websites that seem like they could use some copy editing. I'm not sure if they are being rushed to put up content or too focused on posting the accompanying videos. But it would be nice if they were a little more careful.AnonymousAround8/19/2018I am not sure why this recipe calls for 2 Tablespoons of oil. Perhaps that's a typo and it should be 2 teaspoons. In the video it looks as if they are using far less oil then the recipe calls for.RubyHeartAround8/16/2018Explore Bon AppétitSweet PotatoPotatoVegetableMisoCondiments, Sauces & PastesTahiniEasyQuickSideDairy-FreeVeganVegetarianRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-08", "author": ["Condé Nast", "Lauren Schaefer"]}