{"id": "8b9e52fcaba902b395bdf1e2c08ef899", "url": "https://www.bonappetit.com/story/coconut-chocolate-mousse", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "The Simplest Coconut-Chocolate Mousse Just So Happens to Be Vegan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Simplest Coconut-Chocolate Mousse Just So Happens to Be VeganIt's free of refined sugar, too.By Molly BazJanuary 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.Let’s be clear: Just because the holidays are over, and my diet is leaning toward cleaner flavors after weeks of carb heavy cheese-laden indulgence, doesn’t mean I’m abstaining from dessert.  Small treats are just as important when you’re eating clean and maybe even more so, and they don’t need to be totally unhealthy. Just a little bit unhealthy.I set out to develop a recipe for a cleaner chocolate mousse by cutting out dairy and processed sugars. The one thing I refused to do: compromise on flavor. Enter vegan chocolate mousse. It might sound suspicious, but take a look-see at the short and sweet ingredient list, and you’ll notice that it’s comprised of only the most delicious things. Made with aquafaba (yes, the liquid left over from your can of chickpeas), bittersweet chocolate, coconut cream, and coconut sugar, there’s nothing not to like about this simple dessert.The recipe unfolds much like any chocolate mousse recipe, with the exception of that “aquafaba,” that famed byproduct of the chickpea, which can do magical things. The aquafaba is beaten until voluminous and stiff-peaked, then folded into melted chocolate (look for a vegan chocolate bar if you want this to be fully dairy-free) that has been sweetened with coconut sugar and made creamy by the addition of coconut cream.The mixture then gets divided among ramekins, set to chill, and topped with a dollop of whipped and sweetened coconut cream. A final sprinkling of coconut sugar is the finishing touch.  The recipe leaves you with six-single serving portions for when you’re feeling selfish (and you should be). They’ll last you all week and curb that nightly chocolate craving.  But, of course, if you’d rather share, this is a healthyish twist on a classic dinner party dessert.With an active cooking time of about 15 minutes and an ingredient list that can be counted on one hand, there’s very little standing in the way of you and a creamy, coconut-y vegan chocolate mousse that’s the perfect way to end a mid-January (or any time) meal.Get the recipe:Coconut-Chocolate MousseChoose a chocolate that does not exceed 64% cacao for a mousse with the smoothest texture. If you want the mousse to be fully non-dairy, look for a vegan chocolate bar, though the flavor may differ slightly.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanDessertHealthy DessertsMousseChocolateDark ChocolateCoconut CreamCoconutVeganRead MorecookingThis Roasted Broccoli Recipe Indulges All My Food ObsessionsBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-05", "author": ["Condé Nast", "Molly Baz"]}