{"id": "8ba52b951f37b0b5cf97eaff3555541d", "url": "https://www.bonappetit.com/story/goop-lab", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Hating Goop Is Not a Personality | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHating Goop Is Not a PersonalityNotes on The Goop Lab and other thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroJanuary 30, 2020FacebookTwitterEmailPhoto by Rachel MurrayFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I spent Monday night on a cross-country flight that lasted four hours longer than planned, ran out of food and water, did not have functional internet, and made an unexpected layover in Vegas, and no, they didn’t even let us off the plane to play slots. By 1 a.m., we were somewhere over the Midwest and I was down to my last sips of water and the dregs of a bag of PopCorners (kettle-corn flavored, so good). That’s when I turned on The Goop Lab. I’d downloaded Gwyneth Paltrow’s new Netflix series—FOR RESEARCH PURPOSES—before leaving L.A. but didn’t actually think I’d watch it. Desperate times, as they say.It’s de rigueur to roll your eyes at Gwyneth Paltrow, as instinctive for many of us as groaning about the president or liking Beyonce’s Instagram posts. These reactions, our approvals and our scorns, are a form of shorthand, a way of telling the world who we are and what we stand for. Rolling your eyes at Paltrow says that you read that jaw-dropping Times Magazine profile, that you’re clued in to how medically suspect, appropriative, and classist Goop is, and you have the right amount of skepticism about the wellness industry as a whole.But what does it mean to hate Goop in 2020? At 47, Paltrow is firmly in the cool-mom demographic, and her company, founded in 2008, is turning 12. Meanwhile “wellness” continues to contort itself into every corner of our lives. Paltrow may have been the thin, blonde, white woman who started it all, but these days I’m too riled up about Big Cannabis and the beef and dairy lobbies to care about a website selling $1,100 handbags alongside articles about soft-belly breathing.And that’s how I felt about The Goop Lab too. Taken on its own, the show feels like HGTV for the wellness set: utterly formulaic, mildly informative, made for my mom. Ladies, have you heard about ~magic mushrooms~?! The first episode takes Goop staffers to Jamaica, where a white couple tells the group about the importance of psychedelics in other cultures, then guides everyone (not Paltrow, though she admits to taking MDMA once “in Mexico”) through a mushroom trip. Studies are cited, and there are lots of cuts to Paltrow in her pastel-pink office chair, meticulously outfitted and dewy-skinned, pitching softball questions to eager experts. It’s intense and transformative, people are changed, etc., but it’s all filmed in an air-freshened, paint-over-the-cracks kind of way.And that’s every episode: Rinse and repeat with cold exposure, energy work, psychic readings, and anti-aging therapies.As other reviewers have pointed out, the episode on sexual pleasure is the most illuminating...if you’re a cis-gendered woman at least. Showing photos of vulvas of all shapes and sizes, as the episode does, feels like a much bolder and more interesting form of empowerment than selling a vagina-scented candle or standing in front of a cheeky floral backdrop.Anyway, my point is, I don’t think Goop will be that relevant in five years, and that’s probably a good thing. But I’m not convinced something better will be in its place.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleA Week of Desperation CookingBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Amanda Shapiro"]}