{"id": "8bc3608a349beac444d96a421bb15cac", "url": "https://www.bonappetit.com/story/zoe-lister-jones", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Zoe Lister-Jones on Hiring an All-Women Film Crew and Being a ‘Bone Brothatarian’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleZoe Lister-Jones on Hiring an All-Women Film Crew and Being a ‘Bone Brothatarian’The ‘Life in Pieces’ star also writes, directs, produces, and eats a lot of greens.By Alyse WhitneyMay 22, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailZoe Lister-Jones has a very specific set of routines, and the first thing we do when we sit down to lunch at Dimes in NYC is throw them out the window. As she dips what she dubs a “woven golden basket” of ginger-mint tea into a mug of steaming water, the actress admits: “I’m not a loose-leaf tea gal; it’s too much work for me.” We both inhale a whiff, and it’s as close to a spa as you can get in the middle of an NYC restaurant.A warming mug is exactly what we needed during this drizzly spring day. “I’m always cold and I’m a hyped-up kind of girl, so I need some calming teas,\" Lister-Jones says. “I like when my basil’s holy, and I‘m big on chamomile, lavender, fresh mint, and fennel for digestion.” Even though tea is a soothing ritual for her, she admits that the storage situation is anything but calm. “I have a drawer full of boxes of tea. It’s chaos,” she says with an open-mouthed laugh.Lister-Jones, 35, has a hyphenated name and a multi-hyphenate career. She plays dry-witted lawyer Jen Short in Life in Pieces, an acclaimed family comedy that returns for season four this fall; she wrote the rom-com-ish  Lola Versus about figuring out your life before you turn 30 (starring Oscar-winning friend Greta Gerwig); and she wrote, produced, directed, and starred in the film Band Aid, a dramedy in which a couple turns their blowout fights into writing and performing music instead. Oh, and she wrote and performed the original music for it too. And made a pizza holder out of a harmonica stand. As Lister-Jones describes it, she can’t figure out how to stop creating new ideas nonstop, like a roadrunner sprinting laps around her brain.\"Working with women is so quiet and hyper-efficient. It was a very cohesive, communicative, patient, and kind set. It’s unquantifiable to explain—it just felt different.\"“As a creator, it‘s really hard to turn my mind off. I have a problem with distinguishing productivity from pleasure. I feel most at peace when I‘m being productive, but I think that‘s a lie that I tell myself. When I allow myself to power down, I have so much more energy to create and more ideas than when I grind through it every day.”It was this level of intensity about her work that led her to hire an entirely female crew for Band Aid, from cinematographers and editors to truck drivers. Initially she wanted a safe space for her directorial debut so her authority wasn’t questioned, giving herself the best shot at being a leader, but it did much more than that. “Working with women is so quiet and hyper-efficient. It was a very cohesive, communicative, patient, and kind set. It’s unquantifiable to explain—it just felt different. And I hope it sets a standard for the future, whether I can just hire more women or up to 100 percent again.”Now that #MeToo, Time’s Up, and 50/50 by 2020 are household names, Lister-Jones is cautiously optimistic that there can be real changes in the industry. “I never would have imagined we would have gotten this far in this short amount of time. There is a definite shift in terms of discourse around gender and racial inequity, but the system is so broken that it‘s going to take so much more than any of us can understand,” she explains between sips of tea. “There are more and more stories being told about women, but in terms of the objectification of women, it‘s so ingrained in our society.”Lister-Jones’ partner in work and in life is her husband, Daryl Wein, with whom she has co-written multiple films. She admits she hasn’t experienced a lot of the double standards that other women have when pitching new projects and on set. However, as she does more projects on her own, she’s feeling a need to work harder and prove herself.“Listen, I love the idea of directing a superhero movie. That is a part of my aspirational manifestation,” she says. But with those aspirations comes stress. To combat anxiety, she turns to her routines, like her daily end-of-night process: removing her makeup, taking a steam shower with essential oils, and doing a mask. “So much of my job is about human interaction. By the time I come home, I may have spoken to a hundred people,” she says. “There‘s something really nice about the solitude of those moments of stripping away that character and that day. Or multiple days of things not being quite right. It’s a reset.”Other times, she turns to her kitchen, not so much for cooking as supplementing. “My pantry has pull out shelves, and I have a very large shelf completely covered with supplements,” she tells me with her arms outstretched to show its size. “My cleaning lady said to me the other day, ‘Are you sick?’ But I‘m actually quite healthy. I was proud of my vitamin drawer for this flu season, because as everyone around me dropped like flies, I didn’t get sick. If my drawer had a name, it’d be Beyoncé—she’s superhuman.” The assortment includes get-well remedies like colloidal silver, oregano oil, and Lypo-Spheric Vitamin C (a “gnarly gel that’s like eating Neosporin”); Vitamin D, B-complex, and probiotics; and Chinese herbs and powders recommended by her acupuncturist and holistic MD. (Two go-tos are Herbal ABX and Nourish by Evergreen Herbs.) She regularly does cupping to get rid of toxins, even though it “makes you look like you were abducted by aliens.”When it comes to her diet, she calls herself a “bone brothatarian,” which means plant-based plus bone broth for protein and other vitamins. She also eats “a fuck ton of greens.” She rolls her eyes at herself as she says that, joking that it’s the “most LA thing” she’s ever said. “This is crazy, but I try to eat six to nine servings of greens a day. A serving, to me, is a fistful or so, and I get most of the vitamins and iron I need there. I was raised on big salads and homemade dressings, so I’ve always loved them.” (She estimates that her Dimes’ order—a salad with lacinato kale, red cabbage, candy cane beets, carrots, and sorrel—classifies as at least three servings of greens.)\"My husband showed me a video of this robot that plants and waters for you and I'm like, 'I'm in, add to cart.'\"Living in Los Angeles now, “you can throw a rock and hit a farmers‘ market,” but Lister-Jones has always had a healthy relationship with fresh produce. “My mom was really health conscious-growing up, so I was raised with a lot of awareness around where my food was sourced, going to farmers’ markets and the Park Slope Food Co-Op.” Her mom graduated to growing veg on her Brooklyn rooftop, but Lister-Jones... isn‘t quite there yet. She jokes that she has “a black thumb and kills all living plants by just looking at them.”“My husband tried to do a garden in our backyard, and it was so exciting, but everything died,” she says with a sigh. “When we had it, he showed me a video of this robot that plants and waters for you and I’m like, ‘I’m in, add to cart. Amazon Prime.’”As much as Lister-Jones appreciates her routines, she’s also game for experimentation, whether with gardening robots, new supplements, or different foods to add to her diet. “It’s an ever-evolving journey to see what‘s good for my body and my health. I have to be careful because I’m really good at eating so clean sometimes that it eliminates everything.”But like with any life decisions, there is one big nonnegotiable. “I put on salt on everything. I need a lot of salt in my life. It’s one of my joys. No one will ever take it away from me.”Explore Bon AppétitInterviewsCelebritiesHealthyishRead Moreculture'Battle of the Sexes' Star Natalie Morales Is Queer, Vegetarian, Cuban, and ProudBy Alyse WhitneycultureEliza Coupe: \"I’m an Actress with Food Issues and Body Image Issues—That's Real\"By Alyse WhitneyLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamLifestyleThe 7 Supplements That Healthyish Staffers Swear ByGallery7 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Alyse Whitney"]}