{"id": "8bc57ebb5947d57d2a18d62ab7208980", "url": "https://www.bonappetit.com/story/rent-week-spanish-tortilla-recipe", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "A Spanish Tortilla Recipe for Rent Week (and My Birthday) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Spanish Tortilla Recipe for the Haters (and My Birthday)This Spanish tortilla recipe might not be traditional, but hey, desperate times call for...yeah, you know.By Alex DelanyAugust 30, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI don’t care that I’m a Virgo. I don’t subscribe to the alleged significance of horoscopes or astrological signs or whatever planets may or may not be in retrograde. (This is apparently very Virgo behavior, or so I've been told.) But I’m prepared to hear about it even more than I usually do, because my birthday is this weekend. And people like to tell you what your sign is when you mention your birthday. That’s just how it works.Regardless of what your sign might be, birthdays are especially nice when they fall on a Rent Week. People buy you beers. Cover your midday coffee. Bring fancy pastries into the office for breakfast. (At least at Bon Appétit they do. Or I hope they will. Guys?) Maybe your friends will even pay for dinner. I’m hoping so, but when all is said and done, I don’t need my friends to buy me anything. I’m fine without any gifts, because I have one of the all-time great Rent Week recipes at the ready. And it’s especially fitting, because it kind of looks like a birthday cake! I am talking about the tortilla española, the tortilla de patatas, the tortilla de papas—the legendary Spanish tortilla.I know what I’m signing up for here. People are going to give me shit for this recipe. And I am prepared to take it, because I’m starting by saying that this is not an authentic Spanish tortilla. What we have here is a cheater’s Spanish tortilla, the same dish at heart, with a big tweak that makes it cheaper (which we’ll get to later). We’re still talking about a thick omelet made with eggs, onions, olive oil, salt, and potatoes—a five ingredient dish that is incredibly budget friendly. So let’s throw on this Pointless Anthology Playlist (filled with tunes from the 26 years I’ve been alive and completely free of charge) and hold all comments until after we’ve finished. Go ahead and preheat your oven to 300°.You start by making caramelized onions. Thinly slice 1 large yellow onion and heat a glug of olive oil in a Dutch oven over medium heat. Add the onion and season with a couple pinches of kosher salt.Some Spanish tortillas are thick. Some are thin. This recipe will give you a flatter tortilla, since we're using a 10\" skillet.\nPhoto by Chelsie CraigWhile the onion begins to caramelize (make sure you’re stirring them every once in a while, and feel free to turn the heat down to low if they start to stick), peel and slice 2 medium Idaho or Russet potatoes widthwise into very thin medallions. The thinness is key. You want to go as thin as you can without getting into potato chip territory. In a traditional Spanish tortilla, the potatoes are fried until tender in a ton of olive oil. Here, we’re going to toss and roast them in just a little olive oil. This saves around 1½ cups of olive oil. That’s a significant chunk of change!Drizzle a sheet pan with olive oil and scatter the potato slices overtop. Drizzle the top of the potatoes with olive oil, and shake them around so all of the surfaces get covered. The idea here is that by maximizing surface area and minimizing the interior, the olive oil will be absorbed by the potatoes just as much as it would be by frying. Throw the sheet pan in the oven on the middle rack.The onions will take 30-40 minutes to reach a dark brown, signaling that moisture has left the onions, the sharp sulfuric flavor has disappeared, and the sugars have caramelized fully. Let the onions cool completely. The potatoes shouldn’t take much longer than the onions. Take them out of the oven when they are tender but before they have a chance to brown. We don’t want color on the potatoes. Sprinkle with plenty of kosher salt and let the potatoes cool for 10 minutes. Pour the remaining olive oil from the sheet pan into a small bowl.Toppings are up to you. Bell peppers, mustard aioli, and salsa verde all work.\nPhoto by Chelsie CraigHere come the eggs. Beat 9 large eggs in a large mixing bowl until they’re smooth and the whites disappear. Slowly whisk the reserved olive oil and a few pinches of salt into the eggs, and then mix in the caramelized onions and the cooked potatoes. Heat a glug of olive oil in a 10” non-stick skillet, and when it's hot pour the egg mixture into the pan, making sure the potatoes and onions are distributed evenly.Let the tortilla cook over medium heat, pushing up the edges of the tortilla with a spatula so the eggs run under and set against the heated pan. This speeds up the cook time so that your eggs aren’t black by the time everything sets. Keep doing this every so often, until the edges of the tortilla are set, and there’s still a little bit of liquid egg in the middle of the tortilla. This should take around 5 minutes. Now we flip the tortilla.Flipping a Spanish tortilla seems scary. I understand that. I was scared the first time I flipped a Spanish tortilla. But it has to be done. Do you remember what Yoda said in The Empire Strikes Back when Luke is training with him on Dagobah and thinks he can’t lift up his sunken X-wing fighter using The Force? Of course you do. He said, “Do. Or do not. There is no try.” Those are words to live by, and the same mentality applies to flipping a Spanish tortilla. You don't try to do it. You just do it.Place a plate that is slightly smaller than your pan directly on top of the tortilla, and with one hand on the center of the plate and one holding of the pan’s handle, flip the pan swiftly and with confidence. Leave your hand under the plate, and remove the pan from the top. You did it! Now, slide the tortilla back into the pan with the cooked side facing up. Some egg and a potato or two will get left behind. That’s fine. They are sacrifices for the cause. What matters is that your tortilla is flipped, and the other side is cooking. Sorry if you never watched Star Wars and didn’t understand that reference. (I’m not apologizing for the reference. I’m just truly sorry that you’ve never seen Star Wars.)A nice, celebratory spread, whether we're talking birthday party or not.\nPhoto by Chelsie CraigLet the tortilla cook for another three-ish minutes, until you can poke the center of the tortilla and tell that it has set fully. Slide the tortilla out of the pan, onto a cutting board or plate, and let it rest for at least 15 minutes. Spanish tortillas are better served warm than hot. And even better at room temperature.You can slice that tortilla up and eat it plain if you’re impatient or extraordinarily hungry. But while the tortilla rests, I like to make a little topping. I might sauté some red bell peppers in olive oil with a bit of garlic and then hit them with a splash of vinegar. I might make a quick salsa verde or pesto. I might make a little mustard aioli. Maybe I made some extra caramelized onions for a topper. Or I might just reach in the fridge and grab a bottle of hot sauce, a jar of mayonnaise, and go to town.Anything works, as long as it’s still Rent Week-friendly. This is your delectable, cheap (it cost me $16 to make three of these), five-ingredient, not-so-authentic tortilla. Do what you want. All that I ask is that if you happen to serve me a Spanish tortilla in the next week, please, put some candles in it and sing me a song. The birthday song would be nice—but again, it’s your call. Do whatever feels right.Want some tomato sauce for that tortilla? Here ya' go:A Rent Week Tomato Sauce for August and BeyondCheap? Yes. Tasty? Yes. Easy? Yes. Simple? Yes. Versatile? Yes. Should we start? Again, yes.View StoryExplore Bon AppétitBasicallyRent WeekEggPotatoOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-30", "author": ["Condé Nast", "Alex Delany"]}