{"id": "8bc8884d0d01431d24f8fe61e724ea16", "url": "https://www.bonappetit.com/story/nicole-byer", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Nicole Byer Is #VeryFatVeryBrave, Thank You Very Much | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNicole Byer Is #VeryFatVeryBrave, Thank You Very MuchThe comedian, ‘Nailed It!’ star, and podcast host loves the body she’s in, and mean tweets aren’t going to change that.By Alyse WhitneySeptember 19, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailNicole Byer’s voice has been in my head for years. First on MTV’s Girl Code, where the comedian dished out hilarious, unfiltered advice about dating. Then on the based-on-her-real-life TV show Loosely, Exactly Nicole and podcast Why Won’t You Date Me? about perpetual singleness. Most recently, I've been loving her as the host of Netflix’s Nailed It!, a chaotic baking competition show that leans into making fun of people who are walking Pinterest fails. (Seasons 1 and 2 are streaming in full on Netflix now, with a  holiday special to come in December.)After all those years of listening to Nicole’s jokes, I felt like I knew her. We’re both plus-size women who love bold-printed clothes and are always trying to make people laugh. Recently, over kale-bacon salads at Ruby’s Café in SoHo, we talked about wearing her first bikini, her morning mirror pep talks, and how she took the power back from haters on the internet and in real life.You are so body positive and seem to not care about what anyone thinks of you. Have you always felt like this?I used to care. I was a smaller person and cared. I just woke up like three years ago and said to myself, Just wear a tank top. Wear a tube top. It’s fine. Even if you’re wearing a sleeve, people know your arm is fat. I decided to wear whatever the fuck I want. I don’t have enough time in my life to care. I regret spending my early twenties covering my arms and wearing cardigans in the summer. I wore a bikini for the first time in Palm Springs, because I knew no one would know me there and I could say, I’m very fat and very brave, which is what people looooove to say on Instagram. “You’re brave.” That’s the hashtag I use, #veryfatverybrave, and my goal is for women to look at it and go, “Oh, a body is a body is a body.”How do you react if someone makes fun of you in public?If someone looks at you, that means your body’s powerful. They had to stop their day to look at you. If they say something to you, that means they couldn’t get through their day without saying something to you. If it’s nasty, it’s like whatever, but you weren’t thinking about them—they were thinking about you. When people are like, \"Well, you’re promoting obesity,\" I say, \"No, I am promoting loving the body that you’re in currently. If you want to change it, great. If you don’t, then live. Live in it. Live your life. Travel, do shit, buy two seats on the plane. Who cares?\"Have you gone through periods of your life where you thought about dieting or thought about changing your habits?I’ve been on Atkins, I’ve done keto, and I’ve done so many diets. I found out that I like to binge eat, which is the root of the problem. If you eat one hundred oranges, it defeats the purpose of eating an orange. I don’t ever want to be a thin person; that seems upsetting. I don’t have any plans to ever diet again, but exercising does help with life. Endorphins are real and it’s annoying because I don’t like to exercise. I hate running, but I started weight lifting like 150 pounds, and it's fun and it makes me feel accomplished.Since Nailed It! premiered, have you received any negativity on social media?Comedy is subjective, so if you don’t like it, that’s fine. There are some people who are like, \"Nicole’s too much for me,\" and I’m like, \"I feel you. It is exhausting being me.\" The one that bothers me is when people say I’m promoting obesity or not healthy. They don’t go to the doctor with me. I shouldn’t have to prove my health to anybody. You think that frail, thin woman is healthier than Ashley Graham? It’s the same thing as asking a married couple if they want to have kids. You don’t know the ins and outs of that. You don’t know if they’ve been trying. You don't know their story. If I wanted to talk to you about my health, I would put it out there to talk about, but it’s not something that is a part of my agenda.What’s your stance on responding to the haters?I like to retweet people and then be like, \"I didn’t really need your opinion, but thank you for letting me know, because obviously if you tag me in it or use my full name, you wanted me to see it.\" I search my name on Twitter because I don’t want to miss the compliments, and I favorite the nice things people say about me so they know I saw it. People are more positive than they are negative, and I try not to harp on the negative. I read almost every comment I get because I’m waiting for someone to tell me something I don’t know. There’s not one person out there that is universally liked except for maybe Mr. Rogers.Do you feel like your personal brand as someone who is body positive and confident has influenced the roles you play?I don’t think my body has really come into play for anything. [On Loosely, Exactly Nicole] I did three blow job scenes, and no one was ever like, \"Nicole, are you okay in your bra?\" Everyone was like, \"What color bra? A fun one?\" Everyone was on board with that, and I got to do a lot of things my thinner counterparts do that fat women don’t do unless it’s part of a joke. Fat women don’t fuck on television unless it’s a joke, and we fuck a lot in real life. You see fat women with husbands and people and partners and wives, and they’re very sexual people. That’s something that should be represented. Every show doesn’t have to start with two fatties meeting at an Overeaters Anonymous meeting.What has dating been like for you?If you’re dating me, you know what I look like. You know my comedy, more or less. You like what you see. When I was younger, I thought guys were just chubby chasers. As I got older, I realized some men like bigger women, or some men like a personality and it’s encased in a bigger woman, so that’s what they like at that time. I’ve just learned to not question why someone likes you. Just be happy that they do like you and enjoy the ride.What advice do you give other women, and in turn, what you wish you could have told your younger self?It took a while, but I just learned to wake up and love myself. I tell people to look in the mirror in the morning, grab their little fat handles and just go, \"Woo, baby, I’m hot!\" You just fake it until you make it and one day you will wake up and you won’t have to say it. You’ll just feel hot.Do you have a mantra you tell yourself in the mirror?I look fucking fab, and I’m not here for anybody but me. I don’t get dressed for other people. I get dressed for what I see in the mirror. My body isn’t for other people’s consumption. If I smile when I look in the mirror, then great. Let’s start the day.This interview has been edited and condensed for clarity.Explore Bon AppétitHealthyishCelebritiesInterviewsRead MorecultureDiane Guerrero on Why She Won't Fake an Accent and the Colombian Dishes She CravesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-19", "author": ["Condé Nast", "Alyse Whitney"]}