{"id": "8bc93bbc1ccc38dcfe56f3f26f5727ea", "url": "https://www.bonappetit.com/recipe/breakfast-grilled-cheese-with-soft-scrambled-eggs", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Breakfast Grilled Cheese with Soft Scrambled Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueWylie Dufresne’s Scrambled Egg SandwichBy Wylie DufresneFebruary 13, 20184.6(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintSoft scrambled eggs in about a minute? We didn’t believe it either until we tried this recipe from Wylie Dufresne, who created this sandwich hybrid at Du's Donuts in NYC. Mixing in cream cheese adds back the richness lost by cooking the eggs quickly.IngredientsMakes 2Scrambled Eggs4large eggs1small pinch of cayenne pepperKosher salt2Tbsp. unsalted butter3Tbsp. cream cheeseAssembly4slices American cheese4thick slices Martin’s Potato Bread or other white breadUnsalted butter (for pan)PreparationScrambled EggsStep 1Whisk eggs and cayenne in a small bowl; season generously with salt.Step 2Heat butter in a medium saucepan over medium. As soon as it begins to foam, add eggs and cook, whisking constantly, until they have set in small curds and are beginning to look dry, about 1 minute. Immediately remove from heat and whisk in cream cheese.Step 3Do Ahead: Eggs can be scrambled 2 hours ahead. Store tightly covered at room temperature.AssemblyStep 4Divide cheese between 2 slices of bread and top with egg mixture. Close up sandwiches.Step 5Heat a dry large skillet over medium-low and brush very lightly with butter. Toast sandwiches until golden brown, about 3 minutes per side.How would you rate Wylie Dufresne’s Scrambled Egg Sandwich?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis was AMAZING.  The next time we make it, I'll use less cream cheese b.c. it's a little too rich.  The only thing I think this is missing is some acid to cut through so I'll be throwing in some diced pickled onions.  Michael ConnorWashington, DC12/13/2021Used a little less cream cheese, still very rich and tasty. Paired it with some hot sauce for dipping (I used original Cholula) and it was fantastic! AspenWinston-Salem12/8/2021Used ricotta - a bit less rich. DavidBoise 10/6/2021I found these eggs to be way to rich for my taste.  I used 4 eggs and 3tbs of cream cheese and it was too much for me.  I would suggest adding small amount of cream cheese and tasting until you reach the right amount of richness.  The sandwich creation is pretty standard and always pretty tasty.EAW208146/30/2021So tasty! I made just one sandwich and I used one egg. Cheese - I used goat mozzarella because that's what I had and it was terrific. Bread - Wonder Bread with Fibre (I'm in Canada, not sure if they sell exactly this in the U.S). I had it with a sliced cucumber/tomato/lemon juice/parsley/salt/pepper salad on the side. I would definitely eat this again! SandybandyToronto, Canada6/4/2020Holy canoli, these eggs are the best I’ve ever had! Just made this for the first time & tragically we can’t get American cheese here but aged cheddar still worked! Used soy & linseed sourdough because it’s what we had but it would be SO much better with thick, white bread. But, ugh... The eggs. I can’t believe how good they are! Next time, I might just eat them out of the pan with a spoon and call it a day.AnonymousSydney. Australia3/28/2020I really wanted to love this, but it disappointed across the board: 4 eggs (medium size) produced WAY too much, scrambled egg poured out of the sandwiches into the second pan, all over when we cut them with a sharp serrated blade and when we tried to eat our sandwiches. The scrambled eggs were delicious prepared this way, but WAY too rich. Along with the butter and cheese, we could barely manage to eat half a sandwich each. And we are tried and true grilled cheese aficionados, we don't shy away from rich foods. Can't recommend this one, sorry.AnonymousDubai3/27/2020Ok. I made this for the first time two weeks ago when we started social isolation. Since then, I've lost count of how many times I've made this. I've made variations to produce several sandwiches, swapped out different cheeses (based on what we have on hand) and am at the point where the little measuring required is no longer needed. This is just the most understated, delicious and quick breakfast sandwich. I've never been one to believe that a breakfast sandwich can be ONLY eggs... I always want eggs as an accompaniment to a savory protein, like breakfast sausage. However, I can safely say I am now a full egg & cheese convert. MAKE THIS SANDWICH. It will take hardly any time and hardly any ingredients and will make you feel like a CHEF.ethompsMinneapolis, MN3/26/2020Made this a few minutes ago. For me it was more a breakfast burrito. I fried up a little mild Italian sausage, added it to the eggs scrambled as instructed, heated a tortilla in a microwave with some shredded cheddar, added egg mixture, wrapped it up. It was great. I have been making scrambled eggs for years, but this way of making them is far and away the best I have ever had.AnonymousTucson AZ4/6/2019My son's version of this is to add a dash of paprika and garlic to the eggs and swap the Am cheese for provolone served in a warm croissant. Cooked on an open camp fire .... Ah-freaking-mazing. \n\nP.S. my Dad's nickname is Wylie (we are also Dufresnes)BeeDuBeeDuBeeDuCT2/15/2019Wowowowowow. I don’t write a lot of reviews.. But I’ve decided it was time to share my love for this recipe, considering I have now made it countless times and have practically memorized it. Not only is it made with normal pantry staples that I always have and its super easy, but it’s also the best breakfast sandwich I’ve ever made at home and it definitely rivals most that I’ve had out. It doesn’t have that drippy yolk that I usually require in my BF sandwhich (which initially turned me off). But that yolky flavor is replaced with those melty, goey, nostalgic American cheese slices from your childhood. The scrambled egg recipe that’s used is delicious in itself. It’s a perfect method for those creamy small curds. And adding the cream cheese helps with richening the flavor, but also helping to bind the curds together so that your sandwich stays “tidy”.  The recipes method for getting a nicely browned sandwich, while also melting the cheese is also perfect. \nThis sandwich is great just the way it is, BUT If you wanted to jazz it up.. I have also chopped up some chorizo and thrown it in with the scramble 👌🏻 \nHappy eating =) Rachael MeyersSyracuse NY12/8/2018I made this today for myself for lunch.  I used 1 egg, a splash of Cayenne, and a knife swap of cream cheese.  I used dark oat bread and a slice of cheddar cheese because that was what I had on hand.  It was amazing!Anita459Oregon5/19/2018Explore Bon AppétitSandwichAmericanEggCheeseQuickEasy5 Ingredients or FewerNut-FreeVegetarianSautéBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Wylie Dufresne"]}