{"id": "8bdff527594a480a608e2db612813e97", "url": "https://www.bonappetit.com/story/this-corn-chowder-is-dairy-free", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "This Dairy-Free Corn Chowder Makes My Little Lactose-Intolerant Heart Flutter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Dairy-Free Corn Chowder Makes My Little Lactose-Intolerant Heart FlutterIt’s luxurious, rich, and packed with corn flavor, no cream in sight.By Amiel StanekAugust 26, 2021FacebookTwitterEmailPhoto by Julian Cousins, food styling by Adriana Paschen, prop styling by Elizabeth JaimeFacebookTwitterEmailI love corn chowder. Corn chowder does not love me. Or, more to the point, the dairy that makes a pot of creamy chowder so rich and luscious and craveable does not, er, make me feel great as a somewhat lactose-intolerant person. And while I have been known to pop a Lactaid and dog down on a big bowl of dairy from time to time, the summer months are so full of milky temptation that I have to pick my gastrointestinal battles wisely. This is to say: soft-serve in, corn chowder out.So when I saw senior food editor Andy Baraghani’s recipe for Creamy Corn and Clam Chowder With Crispy Chorizo in the September issue of BA, I paused, and sighed, and looked longingly at the image of pop-y kernels of fresh summer corn and briny little clams lolling about in a rich-looking broth knowing in my heart that it wouldn’t be For Me. But then I scanned the ingredients list, and my heart leapt: nary a spot of dairy in sight! Could it be? A corn chowder just for me?! I was on my way to the nearest farmstand before you could say August.Let me tell you, this recipe has a lot going for it even without the whole “dairy-free” thing. It calls for a mere 10 ingredients, and that’s if you count oil, kosher salt, onions, garlic, and paprika, all things I already had at home. And by hybridizing two iconic chowders—corn and clam—it sneaks a ton of savoriness into an otherwise-simple broth in the form of the juice exuded by the bivalves when they open. But by far the greatest trick of them all is blitzing a portion of the corn and broth together in a blender and then stirring the sunny purée back into the soup, a step that gives the finished dish the kind of luxurious, spoon-coating richness that I would normally associate with a hearty pour of heavy cream. (Word to the wise: I’ve made this twice, once with a real blender and again with an immersion blender when I was feeling lazy, and the former yields a much creamier and better-incorporated result.)Not only did this method mean that I could enjoy a luxe chowder without suffering one iota of digestive distress, but I actually found that this version allowed the corn and clams to shine in a way that they otherwise wouldn’t. The fat in dairy can dull flavors, and without it the corn tasted sweeter and brighter, the clams brinier, and the whole thing fresher and more lively than a chowder has any right to be. A chowder just for me! After my first bowl, I knew that I had found my new favorite seasonal soup. And you know what I did to celebrate? I popped a Lactaid, and went out for ice cream.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-26", "author": ["Condé Nast", "Amiel Stanek"]}