{"id": "8be4d2720f4f05db6782e27a24bab734", "url": "https://www.bonappetit.com/story/dustbuster-adulthood", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "This $25 Vacuum Helped Me Deal With Adulthood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow a $25 Vacuum Helped Me Deal With AdulthoodI wish you could just pull a small gadget from a wall in a matter of seconds and suck all your problems away.By Flora TsapovskyJanuary 15, 2019FacebookTwitterEmailFacebookTwitterEmailThere’s been a lot of talk about millennials and \"adulting\" recently, about how we struggle to complete the simplest, most mundane tasks. Cleaning was never such a task for me. In fact, it’s always been a form of therapy, a mindless endeavor with instant gratification, always available when researching stories, setting goals, or when other \"grown-up\" tasks become too much to handle (though rest assured that my partner does his fair share of chores).  But, now that I have a 16-month-old daughter, it's become harder to defend my home—its limited-edition pillowcases, animal sculptures bought across five continents, and thoughtfully framed vintage postcards—from mess and dirt. So I bought a vacuum cleaner, and then it made me cry.Let me explain.It all started relatively innocently, with a realization that between the cat, the toddler, and life itself, messes were piling up faster than my deadlines. What if, instead of the ever-crusty broom or the heavy, awkward vacuum hiding in the closet, there was a tiny gadget, cordless and slick? What if I could pull it out quickly and make it all go away? For $24.95, Amazon delivered a small, easy to assemble mini-vacuum, powered by rechargeable batteries and complete with a comfy wall mount. “Oh, you bought a Dustbuster?” my partner exclaimed with nostalgic glee. Having grown up outside of the U.S, I’d never heard of such a thing; in fact, when I saw the inexpensive Black & Decker device, I thought I’d stumbled on the craziest innovation in the history of cleaning. Turns out, while my mom was manually eliminating my messes in late-’70s Communist Russia, American women were already enjoying the first Dustbuster by the very same brand. I’d unknowingly bought a piece of U.S history—fully redesigned.After the package arrived, I found myself using the tiny vacuum quite frequently and with a suspicious amount of joy. With my new cordless friend, the therapeutic effect of cleaning skyrocketed. I was becoming properly addicted. I pulled the Dustbuster out every morning and let it power through, sucking cat food, chest hair, soil, and cracker chunks into oblivion. Soon, I found myself telling my friends and family about it with the passion normally reserved for new relationships. “It’s so fast!” I’ll tell an acquaintance. “You just pull it out, and just like that, no mess!” To another friend, I remember saying: “It’s seriously the best thing that happened to me this month.”When I brought it up on another occasion, tearful and overcome by a feeling of deep gratitude, I knew something was going on. And then I heard myself say: “I wish everything in life was so easy.” “How do you mean?” my friend wondered. Somehow, between the end of college and this year, life—that big bundle of chores, career choices and aspirations my peers have reportedly been failing at—did sneak up on me. Parenting, especially, flips the script. Forget mailing packages and registering to vote, staying on top of Oscar nominees or maintaining friendships. Try doing all of the above plus caring for a tiny human you artisanally co-produced along the way, whose sole purpose in life it to touch everything and climb on anything. Pockets of time previously reserved to self-care, taking a break, or Googling those Oscar nominees, for God’s sake, can easily evaporate. And the home—the \"sanctuary\"—you once had? It’s a 24/7 playground. You love every moment of it, sure, but tasks double and triple while your bandwidth stretches tragically thin. You adjust, of course, but it takes time.I wanted to tell my friend that I wish you could just pull a small gadget from a wall in a matter of seconds and suck all your problems away. Doubts: gone. Unpleasant duties and conflicts:  momentarily eliminated. Mucky challenges: Done with. And while making life nice again, the gadget’s pleasant noise would be just loud enough to quiet the negative chit chat in your head. While the cordless vacuum could never do all those things, I still found something utterly healing about its industrious, seamless ways, its readily available efficiency. I was now the adult cleaning up, and life wasn’t getting any easier, or freer. Hmmm went the Dustbuster, restoring peace and harmony. It couldn’t suck away all of life’s dirt and unpleasantries like I wanted it to, but it was a suitable and affordable stand-in.Did American women and men decades ago feel the same way? I want to imagine they did. Nearly 40 years after its creation, I finally joined the Dustbuster ranks, feeling as if I uncovered a sweet secret. I still pull it out multiple times a day, trying not to feel embarrassed by the unusual strength of our bond. I know the Dustbuster won't cure all my problems, but it helps me cope every day, and for a $25 vacuum, that's saying a lot.Buy it: Black + Decker Dustbuster Cordless Handheld Vacuum, $30.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishSelf CareessayRead MoreLifestyleForget the Fancy Fitness Studios, Zumba Is the Only Exercise Class I NeedBy Flora TsapovskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-15", "author": ["Condé Nast", "Flora Tsapovsky"]}