{"id": "8bf773ad195d31daad51a1650a92a66f", "url": "https://www.bonappetit.com/story/watermelon-feta-salad", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "This Watermelon-Feta Salad Is Our New Go-To Summer Side | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Watermelon-Feta Salad Is Our New Go-To Summer SideThis summer, we’re swapping the basil and mint for turmeric and coconut oil in this classic summer salad.By Anna StockwellMay 27, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta FlorczykFacebookTwitterEmailWe all know everything is better with salt and fat, but no two summer ingredients demonstrate this better than watermelon and tomatoes. Take a bite of tomato: it’s good. Now sprinkle some salt and drizzle some olive oil on top and try again: it’s very very good. Same goes for watermelon. Now swap that salt and oil for a piece of feta, which is of course both salty and fatty, and it’s music to your mouth.When I started developing savory melon salads (the best side dish for any grilled food!) for our grilling issue this year, I knew there had to be a watermelon-feta salad. I brought tomatoes into the mix for all the reasons we just discussed, and because I liked the pink and red color combination. I added a turmeric-infused dressing to drizzle over the top to stain the bright white feta yellow (and add a pop of unexpected flavor).To make the turmeric oil oil, I heat virgin coconut oil with lightly crushed peppercorns, coriander seeds, and cumin seeds as well as ground turmeric in a small saucepan over medium until fragrant, then I drizzle it all over a platter of cubed feta, tomatoes, and watermelon. It’s important to make sure the salad is room temperature before you do this—cold ingredients will make that coconut oil seize, like dipping an ice cream cone in a chocolate magic shell. The oil gives the salad some unexpected warmth, spice, and nuttiness, and of course I finish it off with an extra flourish of salt to make sure every flavor pops. It’s a whole new kind of watermelon-feta salad, and I’ll be making it all summer long, from the first baby sungolds to the last hefty heirlooms.Get the recipe:Tomato-Watermelon Salad with Turmeric OilRed, juicy, and sweet, tomatoes and watermelon are soul mates, and they both need salt, spice, and fat to reach their full potential.View RecipeExplore Bon AppétitHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-27", "author": ["Condé Nast", "Anna Stockwell"]}