{"id": "8bff4ea35400478a5ffae09904bcab51", "url": "https://www.bonappetit.com/recipe/citrus-shandy", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Citrus Shandy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueCitrus ShandyBy Alex DelanyJune 2, 2020EmailPinterestPrintPhoto and drink styling by Emma FishmanEmailPinterestPrintEmailPinterestPrintEasy. Relaxing. Refreshing. Sunny. Filled with fruit and flavor. Yes, that describes your ideal summer, but also the shandy, the season’s most accessible cocktail. Keep a premixed batch of fresh juice and seasoning in your fridge to pour into a glass of light beer and ice whenever the sunny vibe needs to be turned up to 11.Ingredients6-8 servings6oz. Campari2cup strained fresh orange juice½cup fresh lime juice2tsp. Aleppo-style pepper1tsp. kosher salt4–612-oz. bottles chilled light beerPreparationStep 1Vigorously stir Campari, orange juice, lime juice, Aleppo-style pepper, and salt in a large pitcher. Chill until ready to serve.Step 2To make 1 drink, pour about 8 oz. beer into an ice-filled glasses and add Campari mixture to your liking.Step 3Do ahead: Campari mixture can be made 2 days ahead. Keep chilled.How would you rate Citrus Shandy?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleSimple, quick and easy to make. Delightful!AnonymousA hole10/5/2020Explore Bon AppétitCocktailDrinks AllCold DrinkCampariAlcohol & Other DrinksAleppo-Style PepperHerbs & SpicesOrangeCitrusFruitSummerQuickEasyDrinksFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Alex Delany"]}