{"id": "8c07bbd2f991f1e54b8a6b1ccd413611", "url": "https://www.bonappetit.com/recipe/salted-chocolate-tahini-bliss-balls", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Salted Chocolate–Tahini Bliss Balls (Tupak E-khorma) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Chocolate–Tahini Bliss BallsBy Molly BazMarch 15, 20184.9(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThese two-bite “bliss balls,” known in Persian cuisine as tupak e-khorma, are just fudgy and chocolaty enough to satisfy a sweet tooth craving. Consider them an indulgent energy bite: Keep 'em in the fridge, then grab one when the craving hits.IngredientsMakes 10⅔cup plus 1 Tbsp. unsalted, shelled raw pistachios, divided4Medjool dates⅓cup tahini (such as Soom)3Tbsp. pure maple syrup¾tsp. kosher salt¼cup plus 2 Tbsp. unsweetened cocoa powder, divided1Tbsp. toasted sesame seedsPreparationStep 1Line a rimmed baking sheet with parchment. Pulse ⅔ cup pistachios in a food processor until very coarsely chopped. Add dates, tahini, maple syrup, salt, and ¼ cup cocoa powder and process until mixture balls up and forms a mass around the blade.Step 2Roll batter into ten 1-oz. balls (each about the size of a ping pong ball) and arrange on prepared sheet. Chill until firm, about 20 minutes.Step 3Meanwhile, grind sesame seeds and remaining 1 Tbsp. pistachios with a mortar and pestle or chop with a sharp knife until finely ground and no large pieces remain. Transfer to a small bowl. Place remaining 2 Tbsp. cocoa powder in another small bowl.Step 4Re-roll balls between your palms until smooth and round. Dip one half of each ball into pistachio-sesame mixture, then the other half into cocoa powder.Step 5Return balls to baking sheet and keep chilled.Step 6Do Ahead: Balls can be made 1 month ahead. Wrap each ball in plastic and transfer to a resealable bag. Keep chilled.How would you rate Salted Chocolate–Tahini Bliss Balls?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThese went down such a treat with my family, and they're so easy to do!! I will definitely be making them again, this is a great recipe.AnonymousLondon, UK2/18/2022Made these with hazelnuts instead of pistachios because that's what I had on hand. These were delicious! So quick and easy to make!AnonymousCalifornia1/20/2020Let's be realistic: mine will never look as picture perfect as the photo illustrating this recipe does. I've no clue how one half is perfectly coated in nuts and the other perfectly coated in cocoa powder -- during my double dip, my fingers smudged off one or the other side. After a few hours in the fridge, the cocoa started to be absorbed by the ball. However, looks aside, the taste cannot be matched. I daresay they improve with a day of aging in the fridge! Skip the 'wrap each ball in plastic' instruction -- this is probably to preserve the coating's integrity more than anything and well, as described, who cares so much about that? Plus it's unnecessarily wasteful of plastic. These couldn't have been easier to make though! Go ahead and make double (though be wary of your food processor's capacity) since they last! I made mine with roasted/salted pistachios and just didn't add any extra salt, and the flavor is still good.breebridger3741Houston, TX10/30/2019These are AMAZING. I have been trying to find a healthier version of halva, and this hits the spot! I have used cashews and walnuts in place of the pistahios and it is still amazing. I have also not coated them in sesame seeds before and they still taste great! ElizabroWinston-Salem, NC5/14/2018making them AGAIN~\nso good, try not to eat them all the first dayAnonymousnew jersey4/21/2018These taste sinful, and I cannot wait to make them again. Healthyish as promised! AnonymousBrooklyn, NY4/16/2018Explore Bon AppétitDessertPersianMiddle EasternDateDried FruitFruitPistachioNutTahiniCondiments, Sauces & PastesCocoaOther IngredientsQuickEasyGluten-FreeDairy-FreeVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Molly Baz"]}