{"id": "8c09a2d1754944cfce3cb3908845f4e6", "url": "https://www.bonappetit.com/story/dana-frank", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Dana Frank's New Natural Wine Fair Has Us Scoping Flights to PDX | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe'd Get on a Plane to PDX for Dana Frank's New Natural Wine FairThe bar owner believes that wine should be less intimidating, more fun, and easier to understand.By Lizzie NoonanFebruary 28, 2020FacebookTwitterEmailPhoto by David AlvaradoFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Dana Frank, owner of beloved Portland natural wine spot Bar Norman and founder of The Wild Bunch wine fair.I met Dana Frank across an endless bounty of flaky khachapuri at Pheasant’s Tears Winery in Sighnaghi, Georgia. We belonged to a sundry crew of wine directors, writers, and enthusiasts that had flown across the globe to dive into the rich viniculture of the country that produced the world’s first vintage over 8,000 years ago. In between long-winded toasts and generous refills of amber wine, Frank’s jovial, inquisitive nature fostered the kind of open conversation typically reserved for one’s inner circle. By the end of the supra, a traditional Georgian feast, we’d gone from virtual strangers to fast friends.Turns out, Frank has a penchant for making people feel at ease around wine: As the owner of the natural wine bar Bar Norman in Portland, OR, and prominent feature in the city’s burgeoning wine scene, she does so on a daily basis. The former wine director of Ava Gene’s, Frank co-authored the cookbook Wine Food and owns Bow & Arrow with her husband, winemaker Scott Frank, in the Willamette Valley. Their eight-year-old Orly can’t legally partake in the family business just yet, but she’ll definitely talk your ear off about the next vintage of her imaginary cuvée.But wine didn’t always permeate every aspect of Frank’s life. Upon returning to the U.S., Frank made her way into restaurants. It wasn’t until she started working front-of-house at Merenda in Bend, OR that her attention turned to wine. “I hadn’t really thought a whole lot about wine, then I stumbled into this progressive program run by young, interesting people—the antithesis of what I understood wine to be,” she says, “I found it to be completely engrossing:  No matter how hard I tried, I could never learn everything there was to know.”These days, Frank is most often spotted at Bar Norman, enthusiastically greeting regulars, writing out the day’s by-the-glass menu (which often reaches 30+ wines) in chalk, and replenishing the eclectic assortment of to-go bottles as music blasts through the hi-fi speakers. Named for her grandfather, Bar Norman was born out of a desire to create a space that champions inclusivity over correctness: “When I started working in wine, it was about learning as much as possible, getting really nerdy and ‘talking wine’ like everyone else,” Frank says, “Now, I’m in a totally different place: I want to make the conversation that surrounds wine less intimidating, more fun, and easier to understand.”To that end, the bar’s calendar is packed with community-centric events that frequently have educational or activist slants. On any given night, there could be a skin contact-themed dance party, a Hummus Hang pop-up, or a cookbook launch for Alison Roman’s Nothing Fancy. During a recent Trash the Tariffs fete, the local wine industry gathered in solidarity to sign letters to local congresspeople to protest Trump’s proposed 100% tax on European wine imports. Frank may have set the stage, but only so that she could invite everyone to join her on it.Right now, Frank is putting the finishing touches on Portland’s inaugural natural wine fair and food market, The Wild Bunch, happening this Sunday, March 1st. We caught up with her about her love of Nigerian music, taking a leap of faith on Bar Norman, and why she’s feeling more empowered now than ever before.The Wild Bunch was created to…celebrate winemakers, importers, and artisans from around the world in Portland. Even though we’re in the middle of wine country, Portland has been focused on beer and cocktails for so long and been relatively disconnected from wine culture. We wouldn’t be where we are in Oregon without the history of wine in Europe. We want people to be able to discover wines that would otherwise take them months or years to try if they were buying full bottles. It’s for anyone that’s interested in wine, especially natural wine, and likes to have a good time. Also, who doesn’t like a party?Wine has the power to…help us understand the world better. It’s a way to connect with other people and places throughout history as part of our everyday lives.I decided to open Bar Norman because... I thought that if I didn’t do it, someone else was going to do it. Up until this point, I had never had much of an entrepreneurial spirit. I was always very afraid of failure and rejection. Before I was about to open the bar, all of those lingering doubts disappeared and I felt like I had to do it.Right before we opened…my sister Linsey gave me a framed copy of “The Man in the Arena” by Teddy Roosevelt, which hangs next to my mirror. I look at it every morning to remind me that there are going to be critics and people that don’t agree with the choices that I've made, but at the end of the day the only person I have to answer to is myself: If I’m not trying and not failing then what am I doing?One of my greatest pleasures is… growing up with my daughter Orly. I’m learning to be a better person by way of raising her.I’m nourished by…the people in my life, both my family at home and my family at Bar Norman. I feel so grateful to work with the people that I do everyday and share that space with them. I’m grateful to work with people that are so good—good at their jobs, sure, but just good people.My connection between wine and music...is through my husband Scott because he’s the reason that my life is full of good music. There’s no day without music anymore; it’s constantly playing in the house, in the car, and in the bar all of the time. I have a deep love of Ethiopian and Nigerian music, as well as R&B—mostly whatever Scott is listening to, I’m listening to. I actually appreciate the times that are quiet because they’re so few and few between.I’m inspired by…the next generation of womxn in their teens, 20s, and 30s who are pushing against the patriarchy, knowing it’s the only way forward. Certainly I have bold, outspoken colleagues my age and older (and thank god for them!), but I'm from a generation of industry professionals that was accustomed to being bossed around by men. Now, I'm feeling more empowered to stand up for myself and other womxn around me. I don't want to ever feel like I can't speak my mind. Been there, done that.I started running… on a whim. I had always thought I didn’t like running, but I knew that I needed something to get me moving again after having my daughter and I couldn’t figure out how to fit anything else in. Running was simply a matter of putting on shoes and going out the door. Going out for a two  or three  hour run was the only time I had to myself; I wasn’t getting that space in any other way in my life.Cooking is how...I feel connected to the world. It’s similar to the way I feel about wine. I focus most of the food that I make from places like the Middle East, North Africa, and Central Europe. I like to buy a cookbook or come back from a trip and delve deeply into that food culture.I’m looking forward to…the rest of my 40s. I am really loving and reveling in my life as it is right now. I feel like every year gets better because I'm learning so much about myself. I’m in my 16th year of working in wine, Bar Norman is well into its second year, and I run a couple of different wine businesses. I’m a mom and a wife.Right now, my focus is on... mentoring. I’ve been so fortunate to have incredible mentors in my career and it’s time to start giving some of that back. My goal is to help my vibrant, energetic staff, who have many more hours in their days than I do, find their own way in the world.Explore Bon AppétitHealthyishnatural winePortlandPerson of InterestInterviewsRead MoreLifestyleJenny Lefcourt Won't Admit That She's the Reason You Drink Natural WineBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-28", "author": ["Condé Nast", "Lizzie Noonan"]}