{"id": "8c18d291740b782929ebb3f22f6aa0bb", "url": "https://www.bonappetit.com/story/sour-cream-dressing", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "This Sour Cream Dressing Would Make a Cardboard Box Taste Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 2-Ingredient Dressing Could Make a Cardboard Box Taste GoodLike a much, much, much easier version of ranch.By Emma LaperruqueNovember 29, 2021FacebookTwitterEmailPhotography by Isa Zapata. Food Styling by Micah Morton. Prop Styling by Paige Hicks. FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I used to think the easiest dressing of all time was oil plus vinegar: Two ingredients! Whisk together! Done! Yet there are many other fat-plus-acid dressings that are also two ingredients and deliver much more flavor without much more work.This one, Zingy Sour Cream, comes by way of my new book, Big Little Recipes. Just like my Food52 column, every dish—from weeknight dinners, like slurpy soups and saucy pastas, to useful bonuses, like one-ingredient stocks and two-ingredient frostings—has five ingredients or fewer.Big Little Recipes$25 $22 at Amazon$25 at Food52Zingy Sour Cream hinges on one of my favorite techniques—buy one, get one. When you purchase just about anything pickley, like pepperoncini or kimchi or capers or olives, you get the pepperoncini or kimchi or capers or olives, of course. But you also get their brine. Instead of tossing it, treat it like a revved-up vinegar.For your new go-to dressing, start with a jar of pepperoncini and a container of sour cream. Measuring is highly optional: Add a big plop (about ¼ cup) of sour cream to a bowl, plus a splash (about 2 Tbsp.) of pepperoncini brine, and a spoonful (about 1 Tbsp.) of minced pepperoncini. Stir, taste, adjust if needed (you can add a smidge of salt if you want), and ta-da.If you don’t have sour cream or pepperoncini on hand, there’s still hope. Whole-milk Greek yogurt and crème fraîche are willing and able to step in. Same deal with dill pickles, pickled jalapeños, or even sauerkraut.Much like ranch—but with, ahem, about nine fewer ingredients—this dressing is a happy marriage of richness and tanginess, two opposites attracting like a magnet. It keeps in the fridge for days in an airtight container, where it will be on hand to make a wedge of iceberg or a bunch of kale feel like a million bucks. Juicy tomato and slivered onion? For sure. Chunky cucumbers and buttery avocado? Here for it. But don’t stop at salad. Spoon Zingy Sour Cream over grain bowls, smear it inside sandwiches, or drizzle it on roasted or grilled anything: chicken, zucchini, portobellos, you name it.But honestly, probably, most definitely best of all? Use it as a dunking sauce for leftover pizza, still cold from the fridge.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-29", "author": ["Condé Nast", "Emma Laperruque"]}