{"id": "8c21b4fb6c5ae8e6391230139e65d751", "url": "https://www.bonappetit.com/city-guides/san-francisco/venue/san-francisco-proper", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "San Francisco Proper Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginsan franciscoSan Francisco ProperA Mid-Market hotel that’s as homey as it is stylishFacebookPinterestTwitterEmailProper Hospitality GO HERE: for a bit of an escape from the gangs of tourists (and hilly terrain), while still remaining close to the best restaurant-y neighborhoods (Hayes Valley, SoMa, Tenderloin). The San Francisco Proper has your back.THE VIBE IS: almost Wes Anderson-esque. Vibrant patterned wallpaper line the rooms and super-high ceilings accentuate all the details, like brass and bronze fixtures. Cloud-like Aireloom beds and Aesop-outfitted bathrooms ensure you’ll be pampered.PRACTICAL STUFF: Rooms start at $265.—Elyse InamineProper HospitalityWE ALSO LOVEHotel ZettaUnion Square hotel with a playful feel—literallyZuni CaféThe iconic Hayes Valley bistro that's world-famous for a reasonHotel VitaleEmbarcadero waterfront hotel that neighbors the Ferry BuildingExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-28", "author": ["Elyse Inamine"]}