{"id": "8c237761db70f04d4a51a98ec6891dfa", "url": "https://www.bonappetit.com/story/soy-scrambled-eggs", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Dinner Scrambled Eggs Are The Perfect Thing to Cook When You Don't Feel Like Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingScrambled Eggs For Dinner, No Breakfast Vibes AllowedExactly the thing to cook when you don't want to cook.By Amanda ShapiroApril 1, 2020FacebookTwitterEmailPhoto and food styling by Emma Fishman FacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.You don’t have to convince me to eat scrambled eggs for breakfast. Slow-stirred and velvety? delicious. A few seconds in a ripping hot skillet? Love ‘em. Oozing with smoked salmon and dill? Gimme. Even the most over-cooked, rubbery, diner eggs are somehow comforting when you’re hungover at 11 a.m. But dinner scrambled eggs? Not my thing.Or so I thought. The person who changed my mind was none other than Chris Morocco, which shouldn’t surprise anyone. He’s changed millions of minds (Ed note: This is an estimate) about broccoli, tofu, eggplant and more. But this particular recipe is, I think, his biggest coup: dinner scrambled eggs—no breakfast vibes allowed.He does it with a triple-threat of ingredients—grated ginger, mirin, and soy sauce—which get added to the raw eggs. Then he cooks the eggs in ghee (though unsalted butter works too) at a medium-low temp until they’re barely set. And...that’s it. Wow, scrambled eggs are easy.You might not taste each of the added ingredients on their own, but together they lend subtle sweetness and umami to an already unimpeachable food. It’s like when someone shows up at the party looking better than they used to but you can’t quite put your finger on why. New haircut? Trimmed beard? Whatever it is, they look good. And dinner-appropriate, I might add.Morocco’s dinner scramble recipe calls for quick pickles and rice, which, sure, sign me up, but I’m just as likely to eat these eggs over wilted greens or over fried bread. And despite Morocco’s dinner agenda, I’ll happily eat them for breakfast too.Get the recipe:Soy-Ginger Dinner ScrambleGinger and soy sauce make scrambled eggs for dinner feel like more than a cop-out.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-01", "author": ["Condé Nast", "Amanda Shapiro"]}