{"id": "8c2ee6a027624b136b33c5164594e493", "url": "https://www.bonappetit.com/story/wilson-tang-nom-wah-one-year-covid-19", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Through Pandemic and Anti-Asian Violence, My Chinatown Restaurant Is Holding On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThrough Pandemic and Anti-Asian Violence, My Chinatown Restaurant Is Holding OnWilson Tang, the owner of Nom Wah Tea Parlor in New York City, looks back on the last year and shares what keeps him going.By Wilson Tang, as told to Elyse InamineMarch 16, 2021FacebookTwitterEmailTang—and his flat-brim Nom Wah hat—outside the 1950s-era facadePhoto by Laura MurrayFacebookTwitterEmailRunning Nom Wah Tea Parlor, my family’s restaurant in Manhattan’s Chinatown, has been a roller coaster this year. Just a lot of ups and downs—and you don’t know how steep the downs are until you’re on it.The first couple weeks of last March were pretty scary and unreal. No one knew what the hell was going on. But being a Chinese restaurant in a Chinese community, we saw the writing on the wall. A lot of my staff have family in Asia, and they heard how bad COVID-19 was out there, specifically in China. That kind of news was detrimental to the neighborhood. Business was down and so was morale prior to the March 16 shutdown in NYC. My staff is on these chatroom platforms like Weibo and WeChat, and they were talking shit to each other. “Oh, your family went to China and brought it.” Or there were rumors, generally in the Chinese community on these chatroom platforms, that coronavirus started upstairs, above Nom Wah. It was Chinese being mean to other Chinese. I started seeing this more and more because everyone was reacting from their screens.Things escalated pretty quickly. When the shutdown was announced, we decided to close the restaurant since a lot of our staff live in multigenerational households and were afraid of contracting the virus and spreading it to their families. We gave away food to our staff and went into hibernation for two months. People managed to get whatever government assistance was out there—unemployment, stimulus checks. I made sure of that. But I also knew that my staff, and the Asian community overall, is very strong and know how to live within their means.Exactly two months after we closed, we reopened the tea parlor because our PPP had just kicked in. Applying for that loan was like a sneaker drop. You’re on your computer, and you go to a certain portal to enter all your info and upload your tax filings to get your loan amount. But then after doing all that, it was like, “Oh my god, it’s not going through or the website is buffering.” In the end we got a loan for the restaurant, along with loans for our other locations in Nolita (which stayed open throughout the pandemic) and Philly.At the tea parlor, we started bringing people back slowly. We just rotated staff so everyone could come in, earn some money, and have some normalcy. We also arranged for carpooling and paid for parking so everyone could come safely in their own pod.Summer was okay. I applied for NYC’s Open Streets program to close Doyers Street, so we were able to put out tables and chairs. The outdoor dining brought back a little business, but the numbers weren’t great. Sales were down 80 percent, so we had to figure out ways to get creative.My whole thing was how do we bring business to a restaurant outside the four walls? I started cold-calling apartment buildings in the area, asking them if they’d be interested doing a group buy of individual take-out orders. The idea was to do 40–50 orders for one night for one building, so they save on delivery fees. We also offered cooking demos for buildings, so tenants could buy dumpling-making kits and hop on Zoom with us to learn how to make dumplings. We pitched these things to building managers so they could offer them as amenities to tenants since they couldn’t use gyms and common spaces. We did more than a dozen of these think-outside-the-box ideas.We also began selling our frozen dumplings nationwide through a partnership with Goldbelly. It started out pretty easy, just 20 orders a week. We were so conservative in terms of what we thought we’d sell. Throughout the entire winter, from Thanksgiving to Christmas to Lunar New Year to Valentine’s Day, it was gangbusters. We were packing hundreds of orders a day. My business partner at the Nolita location and I banged out these orders everyday.This didn’t make up for the 80 percent. We ate into our savings. We cut deals with our landlords. We reduced the staff. I took a massive pay cut. All those things combined got us through the season.This year, there wasn’t much of a celebration for Lunar New Year. I don’t think it was warranted, with COVID. There wasn’t a parade. There wasn’t anything. We did what we could as a small restaurant group. We made the auspicious foods. We had one lion dance group come to ward off the evil spirits and bring the restaurant good luck. But the streets were pretty quiet. Restaurants have been closing early because the staff needs to get home. After the rise in hate crimes against the AAPI (Asian American Pacific Islander) community the past couple months, no one wants to stay out past 6 p.m. A few weeks ago, someone got stabbed down the block from us. Businesses in Chinatown were already hurting, and now everyone is afraid for their lives.The stakeholders of this community are chipping in to see what they can do. Jennifer Tam and Victoria Lee, the founders of Welcome to Chinatown, have been doing a phenomenal job advocating for small businesses here. There’s this guy, Karlin Chan—he’s a lifetime resident of Chinatown and he’s always organizing Chinatown Block Watches to patrol the streets like the Guardian Angels. Patrick Mock of 46 Mott is awesome. Jenny Low is an activist who has been talking to the media about ways to help. They’ve all done so much for the community.I’ll be the first one to tell you: I don’t know how to make an impact yet. I’m still sorting it out in my head. And I’m listening.At the restaurant, I end up being a therapist, dealing with everyone’s issues at home or in the workplace. That’s how I hear about the kind of racism my staff is facing. Someone will tell me, “Oh, this person got spat on.” Another will share, “So and so got pushed on the train.” These are the stories I hear, but when I sit down with those who experienced this, they’re like, “Oh, it’s fine.” I think Chinese Americans, and Asian Americans in general, are humble. They suck it up and deal with it. But I want to make sure my staff has someone to come to, either myself or my management team, to talk about these things.Since it’s been such a roller coaster, we started getting excited over the smallest things. Like a few weeks ago, we could officially open for 35 percent dine-in capacity. We were like, “Oh my god, we can fit seven more people in the dining room!” About 75 percent of my staff has the vaccine. We take those small wins.This year has felt so long, so much longer than 12 months. It’s definitely been the longest year of my life. The pandemic brought me back to day one of running a restaurant, hustling dumplings and connecting with the community.As I’ve been packing these Goldbelly orders, I read the messages people send with them. They range from, “Sorry we couldn’t get together this year, but hopefully we can pig out in Chinatown soon” to “Hey, Mom and Dad, here are some dumplings,” or even “Happy birthday! We couldn’t celebrate, but remember that great meal we had at Nom Wah?” These are the messages we got from Maine to Florida to Alaska to Hawaii. It was so heartwarming. It reminds me that people care about Chinatown. It pushes me to do more.Explore Bon AppétitCoronavirusFirst PersonRead Moreculture“If I Can Eat in Chinatown, So Can You”By Wilson Tang, as told to Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Wilson Tang", "As Told To Elyse Inamine"]}