{"id": "8c315c6d4bb7f251d6980e060cefe99a", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/gasoline-grill", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Gasoline Grill Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenGasoline GrillDon’t be fooled by the gas pumps—this mini chain serves Copenhagen's greatest burgerFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for the city’s best organic burgers and crinkle-cut fries. It won’t seem revolutionary to most Americans, but wow, is it good. (Those potato rolls!)ORDER THE: butterburger, herb oil for fries, and chocolate mousse for dessert. The original location near Gothersgade is cooler, but the Indre By location doesn’t sell out as quickly.THE VIBE IS: truly a gas station with a bright-green neon sign and actual pumps. There is some outdoor seating.PRACTICAL STUFF: Open every day, 11 a.m. until sold out. Take advantage of your jet lag and go as early as you can: They usually sell out by 5 p.m. Check its Instagram page beforehand to make sure they’re still stocked.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVESlurp Ramen JointObsessively, meticulously made ramen that’s got people lining up in Indre ByApollo Bar & KantineLook at contemporary art, eat some stellar bread at this Indre By hot spotDen VandretteGet your L’Anglore fix at this sunny Indre By wine barExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}