{"id": "8c3b8ea350b81b0d15124f1e0ecd1a21", "url": "https://www.bonappetit.com/story/zoey-gong-traditional-chinese-medicine", "year": 2021.0, "month": 2.0, "day": 1.0, "content": "Zoey Gong Wants to Bring Joy and Connection Back to Our Diets With Traditional Chinese Medicine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleZoey Gong Wants to Bring Joy and Connection Back to Our DietsWith her Traditional Chinese Medicine company Five Seasons TMC, she’s redefining healthy eating and showcasing the beauty of China.By Zoe YangFebruary 2, 2021FacebookTwitterEmailZoey GongFacebookTwitterEmailZoey Gong is a chef and founder of Five Seasons TCM, an online platform for nutrition content and products based around Traditional Chinese Medicine (TCM). Zoey and Five Seasons embody some very old concepts in very new packages: On any given day, Zoey may be shooting a mochi-stuffed jujube recipe for the site, writing an encyclopedic entry on the uses of jujube dates in TCM cooking, collaborating with other creators to produce elegant TCM home goods, or creating monochromatic, textured paintings using the dried jujube itself—also for sale. It might seem frenetic, but she has big plans: Over the most delicate ginseng tea (“you have to use the wispy ends of very young American ginseng”), we sat down to discuss her desires to upend the herbal import market, redefine healthy eating, and change the way outsiders think about China.So Zoey, how did you get into TCM cooking?I moved to the U.S. when I was 16 to attend high school, and all of a sudden I had so many health concerns, to the point that I had to change my diet drastically to just function normally again. Changing food changed my life, and I needed to figure out why food could do that.In college at NYU, I studied nutrition and public health and did all the Western clinical stuff, and during my internship I worked for chefs cooking healthy California-style cuisine. But after two years, I was super bored. It felt like the more I studied, the more restrictive things started to get—you have to keep to this calorie count, your BMI has to be this—it just felt unnatural to me.As a Chinese person, my immediate instinct was to look back to my own culture. I started buying recipe books because I’m more into cooking than straight-up medicine. It was just fantastic—how they wrote these recipes was so poetic. Yes, there’s TCM vocabulary in the recipes, but it’s really a whole philosophy of eating for happiness.I took your body constitution quiz and your TCM Food Therapy 101 class. Everything you do strikes me as both really accessible yet not watered down. I’d been looking for this information for a long time because, as you say, nutrition and wellness in America feels so rules-based rather than coming from a place of enjoyment.Absolutely, and there are so many misconceptions—this product can claim this, that doctor can claim that, and you can follow along, but you don’t actually learn what things are doing in your body.For the three or four years I was studying public health, I was frustrated. So many initiatives are being implemented, yet we don’t see change. There was one study—they put all these fresh produce stores in the Bronx, but after five years they did not find an improvement in diet. That’s because people don’t have that foundation of education!It sounds like the way you think about access is different. When we talk about food access or health care access, it tends to mean access to a specific thing, such as organic broccoli, or a therapist who takes your insurance. You’re talking about access to knowledge.Absolutely.One of the things that’s persistent across many populations in America is a lack of connection to homeland and lack of knowledge about ancestral practices. You helped re-create that connection for me as a diaspora Chinese person. So, to your point about someone walking into a grocery store and knowing how to use the fresh produce, I think my dream is that we’re also going to change what that store sells someday! I mean...what’s after the organic broccoli?Absolutely. China has so much to offer—I didn’t even fully appreciate that as a Chinese person until I started studying, and now the more I study, the more I’m just fascinated. Like, 80 percent of trendy superfoods have roots in Chinese culture.China invented everything!Kombucha: Everybody drinks it, and it was invented in China! I get goose bumps when I think about the potential of wellness culture in China. China is not very good at letting other people know what we have, which is such a shame to me.TCM here is honestly very whitewashed. TCM is actually very creative—it’s an art or philosophy, but that’s hard to convey, because the entire logic behind it is built upon the Chinese language, and you know how intricate the language is. So I’ve just been trying to be the translator.And not just language, but an entire worldview…Oh, absolutely. You know the Chinese nutritional concept of heating and cooling? For a Chinese person, it’s in our language, we automatically understand it. But I realized a lot of Americans have no idea what this means—“What do you mean I’m heated?”When did you make the transition from learning for yourself to coming up with a business concept for sharing your knowledge with everybody else?About two years ago, when I started hosting dinners in my apartment. The first dinner was for my friends, and the second meal I advertised on Instagram, so that was the first time I got paid. From the dinners, and continuing to post content, brands started approaching me for consulting and promotions, and it got bigger.It sounds very organic, as if you didn’t set out to capital-B “Build a Brand.”I probably should have been more intentional about building a brand, but that’s just not me—growing organically feels better. And since I’m passionate about education, my company, Five Seasons TCM, continues to offer a lot of free resources. My goals are simple: to make people feel more joy around food, to make them feel more knowledgeable around healthy eating, and to show the beauty of China.Ever since you started posting the seasonal points on your Instagram, I’ve paid more attention to the outside world and to my body. I think living in America, I had lost those instincts. Following your seasonal eating guide has made me realize how much better I feel going into this winter, but also how much of that philosophy my family followed without even thinking about it. It turns out that Chinese cuisine is already built around the seasonal points!Exactly! Especially holiday foods, which are always seasonal. And that’s true here too. For example, with Thanksgiving, you have pumpkin and warming spices, which are seasonally appropriate. But aside from holidays, eating is so nonseasonal here. Many of my consulting clients ate the same thing every day—they want three vegetables they can eat all year. Dieting takes people’s attention away from the natural world and puts the focus on food groups.Actually, a lot of my followers are Chinese Americans. As you said, they tell me they know their roots a little better through me.You must also get a lot of thirstiness from the mainstream wellness space. I feel like a lot of companies see someone doing something interesting and authentic, and they try to turn it into a trend.It can be very superficial enthusiasm, like “OMG!!!” but without really trying to understand or learn these ingredients, this philosophy, and it shows when some of the collaboration requests I get are so off base from what I believe in. I also personally hate start-up culture—pitch decks, seed rounds—it drives me crazy. It’s so much more about the numbers and the fundraising than actually what you’re doing.Have you had to do any of that?No, I haven’t, because I’ve resisted. But at some point, in order to scale, I may have to raise funds. We’re about to launch our first series of herbal products, which are tonic bags—herbs packaged in pyramid tea bags that you can use in any water-based cooking method. The next step is sourcing organic herbs so we can also be the brand selling the highest-quality culinary herbs direct-to-consumer. The hardest part right now is meeting the minimum order quantities, so that’s something I have to figure out how to do. And that’ll be the part I won’t enjoy, because then the brand would probably become very white if we take outside investment. An angel Chinese investor who’s passionate about TCM would be ideal, but then they’d also have to understand the vision behind our brand aesthetics. I’ve talked to Chinese people who do herbal business here, and they don’t really get what I’m doing. In their experience, wholesale makes money, so they don’t understand why I need to make things beautiful. They don’t get that not only am I trying to source organic herbs, but I’m also trying to tell their stories.You’re kind of updating the industry without trying to “refine” it in a whitewashed way.Exactly.Explore Bon AppétitHealthyishSelf CareChineseInterviewsRead MorecultureThis Hyper-Seasonal Eating Strategy Helps Prevent My Winter ColdsBy Megan ZhangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-02", "author": ["Condé Nast", "Zoe Yang"]}