{"id": "8c40440f3b34cf7a6d693e76b82e7076", "url": "https://www.bonappetit.com/story/la-graciosa-barcelona-wine-bar", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "The Barcelona Wine Store Where Wine Nerds Just Want to Share the Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Wine Store in Barcelona Where Wine Nerds Just Want to Share the LoveAnd it has a dreamy secret backyard.By Alex BeggsJune 24, 2019FacebookTwitterEmailDario Flores d' Arcais, Studio NormaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I walked into La Graciosa, a bare bones, one-year-old wine bar in Barcelona, I was already thirsty from all the day-drinking I’d been doing (I was on VACATION, okay?). One of the owners, who’d been unpacking a limitless supply of boxes (boxes EVERYWHERE), was happy to oblige, and pointed us a bottle of Spanish natural wine to try. “But what can we have by the glass?” I asked. He looked confused. You can have whatever you want!He opened me a bottle of light and bubbly red called Eroica Ancestral with a bandaid-sized, bubble-lettered label I could have printed off at home circa 2004. But it tasted like 2019. It was effervescent and barely acidic (a good friend to anchovies), made by a winemaker and somm in the city, Nuria Renom. (A digression: We ended up meeting Nuria the next night at Bar Brutal where she works, another natural wine spot with a full menu. What a delight! The Barcelona wine world is small.) My colleague Emily Schultz went a few months after me and had a funky, skin contact wine. I’m not sure how long this everything-by-the-glass business model will last, but even if it doesn’t...La Graciosa is a friendly, wine-nerdy place. There’s a bookshelf of cool wines to drink or buy, a bar lit by hanging green globe lamps, a few tables and big wine barrels-as-tables, and a cozy, secret-feeling backyard. They have crispy breads and the aforementioned anchovies. It’s in a cool neighborhood too, Gràcia, and steps away from La Vermuteria del Tano, a tiny treasure of a corner bar with fragrant, delicious house vermouth from a big barrel I wanted to wrap in bubble wrap and take home. But my suitcase was already full.I had purchased a bottle of La Graciosa’s Eroica Ancestral, which I opened a few weeks ago back in New York. It was a wonderful flashback no Facebook memory could compete with, like receiving a delayed postcard from wine-drunk vacation me. Oh hello, old friend. Until we meet again in Barcelona.Go there: La GraciosaExplore Bon AppétitSpainWine Barsnatural wineHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Alex Beggs"]}