{"id": "8c431e38da2372c400be50e08e255625", "url": "https://www.bonappetit.com/recipe/hibiscus-tequila-sparkler", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Sparkling Hibiscus–Tequila Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHibiscus–Tequila SparklerBy Cari HahAugust 19, 20214.8(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintTart-sweet and shockingly pink hibiscus syrup is the star of this bright and refreshing cocktail. This recipe makes enough syrup for 16 drinks (great for a crowd), but if you have any leftover, there are endless creative ways to use it up. Drizzle over ice cream, use as a sweetener for lemonade or iced tea, mix into gin- or tequila-based cocktails, or even whisk into salad dressings.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Shaker$20 At AmazonCocktail Jigger$6 At AmazonCitrus Juicer$7 At AmazonHeatproof Measuring Cup$18 At AmazonMesh Sieve$13 At AmazonIngredientsMakes 1¼cup dried hibiscus flowers1cup sugar1oz. tequila blanco½oz. fresh lime juice3mint leaves, plus sprig for serving2oz. dry sparkling rosé (such as Moët & Chandon Rosé Impérial)Raspberry sorbet (for serving, optional)PreparationStep 1Combine hibiscus and 1 cup boiling water in a heatproof measuring glass or small bowl; let sit 10 minutes. Strain tea through a fine-mesh sieve into another measuring glass or small bowl; discard hibiscus. Add sugar to tea and stir to dissolve. Let hibiscus syrup cool.Step 2To make 1 cocktail, combine tequila, lime juice, ½ oz. hibiscus syrup, and 3 mint leaves in a cocktail shaker. Fill shaker with ice, cover, and shake until outside of shaker is frosty, about 20 seconds. Strain into a Champagne flute and gradually add rosé, stopping ½\" from top of glass. Top cocktail with a small scoop of raspberry sorbet if using and garnish with mint sprig.Do ahead: Hibiscus syrup can be made 3 weeks ahead. Transfer to an airtight container; cover and chill.How would you rate Hibiscus–Tequila Sparkler?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious! But I decided not to open a full bottle of sparkling wine for just one drink and subbed in 2oz. citrus kombucha. Works great and tastes fine. FlovarinaBoulder, CO, USA9/3/2021Explore Bon AppétitCocktailDrinks AllTequilaAlcohol & Other DrinksSummerHibiscusHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-19", "author": ["Condé Nast", "Cari Hah"]}