{"id": "8c4353e432c716112203df0685474afc", "url": "https://www.bonappetit.com/story/met-gala-chefs-2021", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "The Met Gala 2021 Is Going Plant-Based—Here’s Why | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 2021 Met Gala Is Going Plant-Based—Here’s Why Yes, people eat at the Met Gala. And this year, for the first time ever, the chef-curated menu will be 100% plant-based.By Karen YuanAugust 3, 2021FacebookTwitterEmailPhoto by Corey TenoldFacebookTwitterEmailMarcus Samuelsson had a challenge: For the Met Gala, Anna Wintour had asked him and his team to bring in talented chefs who also had unique stories to tell. Go for people who have an untold story, he remembered her saying.It was a big task. This year, for the first time ever, the Met Gala will feature a menu with recipes by specially selected chefs. And that’s not all: The menu will be entirely plant-based.The move marks a major change for the September event, which has only offered catered meals in the past. The ten New York-based chefs were chosen by chef and restaurateur (and Bon Appétit brand adviser) Samuelsson as part of a goal to celebrate the city flourishing again after a very difficult year. “We want to tell the world that we’re back—New York City as a place to gather and celebrate is back,” he told Bon Appétit in an exclusive interview. “We’re telling both New Yorkers and outsiders that New York is open for business.”Fariyal Abdullahi, Nasim Alikhani, Emma Bengtsson, Lazarus Lynch, Junghyun Park, Erik Ramirez, Thomas Raquel, Sophia Roe, Simone Tong, and Fabian von Hauske will each contribute a recipe that reflects their unique take on American cuisine. The lineup includes restaurant owners, Bon Appétit Hot 10 alumni, food activists, cookbook authors, and TV personalities, expanding the definition of what it means to be a New York—and an American—chef. “They represent what the food scene in New York today looks like,” says Samuelsson,”what the next generation of food looks like, tastes like, where it lives.”The theme of this year's Met Gala is In America: A Lexicon of Fashion, the first of a two-part exhibit in fall and spring exploring modern American styles as well as associations with issues of equity, diversity, and inclusion. And the decision to feature an entirely plant-based menu was, well, based on modern American appetites. Fine dining restaurants across the country are exploring plant-based menus, most notably NYC’s Eleven Madison Park, reflecting a shift in visions within the industry and palates among diners. “We thought it was important to really talk about what’s present, what’s happening—how food is changing in America,” Samuelsson says. “We want to be the future of American food, of plant-based food. That conversation is happening now.”In the weeks leading up to the event, Vogue and Instagram are sharing Reels of the chefs creating summer-y recipes, such as a watermelon salad, roasted potato skins, and a tuna-less Niçoise salad. They’ll be different from what will be served at the Met Gala, but plant-based as well.Instagram contentThis content can also be viewed on the site it originates from.For Samuelsson, bringing the plant-based conversation to a fashion event felt natural. “Both industries respect craftsmanship,” he explains. “Being a chef is all about working a lot with style, with people. It’s the same thing with fashion. It’s a different medium, but you’re really expressing a point of view, a sense of place.” As far as eating flora, much of the fashion industry utilizes natural materials as well, he points out. Both industries are exploring their relationship with nature and the environment. And with each other: Take Gucci’s partnerships with Massimo Bottura in the U.S., Europe, and Asia, or Louis Vuitton’s new restaurant Sugalabo V in its Osaka store.Samuelsson hopes that the Met Gala’s food, as much as the outfits, will spark a conversation. He feels ambitious about the future of food at the event. “I’m excited about hopefully starting a tradition where, next spring, the audience will come for the food as well.”Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-02", "author": ["Condé Nast", "Karen Yuan"]}