{"id": "8c52f8dd4b19c3439b99a026565a19b8", "url": "https://www.bonappetit.com/recipe/creamy-one-pot-pasta-with-peas-and-mint", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Creamy One-Pot Pasta with Peas and Mint Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy One-Pot Pasta with Peas and MintBy Claire SaffitzJune 6, 20184.7(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintThis lightning-fast pasta with creamy peas, mint, and Parm is pantry dinner at its best, provided you keep heavy cream in your fridge at all times. And if you don't, you absolutely should: It lasts forever, and having some on hand means a creamy soup, scones, or a dollop or whipped cream are always in arm's reach.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonSpider$6 At AmazonLarge Bowl$18 At AmazonWooden Spoon$6 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMicroplane$16 At AmazonPotato Masher$10.19 At AmazonIngredients4 large or 6 medium servingsKosher salt110-oz. bag frozen peas (no need to thaw)1lb. medium shell pasta½cup mint leaves, divided1garlic clove1lemon½cup heavy cream2Tbsp. extra-virgin olive oil, plus more for drizzling1cup store-bought grated ParmesanFreshly ground black pepperPreparationStep 1Bring a large pot filled with water to a boil over high heat. When water starts to steam, add a palmful of salt.Step 2When water has reached a rolling boil, add 10 oz. frozen peas. Cook until peas start to float and are tender, about 3 minutes. Using a spider or slotted spoon, transfer peas to a large bowl, allowing water to drain back into pot.Step 3Bring water back to a boil and add 1 lb. pasta shells, stirring once or twice with a wooden spoon to prevent sticking. Cook according to package instructions until pasta is tender but still al dente.Step 4While pasta is cooking, assemble your pea mixture. Start by setting aside about ¼ cup mint leaves for serving; finely chop remaining ¼ cup mint. Add chopped mint to bowl with peas.Step 5Using a microplane, finely grate 1 garlic clove and zest of 1 lemon into bowl with pea mixture. Reserve zested lemon for serving.Step 6Add ½ cup cream, 2 Tbsp. oil, and ½ cup cheese to bowl with pea mixture and mash with a potato masher to break up peas. You want a mix of whole peas and smooth, mushy parts.Step 7When pasta is finished cooking, transfer to bowl with peas with spider (it’s okay if some pasta cooking liquid piggybacks into bowl—in fact, it’s a good thing!).Step 8Season mixture generously with pepper and more salt, if needed, and toss with a wooden spoon vigorously so hot pasta melts cheese and thickens to a creamy sauce.Step 9Divide pasta among bowls. Top with remaining cheese and reserved mint. Drizzle with oil.Step 10Cut reserved lemon into wedges and serve alongside for squeezing over.How would you rate Creamy One-Pot Pasta with Peas and Mint?Leave a ReviewTell us what you thinkReviews (14)Back to TopTrianglePerfect quick fixAdelineSydney 7/22/2021This  won't knock your socks off.  It is, however,  easy & yummy. If you want a quick & tasty meal that's different than opening a bottle of pasta sauce but almost as speedy, this is a good one. I assembled the sauce while the pasta cooked & dirtying only a pot & a bowl is a nice touch. Sure, you can grate your own parm, throw in some guiancanalle, shell fresh peas, or whatever but this makes a pretty great 10 minute meal as written. I assembled this from odds & ends in the fridge/freezer/pantry, which is always a win in my book. AnonymousSeattle, WA7/20/2021ONE star, not 5.  The recipe calls for frozen peas, which are then mashed, and pre-grated cheese which is flavorless and dried out.  Ironically, the recipe calls for fresh garlic instead of powdered and fresh lemon instead of bottled. AnonymousManhattan4/22/2021This recipe is amazing!!! I made it with Trader Joe’s ricotta and lemon zest ravioli. I was out of Parmesan, so I used goat cheese. I followed a suggestion from another review and added cumin seed, which was amazing. If I made this again, I would sauté both the garlic and cumin seed quickly before adding to the sauce. With ravioli, you need to add pasta water to the sauce, and the spoon it on top of the ravioli. JennyAtlanta, GA2/27/2021I love how zingy and fresh this tastes. To make it vegan, I use coconut milk (the thickened parts) and vegan parmesan (recipe from It Doesn't Taste Like Chicken). To bulk it up, I combine it with Fry's Schnitzels. I like to add a little extra lemon juice at the end but my partner prefers it without. The whole mint leaves makes for a nice presentation but I usually cut it up altogether.rookieAustralia6/21/2020This was delicious! So easy and I love the ingenuity of mixing it all in one bowl. Will definitely make again. AnonymousBerkeley, CA4/30/2020Very tasty and visually very appealing (even to my husband - the peas and mint hater). Delicious and quick weeknight recipe. Try it!heather eatsMontreal2/29/2020Liked the concept, so I made a vegan/gf version of this with chickpea pasta, coconut-based cream for the half and half, and nutritional yeast for the parm. Mine had a higher pea-to-pasta ratio, which made it a little bit sweet. And there was a layer of something missing... probably would've been solved with real parm, but next time I might sizzle some cumin seeds in olive oil for finishing or add a touch of red miso. But it was easy, refreshing, and -- with the subs -- full of protein. I like that it can be cold or warm -- helpful for packing work lunches! AnonymousSomerville, MA9/22/2019Super easy and delicious! Will definitely become a regular in the dinner rotation. I was skeptical because I don’t often use mint in savory recipes, but the mint flavor was not overpowering at all and just added a great freshness to the dish. Two thumbs up!AnonymousVermont8/21/2019I love this recipe so much. I go really light on the mint, a little heavier with the lemon, but that's just a personal choice after making it so many ttimes. This is a solid weeknight dinner that my boyfriend asks for regularly. Portland, Oregon3/5/2019This was honestly SO GOOD and SO EASY! I don’t cook often at all (as in less than once a month), my boyfriend always cooks. So I decided to make this and he said it’s the best thing I’ve ever made! Said he felt like we were in the Italian countryside in summer haha. Basically it’s delicious, and super easy. I also added prosciutto to the pasta and it was a perfect match! Will definitely be making this again. AnonymousAtlanta7/20/2018I've made this twice. The second time I subbed in fat-free half and half and it turned out fine. This dish has the advantage of being fast, easy, and tasty.AnonymousIowa7/8/2018This was a nice weeknight dish - nothing mindblowing but it was quick and easy and tasted good. The lemon is a nice bright touch at the end so don't forget to serve the pasta with those wedges (or just squeeze the lemon in before serving). I realize the store bought grated parmesan is probably a time saver, but it's really not that hard to grate your own and the texture might be better once it's melted in. Also, if you don't have a spider or slotted spoon like me, you can just balance a mesh sieve on the pot's lip and dump the peas in there for easy removal after they're cooked (just make sure the water is high enough to submerge the peas).soapnanaChicago6/15/2018This did get good reviews from the green-pea-phobes in my household so it was magic in that regard; the pea-mint-lemon-cream-garlic matrix upon which this hinges is lovely.  I did not enjoy the texture of the gluey bits of parmesan but nobody else cared.  Can't tell how much mint to use from the recipe, which calls for 1/2 cup then says to set aside 1/2 cup and chop the rest, so I just used what i had on hand, which honestly is what I (and probably everyone else) would do anyway.Anonymoussouth of the south6/12/2018Explore Bon AppétitPastaPeaVegetableMintHerbs & SpicesPasta ShellsPasta & NoodlesSpringSummerEasyQuickWeeknight MealsOne-Pot MealsMainVegetarianNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Claire Saffitz"]}