{"id": "8c66ebcd7ca876ae4a61c0ab6bfc0fc5", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/cicatriz-cafe", "year": 2020.0, "month": 6.0, "day": 3.0, "content": "Cicatriz Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityCicatrizBig salads (and a killer fried chicken sandwich) in a city where such things aren’t easy to findFacebookPinterestTwitterEmailPhoto by Jake LindemanGO HERE: for a vegetable-forward menu from expat sister-brother team Scarlett (cicatriz means ”scar”) and Jake Lindeman. Scarlett, a food writer, has immersed herself in Mexican cuisine during her three years in Mexico City, but here she uses local ingredients in dishes she and Jake miss from the States and stints at Andrew Tarlow’s Brooklyn restaurants: avocado toast, roasted carrots, and a massive kale-vegetable salad. The latter is especially welcome in Mexico City, where greens have a tendency to be cooked—or overdressed if they’re not.ORDER THE: “big salad” (tahini-dressed kale, beets, sprouts, egg, and pepitas); spicy roast carrots; and abuela-worthy albondigas (meatballs). At night, get the classic fried chicken sandwich.THE VIBE IS: open and breezy, with soaring ceilings and an upper level that gives a solid view of the artistic, professional, young crowd. The bar turns from coffee shop during the day into humming bar scene at night.PRACTICAL STUFF: Open daily from 9 a.m. to 11 p.m.; closed Tuesdays. Drinks from 5 p.m. on, with a very limited menu after 6 p.m.Photo by Jake LindemanPhoto by Jake LindemanPhoto by Jake LindemanWE ALSO LOVENicosMeet the chef who turned his parents’ restaurant into a pioneer of Mexican “Slow Food”Tostadas CoyoacánNot just Instagram-worthy but incredibly tasty, tooEl TurixTextbook *cochinita pibil* in a scrappy taquería in the heart of Mexico City’s Beverly HillsExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2020-06-15", "author": ["Bon Appétit"]}