{"id": "8c75b2a069e075a2f4e002e954c9bf3c", "url": "https://www.bonappetit.com/story/office-of-brothers-restaurant-design", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Meet Office of Brothers, the Designers Behind All the Coolest Restaurant Stuff | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMeet the Designers Behind All the Coolest Restaurant StuffI will not be satisfied until I’ve collected every tote bag, t-shirt, koozie, and matchbook Office of Brothers has ever made.By Alex DelanyAugust 16, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI judge the quality of a restaurant’s food based on a million different things. But a restaurant’s branding? I judge that based on whether or not I buy a tote bag. And let it be known: I walked out of Portland, Maine’s Rose Foods carrying a tote adorned with a fish drinking a cup of coffee.But it wasn’t just the tote that caught my eye at Rose Foods (one of our Top 50 nominees!). It was everything. The golden, hand-painted type on the mirrors, advertising “Nova Lox” and “Pastrami on Rye.” The illustration of a weird bagel man on the printed menus. The logo’s subtle nod to the retro Jewish deli, through its angular font. The baby blue type, reaching across the backs of the employees t-shirts, reading, “What a time to be alive.” I was immediately smiling, muttering, “This is so rad,” to myself and anyone else in earshot.The covetable tote from Rose Foods\nEmma FishmanI have the folks at Office of Brothers, a design agency based in Atlanta, to thank. Founded by Alvin Diec and Travis Ekmark, Office of Brothers works to brand restaurants from the likes of Asheville’s Buxton Hall Barbecue to Atlanta’s Golden Eagle to the aforementioned Rose Foods. The design group creates restaurant identities with quirky illustrations, scripted typefaces, and a casual elegance that, yes, look cool—but also turns the branding of a restaurant or bar into a human element, one that speaks just as loudly as the fare.One might say that Office of Brothers possesses a retro sensibility. But they would not. “For us, that’s not a word that ever comes into our heads,” says Ekmark. “In fact, the second we sense the r-word trickling into our brains, we will put our heads under the tires of a bus. We suppose ‘retro’ equals ‘trend,’ but we think of ourselves as having a loyalty towards history.”The menus, t-shirts, matchbooks, and magnets at Rose Foods make that loyalty clear. The design isn’t old. And it isn’t new. It pulls from everything, past and present. “Every day we discover more and more beautiful things,” says Diec. “It’s enough to drive one mad.”It’s that sponge-like ability to absorb inspiration that makes Office of Brothers’ work so relatable. When I stepped into Buxton Hall last year, I was excited to eat the whole hog barbecue. But the array of t-shirts, strategically placed near the front door, made me forget about pulled pork and fried chicken sandwiches long enough to get lost in a world somewhere between reality and a trippy cartoon from the ’70s. Every illustration and type specimen was not just fun, but so incredibly appropriate. They were pulling not from one source of inspiration, but from every block that makes a barbecue joint what it is. It was perfect design.“The author of Ecclesiastes wrote, ‘There is no new thing under the sun,’” says Diec. “When you look into the history of food advertising and commercial art, you will find a great spectrum of style, from dry and dull to wacky beyond all reason. What kind of small-minded person would only wish to stay forever within a narrow envelope when the world is rolling at your feet?”And it’s that kind of inspired, slightly wacky emotional scope that will make you just as excited to to throw Rose Food’s branded tote over your shoulder as it does to eat their smoked salmon. For the record, there are now four other people in the Bon Appétit office with that very same tote bag. I was the first one, which means people are officially biting my style. I’d be mad, if I didn’t get so happy every time I saw that fish drinking coffee. How does he hold the cup when he has flippers? Wouldn’t it just fall right down, shattering on the floor? Does he know how silly this situation is? That he’s going to burn his scales?Questions only Office of Brothers could ask.Read more about the 25 restaurant trends we saw in 2018Related: Portland, Maine, Is the 2018 Restaurant City of the YearExplore Bon AppétitThe Hot 10Hot 10 2018Read MorecultureI Buy Souvenirs for My Dining Table and So Should YouBy Erika OwenrestaurantsThe Well-Crafted Kitchen: Inside the Whimsical, Dreamy World of FrenchetteBy Elyse Inamineculture10 Cult Nordic Design Brands That Will Transform Your KitchenBy Julia BlackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Alex Delany"]}