{"id": "8c76009c1f16b5695004b733f78b27c7", "url": "https://www.bonappetit.com/story/la-eats-and-meal-prep-fails", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "LA Eats and Meal Prep Fails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLA Eats and Meal Prep FailsA meal prep attempt and other thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroOctober 18, 2018FacebookTwitterEmailPhoto by Peden + MunkFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.I'm desperate to cook.I was in L.A. last week, enjoying the sunshine, the beach, and the major healthyish vibes. I ate and drank a lot of delicious things, from MTN's shiitake ramen to Simone's \"Sage Against the Machine\" cocktail (made with kefir cider, what?!), from Botanica's stuffed honeynut squash to Honey Hi's cassava-flour cookies. Did I mention Little West's almond-cashew milk? Or the fresh figs and berries I collected from the Venice farmers' market? I could go on but I won't.On Monday morning, I packed a lunch from Erewhon's epic salad bar (there were kelp noodles and kimchi) and got on a plane to go home. From the airport, I went straight to Saraghina in Brooklyn, where we ordered just about every antipasti on the menu and a couple pizzas to share.It was one of the best runs of eating out I've had in a while. But, by the time Tuesday rolled around, I was aching for a home-cooked meal. I wanted something warm to combat the sudden chill in the air, something I could eat all week for the sake of my wallet and my sanity. I wanted curry. But which recipe? The curried split pea soup that taught me to like soup? The shrimp curry I can make with my eyes closed? Nate Appleman's classy lentil and egg number?I decided on a Basically recipe I'd never made before: Vegan Coconut Lentil Soup. I shopped, I chopped, I sautéed, and I simmered it all in my big, green Dutch oven. Then I toasted up some sourdough, filled a bowl with soup, and stirred a dollop of labneh in. Spicy and creamy, this soup had just enough spinach to make it count as a vegetable. It was as good as anything I'd eaten last week, plus it doubled as meal prep.But then I shared the soup with my roommate, and I gave a pint to a friend whose oven was on the fritz. Then my boyfriend came home late and ate a bowl, and before the end of the night, my lunch for the week had disappeared. I truly didn't mind—sharing a big pot of homemade food is one of life's great pleasures. And, come lunchtime, there's always the Pret downstairs.Sincerely,Amanda ShapiroHealthyish EditorMake some curry tonight:Lentil and Egg StewPoaching eggs right in the stew is so obviously genius, we are still trying to figure out why we didn’t think of this recipe sooner.View RecipeExplore Bon AppétitHealthyish NewsletterHealthyRead MoreLifestyleOne of the Toughest Stories We've Ever RunBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-18", "author": ["Condé Nast", "Amanda Shapiro"]}