{"id": "8c7e90a605b4d76005758cc3974b6a9b", "url": "https://www.bonappetit.com/story/fromage-fort", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "Fromage Fort Is a Cheesy Spread Made From Wine, Cheese, and Butter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Have More Cheese Than I Know What to Do With, I Make Fromage FortCheese, butter, wine—name a more iconic trio.By Em McGarrigleSeptember 11, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My parents are notorious cheese hoarders. There is never a time when I’m at their house and their cheese drawer isn’t overflowing with Havarti for my mom and a sharp Irish or Australian cheddar for my dad, plus whatever called their names at the grocery store that week.Unfortunately I’ve inherited this trait. I can’t resist combing through any “just-enough” cheese bin and taking one or two home with me. But when a regular cheese-and-cracker combo isn’t hitting the spot anymore, or I have a leftover hunk from a recipe and I don’t know what to do with the rest, fromage fort is my savior. Quite literally meaning “strong cheese” in French, it is the divine combination of cheese, butter, and wine. Blended up with the allium or herbs of your choice, it becomes an impossibly addictive and infinitely adaptable spread, and though it feels posh, the only thing you need to make it is a food processor.It requires about 8 oz. cheese, room temperature (you can always do more, but depending on the size of your food processor, you may have a hard time doing less). Part of the fun is figuring out which cheeses to play against each other. In general bluer, funkier, or saltier cheeses will have a more dominating flavor than milder cheeses, so use less of them if you want the flavors of any other cheeses to come through. Try balancing 1 or 2 oz. of your blue or funky cheese with 3 or 4 oz. of something mild and buttery, like Muenster or Gouda, and round out the rest with familiar fridge standbys like goat cheese, Parmesan, or cheddar. Grate any harder cheeses and cube or crumble softer cheeses. If you want to add garlic—and you do—give a clove a rough chop.Toss the cheese in the food processor with a pat of room-temperature butter. Add a splash of dry white wine, like Sauvignon Blanc or Chardonnay, and blend for a few minutes, scraping down the sides of the food processor bowl after a minute or two. You’re looking for a texture that mimics whipped cream cheese—it should be smooth enough to spread on a cracker but a chip dipped in it probably won’t stand up. The mixture doesn’t have to be perfectly smooth, but it shouldn’t appear to be seeping liquid. If it looks too grainy or isn’t blending into a homogeneous texture, add a touch more wine or butter or both. If it feels too loose, add more cheese. If you’re using more soft cheese, you likely won’t need to use as much butter or wine. Salt or season to taste, although with the amount of cheese, salt probably won’t be necessary. Best enjoyed at room temperature, it keeps in the fridge about a week.Don’t like white wine or aren’t of legal drinking age? I’ve happily made this with a splash of apple cider vinegar mixed with a little natural apple juice. Red wine? Kombucha? I’m not going to stop you. Have only beer in the fridge? The idea of making this with lots of garlic, sharp cheddar, and a local lager, and then slathering it on a toasted bun for a beer-boiled, grilled bratwurst is going to haunt me until I get the chance to execute it.Want to jazz it up beyond a simple garlic clove? Try swapping out the garlic for chives or some shallot, or adding fresh herbs like thyme or rosemary. Mix in the herbs for the last few pulses of the food processor, though, or you’ll risk tinting your fromage green (it will still taste fine, it just won’t look as appealing). You could also try throwing some roasted garlic into the mixture or drizzling some local honey on top (trust me).Trying to figure out the best ways to enjoy your new cheesy pièce de résistance? Pair it with the sourdough crackers you’ve been meaning to make—it’s a use-up-your-kitchen-scraps match made in heaven. If you’re craving something warm and comforting, spread it on crostini. Or if you’re in need of a crisp and fresh snack, dip in an apple slice or smear it on a cucumber spear to give you tea sandwich vibes. Or hey, you could even just eat it with a spoon—it’s that good.Em McGarrigle is a Chicago-based freelance writer. She thinks almost anything could be made better with a bit of honey.Explore Bon AppétitIt's That SimpleWineCheeseGarlicButterherbBeerRead MorecookingGyeran Bap is What’s For Lunch (or Breakfast or Dinner) When You Can’t Be BotheredBy Joy ChoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-11", "author": ["Condé Nast", "Em Mcgarrigle"]}