{"id": "8c84856208fc12b8e7b1c8ad42212846", "url": "https://www.bonappetit.com/story/georgia-peach-truck", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "I Thought My NYC Summers Would Be Sad and Peachless, Until… | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Thought My NYC Summers Would Be Sad and Peachless, Until…...the Georgia Peach Truck rolled into town.By Hilary CadiganJune 17, 2019FacebookTwitterEmailPhoto Courtesy Georgia Peach TruckFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Summer isn’t summer without peaches, but let’s face it: If you buy one outside Georgia or South Carolina, it’s probably going to suck. Which made moving to New York City from Atlanta last spring—right before the start of my beloved peach season—tough...and mealy, and flavorless. Lucky for me (and for you too, if you too live somewhere sad and peachless), there’s Brandon Smith and the Georgia Peach Truck.Peaches, for Smith, began as a side hustle. The erstwhile bassist for culty ’90s indie band Rock*A*Teens used to make money between shows bagging produce at a suburban Atlanta farmers market. Then he traded band life for an MBA in finance. “I thought I'd end up an analyst working with spreadsheets and portfolios,” says Smith, “but I wound up having a lot more fun slinging peaches.” And so, he started a business doing just that.Now, Smith spends his summers aboard the Georgia Peach Truck, hauling fuzzy globes of juicy goodness from a 120-year-old peach farm in central Georgia all up and down the Eastern Seaboard. The truck stops at farmers markets and garden centers in Florida, South Carolina, North Carolina, Virginia, D.C., Maryland, Pennsylvania, New Jersey, New York, Connecticut, Rhode Island, and Massachusetts, selling its wares by the half-bushel for $45 to $59, depending on sourcing and scarcity. Inventory turns over every two to five days so you know what you’re getting is fresh. I’ll have to wait ‘til July for the truck to reach Brooklyn, but my Google calendar is already marked.Not sure what to do with 70 perfect peaches? Last year, my sister-in-law used hers to throw an entirely peach-based dinner party: peach shrub cocktails, peach salad, ribs smothered in peach barbecue sauce, and peach upside-down cake for dessert. This year, I will attempt to do the same. (Just kidding. I’m gonna go over to her house again.)Buy some: Georgia Peach TruckThe Georgia Peach Truck embarks on its peach voyage from Atlanta on June 20, and rolls through August 5, finishing in New City, New York. For the full schedule of stops, visit georgiapeachtruck.com.Explore Bon AppétitHighly RecommendPeachFood TrucksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-17", "author": ["Condé Nast", "Hilary Cadigan"]}