{"id": "8c8664c9bf1715876a566ce83834d50c", "url": "https://www.bonappetit.com/story/never-fail-italian-salad-recipe", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "This Italian Salad Recipe Makes Me Feel Like an Extra on ‘The Sopranos’ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Italian Salad Recipe Makes Me Feel Like an Extra on ‘The Sopranos’It’s so good, I plan entire dinner parties around it.By Alex BeggsMay 4, 2018FacebookTwitterEmailMarcus NilssonFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Sure: The Sopranos isn’t exactly a timely reference in 2018. But ya know what else isn’t timely? This incredible Italian salad. It’s a classic—old school to the max. And it’s so good that it’s worth planning an elaborate dinner party around. Allow me to explain.First: You make some friends. Then, via text or a 15-message thread email chain, you invite them over for Sunday supper. On Saturday, you make the ragù for eggplant parm. On Sunday, you fry the eggplant, shred mounds of cheese, and bake the gigantic eggplant parm. It takes forever to make, I’m not gonna lie. But have you seen this thing?! Obviously it’s worth it. And everything else on this brilliant menu is so easy it’s laughable, but I say that about everything because I believe life, on the whole, is very funny. Let’s see what you think.The eggplant parm in question.\nAlex LauThe sides: garlic bread and iceberg salad with Italian dressing. That’s right. Nothing but the hits. Garlic bread should be fairly self-explanatory, but if you need a recipe, this one is solid.At the end of the day, it’s that Italian salad that ends up stealing the show. No one sees it coming. It’s iceberg! This thing hasn’t had a break this big since the Titanic. It’s crispy shards of water. And it’s just the thing you need after all that fried, cheesy eggplant. But the dressing is the thing. It doesn’t need to be nearly as good as it is.Mayonnaise, white wine vinegar, dried oregano, sugar (it doesn’t make it sweet, don’t freak out), garlic, salt, and pepper. That’s it. It’s creamy yet tangy, full of red sauce joint Italian flavor. It wishes a celebrity chef would bottle it for profit. That oregano is transporting. It takes you back to Olive Garden, Carrabba’s, that red-lettered place in the strip mall, grandma’s linoleum-floored kitchen—wherever your nostalgia for “house salad” originates. A person I made it for once said that it reminded him of the salad dressing you get at pizza places. I could go on and on, but it’s very good salad dressing and I’ve got things to do.But that’s not all, folks! As if crispy iceberg and the ultimate better-than-bottled dressing wasn’t enough, a casual handful of peperoncini drops in, as well as provolone cheese, mozzarella balls, and thinly sliced red onion. Together, with the garlicky dressing, you have something all salads aspire to be: not terrible.Get the recipe:Iceberg Salad with Italian DressingIf this brings back memories of the “house salad” from that Italian-American restaurant you grew up eating at, then we consider our jobs done.View RecipeExplore Bon AppétitItalian AmericanSalad DressingMayonnaiseBasicallyNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-04", "author": ["Condé Nast", "Alex Beggs"]}