{"id": "8cac841062c16d3a602be3fe2beaa93a", "url": "https://www.bonappetit.com/story/laila-ali-routine", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "Laila Ali on Boxers' Bad Eating Habits and Learning to Fuel Her Body Right | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLaila Ali on Boxers' Bad Eating Habits and Learning to Fuel Her Body RightThe undefeated boxing champ still works out hard—then makes her kids something called “breakfast spaghetti.”By Alex BeggsFebruary 1, 2018FacebookTwitterEmailGallo ImagesFacebookTwitterEmailWhen Laila Ali was training for a fight, food was flavorless fuel. Blah oatmeal, powdered protein shakes, piles of egg whites. She had to make weight—otherwise risk losing her world champion title—and the day of the weigh-in, that meant eating as little as possible and sweating it off. So the moment your body needs the nutrition as much as possible, you can’t give it to it.“It really came down to eating really light,” said Ali, who hung up her boxing gloves in 2007 and this month released her first cookbook, Food for Life. “I ate vegetables, salads, foods that were full of water. And then the day of the fight, sometimes you would get a workout in, go sit in the sauna, but you definitely wouldn't be drinking anything. You would kinda really be dehydrated. So, that’s not healthy, right?”Growing up, Ali, daughter of Muhammad Ali, saw her father eat whatever he wanted before a match. “His age group was a really old school, so it was a lot of steak and potatoes and hearty foods, especially with him being a heavyweight. He didn't have to make weight.” But he prized home-cooked meals, especially the soul food cooked by their family’s personal chef, Edith. “He loved sitting down to his plate and he took his time eating,\" Ali recalled. \"He didn’t rush.”Every meal Edith made was a spread, like Thanksgiving on a weeknight. “Edith could throw down,” Ali said, laughing. She made fall-off-the-bone baked chicken, buttery sweet monkey bread, creamed corn, mac and cheese—all of it full of flavor and fresh herbs. “If it was caramelized, it was caramelized to perfection. If it was baked, it was baked to perfection,” said Ali. It’s clear that a lot of Ali’s food memories go back to Edith, and this kind of comforting (but also healthy) family food is at the core of her cookbook.After her final fight in 2007, what Ali learned about nutrition stayed with her. “I was used to eating on a schedule, and used to thinking about how this food is gonna affect my body and fuel my body.” She got into cooking, and even appeared on two episodes of Chopped. Now she eats when she’s hungry. Before her two kids (ages 6 and 9) wake up, she has a cup of strong coffee with creamer and takes a quiet moment. “What I do in the morning is really just have gratitude and think about how thankful I am.” Then she’ll make a list of her goals for the day and prepare breakfast for her kids, which might be eggs and turkey bacon, oatmeal, or something she invented called “breakfast spaghetti” for her very particular 6 year-old (it’s basically carbonara.)Ali herself doesn’t eat until around 11 a.m., usually a big salad with last night’s leftovers, after a workout. “That drive is always in me to get that hard workout in,” she said. “I have had girlfriends say, 'Hey, you wanna go walking?’ And I’m just not interested. I’m like 'Uh, no, I’m good.’ But they keep inviting me!”Instead, she prefers a HIIT workout on her Peloton bike. “As a boxer, working out was my job. I'd run in the morning. I would go to the gym in the afternoon to box, which is, like, grueling. Then I would weight train three or four times a week,” she said. “Now, I don't have that lifestyle. When I work out, I’ll do high intensity workouts but for shorter periods of time, and I’m always switching it up.”But some habits are hard to break, which is why she keeps a heavy bag in her home gym—a workout her body knows by heart. Like her father before her, she “definitely” isn’t encouraging her daughter to become a boxer, or her son to become a professional football player (Ali is married to former NFL player Curtis Conway). “They’re just dangerous sports,” she said, “They’re high stress on the body and I just wouldn’t want that for them. But obviously I know they’re going to do what their hearts desire, and I’m going to support them.”Still, she’s glad more women are finding their way into boxing gyms and classes for casual fitness. “Boxing is a full body workout and it gives you sense of empowerment, that you can protect yourself,” she added. “And I think that people need to feel that, especially women, more now than ever.”Buy Food for Life: Delicious & Healthy Comfort Food from My Table to Yours on Amazon, $20.97.Explore Bon AppétitCookbooksHealthyishprofileRead MorecultureCynthia Erivo On Being a Workout Warrior And Holding Hollywood AccountableBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Alex Beggs"]}