{"id": "8cd390280cd45be44a8a897103ab82f0", "url": "https://www.bonappetit.com/story/friendsgiving-essay", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Friendsgiving Isn't a Trend for Me. It's a Lifeline. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Friendsgiving Isn't a Trend. It's a Lifeline.Believe me when I say I tried for years to go home. Believe me, I wanted to be like everybody else.By Sandy AllenNovember 16, 2018FacebookTwitterEmailIllustration by Laura BreilingFacebookTwitterEmailWhen I was little, I had an aunt named Peggy. She had dark hair and hunched shoulders and was warm and wonderful. She ran a catering business, and her house smelled always like cooking. Her Thanksgiving was the best day of the year. She’d set a big long table down the whole living room. It’d be loud and fun, and all the food would be fantastic. I remember her mostly from photos now—one of her laughing by the piano, a line of kids rushing by, a cousin at the keys, mid boogie-woogie.Peggy used to pick me up after school in her white Jeep. She and her family lived in a squat ranch house on a Northern California suburban block fringed by chaparral and oaks. There were teens coming or going, their kids, their friends. The TV in the front played soaps.Peggy was who taught me to get flour from the big jar on the counter. She taught me to watch the stove. She taught me to line up little glass bowls and put some lettuce in each, then some candied walnuts and some Granny Smith apples, finally some dressing, some crumbly cheese. Candied walnuts, I couldn’t believe such a taste! And then the combination of it all!Peggy died suddenly one day when I was in first grade. A heart thing, people said. It was the worst day of my life for a long time.I think her death split me; forever after I pictured my life had she not died, the way things would’ve gone differently instead. For many years there was a particular time of day, 5:55 p.m., that whenever I saw it, I superstitiously thought of her, willed her to come back somehow.Perhaps I thought of her because, had she still been around, I could have asked to go up to her place whenever things got bad at home. They weren’t always bad—sometimes they were fine, sometimes they were really good—but sometimes they got really bad. They grew worse through my middle school and high school years. When 5:55 p.m. came around, I willed even harder, even more improbably, for her to return. I thought of her often, looked at boxes in the closet that I knew were filled with ceramics she’d made when she was young, ones we didn’t use. At 18 I flew to college on the East Coast, 3,000 miles away.I pretended I was fine. I pretended hard as I could. The whole time my insides would feel like melting wax.People don’t like it when you let on that you don’t go home for the holidays, that you don’t see your family much, or at all. They want to know what you went through. For me, talking about what I went through in any detail is something I only really do with my partner, my therapist, my closest friends. I’ve nonetheless ended up writing publicly, if abstrusely, about these topics. I write about mental health, which means I often end up writing about how we treat one another, how that affects us later on.Believe me when I say I tried for years to go home. Believe me, I wanted to be like everybody else. I’d return to a house I’d spent forever calculating to leave, walk back into fights I’d realize were still in progress, be thrust back into them myself. I pretended I was fine. I pretended hard as I could. The whole time my insides would feel like melting wax.A couple of years into college, when Thanksgiving came around, I started following friends to their homes instead. To Virginia, to Long Island. During these evenings, I’d often spend the whole night explaining to the friend’s relatives that we weren’t dating, we were just friends. If people asked why I hadn’t gone home, I’d allude to California being very far away. I’d feel intense shame, one paired with an intense relief at not having forced myself to go back.It felt terribly transgressive, asserting myself as someone who could cook my own Thanksgiving.I moved to Iowa City for grad school at 22. That first Thanksgiving I convinced some friends to come from Chicago to my studio apartment. I wore heels and a dress and they wore ties and I cooked four courses, including Ina Garten’s roast turkey. It felt terribly transgressive, asserting myself as someone who could cook my own Thanksgiving. It was my favorite Thanksgiving I’d had since Peggy.Winter set in, dark and freezing. I found excuses to have people over, to cook big dinners. I taught wine-tasting classes, as I had since college. I grew more ambitious, pairing bottles with a leg of lamb or several roast ducks. I made friends with someone who liked barbecuing, a serious, bearded Minnesotan. We’d stand around my backyard, sip beers, smoke cigarettes in the cold, watch meat brown. The longer I lived in Iowa, the more friends I made. We gathered in big groups, we ladled out hot meaty soups and cups of cider with whiskey. Our hearts grew gangly and intertwined like end-of-summer tomato vines.Over the last decade, reporting and researching about mental health, there is one deceptively simple and I think profound point I encounter over and over: Having community matters, having friends matters, having relationships rooted in support and love matters. I often think of the family I found in my 20s in Iowa City and how they showed me I could still feel—and that I deserved—that kind of love.When my time in grad school ended, I wondered where to go next, figuring I’d head to New York City and try to find a job in media. Before I left I had coffee with a friend who, before coming to Iowa, had built a beautiful house in northern Wisconsin. He now offered something that very much surprised me: I could consider his house my home for the time being, he said. I felt an electric gratitude flow through me. I also felt seen, almost exposed. How had he noticed I was someone who was searching for home?I moved to New York, weeping over the friends I was leaving, knowing there was a chance I’d never find anyone like them again. Or, put another way, I knew how much work it would be to start over, to find that feeling with some new group. I had people over. I served big dinners. I hosted wine tastings. I continued to push myself as a cook and as a host.We met and our souls folded in together like meringue into a batter. We fell in a sort of total love I imagined existed only for people other than me.And every year I flew to Wisconsin to my friend’s house to cook a gigantic Thanksgiving. The guest count swelled to 22 at one point—neighbors and their kids, friends who were dogsledders, writers, and academics we knew who’d come in from university towns. One year a documentary crew. I’d start cooking on Thursday and serve on Saturday, a marathon that began with pies and worked its way toward my friend deep-frying a turkey. We took to calling it Not Thanksgiving.I’d look down the table at the crowded plates, the mirth, experiencing the total pride that comes with pulling off a more-ambitious-than-ever cooking project. I felt the feeling of family, of home, even if it wasn’t really mine. I figured I would always be someone who got to experience that feeling in blips, swooping in for a weekend.But I was wrong.One winter on a dating app I started chatting with someone who was recently divorced, living with his cat in a tall building. We met and our souls folded in together like meringue into a batter. We cooked dinner. We had people over. We fell in a sort of total love I imagined existed only for people other than me.Last year we moved to the country, to an old farmhouse full of mouse shit and crap nobody had bothered to throw away. We made it a home. We married. In November we hosted our first Not Thanksgiving. I started cooking on Thursday and served Saturday evening. Friends from many moments in our lives gathered. Sixteen down the long table.When we got the house, my parents mailed me the boxes of Peggy’s ceramics that had been sitting in their closet all those years. There were heavy brown bowls and platters with beautiful swirling glaze patterns. I served my Not Thanksgiving dinner on them, watched them passed down the table, steaming. I felt her in the room. I thanked her for guiding me home.Explore Bon AppétitHealthyishThanksgivingessayRead MorecultureI Run to Silence My DemonsBy Sandy AllenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-16", "author": ["Condé Nast", "Sandy Allen"]}