{"id": "8cd5133cd0e8610408479983907e63cd", "url": "https://www.bonappetit.com/story/gluten-free-waffles-recipe", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "These Gluten-Free Waffles Satisfy the Kid in All of Us | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Gluten-Free Waffles with Chocolate Satisfy the Kid in All of UsWe created the gluten-free waffles we've craved our whole lives.By Chris MoroccoJanuary 25, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThe story of my life could be told in a series of waffle snapshots. I spent childhood weekends watching the lid of our Munsey waffle maker rise and fall as it chugged through a single square waffle at a time. Round, crispy-edged waffles on the DIY cafeteria station at Oberlin College brought me back to life after many sleep-deprived nights. The square waffles I make two-at-a-time for my kids on a shiny Villaware unit is proof that I now need to think about other people’s waffle needs as well as my own.Throughout all that time, I never developed my own recipe. Getting the chance was overwhelming, like getting the keys to the car for the first time. I wanted my waffles to be everything to everyone. I thought about the chocolate waffles at De Maria. I thought about the gluten-free buckwheat waffles on Cookie and Kate, and I thought about how much I like waffles. What is a healthyish waffle, anyway? One with a fanned-out avocado on it? I wasn’t going to go there. I worked on all the other breakfast recipes in the Healthyish issue and put off the waffle recipe for as long as I could.Once I started cooking, though, I had one of those moments where you see the waffle universe and your tiny place in it. It just made sense. Wet ingredients, dry ingredients. Just like the dog-eared recipe I cooked from in high school but with a more modern (and gluten-free) approach.Dry: ground flaxseeds to give extra structure to the buckwheat flour, and as much cocoa as I could get away with without going bitter. Baking powder and soda. A generous amount of salt.Wet: lots of virgin coconut oil to give moisture and richness, balancing the tannic, dry cocoa. Just enough brown sugar to balance the flavor but not so much that I would get in trouble. Eggs for lift and binding. Buttermilk for tanginess. Chocolate chunks, because I may not get another shot at this for a while.The aroma of toasty cocoa-rich batter is the first thing that hits you, then out of the iron come super light yet intensely chocolatey waffles that manage to hold together until they reach your mouth. Nutty, rich, and savory. Something was wrong, though. However healthyish the waffle’s ingredients skewed, it still looked like a chocolate waffle. I needed a non-avocado topping that could bring it into the healthyish universe. Whipped ricotta and a super-fast buckwheat groat crumble (just groats, flax and sesame seeds tossed with a bit of maple syrup and toasted) took it there with creaminess and crunch. It’s the kind of recipe that makes me break out the All Clad four-waffle iron: Two is never enough.Break out your waffle iron:Gluten-Free Chocolate Buckwheat WafflesHealthy waffles? They do exist!View RecipeExplore Bon AppétitHealthyishWaffleGluten FreeBuckwheatCocoaBreakfastWeekend BrunchBrunchRead MorecookingWeekend Plans: This Quiche With a Magic Sweet Potato CrustBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Chris Morocco"]}