{"id": "8cd78888a2c396e02f76fcca3c69281a", "url": "https://www.bonappetit.com/story/lgbtq-pride-business-roundup", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Give Your Money to LGBTQ Small Businesses | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGive Your Money to LGBTQ+ Small BusinessesStart with these food and bev brands we love, like Omsom, Diaspora, and Pipcorn.By The Bon Appétit StaffJune 25, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I don’t know about y’all, but Pride month makes me feel so seen. Sure, major companies including CVS and Walmart may have donated over $10 million to anti-LGBTQ+ politicians over the past two years. But come June? Every logo has a rainbow, every brand has limited-edition merch, and every CEO is all “YASSS QUEEN! Those Q2 profits are fierce, hunty!”At best the intersection of Pride and corporate capitalism is fraught and, at worst, deeply antithetical to the spirit of celebrating queer identity. So our staff established a simple rule for this Pride roundup of food and bev products we love: All these companies are founded and owned by at least one real, live queer person. When you buy a bottle of hot sauce from Andre Springer or a jar of jam from V Smiley, you put money in the pockets of a member of the LGBTQ+ community. And just like how support for Black-owned businesses shouldn’t be reserved for February or the wake of another act of police brutality, consider patronizing these small businesses year-round. (Your pantry, bar cart, and spice rack will thank you.)Diaspora Co.Sana Javeri Kadri started spice company Diaspora Co. in 2017 with what might have been the most ethically grown, harvested, and sold turmeric available. Since then she's methodically and thoughtfully expanded her offerings to include Aranya pepper (more complex than any other pepper I’ve tried) and Nagauri cumin, which I'll be slathering on lamb chops all summer long. —Lauren Joseph, commerce editorphoto by Andria LoDiaspora Co.$12 at Diaspora Co.Explorer Cold BrewThe stereotypes are true—I live in a house with three other queers, and we go through a lot of iced coffee. These days our go-to is Explorer Cold Brew, which is not only incredibly delicious but also available in four caffeine levels. I opt for the low-caf concentrate most days, which sacrifices nothing on flavor. I assume Explorer founder and mountaineer Cason Crane drinks the extra-caffeinated brew, which is the only way to explain how he climbed the Seven Summits by age 20. —MacKenzie Chung Fegan, senior commerce editorPhoto Courtesy Explorer Cold BrewExplorer Cold Brew 32 oz. Big Bottle$37 at Explorer Cold Brew Co.Shaquanda’s Hot Pepper SauceThis Barbadian-style hot sauce is so dang versatile. The blend of vinegar, onions, horseradish, and peppers takes my eggs, grilled meats, tacos, and stews to a fiery new level. I also love the iconic label, emblazoned with founder Andre Springer’s drag persona, Shaquanda, who, like her hot sauce, is “willing to please, eager to burn.” –Ali Francis, associate editorPHOTO BY CHELSEA KYLEShaquanda’s Hot Pepper Sauce$10 at Shaquanda Will Feed YouOmsomOmsom is my “it's 7:02 p.m., what's for dinner?” savior. The collection of sauces, aromatics, and spices, created by sisters Kim and Vanessa Pham, all come with recipe cards for Southeast and East Asian dishes, like sisig, larb, and bulgogi. This handy little box contains a sauce pack for six Japanese, Chinese, and Korean meals—all of which can be on your plate by 7:32. —Lauren Joseph, commerce editorPhoto by Mischelle Moy/Courtesy OmsomOmsom East Asian Sampler$29 at OmsomMadhu ChocolateI’ve lost count of the number of people I sent Madhu Chocolates packages to over the past year and a half. For any and all “congrats” or “I’m thinking of you” gifts, I turned to these chocolate bars from Harshit Gupta and Elliot Curelop’s Austin-based company, which come in great flavors (lemon fennel, rose pistachio, black pepper—made with spices from the previously mentioned Diaspora—and saffron milk) and beautiful packaging. —Sonia Chopra, executive editorMadhu Chocolate Idukki Black Pepper$10 at Madhu ChocolateEarly Bird GranolaNot so long ago “granola” was associated with hippie co-ops and Birkenstock-wearing moms who tried to convince their kids that carob was a convincing substitute for chocolate. While Nekisia Davis has been known to sport a pair of Birks, her Early Bird granola is not about restraint or asceticism. It is unrepentantly full of flavor, with plenty of olive oil, maple, and salt. Is it health food? Do I care? —MacKenzie Chung Fegan, senior commerce editorPhoto courtesy Early Bird/ by Hannah SchillingerEarly Bird Classic Trio$28 at Early Bird Foods – Includes 3 BagsPipcorn Everything CrackersStarted in Brooklyn by queer cofounder Jen Martin and her brother Jeff, Pipcorn is a snack company that sources heirloom corn for their range of flavored popcorns, cheese puffs, and crackers. Not to be corny, but their bite-size Everything Crackers are truly my everything– the oniony, garlicky, poppy-seed-studded crackers are perfect when dipped in hummus, topped with cheddar, or savored on their own. —Chala Tyson Tshitundu, assistant editorPipcorn Crackers$15 at Pipcorn – Pack of 3Supergay VodkaI'm a natural skeptic, and during Pride month, even more so: Corporate rainbow-washing is a scourge. So when I first learned about Supergay Spirits, I instinctually side-eyed the entire project. But Supergay, founded by Aaron Thorp (a sommelier and beverage director whose track record includes stints at The Standard, Alta, and Le Coucou) and Tom Jackson (of queer culture magazine GAYLETTER), has cred. Their vodka, made from 100 percent organic corn, is weighty and smooth with the slightest hint of sweetness—perfect for a simple gimlet or martini. Even better? Supergay funnels a portion of its profits to organizations benefiting LGBTQ+ bar/restaurant workers like ROAR NY. —Joseph Hernandez, research directorSupergay Vodka$38 at Supergay SpiritsPixie Retreat L’il Puddin’sPixie Retreat owners Theresa Keane and Willow O’Brien have been making vegan staples from scratch in Portland, Oregon, for nearly two decades, and just this year they started shipping cases of their coconut, cashew, and Irish Moss puddin’ nationwide. These raw vegan dessert tubs ship frozen and defrost in your fridge. Use them like you would custard—as a layer in a vegan dessert, spooned on top of olive oil cake or berries, or just eaten straight out of the cute, tiny tub. —Allie Wist, visuals editorPhoto by Emma FishmanL'il Puddin'$80 at Pixie Retreat – Pack of 8V Smiley JamsV Smiley started selling her gorgeous pectin-free, honey-sweetened jams, which she prefers to call “fruit food,” while she was working at The Whale Wins in Seattle. Now that she’s back home on the farm in Vermont, her flavors skew more New England than Pacific Northwest—think currants, quince, and elderberries—and feature aromatics grown by her partner, Amy. Buy her jam and back her Kickstarter to help expand her production capacities. —MacKenzie Chung Fegan, senior commerce editorV Smiley Raspberry Redcurrant Geranium Honey Jam$7 at V Smiley PreservesCoolhaus Ice Cream SammiesThere is nothing like an ice cream sandwich when you’re looking for a pick-me-up treat, and Coolhaus makes some of the most fun ones out there. Cofounded by Natasha Case and Freya Estreller, the L.A.–based brand sells pints and cones in addition to ice cream sandwiches. The delightful roster of flavors (many dairy-free!) ranges from coffee and cookie dough to dirty mint chip, horchata, and birthday cake. —Sonia Chopra, executive editorCoolhaus Tahitian Vanilla Ice Cream Sammie$10 at CoolhausRancho GordoIn an interview with The New Yorker, Rancho Gordo founder Steve Sando remarked, “The truth is that your sexual identity is just about the least interesting thing about you. Do you play an instrument? That would be interesting.” So yeah, Sando is gay, but perhaps he’d rather I write about how he’s dedicated his life to bringing heirloom beans and legumes out of obscurity and into our stock pots. (Sando requested we share this bean portrait of him, but our art department went with a bag of beans. I’d have voted for the one where he holds a martini glass with his toes.) —Alex Beggs, staff writerRio Zape Beans$6 at Rancho Gordo – 1 lb. BagProteauJohn deBary is a great bartender (go make his margarita if you need convincing), which perhaps counterintuitively made him particularly well-suited to developing a line of non-alcoholic botanical drinks. Pulling from his knowledge of vermouths and amari, deBary concocted two zero-proof, low-sugar beverages—Proteau Ludlow Red, a peppery, almost savory blackberry concoction, and Proteau Rivington Spritz, which tastes like pleasantly bitter, fizzy strawberries. —MacKenzie Chung Fegan, senior commerce editorPhoto Courtesy ProteauPorteau Non-Alcoholic Botanicals$39 at Drink Porteau – Pack of 2Equator CoffeeThere's no shortage of complex, caramel-tinged, or floral coffee out there. But there is still somehow a dearth of good, truly fair-trade coffee. Marin County-based Equator has been walking the walk since it was founded in 1995 by Brooke McDonnell and Helen Russell. Try their eponymous Equator blend or, my favorite, the B'Cause blend. It’s a chocolatey medium roast, and a dollar from each bag sold goes to the Young Women's Freedom Center, an organization that empowers youth from communities disproportionately impacted by incarceration. —Lauren Joseph, commerce editorEquator Blend Coffee$16 at Equator CoffeesExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-25", "author": ["Condé Nast", "The Bon Appétit Staff"]}