{"id": "8cdb20712f8bea98327c12cdfb5dfc9a", "url": "https://www.bonappetit.com/recipe/digestive-cookies", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Digestive Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDigestive CookiesBy Sohla El-WayllyMarch 23, 20204.9(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWheat germ, the nutrient-rich heart of wheat kernels, gives these cookies their hearty, nutty crunch while also keeping them tender and crumbly. You can often find wheat germ in the bulk bin aisle of the grocery store, but toasted rolled oats or ground flax can be used in its place for a similar texture. These cookies are ideal for making in advance, as their flavor and texture improve after a few days. The butter and milk can be substituted with plant-based alternatives without sacrifice, so make them vegan if you want.IngredientsMakes about 30½cup (1 stick) chilled unsalted butter, cut into pieces½cup (33 g) wheat germ6Tbsp. (75 g) sugar1tsp. baking powder1tsp. kosher salt1⅓cups (167 g) whole wheat flour, plus more for surface¼cup (65g) milk2oz. chocolate (any percentage), chopped (optional)1tsp. refined coconut oil (optional)Special EquipmentA 2”-diameter cookie cutterPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Process 1⅓ cups whole wheat flour, wheat germ, sugar, baking powder, salt, and butter in a food processor until butter virtually disappears and you have a fine, floury meal. Add milk and pulse until a damp and crumbly dough forms.Step 2Turn dough out onto an unfloured surface and gently knead just to bring it into a ball; flatten into a disk. Lightly flour surface and roll out dough until just shy of ¼” thick. Lightly flour cookie cutter and punch out cookies, dusting with more flour as needed to avoid sticking. Dust any excess flour off of cookies with a dry pastry brush.Step 3Using a spatula, transfer cookies to 2 parchment-lined baking sheets. Gently knead scraps together, reroll, and punch out more cookies. Discard any scraps (or bake as is and crumble over ice cream!).Step 4Prick each cookie 3 times with a fork and bake, rotating baking sheets top to bottom and front to back halfway through, until bottoms and edges are browned, 15–18 minutes. Let cool on baking sheets (cookies will crisp up as they cool).Step 5If using, melt chocolate and oil in a microwave-safe bowl in the microwave in 20-second increments, stirring after each burst, until mostly melted and smooth, about 1 minute total. (Alternatively, melt in a heatproof bowl set over a saucepan of simmering water, stirring occasionally, until melted; do not let bowl touch water.) Stir chocolate mixture until fully melted, then continue to stir until slightly cooled and thickened, about 3 minutes. (This makes it easier to get a thick layer of chocolate on the cookies.)Step 6Using a small offset spatula or butter knife and working one at a time, spread a scant 1 tsp. chocolate over the flat underside of each cookie. Using the edge of the spatula and starting from one side and working your way to the other, gently and quickly press a few lines into chocolate as desired. Chill cookies on baking sheets until chocolate is set, about 10 minutes.Step 7Do ahead: Cookies can be made 3 weeks ahead. Store airtight at room temperature.How would you rate Digestive Cookies?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleFYI, ½ cup (1 stick) butter weighs about 111 grams (about 113g with the paper).Anonymous8/19/2021Hello, I would like to try this recipe, but in recipe is indicated butter ½ cup (1 stick) , here we have butter not in sticks but in bars, and each is about 500g, then cups are different size as well is it US, EU, AU or UK. It would help in grams\nThank you in advanceAnonymous8/17/2021These were really good! The dough was incredibly sticky so I was nervous about being liberal with flour when rolling them out, but there was no adverse effect on the final product. Thanks for the recipe, Sohla! AnonymousPortsmouth, NH4/23/2021I love love love these! Thank you, Sohla. These are an excellent tea/coffee accompaniment. \nI made them as written the first time and they turned out wonderfully, and now I've made them a second time subbing in some toasted oats and a handful of toasted pecans for the wheat germ since I was out. I'm toying with the idea of subbing in some toasted coconut next time to lean into the slight coconutty flavor of the chocolate coating.\nI use Dorie Greenspan's trick of rolling out the dough between parchment sheets to avoid having to clean up the counter.\nAnonymousChicago, IL12/9/2020These were so good! perfect amount of nuttiness and snap, and not too sweet. I've made these twice now, and I find it much easier to chill the dough for at least 20 mins before rolling it out. I also work in batches, leaving the other portions of dough in the fridge while I'm rolling out the first batch. I also don't usually have wheat germ, so I just use toasted rolled oats instead and it works great. AnonymousEdmonton, CA11/21/2020So. Haven't been swearing like this, well, since the 2016 American presidential elections. Did a vegan version with soy milk and Flora Plant vegan butter and oat bran. Wouldn't make again if the dough itself didn't come together this easily. Even after a 30 min rest in the fridge like another commenter suggested the dough was incredibly sticky. Couldn't get the cookies off my counter even though I dusted it, so I had to scrape the dough off the counter (insert swearing). Then everything stuck to my wooden rolling pin. I figured out a way: Heavily flour a sil-pat mat (so cleanup' easier), and with heavily flour I mean a 2mm coat. Then dust the top of the dough again heavily with flour and your rolling pin as well, I even dusted my offset spatula, just make sure to brush off the excess flour with a brush like Sohla suggested. From there it's smooth sailing. AnonymousVienna, Austria11/16/2020Excellent biscuits! I didn't have any wheat germs so I used raw flax meal instead, I also skipped the chocolate as I was looking for something a bit healthier. The dough was super sticky, so I chilled it for 10 minutes before rolling it out and next time I will chill it for 30 to make things easier when rolling out. And next time I will also reduce the salt by 1/4 teaspoon as I always have slated butter around, but even with the full salt they are yummy!Circe LinkLos Angeles CA10/10/2020I’ve made these cookies twice and both times the dough was very sticky. I’m not sure what I’m doing wrong! I’m using whole wheat pastry flour instead of the regular kind, could that be it? Also, I don’t toast the wheat germ beforehand, maybe that? By the way I agree with the suggestions to half the salt, although if you’re not sensitive to salt like me they have more complex flavour if you include it. I’m still going to try this recipe a couple more times with tweaks because I really want to figure it out! AnonymousToronto9/6/2020You are fantastic! I really have to thank you. I've been struggling the last few months after my mom, diagnosed with multiple myeloma and recently having suffered congestive heart failure, was put on a zero sodium diet. No packaged foods whatsoever. I adore my mom, so I decided that now would be the time to finally get around to learning my way around a kitchen, as I vowed that she would never feel deprived, because I'd work my booty off to replace the things she likes, or introduce her to new ones.\nShe was devastated when she couldn't have digestives with her coffee anymore in the morning (sometimes when you're dealing with so much, the small things can be especially demoralizing.) I literally just pulled these out of the oven (after figuring out how to turn on the food processor, haha!) and the only change I made was that I didn't add any salt at all. These cookies came out perfectly, and despite my doubt, they taste exactly like regular digestive cookies! And they have the right texture too! She is going to be hella psyched tomorrow morning when she gets to have one of her old favourites again. Thank you so much - I'll definitely be coming back here for more recipes to try as I boldly go forward into (for me) the new kitchen frontier. ;) Thank you again!ElalaToronto, Canada7/24/2020I've made these a couple times now. Delicious, crunchy and easy. I love that they can be made in no time at all since the dough doesn't need to be chilled. The dough can be a little sticky, but it's very forgiving and I've found I can be generous with the flour when rolling it out.\n\nThis last time, I used up what I had left of some buckwheat flour ~ about  70 grams ~ and the rest whole wheat pastry. I loved the rustic color and flavor and will make that substitution going forward. Used toasted oats rather than wheat germ. I also used coarse sea salt and didn't find them too salty. I love making these for my little niece and nephew.linderseed6/10/2020These came out perfectly. I have been building a birthday basket of childhood treats for my mum and this was the best recipe for digestives I have found! I am out of wheat germ so I swapped for flax meal and still got a deliciously snappy biscuit. I also do not have cow milk and coconut worked fine. I love how bulletproof your recipes are, so well tested that even with swaps, we still get what we were looking for!AnonymousVirginia5/20/2020I don’t know what I did wrong, but my dough was way too wet to cut. I put it in the fridge to see if the butter would firm it back up. If, not..this will be one big cracker that we break up to eat.AnonymousVermont5/16/2020These turned out great! They satisfied my digestive biscuit cravings :) I didn't have wheat germ or whole wheat flour so I used spelt flour to substitute. I also used almond milk. I found the dough to be very sticky to roll out (could have been a result of my substitutions but who knows). I think the kosher salt made the flavour well balanced. Will definitely make them again. Looking forward to enjoying them for the upcoming week. AnonymousToronto5/13/2020Brilliant recipe! I have been making Rick's Brown Butter Choc Chip Toffee cookies and they are my new fave. But sometimes you want just a plain biscuit to have with a cup of tea. So these digestives are my \"go to\" for that, even without the chocolate! Thanks so much for the inspiration! AnonymousCanada 5/11/2020I was thwarted by my oven and by not paying attention at the store...I got stone ground wheat by mistake, so they are extra wheat-y and I forgot my oven runs hot, so a lot got burnt :(   I subbed ground flax, plant butter and almond milk.  So while I'm one of those that totally didn't follow the recipe, they are STILL quite tasty and I most def will make again!!NYC!5/10/2020Explore Bon AppétitCookieDessertBritishEuropeanWheat GermRice & GrainsWhole Wheat FlourFlourSnackHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-23", "author": ["Condé Nast", "Sohla El-Waylly"]}