{"id": "8cf48c207887d3ea2843bc5a9ea08c04", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/hotel-covell", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Hotel Covell Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesHotel CovellA very ‘grammable boutique hotel in Los Feliz, with the coziest wine barFacebookPinterestTwitterEmailAaron Woolf HaxtonGO: for a styled-out escape from the L.A. scene, via Hotel Covell, a charming boutique hotel with one of the city’s best wine bars tucked downstairs.THE VIBE IS: California chill. Each of the nine rooms has a no-frills, boho feel, with big windows covered by white, flowy curtains and pops of color throughout (a gold dresser, blue headboard). There’s likely a Crosley record player in your room and Malin+Goetz soaps in the bathroom, making you feel more at home than in a hotel. But the best thing in the hotel is Bar Covell, the thimble-sized wine bar downstairs run by sommelier Matthew Kaner.PRACTICAL STUFF: Rooms start at $295. Since the hotel has a very limited amount of rooms, it’s best to book out as far ahead as you can.—Elyse InamineCourtesy of Mayne Marketing AgencyWE ALSO LOVEAce Hotel DTLAA hipster wonderland with a juice bar in the lobby and acoustic guitars in the roomsKismetMediterranean family-style feasting from morning to nightTiki-TiEverything you love about dive bars—plus paper umbrellas—in Los FelizExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}