{"id": "8d03d04ed50b4e37044bfb1a100141b1", "url": "https://www.bonappetit.com/story/thanksgiving-workout", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "No Thanksgiving Workout Is Going to Undo Your Thanksgiving Dinner. Let It Go. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleReal Talk: No Workout Is Going to Undo Your Thanksgiving DinnerEnough with the turkey burns already. By Alex BeggsNovember 26, 2019FacebookTwitterEmailIllustration by Genie EspinosaFacebookTwitterEmailThis Thanksgiving, I will wake up and take a butter-and-lard-based pie crust out of the freezer. While it’s getting to a rollable temperature, I’ll head to the Y to sweat my ass off. I’ll spin on a bike for 30-ish minutes. I’ll do an interval workout that leaves my face cranberry sauce red, my thighs burning like brussels sprouts forgotten in the oven, and a puddle of sweat on the floor that has no Thanksgiving food comparison. After, I’ll be pumped with energy and endorphins. I’ll feel strong and happy as I do when I work out on any Thursday morning.But I will not under any circumstances call this workout a “turkey burn\"—or a TORQUEY BURN, as FlyWheel is calling it. “I WOKE UP IN FEAST MODE” already has a waitlist. Peloton offers incredibly popular turkey burn rides, bootcamps, yoga flows, and runs. One Friday-after Thanksgiving turkey burn Bar Method class I came across was 15 minutes longer than usual, which adds insult to injury. If you search #turkeyburn on Instagram you’ll come up with a lot of clip arty turkeys on row machines or quivering under heavy barbells advertising local gym classes. (Important sidenote: The turkey trot is exempt from criticism because it’s a family-time running race—no trainers will be yelling about your mashed potato thighs while you run around the freezing park.)I don’t ride for tacos, turkey, or permission to eat. I don’t spend 30 minutes listening to mediocre remixes to assuage my food guilt. And yet trainers and gyms and fitness apps love to reinforce this bullshit. I want it to stop! It’s illogical, patronizing, and a subconscious way to make us feel bad about our bodies even as we turn those pedals, doing the exact thing (exercise!) that medical experts and Sanjay Gupta told us to do in order to live longer, healthier lives.Instead, the turkey burn narrative divides the day into two parts. Part one: you exercise and are Good. Part two: you eat gravy and are Bad. But Thanksgiving is just the peg for this article—my rant continues year-round. I’ve had a yoga instructor joke, mid-flow, to “reach for those tacos!” when we were doing a balance, stretching our arms towards the wall in front of us. In this great article on The Cut about the cult of Peloton, two usernames stuck out: @ridefordonuts, @rideforchardonnay. Every time you log in you have to feel bad about donuts?! Devastating! I have a friend who read the back of a tortilla package and told me how many minutes on the treadmill it’d take for her to undo the pleasure of eating it. That broke my damn heart. Don’t get me started on the postpartum workouts that make women feel fat for embarking on the hardest journey of their life thus far. Even I’m not immune: I’ll take the nine-flight climb to our Test Kitchen to lessen the guilt of taste-testing a holiday cookie. Workout, good. Eating, bad. But eating is so, so good! IT IS MY LIFE.Mathematically and biologically speaking, no workout class is going to undo a giant plate of Norman Rockwell-perfect turkey. Exercise isn’t a magic eraser to Parker House rolls of belly fat. The time and effort required to work off significant calories is A LOT OF TIME. MUCH EXERTION. VERY DIFFICULT. If you recognize that, the turkey burn class is even more frustrating. “Yeah, I burned off what, a single stolen sheaf of crispy skin?” The guilt compounds. You’ll never do enough.Most medical experts will tell you that weight loss and maintenance is about making a personal food-intake change, whether that’s decreasing portion sizes or cutting out super processed food and added sugar. In fact, when people reward themselves with extra food on days they exercise, some end up gaining weight. (I used to drive through KFC after swim practice to pick up a mashed potato “Famous Bowl” in high school, I know all about it. I almost bought the gym duffel that says, “After This We’re Getting Tacos.”)You should exercise for heart health, to build core strength that’ll support you as you age and protect your back. You should exercise to stave off depression and combat stress. You should exercise to help you sleep. You should exercise to have a moment to yourself, despite the shitty remixes blasting in your ears. You should not exercise to punish yourself for enjoying squishy glazed donuts once a month.I exercise to get strong and to keep my mood up. (Okay, and to show off my Aperol water bottle and to use the Y’s steam room.) I eat to fuel my body as deliciously as possible, as healthily as I can stand it. And on Thanksgiving, I’m only feeling happiness when I dive bomb into my slice of home-freaking-made pecan pie. I didn’t earn it. I certainly didn’t burn it. I made it, and it’s fucking awesome.Explore Bon AppétitHealthyishThanksgivingessayRead MoreLifestyleForget the Fancy Fitness Studios, Zumba Is the Only Exercise Class I NeedBy Flora TsapovskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-26", "author": ["Condé Nast", "Alex Beggs"]}