{"id": "8d058ac620161ba3c1b62086445f39e8", "url": "https://www.bonappetit.com/story/what-is-furikake", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "What is Furikake, the Nutty-Salty-Savory-Seaweedy Japanese Sprinkle? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat is Furikake, the Nutty-Salty-Savory-Seaweedy Japanese Sprinkle?Savory sprinkles > sweet sprinkles.By Sonoko SakaiOctober 18, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.While the Japanese have been turning fish into dried flakes for hundreds of years, furikake—a seasoning with a distinctly nutty and seafood-y taste—was invented in the early 20th century as a nutritional supplement. The pharmacist Suekichi Yoshimaru came up with the idea of grinding fish bones into powder as a way of addressing rampant mineral, fiber, and protein deficiencies at a time when many peoples’ diets consisted primarily of white rice. Yoshimaru’s mixture of pulverized sardines, poppy seeds, and seaweed was sold in small flasks and marketed as Gohan no Tomo, or “Friend of Rice,” and became a bestseller.What is furikake?These days furikake is, broadly speaking, a mixture of sesame seeds, seaweeds, herbs, fish flakes, and salt that derives its name from the Japanese term for sprinkles. It's commonly served on bowls of steamed rice and pressed into rice-based snacks like onigiri for another layer of flavor, texture, and nourishment.How is furikake traditionally made at home?While furikakes are widely available at Japanese grocery stores and come in a dizzying number of variations, they’re so simple to make at home that it never dawned on my mother nor my grandmother to buy them from a store. They made us the classic furikakes—gomashio (toasted sesame seeds and sea salt) and shiso (ground sun-dried pickled red shiso leaves)—using a traditional suribachi and surikogi (mortar and pestle). They also made furikake with the spent katsuobushi (bonito flakes) and kombu that they had used to make dashi (broth). The repurposed ingredients were chopped into small pieces and simmered in soy sauce, mirin, and sake until they became flaky and dry enough to sprinkle on rice. Other times they never turned sprinkle-able and we enjoyed them as tsukudani, moist sweet-savory pickles often eaten with plain rice or used as an onigiri filling.What types of furikake are available?Furikake has come a long way since I was a child growing up in Japan in the ‘60s. With the advent of freeze-drying and other preservation methods, the furikake industry has exploded, turning these instant flavor enhancers into a popular convenience available at any Japanese grocery store. No wonder Japanese cooks don’t bother bringing out their mortar and pestle anymore. (I still do, but I’m one of the few who still preaches doing the dirty work.)Modern furikakes come in a variety of combinations. While the classic gomashio, shiso, and katsuobushi still stand, you’ll also find furikakes with newer additions like dehydrated egg, wasabi, nori, sardines, cod roe, umeboshi, meat, yuzu, curry powder, and other spices. And thanks to industrial dehydrators, they’re also drier, crispier, and longer-lasting than those homemade versions I grew up with.How can I use furikake?Furikake is versatile and doesn’t need to be saved for special meals or even reserved for Japanese dishes—it can become a daily seasoning like salt or pepper if you wish. I’ve found blends that not only give my rice a punch of flavor but also jazz up my pasta, noodles, vegetables, pizza, popcorn, dips, and—in my latest experiment—focaccia. Crème fraîche and furikake is an untraditional but delicious combination.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk To use it well, avoid over sprinkling—like salt, it's salty!—and pair it with foods that are fairly mellow in flavor: Scatter it on scrambled eggs, steamed or roasted fish, or fried rice; use it to add texture and oomph to a split steamed sweet potato, chicken salad, crudités; distribute it over crackers and cookies as a finishing touch right before baking. Or follow the lead of Kristina Cho and make furikake, along with scallions, mayonnaise, and pork floss, the filling for savory swirl buns.Yes, adding furikake to a Western dish can blur its authenticity, but if it tastes good, why not?Where can I buy furikake (and how can I find the good stuff)?On the West Coast, where I live, I’ve found delicious furikakes made from locally harvested seaweeds and salts. The best seaweed-based furikakes are fresh, sustainably sourced, and free of chemical additives. The U.S.–made furikakes and furikake-adjacent spice blends I like are from Daybreak Seaweed Company, Jacobsen Salt Co., and Eden Foods.Jacobsen Furikake Seasoning$10 at My Panier$11 at Weston TableEden Foods Seaweed Gomasio$3 at Thrive Market$10 at AmazonDaybreak Golden State Seasoning Salt$12 at Daybreak Seaweed CoIf you buy furikake from a Japanese market, there are as many options as there are instant ramen. I recommend you seek out those with no artificial additives (like chemical preservatives or food coloring). The labels are often not translated into English, but you can always ask the shopkeeper to help you. At the moment Noritama furikake—a mix of nori seaweed, dehydrated egg, and sesame seeds seasoned with soy, sugar, and loads of artificial preservatives—is popular among both Japanese children and adults. I tend to stick to the classics like gomashio and shiso, preferably without additives.The definition of furikake seems to be evolving—I’ve even come across savory granolas that act like furikake but are substantial enough to be snacks. As is always the case, food cultures are crisscrossing and coexisting on individual plates, striving for perfect balance and harmony. And while I never would have thought that the tiny savory sprinkles of my childhood would become the darling of the global seasoning world, I can vouch for their goodness.Sprinkle away:Pork Floss and Seaweed Pull-Apart RollsThese pillowy milk bread buns are filled with an irresistible combo of sweet-and-salty pork floss, mayonnaise, and savory furikake.View RecipeSonoko Sakai is a Japanese American cooking teacher and the author of Japanese Home Cooking.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-18", "author": ["Condé Nast", "Sonoko Sakai"]}