{"id": "8d183743417ffd1d9d91309722f92010", "url": "https://www.bonappetit.com/story/simone-jacobson", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "Simone Jacobson Is the Cultural Connector D.C. Needs Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSimone Jacobson Is the Cultural Connector D.C. Needs Right NowThe ultimate Renaissance woman is our Superpowered DC honoree.By Jessica SidmanAugust 29, 2018FacebookTwitterEmailPhoto by Scott SuchmanFacebookTwitterEmailWe're honoring Simone Jacobson as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. Join Jacobson, the Healthyish team, and our partner Caviar at Timber Pizza Co in DC on September 12th, or see when we'll be in a city near you.The guy to my left is balanced upside down on his head, feet shooting straight in the air. Meanwhile Simone Jacobson is telling us all to “go upside down.”I’m at Jacobson’s “Yoga for Every Body” class, aimed at people of color, queer and trans people, or anyone who’s ever felt out of place in a yoga space. This particular session is in a studio, but Jacobson teaches similar classes at the public library and DC Jail.  If you can breathe and move, she says, you can do yoga.But anything resembling a headstand? Not my body. With my head tucked in my palms on the mat, I give a small, sad kick in the air. I give up. But Jacobson knows I can do this. With her buzzed head and Buddha-like smile beside me, she calmly coaches me to kick up higher and higher. Then, finally, for a few brief seconds, I too am upside down.Empowering other people is Jacobson’s superpower—not just in yoga, but in her countless other roles. The 34-year-old is the Deputy Director for Words Beats & Life, a non-profit that aims to transform lives through hip-hop. She helps organize festivals and cultural events for Smithsonian museums. And she co-owns a “Burmese bodega” selling all kinds of Asian foods and products.Jacobson calls herself a “multipotentialite,” a term she picked up from a TED Talk about having more than one calling. After all, as a kid, she wanted to be both the first female president of the United States and a “Fly Girl” on ’90s sketch comedy show In Living Color. As an adult, she’s encountered a lot of pressure to pick a lane but prefers to be a “Jill of all trades.” And while her wide-ranging lineup of gigs and projects can seem random at first glance, underneath it all is a common theme: “What can we do that is truly for everybody?”Jacobson’s dad is a Jewish lawyer originally from Pittsburgh; her mom is a former English and art history teacher from Burma, whose family fled the country after her journalist father was briefly imprisoned following the 1962 military coup. Growing up in Phoenix, Arizona, most of Jacobson’s classmates had never even heard of Burma. Like many people from mixed-race backgrounds, she grappled with her hyphenated identity.“I care so much about inclusion because so much of my life, in small and large ways, I was excluded,” Jacobson says. “It’s this feeling of being from everywhere and nowhere, belonging in all places and in no places.”Jacobson doing yoga at Malcolm X Park in Washington, DC\nPhoto by Scott SuchmanStill, Jacobson has always been extremely proud of Burmese roots and finally traveled to the country for the first time in her twenties. There, she tried her first falooda, a parfait-like dessert with basil seeds, ice cream, and flavored gelatin. Jacobson says she and her mom, Jocelyn Law-Yone, have always come up with “get rich slow” schemes. One day, they thought, why not open a falooda shop?In 2016, Jacobson, her mom, and friend Eric Wang launched Toli Moli, a pop-up cafe serving gourmet versions of falooda. Over the past two years, the venture has evolved into a Burmese bodega or “cornerless corner store” inside DC’s Union Market food hall, selling a small menu of Burmese staples and family recipes like catfish curry and coconut noodles alongside Asian products ranging from Korean face masks to Thai chili sauce. Law-Yone is the chef, Wang is the manager, and Jacobson runs behind-the-scenes tasks from payroll to marketing. Together, they’ve made the space a community hub, hosting cooking classes and supplying books by and about people of color.“We are artists and teachers,” Jacobson says, “So we share food and we share stories, and that is our role in keeping Burma on people’s minds.”Jacobson’s role as self-proclaimed “cultural connector” now goes far beyond the bodega. Last fall, the Freer Sackler, the Smithsonian museum of Asian art, hired Jacobson to help organize its IlluminAsia arts and culture festival, which included a night market on the National Mall. Jacobson brought in the food vendors and other artists and community groups. The 50,000-person event ended up being the largest in the Freer Sackler’s history.Freer Sackler program manager Matthew Lasnoski says that, after the event, Jacobson organized a dinner for all the food vendors. No one asked her to do it, but she insisted that all these Asian-American chefs and restaurateurs get know each other. “Building community is just a natural part of what she’s interested in doing,” Lasnoski says.In February, Jacobson started her newest community-building gig for hip-hop non-profit Words Beats & Life. As Deputy Director, she oversees adult programs—like classes where you can learn how to be a DJ or a graffiti artist—that help fund the free activities for kids.Even though it seems Jacobson has a million things going on, she tries to be selective about projects. ”I’m very protective of my time, and I think one of the healthiest things we can do, especially as women, is learning the compassionate ‘no.’”To help keep herself grounded, Jacobson turns to yoga and meditation. “Yoga also helps with having a hyperactive mind. Sometimes you need to turn it off,” she says. “Yoga for me is that full power down.”Jacobson started practicing yoga after tearing her ACL and meniscus in an informal hip-hop dance battle in 2008. She couldn’t dance, but she knew she needed to move—somehow. Last year, she became a certified yoga teacher. Jacobson has since gravitated toward Yoga Activist, a non-profit focused on “trauma-sensitive and inclusive” yoga. She started teaching at a public library, then, last October, helped launch programs at the DC Jail. There, she’s practiced alongside inmates from all backgrounds and abilities, including some with bullets in their spines, and helped them try to find peace amid constant noise. But, Jacobson says, the classes aren’t that different than those in a studio. “Everybody has a body, and the bodies move, and that’s it,” she says.Jacobson’s next step is to train more people to teach the classes. While she prides herself on being able to do it all, she wants to build things that can thrive without her.“There are a lot of people who start things and they feel like it can’t run without them. I’m the opposite. I’m like, ‘Can it run without me?’ Great, next thing,” Jacobson says. “Not because I have a lack of attention span, but because I want to leave as many thriving things as I can.”Join Healthyish Superpowered to celebrate Jacobson on September 12th in DC.Explore Bon AppétitHealthyishSuperpoweredprofileRead MorecultureAshley Novoa Wants Everyone to Experience Their Periods with DignityBy Britt JuliousRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-29", "author": ["Condé Nast", "Jessica Sidman"]}