{"id": "8d255ea453cef9940e3fef6c56939b75", "url": "https://www.bonappetit.com/story/milk-bread-obsession", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "Why Is Everyone So Obsessed with Milk Bread? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Is Everyone So Obsessed with Milk Bread?The fluffy white loaf from Japan is (finally) getting its due.By Elyse InamineApril 26, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Pearl JonesFacebookTwitterEmailTwenty different recipes. Six months of testing. Too many hours on YouTube. That’s how Andy Kadin taught himself to make Japanese milk bread for chefs Akira Akuto and Nick Montgomery who were preparing to open their restaurant, Konbi, in Los Angeles. A year and a half before the tiny counter serving Japanese convenience store–inspired sandwiches and pristine pastries became one of the hottest restaurants in the country, Akuto and Montgomery commissioned the Bub and Grandma’s bakery owner to create one of the most important components for their signature sandwiches. They figured it would take that long to get it right.The result is the quintessence of the style: A perfectly rectangular loaf with barely a hint of crust cut into thick, even squares. It has a milky-sweet flavor and a feathery soft texture that tears into wispy strands and melts in your mouth. It has none of the naturally leavened holes or sourdough tang that’s prized these days among bread nerds. It’s the only enriched dough (one that includes eggs, butter, and sugar) Kadin makes at Bub and Grandma’s, and Konbi is the sole recipient of the loaves baked off each morning.One of the coveted Konbi loaves.\nCourtesy of Andy Kadin/KonbiAnd while food writers (guilty!) fell over themselves to taste and Instagram all the sandos (yolky egg salad, perfectly layered katsu) at Konbi when it opened last October, Kadin experienced his own kind of fervor as well. “Many, many chefs and customers asked us to make them milk bread,” Kadin tells me. “Now I get an email every other week.”Kadin isn’t the only baker fielding these types of requests. In Seattle, Alessandra Gordon, the breadmaker for her family’s jam stand, Ayako & Family, has been hit up by local chefs, like Rachel Yang of Joule, for one-off milk bread orders. (She also helped us with this recipe we published in March.) At Pâtisserie Fouet in New York City, pastry chef Yoshie Shirakawa sells out all 36 loaves they bake each weekend by the afternoon. “We didn’t even think of putting whole loaves on the menu until we started getting a lot of requests,” Shirakawa says. “We can’t keep up our supply.”Pâtisserie Fouet's milk bread, all sliced and ready to go.\nPhoto by Hisanori HatoriAnd to meet that demand, milk bread is suddenly everywhere. It’s at modern Japanese restaurants like Konbi and Pagu in Cambridge, Massachusetts. It’s at not-at-all Japanese restaurants like Carpenters Hall in Austin and Kindred in Davidson, North Carolina. It’s at tiny take-out counters like David Chang’s Peach Mart in New York City. It’s at bakeries like Breadbelly in San Francisco and Pâtisserie Fouet. It’s at high-end, small plates restaurants like The Progress, also in San Francisco, where pastry chef Nicole Krasinski shapes the dough into hot dog buns. It’s at a slew of trendy openings like nearby Stonemill Matcha, where pastry chef Mikiko Yui makes her own milk bread because chefs like Krasinski got their colleagues obsessing over it too.To put it in restaurant trend terms, milk bread is having its “cacio e pepe” moment. It’s now become a requisite on cool restaurant menus, and it’s not going anywhere. In fact, its presence is growing.Legend has it that milk bread may have been actually invented by British baker Robert Clarke, who opened Yokohama Bakery in Japan back in 1862. At least that’s what Annie Sheng, an anthropologist studying Asian bread at Cornell University, has pieced together in her own research. But even for her, it’s hard to say when milk bread, known as shokupan (“food bread”) in Japan, officially came onto the scene. “Shokupan is a general term for a loaf you cut and slice and toast into sandwiches,” Sheng tells me. That makes it hard to tie down in an easy definition. It’s also why there’s variability among recipes.Some milk bread is made with yudane, a sandy flour-and-water paste that gives the loaf the right bounce and a longer shelf life. Others call for tangzhong, the Chinese equivalent, made of a warmed milk-and-flour slurry. Some are just a mix of flour, milk or water, sugar, salt, active dry yeast, and on occasion butter. Some loaves are shaped like a flat-topped Pullman, known as kaku-shoku in Japan, or rippled with rounded ridges in the Yamagata style. Others are kind of twisted like a corkscrew before baked. All this is to say, the method and shape may be different, but that combination of flour, some kind of liquid, sugar, salt, and yeast all lead to one thing: cottony shokupan.The closest thing to milk bread in the U.S. is bland, shaggy-textured supermarket white bread we ate as kids. It’s not a far stretch. They both have soft and pillowy insides, very little crust, and an extremely mild but crowd-pleasing flavor. That said, they have one key difference: “Typically shokupan is far more enriched, meaning it contains more fat,” says Larissa Zhou, a food scientist who worked on Modernist Bread. In her research for the groundbreaking, five-volume, 2,500-page book, she found that shokupan had nearly seven times the fat—coming from either butter or milk or both—as regular white bread.The Yamagata style at Stonemill Matcha.\nPhoto by LoriLynne RiceGenerally carbs in loaf-form arrived in Japan with the Dutch and Portuguese in the 16th century. Most Japanese households didn’t have ovens, so bread never stuck as an essential food. Instead, according to Eric Rath, a history professor at the University of Kansas and an author of a number of Japanese food history books, the Japanese considered bread a snack, which lead to a preference for sweeter bread, like the 1874 invention of adzuki bean–stuffed anpan.Around World War II, we start seeing bread as a staple in Japan, mainly because rice became scarce and expensive just as American supplies of wheat and yeast were coming in. “When rice was rationed during wartime, there was an emphasis on making bread,” Rath explains to me. “There were even recipes for patriotic breads, made with seaweed and vegetables.” By the 1950s, bread took off as rice consumption went down by 50 percent and started replacing the usual rice served alongside soup or, say, a fried pork cutlet. But it wasn’t until the late 1970s that konbini, 24-hour Japanese convenience stores, started popping up and selling sandos as we know them today.Rath and Sheng aren’t exactly sure when milk bread reached the States, but Sheng theorizes that it could have come with the birth of Japanese grocery stores like Mitsuwa in the late 1990s, followed by the arrival of Asian bakery chains like South Korea’s Paris Baguette and Taiwan’s 85 Degrees C in the early 2000s. With these places came their mass-produced versions of the flat, square milk bread that stayed perennially soft from dough conditioners and shortening. This was the milk bread I, along with many chefs and bakers I spoke to, grew up with. But it’s nothing like the kind of milk bread appearing on menus around the country right now.Pagu is beginning to experiment with local grains for its milk bread.\nCourtesy of PaguBefore the recent boom, milk bread wasn’t taken all that seriously in the U.S.—at least not in the same way that bakers have obsessed over, say, sourdough. That’s probably due in part to our limited exposure to it: All we’ve known for decades is the industrialized, additive-enhanced sandwich bread. Made with so many extras, it’s not particularly challenging or exciting to make—and in turn, not considered an opportunity to flaunt your skills as a baker. But it might also be because European-style baked goods, especially French, have long been considered the pinnacle of pastry art both for Americans (ever heard of bread bros?) as well as bakers abroad in Asia. “My mom was telling me that milk bread is not a bread. That’s what the French said in a documentary she was watching,” Yui remembers. “I think for certain people this bread isn’t considered an artisanal bread.”But now bakers, especially Asian and Asian-American ones, are reclaiming boring old sandwich bread and making it artisanal. Which isn’t as easy as everyone thought. Making a perfectly fluffy loaf requires rigorous R&D, patience, and passion. At Ayako & Family, Gordon spent months testing doughs with a Japanese pastry–trained friend to develop a recipe for milk bread that didn’t include the typical additives (dough conditioners, vital wheat gluten) used in industrial baking. Chef Tracy Chang is working with Harvard undergrads to figure out how to get more local and freshly milled grains into her milk bread at Pagu. At Breadbelly, chefs Katherine Campecino, Clement Hsu, and James Wong relied on their collective experience as pastry cooks at Atelier Crenn to reverse-engineer the milk bread they tried all over San Francisco—but without the dough extenders or highly refined white flour they saw others using. They ended up sourcing their flour from a farm in Utah through Central Milling in Petaluma, California. It took a few months tinkering with the tangzhong and the shaping technique until they finally created a milk bread that not only fulfilled their initial craving but was also something they could feel proud of.It took a lot of R&D to get to these perfect hills of dough for the Bread Belly team.\nCourtesy of Breadbelly“There are a lot of Asian-American chefs who came through high-end kitchens and are now doing their own thing, tracing back to what they grew up with and finding ways to re-create those memories and flavors, but with the resources and techniques to make it even more delicious,” Wong explains.And this new generation of chefs and their current obsession with milk bread points to something we haven’t really seen before: the glorification of an Asian bread tradition. Not noodles, not dumplings—but fluffy, everyday milk bread.“Why are people making milk bread now?” Hsu poses. “Maybe it’s because there are more Asian-American chefs. Or maybe it’s because it’s the new American bread.”Explore Bon AppétitRestaurantsTrendsBreadRead MoreMilk BreadcookingA Fruit Sando Is a Dessert Sandwich Filled with Joy and Whipped CreamBy Elyse InaminerestaurantsBreakfast at Davelle Is the Best Way to Start a Day in New YorkBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-26", "author": ["Condé Nast", "Elyse Inamine"]}