{"id": "8d38edafb1f3a0ea7ab5ca4c4767b56b", "url": "https://www.bonappetit.com/recipe/antipasti-hand-salad", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Antipasti Hand Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAntipasti Hand SaladBy Lauren SchaeferMarch 1, 20184.8(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintTo the Hand Salad Haters out there: BYE! Go look at some other recipe! Get your own food website! For those of you still here: Doesn't the idea of spooning a marinated mixture of meaty salami, salty cheese, olives, and juicy tomatoes into leaves of cold, crispy romaine sound, like, delicious?! That's because it is.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonBox Grater$13 At AmazonMicroplane$16 At AmazonSpoon$24.69 At AmazonIngredients4 servings8oz. cherry or grape tomatoes1Tbsp. red wine vinegar2oz. unsliced spicy salami2oz. Parmesan cheese¼cup Castelvetrano olives (about 8)1small garlic clove1Tbsp. extra-virgin olive oil1tsp. chopped or dried oregano1romaine heart (about 8 oz.)PreparationStep 1Cut 8 oz. cherry tomatoes into quarters. Transfer to a medium bowl, then pour 1 Tbsp. vinegar over. Let sit while you prep remaining ingredients.Step 2Cut 2 oz. salami into small pieces about ¼\" thick.Step 3Grate 2 oz. cheese on the large holes of a box grater.Step 4Pit ¼ cup olives, then cut into quarters.Step 5Add salami, Parmesan, and olives to bowl with tomatoes.Step 6Using a microplane, finely grate 1 garlic clove into same bowl.Step 7Add 1 Tbsp. oil and 1 tsp. oregano and toss to combine.Step 8Slice off bottom of 1 romaine heart and divide into leaves.Step 9Serve hearts alongside salad, using each leaf as a boat for the salad.Step 10Do Ahead: Tomato salad can be made 1 day ahead. Cover and chill.How would you rate Antipasti Hand Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis was fine, but a bit liquidy from the tomatoes and the vinegar. The flavor is a bit too punchy for me, I might even the oil to vinegar ratio out a bit more.AnonymousColumbia, SC1/11/2020Made this for a game night among friends and boy did it disappear fast. Will definitely be making this again. Maybe with some endive along side the romaine.EricPattMontréal3/18/2018Explore Bon AppétitSaladSalamiCured MeatMeatOliveOther IngredientsLettuceLeafy GreensVegetableParmesanCheeseEasyQuickStarterNut-FreeGluten-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Lauren Schaefer"]}