{"id": "8d4acdcf03fa23f53fe244ddc8f67e35", "url": "https://www.bonappetit.com/story/vermouth-bianco", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "There’s Sweet and Dry—and Then There’s Vermouth Bianco | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s Sweet and Dry—and Then There’s Vermouth BiancoIt’s complex, refreshing, and perfect for fall.By MacKenzie Chung FeganSeptember 23, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Welcome to The Pour, a monthly column about what we’re drinking right now.When I started making cocktails at home, I knew that I needed to stock my bar with two types of vermouth: dry and sweet. The brightness of dry vermouth gives structure to martinis, while sweet vermouth’s spicy, vanilla-y bittersweetness mellows out boozy Manhattans and Negronis.There is, however, a world of vermouth beyond the sweet/dry binary. In fact, most vermouths don’t fit neatly into one category—they come in colors from blush pink to honey gold. Some are spicier, some are more floral, some are nearly as bitter as amari. And what I’m reaching for now is vermouth bianco.All vermouths are made from a base of wine fortified with neutral alcohol and infused with various herbs, roots, citruses, and barks. Vermouth bianco, also known as vermouth blanc depending on its country of origin, falls somewhere between sweet and dry vermouth in terms of sweetness. Biancos vary widely since each brand has its own proprietary blend of botanicals. Buy it: Contratto Vermouth Bianco, $30 at drizly.com\nPhoto by Emma FishmanBuy it: Bordiga Bianco Vermouth, $38 at drizly.com\nPhoto by Emma FishmanDolin Blanc Vermouth de Chambery, produced in the French Alps since 1821, is a delicate, easy sipper, lightly floral and crystal clear. Just over the border in Italy, Contratto produces a citrusy, herbaceous vermouth bianco with a pale yellow hue and distinctly bitter finish thanks to wormwood and gentian root. Amber-colored Bordiga Vermouth Bianco, another Piemontese offering, is the spiciest and sweetest of the trio, with nutmeg and coriander tempered by chamomile. All three I would buy for their dramatically ornate labels alone.Hovering at 16 to 18% ABV, vermouth bianco is my ideal aperitivo—bitter enough to get my taste buds interested but not boozy enough to obliterate my palate. I sip it topped off with soda or on the rocks with a twist, olive, or sprig of whatever herb I have on hand. On autumn weekends, when it’s neither too hot nor too cold, vermouth bianco is the ultimate in-between drink.Photo by Emma FishmanDolin Blanc Vermouth$16 at DrizzlyExplore Bon AppétitVermouthCocktailShoppingThe PourRead Morecooking3 Sherry and Vermouth Cocktails That Are Low-ABV and Downright DeliciousBy Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-23", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}