{"id": "8d7bd5f0931c54b8347c5e16e6d7d287", "url": "https://www.bonappetit.com/story/presto-waffle-maker", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "The Best Waffle Maker, According to Waffles' Number One Fan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWaffles, Meet Your MakerThe best breakfast carb is waffles, and the best waffle maker is the Presto FlipSideBy Sarah JampelApril 27, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.You can improvise a deep-fryer (a heavy pot full of oil), a toaster (use your broiler—very carefully), a steamer basket (a colander or a metal rack), a wedding speech (I’m kidding, please never do this)—but you can’t improvise a waffle maker. That means that if you’re like me and you rank the trio of sweet breakfast carbohydrates as (1) waffles, (2) pancakes, and (3) French toast (too soft ’n’ soggy for me), you need a waffle maker. And the best waffle maker is the Presto FlipSide.Before you scoff at the idea of a single-use appliance that will clutter up your kitchen, consider the Platonic waffle—uniformly golden with deep syrup-catching pockets, a crisp exterior that belies a tender middle, a pock-marked texture hinting at an airy batter—and then consider that the best waffle maker will give you all of that while only taking up as much space as a box of cereal.After you ladle the batter into the Presto FlipSide, you flip the iron from one side to the other so that it travels 180°, crossing upside down through the vertical position like a gymnast on a bar, the top becoming the bottom. This elegant motion ensures that the batter is evenly distributed, contributing to uniform color, and it means that you can store the machine standing up, saving a significant amount of counter space. The Presto also comes with a timer (great for the anxious and the impatient—my people!) and nonstick plates, which means there’s no need for grease or tedious cleanup. For me the waffles that have slid out of this machine have been almost too beautiful to eat. (Refer back to “Platonic waffle” description.) But I persevered.You’ll find waffle makers on the market that will set you back a couple hundred dollars (several times the cost of the Presto). They’re shiny, they’re heavy, they come with lots of features (as in, you can select how brown your waffle gets), and they cook a large number of waffles at once. One of these fancy makers is convenient for a big family or a crowd but not necessary for my two-person household. Sure, the Presto will take some time to produce a big stack of waffles—it makes one per cycle, 5–6 minutes for each—but when I’m in a rush, well, that’s what Eggos are for.Photo by Emma FishmanPresto FlipSide Belgian Waffle Maker$55 at Amazon$73 at WalmartExplore Bon AppétitShoppingHighly RecommendToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-27", "author": ["Condé Nast", "Sarah Jampel"]}