{"id": "8d7b0373ecd6afa2ad062c38f0ba88c1", "url": "https://www.bonappetit.com/story/bidet-feud", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Everyone’s Making Baked Potatoes Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEveryone’s Making Baked Potatoes Right NowThe stats are in and our perfect baked potato recipe is topping the charts. Also: a bidet debate.By Alex BeggsMarch 28, 2020FacebookTwitterEmailChristopher BakerFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Photo by Laura Murray, food styling by Kat BoytsovaNecessitiesWe got the grocery list for an elderly neighbor upstairs: Pepperidge Farm seeded rye, the latest expiration date possible. A box of Kind bars (any type without milk chocolate). 1 package late expiring bacon. Bag of carrots. 2 red Holland peppers. 1 hard avocado. Saltines. 3 endives if they look ok. 3 potatoes (red, if they’re hard, not old and mealy; otherwise, russets).I had to Google what a Holland pepper was (oh, a bell pepper). But I thought the list was charming, and comforting. It was essential and brief, unlike my list, which was frantic and long, anticipating ten days’ of ambitious cooking projects I’ll probably get to half of. Homemade ravioli? Really?? Will I??? Or is this as much of a ruse as my delusional promise to Aliza Abarbanel I’d come out of this isolation with a six-pack?(Is my neighbor making red pepper and potato sabzi, I wonder! Get the recipe here.)Alex LauThe soup I can’t sayAvgolemono. (My Greek friend says it’s pronounced uv-go / lemon-o, emphasis on the first half. Please don’t tell me if this is wrong.) We made Rick Martinez’s recipe for the Greek lemony chicken and rice soup this week and it’s a good soup. Not sure what else to say. It’s soup.Get the recipe: Lemony Chicken and Rice SoupA prom requestThis week, the Test Kitchen team raised over $70K for No Kid Hungry on Cameo, an app where people pay to get personalized video messages from celebrities (feels weird to type that, but I guess it’s true?!). Christina Chaey asked a teenager to prom. Chris Morocco got to tell a young girl that she is getting a puppy for her birthday next week (!). Someone asked Molly Baz to tell his friend it was time to retire his ratty yellow high school t-shirt. “I was also asked to yell TRANS RIGHTS,’” which I did proudly from my back deck,” said Carla Lalli Music.Photo by Emma Fishman, Food Styling by Yekaterina Boytsova When you’re sick of cookingWith millions of people at home cooking way more than usual comes a condition I call “Sick of Cooking.” It’s exhausting! The dishes! The splatter! The smoke alarm’s going off again! So I just want to remind you that frozen pizzas exist. I made nachos for dinner one night to eat in front of the TV watching Tiger King (Carole def fed her husband to the tigers) and was excessively happy. Make popcorn. A tin of sardines on mayonnaise-d toast. A peanut butter milkshake. Frozen waffles and jam. Wash your plate in the morning.A few more lazy ideas here.Which brings us toOur most popular recipe of the week, due to strong Google results, was for a baked potato. Lots of baked potato action happening in the world right now. (If that’s boring to you, though, I made Carla’s steamed sweet potatoes with tahini butter this week and then used extra tahini butter on...cabbage? It works, trust.)Get the recipe: Perfect Baked PotatoIf H-E-B ran the worldWe’d all be better off. A story in Texas Monthly about how the grocer H-E-B has been preparing for a pandemic SINCE 2005 is astonishing. Imagine...if...our...government…Read it: How H-E-B Planned for the PandemicUnnecessary meme of the weekUnnecessary food feud of the weekCourtesy of TushyThis week, MacKenzie Fegan wrote about her TUSHY, a bidet you can attach to your toilet for a mere $79. “If you had something dirty on your hands, wouldn't you rather wash them in the sink than wipe them off with 2-ply paper?,” she wrote, convincingly. Well, I’m still irrationally afraid of bidets (like, maybe it will power wash me off the toilet entirely? I dunno!). So is Sarah Jampel. “I feel like I need an explainer, or is it just terribly obvious how to use one?” asked a curious Chris Morocco.But many staff have embraced the TP-free lifestyle. “Bidets are beautiful examples of modern innovation,” commented Jesse Sparks definitively. Hilary Cadigan “has been pitching the Bum Gun for YEARS,” she said, though I wonder about that branding. She talked Sohla El-Waylly into buying one. “If your bidet can't access warm water,” warned experienced Christa Guerra, “you’re in for a shock.”Molly Baz drifted off into fond memories of bidets past: “Used to have one, no longer do, think about it every single day of my life,” she sighed. Joseph Hernandez “literally ordered a TUSHY last week,” to which MacKenzie replied, “Did you get the classic or the SPA?”Others remained suspiciously silent.What say you, readers?Explore Bon AppétitBeggs NewsletterRead MorecultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex Beggscooking10 Tips For Keeping Produce Fresh Until Your Next Trip to the Grocery StoreBy Caroline LangeLifestyleHow to Turn One Blender Sauce Into a Week’s-Worth of Delicious MealsBy Aliza AbarbanelCoronavirus7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstBy Caroline LangeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-28", "author": ["Condé Nast", "Alex Beggs"]}