{"id": "8d88ed6592144abf0bffdbd7268cb4d5", "url": "https://www.bonappetit.com/story/best-wellness-products-2021", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "The Best Wellness Products of 2021, According to You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Wellness Products of 2021, According to YouA silky-rich green latte, comfy kitchen footwear, and the LED light that saved everyone’s plants.By Tiffany HopkinsDecember 21, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Here’s something that isn’t that surprising: Bon Appétit readers drank a lot of coffee in 2021 (these coffee subscriptions helped you stay caffeinated). Something that’s a little more surprising? In addition to air fryers and Dutch ovens, your favorite kitchen accessories this year were kind-of-ugly slippers.I love how end-of-year findings perfectly encapsulate the past 12 months. And after delving into BA's top wellness products of 2021, I realize that a lot of you prioritized comfort (those ugly-but-cute kitchen slides), new hobbies (like growing your own herbs indoors), and nostalgia (by sipping the beverage your mom used to make). If you’re looking for a home addition or putting together a care package (even and especially for yourself) that maximizes coziness and health, these are the products everyone already loves.GrowLED Umbrella Plant Grow LightI’ll always remember 2021 as the year we blossomed from plant noobs to mid- and top-level gardeners, the year our fiddle-leaf figs and majesty palms went from frail and struggling to lush and thriving. For this, we have a lot of people and things to thank, like the expert greenthumbs on Instagram who offered gardening advice and this adorable LED light that brought our plant babies back to life.GrowLED Umbrella Plant Grow Light$28 $22 at Amazon$22 at WayfairAeroGarden SproutWhile some of you spent your time nourishing your plant children back to life, the rest of you focused on cultivating plants you could eat. You got your hands on the compact, super-sleek AeroGarden Sprout, an indoor garden system for growing everything from hearty greens to hot peppers.Photography by Isa Zapata.  Prop Styling by Paige HicksAeroGarden Sprout$100 $70 at AeroGarden$100 $70 at AmazonOOFOS SlippersOur readers love some good ol’ kitchen footwear. In 2019, you favored these leather clogs. In 2020, you moved on to rubber clogs. And this year, you fell in love with OOFOS foam slippers. These plush, comfy, and machine-washable slides help improve balance and posture and create a slight rocking motion as you walk. They also have a grandma aesthetic, which I hear is in right now.OOFOS Slides$54 at Amazon$60 at Nordstrom$60 at OofosBrightland Digestif CandleI might love garlicky fried rice, but I’m not a fan of its lingering aroma after I’m done eating it. Lucky for me and those of you who feel the same, it’s easy to eliminate potent food smells with Brightland’s Digestif Candle, which has subtle notes of orange blossoms and fresh grass.Brightland Digestif Candle$42 at BrightlandKola Goodies’s Super Green LatteThis shortcut blend relies on organic coconut milk powder, oat milk powder, gotu kola, moringa, and cinnamon to recreate kola kanda, the traditional Sri Lankan beverage that’s herbal, rich, and mossy green. Just stir two tablespoons of the mix into a cup of hot water or warm coconut milk for a morning energy boost.Photo by Emma FishmanKola Goodies’s Super Green Latte$26 at Kola GoodiesWellnessMats Original Anti Fatigue Floor CushionEven with your new OOFOS, you (like BA senior cooking editor Sarah Jampel) still need an anti-fatigue kitchen mat. She highly recommends the WellnessMats Original Floor Cushion: It’s squishy but not too soft and easy to clean.Photo by Emma FishmanWellnessMats Original Anti Fatigue Floor Cushion$150 at AmazonHamama Green Onion Grow KitPeople on TikTok make growing green onions in mason jars look foolproof—it’s not. We learned that the hard way, and BA readers were better for it. You took our advice and got Hamama’s Green Onion Grow Kit, which comes with a perforated lid, reusable grow tray, coconut mats, and easy-to-follow instructions. Plus, it’s really prettyyyyy.Green Onion Grow Kit$49 at HAMAMA$49 at Amazon$49 $39 at The GrommetTinkle Facial RazorFrom removing cheek fuzz to shaping eyebrows to trimming bangs, the benefits of keeping this inexpensive, pen-sized facial razor in your pocket are abundant. As the Tinkle shears fine hair, it also provides gentle exfoliation that husks away dead skin. Not to mention it makes a great, albeit slightly awkward, gift.Dorco Tinkle Eyebrow Razor$5 at Amazon (6 razors)$5 at Tinkle USA (6 razors)AshaPops Popped Water Lily SeedsIf you didn’t get into this fluffy, flavorful popcorn dupe in 2021, we suggest you do in 2022. According to Ayurvedic traditions, water lily seeds have anti-aging and anti-inflammatory properties and have been consumed throughout India for thousands of years. Find these puffed seeds in a variety of flavors like vegan cheese, chili lime, turmeric, and dark chocolate.AshaPops Variety Pack$20 at AshaPopsKinfield Golden Hour Natural Bug SprayThis natural bug spray showed us that we don't have to choose between covering our skin in harsh chemicals or getting eaten alive by mosquitos every time we dine al fresco. It features Indonesian citronella, vanillin, and cloves, so you can keep the bugs away and smell good, too.Photo by Emma FishmanKinfield Golden Hour Natural Bug Spray$22 at Grove Collaborative$22 at Thrive MarketExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-21", "author": ["Condé Nast", "Tiffany Hopkins"]}