{"id": "8d962e3795eb8406f573d7ad390ee49c", "url": "https://www.bonappetit.com/recipe/spaghetti-with-lobster-pomodoro", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Spaghetti with Lobster Pomodoro Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSpaghetti with Lobster PomodoroBy Che Fico, San Francisco, CAAugust 14, 20183.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintNduja, a spicy salami now produced domestically, blends cured pork fat and chiles in a spreadable, meltable consistency. Combining it with lobster is transformative, taking this basic pasta Pomodoro to the next level. This recipe is from Che Fico in San Francisco, CA, our No. 7 Best New Restaurant 2018.Ingredients4 servingsKosher salt21¼-lb. live lobsters2Tbsp. extra-virgin olive oil2Tbsp. ghee or unsalted butter¼small red onion, thinly sliced3garlic cloves, thinly sliced2sprigs basil114-oz. can whole peeled San Marzano tomatoes12oz. spaghetti4oz. nduja, broken into small piecesTarragon and parsley leaves (for serving)PreparationStep 1Bring a large pot of salted water to a rolling boil. Working one at a time, cook lobsters 3 minutes, then transfer to a large bowl of ice water. Let cool just until you can comfortably handle them, about 1 minute.Joe WilsonStep 2Twist off claws where the knuckles meet the body (it's easier than you think—just twist!).Joe WilsonStep 3Return claws to pot of boiling water. Cook 2 minutes (leave bodies in ice water). Add claws back to ice water and let both claws and bodies cool completely. (The lobsters are intentionally undercooked at this point but will finish cooking in the sauce.) This method cooks the meat just enough to easily separate it from the shell, so it's ready to be reheated in the sauce with tender results.Joe WilsonStep 4Remove bodies and claws from ice water. Twist tails off bodies with your hands; discard heads (you won’t get enough meat to make it worth your time). Working with 1 tail at a time, place on a cutting board and, using a chef’s knife or cleaver, cut lengthwise all the way through tail in one motion. You should now have 2 even halves. Remove any tomalley or eggs from tails and discard. Remove meat from shells; discard shells. Using the back of a cleaver or a lobster cracker, crack claws on all sides and pick out meat; discard shells. Cut tail and claw meat into bite-size pieces. Place in an airtight container; cover and chill until ready to use.Step 5Heat oil and ghee in a large skillet over medium. As soon as ghee is melted, add onion and a pinch of salt and cook, stirring occasionally, until softened, about 5 minutes. Add garlic and cook, stirring occasionally, until garlic is very soft, about 5 minutes. Add basil and as soon as it is wilted, add the tomatoes, crushing well with your hands as you go. Bring to a gentle simmer and cook sauce until thick and flavors have melded, 20–25 minutes. Season sauce with salt and pluck out basil.Step 6Meanwhile, cook pasta in another large pot of boiling salted water, stirring occasionally, until very al dente (about 1 minute less than package directions).Step 7Using tongs, transfer pasta to skillet with sauce, then add nduja and a splash of pasta cooking liquid and reduce heat to medium-low (high heat can cause the sauce to break). Cook, tossing gently and adding splashes of pasta cooking liquid as needed to get sauce to cling tightly to pasta, until sauce and nduja are combined, about 1 minute. Taste and season pasta with salt if needed.Step 8Add chilled lobster meat to pasta and cook, tossing gently, just until lobster meat is warmed all the way through, about 2 minutes.Step 9Divide pasta among bowls and top with tarragon and parsley leaves.Photo by Alex LauStep 10Do Ahead: Lobster can be cooked 1 day ahead; keep chilled. Tomato sauce can be made 3 days ahead. Let cool; cover and chill. Reheat over medium before using.How would you rate Spaghetti with Lobster Pomodoro?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGREAT recipe; and thanks for introducing me to nduja.  In a pinch, recipe can be made with frozen lobster tails.  Now if only I could figure out how to kill the tarragon humanely ...jamespdoranjr4708Everywhere and no where8/31/2019PLEASE Bon Appetit. Show some PETA-level empathy about animal cruelty.  Pushing a live lobster into boiling water is unacceptable!  Have you not studied up?  You can place a live lobster in cool water and gradually raise the heat. Lobster sleepily is cooked.  Actually humane. I was actually Stunned that you're advocating to your entire readership to boil a live animal.sarah@adventurous.comSan francisco1/23/2019Explore Bon AppétitPastaItalianEuropeanItalian AmericanAmericanLobsterShellfishSeafoodBasilHerbs & SpicesSpaghettiPasta & NoodlesMainSimmerSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Che Fico", "San Francisco"]}