{"id": "8d9f0fea4af571d4b89a8b5e524b91d5", "url": "https://www.bonappetit.com/story/best-containers-leftovers", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "The Best Food Storage Containers (2022) for Leftovers, Meal Prep, and Bulk Goods | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Food Storage Containers for Leftovers, Meal Prep, and Bulk GoodsOur editors’ favorite ways to repackage food and keep it fresher, longer.By Elaheh Nozari and Tiffany HopkinsJanuary 11, 2022FacebookTwitterEmailChelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Just like there’s the perfect cup for every saucer and an ideal knife for every chef, there’s the best food storage container for every leftover, prepped lunch, and bulk item—because you can’t store a chicken carcass in a mason jar, and while you could keep soup in a single-use zippered sandwich bag, don’t. To find out the ideal vessels for storing every imaginable type of food, we sought out the wise advice of our test kitchen editors past and present, a group of people who know their way around leftover sauces, stews, and grains. Below are their favorite containers for repackaging food to keep it fresher, longer.Real footage of your kitchen, before reading our advice.\nFor meat, fish, and pasta: glass containersTypical weeknight dinner situation: You made too much pasta with red sauce (on purpose) and you’re meting out the leftovers for tomorrow’s lunch. Skip the plastic containers and go with glass ones. You need a nonporous material that won’t turn a faint shade of red post-tomato sauce and an airtight seal so nothing leaks. Former senior food editor Anna Stockwell recommends the Oxo Good Grips Smart Seal glass food storage set because of its tight locking lids and silicone gaskets: “They seal really well, are freezer-safe, and easy to clean. Plus, they're made of oven-safe borosilicate glass,” which makes reheating leftover lasagna that much easier. Food director Chris Morocco is also team glass “for frankly any food,” but he’s loyal to GlassLock containers which come in a range of sizes and have strong snap-on latches.OXO Good Grips Smart Seal Glass Food Storage Container Set$33 at Amazon (Set of 4)$68 at Amazon (Set of 8)Glasslock Oven Safe Container Set$52 at Amazon (Set of 9)For freezing soups and stocks: plastic deli containersIn our humble opinion, some of the best food storage containers with lids—or at least the best plastic ones—are practically free. “I use deli containers recycled from Indian food delivery, pickles from Russ & Daughters, and leftovers from the test kitchen,” says former food director Carla Lalli Music. They’re cheap, reliable, and standard in many restaurant kitchens for good reason. They're stackable and, best of all, the same lid fits quart, pint, and half-pint containers alike. If you don’t order enough takeout to accumulate a proper stash, a set of 44 containers will run you $24.DuraHome Food Storage Containers with Lids$32 $23 at Amazon (Set of 44)Although whether plastic containers are microwave and dishwasher safe is a matter of debate (we recommend hand-washing, but if you're going to toss them into the dishwasher, at least use the top rack), we love them for freezing; the quart size is perfect for storing big batches of stock in portions that are convenient for most recipes. We like to label ours with the contents and date using masking tape and a Sharpie. For maximizing refrigerator space: square deli containersOur test kitchen staff may be hopelessly devoted to standard deli containers for their convenience, price, and stacking capabilities, but there’s one thing we can’t ignore: Their cylindrical shape wastes a lot of space on refrigerator shelves. Square plastic food storage containers, on the other hand, can be packed into fridges, freezers, and pantries in a more snug fashion. It’s simple geometry! Senior editor Sarah Jampel loves these space-saving, BPA-free plastic square containers with leakproof lids. “They have all the benefits of cylindrical deli containers—lightweight, affordable but not disposable—and they also nestle into my shelves like puzzle pieces,” she says. They come in sets of 20, which makes them amazing meal prep containers.Photo by Isa Zapata, Food Styling by Pearl Jones16-oz. Square Clear Deli Containers with Lids (Set of 20)$25 at AmazonFor dressings, grains, and sauces: glass jarsA food storage container set that doubles as a set of drinking glasses? Count us in. “I have a jar hoarding problem and save most coconut oil/ghee/peanut butter/jam jars for storing salad dressings and uncooked rice,” says Lalli Music. Wide-mouth canisters are great for grains while smaller half-cup containers will do just fine for sauces and dressings.Ball Wide Mouth Mason Jars, 16 oz$40 at Amazon (set of 12)Ball Regular Mouth Mason Jars, 4 oz$23 at Amazon (Set of 8) Stockwell replaces the two-part canning lid on Mason jars with these plastic tops, which are easier to clean and make it less likely that your vinaigrette will leak all over your lunch box.Ball Leakproof Mason Jar Lids$11 at AmazonFor sandwiches, snacks, and doughs: reusable food storage bagsThese eco-friendly Zip Top bags helped Jampel kick her longtime habit of cleaning, drying, and reusing plastic zipper storage bags. Made with a thick-but-flexible silicone and equipped with flat bottoms, Zip Top bags are durable, leakproof, and can stand upright without flopping over. Use them for anything you’d typically use a plastic bag for: freezing fruits and veggies, decanting almost-empty pasta boxes, or even holding liquids.Photo by Emma FishmanReusable Zip Top Storage Bags (Set of 3)$48 at Amazon$48 at HiveRecipe production assistant Mehreen Karim is a fan of these reusable Stasher bags, which have a super tight seal. She uses them for everything from packing sandwiches to saving cookie dough. Both Zip Top and Stasher bags come in a variety of sizes and are dishwasher-safe, microwave-safe, freezer-safe—but most importantly, they make great sustainable alternatives to single-use plastic bags.Photo by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)For bulk storage: large plastic airtight containersAn extreme baking hobby becomes a lot more convenient when you’ve got an 8-quart Cambro container full of flour on deck. Senior staff writer Alex Beggs keeps one on her countertop for her 10-pound bag of King Arthur's all-purpose flour—and since they come in a number of different sizes, she stacks a 6-quart Cambro filled with granulated sugar right on top. 8-Quart Cambro Square Food Storage Container With Lid$31 $30 at AmazonThese containers also work wonders for storing bulk portions of other dry goods like lentils, beans, and grains. If you’re one to buy 20–25-pound bags of rice, Beggs recommends this 13.21-quart Tellfresh airtight container, which has a hefty handle.13.21-Quart Tellfresh Large Airtight Superstorer$28 at Container StoreFor cooking oils: plastic squeeze bottlesStocking up on a giant tin of Frantoia olive oil is a great investment, but it’s almost impossible to pour a tablespoon straight from its container. You could transfer the oil to a fancy cruet, but a humble squeeze bottle is your best bet for everyday cooking. The flexible plastic is clear, which could potentially make the olive oil go rancid more quickly, but if you’re cooking with olive oil a couple times a day you’ll go through the bottle faster than you think.16 Oz. Squeeze Dispensers$20 $18 at Amazon (Pack of 6)This story was originally published in 2017 and was updated by Tiffany Hopkins in 2022.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-08-08", "author": ["Condé Nast", "Elaheh Nozari", "Tiffany Hopkins"]}