{"id": "8da4629d68cda35e6965f9092006ebd9", "url": "https://www.bonappetit.com/story/camins-2-dreams-wine", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "A Tale of Two Women, One Winery, and Some of California's Most Coveted Bottles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Tale of Two Women, One Winery, and Some of California's Most Coveted BottlesMireia Taribó and Tara Gomez are breaking glass ceilings, dismissing stereotypes, and mentoring the next generation of winemakers through Camins 2 Dreams.By Victoria JamesSeptember 21, 2021FacebookTwitterEmailMireia Taribó and Tara Gomez (left) in the fieldsPhoto by Zachary GrayFacebookTwitterEmailIt wasn't love at first sight when Mireia Taribó and Tara Gomez met 15 years ago in California. “Kind of the opposite,” Taribó says with a laugh. They worked at J. Lohr Vineyard & Wines in Paso Robles, Gomez as the enologist and lab manager and Taribó as a cellar and barrel intern. After finishing her work in the barrel room, “she would come and disrupt the lab,” Gomez says of Taribó. Then one day, Gomez said to her, “Hey, you want to learn something? Follow me.”Unsure, Taribó followed Gomez around the back of the winery to a small space where Gomez was making wine under her own label, Kalawashaq’ Wine Cellars. Named for the village where her ancestors from the Chumash tribe once lived, this was Gomez’s small, self-funded passion project. Working at J. Lohr paid the bills, but she’d always wanted something that was her own. Gomez handed Taribó a beer from the fridge and told her, “Okay, let’s get to work.”Soon Gomez was picking her up every morning at 4 a.m., before their shifts began at J. Lohr, to help with punchdowns (pushing the grape skins in tanks into the juice) at Kalawashaq’. When Taribó’s internship ended four months later and she returned home to Catalonia, the two kept in touch, and years later, arranged to work at the same winery in the Spanish Pyrenees mountains, Castell d’Encus. (Kalawashaq’ Wine Cellars was put on hold.) They ended up visiting wineries all over the world together. Slowly, something started to blossom—not just a working relationship but a romantic one.The 2020 Graciano, floral with a fruity finish\nPhoto by Zachary Gray“That’s how we came up with the name for our own winery, Camins 2 Dreams. Camins means ‘path’ in Catalan, so it’s ‘the path to our dreams,’” Gomez explains. “All of the paths we’ve followed have led us here to my hometown.” Gomez still had the license for Kalawashaq’, but the two wanted to focus on creating something new that represented both of them. After a whirlwind wedding and with additional funding from their parents, they were able to move the winery to Lompoc, south of Paso Robles, and rebrand it as Camins 2 Dreams, opening the tasting room to the public on June 21, 2019.Their winemaking style is very hands-off: They ferment with natural yeasts and don’t do any fining—adding agents to clarify the juice— or filtering. The result is wine that conveys a sense of place. Unlike many of their neighbors whose wines are chemical concoctions of colorings, added acidity, and gloopy gobs of Mega Purple, their wines represent terroir. They’re truly Californian, with intensity coming from the striation of soils and exposure to sunshine, and freshness hailing from the cool climate of the unique transverse valley. “You’re never going to understand a person until you understand where they come from,” Taribó says. All of the best winemakers in the world recognize this important parallel, and the truly personal nature of Camins 2 Dreams has contributed to its cult following. The wines have been picked up by distributors in major cities like New York and featured in some of the city’s most iconic wine shops and on wine lists of Michelin-starred restaurants, including the one I work at, Cote.Before the Camins 2 Dreams wines were even imported to New York, I’d heard of Gomez and the vineyard land that the Chumash tribe had purchased in Santa Ynez through my husband, who was selecting fruit from the vineyards for his winery project, Railsback Frères. On my next visit to California, I reached out to Gomez and she graciously met me at the Lompoc tasting room for her tribe’s wine, Kitá. Though the wines were delicious, it was this little side project, Camins 2 Dreams, that was electrifying. That was two years ago, and now it seems as if more of America has fallen in love with not only the wines but the women behind the project.Garnacha that Camins 2 Dreams will harvest soon\nPhoto by Zachary GrayWhile many neighboring wineries in Santa Barbara County are producing the easier-to-sell Pinot Noir and Chardonnay, Taribó and Gomez have hung their hats on more obscure varieties such as Graciano. It’s a bold choice that speaks to their conviction to follow their own path, despite how difficult it is in the wine industry.Vineyard workers question their decision of when to pick the grapes, consumers make offhand comments about Indigenous people and alcoholism, and distribution in other markets is almost impossible to secure unless one is a part of the homogenous inner circle of wine. Taribó is used to the fight—“I come from a culture that’s been fighting for independence from our Spanish neighbors,” she says—but acknowledges that this is nothing compared to what Gomez has faced. “I just can’t get a break,” Gomez says. “The first thing people see is my skin color.” Despite the opportunities she was given to attend private school and to study enology thanks to financial support from her tribe, Gomez felt alone. She was one of two women in the program and the only Indigenous person. “I feel like a statue in a museum. That’s how people perceive me, and it hurts,” she says.Still, they are proud of their roots, and the path they have paved helps other marginalized groups find a way into the industry. Gomez and Taribó mentor several up-and-coming enologists, and many of them finally see themselves reflected. In the old boys’ club of wine, it’s rare to meet women in positions of power—let alone two women married, one Indigenous and one who has immigrated, with their own business. As of 2020 just 14 percent of California’s producers had a woman winemaker, according to a study by Santa Clara University. “We want to be able to represent and be a support group,” Gomez says, “to show people that we fought for this and look, we’ve made it. So you can too.”Explore Bon AppétitCultureCaliforniaWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-21", "author": ["Condé Nast", "Victoria James"]}