{"id": "8db0eeeec6c38d846078da51a67774ce", "url": "https://www.bonappetit.com/story/nutella-brownies", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "3-Ingredient Nutella Brownies Are Way Better Than Normal Brownies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3-Ingredient Nutella Brownies Are Way Better Than Normal BrowniesSabrina Snyder’s genius recipe requires just a handful of ingredients. (One of them is Nutella.)By Ali FrancisOctober 12, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Endless time at home offers little to look forward to. Another round of Cards Against Humanity, which, I have learned the hard way, is not a two-player game. The last passion fruit La Croix, left over from a mixed pack. The feeling of warm laundry fresh from the dryer. But, after a long day, there is one activity I truly relish: The slow post-dinner shuffle from table to couch, into which I sink, both wired and exhausted, with my favorite dessert. It’s a three-ingredient Nutella brownie, cut into nine bite-size squares that I can pop into my mouth like they’re plump grapes and I’m a slovenly Greek goddess.Speaking of lazy, I found the recipe flicking through Sabrina Snyder’s new cookbook, Dinner Then Dessert, which appealed to me because all of the comfort food recipes—like Tomato-Balsamic Pulled Pork, Slow Cooker (!) Spaghetti and Meatballs, and S’mores Cups (OMG)—call for just three, five, or seven ingredients. Unlike many of my colleagues (don’t tell them, okay?), who will toil in the kitchen for hours making elaborate baked goods like the good food editors they are, I would much rather buy a jumbo Toblerone and call it a night. But the brownies? They’re made from only flour, Nutella, and eggs—and take 40 minutes max, including bake time.Dinner Then Dessert$30 $22 at AmazonLike earth’s layers, they’re a textural masterpiece: crispy-crackly crust, chewy mantle, and rich, fudgy core. Imagine a spoonful of Nutella, but doughier. And handheld. And equally impossible to stop eating. They’re satisfying, impressive, and better than anything I could buy—or coax from the dusty boxes of brownie mix I’ve had in the cupboard since 2014. Better yet, one batch makes 16 jumbo or 20 average-size brownies, which means I always have a stockpile in the fridge. My little cubes of hope, joy, salvation, SUGAR!Here’s how to make them:Preheat your oven to 350°F. Line a 9x13\" baking dish with parchment paper and then spray with baking spray. (Helpful hint: I also sprayed my baking dish before lining it with the parchment paper to help stick it down.) If this feels like a BIG pan for brownies, trust the process. It’ll all work out in the end.Add 5 eggs to a large mixing bowl and whisk them together. Be careful to entirely remove the foil top on a 26.5 oz jar of Nutella before microwaving it for 30 seconds to a minute, which helps melt the spread and make it easier to work with. Add the Nutella to the eggs, scraping out the jar with a little spatula, and mix until fully incorporated. (A set of electric beaters worked like a treat here.) Add 1 cup all-purpose flour and lightly mix until no streaks are visible.Pour your Nutella batter into a baking dish. At this point I went rogue and added a sprinkle of kosher salt all over the top (highly recommend) before transferring the brownies to the oven. Bake them for 22–24 minutes. To test their readiness: stick a toothpick into the middle. If it comes out clean, they’re done. If not, put them back in for another 2–3 minutes. Let cool completely before dividing (and subdividing) to your preferred brownie size.While the idea of forking into a still-warm brownie sounds incredibly romantic, my preferred way of eating these squares of joy is straight from the fridge. After fully chilling out, they’re harder and chewier—like actual fudge—and the flavors seem richer. You can store your leftovers in the fridge for up to a week, or in the freezer for God knows how long (about three months). Bust one out whenever you need a little jolt of happiness—or anytime you think to yourself, Wow, it sure would be nice to go out for a change. Oh, and look at that! I finished my last Nutella brownie while typing this. Sixteen big ones, coming right up.Explore Bon AppétitIt's That SimplecookingRead MorecookingMacaroni and Peas Is the Desperation Meal That Always SatisfiesBy Maddy Sweitzer-LammecookingThis Creamy Red Pepper Pasta Sauce Basically Makes ItselfBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-12", "author": ["Condé Nast", "Ali Francis"]}