{"id": "8dbd7599aa13b54ad35bfeaa63806332", "url": "https://www.bonappetit.com/recipe/dakgalbi", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "Dakgalbi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDakgalbiBy David JooDecember 13, 20205.0(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrint“I first had the pleasure of eating dakgalbi when I was in grade school during one of our family trips to Korea,” writes recipe developer David Joo. “While looking for a place to eat, we stumbled upon a dakgalbi-jjip (dakgalbi restaurant). The owner brought out a large skillet with all the ingredients and cooked it right in front of us. Instantly, I was hooked on the experience of the food being cooked at the table, as well as the amazing balance of sweet, salty, and spicy. After we had eaten about two-thirds of the dish, my mom exclaimed bap chuga-yo, which means ‘please add rice.’ The owner told us to stop eating and proceeded by bringing a big bowl of rice, which she then fried with the remaining dakgalbi in the skillet.” If you have about 2 cups leftover cooked short-grain white rice, you can do this too: Leave 1 cup dakgalbi in the pan, add rice, and stir-fry to make fried rice. Serve topped with dried seaweed and drizzled with sesame oil.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonChef's Knife$34.53 At AmazonBlender$32 At AmazonCutting Board$10 At IKEASpoon$24.69 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At AmazonLarge Saucepan$60 At AmazonWooden Spoon$6 At AmazonColander$11 At AmazonIngredients3–4 servings¼medium white onion11\" piece ginger3garlic cloves5Tbsp. gochujang (Korean hot pepper paste)3Tbsp. unseasoned rice wine or dry sherry2Tbsp. raw or light brown sugar2Tbsp. soy sauce1Tbsp. gochugaru (Korean red pepper powder)1tsp. mild Korean curry powder (preferably Ottogi; optional)1lb. skinless, boneless chicken thighs and/or chicken breasts¼small green cabbage1small sweet potato (about 4 oz.)20perilla, shiso, or Thai purple basil leaves, divided18fresh or frozen rice cakes, preferably cylindrical shaped½tsp. plus 3 Tbsp. extra-virgin olive oil or vegetable oilSsamjang and kimchi (for serving)12lettuce leaves (for serving)PreparationStep 1Make the marinade: Finely chop ¼ medium white onion. Peel one 1\" piece ginger with a spoon. Smash 3 garlic cloves and remove skins. Slice ginger and garlic. Transfer to a blender and add 5 Tbsp. gochujang (Korean hot pepper paste), 3 Tbsp. unseasoned rice wine or dry sherry, 2 Tbsp. raw or light brown sugar, 2 Tbsp. soy sauce, 1 Tbsp. gochugaru (Korean red pepper powder), and 1 tsp. mild Korean curry powder (if using). Purée on high until a loose paste forms (this may take up to 2 minutes depending on your blender). Transfer marinade to a large bowl.Step 2Cut 1 lb. skinless, boneless chicken thighs and/or chicken breasts into 1\" cubes, add to marinade, and toss to coat. Cover bowl and chill at least 30 minutes and up to 36 hours.Step 3Meanwhile, slice ¼ small green cabbage as thinly as possible. Peel 1 small sweet potato, halve lengthwise, then slice crosswise into ¼\"-thick half-moons. Trim stems from 8 perilla, shiso, or Thai purple basil leaves, then cut leaves into quarters.Step 4If using fresh rice cakes, place 18 rice cakes in a large bowl and pour in water to cover. Soak until rice cakes are soft, 7–10 minutes. Drain well in a colander. If using frozen rice cakes, bring a large saucepan or small pot of water to a boil and drop 18 rice cakes into pot, stirring constantly to make sure they don’t stick together. Cook 1 minute, then drain well in a colander. Drizzle ½ tsp. extra-virgin olive oil or vegetable oil over rice cakes and toss to coat (this will prevent them from sticking together).Step 5Heat remaining 3 Tbsp. extra-virgin olive oil or vegetable oil a large skillet over medium. Combine chicken and any remaining marinade, cabbage, sweet potato, and rice cakes in skillet and cook, stirring often, until chicken is cooked through and sweet potato is tender, 15–17 minutes. Add quartered perilla leaves and cook, stirring, until slightly wilted, about 30 seconds.Step 6Dakgalbi is usually eaten as ssäm-style: To assemble one, place one of the remaining 12 perilla, shiso, or Thai basil leaves on top of one of the 12 lettuce leaves, then top with a small dollop of ssamjang, kimchi, and using chopsticks, add a piece of chicken, sweet potato, and rice cake for the perfect bite—or create ssäm to your preference!How would you rate Dakgalbi?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI make this recipe without the rice cakes-- it's impossible to find where I am-- and instead serve with extra rice topped with furikake. I've made this about four or five times now-- it's excellent! I use sesame oil in place of olive oil. AnonymousCape Cod, MA4/3/2021This is incredibly complex in flavor and texture and we loved it! However, I purchased cylindrical rice cakes from the refrigerated section of our Korean market and could not soften them enough to eat, they remained too chewy. Any ideas?LindaPort St. Lucie, Florida2/7/2021never able to print recipe.  need to print, cant make w/o recipe!  so cant do review!\nAnonymouswashington1/1/2021Great recipe! I lived in Seoul and this hit the spot. Makes good leftovers too if you don’t use rice cakes which don’t reheat well. I doubled the portion and only used rice cakes on the portion we had for dinner. AnonymousAustin, TX12/25/2020Wow! This was such a good recipe. We went to our local asian grocer to pick up many of the ingredients and I think that really made it stand out even more. The flavor is complex and savory-sweet. It's not too spicy, so there is room to increase that after cooking if you want. We served in Boston lettuce leaves and with local kimchi. Definitely baby thai basil, too. Carter12/24/2020@Ren: Nope - it's a quarter of the whole vegetable! Anonymous12/16/2020Is the 1/4 onion and cabbage supposed to be 1/4 cup?RenNyc 12/16/2020Explore Bon AppétitKoreanEast AsianAsianKorean Rice CakeNoodlePasta & NoodlesChicken ThighChickenPoultryChicken BreastGreen CabbageCabbageLeafy GreensVegetableSweet PotatoPotatoEasyOne-Pot MealsWeeknight MealsMainDairy-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-13", "author": ["Condé Nast", "David Joo"]}