{"id": "8dc6fa440ba5fbebebb1bc5a31e39ecd", "url": "https://www.bonappetit.com/recipe/grilled-pork-chops-with-plums-halloumi-and-lemon", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Grilled Pork Chops with Plums, Halloumi, and Lemon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueGrilled Pork Chops with Plums, Halloumi, and LemonBy Claire SaffitzJuly 10, 20184.7(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintBring all your ingredients out to the grill on a baking sheet for easy cleanup later.  If you like feta, you should get to know Halloumi, a Cypriot cheese sold at Greek markets, specialty food stores, and some supermarkets. Smooth, oiled grill grates will keep the cheese from sticking. And keep a close eye on the plums as they cook; you want them to be soft and just slightly jammy, not mushy.Ingredients4 servings 4Tbsp. extra-virgin olive oil, divided, plus more1tsp. honey4bone-in pork rib chops (about 1\" thick), patted dryKosher salt, freshly ground pepper4ripe medium red or black plums (about 1 lb.), halved1lemon, halved, seeds removed8oz. Halloumi cheese, sliced into ½\"-thick planks2Tbsp. torn oregano leavesAleppo-style pepper or crushed red pepper flakes (for serving)PreparationStep 1Prepare a grill for medium-high heat; oil grate. Combine honey and 2 Tbsp. oil in a large resealable plastic bag. Season pork chops generously with salt and pepper and add to bag. Seal, pressing out air, and massage chops to coat.Step 2Place plums, lemon, and Halloumi on a rimmed baking sheet and drizzle with 2 Tbsp. oil; toss to coat. Season plums and lemon with salt, then season everything with pepper.Step 3Grill pork over medium-high, turning occasionally with tongs and moving around if needed to prevent flare-ups, until an instant-read thermometer inserted into the center (about ½\" from the bone) registers 130°, 6–8 minutes. Transfer to a cutting board and let rest 10 minutes.Step 4Meanwhile, grill plums, lemon (cut side down), and Halloumi, turning plums and cheese once or twice, until grill marks appear and plums start to release their juices, about 4 minutes. Transfer plums, lemon, and Halloumi to cutting board with pork and let cool 1 minute. Slice each plum half into 3 wedges and tear Halloumi into 1\" pieces.Step 5Cut pork away from bone and slice ½\" thick. Arrange meat on plates; discard bones. Spoon plums and Halloumi around and on top of meat, dividing evenly. Squeeze juice from grilled lemon over; season with more salt and pepper. Top with oregano, sprinkle with some Aleppo-style pepper, and drizzle with a little oil.How would you rate Grilled Pork Chops with Plums, Halloumi, and Lemon?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangle100% would make this recipe again. I did not make any alterations to the recipe. I used some very fresh thick cut bone-in pork chops and was pretty liberal with the seasonings included in the recipe. No need for anything else. My partner gave it a thumbs up as well and said he wouldn’t change a thing about it.TheGourmetTrashCat8/22/2020This recipe was absolutely delicious! Unlike the other reviewer, I intuitively seasoned my pork chops with more than just salt, pepper, and hope. I decided to add a hefty dose of paprika, some cumin, and yellow mustard seasoning. I also live in a smaller home without any way to grill my food so I prepared this in a cast iron skillet which I think added to the overall flavor because the plums and halloumi were able to soak in any juices that were left behind. There was so much texture and flavor complexity in this meal! The plums were sweet and soft, the halloumi was tender and chewy, the pork was sweet and crisp, and the tangy lemon juice was the ribbon that tied it all together, YUM! I could see this being a really great dish to serve at a summer get together with friends along with a nice little mango cocktail and cilantro rice.CreoleCuisiniereOakland, CA8/27/2019I would not make this recipe again. Though each component tasted on fine on its own, they did not taste very good when combined. Followed the recipe exactly as written and thought the pork chops were on the bland side (needed to be seared and perhaps marinated in more flavorful ingredients than just oil and honey). This was the first time that I grilled Halloumi cheese and I did enjoy that.ShetterleyWesley Chapel, FL9/24/2018Explore Bon AppétitGreekEuropeanPork ChopPorkMeatHalloumiCheesePlumStone FruitFruitLemonCitrusSummerEasyWeeknight MealsMainGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Claire Saffitz"]}