{"id": "8dcbff1692bdc52e24332d40876c6125", "url": "https://www.bonappetit.com/story/how-long-does-heavy-cream-last", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "How Long Does Heavy Cream Last? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Long Does Heavy Cream Last? Longer Than You ThinkStop throwing it away, people!By Alex DelanyJanuary 25, 2018FacebookTwitterEmailFacebookTwitterEmailThe Sea of Forgotten Heavy Cream. That’s not a real place, but in our heads, it’s the body of water (cream) where all the half-finished cartons of heavy cream go when they’re poured down the drain. It’s kind of like the Land of Misfit Toys, from Rudolph the Red-Nosed Reindeer. If you’re not familiar, it’s not really worth explaining. Just pretend that we never mentioned it.What’s important is that way too many people are throwing out way too much heavy cream way too soon. One batch of whipped cream, and suddenly the rest of the carton is useless? No. That's not how we were meant to live.Most heavy cream can last in the fridge for about a month after you open it. The high fat content helps keep cream from going bad shortly after opening, but the reason that most heavy cream you buy at the grocery store has such a long shelf life to begin with is the fact that it is Ultra-High Temperature (UHT) processed. UHT heavy cream is pasteurized, which makes it particularly stable. (We can't say the same for fancy, lightly pasteurized heavy cream from your local dairy—that stuff is much more perishable.) We say UHT heavy cream will last a month (after opening) to play it safe, but we’ve kept heavy cream in the fridge for six or seven weeks without any curdling.Every carton of cream will have a different lifespan, depending on what’s in your fridge, how much the temperature fluctuates, and how often the cream is used. The best way to make sure it’s still good is to stick your nose in there and take a whiff. Smells good? Make whipped cream! Smells like blue cheese? BE GONE!Keep that extra cream for another whipping session later in the month.\nPhoto by Alex Lau, Styling by Sue LiAnd if you want to elongate the life of your heavy cream even further, you can freeze it. That's right:heavy cream holds up in the freezer for up to three months. We like to pour heavy cream into ice cube trays, freeze them solid, and then pop a few out when we only need a few ounces for a recipe. Let the cubes thaw in the fridge and then incorporate the now-liquid cream into your recipe as if you bought it yesterday.This is all to say, there’s just no reason to waste heavy cream. If you can't figure out how to use up a pint of heavy cream over the course of a month—hellooooo chocolate sauce—you can always just sling it in the freezer. But also, if you can't figure out how to use up a pint of heavy cream over the course of a month...well, we might just not be able to help you.Now that you know that cream is still good, make this to celebrate:Chocolate Dutch BabyFaster than a soufflé, easier than a molten chocolate cake, and more delicious than both.View RecipeExplore Bon AppétitBasicallyCreamDairyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Alex Delany"]}