{"id": "8de1ed4f6f80877b1cab17786e806905", "url": "https://www.bonappetit.com/recipe/sheet-pan-hazelnut-breakfast-tart", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Sheet-Pan Hazelnut Breakfast Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueSheet-Pan Hazelnut Breakfast TartBy Rachel GurjarNovember 23, 20214.1(31)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by Alison Attenborough, Prop Styling by Summer MooreEmailPinterestPrintEmailPinterestPrintInspired by kringle, a Danish holiday pastry, this celebratory, make-ahead tart has a gooey hazelnut filling that pairs wonderfully with coffee. If your market has blanched hazelnuts, get them and save yourself the step of rubbing off the skins (you’ll still want to toast them, though).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonSilicone Spatula$13 At BA MarketPastry Brush$9 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients9 - 12 Servings2cups (280 g) skin-on hazelnuts117.3-oz. package frozen puff pastry (2 sheets), thawed6Tbsp. unsalted butter, melted, slightly cooled1¼cups (250 g) granulated sugar, plus more for sprinkling2large egg yolks3large eggs2Tbsp. unsweetened cocoa powder1½tsp. Diamond Crystal or 1 tsp. Morton kosher saltPreparationStep 1Preheat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown inside (slice 1 open to check if needed), 8–10 minutes. Let cool, then rub hazelnuts together in a clean kitchen towel to remove skins.Step 2Meanwhile, separate puff pastry sheets. Place 1 sheet of pastry on a sheet of parchment paper and roll out to a 14x10\" rectangle. Prick pastry in several places with a fork, then carefully transfer to a 13x9\" rimmed baking sheet and gently press into pan so pastry fits into corners and goes up the sides. Chill until ready to use. Roll out remaining sheet of pastry on same sheet of parchment to a 13x9\" rectangle and set aside at room temperature while you make the filling.Step 3Transfer hazelnuts to a food processor; pulse to coarse pieces (some bits will be smaller and finer than others).Step 4Whisk butter and 1¼ cups sugar in a large bowl until slightly fluffy, about 2 minutes. Add egg yolks and 2 eggs and whisk to combine, about 1 minute. Add hazelnuts, cocoa powder, and salt and mix with a rubber spatula until a thick paste forms.Step 5Beat remaining egg in a small bowl to blend. Remove baking sheet with pastry from refrigerator and brush egg along edges of pastry. Scoop hazelnut filling over dough and spread into an even layer with spatula. Carefully place remaining reserved sheet of pastry on top; gently press together edges of pastry to seal. Trim any excess dough from sides, then crimp edges with a fork. Chill tart in freezer 15 minutes.Step 6Remove tart from freezer and brush top all the way to the edges with egg. Cut about 1\"-wide slits across top as desired for venting. Bake tart until crust is golden brown, 30–35 minutes. Let cool in baking sheet 10 minutes, then sprinkle with sugar and cut into pieces.Do ahead: Tart can be baked 3 days ahead. Let cool completely. Store tightly wrapped at room temperature.How would you rate Sheet-Pan Hazelnut Breakfast Tart?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleWHY CANT WE SAVE RECIPES EVEN THOUGH WE ARE SUBSCRIBED AND LOGGED IN!?!?Anonymous3/2/2022what is the calorie count? I see white sugar in the photo, making me hesitant to try it!CeilBelmar, NJ2/6/2022The flavor is very good.  Removing skins from hazelnuts was too time consuming.  If I make this recipe again, I would probably blanch the nuts and remove skin as that is faster, then roast them.  \nWish to be able to print your recipes.  How?Aida Chicago area1/29/2022Please make it so we can print your recipes from our mobile devices. I’ve considered unsubscribing because it is so annoying that I cannot easily print off a recipe!!!!MSCalifornia 1/18/2022This recipe is much easier than everyone is complaining about. I made this for a birthday treat for my mother, and everyone loved it. If you have any experience baking with puff pastry, I promise you this is easy. I had no problem with the salt content (I use Morton religiously). I made and assembled the entire thing the night before, then egg washed it and baked it in the morning. Easy!Rita JChicago1/10/2022I am glad to hear that others were not crazy about this. I am an old man taking up cooking as a hobby in retirement. I put quite a bit of time into this and it wasn't \"WOW worthy\".AnonymousThe Villages, Florida1/9/2022There's no print icon, which may be what some of these reviewers are confused about, but ctrl + p works just fine for me in chromeAnonymous1/5/2022I made several tweaks to this recipe that I really think made it much easier, and made it stand out as a special, Christmas-worthy breakfast. First off, I actually made the entire filling in my food processor with no issues. This resulted in a much smoother filling than it otherwise would have been, so I added a single layer of sliced almonds on top of the paste before laying on the top pastry (next time I will toast those, too!). Other changes I made to the filling are: I lowered the amount of salt based on previous reviews, used less sugar (about 1 cup), and also added some ground cinnamon and fresh orange zest for more of an Italian twist, since others noted that it seemed to be “missing something.” I also brushed the top crust with melted butter immediately out of the oven, and sprinkled it with just a dusting of cinnamon sugar. Like others noted, it took quite a bit longer to bake to get the crust golden; probably an additional 10-15 minutes. All that said, my family loved it on Christmas morning, including a very picky four-year-old. I do think I would have preferred the filling slightly less thick—maybe only 2/3 the amount made by the recipe. But I would make it again (with these changes!) as it’s a “fancy” breakfast that’s easy to prep the day before and bake quickly the next morning, especially when the amazingly delish, all-butter Trader Joe’s puff pastry is “in season.” Finally, one needn’t wait to assemble the tart the morning-of; I made the whole thing (both the filling and assembly) Christmas Eve morning, placed it in the freezer all day, and then popped it in the fridge that night before turning in. Then I baked it on Christmas morning— and I have to say that the addition of the cinnamon made the house smell quite appropriate for the occasion :)Grace SSan Diego, CA1/3/2022This is pretty good. It’s not my favorite thing I’ve ever baked but I would make it again. I didn’t think it was that time consuming. I also didn’t think it was overly salty. I did have to increase baking time by about 10 minutes, so about 45/50 minutes total. Next time I’d use less of the filling in the pastry. I did feel like it was missing something, but I can’t put my finger on what it is. AnnaGreenville, SC1/1/2022I roasted hazelnuts the day before. I used a hand mixer on medium rather than whisking. It made it light and fluffy. I skipped the end dusting of sugar; it was sweet enough. I’ll definitely make this again, but cut salt in half or skip it altogether. Good reviews from family re holiday treat.JennOWSanta Fe, NM12/25/2021Agree with Sarah C’s comments below. My daughter made it for Christmas breakfast and only some of us could eat it. The filling was way too dense and sweet with little flavor. Not worth all the effort! Kate LCT12/25/2021I was excited to try this recipe.  The hazelnut filling was easy to make (albeit time consuming).  However, the finished product was decidedly missing something. I only put in half of the filling, thinking I would use the other half for another pastry.  The result was a filling which was too thick.  Also, I used the correct amount of Kosher salt as stated, but it was way too salty.  In my oven, (which is usually accurate) the prescribed cook time was way off - too little. The end result was weird tasting, and I was embarrassed to send with my husband to work, to share with his colleagues - as I often do. It ended up in the garbage. Sarah C San Francisco, CA12/6/2021Much of printing depends on the device you are trying to print off of. For instance on my Mac I tell it to print. In the bottom left corner of the print dialog box it says PDF. Choose open in Preview and you will have a very printable document. \n\nRecipe looks good. Can't wait to try it.JimBRedmond, WA12/6/2021Hear, Hear Linda!!  These recipes are impossible to print!!Tony, Rehoboth Beach, Delaware12/5/2021Question:  Could the filling be replaced with Nutella, saving a lot of work?JanAlpharetta, GA 12/5/2021Explore Bon AppétitBreakfastDessertSnackEasyTartHazelnutNutPuff PastryOther IngredientsChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Rachel Gurjar"]}