{"id": "8de335b753d17fc813132a9341c7cd2e", "url": "https://www.bonappetit.com/story/note-from-a-boat", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Healthyish Newsletter: Note from a Boat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleNote from a BoatHealthyish editor Amanda Shapiro sends a dispatch from sea.By Amanda ShapiroOctober 25, 2018FacebookTwitterEmailPhoto by Arthur ElgortFacebookTwitterEmailHello from a very white, sandy beach,Where I’m looking out at the 5,200-person cruise ship that has been my home since Sunday. It’s been a surreal week, to say the least. I’m here for work (no spoilers!), but I have to admit I’m not not having a good time. I’ve only been on two cruises in my life, both for work and both alongside Laura Murray, my stellar photographer and cruising companion. As I write this, Laura is floating in the ocean, stomach-down on a foam mat, attempting to snorkel without letting her freshly tattooed left calf get wet. It’s going surprisingly well.I'm playing with a new newsletter format wherein there will occasionally be ~ categories ~ ! My systems-loving brain is excited. Let me know what you think.This Week on HealthyishCatch two of my favorites in conversation: Fariha Roísín and Angela Dimayuga, for Fariha’s new column, Who Is Wellness For? When she was only changing clothes for the sake of the pizza delivery guy, Akanksha Singh knew she had problems. Here’s how she cooked her way out. Against all odds, chefs are bringing some personal fashion into the kitchen. How to find the perfect dinner candle.I Like YouI met Toyosi Oyelola when she recorded a podcast I did earlier this year. A senior at NYU, Toyosi already has an unmistakable style—and a love of all things food. At the risk of sounding like a school principal, I can’t wait to see what she does next.Make This TonightHealthyish has a muffin problem. As in: There are not enough muffins. Until this week, we had a single muffin recipe. Yes, it’s delicious, but MORE MUFFINS PLEASE. Senior food editor Anna Stockwell to the rescue with these Apple and Oat Muffins, inspired by the bircher muesli she grew up eating for breakfast. (Muesli = overnight oats before overnight oats were cool.)The 5-Star ReviewI used to steal my (male) roommate’s Devacurl shampoo back in 2010—that’s how long the curly-hair product line has been around. But it wasn’t until a few weeks ago that I went to the Devacurl salon myself for a crash course in everything from scrunching technique to microfiber towels. Since then, the shampoo, conditioner, and styling creme have made my hair very happy.Reads of the WeekIn light of my current situation, I’ve been re-reading all my favorite cruise stories: Caity Weaver on the Paula Deen cruise, Taffy Brodesser-Akner also on the Paula Deen cruise, and this little thing, of course. The legacy of the cruise ship story is strong—right up there with road trip narratives and touring with the band—and I feel lucky to be a bit player.Influence ThisLest we forget that we’re being governed by an actual cartoon villain, the Trump administration is seeking to eliminate gender from civil rights protections, essentially erasing transgender people from government recognition. Very not okay. I’m donating to The Trevor Project and Lambda Legal, but there are dozens of other groups who need help too.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletterRead MoreLifestyleLA Eats and Meal Prep FailsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Amanda Shapiro"]}