{"id": "8df2788f03cb67ba113a1b715790df4a", "url": "https://www.bonappetit.com/story/south-river-miso-company", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "We Loved South River Miso Even Before We Knew It Was Ground By Foot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Loved This Miso Even Before We Knew It Was Ground By FootThe story of a couple who inherited a fledgling miso company and turned it into the small-but-mighty producer of our favorite miso around.By Sarah JampelApril 29, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIn the BA Test Kitchen there are as many types of miso as there are opinions about carrots. Which is to say, a lot.But the one brand that the food editors reach for when they want something really special, for a recipe that not only uses miso as its backbone but puts its salty-sweet earthiness at the forefront, is South River Miso.“If you already know you like miso and are ready to try something more complex,” senior food editor Chris Morocco told me, “it’s a great option.” The texture is distinctly dense and chunky yet still soft and malleable; the flavor is deep and bold but not bitter or astringent—it’s sweet enough to sample with a spoon. South River makes great everyday miso, like brown rice miso and sweet white miso, good for soups, dressings, dips, and marinades. But they excel with their speciality varieties, like golden millet, azuki bean, dandelion-leek, and chickpea. Herby, oniony, mellow, or intensely savory, depending on which you pick, they’re are some of the most interesting miso we’ve ever tasted.What makes South River Miso so special? It’s been made for 40 years in central Massachusetts by a couple who never set out to make miso at all—which, strangely enough, is also what makes it so good.When founders Christian and Gaella Elwell started South River Miso Company in 1982, “there was no one making miso in the United States from organic ingredients, and there was virtually no unpasteurized miso available,” Christian told me. What was available was imported from Japan and pasteurized to meet regulations. The couple, who met in Boston in the late ‘70s, only wanted the unpasteurized stuff: As students of macrobiotics, they were interested in miso primarily for its health benefits, some of which are lost during the high heat of pasteurization.But even though Christian and Gaella dreamed about what it would be like to make miso in New England—and more specifically, to follow in the traditional style of Japanese miso-making, where it’s fermented in small batches on land passed down each generation—it was not part of the plan when they bought farmland in Massachusetts to homestead and raise a family.Then, as fate would have it, their friend offered them the opportunity to take over his fledgling, flailing miso company. Before they knew it, Christian and Gaella had inherited a set of production equipment and 13 tons of miso. They didn’t even have a building to store it in. “It was quite a wild thing.”They did know that they wanted to honor it “as a medicinal food. I sensed that the only right way to go about it would be to abide by the traditional methods,” says Christian. “If we were going to make miso here, we wanted to do it in the old-fashioned, handmade way.”We love using this sweet, light white miso in salad dressings or desserts.\nPhoto by Chelsie CraigFor those of us more concerned with taste than with health, traditionally made miso often has a superior flavor and texture to its mass-produced counterparts: It’s bolder, funkier, and more complex—like the difference between ultra-pasteurized mozzarella cheese and the fresh ball you get at the farmers’ market from local milk. Miso—like wine, cheese, and coffee—reflects its terroir, which means that the environment where the ingredients are grown and where the mixture ferments is all the more important.By using traditional miso-making practices and focusing on the quality of the product, Christian and Gaella have taken all of these factors into account: South River is made with organic grains and beans that are cooked in a cauldron that’s heated by wood fire, not commercial-friendly propane, then fermented in wooden barrels. Instead of grinding the beans with a commercial grinder, South River Miso is mashed by foot, which gives the miso its chunky, bitsy consistency, with visible pieces of grains, beans, and vegetables.. “It wasn’t until I stepped into the miso that I felt like I was a miso maker. I became more confident and more in tune with the ingredients and the process.” (Don’t worry, squeamish readers: All feet are well covered with organic cotton socks.)Christian also insists that foot-treading confers an energetic emanation onto the miso that machines cannot. We’ll consider it an added bonus.Buy It: South River Miso Sweet-Tasting Brown Rice Miso, $11 at southrivermiso.com.Explore Bon AppétitShoppingMisoRead MorecookingYour Most Pressing Miso Questions, AnsweredBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Sarah Jampel"]}