{"id": "8e04720acc517f76fa58ed06b817eab3", "url": "https://www.bonappetit.com/story/andy-puddicombe", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Andy Puddicombe, Monk-Turned-Tech-Mogul, Still Eats the Same Breakfast Every Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMonk-Turned-Tech-Mogul Andy Puddicombe Still Eats the Same Breakfast Every DayWe talked with the very calming Headspace founder about what it takes to run a wildly successful meditation app.By Ali FrancisNovember 14, 2018FacebookTwitterEmailPhoto courtesy of Andy PuddicombeFacebookTwitterEmailIn Entrepreneurs Run the World, Ali Francis gets advice and insight from game-changing entrepreneurs with big ideas. This week we talked to Andy Puddicombe, founder of Headspace, a meditation app that's introduced mindfulness to millions.I first meditated about four years ago with my brother. “You can chill with me as long as you don’t talk or squirm,” he instructed. (He’s a Capricorn.) I remember closing my eyes and listening for about 20 minutes as a genteel British voice echoed instructions to the room: Picture a warm beam of light piercing your chest and trickling through your extremities. (I took some artistic license, imagining my body slowly filling with molten fondue.) The voice was Andy Puddicombe’s, and the app was Headspace—a subscription service he co-founded that offers virtual meditation coaching, aka enlightenment via iPhone.The effects of meditating were subtle but instant for me: I felt calmer, more focused, happier. My problems didn’t disappear, of course. But I felt a natural resistance to the anxiety they usually induced. This is something that Puddicombe touches on often in the app. Meditation isn’t about eliminating stress from your life—that's not really possible. It’s more about learning to sit with it.Today, Headspace serves over 35 million people in 190 countries, with programs designed for specific ailments (like anxiety and sleep deprivation), and everyday activities (like running and mindful eating). But Puddicombe would really rather not measure success in numbers. “I see it as our job, all of us as a team, to turn up each day with selfless drive, with a courageous heart, with a curious mind, and just to be present, doing the best that we can,” he explains. “We can't really do more than that.”We chatted with Andy recently about building a brand sustainably, his 10 years training as a Buddhist Monk, and the power of thinking big.What inspired you to create Headspace?I think a lot of the ideation took place in the 10 years prior to meeting my co-founder, Rich Pierson, when I was training to be a Buddhist monk. It was on that journey that I realized meditation was a useful skill that not a lot of people had access to.What catalyzed your monastic lifestyle?When I was around 18, there was an accident I was involved in where a drunk driver crashed into a group of us. I wasn't hit, but a lot of people were, and it killed two of the group and seriously injured about 12 others. I think that was a real turning point when I started to question what I was going to do with my life, and what was going to give it some meaning.Like a kind of wake up call?Yeah, but there was another part to it, which was more of a general searching. I just felt and sensed that there was more to life than what I was living at the time. And I just wanted to better understand the mind.As an outsider, were you embraced by the Buddhist community?Everybody was incredibly welcoming. There's no judgment in those places. It's like, “Okay, we're all a bit neurotic and a bit loony,” but it's genuinely about understanding our neuroses, not trying to get rid of them. And that, for me, was really the beginning.So you come back from being overseas, with all these learnings, and decide you’re going to start an app?We actually didn't start with the app. Headspace started as an events and publishing company. We operated that way for about two or three years before launching the first Headspace app about seven years ago.From monk to tech mogul. Was that...hard?[Laughs]. A monastic life probably isn't the best foundation for an entrepreneurial life! I'm still figuring it out. I'm incredibly fortunate to have a co-founder who's also a very good friend. We have a shared interest and a shared passion. We're building it together, and we have complementary skills. But I think I have always had an entrepreneurial kind of mindset. Whether that's growing up with a self-employed parent or working a lot when I was younger, I think I always had that in me.What was your biggest knowledge gap after coming back from the monastery?Probably technology. I really couldn't have been further behind in terms of my understanding and use of technology, digital, apps, or even telephones at the time. But I think, as with any startup, there are also a few familiar challenges that everyone faces: One is getting other people to buy into the idea, and the other is raising enough money to get started.When you were going out for early-stage investment, that must have been the time when meditation wasn't, I suppose, as rooted in people's lives as it is today. What were investors’ responses like?[Laughs.] We didn't even go for institutional investment. I'm incredibly optimistic and I genuinely believe that anything is possible. But, at that time, given the way that meditation was seen, I really don't believe that we would have got it. So, we self-funded for five years before we begged and borrowed from friends, family, and the bank.Kinda old school.But I think it was very healthy for us. In the very beginning, it was like, \"Okay, how are we going to make this sustainable project where we can have a real tangible benefit on the people we're trying to reach?” But also, “How can we hire the best people in the world and create a platform that we feel is doing service to the lineage and the tradition of the teaching?\"On the point of sustainable growth, was Headspace ever your side hustle?Yeah. [Laughs.] We didn't pay ourselves a salary for, I think, probably the first two years. So, I was working in a clinic in London doing one-to-one consulting. It was an integrative health clinic, mostly mainstream medicine. I would say a lot of the content that people hear now in the app was inspired by me working with a really broad section of society, going through a lot of those issues.From then to now, how has your role changed? What do you spend your time on, and you how do you choose, equally, what not to spend your time on?We really tried as early as possible for me not to be involved in the business side of Headspace, but to be very much focused on the service that we offer, and on the teachings. When I'm not on the road giving talks, doing events and things like that, I'm either writing or recording.What does a perfect day off look like for you? Do you take days off?Of course! My wife and I would get up and do an hour of exercise and an hour of meditation before anyone else in the house has woken up. We'd hang and have lunch on the beach with friends, swim in the ocean, and then probably just relax at home in the afternoon. We're not very rock and roll.When and where, is your best thinking done?I'm a morning person rather than an evening person. If you want anything out of me after 10 p.m., good luck to you. I get up at 5 a.m. or earlier. I've got a lot of creative energy first thing in the morning. That’s the most productive part or my day, when I do all of my recording and all of my writing. And then the afternoons are dedicated more to meetings and emails and that kind of stuff.Do you workout in the morning, too?Yep—running, cycling, rowing, or surfing.Have you received any business advice that’s been particularly memorable?The Tibetan abbot at the monastery always encouraged us to think big. When you're dealing with trying to alleviate suffering in the world, when you're trying to improve the health and happiness of the world, you have to think big.If you could take anyone to lunch and pick their brain about Headspace, who would that be, and where would you go?It'd probably be the Dalai Lama. Maybe we'd go for a spot of lunch up in the Himalayas, probably just have a little chat about how it's going and what he'd like to see more of in the app.In the app, I’ve noticed a lot of programs that are less related to things like stress and anxiety, and more about mindful eating, and running. I guess, less cerebral forms of wellness. How did those come about?Partly through the community asking for them, but partly because they were genuine passions of mine and Rich's. Before I was a monk, I was a trainer. I was really into studying sports science, which included nutrition. My wife is a nutritionist as well, so all of these things were kind of around. And it was more like, “These are the things that we're doing to help us feel better. What would they look like through the Headspace lens?”Are they popular?Mindful eating is the first new release that’s made it into the top three, so my data team tells me.Do you consider yourself a mindful eater? What are some things you’re always eating on repeat?We're pretty much a vegan household, kids included. There are a couple of small exceptions: sheep's yogurt and eggs. My wife criticizes my diet for being boring, but every morning I have a vegan CORE bar with nuts and fruit and sheep's yogurt, and every lunchtime I have a vegan chocolate protein shake. And that's, yeah, pretty much every day.You're still living a monastic lifestyle then.[Laughs.] I mean, you get a bit institutionalized in there. It's hard to break free from that.Get a little Headspace via the App Store or Google Play, or read Andy’s books on meditation and mindful eating.Explore Bon AppétitEntrepreneurs Run the WorldHealthyishSelf CareInterviewsRead MoreLifestyleHow Naz Riahi Created Bitten, the New-School Food Conference That Goes Far Beyond FoodBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Ali Francis"]}