{"id": "8e052dc3dc3ac6f316a6bc09e0ecd902", "url": "https://www.bonappetit.com/story/a-tale-of-one-chicken", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Recipes Using Roasted Chicken and Other Tales | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Tale of One ChickenAnd how it stretched over four (very good) meals.By Christina ChaeyDecember 5, 2020FacebookTwitterEmailPhotograph by Marcus NilssonFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,The Thanksgiving leftovers are finally gone, which is normally a moment I look forward to every year, because it means I can get back to eating literally anything but turkey. This year, though, once the roasting pan and the gravy boat went back into storage, all I wanted was a whole roast chicken. This was in part because I was still mad at my mother for forcing me to cook the turkey until it was well beyond the point of saving. But it was also at least partially motivated by the fact that I knew one good chicken would be my saving grace for pulling off several days’ worth of quick dinners in a week when I very much needed a break from cooking.And so I roasted a chicken on Monday, which is something I would almost never do in the Before Times because it inevitably meant I’d get home from work at 7:30 and not eat dinner until 10. I diligently followed our never-fail cast-iron roast chicken method and served the juicy breast meat with a side of Perfectly Roasted Potatoes and a crisp and very lemony green salad, content with the knowledge that this chicken would make up at least three more meals over the course of the week.After dinner, I pulled all the leftover meat off the bones and set aside the carcass to make stock the next day, because I can make a three-hour stock in the middle of a Wednesday now. After simmering for hours with some onion, carrot, celery, garlic, and black peppercorns, the stock had become golden and rich, ready to become the base of any number of soups and stews.Save those bones for spicy chicken stock.\nHere’s how the rest of the week’s dinners came together: Cubes of leftover chicken breast went into a hot and spicy instant Japanese curry rice (I am about the Golden Curry life) along with a ton of vegetables. Wednesday was a quick chicken soup with that rich stock, diced sweet potatoes, kale, and fluffy buttermilk dumplings. Finally, the last bits of shredded dark meat got tossed with rice noodles, herbs, fresh bean sprouts, chili crisp, and lime juice for a satisfying lunch.By the end of the week, not a bit of the bird went to waste, from crispy skin to stock-making bones. This whole chicken exercise was a reminder that although the cooking burnout is real, cooking some roughly 700 meals (and counting) during quarantine has made me a more resourceful, intuitive, and efficient cook. And you can bet I’ll get four brand-new meals out of my next chicken too.Keep cooking,Christina ChaeyAssociate editorExplore Bon AppétitHealthyishWhat's Chaey Cooking?roast chickenRead MoreLifestyleHow I Cook Healthyish When All I Want Is MeatBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-05", "author": ["Condé Nast", "Christina Chaey"]}