{"id": "8e0cb86096b83457a652ba7f5814a5b1", "url": "https://www.bonappetit.com/story/flourless-chocolate-cake-for-valentines-day", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "This Flourless Chocolate Cake Is Ooey-Gooey Wonderful  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Ooey-Gooey Flourless Chocolate Cake Is a Valentine's Day Slam DunkWhether you're trying to impress a date or taking the whole thing straight to the dome, this flourless chocolate cake is what you need.By Alex BeggsFebruary 12, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Rhoda BooneFacebookTwitterEmailAnother year, another Valentine’s Day. Whether you’re Charlie Browning it up at the empty mailbox or ordering in pizza with the person who worships your morning breath, this holiday either matters or it doesn’t to you. But...chocolate cake? ALWAYS MATTERS. This flourless chocolate cake has an ooey-gooey molten texture, somewhere between pudding and cake, between heaven and platinum heaven (you know that’s got to exist).How it works: In place of flour, which gives a cake structure, we’ve got six eggs + SUGAR. Eggs give structure too, and the more eggs you add, the more wet and fudgy the cake. (Combining eggs with sugar creates this meringue-like fluffy batter that turns into a crackly crust in the oven. YASSSS.) We found six eggs to be the sweet spot. And then we use melted bittersweet chocolate instead of cocoa powder for a velvety texture—not the grainy one you get with some less-than flourless chocolate cake specimens.The recipe is beyond simple, and breaks down tidily into three phases, marked by the bowls/cooking equipment you're using:Melt chocolate and butter in a saucepan, let that cool.While it’s cooling, whip six eggs, sugar, and vanilla for nearly 10 minutes (I used a stand mixer, but a hand mixer works too). It fluffs and foams up, turns a baby nursery pale yellow, and has a ribbony texture when you lift the paddle out. Stir the chocolate in with a spatula (so as not to deflated the airy eggs) just until everything’s fully incorporated. We just learned a baking lesson: how to \"fold\" batters together!Pour into buttered and parchment-lined cake pan and bake.A little homemade whipped cream never hurt anybody.\nPhoto by Laura MurrayWhen it’s got a crusty top and wobbly ONLY in the very center, around 30-35 minutes later in a 325° oven, you let it cool for 10 minutes in the pan, where it’ll set a little more. We want a gooey center, not liquid. Then you invert the cake onto a platter and let it cool, inverting it one final time to get that crackly top back on top because it just...looks cool.For serving, we make freshly whipped cream (unsweetened because the cake is so rich) and toasted hazelnuts, but you could 100 percent do ice cream and chopped peanuts (omg that sounds amazing) or whatever else you love more than anyone’s morning breath.Get the recipe:Fudgy Flourless Chocolate CakeThis (gluten-free!) flourless chocolate cake is decadent, rich, and super-easy to make.View RecipeExplore Bon AppétitValentines DayChocolateCakeGluten FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Alex Beggs"]}