{"id": "8e1fa56f82a5e990237dbaad9f601d76", "url": "https://www.bonappetit.com/recipe/creamy-cashew-udon-with-crispy-mushrooms", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Creamy Cashew Udon With Crispy Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCreamy Cashew Udon With Crispy MushroomsBy Hetty McKinnonSeptember 5, 20214.6(37)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThis may be controversial, but I think cashew cream is better than regular cream in this rich noodle dish. First, the flavor: Cashew cream is delicately sweet with a hint of nuttiness that lends an earthy depth. Next, the texture: Used as a sauce, it has an incredibly silky finish that is creamy without feeling heavy. The whipped consistency clings lovingly around every strand of noodle, and it pairs well with the pan-fried mushrooms, which are golden and crisp and provide pops of umami flavor. The black vinegar and soy sauce topping delivers much-appreciated acidity, heat, and assertive saltiness—you can also use it as a dip for dumplings. —Hetty McKinnonThis is part of our meal planning package, where one recipe can become three quick weeknight meals. Use the rest of your cashew cream to make Broccoli and Cashew Cream Soup or Roasted Carrots and Chickpeas With Herby Cashew Cream.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonLarge Skillet$84 At AmazonMeasuring Spoons$10 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonIngredients4 servingsCashew Cream1cup raw cashews1garlic clove, coarsely chopped1Tbsp. extra-virgin olive oil½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltNoodles and Assembly2Tbsp. black (Chinkiang) vinegar2Tbsp. chili crisp or chili oil2Tbsp. soy sauce1Tbsp. toasted sesame oil3scallions, thinly sliced, divided2–3Tbsp. extra-virgin olive oil1lb. oyster, shiitake, crimini, or button mushrooms, torn or cut into bite-size pieces1garlic clove, finely chopped½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more28oz. fresh or frozen udon noodlesFreshly ground black pepperPreparationCashew CreamStep 1Bring a large saucepan of water to a boil, then remove from heat. Add cashews and let sit until tender, 30–60 minutes.Step 2Drain cashews and transfer to a blender (preferably high-speed) or food processor. Add garlic, oil, salt, and ½ cup water and purée until smooth.Noodles and AssemblyStep 3Stir vinegar, chili crisp, soy sauce, sesame oil, and 1 scallion in a small bowl to combine; set soy-vinegar sauce aside.Step 4Heat 2 Tbsp. olive oil in a large skillet over medium-high. Cook mushrooms, tossing every minute or so but leaving mostly undisturbed, until mostly golden and crisp, 5–8 minutes, depending on type of mushroom you use (oyster and shiitakes will cook quicker, while crimini and button mushrooms will take a bit longer). Add garlic and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and cook, stirring often and adding another 1 Tbsp. olive oil if the mushrooms are looking dry, 1 minute.Step 5Meanwhile, bring a large pot of salted water to a boil. Cook noodles according to package directions. Drain, reserving 1 cup cooking liquid.Step 6Add noodles and cashew cream to pan with mushrooms and cook, stirring and adding reserved cooking liquid a little at a time, until cream is loose and coats noodles. Season with salt and pepper.Step 7To serve, divide noodles among bowls and generously drizzle each with reserved soy-vinegar sauce. Top with remaining scallions.How would you rate Creamy Cashew Udon With Crispy Mushrooms?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleUgh, this didn't work and I was so disappointed. The cashew cream was just okay. And the black vinegar overpowered the sauce. The mushrooms got soggy when mixed in. I followed directions, underdid it even, but the udon were too soft. Adding enough water to smooth the cashew cream would have made it a sludge. I was so sad because the reviews made me so excited! But it just didn't come together for me. If you make this, watch the udon. Don't mix in the shrooms. Anonymous2/9/2022Wow!  This was great .  This was the first time I’ve ever used cashew cream and it didn’t disappoint her. Also I did it the way Natalie suggested.KenBoquete Panama 1/5/2022This was delicious. I only used half the cashew cream and froze the rest. I’d recommend not mixing the noodles and cream into the fried mushrooms, but instead just mixing the cream, noodles and cooking water until you get the right consistency and serve the mushrooms on top. NatalieSydney12/19/2021Delicious.  Used 1/2 of the cashew cream, that was plenty.  Added some togarashi with the mushrooms. A little bit of spice was nice.CookinVTVermont12/12/2021I was so looking forward to a mushroom-forward dish with an interesting sauce that I hadn't even realized it was vegan until about half way through cooking! The chili-soy-sesame sauce is our new go-to dipping sauce for almost any Asian dishes, and the cashew cream has made me rethink a few other recipes in our regular rotation. While it's been a while since I've needed a delicious beyond all reason vegan dish in my dinner party repertoire, this recipe has given me the excuse I needed to make some.plans.Gwyn W.Frederick, MD10/25/2021This dish sounds incredible, however, for those of us that have nut allergies, what would be a good replacement for cashew cream?DoriConnecticut 10/4/2021This dish was amazing! The star of the show was definitely the black vinegar soy sauce concoction, I did end up my own black vinegar as I didn’t find any near me. I used one part fine balsamic vinegar, one part rice vinegar (or apple cider vinegar) and three parts water. The only thing I would do differently would be the plating. I wouldn’t stir the noodles into the mushroom and sauce, instead I would top the mushrooms over the noodles so that they keep their crisp, maybe add thin pieces of cucumber as well for a nice crunch. Love this recipe and will be adding to my rotation of dinners NinaLos Angeles 9/29/2021Should I remove the stems of the mushrooms before I cook them? Or should I tear the whole mushroom into pieces?AnonymousBoston, MA9/21/2021Loved this restaurant quality dish. So glad I resisted the temptation to sub out the black vinegar - I’d never cooked with it before and I’ll be putting it on everything now. AnonymousChicago9/17/2021I am vegan so maybe I'm a little cashew obsessed, but I didn't find it too much at all. I maybe had a few tablespoons left over. That being said this recipe was DELICIOUS. My 3 year old told me I'm the best cooker ever. So thanks for making my night Bon apetitAmy m9/16/2021This is rich and tasty. People keep saying that it’s too much cashew cream however the one recipe for the cashew cream is meant to be used in 3 dishes spread out over 3 evening meals. This one, the broccoli soup, and the salad with carrots. So given this I t is the right amount and why liquid from the noodles is saved and added if the cashew cream is too thick or it doesn’t appear to coat the noodles well. I used brown rice noodles in mine since my husband won’t eat wheat anything and they tasted very good. Rice noodles can be sticky so I had to make sure I didn’t overcook them. The spicy drizzle does add an interesting dimension. This was a hit and much better than an Alfredo or dairy type sauce which we would never eat due to fat and calories. I did add a bit of miso in the noodle liquid I used in my mixture which added a little extra flavor. I’ll make this again and love the vegan recipe. Paris EdenLos Angeles, California 9/15/2021The flavor is good, but other commenters are right, there's too much cashew cream. The header text says the cashew cream can be used in other recipes, but this recipe doesn't say how much of it to use on this dish. I used all of it, and while it wasn't bad, it ended up being a much heavier meal than I think it's meant to be. Definitely only use half or maybe even a third of the cashew cream!AnonymousNew York, NY9/11/2021Really great flavours in this dish! I love the mushrooms and the soy-vinegar sauce adds a welcome liveliness to the cashew cream. I found the cream to be heavy/too plentiful for the amount of noodles, so next time I’ll use half the amount and save the rest for something else. Lauren Toronto9/8/2021I scaled this recipe down for just myself. Really really good recipe. Makes a lot of sense to pair the soy/vinegar with cashews instead of actual cream. I used thick udon noodles which I would recommend for this dish and it'll absorb up all the cashew cream sauce. Make sure you have extra just in case. \n\nI'll make something vegan once in a while and this really hit the mark. Mostly all clean and whole ingredients and very few needed. Great pantry pasta.  SeanLos Angeles, CA9/8/2021Surprisingly good. My husband and I don't often eat vegan and this dish was really yummy. We had to sub dried udon noodles and roasted unsalted cashews based on what our store had available. It doesn't taste like pure cashew which I thought it might, and the sauce + the dressing is a great combo. I also decreased the amount of sesame oil by half because I was worried it would be overpowering. If we made it again, we would find fresh udon and raw cashews and do it to recipe!WDSeattle, WA9/6/2021Explore Bon AppétitMushroomVegetable UdonVeganDairy-FreeNoodlePasta & NoodlesOyster MushroomsVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Hetty Mckinnon"]}