{"id": "8e28d0f5a6bcc08b88b5115e264366e1", "url": "https://www.bonappetit.com/story/kimchi-toast", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Kimchi Toast Is Our New Breakfast Classic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleKimchi Toast Is Our New Breakfast ClassicAll the flavored cream cheese devotees out there, this one's for you.By Aliza AbarbanelOctober 17, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Susie TheodorouFacebookTwitterEmailLet's get this out of the way first: Kimchi toast is not health food. “It’s definitely on the ish side of ‘healthyish’,” says senior food editor Andy Baraghani, who tried using yogurt as the creamy base for this kimchi toast before admitting that nothing but full-fat cream cheese would do. He was right: the kimchi cuts through the creaminess of the dairy with a zing of funk and brightness, making for a breakfast condiment that rivals any of the flavored cream cheeses in the deli case.And not all is lost on the health front. Kimchi is a fermented food, full of good-for-you probiotics. Andy likes Sunja's kimchi, which he says has the right amount of gochugaru (red pepper flakes) and a pleasingly crunchy texture that’s never too soggy. If you have another favorite (or perhaps a homemade jar knocking around in your fridge), go ahead and use it.Avocado toast better watch its back.\nPhoto by Chelsea Kyle, Food Styling by Susie TheodorouThis toast is excellent for an on-the-fly breakfast or midday snack, because the recipe is more “assembling” than “cooking.” It starts with good country-style bread, grilled if you have the patience and toasted if you don’t. It’ll be delicious either way, but make sure those slices are thick enough to support the toppings.Once the toast situation is handled, it’s time to make the cream cheese mixture. Think of it as veggie cream cheese, only laced with funky kimchi and thus infinitely more interesting. Make sure your cream cheese is room temperature, then mix it with finely chopped kimchi in a medium bowl until a smooth spread forms. This kimchi-cream cheese mixture can hang out in the fridge for a couple days, but it'll get more and more potent over time.The herb salad on top is a classic Baraghani move. Toss thinly sliced scallions and tender-stemmed cilantro leaves with lime juice and salt, then spread the kimchi cream cheese on the toasted bread, top with a generous heap of herb salad, and finish with a drizzle of chile oil if you have it and a sprinkling of sesame seeds. The tangle of herbs and seeds is pretty, but it also keeps the dish balanced. “It would have been pretty one-note if it was just the cream cheese and kimchi—delicious, but a little too heavy—and I needed something that would bring it back to life,\" says Baraghani.Once assembled, this toast is more than the sum of its parts. It hits high on the creamy-tangy-crunchy matrix, and the herb salad makes it feel fancier than a five-minute toast deserves to be. It’s a great brunch addition or impromptu snack, and we suspect it would make for an excellent hangover cure. Not that we've ever had one of those.Get the recipe:Kimchi ToastIf we had to give this toast a bunch of random personality traits, we’d describe it as a rule-breaking hothead with a softer side.View RecipeExplore Bon AppétitHealthyishBreakfastSnackKimchiCream CheeseToastRead MorecookingKimchi-Fried Grains Will Show You the True Power of Sunday Meal PrepBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Aliza Abarbanel"]}