{"id": "8e2eede32cad23e402e369dab9e03ebd", "url": "https://www.bonappetit.com/story/hawaii-invasive-deer", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "Maui Nui Venison Is Putting Maui’s Invasive Deer on the Menu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Eating Hawai‘i’s Invasive Deer Saves Its EcosystemsAxis deer crowd the island of Maui. For population control, this company hunts them to sell as venison.By Danielle BernabeDecember 17, 2021FacebookTwitterEmailPhotograph by Jim MenkolFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As the November night fell, a cosmic field of deer eyes illuminated every direction, blinking like stars. Jake Muise, cofounder of Maui Nui Venison, drove slowly past herds crowding the hills of ‘Ulupalakua Ranch in Maui, Hawai‘i. He explained to me that the roadside fences used to be all too short. The deer hopped the formerly four-feet-tall barricades (since retrofitted to eight feet), roaming everywhere in search of grass to graze. Even without his explanation, the endless twinkle I saw around us put the issue in context: There are far too many deer on the island.The Axis deer are invasive to Hawai‘i. In 1867, the trading company Jardine Matheson allegedly brought seven of the spotted deer from India to Moloka‘i at King Kamehameha V’s request. With no natural predators or seasonal swings, the deer population easily and steadily grew. They became a source of nourishment and hunting traditions across Hawai‘i. In September 1959, the archipelago’s Territorial Legislature released two bucks and three does in Maui’s Pu’u O Kali forest in order to encourage recreational hunting. Growing up on the island in the ’90s, I never saw deer, but on my recent visit while reporting this story, it was hard not to notice them. Today, an estimated 50,000 to 60,000 deer live in Maui alone. Left unmanaged, the population will reach 200,000 in the next two decades at a 30 percent annual increase.A small deer population benefits the community as a viable food resource. If their population growth continues at the current rate, however, the deer will eliminate their own sustenance. They will starve, or, in order to avoid that, wander far and wide, demolishing home gardens, devastating crops of local ranches and farms, and colliding with cars. And they’ll eliminate rare flora species of cyanea, clermontia, and geranium, to name just a few.Maui Nui Venison, which officially launched in 2017, is trying to manage the problem. The company hunts, butchers, and commercially sells the deer with the goal to both maintain them as a food source and manage their population in order to protect the rare and vital ecosystems unique to Hawai‘i, which environmentalists often refer to as “The Endangered Species Capital of the World.”Photograph by Danielle BernabePhotograph by Mel TjoengKu‘ulani Muise, cofounder of Maui Nui (she and Jake Muise are married), finds the company’s practice a deeply Hawaiian one. Her family is native to Moloka‘i and when she was growing up, her father hunted deer for food. They ate venison teriyaki weekly for dinner. Now many of her family members work in conservation. “To find a balance for any—and maybe even all—life across the landscape is very much in line with the culture I grew up in,” she told me. “It’s a culture that was formed on these small, completely isolated islands in the middle of the vast Pacific. Balance is everything, and conservation and culture, for me, are inexplicably linked.”The nearly 9,000-acres of Waikamoi Preserve in Maui are dripping with water, covered in moss, and teeming with layers of native ferns, lichens, shrubs, and trees. Forested watersheds like Waikamoi are critical to the health of Hawai‘i’s water and soil, and non-native herbivores like the Axis deer pose a grave threat to them.“The area can be eaten up by one herd of deer and never be seen again. It’s pretty dire when deer get into the preserve,” says Alison Cohan, director of Maui and Moloka‘i Terrestrial Programs at The Nature Conservancy of Hawai‘i and Palmyra, a nonprofit safeguarding biodiversity and endangered ecosystems. “Once you get into a highly evolved and delicate ecosystem like this, it causes major erosion when deer tromp on it.”An average deer’s diet can take out a football field–size area in about two-and-a-half weeks, and Cohan says Hawaiian flora have not adapted defense mechanisms against invasive land mammals. Recovery from this damage can take years. And when it rains in the forests, which is often, sediment and topsoil from picked-clean areas travel downstream and wash through rivers, shore fisheries, and the ocean.Destruction of the watershed, particularly in terms of sediment runoff, is one of the biggest land-based pollution threats to Hawai‘i’s coral reefs. In Hawai‘i, the health of one part of the environment impacts that of another: ‘o ko uka, pēlā ko kai; as in the uplands, so too in the sea, as the saying goes. As Ku‘ulani put it, “It is an understanding that everything is interconnected.” As no other group is working at the level as Maui Nui Venison to manage the deer, Cohan believes Maui Nui Venison is a commendable initiative.To conserve mauka to makai—the mountains to the sea—is to honor the land’s heritage and Hawaiians’ profoundly rooted stewardship of it. Axis deer remain valuable for recreational and subsistence hunting, so not many people see total eradication as an option. Hawai‘i’s Department of Land and Natural Resources’s Division of Forestry and Wildlife permits game hunting on public land, but this practice isn’t controlling the population. Nothing else (commercially, at least) is being done to dramatically reduce the numbers.Working solely on privately owned ranches (where the bulk of the populations reside), Maui Nui Venison currently hunts no more than 30 deer within three hours based on USDA guidelines. But Jake says the USDA is ready to approve them to hunt more. He hopes to get over halfway to balancing numbers in Maui’s most rife areas by mid-2022. “Currently, our operations need to increase substantially to meet the growth, but we will inevitably need to scale back once a more balanced population is reached.” In other words, the company would still be running at that point, but they would hunt and sell fewer deer.My second evening on Maui, Jake picked me up at midnight for an all-night hunt, which he and the team call a harvest. We traveled up the same road to ‘Ulupalakua Ranch, past the sight of infinite eyes sparkling among the brush. The USDA inspector, who was present the entire event, shook my hand, and Maui Nui Venison’s seven-man harvest team greeted me with hugs.I asked why they prefer to call it a harvest. “As hunters ourselves, we recognize that our process is far removed from the long-established experience and practice of hunting,” Jake told me. They loaded two UTVs with tech that, while definitely out of the realm of a typical hunt, allows for a more effective and humane practice. We leaned over an iPad-size Forward Looking Infrared (FLIR) monitor that visualized the deers’ heat signatures. Absent of a moon, the Milky Way cloaked the sky as we bounced along invisible roads. In the vehicle in front of us, two flashlights scanned left to right like a boat crew searching the black seas.We stopped at a light signal I didn’t notice. The UTV headlights went dark and I sat frozen in anticipation. Deer eyes blinked in the distance. Stars blinked in the sky. A shot rang out. A shooting star streaked across the sky. And without fanfare, the UTVs revved up to search for the carcass. When the team found it, they hoisted it onto Jake’s shoulders; the deer was heavy, still, and warm as he traversed through dewy grass to lay it on the bed of our vehicle. The moment was peaceful, reverent. “We are carrying it to the next stage of its life,” Jake reflected.In the course of one evening, Maui Nui Venison hunts, processes, and butchers under the careful examination of the USDA inspector. At night, the deer are relaxed, unable to detect the harvesting team in the dark. The use of FLIR allows the team to spot the animals from afar and harvest without spooking them. The deer die quick, stress-free deaths. This leads to beautifully tender meat, lacking the gamey flavor usually found in venison. “Stress plays a huge factor in terms of how the meat ultimately tastes,” said Bryan Mayer, chief venison officer at Maui Nui Venison, when I visited him the day before the hunt. If an animal is tense before or during harvest, its glycogen stores are depleted, which means “you have less lactic acid to break down the muscle and make it tender.”Before the hunt, Mayer prepared myriad cuts for me and Jake: butterflied leg, strip loin, tenderloin, sirloin, rib chops, and a smash burger (arguably the best I’ve ever eaten). All dusted with salt a day earlier, flash-seared on cast iron, and basted with ghee, rosemary, sage, and thyme. Maui Nui Venison sells the entire animal online, as bone broth, individual organs, ground meat, jerky, and even pet treats. To make its products more accessible for locals, the company offers packs at a discount. For communities in need, it distributes venison through food banks and other organizations addressing food insecurity.Patagonia x Maui Nui Venison Links$9 at Patagonia ProvisionsRestaurant chefs across Hawai‘i and even some on the mainland, including those at Alinea, Saison, and The French Laundry, are putting Maui Nui’s venison on their menus. At Fairmont Kea Lani’s Kō restaurant in Maui, executive chef Jonathan Pasion pays tribute to the deer in two preparations. His appetizer is a thinly sliced grilled strip loin placed atop a Moloka‘i sweet potato bao bun with pickled green papaya and calamansi curd. As a special, Pasion sous vides a rack of ribs and lays it over coconut Filipino adobo with ‘ulu tater tots, Maui sweet onion soubise, and Upcountry persimmon. “The method in which Maui Nui Venison harvests, processes and sells the venison presents a great opportunity to educate our local community on how to foster sustainable living,” Pasion told me.Perry Bateman, executive chef at Mama’s Fish House in Maui, and whose tenure is approaching 35 years, includes the venison on the menu to honor the island’s food resources and to support Maui Nui, which he refers to as a regulator. “Jake and his team have established a legal, humane way of taking care of the problem,” said Bateman. “He’s got a system down, and he can actually turn that invasive problem into food to help a lot of people.” Bateman sears the venison with Mama’s house-made rub of moringa leaf, kukui nut, sesame seeds, and roasted spices, then plates it with a kula kale, shaved fennel, Hana breadfruit, and persimmons salad, as well as a Hawaiian orange vinaigrette made with Maui olive oil and Maui honey. It’s a luxurious balance of the land’s bounty.During one of my conversations with Ku‘ulani Muise, she spoke of the right of a species to thrive in its own home. “I think of a whole host of life forms—the kiwikiu, the ‘iliahi, the curly koa, and on and on—and their right to persist here in their place,” she said. “Though we never relish taking a life, we recognize that alongside many of Hawai‘i’s conservation initiatives, harvesting Hawai‘i’s wild deer, commercially and at the subsistence level, is an important management tool.” From field to plate, the journey of the Axis deer reflects that ambition: protecting endangered ecosystems, providing for the community, and, above all, restoring the harmony of mauka to makai.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-17", "author": ["Condé Nast", "Danielle Bernabe"]}