{"id": "8e363d6468fbc05ecfec8b9836735623", "url": "https://www.bonappetit.com/recipe/ammas-samosas", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Samosas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAmma’s SamosasBy Anju SharmaSeptember 18, 20213.6(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThese savory crispy fried Indian samosas from Amma restaurant in New York are packed with spiced potato filling, bright with lemony notes courtesy of coriander, dried and ground pomegranate seeds called anardana powder, and dried green mango powder, or amchur. Both powders can be found at Indian grocers and online at Kalustyan’s, a Manhattan-based shop that ships nationally.Folding samosas is an ideal group activity as extra hands can be useful, so invite friends or family to join you. If you need more guidance on the technique, we like this video, which shows the process step-by-step. Once your samosas are golden and ready, serve them with homemade or store-bought tamarind and cilantro chutneys or alongside a cooling bowl of raita for dipping.Editor’s note: This recipe was originally published on December 23, 2019.IngredientsMakes 16Filling4medium russet potatoes (about 9 oz. each)2tsp. kosher salt, plus more1½tsp. coriander seeds2Tbsp. ground coriander2tsp. amchoor1tsp. anardana powder3Tbsp. neutral oil (such as grapeseed or vegetable)1tsp. cumin seedsShells and Assembly6¼cups neutral oil (such as grapeseed or vegetable), divided1tsp. kosher salt½tsp. ajwain2cups (250 g) all-purpose flour, plus more for surfaceCilantro Chutney and Sweet Tamarind Chutney (for serving; optional)PreparationFillingStep 1Combine potatoes with enough generously salted water to cover by at least 1\" in a medium saucepan. Bring to a boil over medium-high heat. Reduce heat to medium-low and simmer until potatoes are tender, about 30 minutes. Drain potatoes and set aside until cool enough to handle. Peel potatoes, then coarsely mash with a potato masher or fork.Step 2Crush coriander seeds with the bottom of a measuring cup or the side of a chef’s knife until coarsely ground. Transfer to a small bowl. Add ground coriander, amchoor, anardana powder, and remaining 2 tsp. salt and stir to combine.Step 3Heat oil in a large skillet over medium. Cook cumin seeds, stirring frequently, until fragrant, about 1 minute. Add spice mixture and continue to cook, stirring so spices don’t burn, until just heated through, about 30 seconds. Remove from heat and add potatoes to skillet, folding and smashing into spice mixture to incorporate. Let cool.Shells and AssemblyStep 4Stir ¼ cup oil and ⅔ cup water in a small bowl to combine. Mix salt, ajwain, and 2 cups flour in a large bowl to combine. Stir in two-thirds of oil-water mixture until combined, then gradually add more, stirring constantly, until incorporated and dough comes together in a ball.Step 5Turn out dough onto a lightly floured surface and knead until smooth, about 1 minute. Form dough into a ball and tightly wrap. Let rest at room temperature to let dough hydrate, 30 minutes.Step 6Using your hands, roll dough on a floured surface to a 16\"-long log. Cut crosswise into 8 pieces. Roll each piece into a ball, then flatten to a disk. Roll out each disk to a 6\"-diameter round, dusting often with flour. Cut each round in half.Step 7Working with one semicircle at a time and keeping a bowl of water handy, dip your fingertip into water and moisten straight side of dough. Pull up corners of straight side and overlap the edges slightly to form a cone, leaving rounded side open; press down on the small hole that forms at the bottom of the cone with your finger to seal. Press overlapping sides of cone together to seal (be thorough; you don’t want the samosa to fall apart while frying). Fill with potato mixture, gently pushing into cone with the back of a spoon to compact, until about ½\" from the top. Press top edges of cone together to enclose filling and seal.Step 8Lay samosa on a clean work surface. Press down on newly sealed edge of cone with the side of your hand, cupping your palm around the filling. Using your other hand, bend samosa upright so pointed end is facing up. Transfer to a baking dish or shallow bowl. Repeat with remaining dough and filling. Let samosas sit upright on their own about 10 minutes (this step relaxes the gluten and ensures the samosas won’t burst while frying).Step 9Pour remaining 6 cups oil into a 4–6-qt. Dutch oven or large heavy pot fitted with a deep-fry thermometer. Heat over medium-high until thermometer registers 375°. Working in batches of 3–5, fry samosas until deep golden brown, about 5 minutes. Using a slotted spoon, transfer samosas to a paper-towel-lined wire rack set inside a baking sheet and let drain.Step 10Transfer samosas to a platter. Serve with tamarind and cilantro chutney alongside (if using).How would you rate Amma’s Samosas?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleDoes it matter how finely or coarsely ground the Anardana (ground Pomegranate seeds). are for Samosa recipe?  S Works Cooks CO Rockies11/11/2021Can these be baked instead of fried?Anonymous10/9/2021I substituted pork, celery and napa cabbage for therusset potatoes, coriander, amchoordn ditched the ajwain altogether, made some awesome egg rolls instead!\nThanks for the ideas!Jon Doemidwest9/18/2021Made mine too dense because I didn't roll out the dough thin enough. Didn't have as much flavor as I hoped :/KatiehwalshAustin4/3/2020Delicious! And fun to make. We found all the ingredients at our local Indian grocer, and it was nice trying out new techniques and flavors. jmrhallFlorida3/23/2020Ajwain is available from Penzey's. Amchoor powder is dried, ground mango. Both of these are available at Indian groceries. Try googling \"Indian grocery\" or market and see what comes up in the results. Patel Brothers will ship. Hope that helps!Anonymous1/8/2020Unfortunately, this recipe doesn't say what amchoor or ajwain are, where to find them, nor any possible substitutions . I really wanted to make these, oh well.AnonymousNC1/8/2020Explore Bon AppétitIndianSouth AsianAsianPotatoVegetableRusset PotatoStarterSnackDairy-FreeNut-FreeVegetarianVeganRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-23", "author": ["Condé Nast", "Anju Sharma"]}