{"id": "8e47e1317922787b201470a94d0956cf", "url": "https://www.bonappetit.com/story/maple-syrup-questions-answered", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Maple Syrup: Your Most Pressing Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Most Pressing Maple Syrup Questions, AnsweredEverything you need to know about buying, storing, and using one of our favorite pantry staples.By Sarah JampelJanuary 31, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailDo you only break out the maple syrup for pancake Sundays? Then you’re missing out on the full potential of this liquid gold. A natural sweetener with depth and complexity, maple syrup goes with way more than breakfast. Here we present a collection of tips, techniques, and trivia that will help you pick out a bottle and use it for all it’s worth. (And if you, like us, were ever wondering why so many bottles have a seemingly useless, teeny tiny handle, well—read on to know why.)How do I pick the right syrup?We strongly recommend 100 percent maple syrup. Syrup has a terroir, just like wine, coffee, and chocolate. Not only do the two sugar maple cultivars produce different-tasting syrup, but the syrup is dependent on the air, water, and soil, varying greatly region to region and season to season. Taste syrups from different regions to find out what you like best.Why is it so pricey?Syrup is so expensive because it takes 40 gallons (!) of sap to make one gallon of syrup. Sugaring season runs for just about two months, from early February to late March, in a very small region of the world, predominantly in the Northeastern United States and Canada, which means the supply is limited. But don't worry: Bottles are available year-round.Where should I keep it?To protect against fermentation and molding, keep open bottles in the fridge for up to a year. For indefinite storage, stow syrup in the freezer (it’s too sugary to solidify).Flights of maple syrup.\nPhoto by Winnie AuWhat do all the grades mean?Formerly divided into grades A, B, and C, the bottles at the store today are all Grade A, with USDA descriptors that clearly spell out the hue and intensity. Confused? Just remember: Darker syrup means bolder flavor. Here’s a breakdown.Golden color, delicate taste: Fruity and subtle, it’s easily overshadowed but makes the best substitute for white sugar when baking.Amber color, rich taste: Popular for all-around use, it’s the ideal table syrup for pancakes and French toast.Dark color, robust taste: Bold in flavor, it holds its own in savory dishes like braises and in whiskey cocktails.Very dark color, strong taste: With the most powerful maple flavor, it delivers the biggest bang for your buck—use sparingly!Uh, what’s pancake syrup?Pancake syrup is corn syrup with artificial flavor and color, whereas maple syrup is 100 percent boiled maple sap with 33 to 35 percent water.Can I replace sugar with maple syrup?To substitute maple syrup for sugar in a recipe, follow these rules from Baking with Less Sugar by Joanne Chang. In general, one cup of syrup is equal to one cup of sugar. But decrease the amount of liquid by 3 Tbsp. for each cup of syrup used. If baking, reduce your oven temp by 25° to prevent burning (since syrup caramelizes faster than sugar). Unless your recipe already calls for an acidic ingredient like buttermilk or sour cream, add 1⁄2 tsp. baking soda with the syrup. And experiment at your own risk!Maple syrup makes a good marinade for anything from chicken to tofu.\nPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenIs it only for drizzling?Nope! Try adding a touch of maple syrup to savory foods; its earthy caramel flavor complements bitter, spicy, and salty notes. We like adding it to barbecue sauce, sautéed bitter greens, squash soup, marinades, and mustard vinaigrette.What else can I do with it?Make a crunchy maple topping for yogurt or oatmeal: Toss 1 cup toasted seeds or nuts + 3 Tbsp. maple syrup + 1⁄2 tsp. kosher salt on a parchment-lined rimmed baking sheet and bake at 350° for 15–20 minutes. Let cool, then break into pieces. Store in an airtight container for up to a week.These guys are Maple-Roasted Carrots.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraAny other ideas?Dress up any roasted vegetable with an easy maple glaze: Whisk together 2 Tbsp. each maple syrup, unseasoned rice vinegar, and soy sauce, and 1⁄2 tsp. red pepper flakes. Season with salt. Drizzle over vegetables and toss to coat in the last 5–10 minutes of roasting.Use it to sweeten switchel, a refreshing drink made with apple cider vinegar and fresh ginger.Or use maple syrup to add a glaze-y shellac to pork chops, salmon, bacon, chicken, tofu, carrots, or brussels sprouts.To have on hand at all times.\nPhoto by Chelsea KyleDo you have a favorite brand?Hidden Springs Amber Rich Organic Maple Syrup, with its toasty flavor, is our favorite for everyday use.Buy it: $8 for a half pint at springsmaple.com.Okay, but what’s up with that little handle?It harks back to times of yore, when syrup was collected in big earthenware vessels on which handles were critical. Today, it's just a miniaturized sign to us consumers that what we're getting is a real deal. This sort of design that contains just-for-show characteristics of the original is called a “skeuomorph.” (Use that on your next crossword!)Explore Bon AppétitMaple SyrupRead MorerecipesYour Most Pressing Sweet Potato Questions, AnsweredGallery9 SlidesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-31", "author": ["Condé Nast", "Sarah Jampel"]}