{"id": "8e4fadb9090b0ae3ccd443a7da8dc243", "url": "https://www.bonappetit.com/story/ashtin-berry-restaurant-inclusivity", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Ashtin Berry Takes a Hard Look at the Restaurant Industry—and How It Can Be Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAshtin Berry Takes a Hard Look at the Restaurant Industry—and How It Can Be BetterThe activist and sommelier talks inequality, intersectionality, and how her mom taught her to hold people accountable.By Ashtin Berry, as told to Hilary CadiganOctober 4, 2019FacebookTwitterEmailPhoto by Justin SissonFacebookTwitterEmailOver the past few years, Ashtin Berry has become a nationally recognized name in the food and beverage world. She’s the person restaurant owners call when they want to adjust the culture of their workplace, whether that means preventing harassment, fostering racial inclusion, or reconciling a sensitive issue that’s come up among the staff. Most of the consulting and curriculum-building work she does is under the radar—and often comes with a nondisclosure agreement—but her views on the industry are crystal clear: Things need to change. Here, she shares the roots of her activism, where she is now, and what she’s tackling next. —Hilary CadiganPeople think activism is trendy right now, but I’ve been doing movement building most of my life. My mom had me her last year of high school, then went to college to become a sexual educator. She did a lot of social work and advocacy work, but to her it was just what people do in communities: go to neighborhood meetings, hold people accountable—whether it be the aldermen or the kids on the block. And she was a single mother, so I literally went with her everywhere.My mom always went to bat for me. She’d come to my school and tell my teachers, “You're not going to crush her spirit or her competence just because you think a little black girl shouldn't be opinionated.” I remember in third grade we had to write about the real Thanksgiving. All the kids are writing their little stories about how the pilgrims and the Indians are friends, and then there’s me with this paper my uncle helped me write after we watched a documentary on the History Channel. It had footnotes. All these parents complained: “My kid came home crying because Ashtin said that white people scalped Native Americans.” My mom went to the school and was like, “Where’s the lie?”My first hospitality job was at a Houston’s in Memphis, as a hostess in high school. I studied sociology in college but after quitting a more corporate job, decided to work in hospitality full time. When a restaurant space is great, you see the unity—you see everybody feeding off each other, which is beautiful, and you get to meet people from everywhere. There’s always something new to learn. So I took my wine certifications and once I committed, opportunity after opportunity just presented itself—until I got to a certain level, and found there was a low glass ceiling for black people, and specifically black women, in this industry.Whiteness can be very insidious in fine dining spaces. One time a woman was like, “Oh, could you grab our server, sweetheart?” I said, “I am your server. I’m your sommelier, actually.” She's like, “Oh, really? Good for you. Your parents must be so proud.” I said, “Actually, they're a little bit disappointed that I'm using my University of Chicago degree for this.” Her face just kind of dropped. And then she goes, “Oh, you’re a smart one.” Another time I got written up because I wouldn’t let a customer’s son touch my hair. People think these stories are wild and outlandish but they’re really not. If you go and talk to other black women in hospitality, you hear this stuff all the time.Sixty percent of this industry is made up of people of color, but we occupy less than 7 percent of manager roles. Most of the people in power—the gatekeepers—are white male heterosexuals. As a result, the industry is full of inequity and the physical and structural abuses that come with it, which lead to health problems both mental and physical. And people can’t afford healthcare. They can barely afford to pay their bills.Several years ago, when I was working at the Ace Hotel in New Orleans, I started writing material for an equity program. I was pulling things from my sociology background and my experiences with bystander training and first responder training. I wrote articles about industry abuse and started independently educating people through Facebook, hosting conversations where I was giving people space to work through stuff.Then in 2016 a restaurant reached out to me to help them deal with an incident that had occurred. So I helped create a curriculum for their staff, centered around transformative justice mediation, which is about reconciling both the person who has done harm and the person the harm has been done to. From there, more and more restaurants started calling me, asking me to come in and create specialized curriculums. My framework is intersectionality, which means recognizing how power dynamics and privilege (or lack thereof) are compounded and constructing spaces to be more inclusive in the first place.Ashtin Berry wants to see the hospitality industry change for the better.\nPhoto by Justin SissonI also run a creative content agency called Radical XChange with my business partners, Kisira Hill and Eric King. Our goal is to make hospitality spaces more equitable through events, pop-up forums, and partnerships. Earlier this year, we hosted our first conference, Resistance Served, where we celebrated the contributions of black Americans to the industry with seminars, experiential programming, and cocktail parties with leaders like Michael Twitty, Carla Hall, and Leah Chase.Right now I’m helping two queer black women open a Caribbean bar and restaurant in Baltimore called Bikkle. I believe in the community they’re trying to build, and in supporting access by helping build foundational tools.This work is exhausting and sometimes thankless, but I wouldn't trade it. The relief it gives people to be seen is powerful.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-04", "author": ["Condé Nast", "Ashtin Berry", "As Told To Hilary Cadigan"]}