{"id": "8e52a820a88525aed719387173f46dcb", "url": "https://www.bonappetit.com/story/gado-gado-portland-oregon", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "I’ll Always Save Room For This Flaky Malaysian Roti at Gado Gado in Portland, Oregon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’ll Always Save Room For This Flaky Malaysian RotiIt shingles off into a million layers of fried perfection with each bite. Need I say more?By Emily SchultzDecember 5, 2019FacebookTwitterEmailPhoto by Christine DongFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.For me, travel = lots of eating. Whenever I touch down in a new city, I eat second breakfasts like a hobbit and leave my pants unbuttoned. So after a weekend of non-stop eating during Feast Portland, a food festival in—you guessed it—Portland, Oregon, a couple months ago, naturally, I had plans for where I’d eat my last meal before flying back to New York City. It would be the restaurant everyone couldn’t stop talking about at Feast: Gado Gado.As I rolled into the vibrant new Southeast Asian restaurant with my carry-on, I knew exactly what I would be ordering. I didn’t do my usual “one of everything on the menu” since I was dining solo (there’s only so much my body can take!). I got the thing the Rice Wizard herself (a.k.a. Carla Lalli Music) told me to order: the beef cheek coconut curry with flaky Malaysian roti in place of the rice. Don’t get me wrong: I love a good bowl of steamed white rice, and so does Carla (see here, here, here, and here). But I came for the roti, and Carla did not lead me astray. The bread worked double time, as an edible shovel for pull-aparty pieces of tender beef cheek and a bready mop to sop up all of that aromatic, rich curry.What makes Gado Gado’s roti so special lies in the lamination process. According to chef Thomas Pisha-Duffly, the roti canai you’d find at a hawker’s stand in Malaysia is typically folded four times into a diamond shape. This creates those buttery layers—or in the case of traditional Malaysian roti, margarine-y layers—like you would get with a biscuit or croissant. Gado Gado takes that a step further: After folding the dough the usual four times, they fold the dough onto itself about four more times until it reforms into a ball. Once the ball rests overnight, it’s then rolled out and fried in rice grain oil to order. The result is an almost translucent bread that shingles off into a million layers of fried perfection with each bite. Which is exactly what I needed before my six-hour red-eye flight. Well, maybe that and a juice cleanse.Go there: Gado GadoExplore Bon AppétitHighly RecommendRestaurantsPortland OregonSoutheast AsianRead MorerestaurantsI Fully Endorse Tipsy Wine Shopping at Bar NormanBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-05", "author": ["Condé Nast", "Emily Schultz"]}