{"id": "8e594ea79cac3c3656ae99ded3a5b580", "url": "https://www.bonappetit.com/recipe/brothy-beans-with-kimchi-and-squash", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Brothy Beans With Kimchi and Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBrothy Beans With Kimchi and SquashBy Andy BaraghaniDecember 26, 20194.9(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis stick-to-your-ribs stew gets heft from creamy white beans and winter squash; we opted for acorn, but kabocha or delicata squash would work great too. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings1acorn squash (about 1¼ lb.), halved, seeds removed, cut lengthwise into 1\"-thick wedges1medium onion, thinly sliced6garlic cloves, thinly sliced13\" piece ginger, peeled, thinly sliced2cups chopped Napa cabbage kimchi with liquid2Tbsp. gochujang (Korean hot pepper paste)6cups chicken stock or low-sodium chicken brothKosher salt215.5-oz. cans butter or cannellini (white kidney) beans, rinsed2scallions, thinly sliced4large egg yolks*PreparationStep 1Combine squash, onion, garlic, ginger, kimchi and liquid, gochujang, and stock in a medium pot; season lightly with salt. Bring to a boil over medium-high heat. Reduce heat to medium-low and simmer gently, stirring occasionally, until squash is almost tender, 20–30 minutes.Step 2Add beans to stew and cook until squash is tender and beans have absorbed some of the cooking liquid, 8–12 minutes. Remove from heat; taste stew and season with more salt if needed.Step 3Ladle stew into bowls; top each with scallions and an egg yolk.Step 4*Raw egg is not recommended for infants, the elderly, pregnant women, people with weakened immune systems…or people who don’t like raw eggs.How would you rate Brothy Beans With Kimchi and Squash?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleGreat recipe!  Followed exactly, with no substitutes except that I made 1/2 the portion as we're just two people.  It was my first time trying raw egg yolk in soup, and I really loved it.  It adds a nice richness to the broth and it's not slimy or anything once it's mixed in. So don't be afraid if you are trying it for the first time too.  \n\nNext time I'll add another clove of garlic to better suit my tastes. \n\nI did find the acorn skin kind of finicky to work around while eating, but it's not the end of the world. I might try to peel it first next time as well.  It's a great recipe just as written regardless.JessicaToronto2/7/2022Added enoki mushrooms and subbed seasoned soy beans (found at asian market) for cannelini beans. Eyeballed the measurements and added some fish sauce. OMG. Loved it, tasted restaurant quality. Also loved that it was filling without being heavy. Million stars.TaliaOntario12/23/2021We love this soup, especially as we make our own kimchi and usually have tons hanging around. I'm the only one who puts an egg in it, but the rest of my carnivorous family loves this meal despite no meat. DiDiSisters, OR2/24/2021This is my favorite soup. I usually use kabocha or delicata squash. I add fresh napa when reheating leftovers. I always add the raw yoke :) but have found that a poached egg works well if you can't do the raw...KristenSeattle, WA1/7/2021I make this dish all the time and it hits the spot with every variation I've made!Grace Y12/13/2020Put this together last Friday. Omitted onion, gochujang, and raw egg yolks because, personal preference. Subbed in delicata squash and dried red chile pepper flakes. Used a vegan low-sodium local-ish kimchi, Sunja's Medium Spicy made in Vermont. Added (my attempt at cutting) matchstick carrots. Otherwise followed recipe, including a generous thumb's worth of fresh ginger, six cloves of garlic, low-sodium vegan chick'n broth. DELICIOUS. Spicy and warming for a cold day. Of course, now it's 75 deg F outside. But the point is, this is a delicious soup and I'm glad I added the entire 16 oz jar of Sunja's kimchi. Now I'm got comforting hot lunches for the week. I'm sure this soup would also be lovely served over some hot short-grain brown rice. Thanks for this recipe - it's going into my longterm \"batch meals for the week\" rotation.Urbanite11/9/2020So good. Made it with delicate squash my first time and home made chicken stock!!!\n\n however- unless your veg, I don’t recommend subbing the veggie for the chicken stock.. I did this on a whim and it really wasn’t as good. I think you need the chicken to round out the acid of the onion and kimchi.\n\nDefinitely making it again- with chicken stock m. EmmcoopMontreal10/9/2020Didn't have acorn squash, so I made this with some grilled, diced zucchini. I added some extra diced carrot, and used fresh grated ginger. It was delicious. I plan on making it again. The zucchini was tasty, but the suggestion of delicata squash also sounds delightful. If you're looking for a kimchi brand that isn't super salty, my favorite brand  is Sunja's medium spicy, made in Vermont. It's low in sodium, vegan, but still flavorful and crisp.AnonymousBoston3/29/2020Delicious! Will definitely make again. Very easy and full of flavor. I’m a vegetarian so I subbed the chicken stock with veggie broth and 1 better than boullion cube. Came out delicious! Hannah_KAtlanta, GA1/15/2020So many flavours! Sweet, sour, salty, hot spice 😊 The portions are large as your might expect from an Asian style soup. Easy to prepare. I think it would be very comforting if you had a head cold.\nThanks Andy! Terri HealVictoria BC Canada 1/10/2020Explore Bon AppétitStewSoups and StewsAcorn SquashSquashVegetableCannellini BeanWhite BeanBeanKabocha SquashDelicata SquashWinterFallOne-Pot MealsEasyMainGluten-FreeDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Andy Baraghani"]}