{"id": "8e7284d58ee2015fa2931664c7cc92ac", "url": "https://www.bonappetit.com/recipe/chicken-paprikash-with-buttered-egg-noodles", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Chicken Paprikash with Buttered Egg Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Paprikash with Buttered Egg NoodlesBy Claire SaffitzJanuary 4, 20184.5(64)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintWhat’s more comforting than saucy chicken over buttered egg noodles?? Nothing. To ensure the silkiest, noodle-coating sauce, make sure the sour cream is room temperature so it blends seamlessly into the hot tomato sauce (otherwise, it might separate and give the sauce a curdled look).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketPlate$55 At Bon Appétit MarketPaper Towels$13.45 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEACan Opener$14 At AmazonLarge Skillet$84 At AmazonTongs$13 At AmazonSmall Bowl$13 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonLarge Bowl$18 At AmazonIngredients4 servings½cup sour cream2½pounds bone-in, skin-on chicken thighs (about 6 large or 8 small)Kosher saltFreshly ground black pepper1large onion4garlic cloves3tablespoons unsalted butter, divided3tablespoons paprika¼teaspoon cayenne pepper115-ounce can crushed tomatoes12ounces egg noodles½cup parsley leaves with tender stemsPreparationStep 1Preheat oven to 300°. Take sour cream out of fridge—it needs to come to room temperature. Place 2½ pounds chicken thighs on a plate and pat dry with paper towels. Season both sides with salt and pepper.Step 2Set chicken aside for a few minutes and bang out your other prep. Peel and chop 1 onion. Smash 4 garlic cloves with the flat side of your knife and peel. Open 15-oz. can tomatoes.Step 3Heat a large ovenproof skillet over medium-high. Add 1 Tbsp. butter and swirl to melt. Using tongs, add chicken skin side down and cook, lifting up thighs once or twice to let rendered hot fat run underneath, until skin is golden brown and crisp, 8–10 minutes. Transfer chicken skin side up to a plate.Step 4Pour off fat from skillet into a small heatproof bowl, leaving a thin layer coating the bottom (reserve fat for another use). Reduce heat to low. Add onion and garlic; season with salt and pepper. Cook, stirring often to dissolve browned bits on bottom of skillet, until onions are translucent, 6–8 minutes.Step 5Add 3 Tbsp. paprika and ¼ tsp. cayenne. Cook, stirring constantly, just until onions are evenly coated and spices are fragrant, about 30 seconds (the spices burn very easily, turning them bitter and chalky, so make sure to keep them moving in skillet and have can of tomatoes close at hand).Step 6Add tomatoes to skillet. Fill can two-thirds with water and swirl, then add to skillet. Stir until incorporated, season with several pinches of salt, and bring to a simmer.Step 7Using tongs, arrange thighs skin side up back in skillet (along with any accumulated juices), nestling into liquid but not submerging (you want the skin to be exposed so it stays crispy).Step 8Transfer skillet to oven and roast until chicken is fully cooked and tender enough to release from the bone when prodded with a fork, 35–40 minutes.Step 9About halfway through chicken cook time in the oven, bring a large pot of salted water to a boil. Add 12 oz. egg noodles and cook according to package instructions, stirring occasionally with tongs. Drain noodles in a colander. Transfer to a large bowl, add remaining 2 Tbsp. butter, and toss to coat until butter is melted and noodles are coated. Season with salt and pepper.Step 10Finely chop ½ cup parsley and add half to noodles; toss to coat.Step 11Carefully remove skillet from oven (handle will be hot!). Using tongs, transfer chicken skin side up to a clean plate. Taste sauce and season with more salt and pepper, if needed. Spoon about ¼ cup sauce into a small bowl and stir in sour cream until smooth (this slowly brings up the temperature of the sour cream so it doesn’t split when it hits the hot skillet). Pour back into skillet and stir to combine.Step 12Arrange chicken thighs and juices back in skillet and top with remaining chopped parsley. Serve over noodles.How would you rate Chicken Paprikash with Buttered Egg Noodles?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangleMe too i never saw tomatoes in the paprikas my dad used to make we learn that recepie from my uncle that was hungarian  but everything about the recepie seems to be acurate so im very happy and please to have found this recepie thank you very muchLudivine latulippeNew-brunswick canada2/26/2022I agree that this not paprikas.  Paprikas does not have tomatoes.  \nWinniewomnSan Diego, CA12/11/2021Good post!AnonymousLakewood, CA8/17/2021My mother in law was Hungarian. She did not put tomatoes in her paprikas.....she did add red and green pepper with the onion though. Her spaetzel was to die for! This seems like more of a cacciatore dish with the tomatoes. I wish my paprikas  tasted like hers, but nothing ever does , does it!Anonymous5/27/2021This was yummy! I cooked it on the stove top which I think loses some crispiness of the skin, but was still delicious! I say poo to all the naysayers who claim this is not original, this is the regional dish and there are many variations. So stop your naysaying and enjoy it for what it is! Yummy!Jeff H.Chicago 3/22/2021This is not Hungarian chicken paprikas. Call it what you want, but it's not paprikas.Leo33/21/2021It was soooo good! I cook for 7 so I did 2 family packs of boneless skinless chicken thighs....I used 3 sweet onions and a bunch of chopped garlic - I then added a can of green pepper chopped tomatoes - a can of fire roasted diced tomatoes and can of tomato sauce instead of water...I hit it with a stick blender.....gone in 60 seconds!!!!\nStolzi6Delaware2/3/2021Really great recipe. A great quarantine meal and will definitely be a good cozy meal when the weather gets cold!Detroit, MI10/3/2020I Do love a great tomato-based comfort food, but Chicken Papkrikash isn’t the place for it. My mother’s side of the family is Polish/Hungarian and this was a staple for my youth. \nThe flavor should primarily come from the flavor of the yellow onions and a very fresh Hungarian Paprika. My family’s recipe uses no tomato at all, although I have seen some authentic dishes use a very small amount of tomato paste to riches it a bit (no more than one TBSP).\nIn fact, our family recipe calls for what seems an unheard of Four (4) large yellow onions, but it’s delicious. They key is to slow cook the onions almost like a French cook would simmer their onions in a French Onion soup. The garlic, wine, natural chicken juices and high-end Hungarian paprika create a flavor that is indescribable and delicious. Always use a high fat sour cream as well. You don’t need much, so use the flavorful stuff!  One other change; I usually lightly season and dredge my chicken in flour before pan frying. It helps thicken the sauce in the end.\n\nOtherwise the submitter was spot on in how to cook, making sure to leave a great crisp skin! Egg noodles are lovely. Sometimes I make spaetzel.Viking851Minneapolis 9/20/2020Love this recipe! I’ve made it probably 5 or 6 times and it always comes out delicious. The crispy skin on the chicken is perfect, and I like the amount of spice. I do usually add a touch more sour cream.Anonymous7/22/2020Delicious recipe! I used a smoked hot Spanish paprika. It was damn tasty, but I suspect that Hungarian (if I had it) or a 50/50 hot/sweet mix would have yielded a more nuanced and less Nashville-Hot style paprikash. Skin-on for the win, too, y’all.AnonymousPortland, Ore.5/22/2020Super easy, and super delicious.AnonymousSeattle4/30/2020Can this be made a couple of hours ahead of time and then reheated before serving? I can only cook in the afternoon (plus a max of 15-20 minutes in the evening), so I try to get my meals basically finished a few hours before dinner. Ceebs726Jasper, AL4/29/2020Absolutely loved this dish. Super easy. I had every item needed. This is basically basic pantry items.  I did want my chicken skin to be a bit more crispy so I did turn up the heat to 400 degrees and cooked it for 30 mins. midnightkittenChicago4/14/2020Wow, amazing recipe! Given I made a few tweaks because I didn't have the listed ingredients, I absolutely loved it! Instead of using canned diced tomatoes, I used 2 roma tomatoes as mine were about to go bad. Along with that, I used 1/2 cup water instead of about 1 1/2 mentioned. Additionally, I doubled the garlic and added bell peppers for more nutritional value (added these with the garlic and onion). Also, I had boneless/skinless thighs and these were still so flavorful. It was definitely a major hit with my boyfriend!AnonymousLos Angeles, CA4/14/2020Explore Bon AppétitHungarianEastern EuropeanEuropeanChicken ThighChickenPoultryEgg NoodleNoodlePasta & NoodlesCanned TomatoTomatoVegetableEasyOne-Pot MealsMainNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-04", "author": ["Condé Nast", "Claire Saffitz"]}