{"id": "8e7aad7f886385ddbbaa0e9411264744", "url": "https://www.bonappetit.com/recipe/creamy-curry-egg-noodle-soup", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Creamy Curry Egg Noodle Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCreamy Curry Egg Noodle SoupBy Mehreen KarimNovember 23, 20214.2(88)Read ReviewsTriangleEmailPinterestPrintPhotographs by: Emma FishmanEmailPinterestPrintEmailPinterestPrintThis creamy noodle soup from recipe production assistant Mehreen Karim is like a bowl full of warm hugs. The quick umami-packed broth is made by enriching store-bought vegetable broth with creamy tahini and robust Thai red curry paste, then loaded with chewy egg noodles and wilted kale. (Just make sure you use shrimp free curry paste.) To make this dish vegetarian, be sure to use shrimp-free curry paste; to make it vegan, substitute rice noodles for egg noodles, agave for honey, and coconut oil for butter. Be sure to save any extra broth—it’s great paired with fragrant rice, tofu, or even spiralized zucchini.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSoom Tahini$9 At BA MarketLadle$27 At AmazonColander$11 At AmazonIngredients4 Servings1large leek or 2 medium leeks2Tbsp. vegetable oil5large garlic cloves, finely grated¼cup (or more) Thai red curry paste4cups low-sodium vegetable broth⅓cup tahini (such as Soom)3Tbsp. honey1Tbsp. soy sauce1Tbsp. unseasoned rice vinegar12oz. wide egg noodles1small bunch Tuscan kale, ribs and stems removed, leaves torn into small pieces2Tbsp. unsalted butterPreparationStep 1Trim dark green top from leek; discard. Slice white and pale green parts ½\" thick. Place in a large bowl, cover with water, and rinse, separating rings to remove dirt. Drain; pat dry.Step 2Heat oil in a large pot over medium. Cook half of the leek, stirring occasionally, until softened, about 2 minutes. Add garlic and ¼ cup curry paste. Cook, stirring occasionally to coat leek, until fragrant and curry is brick red, about 2 minutes. Add broth, tahini, honey, soy sauce, vinegar, and 2 cups water and stir to combine. Increase heat to high and bring liquid to a boil. Reduce heat to low, cover pot, and simmer 20 minutes. Taste soup; stir in more curry paste and season with salt.Step 3Meanwhile, cook noodles in a large pot of boiling salted water according to package directions, stirring occasionally, until al dente. Drain and set aside.Step 4Add kale, butter, and remaining leek to soup and simmer, uncovered, stirring occasionally, until kale and leek are softened, 5–7 minutes.Step 5Divide reserved egg noodles among bowls; ladle soup over.How would you rate Creamy Curry Egg Noodle Soup?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis was great! Very flavorful! I used veggie broth and coconut aminos instead of soy sauce. My Thai curry paste is spicy and I knew that going in so I mixed the spicy one and a less spicy one and it’s prefect. We do like spicy food though. \nI also added more veggies. Lastly I put the noodles in the bowl some fish on top and the soup over that. The soup cooks the fish to perfection. Also I never add salt like a recipe calls for. It’s always (yes I said always) too salty. Thai curry paste and coconut aminos are salty and knowing this I didn’t even salt a little while cooking. In the end I didn’t feel this recipe needed any extra salt. It’s a wonderful!! Will make again!! Kerri Richmond, Va 3/9/2022Delicious but I forgot the leeks so I used an onion & shallot. I’m sure I will make again. Gloria Los Angeles 3/7/2022Fortunately, I read the reviews before making this. I didn’t add any salt at the time the instructions called for it. I figured I would wait until the end to decide how much to add. I ended up not adding any salt to it at all. That being said, while the flavor was good, it still needed a little boost. I added 1t Penzey’s Bangkok spice blend, and four dried Burma Spice Kaffir Lime leaves during the simmer. I also added more veggies with the kale: carrots, spinach, mushrooms. \n\nI will make it again, possibly adding coconut milk (as another reader suggested), and a chili pepper, though it is fine without those additions.Kimberly PPhx, AZ2/7/2022Although packed with many ingredients, the broth surprisingly lacked flavor. We won't be making again.MUSan Francisco, CA2/1/2022This was so bad! Made the recipe exactly as it was written and it was inedibly salty. To salvage it so we had something to eat for dinner I added coconut milk, chicken broth, chili oil and water. Edible after adding those but still not great. Would not make again. Maybe if you used 1/3 the salt the recipe calls foeIngridLos Angeles, CA1/29/2022Delicious but wish I had read the reviews first because mine was also too salty. Will make again as the recipe states, but leave seasoning until the very end. Very tasty though! Spatulacity Los Angeles1/26/2022This soup is yummy with these alterations: homemade chicken broth, 1/2 shredded chicken, less salt and honey, spinach instead of kale, with all leeks sautéed at the start.Anonymous1/25/2022Before cooking I wish I had read the reviews! The soup is delicious, but yes, too salty as written. Otherwise delicious! I used homemade chicken stock so it was extra rich, and added a bit extra acid and curry paste. SpatulacityLos Angeles1/22/2022Delicious! As with other reviewers who liked this dish, I used about 2 tsp (not 2 Tbsp) of salt, then salted a bit more to taste at the end; I used about half the honey that was called for. Although the soup was delicious as is, I doctored it a bit at the end with a few extra dashes of soya sauce and vinegar, and a splash of fish sauce that really seemed to light it up. Really easy, fast, yummy meal that can accommodate whatever veggies need using up. It would be good with a protein too if you wanted to go that way (shredded chicken, shrimp, tofu...) but is fully satisfying without. This one will go into regular winter rotation!LisaTruckee, CA1/5/2022Really good and easy, I didn’t add much salt because the red curry paste I use already has salt. I found topping with finely chopped kaffir lime leaves (store them in the freezer when you find them)  was extra yummy and bright. L.HarrisonLongmont, CO1/4/2022The review starting out of this world was spot on. I even made it next with onions and green Thai curry. Yum!Retired BobSanta Barbara1/1/2022This was out of this world. The flavors were amazing. Based on other reviews, I reduced the salt to two teaspoons and just did one tablespoon of honey. It was a perfect soup for a winter night.JessT77Wisconsin12/30/2021So delicious after a few Christmas days with red meat!  The red Thai curry is not too spicy!  Just right!!  We rate our food recipe adventures 1 - 10.  Hubby gives it a 12!AnonymousWhitehall, Michigan 12/28/2021Great recipe. Didn’t use that much salt, but did stick to the correct amount of honey and it was too sweet. Might be my honey, but I’m going to use 1 tablespoon next time. GretaSacramento CA12/23/2021Interesting flavors in the broth with the tahini / curry combo that didn’t end up being a favorite, but glad I gave it a try! Overall pretty tasty and comforting, great textures with the noodles and kale. I took other reviewers’ advice and reduced the salt by about half to start and added a touch more at the end.Karina BenloucifBrooklyn, NY12/23/2021Explore Bon AppétitVegetarianEgg NoodleNoodlePasta & NoodlesCurrySoupDinnerWeeknightEasyVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Mehreen Karim"]}