{"id": "8e8132390d5397e331005517937fb6f6", "url": "https://www.bonappetit.com/story/gabriela-alvarez", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Gabriela Álvarez Is Feeding NYC Activists Healthy Food With Puerto Rican Roots | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGabriela Álvarez Is Feeding NYC Activists Healthy Food With Puerto Rican RootsThe chef and founder of Liberation Cuisine is our Superpowered NY honoree.By Jasmine LeeOctober 9, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWe're honoring Gabriela Álvarez as part of Healthyish Superpowered, a new kind of dinner party celebrating women around the country who are redefining wellness. We'll be partying with Álvarez and our partner Caviar at Dimes in New York on October 9th. Tickets are sold out, but there are still some left for our after party at the Fat Radish. Wherever you are, you can read all our Superpowered stories here.To celebrate her quinceañera, Gabriela Álvarez had hoped to go to Puerto Rico with her family, but money was tight that year and they couldn’t make the trip. Fifteen years later, they all bought tickets and planned to take a proper trip for her thirtieth. Then, a month before they were set to fly, Hurricane Maria hit. Everyone called off the trip except Álvarez, who, after consulting with the nonprofit arts and social justice organization AgitArte, decided she would go and offer her support to their team of local organizers.As we sat in the living room of her one-bedroom walk-up in Williamsburg, Ávarez tells me about arriving in storm-battered San Juan and going to work in AgitArte’s collective kitchen in the northern district of Santurce. For two weeks, Álvarez, along with other volunteers, sourced whatever ingredients were available for nightly meals—mostly vegetables and grains. They prepped and cooked without electricity for most of the day. And every evening—over arroz con salchicas, vegetable guisado, and salads made from kale and beets that she brought in her suitcase from New York—a small community would gather to make sure that friends and loved ones were getting along alright.I point out the obvious: that rolling up your sleeves and flying to a disaster area on your 30th birthday just isn’t typical for most, but Álvarez downplays it. “The trauma and shock that people down there are experiencing is intense. Everyone has to eat, and, in moments of climate disaster, food can be warming and supportive as well,” she says. “Folks were laughing because they had never eaten so little meat and drank so much water.”Álvarez, who identifies as a queer cis woman of Puerto Rican descent, is no stranger to community organizing. As a second-generation Boricua in Brooklyn, she grew up shopping at the Park Slope Co-op with her mom, who, since the 1990s, has been successfully managing her lupus symptoms through organic foods and holistic medicine before “healthy was in.” Her dad is also a longtime political organizer who has fought against racial discrimination and for affordable housing at Broadway Triangle, and has marched in support of the political prisoner Oscar Lopez Rivera. She’s still close with her parents, who live below her in the ground-floor apartment of their three-story brownstone.Álvarez studied community health at Brown University, where she found the food on campus to be over-priced, over-processed, and close to inedible. So in her second year, she scraped together some money for a kid’s bike from Walmart to lug groceries from the nearest Whole Foods back to campus. In her dorm’s shared kitchen, she’d meal prep her own food every week—much to the confusion of her classmates.Cooking for herself, and eventually for her friends, helped Álvarez acclimate to the hostility she felt in the predominately white, affluent Ivy League environment. She says, “It got to a point where my mom sent me a Louise Hay CD to fall asleep to and was texting me daily affirmations, which I would share with all my friends who were having similar experiences. I would work up the strength to just power through.” Although she was a minority peer counselor on campus and an active member of the students of color advocacy group, she didn’t figure out that food could feed a movement until after college.In 2014, after going to culinary school, she founded Liberation Cuisine, a small food business, to nourish and support the tireless work of activists and volunteers on the front lines. She credits her mom for inspiring her to see food as medicine, and says she wants to create a new standard when it comes to feeding organizers in her community, who, like herself, have difficulty fitting in a nourishing meal during intense periods of action. Liberation Cuisine’s “health-supportive” menus center the healing potential of traditional foods from the Caribbean, with a heavy focus on plant-based ingredients and integral dishes of Afro-Puerto Rican origin, like caldo santo, which are often left out of mainstream narratives on food from the region.  According to Álvarez, “People tend to think of meat and fried foods when they think of Puerto Rican cuisine, but it’s so much more than that.”Álvarez sees the fight for food justice as a fight to curb the negative effects of displacement and gentrification. She works with El Puente, the arts-for-social-justice youth organization in her neighborhood, teaching sustainable food practices and leading workshops on seed sprouting and food preservation. “I'm constantly thinking about a long-term vision of a new world where your health isn't based on your skin color or the income of the family you're born into and where the land is tended to in a way that supports both her and us,” she writes to me in an email later.By November, Liberation Cuisine will have completed their first season of community-supported agriculture “bundles,” which include organic produce from Rock Steady Farm & Flowers (an queer-owned farm up in Millerton, NY), accompanying vegan and gluten-free recipes (for dishes like garbanzos a la criolla, pastelon, and cucumber watermelon salad) by Álvarez, herbal medicine blends crafted by plant healer Sára Abdullah, acupuncture sessions with Dr. Naïka Apeakorang, and weekly astrology updates by Giselle Castaño. The bundles are an expression of Álvarez’s belief that wellness is more than what you put into your body—it’s about what you put into your community and how you build solidarity across others, too.The breadth of Álvarez’s activism is staggering, but she’s aware of the importance of maintaining a balanced lifestyle so that the work can continue. In addition to interpreting astrology, she refers often to an old tarot deck for clarity in decision making, a practice which she calls “intuition tuning.” When I ask her how she plans to spend her next birthday, just weeks away, she tells me she’ll be feeding herself three square meals a day and practicing yoga at a residency up in Vermont. Her goal, she says, is to process and prepare for the fights to come.Explore Bon AppétitHealthyishSuperpoweredNew YorkPuerto RicoSustainableprofileRead MoreLifestyleSimone Jacobson Is the Cultural Connector D.C. Needs Right NowBy Jessica SidmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Jasmine Lee"]}