{"id": "8e8468a949e3379dfc7ab061b992f808", "url": "https://www.bonappetit.com/recipe/broccoli-and-cashew-cream-soup", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Broccoli and Cashew Cream Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBroccoli and Cashew Cream SoupBy Hetty McKinnonSeptember 5, 20213.7(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintBroccoli soup should be foundational in everyone’s weeknight cooking. It can be a dress-it-up or dress-it-down situation—packed with cheddar to bring that familiar oozy saltiness, or decked out with a mac and cheese topping (the recipe is in my book Family and it’s a serious game changer), or simply served with croutons. This unintentionally vegan version is pared back yet doesn’t lack complex flavors or indulgence. Cashew cream adds body (you could actually use it to thicken any type of vegetable soup) and creates a cloudlike consistency. —Hetty MckinnonThis is part of our meal planning package, where one recipe can become three quick weeknight meals. Use the rest of your batch of cashew cream to make Roasted Carrots and Chickpeas With Herby Cashew Cream or Creamy Cashew Udon With Crispy Mushrooms.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonBlender$32 At AmazonImmersion Blender$100 At AmazonChef's Knife$34.53 At AmazonIngredients4 servingsCashew Cream1cup raw cashews1garlic clove, coarsely chopped1Tbsp. extra-virgin olive oil½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltSoup2medium heads of broccoli (about 1½ lb.)2Tbsp. extra-virgin olive oil1leek, white and pale green parts only, thinly sliced4garlic cloves, coarsely chopped2tsp. fennel seeds4cups low-sodium vegetable broth1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼cup tender dill sprigs, plus more for servingFreshly ground black pepperPreparationCashew CreamStep 1Bring a large saucepan of water to a boil, then remove from heat. Add cashews and let sit until tender, 30–60 minutes.Step 2Drain cashews and transfer to a blender (preferably high-speed) or food processor. Add garlic, oil, salt, and ½ cup water and purée until smooth.SoupStep 3Cut broccoli into 1\" florets. If your broccoli has a long stem, peel tough outer layer, then slice stem ¼\" thick.Step 4Heat oil in a large Dutch oven or other heavy pot over medium. Cook leek, stirring often and reducing heat if needed to avoid leek taking on any color, until softened slightly, about 2 minutes. Add garlic and fennel seeds and cook, stirring, until fragrant, about 1 minute. Add broccoli and broth and increase heat to medium-high. Cover pot with a lid, setting it slightly askew to allow steam to escape (this will help the broccoli maintain its vibrant green color). Bring to a boil and cook until broccoli is tender, 8–10 minutes.Step 5Working in batches if needed, transfer broccoli mixture to a blender or food processor and add salt, ¼ cup dill, and ½ cup cashew cream. Blend until soup is smooth. (If the soup is no longer hot, you can return it to the pot and reheat gently before serving.)Step 6Divide soup among bowls and drizzle with remaining cashew cream. Top with a few dill sprigs and season with pepper.How would you rate Broccoli and Cashew Cream Soup?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI haven’t tried this yet, but sounds delicious \nI would really appreciate you posting nutrition information with recipes \nThank you Jojostpete Florida 1/30/2022I'm surprised this one has a relatively low rating - I thought it was well-balanced! I am a fan of fennel though, and I did add some extra garlic. Make sure you're using a broth you really like (I've been on a Better than Bouillon kick)MichellePittsburgh, PA11/20/2021Cashew cream definitely saves this soup. I used half the fennel seed and garlic and it’s still largely washed out with tannins and alliums. Cutting with dill is essential. \n\nI’d make this again as an immunity booster but not a crowd pleaser. Cambro Vancouver WA9/24/2021I enjoyed this recipe. The cashew cream does add a velvety texture and rich flavor. I used fresh fennel instead of seeds so mine fennel was the right amount. My local grocery was out of leaks so I used scallions and added a couple small potatoes for texture. I loved it and haven’t had broccoli soup in years. It was a treat. My only negative was I kept forgetting to put the lid so stream could escape preserving the green color. Oh well it tasted really good and worth making it a regular monthly meal. Paris Eden Los Angeles, California 9/15/2021It has potential but to much fennel seeds I will recommend to use one tsp. Or lessCarlosAustin Texas9/13/2021I like the vegan approach to this soup, I can get lactose free cream,but using cashew is greatGillianToronto Ontario Canada9/6/2021Explore Bon AppétitBroccoliVegetableSoupVeganVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-05", "author": ["Condé Nast", "Hetty Mckinnon"]}