{"id": "8e9a50dd6ec85258f1b10db9a736e445", "url": "https://www.bonappetit.com/story/how-i-saved-thanksgiving", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "How My Brother-in-Law Stole Thanksgiving—and How I Got it Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow My Brother-in-Law Stole Thanksgiving—and How I Got it BackI had totally given up on the holiday, until the time I managed to save it entirely.By David TamarkinNovember 6, 2018FacebookTwitterEmailIllustration by Jan BuchczikFacebookTwitterEmailOne year I went home and discovered where I was: benched. It was the day before Thanksgiving. I had just fetched the rolling pin and barely tied on my apron when my mother looked over her shoulder and told me— casually, like it was no big deal—that Adam, my brother-in-law, had already made the pie dough. It was resting in the freezer. “Adam is doing the pies this year,” she said.Recently, I called up my mother and asked her if she remembered this fateful moment. “I do remember,” she said. (Her voice was calm. I couldn’t believe she was admitting this.) “It was four or five years ago.”It was 11 years ago, but who’s counting? I certainly remember it like it was five minutes ago. I put the flour away, untied the apron, died inside, and asked my mom what I was making. “I don’t know, sweetie—what do you want to make?”Here’s how I didn’t reply: I want to make the damn pies, sweetie.Instead, I think I said I’d help my sister with the brussels sprouts.Pie duty had shifted to my brother-in-law for some good reasons: He and my sister and their kids show up to Thanksgiving several days earlier than I do. For them, Thanksgiving is an entire week; for me it’s a long weekend. What with all that free time, getting the pie dough out of the way and sticking it in the freezer—it makes sense, right? Totally not a personal assault on me!And the fact that Adam is a great cook and a meticulous piemaker...the fact that his pie crusts come out of the oven puffed, golden, and gorgeously latticed...the fact that my crusts look great going in but come out resembling a patchwork of old arthritic fingers... none of this had any bearing, I’m sure.For a few years I’ll admit that I simply gave up. I poured some nuts into a bowl and pushed them into the hands of one of my football-watching uncles. “It’s an hors d’oeuvre,” I said. Another year I think I picked up some twigs from the backyard to contribute to my sister’s centerpiece, but I can’t really remember. Mostly, I just watched Adam. I’d hang out in the kitchen and pretend not to notice as he rolled out crust after crust.I didn’t come out of Thanksgiving retirement until two years ago, and then it was only because two crises converged: climate change and our lack of oven space. Suddenly it was 72 degrees and sunny in Ohio on Thanksgiving, which was terrifying but also felt right—hadn’t my personal Thanksgivings been a natural disaster since I was taken off pie duty? Since we’d always struggled with oven space on Thanksgiving, I raised my hand and suggested we grill the turkey.And just like that, I had the turkey gig.I spent the day in the sun, tending to a turkey that got striped with char marks and covered in a crackly, glossy skin. Last year I was so proud of the bird that I kept stealing glances at it while it rested. Adam helped me carve the turkey, and as we did it the skin shattered into small glassy pieces. Here’s what I didn’t say: Will your pie dough flake like that?Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-05", "author": ["Condé Nast", "David Tamarkin"]}