{"id": "8ea2e70a035624a1e77847f09f114016", "url": "https://www.bonappetit.com/story/micahs-mixx-lemonade", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "The 10-Year-Old Businessman Behind Micah’s Mixx, Philly’s Favorite Lemonade | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 10-Year-Old Businessman Behind Philly’s Favorite LemonadeMicah’s Mixx started out as a homespun stand. Now it’s a booming business with plans to expand.By Micah Idris Harrigan, as told to Adam EraceAugust 19, 2020FacebookTwitterEmailPhoto by A Brilliant Dummy / Tiayrra BradleyFacebookTwitterEmailMicah Idris Harrigan is the prince of the muggy South Philly summer. The 10-year-old entrepreneur sells cold cups of homemade lemonade—five flavors, plus a weekly special—at his pop-up stand, Micah’s Mixx, which draws both social media fans and random passersby seeking a way station when the city’s concrete sidewalks are hot as pizza stones. Sure, lots of kids put up lemonade stands, but Micah’s Mixx isn’t some cutesy piggy bank project; Harrigan has an LLC, branded merch, and his own debit card for expenses, thank you very much. Here, the bottled-beverage tycoon-in-training explains how he got his start and what the future might hold. —Adam EraceLemonade is my backup plan. My dream job is to be a soccer player, but my mom was like, “Before you start all that, you need a plan B,” and that’s how I came up with the idea for Micah’s Mixx around a year and a half ago. I just love lemonade because it’s one of the only foods or drinks that doesn’t have a ton of ingredients in it. I’m picky so I like simple stuff that tastes good. My business combines my love for lemonade and my love for helping people. Hard times are happening due to coronavirus, and lemonade can make people happy and refreshed.We used to make the lemonade at home. My mom ordered a bunch of ingredients, and we set up her old bartending stand with a handwritten sign outside our house. We have five flavors: classic lemon, strawberry, blue raspberry, watermelon, and peach. We also have special editions every day, like cherry-lime, lavender, and mango. We sell it for $3 for a bottle, or two for $5.At first we sold out (my family and mom’s friends always bought it), but it got cold so we didn’t do many stands. Then COVID-19 came, and we had to wait a couple more months before we could start up again. This summer we started doing more pop-ups and collaborations around Philadelphia. The first was with Rally Coffee, and it was the most lemonade we ever sold: 150 bottles in less than an hour. A lot of people have gotten to know me because of these pop-ups. Social media has also helped. It’s been a chain reaction: We went from 137 followers to 800 followers in less than a week, and today we’re at 3,800. Now we have a kitchen that we work out of. It was taking over my mom’s kitchen.Micah's Mixx, up close\nPhoto by A Brilliant Dummy / Tiayrra BradleyMost businesses don’t start out like that. A lot of people in my neighborhood are saying it’s good to have Black businesses going up, because in old times, Black people didn’t have as many chances as white people to do something. So you see a Black kid starting his own business, and he’s becoming really popular. That seems good to everyone.It feels awesome that I have achieved something in my life at a very young age. I’m inspired by other businesses: Amazon, Microsoft, Walmart, Target, and video game companies. I like video games. We work every day—one day we’re preparing the lemonade, one day we’re selling—but we take breaks and I’ll play Roblox or Minecraft. I don’t really play Fortnite anymore. Too much drama with the players online.Micah’s Mixx wouldn’t be possible without my mom. Working with her is the best. She has two jobs, second-grade teacher and bartender—she can cut a box of fruit in seconds! Teaching is to pay for house expenses, and bartending is to pay for the things that we do for fun. My mom taught me to work for what you need. We have been best friends my whole life, and I love her. She is my partner in business, and always will be.The man behind the lemonade stand\nPhoto by A Brilliant Dummy / Tiayrra BradleyShe’s the money person. She won’t even let me buy an Oculus Rift! She’s saving the money for me to go to college, but I would also like to save up to go back on the same four-day cruise to the Bahamas I went on for my ninth birthday. The food was amazing, especially their chicken noodle soup. I would get it every night for dinner, even though it was 100 degrees outside. It was really nice to get to see a lot of new places from my culture, because in the Caribbean there seemed to be a lot of Black people.We’re also saving for a trailer to sell our lemonade on the road. My mom told me it’s better to go to different places so more people know you. If we just stayed in South Philly the whole time, we’d only get the same customers. In a couple of years, I think I might have a storefront, maybe two if we’re lucky. We would sell out of restaurants, we would have advertisements, and have a lot of other businesses as our friends.School’s online next year, so I’ll do my work and then make lemonade, I guess. I’m transferring to a performing arts school. I sing. I can dance too. And act. Soccer, singing, dancing, acting, lemonade. I’m a penta-threat.Explore Bon AppétitPhiladelphiaFirst PersonRead MorecookingThe Lemoniest Lemonade Recipe Tastes Like Liquid SunshineBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-19", "author": ["Condé Nast", "Micah Idris Harrigan", "As Told To Adam Erace"]}