{"id": "8ea6f44bff14d13635c00d353ac067da", "url": "https://www.bonappetit.com/recipe/cognac-punch-swizzle", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Cognac Punch Swizzle Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCognac Punch SwizzleNovember 23, 20213.0(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. EmailPinterestPrintEmailPinterestPrintIf you think of cognac only as that bottle gathering dust in the back of your liquor cabinet, it’s time to reconsider. This spirit’s depth and complexity make it the ideal base for a warming winter cocktail, as in this fruity, peppery punch swizzle from cocktail expert Shyretha Sheats. Where a traditional punch recipe might call for orgeat (almond syrup), Sheats substitutes a creamy condensed milk and pineapple syrup for a tropical vibe. The syrup’s yield is party-size (about 2 cups): Scale up the rest of the ingredients for 12 servings, then batch the drink into a punch bowl, or make just a couple of servings and save the extra syrup for drizzling over ice cream or pound cake. Sheats loves Pierre Ferrand cognac, particularly the Ambré or the 1840 Original Formula, for its quality and price point.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonMesh Sieve$13 At AmazonHeatproof Measuring Cup$18 At AmazonSmall Saucepan$155 At AmazonIngredientsSyrup1cup pineapple juice1cup sugar1sprig sage1sprig thyme30black peppercorns1cup sweetened condensed milkAssembly1½oz. cognac (preferably Pierre Ferrand Ambré or 1840 Original Formula)¾oz. Cocchi Aperitivo Americano¾oz. fresh lemon juice1tsp. absintheAngostura bitters and orange twist (for serving)PreparationSyrupStep 1Bring pineapple juice, sugar, and 1 cup water to a boil in a small saucepan. Cook until reduced by half and slightly thickened, 8–10 minutes. Remove from heat and add sage, thyme, and peppercorns. Let sit 10 minutes. Strain syrup through a fine-mesh sieve into a large measuring glass or small bowl; discard solids. Let cool completely, then stir in condensed milk. Chill pineapple syrup until cold, at least 30 minutes.Do ahead: Syrup can be made 3 days ahead. Cover and keep chilled.AssemblyStep 2To make 1 cocktail, combine cognac, aperitivo, lemon juice, absinthe, and ¾ oz. pineapple syrup in a Collins glass. Fill halfway with crushed ice. Using a bar spoon or other long-handled spoon, mix by rotating handle between your palms until cocktail is combined and glass is frosty. Fill to rim with more crushed ice. Top with a few dashes of bitters and garnish with an orange twist.How would you rate Cognac Punch Swizzle?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIt's a punch, hence okay, but for the love of all that's sacred, just use a decent brandy. Not, please, NOT a Martel Cordon Bleu or equivalent. A VS, or, if you must, a VSOP will do just fine. Wasting an aged brandy on punch is, or certainly should be, criminal.Leon JesterSouth Central Virginia12/9/2021To be fair, I have no idea what the resulting drink \"should\" taste like.  That being said, I thought it was pretty tasty, though not wholly to my liking.  For the pineapple syrup, I found the herbs and Sweetened condensed milk overpowered any pineapple flavor.  Next time I'd increase the pineapple, or decrease the sweetened condensed milk.  I may have added too much herb as well (one \"sprig\" for sage is a little subjective... my sage was healthy and had very large leaves) so I'd scale it back next time, and maybe add some warmer spices like nutmeg... maybe slightly crush the peppercorn.  \n\nMade two cocktails - the first to the recipe, and the second omitting the Absinthe and adjusting the ratios so it was less acidic.  I much prefer it sans absinthe, but again, that's just my flavor preference.  Spatula City 123Los Angeles, CA12/9/2021Explore Bon AppétitHoliday DrinksAlcoholicCocktailDrinks AllCognac/ArmagnacRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast"]}