{"id": "8ea955aa816eaaabbc907617c6bc497d", "url": "https://www.bonappetit.com/story/le-creuset-heart-shaped-cookware", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Le Creuset Is Selling Heart-Shaped Cookware in Time for Valentine's Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLe Creuset Is Selling Heart-Shaped Cookware in Time for Valentine's DayAnother excuse not to go out.By Melissa MintonJanuary 17, 2018FacebookTwitterEmailLe CreusetFacebookTwitterEmailGetting a dinner reservation on Valentine's Day is perhaps one of the most stressful, daunting, and difficult tasks that any couple can face. But this year, Le Creuset is giving everyone (taken or otherwise) another reason to stay home with their new heart-shaped cookware.The company, known for unbeatable enameled dutch ovens, recently launched red and pink-colored ramekins, cast iron cocottes, and even a small fondue set for the most classic Valentine's Day meal. The heartwarming collection will run you $30 for the ramekins, $50 for the fondue set, and $150 to $200 for the cocotte, but who can put a price on love?Lately, Le Creuset has been hard at work, churning out new color-schemes and shapes to keep up with every trend imaginable. Last year, there was the introduction of millennial pink, also known as \"Sugar Pink Matte,\" items, which seem to have found new life in the Valentine's Day collection. There was also a Snow White-themed collaboration with Disney and, most recently, a \"Provence\" lilac color, inspired by the lavender fields of Southern France—and perhaps, 2018's Pantone Color of the Year.As for your Valentine's Day menu, those ramekins are just begging to be filled with chocolate soufflé (it's easier to make than you think). Throw some bourbon and beer in with your cheese fondue, and the meal will taste just as on point as the presentation looks. The only downside: Irregularly-shaped dishes still need to be cleaned. What better way to spend your night on Valentine's Day?Le CreusetLe CreusetLe CreusetRelated: How to Pair a Classic Whitman's Sampler with CheeseExplore Bon AppétitTrends + NewsShoppingTrendsRead Moreculture6 Red Wines to Make a Date With on Valentine's DayBy Marissa A. RosscultureChocolates We Aren't Embarrassed to Give on Valentine's DayBy Bon AppétitcookingBA-Approved Valentine's Day Menus for All Kinds of CouplesBy Marilyn HeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-17", "author": ["Condé Nast", "Melissa Minton"]}