{"id": "8ec593b35b70ccfe941ab7e9fd683ee5", "url": "https://www.bonappetit.com/recipe/scallops-with-red-aguachile-and-pickled-onions", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Scallops With Red Aguachile and Pickled Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueScallops With Red Aguachile and Pickled OnionsBy Marcus SamuelssonDecember 1, 20204.0(2)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintPretend you’re on the coast—and not your house in the dead of winter—with this bright and spicy aguachile. This recipe for aguachile, which translates to “chile water,” gets its kick from fresh and dried chiles, lime juice, hot sauce, and a surprise secret ingredient: Worcestershire sauce. You’ll get a thin but powerful sauce that adds brightness and heat to raw scallops.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’Ingredients8 appetizer servingsPickled onions1medium onion, very thinly sliced⅓cup fresh lime juice2tsp. dried Mexican oregano (optional)Aguachile and assembly2dried chiles de árbol, stems and seeds removed4Fresno chiles, stems and seeds removed, coarsely chopped½cup fresh lime juice1Tbsp. Worcestershire sauce2tsp. hot sauce (preferably Tapatío)Kosher salt16sea scallops, side muscle removed1medium English hothouse cucumber, thinly slicedCilantro with tender stems and saltine crackers (for serving)PreparationPickled onionsStep 1Combine onion, lime juice, and oregano in a small bowl and toss to combine, squeezing onion gently with your hands to soften. Cover and chill until ready to use.Aguachile and assemblyStep 2Toast chiles de árbol in a dry small skillet over medium heat, shaking pan often, until fragrant, about 1 minute. Transfer to a blender and let cool slightly.Step 3Add Fresno chiles, lime juice, Worcestershire sauce, and hot sauce to blender and purée until smooth; season aguachile with salt.Step 4Thinly slice scallops into thirds crosswise to make thin rounds. Divide among shallow bowls or arrange on a platter and season with salt. Spoon aguachile over and around scallops. Top with cucumber, pickled onions, and cilantro. Serve with crackers alongside.How would you rate Scallops With Red Aguachile and Pickled Onions?Leave a ReviewTell us what you thinkExplore Bon AppétitCevicheMexicanLatin AmericanScallopShellfishSeafoodEasyStarterNut-FreeDairy-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}