{"id": "8ec682e2fa0544618211780659344b89", "url": "https://www.bonappetit.com/recipe/brown-butter-peach-cobbler", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Peach Cobbler Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueBrown Butter Peach CobblerBy Ben BynumJune 2, 20204.8(40)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintBen Bynum, co-owner of Philadelphia restaurants Warmdaddy’s, Relish, South Jazz Kitchen, and Green Soul, packs his favorite summer dessert with yellow Jersey peaches macerated in cinnamon, brown sugar, and mace. Then he pours brown butter on the bottom of the baking dish and adds his batter one ladleful at a time to create a ripple effect, which after baking yields crunchy constellations of caramelized bits.Ingredients8–10 Servings5peaches (about 1½ lb.)2Tbsp. dark brown sugar1tsp. ground cinnamon½tsp. ground mace2cups (400 g) granulated sugar, divided1cup (2 sticks) unsalted butter2cups (250 g) all-purpose flour1Tbsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2cups whole milk1Tbsp. vanilla extractPreparationStep 1Place a rack in middle of oven; preheat to 375°. Peel skins from 2 peaches. Halve and remove pits from all of the peaches. Slice ¼\" thick. Transfer to a large bowl; add brown sugar, cinnamon, mace, and ¼ cup granulated sugar and toss to combine. Let sit while you prepare the topping (at least 20 minutes).Step 2Cook butter in a small skillet over medium heat, stirring often, until it foams, then browns, 5–7 minutes. Pour brown butter into a 13x9\" baking dish. Whisk flour, baking powder, salt, and remaining 1¾ cups sugar in a medium bowl. Whisk in milk and vanilla, then pour batter into baking dish by the ladleful so butter swirls and mixes into batter. Top with peaches.Step 3Bake cobbler until golden brown and bubbling around the edges, about 1 hour. Let cool slightly before serving.How would you rate Brown Butter Peach Cobbler?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleIf I could give an extra star, I would - so would a few of my guests at the barbecue last week.  I trusted bon appetit - found some great peaches at Whole Foods, used good butter, put it together as guests arrived and in to the oven it went.  When I took it out of the oven, it smelled soooo good!\nOK - its time to serve dessert - I put the plates, ice cream and utensils out and tell everyone to dig in. After everyone was served, a few went back to the baking dish to scrape the pan.  The comments were very, very good . . .\n\"Best cobbler I've ever tasted\"\n\"I haven't tasted a cobbler this good in 20 years\" (must've been his nana's cobbler)\n\"I can't stop eating it\"sandCorrales NM8/3/2021Absolutely delicious!! I wanted to do something a little different than a regular cobbler with some peaches I got at a farmer’s market, and seeing the reviews saying this was more cake-y actually sold me on it! I reduced the white sugar by 1/4 cup as suggested by many reviews and absolutely didn’t miss it. My bake didn’t turn out super pretty necessarily, but it tastes AMAZING. Brought some to a coworker and her husband and she ate most of both shares just as we talked in her kitchen, so she was a fan haha. Not hard to make and a great use for some ripe peaches! Alix7/13/2021Delicious recipe! I followed the advice to reduce the sugar by 0.25 cup (1.75 cups total) and was delighted with the result.  Also substituted turbinado sugar for brown sugar because that's what I had on hand.  Agree with all reviewers that this really produces old-fashioned oil cake and not a cobbler but it's still really great. Wonderful moist crumb.  CoudreModeThe Beautiful Berkshires of Western MA7/6/2021This is a wonderful recipe. I appreciate the reviews that cut back the sugar by 1/4 cup.  I completely agree that's a smart thing to do, it really brings the peach flavors forward. Also agree this is more like an old fashioned oil cake than a cobbler.  The crumb is moist, flavorful and very nostalgic. I'll take this again for sure!CoudreModeThe Beautiful Berkshires in Western Massachusetts7/5/2021Made this last week with fresh farmers' market peaches, and boy, was it a hit. It's definitely more on the cake side of cobbler, as other reviewers have mentioned, but I enjoyed it-- it was tender and cakey in spots, but crunchy and brown around the edges. I did reduce the amount of sugar in the batter, just by a quarter cup or so. It's just me and my husband at my house, so we had it with vanilla ice cream over the course of a few days. It held up well in the fridge.annabethbuckleyArkansas8/26/2020Absolutely delicious! \nStayed true to recipe, with the only addition being a couple handfuls of blueberries\nI wasn’t sure when I added batter to butter, looked kinda funky, just followed directions and baked \nAfter 1 hour it looked and smelled amazing \nDelicious!AnonymousChicago 7/21/2020So easy and delicious!  I added a splash of Grand Marnier to the peach/sugar/mace mixture and let it marinate for 30 minutes. Check after 48-50 minutes of baking.    AnonymousNorthville, Mich7/17/2020I whisked up a bowl of maple whipped cream to go with it and was absolutely delicious. I took some liberties in doubling salt and vanilla , and cutting the sugar in the batter to 3/4 of all brown sugar. The mace stole the show; I'm glad I managed to find it. I'll be reaching for it in aromatic dishes and deserts in the future. AnonymousNew York7/16/2020Halved the recipe and baked in an 8x8, and subbed unsweetened soymilk for the whole milk. Turned out amazing! I ended up baking my smaller cobbler for just under 30 minutes, and the edges were crispy and the center was tender. I used less white sugar than the recipe calls for in the batter, and I thought it was the perfect sweetness. Perfect summer treat, would definitely make again!AnonymousAnn Arbor, Michigan7/4/2020This was so good, but like some of the other reviewers, not what I was expecting.  It's more of a cake than a cobbler.  I think I should have swirled it a bit more to get it to be as pretty as the picture.  I baked mine at said temperature but for about 47-48 mins and it was brown and done!  Thanks for this feature, these are classics that I have saved to make for years to come.AnonymousRocky River, Ohio6/25/2020Fantastic!  More like a fried peach cake than a cobbler but recipe is excellent.  Second time I made it, I added juice if half a lemon to peaches and that seemed to break through the sweetness a bit—in a good way.  Definitely let the peaches sit 1/2 hour or so, especially if yours are not that ripe like mine were. Don’t wast the juices they release!  I think you could do this with berries as well. Will try for sure. travis.summit4497New York6/20/2020This was the very first time I ate (and made) cobbler and it turned out amazing! My guests asked me for the recipe (always a good sign). Hannah_RosalieThe Netherlands6/19/2020So good!! I used 2/3 cup granulated sugar, 125g butter and mixed some of the cinammon-sugar syrup from the peaches into my flour mix. Think I might try this with coconut flour next time!AnonymousSydney, AU6/19/2020This turned out really well. I could not find mace in three grocery stores, so I too substituted nutmeg. I was a little confused about the ladleful butter swirl instruction. The batter just sort of sunk to the bottom when I ladled in the baking dish, so I whisked to incorporate \"swirls\". I checked a few other cobbler recipes and was told not to stir once poured. It turned out fantastic even though I mixed. Depending on your oven, I'd check the dish after 50 minutes. I served it with the lebnah and lime ice cream from the issue.  greengoFalls Church, VA6/18/2020This is Definetly a good recipe that most people are going to like, but for those who enjoy their fruit deserts on the less-sweet side, the sugar needs to be cut down. I would not alter the peaches and their 1/4 cup of sugar, but I would take down the sugar in the batter down 3/4 of a cup. Also keep in mind that this is a really spongy cobbler, which I love. It’s not crispy or “crumby”. JinbaeConnecticut6/17/2020Explore Bon AppétitCobblerFruit DessertDessertAmericanPeachStone FruitFruitCinnamonHerbs & SpicesSummerEasyNut-FreeBakingJuneteenthFourth Of JulyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Ben Bynum"]}