{"id": "8ec9aadeb91531c5d5180359a434da29", "url": "https://www.bonappetit.com/story/how-to-make-the-best-caesar-salad", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Make Caesar Salad According to Molly Baz | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCae Sal is the King of the Salad Kingdom, Long May He ReignHere's how to make the best one of all.By Molly BazApril 8, 2020FacebookTwitterEmailPhoto by Danny KimFacebookTwitterEmailNo one ever accused senior food editor Molly Baz of not having enough opinions about food. In Molly’s Got Thoughts, she’ll dive deep into some of her favorite dishes and, along the way, drop looooots of knowledge for how you can achieve the best version yet. Today: how to make Caesar salad.If there’s one thing I know with certainty, it’s that Cae Sal reigns supreme in the salad kingdom. It is my one true love (aside from Tuna—and no, I’m not talking about the kind that comes out of the ocean and is usually packed in cans; I’m talking about the extra-long, teeny-tiny weenie who I live with.) For goodness sake, I even own a pair of customized Nikes that say “Cae” on one tongue and “Sal” on the other! True story!To me, a Caesar salad is the platonic ideal of a salad—I hold few things in the world in higher esteem. It can easily serve as the main event, but it’s just as delightful as a side. It prominently features greens, which make me feel virtuous, but those greens get covered in mayonnaise, which makes me feel full. There are carbs in the form of croutons, which make me feel happy, and there is always an abundance of parm which is, by my account, the king of cheeses and therefore welcome on my plate at all times.When done right, it’s one of life’s greatest pleasures. But when done wrong, it’s a disappointment, a bowl of lost potential. Since many of us have a  helluva lot more time on our hands these days and exactly nowhere to go, it seems like the perfect opportunity to commit to mastering one of the great salads of our time, dontcha think? You can make it anytime, anywhere—all you need is a few kitchen staples and a head of romaine lettuce—and it’s fairly simple to execute. You’ve just got to bear in mind the few rules that set a superlative Cae Sal apart from a sub par one:1. Cold lettuce = crisp lettuce.The glory of a great Caesar salad lies in the juxtaposition of cold, crunchy refreshing romaine lettuce and fatty, garlicky parmesan-laden dressing. Keep your lettuces cold until right before serving so as to not disturb that beautiful balance. Otherwise, you’ll be eating warm wilted greens slathered in mayo. Yuggg.2. Homemade dressing is the only dressing.Whether you’re making a dressing completely from scratch by emulsifying oil into egg yolks, or simply zhuzhing up some Hellman’s with all the classic components of a Caesar dressing (two totally acceptable options!), a homespun dressing is crucial. Neither one of the two major players in a great Caesar dressing—fresh garlic and lemon juice—has a particularly long shelf life. Which means that the bottled dressings you find in the supermarket are likely packed with citric acid and/or garlic flavorings to mimic their flavor, or preservatives to extend their longevity. And there’s nothing delicious about that.3. ‘Choves are not optional.I am fully aware that tiny pungent tinned fish are not everyone's idea of a good time. I am not a fan of whole anchovies myself. But there is no denying their power in a proper Caesar dressing. When mashed to a paste and dispersed throughout the salad, they provide umami and depth of flavor without tasting noticeably “fishy.” Look for oil-packed anchovies, which are milder and less salty than the one that are packed in, well, salt. Okay, if you really and truly can’t stand the idea of them, leave them out. But if you’re on the fence and about to tackle homemade Caesar for the first time, stay with me. Don’t knock it til you try it, as they say. (They say that, right?)This right here is my perfect salad.\nPhoto and Food Styling by Molly Baz4. Don't snooze on the crouts.Croutons break up some of the monotony of eating a big bowl of lettuce, offer fun new texture, and also taste really friggin’ great. In an ideal world, you’d make those croutons yourself. The key to a superlative crouton starts with sturdy bread (a country loaf, crusty baguette, or boule is perfect) and will therefore remain crisp no matter how heavily they’re drenched in dressing. Tearing the bread into bite sized pieces before tossing it generously with oil and baking it until golden brown and crisp all the way through will yield lots of craggy nooks and crannies for optimal dressing clingage.5. Parmigiano Reggiano > all other poser parmesan cheese.There is parmesan cheese—and then there is Parmigiano Reggiano. The nuttiness, milk-y sweetness, and crystallized texture of Parmigiano Reggiano is unrivaled by its poser counterparts. Why? Because cheeses that are labeled “parmesan” are not beholden to the quality and aging regulations that set Parmigiano Reggiano apart, so you never really know what you’re gonna get. A great Caesar salad features quite a bit of cheese, so your best bet is to forego the lower quality stuff (and especially that terrifying shelf stable canned stuff!) Invest in good parm, your tastebuds will thank you. (If you’re purchasing parm from a market that grates Parmigiano Reggiano freshly in-house, like Whole Foods or another high-end grocery store, by all means go for the pre-grated stuff. Otherwise, buy a block and grate in yourself. In a food processor, this is fast and efficient.)6. Always be grindin'.Black pepper exists in a Caesar to counteract all of the fatty dressing (it’s mayo after all). But that stuff that was pre-ground months ago? No flavor, no heat, no aroma, no point. It’s crucial to grind it fresh every time—fresh-ground pepper is more fragrant, potent, and spicy than anything pre-ground. And while we’re on the subject, if you ask me, there’s one pepper grinder that rules them all. It’s called the Unicorn and I can’t recommend it highly enough!7. Season that sal.I know, I know, I’m a broken record, but puuuulease don’t forget about the salt! Because romaine has a high water content, and that water will dilute the dressing, you’ve got to season both the dressing and the lettuces in order for the salad to be properly seasoned through and through.That’s it, folks! You’re now ready to master the great Caesar salad. A little bit of love and attention to detail (and some vigorous whisking) will you get you there in no time at all. And who knows, maybe you’ll even consider getting your own pair of custom Cae Sal sneaks to celebrate? Now get out there and make this fanatic proud.Get the recipe:Classic Caesar SaladA great Caesar salad recipe gets its swagger from a great Caesar dressing recipe. And that’s just what we’ve got here.View RecipeExplore Bon AppétitMolly's Got ThoughtsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Molly Baz"]}