{"id": "8eca2a952df11e9d86dbe266ef531d47", "url": "https://www.bonappetit.com/recipe/green-goddess-tuna-salad-sandwich", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Green Goddess Tuna Salad Sandwich Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueGreen Goddess Tuna Salad SandwichBy Andy BaraghaniFebruary 13, 20184.7(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis green goddess tuna salad sandwich recipe is a revelation, bringing bright herbaceous flavors to an otherwise one-note meal. We fought over the bread choice—sourdough vs. English muffin—and you see who won. You can make the dressing in a food processor if you like, but it won’t be as smooth or have that bright green hue you get when you do it in a blender.IngredientsMakes 2¼cup basil leaves¼cup parsley leaves with tender stems¼cup tarragon leaves¼cup mayonnaise¼cup sour cream1tsp. finely grated lemon zest2Tbsp. plus 1 tsp. fresh lemon juice2Tbsp. extra-virgin olive oil, plus more for drizzling15-oz. can tuna in water, drained1celery stalk, finely chopped1small shallot, finely chopped1garlic clove, finely gratedKosher salt, freshly ground pepper½cup coarsely chopped mixed tender herbs (such as celery leaves, basil, parsley, and/or dill)2English muffins, split, lightly toastedPreparationStep 1Purée basil, parsley, tarragon, mayonnaise, sour cream, lemon zest, 2 Tbsp. lemon juice, and 2 Tbsp. oil in a blender until very smooth and pale green. Transfer dressing to a medium bowl and add tuna. Using a fork, break up tuna and incorporate into dressing. Mix in celery, shallot, and garlic; season with salt and lots of pepper.Step 2Toss chopped mixed herbs with remaining 1 tsp. lemon juice in a small bowl. Drizzle with a little oil, season with salt and pepper, and toss again.Step 3Build sandwiches with English muffins, tuna salad (you may have a bit extra), and herb salad.How would you rate Green Goddess Tuna Salad Sandwich?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleReally loved this recipe! Based on other reviews, I doubled the amount of tuna. I made a salad rather than a sandwich (I just put it on a bed of fresh spinach), so the amount of dressing after adding an extra can of tuna was perfect. But if you’re making a sandwich, you may want to add 2 extra cans instead of just 1. I also added extra lemon juice (personal preference), used cucumber instead of celery (because that’s what I had on hand), and mixed the herb salad right into the tuna salad instead of keeping it separate, which I feel didn’t affect the outcome since I ate as a salad anyway. Will be making this again!AnonymousHouston, TX9/13/2020A really nice fresh change to tuna salad. You MUST double the tuna or half all the herby dressing ingredients - I think it's the inclusion of the parsley stems that make the dressing so watery. Added some Cholula hot sauce on top of our toasted French rolls and it was perfect for a summery dinner.kendall.eatsSeattle, WA8/4/2020This was delicious! I will definitely be making this again through the summer. I did end up adding another can of tuna to keep it from being too wet. I used Greek yogurt instead of sour cream though which may have contributed, though seems like it's a common complaint in these comments.  Mixed the dressing in a food processor so not as smooth as a blender but nice flecks of herbs throughout. Used arugula for the greenery in the sandwich which added a nice bite as well. AnonymousBerkeley, CA6/29/2020I agree with other reviewers that there is far too much dressing in proportion to tuna - I used 2 cans of tuna and still had more dressing than I needed. I recommend halving the dressing ingredients. That being said, the dressing is incredible and it's easy to just save whatever you don't use for salad dressing or veggie dip! I subbed dill for the tarragon in the dressing and it worked perfectly. I will be making this recipe again and again! It's tangy, herby, and delicious and totally refreshed my tuna salad game. coolstorybrodesCambridge, MA6/1/2020We made this exactly as written. \nMeh - Lacked flavor. Needed more salt. Needed more Tuna. Added a second can.\nMaybe we just arent Green goddess fans but nobody in the family really liked it.\nThe photo looked so good. SfhortyCalifornia5/11/2020This was perfect eating on my deck.  The dressing was light and bright with the lemon and parsley.  This dressing would go great on a benedict, or salad..planetteerSan Francisco, CA5/8/2020I skipped the blender and just chopped the herbs, and mixed with the rest of the ingredients. My favourite tuna sandwich!!  AnonymousGermany5/2/2020This recipie was wonderfully bright and tangy. I plan to make the dressing separately again.\nMy tuna salad was also a bit runny, so I added another can of tuna which evened it out and now I have leftovers! Delicious. AnonymousGainesville, Florida 1/3/2020Loved the flavours in this recipe, though it turned out a bit runny for me. Made in a food processor as I don't have a blender, drained the tuna well, even whizzed in some kidney beans hoping for a more spreadable than pourable consistency. No luck. Still tastes great, might turn it into a grain salad rather than a sandwich.kate_cinnamonAustralia3/18/2019Wow this was an amazing recipe! Would 100% Make again. Really easy and tasty A++ I did not put sour creme in.AnonymousLos Angeles, CA6/6/2018This was had excellent flavor and was very easy to make.  I did chop up the herbs (parsley, basil, tarragon) a little bit before putting them in the blender.  I plan to mix the remaining tuna mixture with some shell noodles for a cold tuna salad.janetwizManhattan Beach, CA3/2/2018Explore Bon AppétitSandwichAmericanTunaFishSeafoodQuickEasyWeeknight MealsNut-FreeHealthyishLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Andy Baraghani"]}