{"id": "8ecaece39b3801de3776c9b1607ae7f9", "url": "https://www.bonappetit.com/story/plastic-bag-safety-sous-vide", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Is It Safe to Cook With Plastic Bags? And Other Sous Vide Questions, Explained | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Safe to Cook With Plastic Bags? And Other Sous Vide Questions, ExplainedFood safety 101.By Elaheh NozariFebruary 14, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna BillingskogFacebookTwitterEmailAfter we shared a ton of new sous vide recipes recently, one of the most common reader comments was about plastic bag safety. I hear you. I spent a year in college living with a host family in France, and on my first night, I walked to the stove to find a salmon filet in a plastic bag, submerged in a pot of hot water. My first thought was that I’d get cancer, my second was that I’d get botulism. I didn’t know what else to do so I ate the salmon and waited for the poison to set in.It didn’t, and I lived to tell the tale of sous vide plastic bag safety. The key to sous vide, which is French for “under vacuum,” is putting a protein, often meat, in a plastic bag and removing all the air. This is the part that raises questions for risk-averse home cooks, and we’ll try to answer them below.Is cooking with plastic safe?When it comes to cooking, there’s very bad plastic and, uh, not-as-bad plastic. The bad plastic is polycarbonate, which releases the chemical Bisphenol A (BPA). This kind of plastic is found in cling wrap, plastic squeeze bottles, take-out containers, multi-gallon water bottles, and plastic plates. The not-as-bad plastics do not release BPA and count high-density polyethylene, low-density polyethylene, and polypropylene among their ranks. The reason they're not necessarily “good” plastics is because a 2011 study found that when some were heated, these plastics —in fact, most plastics on the market, including those advertised as BPA free—release non-BPA chemicals that disrupt hormone activity. The amount of chemicals released, however, is unknown.What kind of plastic bags are safe for sous vide?There currently aren’t any published studies specifically focused on the migration of chemicals in sous vide conditions, so you should sous vide only if you’re comfortable with the gray area surrounding the effect of chemicals in non-BPA plastics.Sous vide manufacturer ChefSteps recommends using food-grade vacuum sealing bags because they’re BPA-free and made of polyethylene (we like the ones made by FoodSaver). These bags need to be sealed with a vacuum-sealing system, which FoodSaver also makes. If you don’t want to pay for a vacuum sealing system, you can also use sturdy resealable freezer bags, like Ziploc ones made with low-density polyethylene.However, you shouldn’t use a single Ziploc bag when cooking in water temperatures above 158°F because the heat can cause the bag to open at the seams and expose your food to the water. Double-bagging with two Ziploc bags will avoid this, or using FoodSaver bags. To be on the safe side, do not wrap your food in saran wrap and then put in the bag—cling wrap is the very bad plastic.How do you seal the bag without a vacuum sealing system?If you're using a Ziploc bag and don’t have a sealing machine like FoodSaver’s, you can still remove all the air from it. Once your meat is in the bag, press out as much air as you can, but instead of sealing it shut, leave a little room at the top. Then, lower the bag into a pot of water until the water comes up to the seal and zip the bag shut. The pressure of the water will displace all the air you couldn’t remove on your own.And about that botulism...?Some skeptics fear getting botulism from sous vide foods because the bacteria that causes the disease, C. botulinum, grows in low oxygen conditions. To prevent it, and other bacteria growth—avoid cooking or storing your food in the danger temperature zone—between 40°F and 140°F—for more than two hours.Still got questions about sous vide? Watch and learn from Brad:Explore Bon AppétitShoppingSous VideRead MorerecipesOn Your Mark, Get Set, Sous VideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Elaheh Nozari"]}