{"id": "8ecae5f45945f410d7771c2fc175790d", "url": "https://www.bonappetit.com/story/just-buy-it-best-kitchen-towels", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "The Best Kitchen Towels Cost Less Than $1 Each, So Stock Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Kitchen Towels Cost Around $1 Each, So Stock UpBonus: They make great cloth napkins too.By Amiel StanekApril 21, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I met the kitchen towels of my dreams, the best kitchen towels I have ever used and ever will use, on the first day I set foot in a restaurant kitchen. It was a classic meet-cute. They were unassuming in their simplicity—100 percent cotton, a soft white with a distinctive herringbone weave and snappy blue stripe. They weren’t like those other kitchen towels from back home, those awkwardly large, overly thick, hopelessly linty decorative towels that sported pumpkins in the fall, tulips in the spring. Those towels were for show, mere accessories for the oven door. But these Zeppoli kitchen towels were everything I’d ever wanted from a kitchen towel and more. I’d fallen hard.Zeppoli Classic Kitchen Towels (15-Pack)$20 $17 at AmazonThey’re simply the best. Better than all the rest.Zeppoli kitchen towels are the apex of towel functionality. They’re super absorbent, ready to tackle spills and splatters. They’re the perfect size and weight—definitely not bulky, but thick enough to handle a hot pan. Because they don’t shed, they’re also an ideal dish towel, so you can dry your glasses without leaving loose fibers all over your clean stemware. And no lint means you can sub them in for paper towels when a recipe calls for pressing the water out of tofu or patting dry slices of salted squash. They’re everything you need and nothing you don’t.Any way you fold them, they're still just the best.\nDon’t I know you from somewhere?Even if you’ve never worked in a restaurant kitchen and had the distinct pleasure of starting your shift with a clean stack of these towels on your station, you’ve probably encountered them before. You know that rustic-chic, no-tablecloths, fine-casual type of restaurant? The one with vintage bric-a-brac on the walls and chicken liver mousse on the menu? Can you picture the napkin that’s on the table, right beneath the Mason jar water glass? That’s right: Some version of the same single-striped kitchen towels I’ve been describing. I’m not saying your dining table should cosplay as a late aughts farm-to-table restaurant, but I am saying that these kitchen towels are lightweight and handsome enough to do double duty as the cloth napkins you have always thought about buying but never got around to. Very French bistro.So if you buy yourself a set of these, not only will you have solved your kitchen towel problem, but you’ll also have morphed into the type of person who has matching napkins for a dinner party. TWO. FOR. ONE. BABY. Listen: You have a combination phone case and wallet, because you’ve only got so many pockets, and cargo shorts are not coming back, no matter what your cousin thinks. (Editor’s note: this piece was originally published in 2018. We regret to inform you that cargo shorts are back.) You buy combination moisturizer and sunscreen because why have two bottles when one will do the trick? So why buy kitchen towels and cloth napkins separately when there exists a product that a) serves both functions extremely well, b) is reasonably chic, and c) costs about a dollar?I'll say it again louder. Each towel costs about $1!A 30-pack of Zeppoli Classic white kitchen towels is going to run you about $31 on Amazon. One singular buck for the crème de la crème of kitchen towelry that also doubles as table linen? This is a tremendous deal. Perhaps you’re thinking, thirty kitchen towels? Isn’t that a lot? Not if you’re immediately setting aside a dozen for use as napkins (these are for company, not for mopping up red wine spills) and also trying to kick your paper towel habit. Keep a stack on hand for wiping down countertops, a stack for drying dishes, and a stack for throwing over your shoulder while cooking. In fact, I might argue that it’s impossible to have too many kitchen towels—at least not if we’re talking about the best kitchen towels known to man.Editor’s Note: This article was originally published July 19, 2018.Explore Bon AppétitBasicallyShoppingCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "Amiel Stanek"]}