{"id": "8edd060cedc78946e3e14b2d35ca6116", "url": "https://www.bonappetit.com/city-guides/mexico-city/venue/la-clandestina", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "La Clandestina Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmexico cityLa ClandestinaWhy it’s too easy to spend all night at this cozy mezcalería in CondesaFacebookPinterestTwitterEmailPhoto Courtesy of La ClandestinaGO: for a night of mezcal, curated and served by La Clandestina’s highly knowledgeable staff. Don’t be intimidated: It’s a great for first timers, as well as mezcal experts.ORDER THE: many unique and obscure varieties of mezcal, straight up. They come served with sliced oranges dusted with chili and a bowl of addictively salty roasted pumpkin seeds, thank you very much. If you need to ease in with a cocktail first, go with one of the avocado ones, creamy and sweetened with a little blackberry.THE VIBE IS: at first, unassuming. The entrance is an unremarkable storefront, but follow the wall of glowing pink mezcal barrels and, inside, it’s moody with a dimly lit bar and low, intimate tables set in every corner. Trust us, once you’re there you won’t want to leave.PRACTICAL STUFF: Open Monday, 6 p.m. to midnight, Tuesday to Wednesday, 6 p.m. to 1 a.m., and Thursday to Saturday, 6 p.m. to 2 a.m. Closed Sunday.—Molly BazWE ALSO LOVELas DuelistasLooking for freshly fermented agave sap? We got you.BaltraStep out from Cuba libres and gin-tonics at this non-lame mixology barBar La FaenaTime moves slowly at this midcentury cantina that doubles as a bullfighting museumExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-12-10", "author": ["Molly Baz"]}