{"id": "8ee7e6c51592056e8ec7686e07836f3e", "url": "https://www.bonappetit.com/story/weekend-carnitas", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Make Carnitas Next Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt’s Only Tuesday But I’m Already Planning My Weekend Around Carnitas They’re easy and time consuming.By Adam RapoportMay 12, 2020FacebookTwitterEmailLinda XiaoFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Honestly, I had forgotten all about the pork shoulder. I bought it eight weeks ago, frozen and vacuum-sealed, and it had been sitting in the deep recesses of my freezer ever since. And then Saturday morning, as I was wondering just what the heck I was going to do all day—besides laundry and other chores—a light bulb went off.Carnitas!Have you ever made carnitas? Pork braised in its own fat till crispy but still tender? As a cooking project, it presents that perfect balance of being both easy and time consuming. Which, frankly, during these self-isolating months is exactly what I can handle.There are different ways to approach this beloved and storied Mexican dish. You can check out Rick Martinez’s recipe for Double Pork Carnitas, or his recipe for Duck Carnitas, or you can listen to Rick and me talk carnitas on the Bon Appétit Foodcast. (If you haven’t gathered, Rick has a thing for carnitas.)But I kind of winged it. I browned and then braised the pork shoulder with a bunch of chopped up veg and some chicken stock and wine. Three hours later, I strained the liquid, popped it in the freezer and then skimmed the congealed lard from the surface.Want this letter before it hits the website? Sign up for our newsletter!Gaby’s Instant Pot Carnitas recipe\nPhoto by Chelsie Craig, Food Styling by Pearl JonesI shredded the fall-apart meat and fried it till crispy—but not too crispy—in the reserved pork fat in a high-sided Dutch oven. (I guess you could say my technique is a bit more akin to Gaby Melian’s Instant Pot Carnitas recipe.) At this point, I would’ve been happy to sit there at the cutting board with a bottle of beer and tub of sea salt and just go at the succulent pork shoulder. But half the fun of making carnitas is crowning it with a constellation of complimentary dishes. Something to do, something to take your mind off yet another weekend that doesn’t really feel like a weekend, and something to get your spouse and kid excited about.So I sliced up some ripe avocados. I quartered some limes. I quick-pickled some red onion and showered it with chopped parsley and mint (because Rick, in his epic taco primer a few months back, declared that cilantro is not required, and that it’s time other herbs get some love). I warmed some brothy pinto beans I had in my fridge. I heated up some jarred queso that my 12-year-old loves. I opened up a bag of chips. And just before sitting down, I blistered some tortillas in a cast-iron skillet and wrapped them in a dish towel to stay warm and moist.And then I devoured more carnitas tacos than I could count. Not a bad Saturday after all.Get the recipeDouble-Pork CarnitasIt’s worth seeking out pork belly for the amazing texture it lends, but if you can’t get it, substitute with another pound of shoulder.View RecipeExplore Bon AppétitAdam NewsletterRead MorecultureStockpile These Tortillas for a Lifetime of Great TacosBy Aliza AbarbanelcookingI've Been Thinking About These Spicy Migas Tacos For Two Years StraightBy Alex DelanycultureIt’s Time We Give the Mexican Combo Platter the Credit It DeservesBy Patricia EscárcegacultureRoy Choi’s Korean Tacos Are My American DreamBy Margaret Cho, as told to Sasha LevineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Adam Rapoport"]}