{"id": "8f11c0b00a3d0e2144295ba3b732274e", "url": "https://www.bonappetit.com/recipe/roasted-aloo-gobi-potatoes-and-cauliflower", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Aloo Gobi (Potatoes and Cauliflower) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueRoasted Aloo Gobi (Potatoes and Cauliflower)By Priya KrishnaJune 10, 20194.6(106)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis classic potato-and-cauliflower dish, ubiquitous on Indian restaurant menus, makes for a great make-ahead party dish. You can pre-roast the vegetables, and then whenever you’re ready, throw them in the pan with your spices and onions to finish the dish in 15 minutes.Indian-ish© 2019 by Priya Krishna with Ritu Krishna. Photography © 2019by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4 servings2medium russet potatoes, cut into 2\"-long sticks1medium head of cauliflower, cut into small florets5Tbsp. extra-virgin olive oil, divided1tsp. cumin seeds½tsp. ground turmeric1small onion, finely chopped1Tbsp. thinly sliced gingerPinch of asafetida (optional, but really great)Pinch of red chili powder1tsp. (or more) kosher salt1Tbsp. (or more) fresh lime juice½cup chopped cilantro leaves with tender stemsPreparationStep 1Preheat oven to 400°. Line a rimmed baking sheet with foil. Toss potatoes and cauliflower with 3 Tbsp. oil on prepared sheet. Spread in an even layer and roast, tossing once halfway through, until cauliflower and potatoes are browned and slightly crisped, about 30 minutes. Let cool.Step 2Meanwhile, heat remaining 2 Tbsp. oil in a large skillet over medium-high until it begins to shimmer. Add cumin and cook, stirring frequently, until they turn a medium shade of brown, about 1 minute. Reduce heat to medium and swirl in turmeric. Add onion and cook, stirring frequently, until translucent, 4–6 minutes. Add ginger, asafetida (if using), and chili powder and cook, stirring, until heated through and well combined, about 1 minute longer.Step 3Stir in roasted potatoes and cauliflower, including any charred bits from the foil, and gently mix (don’t overmix, or the cauliflower will fall apart). Add salt and cook, tossing occasionally, until potatoes and cauliflower are tender (but not soggy!), 5–6 minutes. Remove from heat and add lime juice. Taste and add more lime juice or salt, if needed.Step 4Transfer potatoes and cauliflower to a platter. Top with cilantro.How would you rate Roasted Aloo Gobi (Potatoes and Cauliflower)?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleThis recipe was amazing! I too roasted a little bit longer. Overall, super simple recipe and amazing flavor profile. Jackie BMontreal, Canada10/6/2021I agree:\n6/5!!\nWell done Priya and Priya's mum.\nSometimes cheat and add dark greens, because I don't know any better, and I can, and it is delicious.K. BakerOntario, Canada9/14/2021I'd give this 6 stars. It's a simple dish but there's so much satisfaction to eat it even on its own. The lime juice added another dimension to this dish, don't omit it.  I also liked that this version is not so oily. Thank you for sharing!AnonymousSingapore8/3/2021Thank you, Priya! I cannot get enough of this recipe. Love the matchstick ginger for a different texture & would recommend adding garlic & more heat as well. It's great as-is, but last time I made it with a few extras & it was amazing: Cubed paneer pan-fried in oil with turmeric & cumin seed, cubed leftover grilled chicken breast if I have it, last night I threw in some julienned basil (because summer) & topped everything with arugula. As other reviewers have mentioned, I could totally see adding chickpeas or fresh peas to the mix for another little pop.JoshMKE, WI 7/9/2021I've tried several different aloo gobi recipes, but this is by far the best. I used small honey gold potatoes and just cut them in half. The flavor was incredible and the vegetables weren't mushy at all.Bob SPhiladelphia, PA5/29/2021Soooo delish and really fool-proof. Made two big batches in a row and have been eating it nonstop since. I added peas, too, for a lil extra sweetnessLucy SNew York2/11/2021Wow! Didn't know what to expect from this... but had to try based on Priya's other recipes.  Easy to make. Convection setting in oven helps with the crisp of the veg.  Very comforting.  Bought her cookbook filled with other equally awesome dishes.JTMadison, WI1/17/2021This is one of my favorites, so delicious and easy. It makes great leftovers, heat it up in the oven and the potatoes and cauliflower get even crispier all over. I’ve been serving it with rice and Priya’s cilantro chutney from her cookbook, a weeknight favorite! Jess Worcester, MA11/18/2020I've made this  4 or 5 times - it's become one of my favourite suppers. Seriously addictive. I follow the recipe pretty closely, but use maybe 1/2  tsp of chilli powder to give it a little more heat. 30 minutes in the oven is not quite enough in mine - I wait till there are major brown bits, closer to 40 minutes. It takes what it takes, and is worth waiting for.RobVancouver BC11/17/2020How is this Aloo Gobi??? No curry/sauce that accompanies it...this is dry. At least say this is a healthy adaptation attempt or something...come on. AnonymousWashington, DC11/10/2020This is a ten!  It takes a little time but it will be a family favorite.  I double the spices but seriously so delicious and its good for you.  I am not the greatest cook but if I can make it anyone can make it.  I love cooking the spices first it really gives the dish a kick.  I was a little intimidated by a Bon Appetit recipe, again because of my cooking skills, but don't be.  Karen EdlingCA11/8/2020Love the idea of roasting the veg for this dish, but just one suggestion - mix the spices (cumin, tumeric and I also added garam masala) with the oil and toss with the veg BEFORE roasting. It adds sooo much more flavour than adding at the end!!! I also threw in some chickpeas about halfway through roasting for protein. It was fantastic!AnonymousToronto, ON10/30/2020Ummm yeah this thing is FREKIN DELICIOUS. It's so flavorful it's like stupid good. SO TASTYYYY.  Please make this dish.NnnnnnnCalifornia, US10/15/2020Everyone has to make this!! This is pretty much one of my favorite dishes. You end up eating a lot of cauliflower, and it's vegetarian but extremely satisfying! I always follow the recipe completely (I just leave out the cilantro if I don't have it and use a lemon if I don't have limes) and serve it on top of basmati rice (I live with a big eater), and despite being dry and not saucy, the aloo gobi completely holds its own against the rice. It's really amazing! I don't know if the people who found it bland didn't have asafoetida, but I do think this really helps in the dish. I guess you can replace it with another umami source like some fish sauce if you don't have it? Anyway, highly recommended!!celinenerdThe Netherlands7/11/2020Hearty and comforting, more on the gentle side with the flavor profile but that's what lets the earthy potatoey-ness just give you a big old hug. ShayTLondon, UK 6/21/2020Explore Bon AppétitStir-FryIndianSouth AsianAsianPotatoVegetableCauliflowerRusset PotatoWeeknight MealsSideVegetarianVeganNut-FreeDairy-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-10", "author": ["Condé Nast", "Priya Krishna"]}