{"id": "8f1434f31029f9b3af7ded69537240ce", "url": "https://www.bonappetit.com/story/trader-joes-february-2021-reviews", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Trader Joe's Best Foods for February 2021, Reviewed | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Fried Ravioli Is All I Want From Frozen FoodAlso reviewed this month: New almond butter almonds, limone Alfredo sauce, and chocolate oat milk.By Alex BeggsFebruary 26, 2021FacebookTwitterEmailFacebookTwitterEmailEver wonder why there’s no Coca-Cola at Trader Joe’s? I’ve been reading The Secret Life of Groceries and it is riveting. Riveting! Author Benjamin Lorr interviewed Joe himself and answers the Coke question and much more. Including how the idea for the store came to be during a nice vacation in St. Barths, why the store nixed the usual aisles of 27 different paper towels, and how Trader Joe’s became the model for all other grocery stores’ generic lines. I recommend reading it while crunching on some Aussie-style Chocolate Crème Sandwich Cookies, also known as Tim Tams.Here’s what’s new—that I was able to get my sanitized hands on—at Trader Joe’s in February.Big JarsCalabrian Chili Tomato Dumpling SoupCalabrian chile (we spell it with an e at Bon Appétit) grabbed my attention while little plops of dough “dumplings” distracted it. More like lumps, floating in oregano-flecked creamy pasta sauce. I added TJ’s Bomba sauce for double the Calabrian chile, but that’s a survivalist technique. Pass on these plops.Limone Alfredo SauceBeen searching for this! I’ll take the most sacrilegious heavy cream–and–cheese version of Alfredo over red sauce any day, especially if it’s Molly Baz’s pasta al limone. I was impressed with the jarred version. Tangy and lemony, super creamy, and as basic as I am. It’s thick and jiggly, like a whipped body butter, so I tossed it with some pasta water to help it coat my pappardelle better. Sure, you could cook heavy cream, garlic, and lemon juice and not have to wonder what else is in that jar that makes dairy shelf-stable. But I’m tired. Open the jar.Small JarsGround Fermented Black GarlicCrackly and reminiscent of decorative sand for your fish tank, though much tastier! Despite what it seems like, the garlic flavor is toasty but muted (learn more about black garlic here). I sprinkled it on popcorn, but it would be awesome in a dry rub on a roast chicken or in place of the black peppercorns on these wings.Hawaiian Macadamia Nut Blossom & Multi-Floral HoneyA lesson in marketing luxury: macadamia nut$, all the way from Hawaii, multi-floral! Most honey is multi-floral, though, because bees pollinate whatever plants turn them on (literally); it’s rarer to find “mono-floral” honey. That’s a little lesson for us all. This is a darker honey with notes of black cherry, molasses, and, uh, honey. I’d save it for a cheese plate where the flavors can flourish—and where you can share all of this interesting honey information with friends.FrozenSpicy Mexican-Style Riced CauliflowerIf you like cauliflower rice and are low on sodium, you’re gonna love this frozen stir-fry that made my lunch break a cross between sad and spicy. Somewhere in between.Trader Joe’s KibbehPretty dry, somewhat mushy, not quite what it could be when made fresh by human hands. I made a zhug-and-yogurt dipping sauce (TJ’s zhug is good!), drenched the kibbeh in lemon, and finished the box. However, I hear it’s illegal to buy these if you live within driving distance of Al-Ameer, so I won’t be committing that crime again.Breaded Fried RavioliOhmygod! I fried these spiky pillows of gooey mozzarella in a pool of oil and had a lunch fit for a dive bar at 3 a.m. I even needed a short nap and a puke after. Just kidding! I was glowing with grease and happiness. Frozen food, packed with preservatives and salt in order to stay edible, should be exactly this terribly bad and yet good for you(r soul). The most important question you might have is what to dip them in, and this is your choice, but might I recommend TJ’s Bomba sauce mixed into mayo? Rao’s marinara? Ranch? Whatever you’d order when you’re at your lowest point will, in fact, be your highest.CansSparkling Lemon + Strawberry Apple Cider Vinegar BeverageThis reminded me of the strawberry limeade at Sonic, and the first time I realized Rollerblading could be a career. A world previously closed was now open to me. Later in high school, nearly the entire cheerleading squad was suspended because they’d spiked their foam cups from Sonic (presumably, strawberry limeade, the best drink) with vodka. They were going to a basketball game where they planned on doing flips and pyramids with a little buzz on. It was a SCANDAL! That said, this sparkling apple cider vinegar beverage would be fantastic with vodka.Sparkling Ginger + Lemon Apple Cider Vinegar BeverageThis flavor isn’t as sweet, but it’s still very sweet. Love.Sweet, Coated ThingsAlmond Butter AlmondsMeta-snacks! Like oat milk in oatmeal, this almond butter-coated almond snack is Inception for your taste buds. Never saw the movie, honestly, but I presume it’s about novelty snacks that make your life feel enriched with minor delights. These look like wet clumps of Galveston Island sand, which is brown and speckled with what I imagine to be remnants of past oil spills. The almond butter coating is slightly salty and tastes like white chocolate with a smidgen of almond butter mixed in. Low-key. It’s velvety and melts in your mouth and then there’s the crunch of the inner almond to keep things interesting. These disappeared.Aussie-Style Chocolate Crème Sandwich CookiesAn Australian acquaintance was very skeptical when I told her these were good. I wasn’t able to do a side-by-side with authentic Tim Tams, but from what we know of how TJ’s works thanks to The Secret Life of Groceries, I can guess they’re the same. Dry and crunchy chocolate wafers enrobed in creamy, mild milk chocolate. Structurally, they’re a little off-kilter; the stacked cookies sort of lean to the left. But don’t we all? (Don’t answer that.)Non-Dairy Chocolate Oat BeverageChocolate oat milk! Yum!Plastic-Wrapped MeatsShawarma Beef SirloinInside the body bag there is lightly seasoned meat you need to unfold before cooking. Speaking of cooking, you will overcook the meat if you follow the package instructions, and whether or not that’s intended, it’s all good because it’s going to get smothered in spicy zhug and creamy-cool tzatziki anyway (buy separately).Sesame Teriyaki Chicken Wing SectionsMmm, sections. Eleven sweet and floppy-flabby wings (I should have baked them on a wire rack to get them crispier). What’s fascinating—if you find this kind of thing fascinating—is that the package has instructions for air-frying, baking, and grilling. So did the breaded fried ravioli. Clearly, I need an air fryer!Salads and Salad AccessoriesVegan Taco Salad KitThis plastic bag full of more plastic bags (“salad kit”) has a creamy dressing, pico de goo, blue tortilla chip crumbs, and chipotle seitan doing a pretty good impression of ground beef. I ate the whole thing.Plantain CroutonsVery crunchy and dense, nice and garlicky, too hard for salad. I ate them by the handful, only to find out a serving is one tablespoon (insane).New CheesesDorothy’s Holy Smoke Soft Ripened CheeseYou buy this because it’s a cute flower shape. Then let it warm up to room temperature and assemble your dinner cheese plate, narrate it on TikTok, become a cheese plate sponsored-content millionaire, blow it all on an old Victorian home that needs a complete rewiring, return to the cheese plates from where it all began. Or just smother each creamy, oddly smoke-flavored bite with American Spoon’s peach-habanero jelly (buy some here, it’s perfect) and be happy with what you’ve got.British Mustard & Ale Cheddar CheeseTHIS is the new cheese I’d recommend investing your paycheck in. The little pops of mustard seeds are extremely fun to eat. The cheese is soft and mild. Would be awesome on a salami sandwich. Give it a whirl.Previously: Trader Joe’s Kicks Off 2021 With Hell in a JarExplore Bon AppétitTrader Joe'sRead MorecultureTrader Joe’s New Snacks Are As Festive As a Holiday Rom-ComBy Alex BeggscultureTrader Joe’s November Reviews: Huge News for CheeseBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-26", "author": ["Condé Nast", "Alex Beggs"]}