{"id": "8f169aa58216c193cf0a776212755a48", "url": "https://www.bonappetit.com/story/roti-jala", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "How to Make Roti Jala, a Lacy Malaysian Crepe, From Flour, Egg, and Coconut Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’ve Been Making Roti Jala Since I Was 10. You Can TooNow all you need is a steaming bowl of Malaysian chicken curry to go with it…By Mehreen KarimAugust 13, 2020FacebookTwitterEmailPhoto and Food Styling by Mehreen Karim FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I think of rotis, what come to mind are often round whole wheat flatbreads hailing from the Indian subcontinent. But due to British colonization and the movement, both voluntary and forced, of South Asians around the globe, rotis are found in kitchens worldwide in countless shapes and flavor profiles. Decades post-colonization, my Bangladeshi grandparents immigrated to Malaysia to practice medicine. My mom and her family spent their childhood in Malaysia, folding Malaysian culture and food into their upbringing, and eventually, into my own.In Malaysia, roti jala is deeply rooted in the cuisine. A savory crepe typically eaten alongside a fragrant Malaysian chicken curry, roti jala is Malay for “net bread,” referring to the bread’s delicate lace-like design. My fondest kitchen memories are of roti jala nights with my mom or choto mama (“maternal uncle”), learning how to perfect its consistency and shape. Roti jala’s nooks and crannies make it the ideal chicken curry companion as it catches every last drop when it’s dipped into the gravy.Photo and Food Styling by Mehreen Karim While it may look complicated to make, the batter is as simple as any crepe recipe—with crucial flavor additions such as turmeric and coconut milk. It’s roti jala’s unique frying process and savory, aromatic flavor that set it apart. To achieve the lacy design, the batter gets poured into a bottle and drizzled onto a pan in spirals. After frying, the roti jala gets rolled up into a cigar shape that allows for easy dipping. Though this cooking method may seem daunting, my mom delegated the frying and folding task to me when I was all of 10 years old. Presuming you’re older than 10, you’ve got this.When I’m with my choto mama and family in California, we get to use his authentic Malaysian roti jala dispenser, a ladle with five holes at its base to let batter through to produce the laciest roti jala. But when I’m on the East Coast, my squeeze bottle does the trick. If you don’t have a squeeze bottle, you can use a large plastic water bottle (1-liter Smartwater bottles are ideal). Heat the tip of a safety pin or knife over a flame and poke 3–4 holes into the bottle’s cap.Here’s how to make it: Whisk all of your ingredients in a large bowl: 1 cup full-fat coconut milk, 1 egg, 2½ cups all-purpose flour, 2½ cups water, 1 tsp. turmeric, and 1 tsp. kosher salt until there are no lumps left. This will make 20–30 roti jala (enough to generously feed 5 people). Using a funnel and a ladle, transfer as much of the batter as you can into your dispenser of choice.When your squeeze bottle or water bottle is ready, add 1 Tbsp. canola or vegetable oil onto a medium nonstick pan over medium heat. Using a paper towel, wipe the oil in circles around the pan, simultaneously absorbing excess oil. (Keep that oily paper towel handy in case the pan needs a new swipe between batches.) I like to squeeze a small squiggle of batter on the pan to test the heat. You’ll know it’s hot enough when the batter immediately lightens in color and sets after you’ve drizzled it on the pan’s surface.Now for the fun part! Squeeze concentric circles onto your pan, creating a net-like design that covers no more than 75% of the pan with batter.Photo and Food Styling by Mehreen Karim While my family is a fan of the circular design above, I like to drizzle the batter in a crisscross pattern.Photo and Food Styling by Mehreen Karim The roti jala gets fried only on one side and it takes no more than 2–3 minutes. You’ll know it’s done once you see the edges lift off the pan and it’s basically asking you to transfer it to another plate. Overcooking the batter will result in a brittle roti jala that is difficult to fold and prone to breaking, so make sure to remove it as soon as you see crisp edges.While it’s still warm, fold the right and left sides about 1–2 inches toward the center. Then starting at the bottom, roll the roti tightly toward the top of the plate, creating a cigar shape.Once you’ve removed one roti jala, immediately squeeze a new one onto the pan. If you noticed the previous roti jala sticking, use the oily paper towel to swipe a bit more oil onto the pan in between batches. While each new roti jala cooks, you’ll fold your previously fried roti jala into its final rolled shape. To store, refrigerate in an airtight container for up to a week. To reheat, sprinkle with water and microwave or pan-fry on low.You may find that very few kitchen moments are as satisfying as making an intricately drizzled roti jala. It’s the perfect activity when you want a seemingly impressive dish on your dinner table and leftovers to last you the week. Roti jala on repeat is the meal plan we all deserve.Mehreen Karim works in global women’s health and is the author of imakedthis.com, a food blog dedicated to conversational recipes that cut to the chase.Explore Bon AppétitIt's That SimpleMalaysianRead MorecookingIf It's Not Spicy Enough to Make You Sweat, It's Not ChowBy Lesley EnstonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-13", "author": ["Condé Nast", "Mehreen Karim"]}