{"id": "8f4a9d3a2858bb00fbc04e60568accb0", "url": "https://www.bonappetit.com/recipe/avocado-water", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Avocado Water Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueAvocado WaterBy Daniela Soto-InnesJanuary 8, 20194.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintAvocado gives this refreshing drink the creamy, sippable texture of a milkshake but without a drop of dairy.Ingredients1small ripe avocado, pit removed5Tbsp. fresh lime juice3Tbsp. sugarTiny pinch of kosher saltPreparationScoop avocado flesh into a blender and add lime juice, sugar, salt, ½ cup ice cubes, and 2 cups cold water. Purée until smooth; blend in another splash of water if mixture is too thick. Pour into glasses, filled with ice if desired.How would you rate Avocado Water?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMy go-to recipe any time I have avocados to use up before they go bad. Swapped lemon juice for lime this morning and it was just as good.AnonymousRochester, NY11/28/2020I was skeptical of the recipe, but decided to give it a go. I was not disappointed! This was a great use of avocado. It was a delicious and guilt-free indulgence. AnonymousCharlotte, NC3/24/2019This is so DELICIOUS!! I love avocados so this was perfect and easy.  I use coconut water to add an extra boost for my early morning workouts. amtdStone Mountain GA2/13/2019This is a drink pretty common in Asia. Check out your local boba outlets and try out avocado shakes. They make them with milk. Super yummy! This version you have is equally just as yummy but not as heavy. 👍🏼AnonymousOakland CA2/7/2019You are truly missing out if you do not add vodka to this. AnonymousSan Diego2/7/2019this was refreshing af. i riffed on it a bit and added some strawberry jam. it was very lassi-like 8)soofvirginia1/31/2019Explore Bon AppétitAgua FrescaCold DrinkDrinks AllAvocadoVegetableLimeCitrusFruitEasyQuick5 Ingredients or FewerDrinksNut-FreeGluten-FreeDairy-FreeVeganVegetarianKetoNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}