{"id": "8f6105c8bb12c7f73b06a92d3aac1d39", "url": "https://www.bonappetit.com/recipe/apple-walnut-upside-down-cake", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Apple-Walnut Upside-Down Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueApple-Walnut Upside-Down CakeBy Claire SaffitzSeptember 17, 20194.7(73)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintTender, nutty, and studded with caramel-glazed apple halves, Claire Saffitz’s apple cake is the best apple cake. (Yeah, we said it.) Use a cast-iron skillet to caramelize the apples and bake the cake all in one vessel, a win-win. Ground nuts give the cake a toasty, deep flavor and tenderize the crumb by adding fat and countering flour’s glutinous toughness. And one more pro tip from Claire: Use a melon baller, or a sturdy teaspoon measure, to remove the core in the neatest scoop.Ingredients8 servings1cup raw walnuts or pecans10Tbsp. unsalted butter, room temperature, divided4small or 3 large baking apples (such as Pink Lady), peeled, halved, cored½cup (packed) light brown sugar, divided1cup all-purpose flour1tsp. kosher salt1tsp. baking soda½tsp. baking powder¼tsp. freshly grated nutmeg1½tsp. ground cinnamon, plus more for serving½cup granulated sugar2large eggs, room temperature1tsp. vanilla extract½cup plain whole-milk Greek yogurt, room temperatureLightly sweetened, softly whipped cream (for serving)PreparationStep 1Place a rack in middle of oven and preheat to 350°. Spread out walnuts on a rimmed baking sheet and toast, tossing once, until golden brown, 10–12 minutes. Let cool.Step 2Meanwhile, heat a 10\" ovenproof skillet, preferably cast iron, over medium. Add 2 Tbsp. butter and swirl to coat; arrange apple halves cut sides down in a single layer in skillet. Cook apples, undisturbed, rotating skillet on burner as needed for even browning, until cut sides are golden brown, 5–10 minutes (the timing depends on the juiciness of the apples; juicier apples will take longer). Turn apples over and cook on rounded sides just until they start to release their juices and the tip of a knife slides through with slight resistance, about 5 minutes. Transfer apples to a plate, arrange cut sides up, and let cool.Photo by Chelsie Craig, food styling by Rebecca JurkevichStep 3Add ¼ cup brown sugar and 1 Tbsp. water to skillet and set over medium heat. Stir with a wooden spoon or heatproof rubber spatula until sugar is dissolved, then cook, swirling skillet occasionally (do not stir at this point), until thick and bubbling in a thin layer, about 1 minute. Let caramel cool in skillet.Photo by Chelsie Craig, food styling by Rebecca JurkevichStep 4Meanwhile, pulse toasted walnuts, flour, salt, baking soda, baking powder, nutmeg, and 1½ tsp. cinnamon in a food processor until combined and nuts are finely ground. Transfer walnut mixture to a medium bowl.Step 5Combine granulated sugar, remaining ¼ cup brown sugar, and remaining 8 Tbsp. butter in food processor (no need to wash it) and process in long pulses until mixture is light and smooth. Add eggs and vanilla and process in long pulses, scraping down sides of processor once, until mixture is smooth. Add half of walnut mixture and pulse to combine, then add yogurt and pulse just until incorporated. Add remaining walnut mixture and pulse just to combine.Step 6Arrange apple halves cut sides down over cooled caramel in skillet, spacing evenly. Fold batter a few times with spatula, scraping sides to make sure everything is well mixed. Scrape batter over apples and work into spaces around apples. Smooth surface (it’s okay if there’s only a thin layer of batter in places; it will rise in the oven).Photo by Chelsie Craig, food styling by Rebecca JurkevichStep 7Bake cake until it is browned across the entire surface and the center springs back when gently pressed, 30–40 minutes. Let cake cool in skillet 10 minutes, then run an offset spatula or a small knife around the sides of the pan to loosen. Set a wire rack upside down on skillet and flip over to release cake; carefully remove skillet. If any apples or cake stick to skillet, scrape them off and press back onto the top of the cake.Step 8Serve cake warm or room temperature. Slice into wedges and top with dollops of whipped cream and a dusting of cinnamon.Step 9Do Ahead: Cake can be baked 2 days ahead. Let cool completely. Store tightly wrapped at room temperature.Photo by Chelsie Craig, food styling by Rebecca JurkevichHow would you rate Apple-Walnut Upside-Down Cake?Leave a ReviewTell us what you thinkReviews (55)Back to TopTriangle1) this apple cake is THE BEST 2) it works beautifully with 1-to-1 gluten free flour. I had to bake for about 45 mins with the GF flour. Only suggestion is to make sure you are using a large food processor, mine was almost at overflow but everything else worked perfect. Alisha KNew York, NY1/1/2022I’ve made this cake several times since this recipe was in an issue of my Bon Appétit magazine. LOVE!! Great dessert for this time of year. It does not disappoint and relatively easy to bring together. Michelle Cleveland OH10/15/2021Just made this cake for the first time and I approve! The smell is amazing and the apples (I used small-ish pink lady) are nice and tender. A few notes for my fellow bakers—\n1) I was not about to bust out the food processor for this. Can confirm that it works perfectly well to hand-mix per usual cake baking. \n2) Did not grind my walnuts (see note on food processor) but did smash them up inside a baggie. This also works just fine in the recipe you get some chunks of walnut in the cake, which I enjoyed. \n3) My cast iron is 10 inch and there was no overflow. It was close! She was tempted to overflow, but she didn’t. Put a rimmed cookie sheet underneath just I’m case. Was able to fit 7 apple halves in the 10 inch pan. I ate the leftover half. \n4) I added a sprinkle of ground clove. HeatherAsheville, NC1/2/2021I make this recipe a lot, it's great! One time I didn't have flour so I used ground flaxseed instead, and it was honestly even better. So could be great gluten free, I'm sure almond flour would also rule but haven't tried itemily11/25/2020Please add measurements in grams! That should be a standard in baking and tbh BA knows better. Great recipe but had to do a lot of math since I was using a 12in cast iron and not a10. Grams would’ve made it much easier. Julie LNew York, NY11/25/2020love this - made it traditionally the first time then swapped pears for apples, used chestnuts and pecans, only about 1/8th of a cup of granulated sugar, subbed almond flour and subbed cardamom for the nutmeg.  this is awesome. I might further reduce the butter, but otherwise a great fall cake!AnonymousHudson Valley11/22/2020I like the idea of this a lot and would certainly riff on the concept, but this had a bit of a baking soda bitterness to it. Not a huge fan. Anonymous6/2/2020Yes, please include measurements in grams or ounces. How do you measure butter with a tablespoon? \nI do have a set of measuring cups but the amount of flour from the 1-cup cup seems too little for a cake to fill a 10-inch skillet. Perhaps the cups you use in the United States are different from mine.\nThere are many cake recipes from bon appetit that I would love to try. But I can't because the cup measurements just confound me.\nAnonymous5/24/2020The cake is incredible - perfectly balanced between sweet and nutty with a great texture. If I make it again, I will probably use smaller apples to balance the cake / apple ratio in each slice though.AnonymousPennsylvania5/17/2020this cake is soooo good- super moist, with a beautiful spice. I love this cake and it was not that hard beyond my apples taking way longer than 15 mins to cook thru. love love love. thanks claire!toronto5/14/2020This truly is THE best apple cake. Did exactly a half dose for my 5 inch cast iron and it turned out perfect! Incredible lil treat. ChampagnepongSan Francisco5/9/2020This is now the second time I have made this and I have no regrets. After being short on flour and long on apples after a pandemic panic purchase of pink ladies, did not disappoint the second time around. Not too sweet, perfect with a cup of coffee or scoop of vanilla ice cream. AnonymousBoston, MA5/1/2020Absolutely fantastic. Will make again. Pretty straight forward but the result is unbelievable. Also, not too sweet!! (I usually cut down on sugar in recipes but since its BA I always follow it to the letter:))AnonymousCanada4/11/2020This cake is WONDERFUL. The perfect challenge for the beginner(ish) baker and truly delicious. Would recommend quarantine or NOTAnonymous3/22/2020Cake is delicious! Not too sweet and very satisfying.  Easy to make in the food processor. Shared half  with neighbors and they raved and enjoyed it again for breakfast! This recipe is definitely a keeper.ruth10North Carolina1/28/2020Explore Bon AppétitCakeDessertAmericanWalnutNutAppleFruitFallBakingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Claire Saffitz"]}