{"id": "8f6fb75e988dc6ba998ce4fbde7f1dd8", "url": "https://www.bonappetit.com/story/aperol-water-bottle", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Everyone at the Y Is Jealous of My Hot Pink Aperol Water Bottle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEveryone at the Y Is Jealous of My Hot Pink Aperol Water BottleIt’s my sole motivation for working out. That and my heart health. By Alex BeggsOctober 30, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If you’ve ever gone months to years without regularly exercising, you might be familiar with this routine:Realize your body is slowly degradingCommit to trying a new workout, gym, or karate dojoBuy new shoes, headband, gym lock, gym bag, shower flip-flops, anything else that will materialistically help get your ass to the gymGet there, do the thing, cheer for self!!!!Well, I recently went through that, and now I’m a happy member of the YMCA, the greatest gym in America, where I spin for 20 to 30 sweaty minutes or slap water in the pool if it isn’t too crowded. Yay me! Enough of that. Let’s get to my sole motivation for working out: This water bottle from the New York bike shop NYC Velo. It’s $12 and it looks like a little bottle of Aperol.It doesn’t appear to be made by the Campari Group, which produces Aperol, so it miiiight be in trademark violation, but I hope they never get in trouble for it. Parody, right? It’s hot pink with a bright blue lid. The label has an Aperol Spritz recipe on it, as if you don’t already have it memorized. Other than its obvious aesthetic perfection, the bottle’s design is key for those who Exercise: It has a “sport” top, meaning I can squeeze water into my mouth without unscrewing a cap or stabbing a plastic straw up my nostril or spilling all over my face. I can open and close it with the strength of my teeth, like the gladiator I am. The whole time I’m spinning on a bike going nowhere, my cheerful water bottle reminds me that there’s a reward (this is important to have when you’re trying to get into exercise) at the end of this minor torture: a steam, or a bath, maybe a cocktail.This isn’t an insulated desk bottle to refill at the water cooler six times a day. It’s for the gym or bike or whenever else you need to squeeeeeeze. It’s plastic, therefore it sweats—but so do I. I refuse to see that as a downside. I take the cold condensation and wipe it on the back of my neck after an especially grueling 18-minute ride. I’m not training for the Tour de France here, I’m just trying to have a good time. Are you motivated yet?Buy it: Aperol Bottle, 22 oz., $12 on NYCVelo.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-30", "author": ["Condé Nast", "Alex Beggs"]}