{"id": "8f7495ac4746fd56fbffe7960c224314", "url": "https://www.bonappetit.com/story/cheese-plates-perfect", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "These 5 Cheese Plates Are Perfect, So Copy Them Exactly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese 5 Cheese Plates Are Perfect, So Copy Them ExactlyWe did the pairing work for you—all you need to do is buy the cheese.By Tia KeenanApril 24, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaFacebookTwitterEmailA great cheese plate surprises us, not just in that “I found a new cheese that I love” way, but by transforming how we think about the world of cheese, and ultimately, ourselves. Is this is a ridiculous amount of power to cede to cheese? I’ve heard too many people gush about being “obsessed with,”, “addicted to,” or “in love with” cheese to be that cynical.These cheese triptychs represent a few concepts to deepen your enjoyment of cheese.  The first plate explores the differences in the main cheesemaking milks. The second, the influence of Europe on American cheese.  The third is a reminder that a great cheese plate often starts with a great cheesemonger. The fourth posits cheese as a very real form of national expression.  And the last turns its nose not at the odor of the stinky cheese it celebrates, but at the deeply held belief that a cheese plate must be built on contrasting cheeses. With each plate we eat something delicious, but also learn something along the way, shifting the experience from merely tasty to enlightening.Clockwise: Bleu des Basques, Cantal, Capriole Dairy Wabash Cannonball\nPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaTHE HOLY TRINITY: GOAT, COW, SHEEPOne of the most useful tropes for composing a cheese plate is to choose one cheese from each of the main milks used to make cheese.  It’s an effective route to an interesting plate, and a convenient framework for creating your own personal Cheesus.Capriole Dairy Wabash Cannonball is a wrinkly, petite orb of ash-dusted goat cheese made by one of the pioneers of American artisan cheese.  It has a honey-ied, tangy, dense paste that holds some quiet yet willfully musky notes, like how a hamster is soft, cuddly and sweet, but also kind of smells.As one of the oldest styles of French cheese, the recipe for Cantal is a building block for many other cheeses, including cheddar. Aged Cantal has a firm, dense, earthy paste and a rind that looks like the crust on the bottom of a muddy pair of boots.  Young Cantal is mild, smooth, and grassy, with a more genteel rind. Both have their place, but aged Cantal is where the magic happens: it’s a complex, deep cheese to get you thinking.Bleu des Basques is a study in textural variation: an uber rich paste of buttery, lanolin-laced sheep’s milk holds pockets of crunchy, mild, crystalline blue mold.  A French- Basque sermon for conversion to the magical realism of sheep’s milk.Clockwise: Old Chatham Ewe’s Blue, St. Malachi, Moses Sleeper\nPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaHISTORY REPEATINGSome of the best cheeses from pioneering American artisan cheese makers who’ve shaped the real cheese revolution look back to Europe for inspiration, but are all about the here and now.Jasper Hill Creamery Moses Sleeper is a new-World interpretation of Brie (by way of Vermont) that faithfully delivers the right vibe with notes of fresh mushrooms and crème fraiche.It’s been a great year for The Farm at Doe Run, whose St. Malachi won one of the top prizes in the 2017 American Cheese Society (2nd place, Best in Show). This cow’s milk cheese from Pennsylvania is a hybrid of Gouda and alpine styles, with a hard, dense paste that’s all buttered wheat toast and hazelnut butter.Old Chatham Ewe’s Blue is a deeply mottled sheep’s milk blue in the style of Roquefort with notes of fresh and cooked fruits (think grandma’s stewed prunes, but appetizing) and a buttermilk-like tang.Clockwise: Pecorino Primo Sale, Smoked Ricotta Peperoncino, Manteca Caciocavallo Podolico\nPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaTRUST YOUR MONGERTrust is the backbone of European food culture: Who you buy from is almost more important than what you’re buying.  Marcelli Formaggi is one of my trusted purveyors—if they’re selling it, I know it’s good. This spread is sourced from their collection of farmstead cheeses made in and around Abruzzo, Italy.Sweet, grassy cow’s milk butter stuffed inside a firm, stretched-curd Caciocavallo cheese? Sign me up! Manteca Caciocavallo Podolico is a cheese you can’t stop talking about.  Why? Because it’s butter and cheese—don’t be coy.Putting a superior version of a cheese people think they know about on a plate is a signature smarty-pants move.  Pecorino Primo Sale is a young, semi-firm pecorino (sheep cheese) that’s floral, earthy, and just a smidge salty. It wrests pecorino from its reputation as a dry, hard wedge that’s either too bland or too funky.Where there’s smoke there’s fire, and Smoked Ricotta Peperoncino has plenty of both, from the juniper wood used to smoke it, and the fire engine red pepperoncini crusting this funky little drum.Clockwise: Fenna Mundo, Bla Kornblomst, Antvorskov\nPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaGREAT DANESDanish cheeses have more in common with the modern functionality of Arne Jacobson furniture than the experimental existentialism of a Lars Von Trier film. They’re well-crafted, precisely realized, and user-friendly.  Sometimes the discovery of a less-explored cheese culture is a cheese plate’s revelation, beyond the cheese itself.Fenna Mundo is a fresh goat cheese flecked with fennel—a bright, tangy aromatic herbal bite that’s elegantly adorned and simply delicious.Antvorskov is a mild cow’s milk cheese with a dense paste that has the nuttiness of Gruyere, the dense toasted milky-ness of Gouda, and the I-can’t-stop-eating-this appeal of your favorite snacking cheese.Sixty or so years ago, back when there wasn’t much European cheese available in the United States, Danish blue was the cow’s moo, and one of a handful of stalwart Euro imports. Bla Kornblomst is a velvety, rich, medium-bodied blue that’s a superior example of the genre.Clockwise: Fiacco di Capra, Bachensteiner, U Pecorinu\nPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaGET UP ON THAT FUNKThere are those who love stinky cheese and those whose opinion I don’t respect. Stinky cheese is life. Don’t @ me.Shaped liked a twee brick and wrapped in gold foil, Bachensteiner channels some serious Solid Gold disco funk by way of Germany. It’s a silky, full-bodied stinker with grassy, meaty, onion-y notes.Goat milk cheeses with washed rinds like Fiacco di Capra are rare, and that’s a shame.  Briny and pungent is a good look with goat’s milk, whose bright twang can handle the intensity of the style. This Taleggio-style cheese with a smooth, semi-soft paste is as lively and expressive as a Soul Train dance line.U Pecorinu is an oozy little puck of sheep’s milk funk with a sticky rind and notes of wild oregano—a rustic, animally cheese that will tell you something good (tell me that you like it).Tia Keenan is the author of The Art of the Cheese Plate: Pairings, Recipes, Style, Attitude (Rizzoli) and the forthcoming Short Stack Edition: Chèvre and Melt, Stretch, Sizzle: The Art of Cooking Cheese (Rizzoli).Want more cheese content? Yeah, you do.Explore Bon AppétitCheese WeekCheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Tia Keenan"]}