{"id": "8f7c0b6f4576729e25189129be3370d3", "url": "https://www.bonappetit.com/story/how-to-grill-wings", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "How to Grill Chicken Wings Perfectly Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Grilled Chicken Wing Method Is Fuss-Free and FoolproofYou’ll never have to wonder whether they’re cooked through ever again.By Ali FrancisJuly 12, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailI spend equal amounts of time resisting and submitting to optimization culture. You’ll find this existential crisis manifest most overtly on my bookshelf, where Jenny O’Dell’s How to Do Nothing rubs spines with Brandon Bornancin’s Whatever It Takes. There is, however, one area of my life where I fully, uninhibitedly embrace efficiency: entertaining. Nothing gives me a SULA (Sweaty Upper Lip Alert) more than having guests watch me prepare their food. All the aimless milling and the “How can I helps” are just too much to manage for my peanut brain, which is already hard at work cooking.Lucky for me, our assistant food editor Jessie YuChen developed a new way to grill wings that gives me the piece of mind I need heading into a raucous #VaxxedGirlSummer. Jessie’s strategy, which comes to life in this sweet, sour, and umami-packed Hot Honey Wings recipe, is all about the precook. “You bake the wings in the oven low and slow to ensure they’re cooked through and that they’ll be juicy,” Jessie explained. Then when it’s time to serve them, all you have to do is fire up the grill and “give them a nice char on the outside.” The best thing about this method, Jessie said, is that the wings can be made in bulk and prepared a day in advance. It’s my perfect entertaining triumvirate: an impressive looking dish, a fiery grill show, and easy-breezy-under-control hosting.How to grill chicken wings:When I gave the recipe a whirl, I followed Jessie’s lead to a tee. I preheated the oven to 375°F and patted the chicken wings dry with paper towels. Then I arranged them on a lined baking sheet and dusted the wings all over with chili powder, salt, and pepper before letting them chill for 15 minutes. It was somewhere in this liminal space of inaction that I thought, “Huh, no oil?” There is not a meat or vegetable that I place in my oven without first dousing it with some kind of fat—the secret ingredient to crisp, caramelized outsides. But Jessie reassured me that would come later: “When you’re cooking them in the oven, you just want the fat to render out a little and lock in the moisture before grilling.”I sent my tray of wings into the oven for 30 minutes and went about making the marinade, whisking together honey, chili crisp, fresh lime juice, and fish sauce. A lick of my pinky finger sent a jolt of vinegary brightness across my tongue. I pulled the wings from the oven and plucked them off the tray with tongs to store overnight in an airtight container. In truth, I was a little worried at this point; they were beige and fleshy and kind of sad looking. How was this all going to play out? Would my wings char to perfection on the grill as my guests (um, the two humans I share a house with) ooo and ahhh? Or would I decimate them into dry little hunks and ruin the meal?The following day I prepped my grill for medium heat and tossed the cooked wings around in a big bowl with the premade marinade. I took a deep breath, and loaded it with shishito peppers and drippy wings. How long to grill chicken wings depends somewhat on your grill, but I found six minutes (Jessie suggested five to eight minutes) on each side was perfect. Lo and behold, I ended up with a platter full of perfectly-charred, ultra-juicy, seasoned-to-the bone wings; nothing of the naked little globs I’d pulled out of the oven the day before. They weren’t too charred either, because, as Jessie said, most of the fat had already been rendered out. “When you’re grilling something fatty, the fat drops and catches on fire, which can burn the food,” they explained.After all that, none of my housemates were around to experience this graceful, SULA-free performance. I topped my wings and peppers with sliced jalapeno, cilantro, peanuts, and more chili crisp. Then, I crafted a paper towel bib and tucked into the sticky-spicy wings with my bare hands—which, I guess, is another form of optimization I am absolutely down with.Get the RecipeHot Honey WingsHot honey is good on everything: pizza, biscuits, and these crispy, low-fuss grilled wings.View RecipeExplore Bon AppétitcookingtechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-12", "author": ["Condé Nast", "Ali Francis"]}