{"id": "8f7d768e77d9b096011e635369b276ec", "url": "https://www.bonappetit.com/story/ginger-wine", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "My Family's Ginger Wine Recipe Is Spicy, Sweet, Zingy, and 100 Percent Alcohol-Free | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSome Say Ginger Wine Fights Colds and Indigestion—but I Drink It Because It’s DeliciousThis caramel cordial is flavored with chiles, spices, ginger, and lime—so you know it’s good.By Beverley Ann D'CruzMarch 3, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat BoytsovaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes and drinks we make with our eyes closed. Today, ginger wine.When I was growing up in Bombay, ginger wine—my family’s recipe, specifically—was my drink of choice. I loved watching my mother concoct the deep amber cordial by magically transforming sugar into a rich caramel, then infusing it with cinnamon, cloves, cardamom, nutmeg, chiles, ginger, and lime juice. She served it over crushed ice. The first taste was sweet and refreshingly frosty, followed by the warmth of the spices, a zing of lime, and the final smack of chile, which would leave my lips tingling.If you’re wondering where the wine comes in, it doesn’t. As a name, “ginger wine” is a misnomer (and should not be confused with the fermented alcoholic drink made from raisins and ginger). It’s called Ginger Pop (O.T.) in The East Indian Cookery Book, but my grandmother’s personal recipe has it labeled as O.T. Temperance Drink. A little internet snooping revealed that these recipes could be inspired by a certain O.T. Chillie drink that was produced by the Prahran Ice and Aerated Water company in Australia around 1905. Purportedly based on a recipe from an Indian maharaja (which explains the chiles and spices), it was a smash hit from Shanghai to Valencia until the mid-20th century. Advertisements claimed it had the restorative powers to quell coughs, colds, and indigestion, benefits validated by my own family members who continue to brew our nana’s recipe more than a century later.Here’s how to make ginger wine:My only chef-y advice is to have all your ingredients measured and prepped in advance, as the recipe moves quickly after the caramel is ready. There’s a lot of pounding involved, but it makes this process a great stress reliever and leaves your kitchen smelling like a holiday candle.Place a frying pan over medium-high heat. Add 4 dried Kashmiri chiles (you can substitute 2 arbol chillies), turning them over occasionally to toast all sides. Be vigilant as they darken quickly. Allow to cool so that they are easier to crush later.Juice 4 limes. Count out 10 cloves, 10 cardamom pods, 2 large cinnamon sticks, and 1 nutmeg. Peel a 1\" piece of fresh ginger (more if you like the burn), then smash it with purpose. Now that you’re warmed up, powder the nutmeg (I use a mortar and pestle, but a coffee or spice grinder works too). Add the spices and chiles and give it a rough pound just to break open the cardamom pods and the peppers.Tip 2 cups sugar into a medium saucepan and place over medium-high heat. Let the sugar hang out for a couple of minutes. Swirl the pan to move around and loosen the caramel forming. Repeat the swirling motion every few minutes, keeping your eye on the color and reducing the heat if it darkens too quickly. Keep going until the sugar turns a dark amber, about 10 minutes. Ease any stubborn sugar blobs with a spoon (it can get messy, so try not to use one until the very end) and stir until smooth.Reduce the heat and stand back while adding 1 cup water as it will bubble and hiss angrily. When calm, stir gently until all the caramel has melted. Add 3 cups water, ginger, lime juice, and crushed spices. Bring to a boil, then lower the heat and simmer until the liquid reduces by half and reaches a syrupy consistency. Once cooled, strain into a bottle (use a coffee filter to catch the fine nutmeg powder). You’ll have about 2 cups. Store in the refrigerator for up to two months.How to use ginger wine:Its versatility is endless: Add some sparkling water (or ginger ale) and serve over crushed ice for a quick cooler to beat the heat, or sneak in some whiskey or brandy (yes Dad, I noticed) for a winter warmer. Beyond the glass, the spiced syrup can be drizzled over waffles, pancakes, and ice cream for extra sass. Douse a buttery Bundt or semolina cake to raise eyebrows and spark conversation (“Is that chile in my dessert?”). Or, if you’re feeling particularly adventurous, use it to smother a wheel of Brie and bake until gooey. I did, and it was a glorious hot mess.Whichever way you choose to indulge, there’s one guarantee: Ginger wine will invite your tastebuds to a wild, raucous party. And if the sting of the chiles doesn’t keep you coming back for more, the sugar high certainly will.Explore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-03", "author": ["Condé Nast", "Beverley Ann D'Cruz"]}