{"id": "8f7d7f80d0ade7d51aaa58d6ed9a6366", "url": "https://www.bonappetit.com/recipe/confetti-rice-with-chicken-in-spicy-garlic-broth", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Confetti Rice with Chicken in Spicy Garlic Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesConfetti Rice with Chicken in Spicy Garlic BrothBy Andy BaraghaniJanuary 9, 20184.6(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintWe took a page from chef and author David Tanis and added a bunch of seedy, pickley things to our sushi rice.Ingredients2 servings2bone-in, skin-on chicken breasts (about 1½ pounds total)5scallions3garlic cloves, smashed½red chile (such as Fresno), seeds removed, coarsely chopped1tablespoon tamari or soy sauceKosher salt1cup sushi or other short-grain rice1medium Persian cucumber, halved lengthwise, thinly sliced crosswise¼cup pickled ginger, finely chopped, plus 1 tablespoon pickling juice1tablespoon toasted black sesame seeds, plus more for servingPreparationStep 1Cover chicken with 5 cups water in a medium pot. Cut white and pale green parts from scallions (reserve dark green parts) and add to pot, along with garlic, chile, tamari, and 2 tsp. salt (chicken should be just submerged in pot; if not, add more water to completely cover). Heat pot over medium-high. As soon as liquid begins to boil, immediately reduce heat to medium-low and gently simmer until chicken is cooked through, 16–20 minutes (an instant-read thermometer inserted into the center of a piece should register 155°; temperature will continue to rise once off heat). Transfer chicken to a plate; let cool slightly. Using a spider or slotted spoon, remove and discard solids from broth. Keep broth warm over low heat.Step 2Meanwhile, rinse rice in a fine-mesh sieve, stirring with your fingers, until liquid runs mostly clear. Shake off excess water and transfer to a medium saucepan; add a pinch of salt. Add 1¼  cups water and bring to a boil. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid is mostly absorbed, 18–22 minutes. Fluff with a fork; cover and let sit 10 minutes.Step 3Finely chop reserved dark green parts from scallions and set aside 1 Tbsp. for sprinkling. Toss remaining chopped scallions, rice, cucumber, ginger, pickling juice, and 1 Tbsp. sesame seeds with a wooden spoon or rubber spatula in a large bowl until rice looks speckled; season with salt.Step 4Pull chicken meat off bones; thinly slice. Divide rice and chicken among bowls and pour some hot broth over. Sprinkle each bowl with sesame seeds and reserved scallions. Reserve leftover broth for sipping.How would you rate Confetti Rice with Chicken in Spicy Garlic Broth?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI cheated with a deli-roast chicken & made a cup of spicy broth with green onions. Otherwise followed the recipe. I liked the concept as it was easy to put together & tasted fresh & bright.Terri HVictoria BC Canada1/28/2021Love this recipe! I make it all the time. The first time I made it exactly as the recipe describes, but sometimes I make it with different ingredients - whatever I have around. The best healthy and hearty meal and SO fast to makeAnonymouschicago5/4/2020Andy does it again! This recipe is life-bringing in the cold, New England winters. Add some extra soy, chile, and garlic to the broth to ensure that you take it to the next level. Healthy, quick, and tasty - would highly recommend! AnonymousNew Haven Ct9/9/2019this dish is fantastic!  the kids are eh on the cucumber in the rice but I love the crunch.  The flavors are wonderful together.Anonymous4/22/2019I've really been enjoying these meals from the Feel Good Plan! Especially since they are all so quick and easy for weeknight cooking, as opposed to many Bon Appetit recipes. This one was especially easy to throw together. I felt like my broth was a little bland. Maybe I under salted it. I was initially a little disappointed by this meal at first bite but then I drizzled some Sriracha over it and I felt like it was exactly what it needed! I used black rice since I try to avoid cooking white rice at home and used white sesame seeds instead of black so it still looked pretty. Although I didn't mind  the cucumber mixed in, I think I may make a little cucumber salad with rice wine vinegar and the ginger and serve it on the side next time (similar to Thai chicken and rice). I think that would be refreshing with this dish. AnonymousSan Francisco, CA1/11/2018The chicken was good and so was the broth but the ginger and cucumber ruined the rice. The ginger overwhelmed the dish and the cucumber would have been better served as a side salad. I'll throw a nub of ginger in the broth next time. I'm enjoying following the meal plan for the techniques and tricks for pulling together a flavorful dish. Even though we didn't love it we can tweak it to our tastes next time AnonymousPortland, OR1/10/2018This was delicious!  Used a whole aji amarillo chile which gave the broth a good heat level.  Because I needed to use more water to cover my chicken, I strained and reduced it after the chicken was cooked.  I also reduced the salt.  Because my pickled ginger came from the health food store, it was tan instead of pink, so not as pretty but still tasty.  I'm so glad I made extra because it's going to be great for lunch tomorrow!sharontalbColorado1/10/2018I was pretty skeptical about this one. The boiled chicken and pink pickled ginger really had me concerned, but so far these recipes have been great so I stayed true to the vision. So glad I did! I used a whole jalapeño because it’s all the bodega had and kept the seeds so it was spicy enough for us. I think using the red picked ginger instead of the pink would be interesting, but I’m pretty sure you’d need to skip salting the rice and add some sugar instead. You could also probably use a bit of grated ginger and seasoned rice vinegar if it’s what you had on hand. The ginger melted into the background of the broth making for an interesting flavor profile. It did not taste like sushi rice put into soup, more like a spicy ginger chicken & rice porridge. AnonymousNew York, NY1/10/2018This is an awesome recipe. My broth is spicier; I used two afghan chilies (we grow them), which were a great, piquant addition. I also added about two splashes of rice vinegar to the broth to give it a little punch. I made a salad with the cucumber (English, couldn't find Persian), pickled ginger with some of the liquid, sliced scallions, sesame oil, a dash of salt, and the black sesame seeds. Will use the plain rice as a bed, with the chicken on top, doused with broth, and the cucumber ginger salad as a garnish, extra served on the side. Also adding a soft boiled egg. Thank you for this recipe! PS; your podcast is amazing. stephanie searorClarksville, TN1/9/2018Loved! I like things a little spicier, so I used the whole chile (still seeded it though). I also included regular toasted sesame seeds in addition to the toasted black sesame seeds. One cup of rice was a good amount for two generous servings, but I think next time I’ll make a little more for leftovers the next day. I feel like this would be great cold.Virginia 1/3/2018Love love loved the broth, and my chicken turned out perfectly tender and seasoned. But paired with all the pickled ginger in the rice and the broth on top....it reminded me of chicken sushi soup and I couldn't really get past that. I just ended up deconstructing everything on a plate, left out the pickled ginger, sipped the broth on the side.jillian leAtlanta12/31/2017Explore Bon AppétitChicken BreastChickenPoultryRiceRice & GrainsGarlicVegetableFresno ChileChileEasyWeeknight MealsMainDairy-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-12-26", "author": ["Condé Nast", "Andy Baraghani"]}