{"id": "8f8600449391ee5b0a140dac53aa5fab", "url": "https://www.bonappetit.com/recipe/pavlovas-with-fresh-berries", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Pavlovas with Fresh Berries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJuly 2015 IssuePavlovas With Fresh BerriesBy Rachael CoylePhotography by Ditte IsagerDecember 3, 20213.6(37)Read ReviewsTriangleEmailPinterestPrintDitte IsagerEmailPinterestPrintEmailPinterestPrintThis pavlova recipe is all about achieving that perfect range of textures, where velvety dollops of whipped cream top a crisp, delicate meringue shell made extra crunchy by the addition of nuts or poppyseeds before baking. Technique is key here: Heating the sugar before beating it into the egg whites creates an extra-glossy, stable meringue and using a wooden spoon to prop the oven door open just a smidge while the meringues cool helps ensure they won’t collapse. A few cracks are common; simply cover them with the whipped cream and berries—or passion fruit and mango if you prefer tropical fruit flavors. Yielding 12 individual meringues, this recipe is ideal for those of us tired of loved ones trying to hog our dessert: Everyone gets their own.Editor’s note: This recipe was originally published June 23, 2015.IngredientsMakes about 12  ServingsMeringue1¼cups sugar6large egg whitesPinch of cream of tartar½teaspoon kosher salt1vanilla bean, split lengthwise, or 2 teaspoons vanilla extract¾cup chopped almonds, walnuts, or pistachios, and/or 3 tablespoons poppy seedsAssembly¼cup sugar36ounces raspberries and/or blackberries (about 6 cups), divided1¼cups heavy creamPreparationMeringueStep 1Preheat oven to 350°. Scatter sugar in a shallow baking dish and bake 10 minutes. After 8 minutes, using an electric mixer on medium-high speed, beat egg whites and cream of tartar in a large bowl until foamy.Step 2Remove sugar from oven and decrease temperature to 200°. With the mixer running, gradually stream sugar into egg whites. Add salt and beat until stiff peaks form and bowl is barely warm to the touch. (Heads up: This can take as much as 10 minutes with a stand mixer and up to 20 minutes with a handheld mixer.) Scrape in vanilla seeds, reserve pod for another use, and beat just to combine.Step 3Scoop large spoonfuls of meringue onto 2 parchment-lined baking sheets to make 12 mounds. Make a slight indentation in the center of each mound with the back of the spoon, pushing out to create 3\"-diameter rounds. Top the border of meringues with nuts and/or poppy seeds, as desired.Step 4Bake meringues until dry and firm, about 2 hours and 15 minutes. Turn off oven and use a wooden spoon to prop door ajar. Let meringues cool completely in oven.Step 5Do Ahead: Meringues can be made 1 day ahead. Store tightly wrapped at room temperature.AssemblyStep 6Combine sugar and 2 cups berries in a medium bowl and mash together with a fork until sugar is dissolved and mixture is bright in color and pourable.Step 7Whisk cream in a medium bowl to medium peaks. Spoon whipped cream into centers of meringues, top with remaining berries, then drizzle with sauce.Step 8Do Ahead: Berry sauce can be made 4 hours ahead. Store tightly covered at room temperature.Nutrition Per ServingCalories (kcal) 270 Fat (g) 13 Saturated Fat (g) 6 Cholesterol (mg) 35 Carbohydrates (g) 38 Dietary Fiber (g) 6 Total Sugars (g) 30 Protein (g) 5 Sodium (mg) 120 How would you rate Pavlovas With Fresh Berries?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a lousy recipe.  The meringues didn’t cook properly. Many other reliable recipes. Don’t bother with this one. Anonymous5/31/2021I found this great recipe in a list of lactose-free desserts, I think this recipe slipped through the cracks, it calls for whipped cream :( Anonymous5/8/2019Explore Bon AppétitFruit DessertDessertAustralianNew ZealandBerryFruitSummerGluten-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-06-23", "author": ["Condé Nast", "Rachael Coyle", "Ditte Isager"]}