{"id": "8fa3d77234b00b0e443067bb993bd5a8", "url": "https://www.bonappetit.com/recipe/curry-leaf-popcorn-chicken", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Curry Leaf Popcorn Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCurry Leaf Popcorn ChickenBy Nik SharmaOctober 1, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Nik Sharma's Season, our October 2018 Cookbook Club pick. Sharma says: \"Whenever I make popcorn chicken or fry larger serving pieces, I flavor the dish in stages. The whole spices are toasted to activate their oils. These are then blended into buttermilk to create a savory marinade. More seasoning is then added to the flour in the dredging mixture, and finally, the hot little nuggets of chicken are topped with fried chiles.\"Season by Nik Sharma with permission by Chronicle Books, 2018.Ingredients4–6 servingsSeeds from 4 green cardamom pods (about ¼ tsp. seeds)2tsp. coriander seeds2tsp. cumin seeds¼tsp. whole black peppercorns2cups buttermilk¼cup fresh lime juice2–3serrano chiles, coarsely chopped6scallions, roots removed, coarsely chopped11\" piece fresh ginger, peeled, chopped4garlic cloves25curry leaves, preferably fresh, divided1Tbsp. plus 1 tsp. kosher salt1½tsp. cayenne pepper, divided2lb. skinless, boneless chicken breasts, patted dry, cut into 1\" pieces2cups all-purpose flour1tsp. baking powder½tsp. baking sodaNeutral oil (for frying; about 4–6 cups)4green Thai chiles, seeded if desiredSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Heat a dry small skillet over medium-high. Toast cardamom seeds, coriander, cumin, and peppercorns, tossing often, until fragrant, about 1 minute. Transfer half of the spices to a spice mill or mortar and pestle and grind to a fine powder; set aside.Step 2Blend remaining whole spices, buttermilk, lime juice, serrano chiles, scallions, ginger, garlic, 15 curry leaves, 1 Tbsp. salt, and 1 tsp. cayenne in a blender until smooth. Transfer to a large resealable plastic bag. Add chicken, seal bag, and turn chicken to coat. Chill at least 4 hours and up to 8.Step 3Combine reserved ground spice mixture, flour, baking powder, baking soda, and remaining 1 tsp. salt and ½ tsp. cayenne in another large resealable bag. Finely chop remaining 10 curry leaves and add to bag. Shake vigorously to combine.Step 4Pour oil into a large heavy pot fitted with a deep-fry thermometer to a depth of 1½\". Heat over medium-high until thermometer registers 350°.Step 5Meanwhile, remove one-third of the chicken from marinade, letting excess drip back into bag, and transfer to bag with flour mixture. Shake vigorously to evenly coat, then transfer chicken to a wire rack set inside a rimmed baking sheet. Repeat with remaining chicken.Step 6Working in batches, fry chicken, turning often and adjusting heat to maintain oil temperature, until golden brown and cooked through, 6-8 minutes. Using a spider or slotted spoon, transfer to a wire rack set over paper towels to drain.Step 7Cut Thai chiles in half lengthwise. Add to hot oil along and fry until crispy, about 30 seconds. Drain on paper towels.Step 8Arrange chicken on a platter. Top with fried chiles.How would you rate Curry Leaf Popcorn Chicken?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is so phenomenally good! It's well worth the work, and yes, it's messy. Who cares? It's hard to stop eating these tasty little addictive pieces of chicken once you start. Served over a good basmati rice, perfection! My fave popcorn chicken ever.CasySt. Louis4/14/2020WOW! This was sooo good. It takes some time and can get a bit messy, but it is definitely worth it. The  buttermilk marinade really brings all the flavors together. As a plus, our kitchen smelt amazing all day. If you have some time and want a great meal, I highly recommend this one. AnonymousChicago, IL11/5/2018Explore Bon AppétitFried ChickenThaiSoutheast AsianAsianSouthernAmericanChicken BreastChickenPoultryThai ChileChileVegetableButtermilkOther IngredientsMainNut-FreeDeep-fryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Nik Sharma"]}