{"id": "8fb054e31107ecc6422e0d8b7c4f2b86", "url": "https://www.bonappetit.com/recipe/pimiento-cheese-crackers", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Pimiento Cheese Crackers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssuePimiento Cheese CrackersBy Andy BaraghaniNovember 20, 20183.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe addictive cheddar cracker is all grown up, thanks to a little heat from the cayenne and a hint of sweet pepper from the pimiento. The cheese and butter lend a decent amount of fat, so their melt-in-your-mouth texture keeps you coming back for more. This dough can be formed into a log and stashed in the freezer so it’s on hand for whenever you just happen to need a party appetizer. Let thaw in the fridge overnight before slicing.Ingredients8 servings12oz. sharp cheddar, coarsely grated (about 4 cups)1cup plus 2 Tbsp. all-purpose flour1½tsp. kosher salt¼tsp. cayenne pepper¼cup chopped jarred pimiento peppers5Tbsp. chilled unsalted butter, cut into pieces3Tbsp. white or black sesame seedsPreparationStep 1Pulse cheese, flour, salt, and cayenne in a food processor to combine (4–6 pulses should do it). Add pimiento peppers and pulse until mixture turns orange (another 2 or 3 pulses). Add butter and pulse until largest pieces are about the size of a pea (4–6 pulses). Drizzle in 2 Tbsp. ice water and pulse 2 or 3 more times. Dough should stick together when squeezed in your hand. If not, pulse in another tablespoonful of ice water.Step 2Transfer dough to a work surface and form into a tightly packed 2\"-diameter log. Gently sprinkle sesame seeds over surface and roll log over sesame seeds, pressing them into dough to adhere, until completely coated. Discard any sesame seeds that don’t stick. Wrap dough in plastic and chill at least 4 hours and up to 2 days before rolling out.Step 3Place a rack in the middle of oven; preheat to 350°. Unwrap dough and using a sharp knife, slice into thin rounds; aim for ⅛\"–¼\" thick. Transfer rounds to a parchment-lined baking sheet, spacing about 1\" apart (they won’t all fit in one batch). Prick each cracker 3–4 times with a fork to keep them from puffing up and bake, rotating baking sheet front to back halfway through, until tops and edges are golden, 25–30 minutes. Let cool on baking sheet; crackers will crisp as they cool. Repeat with remaining rounds and a fresh parchment-lined baking sheet.How would you rate Pimiento Cheese Crackers?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleDelicious and easy. I followed the directions as given using chopped pimentos from the grocery store. I used store brand butter and store brand sharp cheddar. I rolled the dough in a mixture of black and white sesame seeds. The recipe yielded 83 incredibly delicious crackers. These are officially part of my repertoire. I want to try with some specialty cheddar. LoriBeeRichmond, VA12/5/2021This recipe turned out excellent for me. I followed the recipe exactly as written. I used a block of store brand extra sharp cheddar cheese. Nothing fancy.\n\nThis is a pastry dough so you don’t want to over hand with it while mixing.  I followed the pulsing directions exactly.\n\nChill time for the dough is very important. I chilled mine overnight. This helped with slicing and keeps the rounds from spreading while baking.  I used a soft cheese slicer to slice the dough. \n\nI will make these again.KatenPhoenix AZ12/21/2020So yummy and simple! I found this recipe very flexible, I only had 8oz of cheddar so I sized down the other ingredients but forgot and added the full amount of butter, and they still turned out great. I also didn’t add any pimento pepper and just upped the cayenne powder, and that worked fine. I made them smaller than the 2” diameter (about 1” before cooking) and they spread just a bit to a perfect size. I found they didn’t need this much cook time with my oven - I took them out at 20 minutes and they were very brown and crispy, so I’ll lower the oven temp and keep a closer eye on them next time. I’ll also use a sharper cheddar and more cayenne powder, but overall these were the crispy crunchy cheesy delicious little appetizers. Highly recommend!AnonymousNew York4/12/2020I did a lot of things wrong, and these still came out awesome! I use a small food processor - which has yet to fail me. Until this recipe. There is just too much cheese and dough for a small food processor. You definitely need a full size one, or you need to do it in batches. I learned this the hard way, and ended up having to overwork my dough to get everything to mix well. I was convinced that the crackers would somehow not turn out because of it. I still had large chunks of visible pimientos that I thought were going to burn and ruin the cracker. But alas, the crackers turned out perfect. I used Cabbot Extra Sharp cheddar, and my crackers barely spread. I also put a full 4oz can of pimientos in the dough, realizing too late it called for only a 1/4 cup, and the crackers were fine.. Another tip: I cut each cracker out all at once and used multiple baking sheets, keeping the ones that weren't baking in the fridge until it was their turn to go into the oven. The crackers taste amazing, and are an awesome effort to reward appetizer. AnonymousGrand Rapids, MI12/29/2019Not enough pimento flavor and crazy cooking time/templeaves an oily burnt abomination. 10 minutes at 400 degrees makes them edible but...not awesome.\n\nBased on cheese cracker recipes I love, I would add 2x as much flour, and bake at higher temp for less time. \n\nGood idea, bad recipe!\nAnonymousSF Bay Area 12/24/2019Wow, these are the best crackers!!  Every time I make these, my guests go crazy. I always have to give them the recipe!AnonymousCalifornia12/20/2019These crackers are wonderful!\nUnlike the experience of others, the crackers did not spread more than was expected. The flavors are spot on. The only addition I made were the red pepper flakes I added to the dough.SoCal10/1/2019I haven't made there yet, but for those complaining, chilling time is crucial.  It has to be chilled before gluten can form and make a tough cracker.  I would cut up my butter and stick it in the freezer just before ice crystals start to form. Also, I would stay away from pre-grated cheese because it often has fillers to keep it separated that can mess with your dough. Put your cheese in the freezer, too. When I make my pimento cheese, I always add a pinch of mustard and a dash of Worcestershire which enhances the flavor.arbpen9300Glendale9/16/2019These were delicious and I had no trouble at all making them. I used pre-shredded Cheddar and followed directions exactly. Yum! Asheville, North Carolina 2/14/2019Very tasty but not good looking! A bit greasy as well. Hard to cut thinly, dough is crumbly.AnonymousOregon 1/13/2019I had a different problem from the first reviewer- ours didn't spread but ended up in a puddle of oil and overcooked well before 20 minutes passed. Followed the recipe/chilling time to a \"T\". We bought a high quality cheddar and I wonder if that changes the texture? Wanted to love these for our NYE spread but it looks like we are going with store bought for tonight. marypiepRI12/31/2018Obsessed with these. They were the star of Thanksgiving appetizer round. The dough was a little crumbly (I'll add more water next time), but patting it in tight in the roll helped combine it, and when some of my slices broke, I put them together and they turned out great. I only chilled an hour and they didn't spread. Like adult Cheez-Its. YUM. (I used Whole Foods brand cheddar, the cheap stuff.) alexbeggsBA.com 12/12/2018Like the second reviewer, I used slightly less cheese and had zero issues with the greasiness of the first reviewer. I did need 25 minutes in the oven. They do spread slightly, and do not crisp up right away but later on the pan as it says in the recipe. I didn't pat my pimentos dry since you just have to add water to the dough anyway. I wonder what brand of cheese the first reviewer used? I used a combo of Tillamook Extra Sharp and Sharp cheeses with success. Very tasty. Oh -- I even used a gluten-free all purpose flour and although they were a little harder to keep together that worked fine as well. kimbeesSanta Clara, CA12/11/2018Made these yesterday, baked some \"testers\" today. After reading the last review, I used just a little less cheese..maybe the fat content caused the problem ( or maybe the particular cheddar used?)\nI patted the pimentos dry with paper towels, too. The crackers turned out great, and were plenty cheesy...but I would say, at least for my oven, 19-20 minutes is plenty.AnonymousEllicott City, MD12/6/2018I made this exactly as written and they did not work at all.  I allowed 2 days chilling time.  The first pan I sliced 1/4\" thick, baked for about 20 minutes.  They spread all over the pan and overcooked, never crisped up.  The 2nd pan I sliced 1/8\" thick, checked them at 9 minutes and they looked exactly like the  thicker-sliced ones.  They don't taste terrible, but I sure would not serve them to anyone.\nAnonymousLouisville, KY12/5/2018Explore Bon AppétitCrackerCheddarCheeseEasySnackStarterVegetarianNew Year'sSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}