{"id": "8fb7ddf25963d1c46c33e0dae4b1cd8c", "url": "https://www.bonappetit.com/story/if-youre-not-putting-food-in-your-hair-are-you-really-living", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "If you're not putting food in your hair, are you really LIVING? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf You're Not Putting Food in Your Hair, Are You Really LIVING?Why you should be D.I.Y hair masking, and other opinions from Healthyish editor Amanda ShapiroBy Amanda ShapiroJuly 12, 2018FacebookTwitterEmailIllustration by Annalee SoskinFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.I'm feeling a little sub-healthyish today......thanks to that leftover Scarr's pizza I had for dinner last night, a pastry platter at Studio at the Freehand this morning, and a box of wagyu beef sliders that somehow ended up on my desk around lunch. At least my girl Rachelle Robinett has me drinking about a gallon of herbal infusion a day, so I'm gonna hope that balances things out.What I'm cooking:After an early-summer lull, I've been cooking again. I made Smitten Kitchen's  zucchini and ricotta galette and some garlic scape pesto, and tonight I'm tackling these grilled salmon steaks along with whatever's left of my CSA. I also pitted and froze a pound of cherries to use in smoothies. A cherry pitter would've been cool, but I kinda liked staining my fingers (and my shirt...and the counter...and my laptop...) with fresh fruit, am I right? Really makes it feel like summer, ya know?A  cherry pitter  would've been cool, but I kinda liked getting my hands dirty. It's not summer until you've stained your fingers (and shirt...and counter...and laptop...) with fresh fruit, am I right?What I'm seeing:My relationship with Instagram is, well, complicated, but recently I've been enjoying the hell out of a few new-to-me accounts:Cheeky, for illustrations like everywhere your body sweats on the NYC subway in summer and a defense of eating a hot dog AND a hamburger at the BBQ.Not All Geminis, thanks to Healthyish editorial assistant Aliza Abarbanel, which I mostly find deeply confusing but also, lol, it me.Next Big Thing with Courtney & Dara, which makes me laugh about politics when politics is mostly humorless. (NBT is also a YouTube show on which the two hosts chat with up-and-coming women of color in arts, culture, and tech.)Lastly, I gotta know:What's the weirdest edible ingredient you've ever put in your hair? If you're not D.I.Y. hair masking already, let this endorsement be your guide.Until next week,Amanda ShapiroHealthyish editorP.S. Healthyish Superpowered lands in Chicago NEXT WEEK! Our dinner honoring Ashley Novoa of the Chicago Period Project is sold out, but did you know we're also doing a HIIT workout with Outdoor Voices on Monday, July 16th? There's still space, so grab a spot if you want to work up a sweat with me and the Healthyish team.Explore Bon AppétitHealthyish NewsletterHealthyishessayRead MorecultureThis Is the Healthyish Way to Do SummerBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-12", "author": ["Condé Nast", "Amanda Shapiro"]}