{"id": "8fc4606a586d42b7bed0a5125f633f37", "url": "https://www.bonappetit.com/recipe/roasted-red-pepper-frittata", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Roasted Red Pepper Frittata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueRoasted Red Pepper FrittataBy Kelly MarianiJuly 9, 20194.1(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintA well-seasoned cast-iron pan is your friend here. If, despite your best efforts, the frittata sticks when you turn it out, just flip it back over so that any imperfections are hidden underneath. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients8 servings2medium red bell peppers1¼cups extra-virgin olive oil, plus more for drizzlingKosher salt1large onion, thinly sliced1½lb. German Butterball potatoes (about 6), peeled, sliced ¼\" thick8large eggsPreparationStep 1Preheat oven to 400°. Place bell peppers on a rimmed baking sheet, drizzle with oil, and turn to coat. Season with salt. Roast peppers, turning every 5 minutes, until softened and skins look wrinkly and lightly blistered, 20–25 minutes. Let cool slightly. Peel and remove seeds from bell peppers, then cut flesh into ½\"-thick slices. (You should have about 1 cup.)Step 2Meanwhile, toss together onion and potatoes in an 8\" cast-iron skillet; season with salt. Cover with 1¼ cups oil and set over medium heat. Bring to a gentle simmer, about 3 minutes, and cook, stirring occasionally with a wooden spoon and scraping the bottom of the pan to minimize sticking, reducing heat if needed, until there is no crunch left to the onion (do not let it take on any color) and the potatoes are tender, 25–30 minutes. Taste a piece of potato and onion to check. Some of the mixture may stick to the pan, and some of the potatoes may break into smaller pieces toward the end of cooking—both of these things are okay. Transfer to a medium bowl; let cool until warm, 8–10 minutes. Stir in roasted peppers.Step 3Clean skillet and place in oven to heat. Whisk eggs in a medium bowl until no streaks remain; season with salt. Using a slotted spoon or tongs, lift vegetables out of the oil and add to eggs (this is best done while they are still warm). Set onion-potato oil aside.Step 4Transfer skillet to stovetop and continue to heat over high until ripping hot, about 5 minutes. Add 3 Tbsp. reserved onion-potato oil to pan, then pour in egg mixture. Cook, using a heatproof rubber spatula or wooden spoon to pull egg mixture from the outer edges into the center, allowing uncooked egg to flow underneath and dragging the hotter, more-set egg from the edges into the center. This will help frittata cook evenly. Transfer skillet back to the oven and bake the frittata until browned and set, 10–14 minutes. Let frittata cool in pan 5–10 minutes, then invert onto a platter and cut into wedges to serve.Step 5Do Ahead: Bell peppers can be roasted 2 days ahead; cover and chill. Remove from refrigerator when you start prepping other ingredients so that they’re not fridge-cold when you combine them with the eggs.How would you rate Roasted Red Pepper Frittata?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleBe careful! This is a delicious recipe and I will make again, however, the part that instructs one to get the cast iron pan “rippin hot” is a dangerous endeavor, do not recommend. I have a high btu burner on my blue star stove, so I did not bother putting the pan in the 400 degree oven, I just heated it to “rippin hot” on the stovetop only, added back in a  few tablespoons of the excess oil from the cooked potato onion mixture as recipe states and flames rose up from the pan all the way up to the exhaust fan which is 30 inches! It smoked up the entire house and set off the smoke alarm. Thankfully the flames died down on their own after a few seconds. Of course when I then added in the eggs the edges of them burned in the pan. Maybe the recipe should say very hot pan instead of “rippin” hot. Just sayin. This was a little too much excitement for us on Christmas morning. Joyce H Rochester,NY12/28/2021This is a Spanish tortilla, not a frittata. Notafrittata Raleigh, NC3/1/2021I would recommend being careful with this recipe, after transferring the pan from the oven to the stove it got way too hot and I started a minor kitchen fire. I would also recommend a few less potatoes and sausage to add a little something extra.Anonymous12/11/2020Loved how meltingly tender and delicious the potatoes were by slow cooking in all that oil.  The potato part took much longer than the recipe stated though, at about an hour in the pan.  But maybe I was overly concerned about sticking and so had the mix on a lower temperature and spent far too much time stirring and scraping the bottom.  In the end it was a nice meal.  My guy who hates peppers didn't even realize he was eating them!  Next time I'd add sweet sausage to give it some punch.  I'm also curious about par-cooking the potatoes to speed up cooking time.AnonymousLos Angeles, CA6/16/2020I steamed the potatoes whole in an Instant Pot until they were cooked but not falling apart. They sliced up thinly. I sauted them with the onions. I used about 1/2 cup oil total. In this way the dish comes together more quickly and with less oil (I can't afford to make this with so much oil). It was great this way! Great recipe if you try these alternatives. Would be good with goats cheese thrown in just after Incorporated on the stove.small w0nderPhoenix, AZ9/3/2019I don't understand the need for all the oil . . . It came out disgustingly oily. Also this was way more potatoes and onions than could fit in my 9\" cast iron skillet.AnonymousAlaska8/19/2019any good swap for if I don't own a cast iron?!Anonymous8/16/201910/10 will make this again. It transports well, serves easily, and is totally satisfying. Even though I have an electric stove (gasp) and had to use a stainless-steal/ovenproof skillet, it still came out perfect. I saved the leftover potato-onion oil for future cooking! ericabillySan Francisco, CA8/13/2019Really gorgeous recipe, though it's somewhat more time-consuming than anticipated -- also a lot of oil! That's what makes it healthy-ish, I guess. Otherwise I love how light and simple this is. I used a mix of rainbow potatoes that gave the top a great mix of color with purple/red/yellow. Nate GLos Angeles, CA8/9/2019Explore Bon AppétitFrittataItalianEuropeanBell PepperVegetablePotatoEggQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeVegetarianHealthyishBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}