{"id": "8fcc92c9a26cea22ef66c2fbb16eae62", "url": "https://www.bonappetit.com/story/fruit-sando-forever", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "A Fruit Sando Is a Dessert Sandwich Filled with Joy and Whipped Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Fruit Sando Is a Dessert Sandwich Filled with Joy and Whipped CreamI’m obsessed with this Japanese dessert and was dying for a recipe. Now we have one.By Elyse InamineJuly 19, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHi, my name is Elyse and I have a fruit sando problem. Whenever I see those tiny triangles layered with sliced strawberries, nubs of kiwi, and Cool Whip-esque fluff, which is more often than you’d expect, I always order it. The fruit sando is exactly what you think it is. A sandwich made of fruit, with a Japanese accent. (Technically, it’s called “furutsu sando,” but I like “fruit sando,” as a third-gen Japanese American. Both Japanese and American!).Imagine those delicate little sandwiches at bridal showers, tea parties, etc. Then imagine Takashi Murakami made them. That’s the fruit sando. Its edges are a work of art, a mosaic of jewel-like cuts of fruit that are outlined by barely sweet whipped cream. Soft shokupan, a simple bread made of flour, warm milk, and eggs also known as Japanese milk bread, holds the fruit sando together. Each bite is sweet, squishy, and immensely satisfying.At Sandwich House Tres in Seattle, there’s an all-strawberry sando that I took 10 pictures of before eating it with beaming pleasure, like it was my birthday cake. At Davelle in New York City, the strawberry-kiwi-peach trifecta is only offered in a limited run after its arrival is announced on Instagram (I keep tabs). At any 7-Eleven in Japan, I can close my eyes and point, and I’ll find the most adorably packaged fruit sando that tastes just as good as food in anime looks.So I pushed and pushed for a recipe, and senior associate food editor Molly Baz delivered.It’s a lot easier to achieve sandwich edge mosaics than you think.\nPhoto by Alex LauThe fruit sando is a caricature of a dessert you’d dream up as a kid, when your world goes round based on what you like and know. You love squirt guns and air conditioning, so the shoot-out with your brother goes indoors to the living room. You dig dad’s impressive mustache, so you color in one above your upper lip with mom’s inky eyeliner. You get the method behind the childhood madness: putting two things you like together and enjoying your best life despite the consequences. (FYI, it’s pretty difficult to remove eyeliner from your upper lip.)That’s what I love about the fruit sando: its ability to transform mundane pleasures, ingredients you’d find at any grocery store, into something strange and almost nostalgically tasty, even if you’ve never had it before. It has all the star qualities of  cake—spongy layers of carbs, hunks of cold fruit, tons of sweet cream—but in an aesthetically pleasing (and portable) sandwich form.Go overboard and even try whipping the cream by hand! Or maybe don’t. Bust out your Gyuto and get ready to really sharpen your knife skills, neatly slicing shokupan and chopping up whatever fruit you have on hand. Follow Molly’s lead for your own mosaic edges: Place a coin of  kiwi in the center of the whipped cream-swiped milk bread, draw a diamond around it with thick matchsticks of peaches, and then finish it off by putting halved strawberries at each corner. Crown your work with another slice of bread, cut into four triangles, and amaze yourself with this paper snowflake process.Soon you’ll have a fruit sando problem too. And that’s not the worst thing in the world.Get the recipe:Fruit SandwichesAKA fruit sandos, the delightfully squishy Japanese dessert we can’t get enough of.View RecipeGot more strawberries? Turn them into shortcakesExplore Bon AppétitFruitDessertTea SandwichRead MorecookingThis Is Our Chillest Icebox Cake EVERBy Alex BeggsrestaurantsThe Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office LobbyBy Elyse InaminecultureThis Incredible Strawberry Jam Is Made with Rare, Extremely Tiny StrawberriesBy Zahra Pettican Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-19", "author": ["Condé Nast", "Elyse Inamine"]}