{"id": "8fd84be94f668ac9336146c5ee7b15ca", "url": "https://www.bonappetit.com/story/messermeister-kawashima-utility-knife", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "This One Knife Has Replaced Almost All the Other Cutlery in My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis One Knife Has Replaced Almost All the Other Cutlery in My KitchenUseful and multipurpose, the Messermeister Kawashima utility knife perfectly lives up to its name.By Amanda ShapiroJuly 22, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.“Useful, especially through being able to perform several functions” is how the dictionary defines “utility.” Ever since my first grown-up kitchen, I’ve been wedded to the same standard 8-inch chef’s knife, plus a rotating case of paring knives. But since the Messermeister Kawashima 6-inch utility knife entered my life a few months ago, it’s been pretty much glued to my hand.Photo by Emma FishmanMessermeister Kawashima 6-Inch Utility Knife$180 at Amazon$180 at MessermeisterThe Messermeister Kawashima utility knife perfectly epitomizes its name. It’s shorter and nimbler than a chef’s knife but more robust than a paring knife, so it makes quick work of breakfast fruits like kiwis, mangos, and avocados. But it can also handle larger produce like melons, sweet potatoes, and pineapples with beauty and grace, and the curved handle and slightly angled blade allow for that see-saw motion you want for dicing onions and chopping piles of fresh herbs.It’s also scarily sharp. According to Messermeister, the Kawashima knives have the sharpest blades they’ve ever produced, made from powdered steel by third-generation knife artisans in Seki, the knife-producing capital of Japan. They’re designed by and named for Shoichi Kawashima, an iconic Japanese bladesmith. I will say that the first time I used it to slice raw chicken thighs for a stir-fry, I gasped at how seamlessly the blade went through.I’ve been at BA long enough to know that when it comes to kitchen cutlery there are only three types of knives you really need to buy. But I’ve also learned that knives are intensely personal. Maybe your perfect knife is a cleaver or a petty knife. As for me, I’m not doing away with my 8-inch chef’s knife (a Messermeister Meridian Elite in case you’re curious) any time soon. I need it for the big jobs like carving whole chickens and halving butternut squash. And there are still tomatoes to contend with: small serrated knife, I’m looking at you. But this utility knife can do pretty much everything else. Now I just have to figure out how to keep it sharp.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-22", "author": ["Condé Nast", "Amanda Shapiro"]}