{"id": "8ff7f54f3e255a600552ddadd83e5e99", "url": "https://www.bonappetit.com/recipe/skirt-steak-with-scallion-thecha", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Skirt Steak With Scallion Thecha Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueSkirt Steak With Scallion ThechaBy Rachel GurjarMarch 15, 20224.3(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Dayna Seman.EmailPinterestPrintEmailPinterestPrintSpicy, garlicky thecha is a green-chile-based condiment that hails from Maharashtra in western India. Associate food editor Rachel Gurjar loves using it to complement seared skirt steak, as well as chicken, eggplant, cauliflower, or any other ingredient that longs for massive flavor. Serve the steak with rice, roasted potatoes, or a salad for a full meal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonInstant-Read Thermometer$35 At ThermoworksCast Iron Skillet$30 At AmazonSmall Skillet$40 At AmazonTongs$13 At AmazonIngredients4 servings1small bunch cilantro, tough stems removed, leaves and tender stems coarsely chopped4scallions, coarsely chopped3green Thai or serrano chiles4garlic cloves1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more⅓cup vegetable oil, plus more for steak1tsp. cumin seeds¼cup salted or unsalted roasted peanuts, crushed1½lb. ½”-thick skirt steak, cut into 5”-long piecesFlaky sea saltPreparationStep 1Pulse cilantro, scallions, chiles, garlic, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in a food processor (a mini processor works well here) until a coarse paste forms. Transfer to a small heatproof bowl.Step 2Heat ⅓ cup oil in a small skillet over medium-high. Cook cumin until fragrant, about 10 seconds. Transfer to bowl with paste; add peanuts and mix well. Set scallion thecha aside for serving.Step 3Pat steaks dry with paper towels and season on both sides with kosher salt. Rub a little oil over steaks to coat lightly.Step 4Heat a large cast-iron skillet over medium-high. Add half of the steak, arranging in a single layer, and cook, undisturbed, until a golden brown crust forms, 2–3 minutes. Turn steak over and cook until second side forms a golden brown crust, 2–3 minutes. (Steak should be thin enough that once it’s seared it will be cooked to medium-rare—about 125° on an instant-read thermometer. If you have a very hot pan, this will happen quickly.) Transfer steak to a cutting board and repeat process with remaining steak. Let rest 10 minutes.Step 5Slice steak against the grain and arrange on a platter. Top with reserved scallion thecha and sprinkle with sea salt.How would you rate Skirt Steak With Scallion Thecha?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleTHIS is what I've always wanted Chimichurri to be.  The oil infused with the cumin seeds is the secret ingredient for me.  I can't wait to put this Thecha on more things.  If you are allergic to peanuts, I don't think that they add much more than texture, so leave them out and don't miss out on the rest that this has to offer.Tom Scanlon3/26/2022Rachel, how lovely to put thecha on the global table. In Mumbai, I use it to marinade fresh mackerel, packed into slits along the sides and pan fried in coconut oil. Also great to dip fried prawns into...Leena Mumbai 3/19/2022Diamond crystal has half the sodium,so if using another brand of kosher sch as Morton than reduce by half; same goes for regular or sea salt.AnonymousPhx Arizona 3/19/2022Diamond crystal?Anonymous115663/19/2022Explore Bon AppétitDinnerMainEasyQuickWeeknight MealsGluten-FreeDairy-FreeSearSteakBeefMeatScallionOnionVegetableSerrano ChileChileCilantroHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rachel Gurjar"]}