{"id": "8ffa8a06dbea9b397a67cab6c7f699df", "url": "https://www.bonappetit.com/story/lloyds-carrot-cake", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Forget Fancy Frosting or Fondant, I Just Want Lloyd’s Carrot Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureForget Fancy Frosting or Fondant, I Just Want Lloyd’s Carrot CakeCream cheese frosting and one perfect, carrot-y layer is all I need.By Gaby ScelzoDecember 3, 2020FacebookTwitterEmailPhoto courtesy GoldbellyFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Despite watching me whisk, scoop, and frost dozens of brownies, cookies, and cakes throughout our relationship, my boyfriend still does not know anything about baking. So I was pleasantly surprised when he presented me with an almost-perfect birthday cake this year. His one slipup? Not knowing to frost in between the two layers of cake. (I know.)But while we cut pieces of tall, fluffy cake, the unintentionally single-layered slices reminded me of an intentionally legendary single-layer cake: the carrot cake at Lloyd’s in New York. It has a light (early-winter-appropriate) jacket of just-sweet-enough cream cheese frosting and one thick layer of soft, spicy carrot cake.And even though the cakes at Lloyd’s taste luxurious, you’d never know from their low-key looks. The carrot cake isn’t fussy or fancy—it’s the type of dessert you could serve (pre-pandemic) with a pile of forks, no plates, and the instructions, “Just dig in.” It looks the way a homemade one might but lives up to the words printed on each box: “The world’s finest carrot cake.”Betty Campbell-Adams has been running the 35-year-old family business since her husband Lloyd passed away in 2007. Framed photos of her husband and decades of press clippings praising his cakes hang from the tiny bakery’s bright orange walls. I’ve watched the staff finish frosting a cake seconds before running to the register to check out a runner grabbing a snack or a parent picking up a birthday cake. The energy in Lloyd’s feels both magical and human in a way so many places don’t.Every time I visit the East Harlem location (there’s also another in Riverdale), I spot the pile of clear containers filled with single slices of cake, and my eyes immediately dart from the bright red velvet to the gooey German chocolate, until they land on a perfect slice of burnt orange carrot cake.Once it’s mine I’ll pop open the plastic box and let the smell of sugary, spicy carrots and sweet, cheesy frosting flood my body. Every buttery bite of soft, crumby cake is studded with walnuts and raisins, and though they do sell a version without them, I’ll forever and always be team walnut-raisin. And if you can’t make it to the bakery for a slice, you can still have a whole cake shipped via Goldbelly.For my next birthday, I’ll be requesting an 8-inch walnut and raisin carrot cake from Lloyd’s, and hope it’s still slightly warm, the way they so often are. It will be my second year celebrating with a single-layer cake, though this time that detail will be intentional.Lloyd's Famous Carrot Cake$69 at GoldbellyExplore Bon AppétitHighly RecommendNew York CityRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-03", "author": ["Condé Nast"]}