{"id": "8ffdb6401c53d284e042c415b71f4872", "url": "https://www.bonappetit.com/story/homemade-hoisin-sauce-never-fail", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Homemade Hoisin Sauce Is the King of Condiments | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHomemade Hoisin Sauce Is the King of CondimentsWith apologies to mayo, ketchup, and Sriracha.By Christina ChaeyFebruary 12, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the homemade hoisin sauce recipe associate editor Christina Chaey makes in triple-batches and puts on everything.When I quit my job (at this very magazine!) a year ago to learn how to cook professionally, hoisin sauce was one of the first things I learned how to make well. It was a task of necessity—I worked at a restaurant where we’d go through quarts of the salty-sweet condiment in a week to glaze duck meatloaf. So every few days, I would simmer a mixture of miso, maple syrup, chile flakes, spices, and tons of garlic until it was all intoxicatingly fragrant, then blend it until it was smooth and glossy brown.I've since returned to life in a cubicle, which means the only cooking I worry about these days is what I’m going to make for lunch. I usually mix and match some beans or lentils, veg, grains, and whatever protein I have leftover from dinner, but I don't ever feel truly excited about eating any of it unless it's cloaked in a lively sauce. Like this flavor-bomb homemade hoisin sauce, a sneaky recipe-within-a-recipe hidden in the liner notes of this glazey pork chop dish.Frankly, you have no excuse not to make homemade hoisin sauce. It takes 10 minutes from start to finish, and requires just 6 ingredients (and you probably already have most of them): garlic, soy sauce, honey (I use maple syrup just because it's what I have around), distilled white vinegar, tahini, and Sriracha. The key step here is to really sizzle the garlic until it's the color of toffee, but not burnt; that flavor will anchor your whole sauce. Once your garlic's nice and browned, whisk in the rest of the ingredients and cook the mixture until it's bubbly, thick, and smooth. Hit it with some salt and fresh black pepper, and add a splash of water depending on how thick you want it (it'll get thicker as it cools). The end result is downright addictive: the bass note from the nutty tahini mingles with that sweetness, with a kick of heat from the Sriracha and a welcome brightness from the white vinegar. It's like the stuff you can buy in a bottle from the store—but better, because you made it.Serve this moo-shu pork inspired hot-sausage and cabbage stir-fry with plenty of hoisin.\nAlex LauNow, I have nothing against a store-bought bottle (Lee Kum Kee is the brand you want, always). But if you're like me, you will never, ever remember to grab one when you're at the store—plus the side of my fridge is so overrun with pickled vegetables and fancy mayos and like 4 cartons of almond milk that there's physically no room for yet another condiment.The best part of this recipe is it's just as easy to make a triple-batch as it is to make one. So do it! It's freeing and empowering to know you're coming home to a jarful of hoisin in the fridge, just waiting to jazz up a simple bowl of rice or some garlicky sautéed greens. It can make a platter of steamed vegetables feel downright indulgent. It makes a beautiful glaze for roast salmon or broiled chicken wings, and is shockingly good on a hot dog. And it's especially delicious with pork, either as a marinade or a stir-fry sauce (see this One-Skillet Hot Sausage and Cabbage Stir-Fry with Chives, another brilliant Claire Saffitz original inspired by her undying love of moo-shu pork.)I no longer go through quarts of hoisin a week the way I did in my restaurant days. (After all, I'm just one person and that would be obscene). But now, every time I make a batch at home, it feels like a small gift to myself, knowing I have many very good meals in my future. And you're damn right I eat every last spoonful.Get the recipe:Hoisin-Glazed Pork ChopsBecause you need more pork and homemade hoisin sauce in your life.View RecipeExplore Bon AppétitHoisin SauceNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Christina Chaey"]}