{"id": "9007061e8504da91ce678d5d17fa1a7c", "url": "https://www.bonappetit.com/story/short-ribs-technique-braise", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "There Are No Shortcuts for Short Ribs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere Are No Shortcuts for Short RibsBraised short ribs are worth every minute. Here’s editor in chief Adam Rapoport’s guide to making them.By Adam RapoportDecember 4, 2018FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Short ribs are worth every minuteThere’s this moment when you’re making short ribs—before you’ve braised them but after you’ve browned them—when your house smells like a short-order burger joint and it takes all your willpower to not just stand there and pick at all the crispy nubbins.But be patient. Time changes everything.Want this letter before it hits the website? Sign up for our newsletter!After three hours in a Dutch oven, burbling with wine and stock and chopped-up vegetables, the short ribs transform themselves into something magical. They are why we have clichés like fork-tender and fall-off-the-bone.At least that’s what I kept telling myself this past Saturday, one of those cold, damp, dreary afternoons, when the sun disappears at 4:30pm and you’re like, Well, what do I do now?You cook.I bought a few pounds of bone-in ribs and a quart of chicken stock from Dickson’s Farmstand Meats. I grabbed some onions and carrots and garlic from a nearby market and biked home and got to it.These short ribs are slow-roasted in coconut milk.\nAs evidenced by all the short rib recipes on our site, there are plenty of paths to follow. You can go with ginger and soy, or citrus and chile, or—who knew!—coconut milk and lemongrass (pictured above). Or, if you’re like me and just want to keep it old-school, half a bottle of red wine.Regardless of which flavor profile you choose, just do as our essential Basically braising guide instructs, and remember these key steps:These are my seared short ribs before going into the wine and stock mixture.\nPhoto by Adam Rapoport1. In a heavy-bottomed pot, brown the well-salted meat over medium heat and then set aside.\n2. In the same pot, cook down a bunch of vegetables in the remaining fat.3. When the veg is nicely caramelized (you might have to add a splash of water to deglaze the crispy hits on the pan), nestle the meat back in the pot among the veg.4. Pour In a mix of stock and wine. I had a half-finished bottle of red on the counter so I used that. I also had some leftover ramen stock from takeout a few nights prior, so I added that, as well.5. Slide the covered pot into the oven for about 3 hours, after which the short ribs are done. But as the Basically guide illustrates, there’s this extra-credit thing you can do where you strain the braising liquid and then reduce it over medium-high heat till it gets all glossy and syrupy, and I highly recommend this.Ultimately, your house will be the best-smelling place on the block (more restaurant than diner, at this point) and you will be very, very proud of yourself. And you deserve to be. You turned a cold, dark, dreary afternoon into something truly magical.Molly StevensGet the recipes:Red Wine-Braised Short RibsSoy-Braised Short Ribs with ShiitakesCitrus-and-Chile-Braised Short RibsShort Ribs Slow-Roasted in Coconut MilkExplore Bon AppétitAdam NewsletterShort RibBraiseRead MorecookingBraise On! How to Transform Tough Cuts of Meat into a Feast, No Recipe RequiredBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-04", "author": ["Condé Nast", "Adam Rapoport"]}