{"id": "901e4f1cc950a2563c003911833e611f", "url": "https://www.bonappetit.com/story/end-of-independent-restaurant-era-edward-lee", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "I’m Afraid It's Too Late to Save Restaurants | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI’m Afraid It’s Too Late to Save RestaurantsChef Edward Lee on why this could be the end of an era for independent restaurants.By Edward Lee, as told to Ashlea HalpernDecember 4, 2020FacebookTwitterEmailEmpty tables stand at a covered outdoor area at a cafe in Brooklyn. With coronavirus cases on the rise again in New York, the city is tightening restrictions on restaurants.Photo by Spencer Platt / Getty ImagesFacebookTwitterEmailWhen Louisville chef Edward Lee was forced to close the doors to his restaurants—610 Magnolia, MilkWood, and Whiskey Dry in Louisville, Kentucky, as well as Succotash in Washington. D.C.—due to Coronavirus, he shifted his focus to helping restaurant workers in need. His small nonprofit, The LEE Initiative, launched the Restaurant Workers Relief Program, serving more than a million meals to industry employees across the country who lost their jobs or had a significant reduction in hours due to the pandemic. The nonprofit has also invested more than $800,000 in small sustainable farms among other initiatives. We talked to him about the struggles the industry faces right now, and what it’s like to run a thriving nonprofit as your own businesses falter. “This is the end of the independent restaurant era, and I don’t know any chef in their right mind who feels hopeful right now. We have meal kits; we’re getting tents and heaters. But at the end of the day, I’m on the Titanic, trying to throw out buckets of water to stay afloat. I’m fighting to save my restaurants and chefs and farmers whom we’ve had relationships with for decades. But part of me is very pragmatic. We’re not getting a bailout from the federal government and we’re not getting leadership—state, federal, even local. We’ve been left to our own devices.The options for restaurants right now are to go further into debt or to close. If we make 80 percent of our income now, that’s a great day. It’s like a Saturday night with all the tables booked. But then there are days when we’ve done 15 percent of our normal revenue. Those are days where it’s actually cheaper for me to keep the lights off and close the doors.It’s the fluctuations that really hurt us. We rely on patterns and predictability for inventory, for staffing, for everything. Now we don’t have a clue. Some of it is COVID-related; some of it is related to the protests; and some of it related to consumer fears about eating out at restaurants. Sometimes it’s just a viral article on Facebook that affects consumer confidence. 610 Magnolia has weathered recessions. Revenue-wise, last year was our best year ever. And we were on pace to beat that in 2020. There’s cold comfort in knowing an entire wave of restaurants will have to close.Chef and restauranteur Edward Lee.\nPhoto by Jolea BrownI devote most of my time now to my nonprofit, The LEE Initiative and the Restaurant Workers Relief Program; it’s the only thing keeping me focused, hopeful, and proud. It’s very odd to have one sector of my life be incredibly successful: We’ve served over a million meals to date and opened more than 30 relief kitchens around the country. Yet I’m seeing the other sector of my life crumble before my eyes. It’s an emotional roller coaster—like watching one of your children soar while the other dies in your arms. I feel great sometimes. Then I feel guilty about feeling great. It’s hard to navigate.We’re trying our best to keep everyone hopeful, but at the end of the day, it feels like piling sandbags against the tsunami. For every effort we do, it just doesn’t stand a chance against the economic backdrop of what restaurants are going to face this winter. And what we’re seeing now is people who are basically considered middle class—who’ve worked their whole lives and never been on welfare—are suddenly food insecure. That is a whole new demographic that didn’t exist before. Some are too proud, or too ashamed, to admit that they’re food insecure. These are people I know: bartenders, waiters, dishwashers, line cooks. Unfortunately for restaurant people, our skill set doesn’t translate well to other industries. We’re hyper-focused on one thing: hospitality. And when the industry crumbles, you have an entire population of people not equipped to do other jobs. I’ve devoted 29 years of my life to this; I can’t just go sell neckties or insurance. Yet the people in power don’t see that. They don’t see restaurant workers as a valuable sector of our society. Their attitudes are, ‘Well, they can go find other jobs.’ That’s just not the case.We’re trying our best to keep everyone hopeful, but at the end of the day, it feels like piling sandbags against the tsunami. There’s a huge feeling of abandonment. You devote your life to the restaurant business, you pay your taxes, and then you realize there’s no help coming from anywhere. People are suffering through a deep, deep depression. And the last thing you want in the restaurant business is for your restaurant owner, chef, GM, or waiter to be depressed, right? The whole point of the hospitality industry is for you to come to my restaurant and forget about your depression. We’re the ones who supply the entertainment; our positive energy is contagious. It makes you feel great to be in a restaurant full of people who execute their jobs with passion and joy.We’re not professional actors. Everyone’s on the edge of emotional breakdown. It’s heartbreaking to watch dedicated young men and women who’ve honed a craft and made this beautiful thing we call ‘the restaurant renaissance,’ which brought pride and global attention to ‘American cuisine’ and two decades ago didn’t even exist, you know…making $8 cheeseburgers to-go just to make payroll.But that’s where we’re at. Yet you drive by the local McDonald’s and there are 20 cars lined up for drive-through. It breaks your heart to see that, and to know that by the time all of the independent restaurants go away, it’ll be too late. The customers will say, ‘What a shame.’ The chance to save them is right now.Old-timers like me can’t pivot; I am stuck in what I’m doing. But there are a lot of diverse younger people—so many Black and Latino and Indian chefs who are just starting out—saying, ‘Wait a second, maybe this isn’t the career for me.’ They have the creative energy and the verve and the youthful exuberance that the restaurant industry needs. If we lose them, I don’t see an industry that has anything to offer.The shell of the restaurant may survive, but the beautiful energy inside may not. If the people are not there, or the people are depressed because they feel like no one cared about them during the pandemic, they’re not going to bring the same passion and energy and joy to it when they come back. It’s just a job—no difference between that and working at a chain restaurant. That, to me, will represent the end of the independent restaurant. We’ll see. I desperately hope I’m wrong.”We’ve been following how the restaurant industry has been coping with the Coronavirus throughout the year. For more reflections from the people on the inside, read our Restaurant Diaries series. Explore Bon AppétitCoronavirusChefsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-04", "author": ["Condé Nast", "Edward Lee", "As Told To Ashlea Halpern"]}