{"id": "902dbf06e777a0365ce3ff7ada8c04cc", "url": "https://www.bonappetit.com/story/vitamin-d-foods", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Vitamin D Foods Will Help Your Body This Winter. Here’s What to Eat to Get It. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYour Body Needs Vitamin D This Winter. Here’s What to Eat to Get It.Not everyone can book that warm weather getaway. This is the next best thing.By Brierley HortonDecember 14, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailAs a nutritionist, I’ve doled out the advice that a supplement can sometimes be a good health insurance policy. But, when it comes to vitamin D, I’m not in the “practice what you preach” camp, though, believe me, I’ve tried (I couldn’t even choke down a prenatal vitamin when I was pregnant, though I could manage a kids’ chewable Flintstone).So you can imagine that I breathed a small sigh of relief when the recent study on vitamin D supplements hit. The review study (in this particular case, a review and meta-analysis of previous studies) looked at vitamin-D-supplement-taking habits in adults and how that impacted bone fractures, falls, and natural, age-related bone loss. (Remember, that combo of vitamin D and calcium is what’s supposed to keep your bones strong.) And the study findings were a bit unexpected: Adults who take vitamin D supplements don’t have fewer bone fractures or falls or better bone-mineral density. The researchers also looked at supplement doses and, turns out, how much vitamin D those adults took was irrelevant—their bones weren’t any stronger.But with two degrees in nutrition under my belt, I know that D’s importance goes beyond bone health. We want to keep our vitamin D levels up because it can lower our risk for autoimmune diseases like multiple sclerosis, Type 1 diabetes, IBD, and Crohn’s. There’s other research that shows that being low in vitamin D raises your risk for high blood pressure and heart attack and is associated with higher rates of depression, Schizophrenia, and Alzheimer’s. And one of the most interesting findings I recently stumbled upon is that women who are vitamin D deficient up their risk of having to have a C-section by 400 percent!So if you’re skeptical of supplements (or just bad at remembering to take them), how else can you up your vitamin D intake?First of all, the amount of vitamin D we need is the source of some debate, but most experts agree on one thing: We’re not getting enough. So instead of splitting hairs on quantity, you should focus on quality. Always, getting vitamin D from the sun is the gold standard. Studies have found that the D you get from the sun lasts longer in your system than the D you get from food or supplements—plus your body can use 100 percent of it, whereas 40 percent of what you ingest is basically ferried right through your body. But that’s not always possible, especially in winter when the days are shorter and we’re getting less sun.So my advice (and this I always practice!) is to eat your vitamin D. The best vitamin D food sources are oily fish and cod liver oil (a win-win because they’re also great sources of brain- and heart-healthy omega-3s). A tablespoon of cod liver oil delivers 1,360 IUs. A 3-ounce, fist-sized portion of swordfish or salmon will get you about 500 IUs. Another natural source of D is eggs: a large one has 41 IUs. And then there are mushrooms, which naturally contain vitamin D (maitakes are the richest with 943 IU in about a cup), and, if they’re exposed to UV light, make even more vitamin D. For example, expose creminis to sunlight or a sunlamp, and a cup of them delivers over 1000 IUs!So-called fortified foods are how most of us probably get dietary D. A cup of milk or yogurt fortified with vitamin D adds 100 IUs, more or less. For foods like orange juice, cereal, soy and other plant-based milks, the amounts vary product to product so you’ll want to check the nutrition label.So if you can’t book that warm weather getaway (hey, doc, can I get a Rx for that?), swing by the grocery store and stock up on vitamin D-rich foods. You’re basically giving your body a beach vacation without leaving the house.Up your vitamin D:Brothy Beans and Farro with Eggs and MushroomsStirring a raw egg yolk into each bowl at the end adds silkiness, heft, and protein.View RecipeExplore Bon AppétitHealthyishWinteressayRead MoreLifestyleWhich Daily Vitamin Subscription is Right For You?Gallery3 SlidesBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Brierley Horton"]}