{"id": "904785b83b5895ee2d8d454927e615fb", "url": "https://www.bonappetit.com/story/lombardinos-madison", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Only Consistent Thing About Lombardino’s Restaurant Is Its Ever-Broken Fountain | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Only Consistent Thing About Lombardino’s Is Its Ever-Broken FountainMay this mini Trevi Fountain in Madison, Wisconsin, never change.By Madeleine DaviesApril 16, 2019FacebookTwitterEmailSunny FrantzFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.It’s remarkably dark inside Lombardino’s Restaurant in Madison, Wisconsin, but give your eyes a few minutes to adjust and they’ll soon settle on the restaurant’s most prized possession: a full-on replica of Rome’s Trevi Fountain—water feature, loose change, Oceanus’ scarf-censored loins and all.Brought over from Italy when Matteo Lombardino (himself an import from Sicily) opened his restaurant in the 1950s, the three-foot-wide ceramic fountain is a masterpiece at 1/25th scale—a ratio that also reflects the number of days it’s actually functioned.“I’m pretty sure it has broken every two weeks since Lombardino first installed it,” says Michael Banas, who currently co-owns the restaurant with chef Patrick O’Halloran. “We have regulars who’ve been coming since the ’50s and they tell us that it’s been leaking since day one.”That hasn’t stopped generations of Madisonians from tossing in their coins, unconcerned about the fate of wishes thrown into a wonky fountain. It says a lot about our salt-of-the-earth, glass-half-full optimism—even when the glass is a fountain, and the fountain is completely empty.The restaurant’s mustachioed greeter invites guests to come as they are.\nPhoto by Sunny FrantzIt also says a lot about us that, even as the kitchen’s competency has wavered about as consistently as the mini Fontana di Trevi’s, the restaurant has always been the city’s favorite spot to celebrate. It’s where my grandparents had their dates, free from the kids for one night, and the site of many birthdays, graduation dinners, and fetes on down our family tree. It doesn’t really matter that the food’s having a real moment under the current chef, or if the classic red sauce menu—chicken diavola, tiramisù—has evolved to include nduja salami, berbere spices, and local pea shoots and mushrooms. At its core, nothing really changes.“It’s somehow dated and timeless at the same time,” Banas says of the restaurant. “It’s dark and full of things from all the previous owners. The fountain leaks and drives me insane. I don’t know why Lombardino put it there, but I can never get rid of it. It’s all a part of the DNA.”Madeleine Davies is a writer living in New York.Explore Bon AppétitRestaurantsItalian AmericanRed SauceWisconsinRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Madeleine Davies"]}