{"id": "90475517455d3c28e9c23de359736b61", "url": "https://www.bonappetit.com/story/chef-fatima-foundation", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "My Sister Chef Fatima Broke Boundaries. Here’s How I’m Continuing Her Fight. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Sister, Chef Fatima, Broke Boundaries. Here’s How I’m Continuing Her Fight“When it came to food—and life—no one was braver than my sister.”By Mohammad AliJanuary 25, 2021FacebookTwitterEmailPatrick Randak/thelicensingproject.comFacebookTwitterEmailWhen my father came to visit my sister, Fatima, and me in Karachi one summer, he took us to the only Japanese restaurant in town and asked us if we wanted to try something called sushi. When he told us what it was, I recoiled in disgust. Raw fish? Had he lost his mind? As an 11-year-old, all I associated with fish in those days was the overcooked, slightly stinky river fish we used to eat occasionally in Lahore. That fish was always riddled with a million bones, the thinnest bones known to man, designed to defeat my small, searching fingers, and always somehow there to sabotage each bite. So, fish? No thank you.When the sashimi came, it lay untouched for a few minutes as we stared at the suspicious rectangular jewels. Fatima, then six, looked at me and said, “I’m going to do it.”I stared as she picked up a piece with her fingers and popped it into her mouth. As if it were the most normal thing in the world. She closed her eyes, rolling the ruby red tuna around, taking it in. Her eyes closed and she chewed slowly. Clearly, she liked it. I only took the plunge after getting several reassuring nods from her.Mohammad with his sister, chef Fatima Ali\nWhen it came to food, no one was braver than my sister—and when it came to life, no one had to be braver than her either.She had just wrapped up season 15 of Top Chef when she was diagnosed with Ewing sarcoma, a particularly mean-spirited cancer of the soft tissue and bone. When the episodes were airing, Fatima was watching from a hospital bed, being pumped full of medicine that always seemed to make her feel worse. The cancer left for a while. Then it came back with cruel and unrelenting speed.On  January 25, 2019, Fatima, or as we all know her, Chef Fati, took her leave, with us by her side. She was 29, and she did not want to say goodbye.I heard from many people after the news hit the headlines. They said, “Time is a healer,” and “It will get easier.” It is not getting easier.I remember once when we were working with Fatima's doctors to get the right mix of pain medicine for her, her specialist told me that sometimes younger people who are terminal feel physical pain that can’t be medically explained or treated. Some doctors believe that it’s a manifestation of the anguish of knowing you have so much life to live but that you can’t. And, for Fatima, despite striking off so many things from her bucket list (appearing on The Ellen Degeneres Show, becoming the first Pakistani woman to win Chopped or compete on Top Chef,               inspiring people around the world, and posthumously winning a James Beard award), in the end what she wanted the most was to live.She got so much from the world. She knew how to coax the most out of a flavor, an ingredient, an experience, an opportunity. Even if Fatima had lived to be a 100, time would not have been wasted on her. I never understood where she got that energy from, but if I had to guess, I’d say it was because of how sure she was. Even when she was half my size, Fatima never flinched before copying my moves. Climb a crooked and gnarled tree? She’s there. Balance on top of a 12-foot wall? She’s there. Try to dunk a basketball in a miniature hoop? She’s there (nearly). She was always on some sort of mission. Or perhaps Fatima wasn’t such a superhuman, maybe she had all of the doubts, fears, and insecurities we all have, but they were not important enough to stop her from doing what she wanted.As a cook, she seasoned with such confidence I was sure it would ruin the dish, taking the salt to the edge, allowing every little nuance of flavor to show up, browning and caramelizing a little longer, pushing just a bit further. Fatima was hosting a barbeque some years ago now in Lahore where we were born and asked me to make her a chimichurri sauce. I tossed the parsley, garlic, chiles, lemon zest, olive oil, and vinegar into the mortar and pestle. Fatima glanced at it and said to add more olive oil and vinegar. I drizzled some in, hesitating. She came back and said to keep churning in more olive oil and vinegar. I still couldn’t trust it. When she looked again, she sighed and said, “Dude, MORE OLIVE OIL AND VINEGAR!” And sure enough, the chimichurri became exactly what it needed to be.Grief makes it harder to think of what you need. There is no emotional equivalent to salt, fat, or acid. No one has figured out the ingredients you need to take something as terrible as what happened to Fatima and make something good out of it.Once the absurd reality of her terminal illness set in, Fatima and I would have very open conversations about what would happen “after.” I would ask her what she hoped her legacy would include and how, if at all, I could try to achieve some of the things she would have if she had more time. She told me how she wanted to inspire and encourage other young women in Pakistan to become chefs, to shoot for the stars. She told me how her restaurant and cooking show would demystify Pakistan for people, make them understand and appreciate the country she simultaneously loved and struggled with. She never forgot the children and young people she saw on the streets growing up, hungry and hustling, unable to see a way to break through the intergenerational disadvantage that exists here. I think after her Chopped win, Fatima understood how food could be her means to do something big.This year my parents and I are launching the Chef Fatima Foundation to try to carry on what Fatima started and do the things she would have done if she were still here. Our purpose is to “spread joy and make change through food.” We have a big and bold agenda, and we’ll take it one step at a time.With the Chef Fatima Foundation, we want to use food to help people find some respite from daily struggle and worry. One of our first projects will be a food truck that travels to children in challenging circumstances throughout Lahore in Pakistan: those in group homes, orphanages, or on the street, those who may feel forgotten and invisible. When Fatima was a little girl, she used to save her after-school treats and give them to the children on the streets who would crowd our car at the odd traffic light, begging for money and motioning to their empty mouths. Her mango juice, potato chips, candy bar, whatever our mom had got for her that day would get handed over with the warm embrace that was her smile. One day, maybe communities all around the world can have their version of a Chef Fati Food Truck rolling around and leaving a trail of smiles behind.Our next move will be starting up our Chef Exchange Program to help create pathways for chefs to come to Pakistan for short residencies, where they will learn about Fati’s food heritage and culture and all the incredible food traditions here, while teaching locals their food knowledge in return. We will also create pathways for young, aspiring chefs in Pakistan to go and learn from the best abroad. Pakistan has a young population that is hungry for success, with the passion but not the means to attain it. And the world needs more Chef Fatis.I know I can’t bring her back, but through this foundation my family and I, and so many of Fati’s friends and loved ones, want to bring more joy and happiness and good food into this world. I believe it is the best thing we can do, no matter how tempting it is sometimes to want to shut it all out.A short while before Fatima passed, an Ironman athlete wrote to her. He told her that he wrote her name on the water bottle he carried for a particularly difficult section of his race. Whenever he felt like he couldn’t go on, he would look at ‘Fati’ and muster the strength. I think I know what he was talking about.Find out more about the Chef Fatima Foundation, and how you can support, here.Explore Bon AppétitFirst PersonRead MoreLifestyleI'm a Chef With Terminal Cancer. This Is What I'm Doing with the Time I Have LeftBy  Fatima AlicultureChef Fatima Ali Has Died of Cancer at Age 29; This Is Her Essay from Our Upcoming IssueBy  Fatima AliLifestyleOne of the Toughest Stories We've Ever RunBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-25", "author": ["Condé Nast", "Mohammad Ali"]}