{"id": "9049bb742186a83d1a60b54d0d1e9efc", "url": "https://www.bonappetit.com/story/anthony-andiario-chef-pasta-instagram", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Anthony Andiario’s Instagram Will Transport You to Pasta Paradise | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Chef Behind the Pasta Instagram We Can’t Stop Scrolling ThroughAnthony Andiario never set out to be an Instagram star. But people (56,000 of them) can’t seem to get enough of his handmade pastas, now served at Andiario in West Chester, Pennsylvania.By Elyse InamineJuly 18, 2018FacebookTwitterEmailCeciliaGrace PortraitsFacebookTwitterEmailThis isn’t the story of a long passed-down recipe from an Italian nonna. Anthony Andiario earned his pasta education after all his daytime classes at the Arizona Culinary Institute and shifts chopping garlic and parsley for $5 an hour at an Italian restaurant, both in Scottsdale, Arizona. “It’s not a glamorous story,” he tells me over the phone, with a laugh.But now Andiario, 39, is the pasta guy with 56,000 followers on Instagram—and counting. They’re watching his every flour-dusted move (see below), from nimbly folding tortelli to rolling out corkscrew-shaped conchiglie miste with a steak knife, and flooding his feed with comments like, “I can’t stop watching,” “This guy makes pasta like no other,” “Dit is zo satisfying.” He makes pastas we’ve never seen before (who’s heard of conchiglie miste?) and transforms flour and eggs into something much greater than the sum of its parts. After 14 years of perfecting his craft at Quiessence and Tratto, under pizza legend Chris Bianco, he opened his own restaurant, Andiario in West Chester, Pennsylvania, this past spring.Instagram contentThis content can also be viewed on the site it originates from.Back in 2004, Andiario’s independent pasta study went like this: After his restaurant shift was over, around 10 p.m., he’d cook in his small one-bedroom apartment, crammed with cookbooks and gnocchi paddles (but no Internet or cable). He’d play some reggae, start boiling a pot of water, and delicately fold the flour and eggs together to make tagliatelle. Sliding the pasta into the boiling water, he’d wait a minute or two and pluck them out and eat the noodles straight. Still hot, moist, and slightly pudgy with excess water. No sauce. (He couldn’t afford to make it.) “Is the noodle too thick or thin? Is the texture too sticky or dry? Is this depressing?” he’d ask himself. No. This was the dream.These days, Andiario’s routine has hardly changed—though the ingredients have gotten better. Every morning, he’s the first to arrive at Andiario, once an old neighborhood drugstore (complete with a soda fountain) in the small borough of West Chester. He turns on reggae, gets a pot of water boiling, and gathers flour from Castle Valley Mill, durum from Green Meadow Farm, and whatever eggs his farmers bring him. He wrestles with tough spaghetti alla chitarra dough—“It fights you back,” he says—and stamps out thin, coin-shaped corzetti rounds from a tool he picked up during his last trip to Italy a few years ago. Then, he drops them into boiling water, waits a bit, then fishes them out and downs them. Still hot, moist, and slightly pudgy. No sauce. (It’s a preference now.) “Is the noodle too thick or thin? Is the texture too sticky or dry?” he continues to question himself. “I’m always chasing after perfection, trying to hone in and trying to do it better the next time,” Andiario says. “I know it will never be perfect, but”—he trails off a bit—“standing here and making it, it’s just so satisfying.”To get a sense of the method behind the flour-flecked madness, Andiario takes me through the pastas he’s conjuring (and constantly perfecting) at Andiario.Spaghetti alla chitarra in progress\nCeciliaGrace PortraitsSpaghetti alla Chitarra“You need to be a pasta lover to eat this because it will bite you back. It’s from the Abruzzo region and it’s thick and chewy, not like a delicate ravioli. Here, I serve it simply: alla gricia with local guanciale and local sheep’s milk cheese. It’s a challenging noodle to make. I mix together semolina, egg, and flour, then I knead it for 10 to 15 minutes in 10-pound batches, let it rest, and push it through a chitarra, a tool to cut the pasta with guitar-like strings. I’ve already broken a few of them.”Andiario’s beloved corzetti stamp along with freshly imprinted pasta\nAnthony AndiarioCorzetti (Little Disc)“I found this hand-carved corzetti stamp at a kitchen shop near the Duomo in Florence. It wasn’t initially out for display, but once the shopkeeper knew I was serious and willing to spend money, he brought it out to show me. It was only 60 euros, but it was such a special thing and he wanted to protect it. Typically in Liguria, corzetti is served with pesto or a mushroom sauce, and I love how the sauce falls into the folds of the design. So I just make a soft wheat dough with mushroom powder, water, and egg, roll it out thin, then punch out circles and stamp them with corzetti. All it needs is a few morels and a hickory cream sauce.”Nicchi get new life at Andiario\nAnthony AndiarioNicchi (Three-Cornered Priest’s Hat)“I discovered this pasta in a book about 15 years ago. It was one of the first ones I made at Quiessence, and the chef gave me a lot of grief for putting it on the menu because he didn’t know what it was and was worried it wouldn’t sell. He wanted pappardelle! I wanted to open with it at Andiario to harken back to that time. So I make a super eggy ravioli dough, roll it and cut it into squares, stuff with roasted Blue Hubbard squash and some shallot, and shape it into a three-pointed hat. It’s very humble and I don’t want to cover it up, so I toss it in a brown-butter sauce.”Green tortelloni as far as the eye can see\nAnthony AndiarioStinging Nettle Tortelloni“On my off days, I hike and I’m always finding stinging nettles. I love them; they have this musky spinach flavor. So for this pasta, I blanch the nettles, shock in cold water, then puree. I’ll hang that puree in a cloth in the walk-in to get rid of the excess water (if it’s too watery, it messes with the dough), then mix with 00 flour and eggs. I’ll fill the tortelloni with local ricotta and pecorino and fresh nettles, crisped up in brown butter.”Nests of tagliatelle\nAnthony AndiarioTagliatelle“Similar to spaghetti alla chitarra but silkier and softer, this versatile noodle is great with anything, bolognese ragu or porcinis and a little butter. Lately I’m making a lot of tagliatelle with hard wheat and eggs. I roll it thinner than spaghetti alla chitarra but thicker than ravioli. It’s a relatively effortless pasta to produce and everyone loves it. Right now I’m tossing them with rendered guanciale, chile flakes, local asparagus, and a little cheese. That’s it.”Two plump raviolos at Andiario\nAnthony AndiarioRaviolo“A customer brought us a few dozen eggs from her chickens, and I wanted to thank her for them, so I made this very luxurious pasta. I remember the first time I had raviolo al uovo in Rome, sharing it with my girlfriend (and restaurant partner) Maria van Schaijik. You cut into it, and you get this gorgeous red egg spilling out with ricotta; I don’t think it was dressed at all. We fought over it. It was that amazing. So, here we make the eggy raviolo dough, roll it out very thin, nestle the yolk in the ricotta, and serve with my own kind of truffle: dried mushrooms reconstituted, pureed, and dried into a ball. I grate over the raviolo to gild the lily.”A flock of bird-shaped combas\nAnthony AndiarioCaombas (Doves)“This Sardinian pasta is a pretty special one. It’s usually in a light chicken broth with lots of herbs and a raw egg yolk you stir into the broth. I found it while I was researching ravioli shapes one night, after scrolling through Google Images. So I tried recreating it at home, spending a few hours here and there tweaking the dough until I made a dough similar to tagliatelle, to keep its shape. I cut it into a triangle, trim the ends, and pinch the top so it looks like a dove. I serve it in a chicken broth with picked-over meat, wilted escarole, and of course, a raw egg yolk.”Build your own pasta fan base with these versatile doughs.Explore Bon AppétitPastaChefsRestaurants + TravelPennsylvaniaRead MorecookingExpensive Pasta Is Worth It—Here's WhyBy Alex DelanycookingMake Malfatti: Fluffy Ricotta Dumplings That Are So Much Easier Than GnocchiBy Alex BeggscultureHow to Drink and Snack Like an Italian on VacationBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-18", "author": ["Condé Nast", "Elyse Inamine"]}