{"id": "904a6dc77f27e7ade17268ef4aca335e", "url": "https://www.bonappetit.com/story/meal-prep-curry-base", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Keep This Curry Base in Your Freezer and Dinner Is Always Almost Ready | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKeep This Curry Base in Your Freezer and Dinner Is Always Almost ReadyIt’s versatile, flavor-packed, and a meal-prep saviorBy Antara SinhaSeptember 19, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanFacebookTwitterEmailIn the warmer months, I can easily get away with spending the weekend doing nothing more than prepping fresh summer produce for icy breakfast smoothies, sturdy salads, and speedy crisp-tender stir-fries to get me through a week of meals. As the weather turns cooler, however, it’s understandable that the crunch of raw veggies for every meal of the day is less appealing, and the craving for slow-simmered soups, long braises, and comforting stews sets in. As we’re slowly transitioning into fall, chef Meherwan Irani’s stellar All-Purpose Coconut Curry Base is becoming my go-to meal-prep strategy for a week’s worth of warming, hearty, flavorful dinners that have all of the comfort of a painstakingly simmered sauce with a fraction of the effort.All-Purpose Coconut CurryHere's a simple and versatile rich coconut curry to add to your meal prep rotation. This recipe makes enough sauce for three different dishes (Yellow Curry Chicken with Vegetables, Fish Curry, and Butternut Squash and Green Bean Stew).View RecipeThe base itself relies on some basic pantry staples (coconut milk, crushed tomatoes, vegetable broth), and a few spices worth the extra effort of seeking out. Citrusy, peppery curry leaves and deeply savory, funky asafetida, though optional, give this versatile curry it’s depth—I highly recommend a trip to a South Asian grocer to stock up. The best part: The base freezes well, so taking the time to make a double (or triple, if you’re feeding more than one!) batch of the curry on a weekend, letting it cool to room temperature, and then freezing it in preportioned freezer trays or deli containers means you have the option of a warming, hearty curry, soup, or stew any time the craving hits.Fish CurryOne of the most comforting ways to eat fish: Gently simmer spiced chunks of white fish in a warm coconut curry until it's fall-apart flaky.View RecipeAs far as versatility goes, you’re only limited by what protein and veggies you have on hand—more reason to keep your freezer stocked. My personal favorite: Irani’s Fish Curry, where prep is as simple as a speedy sear on some whitefish (I chose cod) and then dropping the cubed pieces into the gently simmering curry base where it cooks to flaky, flavor-packed perfection. A quick pot of basmati rice and a fresh squeeze of lime juice, and it’s become a fragrant, comforting meal I have on rotation.Butternut Squash and Green Bean StewTender chunks of roasted butternut squash and green beans swimming in a warm coconut curry = the vegetarian comfort fare we crave.View RecipeButternut Squash and Bean Stew is a tasty Meatless Monday option—and a fantastic way to use that autumn farmers market bounty—and is especially hearty over grains such as farro or wild rice, or quinoa or couscous if you’re looking for a quicker cooking option. And Irani’s Yellow Chicken Curry With Vegetables is especially tasty sopped up by naan or pita. Frozen shrimp, cubed and pan-fried tofu, or any assortment of those back-of-the-fridge veggies you’re trying to put to good use would all work seamlessly in this endlessly customizable and versatile curry. Staring into the depths of your fridge to cobble a meal together after a hectic weekday is daunting, but keeping your freezer stocked up with this versatile curry base makes a share-worthy, comforting meal attainable any night.Yellow Curry Chicken With VegetablesGrab some naan and cozy up to a bowl of this hearty and warming coconut curry chicken with vegetables.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-19", "author": ["Condé Nast", "Antara Sinha"]}