{"id": "90568de53bd29e42578aad6950dd4ecb", "url": "https://www.bonappetit.com/recipe/tostones-with-creamy-green-sauce", "year": 2019.0, "month": 12.0, "day": 5.0, "content": "Tostones With Green Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTostones With Creamy Green SauceBy Carla Lalli MusicDecember 29, 20194.3(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintIf you manage to eat only one of these double-fried, extra-crispy plantains, we'll put your name in the Guinness Book of World Records. The flavor and texture of the tostones is most perfect immediately after they're pulled from the hot oil, but you can hold them in a warm oven if absolutely necessary (as with French fries, the reheated version may not dazzle). The sauce, on the other hand, can be made hours or a day ahead of time to no ill effect.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEABlender$32 At AmazonMeasuring Spoons$10 At Bon Appétit MarketSpatula$12.99 At AmazonServing Bowl$14 At AmazonCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksRimmed Baking Sheet$20 At Bon Appétit MarketWire Rack$23 At BA MarketFish Spatula$14 At AmazonPlatter$29 At AmazonIngredients8 servings½bunch cilantro4scallions½habanero chile2limesKosher salt1cup sour cream or Greek yogurtVegetable oil (such as peanut, canola, or safflower; for frying, about 2 cups)4green plantainsPreparationStep 1Wash and dry ½ bunch cilantro. Coarsely chop leaves and stems—you should have about 1 loosely packed cup. Trim roots and top inch of green parts of 4 scallions; discard. Cut scallions into 1\" pieces. Cut ½ habanero chile in half lengthwise and remove seeds from one half (or leave them in, if you don’t mind extra heat).Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Transfer cilantro, scallions, and chile to a blender. Squeeze in juice from 2 limes; add 2 Tbsp. water. Season with a big pinch of salt. Blend on medium speed until cilantro and scallions are finely chopped, about 15 seconds.Step 3Add 1 cup sour cream or Greek yogurt and blend on high speed, scraping down sides as needed, until sauce is pale green and frothy, about 1 minute. Pour into a serving bowl and chill while you fry the plantains (or cover and chill sauce up to 1 day).Step 4Pour vegetable oil into a large (10\") cast-iron skillet, Dutch oven, or other large heavy pot to a depth of ½\". Heat over medium-high until an instant-read thermometer registers 375°, 7–8 minutes.Step 5Meanwhile, prep the plantains: Trim off both ends of plantain. Using the tip of your knife, score skin of plantain lengthwise down its ribs, rotating and repeating until you’ve scored the plantain all the way around. Make sure your cut extends down to the flesh of the plantain, but try not to cut into the flesh itself. Peel plantain along your score marks, then cut crosswise into ½”-thick coins.Step 6Line a rimmed baking sheet with a wire rack, or with a double layer of earth-friendly paper towels. Working in 2 batches, fry plantains, turning occasionally to ensure they don’t stick to each other or to the pan, until golden and starting to crisp, about 2 minutes.Step 7Using a fish spatula or slotted spoon, transfer plantains to prepared baking sheet. Repeat with remaining plantains.Step 8Reduce heat to low to keep oil warm while you flatten the plantains. Using a meat mallet or a flat-bottomed dry measuring cup and working one by one, place plantain on cutting board and firmly press down on plantains to flatten them to less than ¼\" thick; the edges should split and become craggy. (Do this while the plantains are still warm; otherwise, they become annoyingly difficult to flatten.)Step 9Reheat oil to 375°. Working in 3 batches, fry flattened plantains, turning occasionally and letting oil return to 375° between batches, until dark golden brown and crisp, about 3 minutes. Transfer to prepared baking sheet; season immediately with salt (it sticks better when the tostones are hot!).Step 10Transfer plantains to a platter. Serve with green sauce alongside for dipping.Step 11Do Ahead: Plantains can be fried 30 minutes ahead. Transfer to a wire rack set in a rimmed baking sheet and place in a 250° oven to keep warm.How would you rate Tostones With Creamy Green Sauce?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleCesaera and Divacooks are 200% correct on their tips. For 1/2\" in coins you do not need to deep fry. Also cutting down on the habanero size would make the salsa verde compliment better. From my fair share of bronx dominican tostones, it should be more sour/acidic than spicy. Mayochup/spicy mayo also works wonderfully as a condiment. Even in the winter these remind me of pre-quarantine summer days in the city. Thank you!LilyBronx, NY2/2/2021I make tostones all of the time for my team building company and can offer some tips.  Green plantains can be very tough to peel and can stain your fingers.  Use gloves and make sure the plantains are at room temperature.  If they are really tough to peel, put  them into a bowl and pour boiling water over them.  In a few minutes, take them out and you’ll find the skins will come off easily.  Make sure when you fry them the first time they are golden brown, if they are not cooked enough, they will fall apart when smashing.  Also, half a raw habanero seems like a LOT of heat for one cup of dip.  I would go easy and add start with a 1/4 habanero to the blender and taste. Chilies are all different, some are hotter than others even if they are the same type. You could also use jalapeño or serrano chilies for flavor but less heat.  divacooksMiami1/9/2020You don’t need to deep fry. You can use less oil- but enough to come halfway up their sides- and flip them once golden( they even get a more rich yellow). After you fry them once and smash them dip in a salty warm water and pressed garlic solution Before frying again. Mmmmmm. Traditional Dominican and Puerto Rican preparation. cesaeraUpstate NY1/6/2020Tostones are amazing. They're also great with garili aioli with cilantro.AnonymousNew York12/30/2019This was so fun! I've never made anything like this but your instructions made it easy! I didn't have plantains but grapefruit and ketchup were equally delicious. Yum yum!!GreatJobFriendsAmerica12/30/2019Explore Bon AppétitLatin AmericanCaribbeanPlantainVegetableSideStarterGluten-FreeNut-FreeVegetarianFryDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-29", "author": ["Condé Nast", "Carla Lalli Music"]}