{"id": "905932334c2d840477d7815a8aa45a74", "url": "https://www.bonappetit.com/story/shelskys-brooklyn-bagels", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Shelsky's Pepper and Salt Bagel is the Only Thing That Got Me Through Marathon Training | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Bagel is the Only Thing That Got Me Through Marathon-TrainingBetter than a hot shower, better than an icy-cold Gatorade, better than any other carbohydrate in all of New York.By Sarah JampelApril 2, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Sometimes I wonder if the only reason I run is for the bagel afterward. One day, I’ll be more like our commerce editor Elaheh Nozari, who ends her runs with healthful homemade baked goods. But for now, a bagel is my proverbial carrot. Because I’m training for a marathon, nearly every Sunday starts with logging miles, the best part of which is the final destination: Shelsky’s Brooklyn Bagels.While you’d expect any old bagel in NYC to be pretty good, I’m almost always disappointed—they’re too often small, fluffy, doughy, or pale. But then the famed Brooklyn delicatessen Shelsky's opened up a dedicated bagel shop in Park Slope. God had answered my prayers! The bagels are small but not for ants; chewy but not tough; good enough to devour fresh and without eggs or cream cheese or smoked fish, but not worse for those additions either. Shelsky’s makes good bialys, a Jersey pork roll with egg and cheese that’s been lauded by New York Times critic Pete Wells, and even Sichuan spicy chili crisp cream cheese—not to mention a whole menu of breakfast and lunch sandwiches along with all of the classic bagels (but explicitly not of the blueberry variety).The most remarkable one, however, is the pepper and salt, which is confettied with cracked peppercorns and pretzel salt (they jokingly call it their “bagel au poivre”). The s&p adds crunch, beauty, and also flavor—if it’s been a minute since you’ve tasted the fire of black pepper in cacio e pepe, this will remind you. The peppery heat is a perfect accompaniment to a thick layer of cool, tangy cream cheese that just slightly softens on the warm-from-the-oven bagel.Can you tell how many miles I’ve spent dreaming of that combination? (The answer is hundreds.) Run (or just walk!) to Shelsky’s—I’ll meet you there.Go There: Shelsky’s Brooklyn BagelsExplore Bon AppétitHighly RecommendRestaurantsNew YorkBrooklynRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Sarah Jampel"]}