{"id": "9069663641c87cb767d59843f2e48732", "url": "https://www.bonappetit.com/recipe/blueberry-miso-crumb-cake", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Blueberry Crumb Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlueberry-Miso Crumb CakeBy Chris MoroccoOctober 1, 20193.9(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintMiso and 100% whole wheat flour add salty-nutty complexity to this crumb cake. It’s super tender and moist with plenty of crumble topping above and fresh berries below—you’ll find yourself reaching for a slice for both breakfast and dessert.Ingredients8 servingsCrumble¾cup (95 g) whole wheat flour½cup (packed) (50 g) light brown sugar4Tbsp. unsalted butter, melted3Tbsp. white misoCake1cup (2 sticks) unsalted butter, melted, cooled slightly, plus more for pan1¾cups whole wheat flour (219 g), plus more for pan1½tsp. baking powder1tsp. kosher salt¼tsp. baking soda2large eggs1cup (packed) (200 g) light brown sugar1cup whole-milk Greek yogurt1tsp. vanilla extract1pint blueberriesPreparationCrumbleStep 1Mix flour, sugar, butter, and miso in a small bowl until combined. Let sit until ready to use.CakeStep 2Preheat oven to 350°. Lightly grease a 9\" cake pan with butter. Lightly dust with flour, tapping out excess. Whisk baking powder, salt, baking soda, and 1¾ cups flour in a large bowl to combine.Step 3Whisk eggs, brown sugar, and yogurt in a medium bowl. Add vanilla and 1 cup melted butter and whisk to combine. Using a rubber spatula, mix dry ingredients into egg mixture until well combined, but do not overmix. Mix in blueberries.Step 4Transfer batter to prepared pan and spread in an even layer. Top with reserved crumble.Step 5Bake cake, checking after 30 minutes and tenting with foil only if crumble is getting very dark (some color is fine), until top of cake is firm and a tester inserted into the center comes out clean, 60–70 minutes total. Let cake cool in pan, at least 2 hours, then cut into slices in pan.Step 6Do Ahead: Cake can be made 1 day ahead. Tightly wrap and store at room temperature.How would you rate Blueberry-Miso Crumb Cake?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleI rarely make cakes, but I had a load of blueberries in the freezer, so I went for it. I was impressed with how easy an trouble-free it was. I tend to only bake with whole wheat flour from a local bakery that mills their own flour, so that was a big plus. Took it over to a friend's house for a wine and cake session this afternoon, and we were all very happy with the results.Pat BittonEureka, CA9/23/2021I was nervous at first — when I started baking the room was drench in a umami odor and I thought: wow, way too much. But it mellowed out, I must say, this one is a winner. The miso paste adds just enough of a savory, umami flavor note to keep it from being a cloyingly-sweet cinnamon crumble. I would say this recipe is a successful, unique spin on a crumb cake. The only problem is that well, it’s a crumb cake. So it’s good every once in a while but not something I will make on a regular basis for myself, but it’s a solid option if I make brunch for friends.\n\nA few notes:\n\n— I used 2tbsp of miso instead of 3.... the flavor is there, without being o too much. Next time I’ll push it to maybe 2.5. However much you use, make sure you mix that crumble REALLY well into an evenly consistent powder. You want the miso is evenly distributed, no miso balls. This will make sure the flavors blend well.\n\n— Next time I’ll up the blueberry content, or add a little more of a second berry like raspberry or blackberry. I wanted to taste more.\n\n— I used a 9inch spring form pan. Perfect results.Drew KNew York 3/31/2021Someone please tell me what I did wrong. I followed the recipe to a T using weights. Even to the point of using a damn 9inch cake pan (that, of course, overflowed and destroyed my clean oven) . The result was inedible. This cake manages to be dense, greasy, mushy and aggressively salty. I even cooled the stupid thing for 2 hours. Ick. I even kept it around and tried it the next morning. Ick. The following evening. Ick. So what did i do or not do and what am I supposed to do with a tub of $12 white miso?LaraNashville, TN2/2/2021This cake turned out great.  It is very lightly sweet, which I liked.  The whole wheat flour gives it a nice \"nutty\" flavor, but the texture is surprisingly moist. I followed the directions exactly, except that I only had red miso so I used that instead of white miso, but added to my taste (since red miso is saltier and funkier than white miso). I probably wound up adding 1.5-2 tablespoons. The crumb turned out great - slightly salty with a subtle umami flavor. I made sure to break it into relatively fine crumbs.MattNew York1/18/2021Great, super easy cake! I accidentally only put 1 stick of butter instead of 2 and I still loved it. I baked it in a 10 inch spring form and had no issue with overflow. If you like blueberry muffins with a sweet, salty, slightly savory crumb this is for you. The cake isn’t sickly sweet, so it’s perfect for breakfast or dessert. Anonymous1/10/2021This is not my favorite cake. I have baked it three times in the last two months. It is so good. My husband is diabetic and whole wheat flour is better than white for him. I will make it over and over.BarbaraJamaica, NY12/15/2020I just finished waiting for two hours to elapse so I could slice into this cake, which I was very excited to eat. I've never made a cake with all WW flour before, but this one scores one point for team Whole Wheat. I used a 9 inch cake pan, as the recipe specified-anything smaller won't fit all the batter. My miso crumble came together easily with a fork (room temp miso and warm butter mix better!) I tented it after 30 minutes but definitely would have been better off doing it at 20-25. Got a little dark. The inside isn't picturesque, but boy, it is delicious. Totally on the less sweet side. I'm curious as to how it will be after sitting 24 hours. I'm thinking about using apples as a seasonal sub?nataliematz88Omaha,NE10/11/2020This cake is incredible. The sweetness is perfectly balanced with the miso. I used a 10’ spring form pan and it baked nicely. Be sure to fully incorporate your miso into your butter (microwave is your friend). Some friends said it was their favorite dessert they had eaten all year. AnonymousSeattle10/2/2020I should have checked my WW flour before mising out this recipe. Had to use regular AP but it turned out great. I did brown my butter instead of using regular melted butter and it smells fantastic. Planning on making it again with WW flour but with raspberries instead. AnonymousDenver Colorado9/18/2020Was just meh. Should have made it in a deep 9in pan or springform as there was way too much batter for a normal pan. Too much salty crumb. Thought it would lend a nice contrast but it was just weird. I think the cake without the topping would have been just fine though. Nice texture, just right on the sweetness. It was not good enough to put into rotation though. AnonymousPhiladelphia 9/18/2020This was delicious! The one thing I will do differently next time is let the miso get to room temp and whisk it into the melted butter before I add the dry ingredients for the crumb. I had some very strong/uneven miso notes in the crumb topping, and I think this would help fix that. AnonymousBrooklyn 9/16/2020It seems like this should have been good, but the whole wheat flour just made it so heavy. I like fluffy blueberry muffins and this was just too dense. I didn't have a round cake pan, so I used a 8x8 square. I didn't have any problems with baking. It looked great! Not to my taste though. carriespnc9/15/2020This cake was delicious. I added an extra 2 tbs of brown sugar. After reading the comments I baked the cake in a 10\" pan. My husband has diabetes and the whole wheat flour is better for him. I am going on a picnic and plan to make this cake.AnonymousNew York City9/11/2020Great cake and the miso really added a great depth of flavor! Make sure to put the cake on the lower racks so the crumb topping doesn't burn.Jennifer APasadena9/9/2020Made this recipe exactly as written and, as some other reviewers commented, the batter overflowed from the pan and created a horrible mess. The cake did not cook through and it turned out to be a nightmare. I was sooo surprised because I have always had luck with Bon Appetit recipes. Anonymous9/8/2020Explore Bon AppétitCakeDessertWhole Wheat FlourFlourMisoCondiments, Sauces & PastesBlueberryBerryFruitSnackVegetarianNut-FreeHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-01", "author": ["Condé Nast", "Chris Morocco"]}