{"id": "907a512f0004e73fb684a3b4bbad4f86", "url": "https://www.bonappetit.com/story/lauren-friel", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Lauren Friel Is Making Boston Drinking Culture a Little Less Bro-y | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLauren Friel Is Making Boston Drinking Culture a Little Less Bro-yHer natural wine bar Rebel Rebel is unabashedly feminist and reliably good.By Meghan NesmithMay 14, 2019FacebookTwitterEmailPhoto by Buck Harlan SquibbFacebookTwitterEmailRebel Rebel is tiny, even by wine-bar standards. There are 20 seats inside, tucked around a wood bar—but if the weather ever warms up, those 20 seats will become 60, spilling out onto the stone patio of Bow Market in Somerville, MA. For now, they’ve got blankets to wrap yourself in while you wait outside for a seat, and indoors, you can sit under a pink-lit wall emblazoned with the words SEX MONEY POWER and sip a glass of Gaia Quoi, a joyful, fizz-pop, deep-berry pet nat Syrah... It is, as Lauren Friel says, “a handshake wine,” one that tastes like better things are coming.Friel, the 35-year-old owner of Rebel Rebel, which she describes as a “feminist natural wine bar,” likes her tight quarters because she likes keeping an eye on people. Rebel Rebel’s website instructs guests to leave their “misogyny, homophobia, racism, classism, ableism, patriarchy, [and] gender bias” at the door. “I try to make it apparent from the time someone walks in the door that this is what’s happening,” says Friel. “There were a lot of people who were like, Do you really need that ‘Donate to Planned Parenthood’ jar on the bar?” She wasn’t deterred. “I wanted to build something in my city that I can be proud of. I knew in my heart of hearts that if I want it, other people probably want it, too. ”She was right: Rebel Rebel has been reliably packed since its opening in late 2018. It’s one of a growing number of female-owned establishments like wine bars haley.henry and nathálie and natural wine shop The Wine Bottega that show how Boston is shifting the needle on its image as a town for beers and (predominately white) bros in Vineyard Vines.Centering women’s experiences and approaches is something that Friel learned early in her career. She started working as a restaurant server after college, working under Ana Sortun and Theresa Paopao at Oleana. When Paopao left, she urged Friel to apply for the job of wine director. “They actually hired someone else after Theresa left who didn’t end up working out,” Friel says. “One day I walked in, and the owners handed me the wine laptop and said, ‘We don’t know what’s going on. Can you figure it out?’”Friel with a bottle of Martha Stouman's Negroamaro Rosato.\nPhoto by Buck Harlan SquibbShe learned on the job. “I’d never seen an inventory spreadsheet, I didn’t know what the labels meant, but I have the palate, and I love to research—I went to school for journalism. I found an old blog post written by Levi Dalton called ‘101 Things Every New Wine Buyer Should Know’ and I referred to it constantly. That was my rubric.”Eventually, she’d go on to get certification through the Wine and Spirits Education Trust, and at Oleana, her wine program won both Wine Enthusiast's 100 Best Wine Restaurants Award and Boston Magazine's Best of Boston award. As a consultant, she designed the country’s only all-female wine list for New York’s Dirt Candy. Yet despite her experience, she still struggled to be taken seriously.“When I first started as a wine professional in 2011, I was frequently the only woman in the room, and absolutely the youngest by at least a decade,” she says. “A very common reaction from guests was, ‘No no, we wanted to speak to the wine director.’ And I’m like, ‘No no, I am the wine director’.” And while she’s happy to see change occurring across the industry, creating female-friendly spaces in the wine industry remains an uphill battle.Disagreements between natural wine purveyors and traditionalists frequently spill over into personal attacks, she says. “It’ll escalate and escalate, and things will stay in the context of wine, until some kind of threat of sexual assault or body shaming becomes their trump card. I’ve had that happen many times, both online and in person. It’s so tired, and it’s so obvious, and it’s so boring, but it’s so common.”The bar at Rebel Rebel.\nPhoto by Buck Harlan SquibbWhat has also gone largely addressed is the treatment of female buyers by male producers, many of whom have a reputation for being “loose cannons.” On a recent visit to France, one producer was “showing a lot of attention toward the female buyers,” Friel recounts. “Myself and a few other women were like, we’re not playing this game.”So Rebel Rebel was always intended to be the antithesis of all this—the sexist comments, the pervasive harassment, the intellectual diminishment. From the mostly queer, all-female-identifying staff (“that’s not intentional, we’ve just only ever had one guy apply”) to the carefully curated selection of natural wines that line her open shelves, she’s been vehement about crafting a space that honors what she loves about wine.“We decided on all natural wines for two reasons,” Friel says. “First, the damage that conventional, industrial wine making does to the environment is terrifying, frankly. The other is that natural wine, because it always has been kinda scrappy, is more inclusive of young people, women, people of color, and queer people. It’s also just more fun.”Her neon yellow acrylics tapdance along the rows as she pulls a liter bottle of È Rosato, a Piedmontese rosé made by the third-generation “lunatic, warm, goofy” winemaker Fausto Cellario. “His wines are always brilliant and pure and precise,” Friel says. The wine is an intense, plush pink, and tastes like “the warm, squishy strawberries that get crushed at the bottom of your bag.” It is satisfying and fresh while still carefully architectural—as Friel says, a bit of magic.“People who have been in the industry for a long time say this—it’s not just me being woowoo—there are certain wines, really important wines, and they won’t be doing it for me, and then I meet the person and it’s like, Oh, that’s why. You suck!” That’s why she’s careful to stock her shelves with wine made only by “awesome people doing awesome things.”Rebel Rebel is a temple to the wine Friel loves, but it’s also just a really chill place to drink really good wine. As Friel says, “I can’t participate in anything anymore that isn’t actively progressing our social situation to a place of equality and understanding and empathy, especially when there’s money involved. It doesn’t feel right.”Explore Bon AppétitHealthyishBostonnatural wineprofileRead MoreLifestyleKrista Scruggs Is Making the Most Exciting, Most Delicious Natural Wine Right NowBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Meghan Nesmith"]}