{"id": "908ab3c34d1528fd95234dd2ac5d9a46", "url": "https://www.bonappetit.com/story/3-dishes-thatll-help-you-find-comfort-in-the-kitchen", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "3 Dishes That’ll Help You Find Comfort in the Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored3 Dishes That’ll Help You Find Comfort in the KitchenBy Campbell'sApril 24, 2020FacebookTwitterEmailFacebookTwitterEmailSponsored by Campbell's® | If you’re wondering how in the world folks are pulling together perfectly styled dinner spreads right now (and sharing envy-inducing pictures online), here’s a little secret: they know their way around a pantry. Campbell's® soups and Swanson® broths and stocks are the ultimate shortcut to cooking up chef-inspired meals that are both stylish and satisfying, even when cooped-up kids are screaming in the background. The best news of all is that you probably already have a few cans in your pantry.Sure, Campbell's soups are fantastic go-to meals in their own right, especially when the lunch hour is more like a five-minute window sandwiched between Zoom meetings. But if you think of Campbell's soups more like individual ingredients, the range of flavors available to you stretches tenfold. Pop open a can or carton, and seemingly elaborate dishes—which you might have written off as labor-intensive weekend projects in the past—are suddenly attainable on hectic weeknights. That’s because the soups do the work of layering flavors and adding complexity, giving you ample time to swoop in and flex your chef skills.These recipes are delicious proof that flavor-packed meals are easily within your grasp with a little help from Campbell's. Because these days, we could all use a little help.Creamed Green, Mushroom & Corn Slab PieThere are few things that a savory slab pie won’t improve. This version—bolstered with a flaky pie crust and stuffed with hearty greens, sweet corn, and thinly sliced leeks—gets a leg up from a can of velvety Campbell's Condensed Cream of Mushroom Soup, which binds the filling and delivers a pungent hit of garlic. Red chili flakes turn up the volume, while a splash of aromatic white wine melds the flavors to perfection. Served alongside a fresh green salad tossed with a citrusy vinaigrette, this slab pie is a weeknight all-star sure to pass muster with everyone at the table.Chorizo & Chickpea-Braised Chicken ThighsPantry staples have never quite shined like this before. Chicken thighs, braised with spicy nuggets of dried chorizo sausage and plump chickpeas, get an extra lift from Swanson Chicken Cooking Stock, which sets the stage for a rich pan sauce that you’ll want to pour over everything. (Seriously—save it to drape over vegetables, pasta, and pretty much anything else.) An entire jar of mild roasted piquillo peppers and a heaping pour of tart sherry vinegar add just the right amount of tang, while pitted Castelvetrano olives lend a briny note. The result? Impossibly tender chicken thighs that’ll make you break up with dry, sad chicken breasts forever.Vietnamese-Braised Short RibsIf the idea of attempting to cook Vietnamese food at home sends a shiver down your spine, take a deep breath and grab a few cartons of Swanson Beef Cooking Stock. Yes, many Vietnamese dishes call on long-simmered stocks bursting with deep flavors, but Swanson has you covered with its savory stock enriched with ingredients like carrots, onions, cabbage, celery, parsley, tomato paste, and honey. With that taken care of, you can focus on your braise: fatty short ribs are pepped up with fragrant spices—whole star anise, cinnamon, and whole cloves—while fresh ginger, fish sauce, and nearly a whole head of garlic amp up the drama. Red wine, rice vinegar, and honey bring it all together. Three hours later (it takes a while, but you’re stuck at home anyway!), fork-tender short ribs served alongside fluffy white rice and a cilantro-spiked carrot and radish salad will make even your pickiest family member swoon.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-24", "author": ["Condé Nast"]}