{"id": "9091fd6d57a90d2da0e27f853204da2e", "url": "https://www.bonappetit.com/story/a-tool-to-clean-your-tongue", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "This Tongue Scraper Will Clean (Like, Really Clean) Your Tongue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Tool to Clean (Like Really Clean) Your TongueTongue scrapers are easy to use, satisfying, and strangely addictive.By Sarah JampelApril 13, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!It takes a lot for me to add a step to my dental routine. Let’s just say that even after decades of being urged, I still don’t floss as often as my dentist thinks I do (don’t tell). But once I got a tongue scraper—a firm palm-sized tool in the shape of a horseshoe—it was not only easy, but also satisfying and strangely addictive, to add another step to Toothpaste Time.We love it: Kosha Ayurveda Tongue Scraper, $8Tongue scraping is a traditional Ayurvedic practice known as Jihwa Prakshalana that removes bacteria, food debris, and dead cells from the tongue’s surface. It offers a temporary reprieve from stinky breath (it’s been proven to be more effective than scrubbing with a brush), and some people also believe it improves the ability to taste and promotes good digestion. As for me, tongue scraping simply makes my mouth feel fresher.If you are the type of person who is both fascinated and horrified by the dirt that’s lingering all around us (perhaps you, like me, watch videos of carpet cleaning, just wait until you see the amount of whitish-gray gunk that comes off your tongue after scraping even once.  – Sarah Jampel, contributing editor.Buy it: Kosha Ayurveda Tongue Scraper, $8.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingSelf CareRead MoreLifestyleThis Supplement Keeps Me Healthy When All My Coworkers Are SickBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-13", "author": ["Condé Nast", "Sarah Jampel"]}