{"id": "9096f7a68a06170007cc0ce848b696db", "url": "https://www.bonappetit.com/recipe/spiced-lamb-and-dill-yogurt-pasta", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Spiced Lamb and Dill Yogurt Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpiced Lamb and Dill Yogurt PastaBy Sohla El-WayllyApril 2, 20204.8(69)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintYogurt makes this pasta creamy and comforting without feeling too rich. It is inspired by the Middle Eastern dish shish barak, tiny dumplings filled with lamb and pine nuts in a tangy yogurt sauce. You’ll find all those flavors here but made simpler and brighter with help from dried pasta and plenty of fresh dill.Ingredients4-6 servings3large egg yolks2cups kefir (cultured milk) or whole-milk plain yogurt3cups (lightly packed) dill fronds with tender stems (about 1 large bunch), divided3garlic cloves, divided3Tbsp. unsalted butter½cup pine nuts or slivered almonds½cup dried currants or raisins1tsp. kosher salt, plus more1Tbsp. ground cumin1½tsp. freshly ground black pepper1lb. ground lamb1lb. orecchiette½lemonPreparationStep 1Combine egg yolks, yogurt, and 1½ cups dill in a blender; finely grate in 1 garlic clove and blend until smooth. Set purée aside. Finely chop remaining dill; set aside.Step 2Melt butter over medium heat in a large skillet. Add pine nuts and cook, stirring often, until golden brown, about 2 minutes. Add dried currants and cook, stirring often, until plump, about 1 minute. Scrape nut mixture into a small bowl; season with salt.Step 3Wipe out skillet and heat over medium-high. Stir together cumin, pepper, and 1 tsp. salt in a small bowl. Place lamb in pan and use a sturdy spatula to aggressively flatten (like you’re making smash burgers); sprinkle spice mixture over. Cook, undisturbed, until lamb is well browned and crisp underneath, about 4 minutes. Hold back meat and drain off  all of the fat. Break up meat into small pieces and mix in reserved nut mixture. Finely grate in remaining 2 garlic cloves and add reserved chopped dill. Cook, stirring, until herbs are wilted, about 1 minute. Set aside until pasta is ready.Step 4Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until 1 minute shy of al dente (pasta will finish cooking in the sauce). Drain pasta and return to pot.Step 5Pour reserved purée over pasta and set over medium heat. Cook, stirring constantly, until sauce thickens enough to cling to pasta and just comes to a simmer, about 3 minutes. Remove from heat; finely grate zest from lemon half over pasta, then squeeze in juice. Season with salt.Step 6Divide pasta among bowls and top with lamb mixture.How would you rate Spiced Lamb and Dill Yogurt Pasta?Leave a ReviewTell us what you thinkReviews (47)Back to TopTriangleMY. FAVORITE. DISH. EVER. I look forward to making this all the time, but to keep it special I save it for ~3 times a year, and holy heck it never disappoints. I can almost make it from memory now! My boyfriend and I have started saying ... \"hey, I was thinking about making Orecchiettini Verdini this week... GET READY!!!!!!\" the anticipation, man! MAKE THIS! I don't change anything about the recipe, it's perfect. IzzyBoston, MA12/17/2021made without the lamb (served with some chicken I had on hand instead), and it was really good! omar k.Laurel, MD6/9/2021dill-icious! a great complete meal with great flavors. I should use buttery raisins paired with lamb more often! I threw a bunch of kale (chopped) into the pasta water with a few minutes left to add more veg to the dish. Thanks Sohla! KristenDenver, CO4/20/2021A week after making this, I am still thinking about it. Just absolutely delicious. The freshness of the yogurt and dill really plays well with the lamb. I splurged for pine nuts and I'm glad I did, but I think Sohla's recommendation of almonds as an alternative would work well too (pine nuts are $$!) Had leftovers and was absolutely thrilled to eat them the next day. Will add to our regular rotation.sarahWashington, DC3/24/2021I've cooked a lot of BA recipes and this is my favorite by far! Such a unique, fresh, and flavorful dish that leaves you craving more. Leftovers are good reheated, too! THANK YOU for my new fav recipe, Sohla!JgrubLos Angeles1/6/2021I was really excited about trying this dish, my impression from the recipe photo got me all excited. \nI followed all the ingredients, but am really not sure where it went wrong.... The keyfir made the dill sauce extremely watery, after blending it, it didn't make it smooth at all. I repeated the recipe a week later with yogurt instead of keyfir and the same thing happened? \nThe lamb was amazing, but I really need to firgure out how to get a creamy, green sauce....AnonymousIstanbul10/18/2020Besides having some trouble acquiring this much dill, this is a knock-it-out-of-the-park dish. cbruettSalt Lake City, Utah10/17/2020Question before attempting this dish: if using dried dill instead of fresh what is the ratio? I can't imagine putting 3 cups of dried dill into this! AndreaOMearaSeattle, WA9/22/2020While hunkered down during the pandemic we are taking an around the world culinary tour. First of all, we love lamb. Why do so many distain it? Perhaps mutton in their youth. This is a recipe that provides the best of what comfort food has to offer. There is only one small change I would make. The pasta doesn't cook to true al dente in the yogurt sauce so do so in the water. I used golden raisins in lieu of currants and next time will use more.  My husband LOVED it so it is a keeper. BTW, reheated the next night and just as good!!!!!carringtonashHilton Head, SC9/1/2020Wow, this recipe is a keeper, and I didn't change a thing. Actually, the only thing I would change is the systemic racism that the chef behind this recipe- Sohla El-Waylley- endures at Bon Appetit. I can only hope that justice for Sohla and the BIPOC chefs of Bon Appetit will be as satisfying as this recipe. Anonymous8/28/2020Very very good. Only alts I made was a tsp of honey after the lamb crisped, swapped the pine nuts for sunflower seeds as I'm allergic, and added some mushrooms I needed to get rid. As a whole this was delightfully well balanced, though in definite need of some more veggies next time!dalex27Pittsburgh, PA8/5/2020This is probably our favorite pasta to make from BA! The sauce is unbelievable and goes so well with the meat. Sohla is right, you can substitute all kinds of things- we tend to use ground pork and add cilantro in addition to the dill. She is truly innovative, our favorite person by far, and deserves only the best!!alexandyounySan Francisco, CA6/16/2020This. Is. So. Good. So incredibly satisfying and flavorful and sooooo easy - minimal ingredients, very little prep and little cleanup. I couldn’t find orecchiette at my supermarket, but had pantacce on hand, and it works beautifully. Oh, and for some silly and not bougie reason I only had duck eggs, and LET ME TELL YOU. The sauce! I’m over the moon for this dish. SidneyMPBradenton, Fl6/16/2020As I was cooking it, I thought I would like it. Should have trusted my own instincts and adjusted the  amount of dill as it is not properly proportioned and completely overpowers the other flavors in the dish.Anonymous6/14/2020I made this every week last month. It's one of the most interesting and rewarding things I've cooked in a while, and I cook almost every day. The more raisins the better! I've used parsley and spinch in place of the dill many times. Incredibly helpful that Sohla always lets viewers/readers know what kind of substitutions they can and can't make. Sohla is a true gem at BA and I hope she and other BPOC employees get the fair compensation they deserve. Elle SNYC6/12/2020Explore Bon AppétitPastaMiddle EasternDillHerbs & SpicesOrecchiettePasta & NoodlesGround LambLambMeatMainDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Sohla El-Waylly"]}