{"id": "9098dabe8601a55fd7104ae616ee3e1a", "url": "https://www.bonappetit.com/story/bento-box-gear", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "All the Tools You Need to Make the Perfect Bento Box | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingEverything You Need to BentoLunchtime is about to get a whole lot cuter.By Irina GroushevaiaJanuary 19, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I first started working from home, I was thrilled to have access to my kitchen to get creative with lunch. I was filled with inspiration and energy, wowing myself with fresh, complex, joyful meals. But like many I burned out quickly, and my extravagant lunches soon became a tub of hummus and a bag of baby carrots.Just as I was at my lowest point of sad lunches, I sought inspiration on TikTok and YouTube. As I scrolled through food content, my algorithm introduced me to folks making bento, beautifully packed lunchbox-style meals of Japanese origin, for themselves and their loved ones. “In Japanese culture, bento is thought to transmit the feelings of the preparer to the receiver through food,” says the Japanese American TikToker Tiffoodss, who makes bento videos. “When bento is packed with love, that care is communicated to the receiver upon eating the bento.”TikTok contentThis content can also be viewed on the site it originates from.The traditional boxes are hand carved from wood and often filled with rice, a protein, and vegetables, neatly tetris'd. Modern boxes are often made from plastic or metal, and it’s common for ingredients to get a social-media friendly update: fresh vegetables and fruit are cut into flowers or hearts, onigiri are skillfully shaped into cats and bears, little character toothpicks adorn snacks and other tiny bites. I pack my bento into a Bentgo box—the sleek stainless steel design appeals to me, as does its airtight lid and leak-proof silicone seal. It also has a removable divider so you can craft your bento into separate sections.Bentgo Stainless Steel Bento Box$30 at AmazonOnigiri formsBento boxes often include onigiri, the traditional rice balls with assorted fillings like tuna mayo or umeboshi, a pickled plum. These ​​onigiri forms will help you easily create the common triangle shape or get creative with hearts and flowers.Onigiri Mold$12 at AmazonCat rice moldThis cat-shaped rice press and character face stamps are a must-have for all the kawaii enthusiasts out there. The rice press creates an oval onigiri shape with triangular ears, like a cat. Then, cut out little faces by pressing the included stamp onto nori sheets. It perforates eyes, whiskers, and mouths you arrange onto your onigiri to make an animal face–so cute! Every time I make a kitty-inspired lunch, my will to live rises by 110%.Cartoon Cat Rice Ball Mold$11 at AmazonRice ball makerI also have a simple tool to make little rice balls about an inch in diameter. These are so fun to make and easy to eat. Before I roll the balls, I like to season the rice with rice vinegar and toasted sesame oil and then roll the balls in sesame seeds for a satisfying umami bite.Rice Ball Maker$7 at AmazonVegetable cuttersTo take your bento to the next level, use these fruit and vegetable stamps, which are like tiny cookie cutters, to create flowers, hearts, and little animal shapes using cucumbers, carrots, and other fruits and veggies.Shaped Vegetable Cutter Set$10 at AmazonCharacter food picksPop cherry tomatoes, grapes, berries, rice balls, hard-boiled quail eggs, and other small foods onto adorable toothpicks, like these jelly bean-shaped cats or aquatic creatures, featuring otters and whales. Their little faces will brighten up your day and make finger food even more exciting to eat.Animal Food Picks$7 at AmazonMarine Animal Food Picks for Bento Boxes$5 at AmazonThanks to the cuteness, care, and tradition of bento, I was able to once again find joy in creating delicious and playful lunches, even when commuting from my “office” to the kitchen seemed like a Herculean task. In the words of Japanese YouTuber Imamu, who makes “husbentos” on her channel Imamu Room, “Bento is nutritionally balanced, beautiful, and unique. It’s special for Japanese people. And homemade bento is artwork.”Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-19", "author": ["Condé Nast", "Irina Groushevaia"]}