{"id": "9098100dee274cc7a20617514af340a8", "url": "https://www.bonappetit.com/story/ops-pizza-salad", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Ops Pizza Is a Pizza Joint Where the Salad Is the Thing (and it Changes Every Day) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Pizza Place We Can't Stop Going To...For the SaladOps makes killer wood-fired pies in Brooklyn, but we're flocking there for the ever-changing big salad.By Priya KrishnaSeptember 11, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailIn my job as a food writer, where I often find myself reporting in three different boroughs in a single day and sometimes eating at five restaurants in a single week, I rely on constants. The gelato at Superiority Burger. The tagliatelle al ragu at Al Di La. The prawn pad thai at Uncle Boons Sister. And, as of late, the salad at Ops Pizza in Bushwick.There is only one salad offered at Ops. On the menu it’s called “salad.” It costs twelve dollars, it feeds a crowd, and it changes all the time. And no matter what, it’s always going to be one of the best salads you’ve ever had. I want to quickly acknowledge that Ops’ pizza is truly exceptional and worth the trip alone. But what always seems to stick with me are the greens.On a recent visit, I had a little gem and cherry tomato salad with a creamy vinaigrette tangled with herbs that tasted like what you always hope ranch dressing will be like. It was as if every piece of lettuce had been hand selected for crunch, and, married with all the other ingredients, the tomatoes popped with sweetness like some kind of plant candy. It was such an elegant, balanced assemblage of vegetables, I almost forgot we had pizza coming.Ops co-owner Marie Tribouilloy sits with a red endive and gem lettuce salad.\nPhoto by Chelsea KyleA friend who ordered the salad on a separate occasion got a plate of greens and radishes dressed in a sauce of thinned ricotta, olive oil, honey, homemade mayo, and chives, while another friend got radicchio with tomatoes, cucumbers, and sesame vinaigrette. Ops is Beyoncé when it comes to salads: incapable of producing anything other than a hit.How do they make this salad magic?!I asked co-owner Marie Tribouilloy, a France native and the genius behind the greens. “I think that is just what I wanted to eat,” she says about why she put the salad on the menu. “If you are going to stuff yourself with pizza it’s really good, but it is also bread and cheese. You want something full of water and crunchy and really bright.” She walked me through her flexible formula for making the perfect salads at Ops. Fair warning: Knowing how to make this salad at home won’t make you crave it any less.Choose a sturdy base.Tribouilloy’s go-to base for her salads is radicchio, as “it has these hearty, beautiful, large leaves, and it is something you need to chew on to get the flavor out of,” she says. On a more practical note, “I want people to be able to eat the salad with their hands, like a fun snack,” she says, and radicchio fits the bill.She also loves little gems and Treviso—the common thread here is sturdiness. You want a base green that will hold up well, she says, and not wilt when soaked with dressing.Go bitter, sweet, and saltyEven before considering dressing, Tribouilloy’s trick to a perfectly balanced salad is a trio of bitter, sweet, and salty components in the salad itself. Radicchio, corn, olives; little gems, slightly roasted tomatoes, ricotta; radicchio, plums, gomasio (more on this soon). You get the idea.An Ops salad with Gem lettuce, smoked corn kernels, radish, and homemade gomasio.\nPhoto by Chelsea KyleInclude a slightly cooked elementWhether it’s blistered sun-gold tomatoes, fried onions, or slightly burnt olives, Tribouilloy likes to include some kind of barely cooked element in her salads, both for texture and also because they often play double-duty when satisfying the bitter/sweet/salty formula above. For example, blistered sun-gold tomatoes are both bitter and sweet, and slightly burnt olives are bitter and salty.Put! Herbs! In! Your! Dressing!Dressing is Tribouilloy’s favorite element of a salad. “I like a pool of liquid at the bottom of the plate” that you can sop up with pizza crust, she says. “I want a dressing that is opulent, in a way.”Her dressing secret is fresh herbs, so she’ll add whatever she has on hand at the restaurant. They keep the dressing fresh, add another dimension of flavor, and cut through any rich components like ricotta or mayo.Double up on acidTo give her salads their tangy depths, Tribouilloy typically adds a sour element not once, but twice. To the dressing, she’ll include some kind of vinegar (she makes her own using wines at the restaurant that have gone bad) or saba (made by cooking grape musts) (an aged vinegar), but never lemon. She says that lemon doesn’t belong in dressings, “because it is only good if I can squeeze it fresh.” Instead, after the salad is assembled, she finishes it with a squeeze of lemon, which she says makes for the brightest, most vibrant taste.Meet gomasio: your new favorite salty salad topperSure, you could top your salad with cheese and call it a day. But Tribouilloy loves using gomasio, a dry condiment made by mashing sesame seeds and salt that essentially serves as a dairy-free substitute for a sprinkle of cheese. “It’s this beautiful, super nutty powder,” she says. “You just put a little on and it gives it this accent. You get this first impression of nuttiness just before the salad reveals the flavor of the greens. I love that.”Three Ops salad combinations to try at home:#1. Radicchio + Little gemsChive and ricotta dressingMarinated cucumbersGomasio#2. Radicchio + Salanova lettucesFried onions and thymeBurnt black olivesFresh lemon juiceOlive oil#3. Castelfranco + Treviso lettuceFuji applesSheep’s milk yogurtSaba vinegar (or balsamic)Olive oilChervilExplore Bon AppétitHealthyishPizzaNew York CityNew YorkSaladSalad DressingRead MorerestaurantsThis Slice Shop Is Low-Key Milling Its Own GrainsBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-11", "author": ["Condé Nast", "Priya Krishna"]}