{"id": "90a04b0e9c670ac4c13924982ca00a16", "url": "https://www.bonappetit.com/story/sinikiwe-dhliwayo", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "Sinikiwe Dhliwayo Wants Everyone to Chill Out in Triangle Pose | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSinikiwe Dhliwayo Wants Everyone to Chill Out in Triangle PoseThe creative producer and yoga instructor’s dream workout buddy is Michael B. Jordan, which...same.By Ryan Walker-HartshornAugust 27, 2019FacebookTwitterEmailPhoto R. Dione FotoPhoto by R. Dione FotoFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is yoga instructor Sinikiwe Dhliwayo, who is on a mission to democratize wellness and yoga through her brand Naaya.Sinikiwe Dhliwayo is reshaping the wellness landscape one vinyasa at a time. The creative producer and yoga instructor founded Naaya in 2017 to root people of color in their wellness, making yoga and meditation more accessible through pop-up workshops and discounted teacher trainings.Dhliwayo was born in Harare, Zimbabwe, and moved to Corning, New York with her family when she was 12. She played soccer and lacrosse growing up, which, she says, taught her the value of active living and that wellness is all about agency—deciding what makes sense for you and your body in the moment.Later, a stint teaching mindful movement to high schoolers in Brooklyn through the non-profit Bent On Learning sparked her passion for bringing yoga practices to more people. And as a full-time visuals editor at Hearst Magazines, Dhliwayo understands the power—and limitations—of visual representation. “In Western culture, a lot of erasure happens when practices become commodified,” she says. “In American culture, white culture is the dominating norm—often dictating who is seen in advertisements and consequently impacting peoples’ perceptions.”Now Dhliwayo is focused on curating a series sharing wide-ranging stories of healing from black and brown folks. And, early next year, she'll launch Naaya’s 200-hour yoga teacher training program—offered at half the cost of the standard $3,500 price tag to reach a larger community. This course will center yoga and social justice with a focus on equipping more teachers of color with the tools to bring these yoga practices into their own communities.We spoke with Dhliwayo about her skincare routine, her work-out hairstyle, and how she's being more discerning with her time.Right now, I’m listening to … Oprah’s SuperSoul Conversations podcast and NPR’s Death, Sex & Money podcast.I cannot stop craving … Van Leeuwen honeycomb ice cream—even though I shouldn’t eat dairy.The book I’m reading right now is ... Dare to Lead by Brené Brown. Also Lovingkindness, The Revolutionary Act of Happiness by Sharon Salzberg.Self-care to me means … whatever the moment calls for. Sometimes self-care is paying a bill I don’t want to pay, but I have to pay rent for a roof over my head. One thing for me is not doing the most. When I started Naaya a year ago, I felt pressured to take every meeting and every call, and now I am being discerning about how I spend my time.My dream yoga/workout buddy is… Michael B. Jordan.My current skin care regimen … starts by washing my face with green goop, a.k.a. Youth to The People’s Superfood Antioxidant Cleanser. I always use Super Goop’s Superscreen daily moisturizer for my face—I love it because it doesn’t leave that white cast on dark skin. For my body, shea butter! And at nighttime, Mad Hippie Vitamin C serum and NOTO Botanics face oil.Activism is…. seeing where there is harm being done, and using your voice to shed light on those wrongs and try to make an impact.My go to workout hair style is ... braids or Senegalese twists.My favorite yoga position is… trikonasana or side angle, because I really like the shape your body makes when you’re in the pose.Within the next year, I want to see the wellness community… embody true diversity. This would mean including people of different skin tones, ethnic backgrounds, body types, etc. There is such a gap here, and I want to see the wellness community to be inclusive and making room for people who are not white and affluent.Explore Bon AppétitHealthyishPerson of InterestSelf CareInterviewsRead MoreLifestyleJenny Lefcourt Won't Admit That She's the Reason You Drink Natural WineBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Ryan Walker-Hartshorn"]}