{"id": "90a2d8d53b758e2a196d2e85830d582b", "url": "https://www.bonappetit.com/story/chicken-confetti-rice", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Sanity-Saving Poached Chicken and Rice For When Life Is Just Too G-D Loud | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSanity-Saving Poached Chicken and Rice For When Life Is Just Too G-D LoudLife comes at you fast, which is where this quietly delicious poached chicken and rice number comes in.By Amiel StanekJanuary 9, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.There are a lot of specific things I look for in a recipe by the time January rolls around. I want food that soothes, dishes that are direct (and, ideally, delicious) correctives to the excesses and extremities of the season. After consuming my body weight in punch and pigs in a blanket during the holidays, I want food that feels, if not \"healthy,\" at least \"clean.\" After dragging my bundled and be-coated body through the frigid streets of New York, I need something warming, dishes that bring my internal temperature back to equilibrium. But there's a third thing I'm looking for this time of year that has almost nothing to do with the food I'm going to put in my body and everything to do with how that food is prepared: peace and fucking quiet.It's all so loud sometimes, isn't it? The din of dinner parties and we-have-to-catch-up post-work happy hours. The apocalyptic yammering of podcasts and talk radio. Car engines and horns and train tracks and bells. Maybe I'm just getting old, but when I'm feeling particularly fragile, in desperate need of food-as-medicine, I find myself gravitating towards what I like to call Quiet Food. I'm not talking figuratively here—I mean food that I can make, quite literally, with a minimum of noise. No violent, high-heat sizzling. No sputtering and popping. As little tossing and clanging and banging and blending as humanly possible.And as far as Quiet Food goes, nothing beats silky, tender poached chicken, served on top of lightly-seasoned rice, with a mug full of garlicky chicken broth alongside it. Absolutely nothing.It's a dish as soothing to make as it is to eat—the ASMR Youtube channel of recipes. I love the gentle rushhhhhhhh of a pot being filled from the tap; the plunk of two bone-in, skin-on chicken breasts slipping underwater along with scallion whites, crushed garlic cloves, a chile, and a splash of tamari. I relish the moment that, standing in a quiet kitchen, I can actually hear the pot come up to a boil, telling me to immediately drop it down to the barest murmur of a simmer. And while the chicken and broth-to-be come together quietly on the back burner, I turn my attention to the rice.Few kitchen tasks are as deeply meditative to me as rinsing rice. On a different, louder, more bombastic night of cooking I might not have time, but right now I've got nothing but. Running my fingers lovingly through those pearly grains, watching the cold water wash them clean, I see the free-floating anxieties of my day circle the drain and disappear. Into another pot it goes, followed by water, then up to a boil, then down to a simmer. (The symmetry between the cooking methods for the poached chicken and the rice make this recipe all the more pleasurable to me.)The recipe just waltzes along from there, a lazy lilt, the kitchen warming and savory aromas building. At some point, while the rice is still burbling away, the timer for the chicken goes off. Out go the breasts to rest, the broth gets strained, tasted, and seasoned. There are still a few vegetables to be sliced for the rice, but they're the kind of things—pickled ginger, scallion greens, cucumber—that are soft and yielding, immeasurably satisfying to cut even when my knife is well overdue for a sharpening. And then all of a sudden the rice is done, fluffed, and, still steaming, tossed with all that freshness and a sprinkling of black sesame. (If you're put off by the idea of warmed sliced cucumbers, don't knock it 'til you've tried it.)A heaping mound of tangy, vinegared rice. A few slices of delicate, perfectly-poached chicken. A ladleful of hot, aromatic broth poured over all of it and more in a mug riding shotgun. And, all of a sudden, there it is: peace and fucking quiet.Create calm with some confetti rice:Confetti Rice with Chicken in Spicy Garlic BrothWe took a page from chef and author David Tanis and added a bunch of seedy, pickley things to our sushi rice.View RecipeExplore Bon AppétitHealthyishChickenChicken BrothBrothFeel Good Food PlanRead MorecookingThis Slow-Cooked White Fish Recipe Comes Together Faster Than You ThinkBy Jill BaughmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Amiel Stanek"]}