{"id": "90a9bd322bccfa9a399aed3abeadec11", "url": "https://www.bonappetit.com/recipe/the-only-salsa-you-need", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Easy Homemade Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueThe Only Salsa You NeedBy Andy BaraghaniSeptember 6, 20214.6(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhen it comes to salsa, we prefer to leave the shelf-stable jars at the supermarket and make it fresh at home. This easy salsa recipe is a roasted riff on pico de gallo, which is normally fresh. The key is to char the tomatoes, onion, serrano chiles, and garlic under the broiler for a roasty and intensified flavor, then blitz the vegetables in batches for a texture that’s right in between smooth and chunky. If the fresh tomatoes at your market disappoint in the off season, consider trying this Salsa de Árbol, which is made with a can of fire-roasted tomatoes, or this salsa verde, which gets its verdant hue from a blend of tomatillos, cilantro, and avocado.Editor’s note: This recipe was originally published on July 9, 2019.IngredientsMakes about 4 cups2lb. tomatoes, cored, cut in half crosswise1medium white onion, sliced into ¼\"-thick rounds3serrano chiles3garlic cloves, unpeeledKosher salt2Tbsp. fresh lime juice2Tbsp. finely chopped cilantroTortilla chips (for serving)PreparationStep 1Heat broiler. Place tomatoes cut side down on a foil-lined rimmed baking sheet. Fit onion, chiles, and garlic around tomatoes so everything is snug but not overlapping. Broil, turning onion and chiles once, until lightly charred, about 6 minutes for chiles and garlic and 15–18 minutes for tomatoes and onion.Step 2Peel garlic and place in a food processor along with half of the tomatoes. Pulse until very smooth. Add remaining tomatoes and pulse until tomatoes are mostly broken up but mixture still has some texture. Transfer to a medium bowl. Finely chop onion and chiles and mix into purée; season with salt. Let cool. Stir in lime juice and cilantro. Season salsa with more salt if needed. Serve with chips.How would you rate The Only Salsa You Need?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleVery easy and good! We made half a recipe and substituted jalapeños and a red pepper for the serranos. Mild heat.. Slipped the peels off the tomatoes after roasting. AnonymousFlorida2/13/2022Can I can this recipe as is with water bath? AnonymousTexas9/14/2020This really is the only salsa recipe. Broiling the tomatoes, peppers, onions, and garlic gives so much depth to the salsa. Perfectly balanced.masonretteleKansas9/6/2020This is absolutely my family’s favorite salsa for me to make. Especially this time of year with all of the fresh peppers and tomatoes at the farm stands and farmers markets. It’s easy, flavorful, and my husband considers it restaurant quality.  I’m wondering, since all of the ingredients are cooked, if this salsa could be successfully frozen? Because it does make quite a lot. Anyone have any thoughts?Ohio9/5/2020I definitely plan to make this again, tweaked to my tastes. I agree with the past two reviewers, in my experience making salsa it just needs to sit for a day or so in the fridge for the flavors to hit really hard. I just made it though, and it's already delicious. Pretty sweet cause of the fresh tomatoes, but I like that. That was another idea I had...maybe that first reviewer used sub par tomatoes. I used some we grew and it's **chef's kiss**\nI added some pickled jalapenos (is this offensive?? I just really love them??) to up the heat level in a consistent manner, and I also pulsed everything in a food processor cause I prefer a really smooth, not chunky salsa. It will be added into my salsa making repertoire for sure.acfjNEW MEXICO9/3/2020I agree with chmaine-- at the outset, it seems unfocused but a few hours later and this is one of the best salsas I've had, full stop. As far as spice goes, it seems to be like medium+ for normal palettes.  I wanted to say this because I saw the one-star review and I feel like that was a fluke.AnonymousNYC9/29/2019The key to salsa is letting it sit for a day in the fridge to meld those flavors together. Love the charring! chmaineHouston8/25/2019We did not care for this salsa at all.  It's rather boring despite the charring.  I don't know what it is, as the ingredients seem like they'd make a decent salsa, but it just doesn't work.    Initially made it according to the recipe, then tried putting in some additional hot sauce, but it still falls short.  Didn't even keep it.AnonymousMinneapolis, MN8/18/2019Explore Bon AppétitSalsaCondimentMexicanLatin AmericanTomatoVegetableSerrano ChileChileEasyStarterSnackDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Andy Baraghani"]}