{"id": "90b3703e3321f0746bddd6bb5aeca693", "url": "https://www.bonappetit.com/story/spring-fruit-letter", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Don’t Sleep On Spring Fruits | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Sleep on Spring FruitThe season's bounty is giving me a lesson in slowing down.By Christina ChaeyMay 23, 2021FacebookTwitterEmailPhotograph by Alex LauFacebookTwitterEmailEvery other week, Bon Appétit senior food editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.I’ve never been much of a fruit person. I always keep frozen bananas and berries in the freezer for smoothies, but in the realm of fleeting seasonal produce, I’ve always picked ramps over rhubarb (okay fine, not a fruit), corn over plums.Fruits often require forethought and patience—two things I lack in general, but especially in the kitchen. You don’t buy avocados the day you plan to make a batch of party-size guac, and you don’t buy peaches the day you plan on pie. My problem is that I want to make pie RIGHT NOW. And in three days’ time when those peaches are perfectly ripe, I’ll want to make...something else (probably guac). Or I’ll be busy living my life because my plans are finally unpredictable and spontaneous again, two words that I’ve had to redact from my vocabulary for 1.5 years! I cannot afford to bend my newfound social plans for PEACHES!!!!The thing is, fruit, like sourdough starter, lets you know when it is ready for you, not the other way around. I learned this last week when I bought several pounds of gorgeous-but-slightly-too-firm apricots to turn into a brioche tart. But in my haste to bake the tart in time for a party (a party!), one thing led to another: I used the unripe fruit, didn’t let my dough fully proof, and ended up with something flat, dense, and, yes, technically tart (but not the tart I was seeking.) It didn’t make it to the party.I had all but forgotten about the remaining apricots until two days ago, when I noticed they had finally, perfectly ripened, blushing in their bowl and giving slightly when I gently pressed into them with my thumb. I didn’t have a plan for them, but there they were, just the same, calling: We’re ready for you! In the spirit of slowing down and making room for the unexpected, I took an hour out of my afternoon to bake them into this sublime custard cake (I subbed halved apricots for the rhubarb.) The fruit sunk into the batter and slowly baked into jammy, vibrantly orange pockets while the cake’s edges turned both crunchy and chewy, almost mochi-like, with a sugar-flecked crust. And lest you were thinking this cake was all dressed up with nowhere to go, I did, in fact, bring it to a tiny dinner party. And days later, we’re all still talking about how good it all was—the cake, but also the company.Spring bakes:Photo by Alex LauRhubarb Custard CakeOne-Hour Apricot and Almond GaletteStrawberry Snacking CakeRhubarb Brown Butter BarsBA's Best Strawberry-Rhubarb PieBasically Strawberry ShortcakesExplore Bon AppétitHealthyishWhat's Chaey Cooking?SpringessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-23", "author": ["Condé Nast", "Christina Chaey"]}