{"id": "90ba6979ede6d958baca977a62cf107a", "url": "https://www.bonappetit.com/recipe/jessies-special-steamed-whole-fish", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "Jessie’s Special Steamed Whole Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJessie’s Special Steamed Whole FishBy Jessie YuChenJanuary 30, 20224.4(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintIn many Asian cultures it’s a common tradition to serve a whole fish on Lunar New Year. It’s a symbol of good luck, as the Mandarin word for fish sounds similar to the word for “having extra.” Having fish every year means abundance will come your way, spilling over from one year to the next.Steaming a whole fish might seem intimidating, but I promise it’s much easier than you think. Instead of using a steaming rack or basket, I cook the whole fish over a bed of onions, ginger, and scallions in a large lidded skillet. The big pile of aromatics not only flavors the fish, it also keeps it from touching the bottom of the pan without the need for a steaming rack. The onions become soft and jammy as the fish steams, resulting in plenty of fragrant broth to serve alongside. Serve the fish with steamed white rice, a rice dish (such as my Mushroom YouFan), or noodles. —Jessie YuChenSee Jessie’s recipes for Mushroom YouFan and Mochi-Stuffed Jujubes (Soft Hearts) to complete your Lunar New Year feast, and read about their favorite Lunar New Year traditions here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet with Lid$40 At AmazonGlass Measuring Cup$19.99 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients2–4 servings11–1½-lb. whole fish (such as red snapper, black sea bass, or dorade), cleaned2Tbsp. plus ¼ cup dry rice wine (such as michiu or sake)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt13\" piece ginger, peeled, thinly sliced, divided1large bunch scallions2large onions, thinly sliced2Tbsp. Kimlan dark soy sauce or regular soy sauce1tsp. raw sugar or light brown sugar3Tbsp. toasted sesame oil3Tbsp. vegetable oil5garlic cloves, finely chopped3red Thai chiles, thinly slicedPreparationStep 1Pat one 1–1½-lb. whole fish (such as red snapper, black sea bass, or dorade) dry, then rub with 2 Tbsp. dry rice wine (such as michiu or sake) and sprinkle 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt all over inside and outside of fish. Place a few slices from one 3\" piece ginger, peeled, thinly sliced, inside fish; set aside.Step 2Trim 1 large bunch scallions and cut into 3\"-long pieces; set white and pale green parts aside. Thinly slice dark green parts lengthwise. Place in a small bowl and pour in cold water to cover; set aside.Step 3Place 2 large onions, thinly sliced, in a large skillet with a lid, arranging so they cover the bottom of pan; drizzle 2 Tbsp. Kimlan dark soy sauce or regular soy sauce over and sprinkle 1 tsp. raw sugar or light brown sugar on top. Arrange remaining ginger in the middle of pan to form a bed, then line up reserved scallion white and pale green parts on top to form a rack. Pour in remaining ¼ cup dry rice wine (such as michiu or sake) and ¼ cup water, cover with lid, and set over high heat. Bring liquid in pan to a boil (you should see steam coming out of the sides of the pan), about 3 minutes. Uncover pan and quickly place reserved fish on top of scallions. Re-cover pan, reduce heat to medium-low, and steam fish until cooked through, 7–9 minutes.Step 4Meanwhile, heat 3 Tbsp. toasted sesame oil and 3 Tbsp. vegetable oil in a small saucepan over medium-high heat, until it's shimmering and just starting to smoke, about 4 minutes.Step 5Uncover fish and transfer to a platter (or serve directly in skillet). Scatter 5 garlic cloves, finely chopped, and 3 red Thai chiles, thinly sliced, on top of fish. Drain reserved dark parts of scallions and place on top of fish; carefully pour hot oil over (it will splatter).How would you rate Jessie’s Special Steamed Whole Fish?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI've never written a recipe review in my life until now. It was so easy to make and I'm so overwhelmed by how flavourful and powerful all the flavours were. Definitely don't skimp out on the chiles and sesame oil. IsaacLondon, UK1/31/2022Explore Bon AppétitDinnerQuickEasyGluten-FreeDairy-FreeNut-FreeHealthyishChineseEast AsianAsianTaiwaneseFishSeafoodBassSnapperThai ChileChileVegetableMainSteamLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-30", "author": ["Condé Nast", "Jessie Yuchen"]}