{"id": "90bdc4d3ab5585b54585ffe2161ae413", "url": "https://www.bonappetit.com/story/sonoratown-los-angeles", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Sonoratown’s Tacos Made Me a Flour Tortilla Truther | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSonoratown’s Tacos Made Me a Flour Tortilla TrutherYou’re gonna want to go ahead and double your order at this cult Los Angeles taqueria.By Aliza AbarbanelMay 1, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve worshipped at the altar of corn tortillas my whole taco-eating life. And as someone who grew up in L.A., I’ve eaten a lot of tacos. For years I believed no flour could compare to the delicate earthiness of fresh masa, but once I took a bite of Sonoratown’s costilla taco, my whole worldview changed.Teodoro Diaz-Rodriguez Jr. and Jennifer Feltham’s cult L.A. taqueria is dedicated to specialties from San Luis Río Colorado, a city in the Northern Mexican state of Sonora. That means carne asada grilled over a mesquite wood fire, wrapped in handmade tortillas made with melted lard and soft wheat flour driven up by in small batches from Sonora by Diaz’s mom. (They used to drive huge shipments across the border but stopped after a few difficulties with border patrol.)It’s an extreme commitment to sourcing ingredients, but Sonoran flour does make a difference.Samin Nosrat even made numerous attempts to replicate these transcendent tortillas with all-purpose, cake, and Italian “00” flours, but none of them made the cut. Flour with high protein content creates dough with greater elasticity and structure, and Diaz and Feltham say that American flour (which is milled with higher-protein wheat than Sonoran flour) makes harder and heavier tortillas.So instead of settling, Sonoratown goes to great lengths. Luckily the resulting tortillas are worth it. They’re supremely chewy, mildly porky, and impossibly thin—the perfect wrapper for tender carne asada, pinto beans, and charred poblanos. Then the tacos are topped with two charred scallions, a fistful of lime wedges, and a two-tone splatter of salsa rojo and avocado crema.Of course I inhaled my two tacos in minutes. Then I returned to the counter with a sheepish smile, because how had I thought I’d eat just two? The taquero locked eyes with me, and before I even uttered a word, grabbed a nearby napkin dispenser and rang it like a cowbell, shouting seconds! Next time, I know to double my order from the start.Go there: SonoratownExplore Bon AppétitLos AngelesRestaurantsHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-01", "author": ["Condé Nast", "Aliza Abarbanel"]}