{"id": "90e79fffea05246387925a90af43a0ab", "url": "https://www.bonappetit.com/story/pg-tips-tea", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "PG Tips Is the Tops | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePG Tips Is the TopsI am never without my bottomless cache of this no-frills black tea.By Carla Lalli MusicOctober 3, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.To paraphrase my good friend, Chris Morocco: When you want a cup of tea that will hit you like a strong coffee, you want PG Tips.I drink black tea with milk every morning before I leave the house—it may be the primary reason I am ultimately capable of leaving the house at all. I’ve gone through fancy phases (organic Assam), run-of-the-mill phases (Twinings English Breakfast), and boutique phases (Steven Smith Lord Bergamot). But no matter what I might have going on the side, I am never without my bottomless cache of PG Tips, which was, until very recently, the top selling tea in the U.K.I’ve been drinking this extremely affordable, no-frills brand for longer than I can remember, and what I love about it is its deep, dark, malty, rich, smack-you-in-the-face qualities. My morning ritual involves two pyramid tea bags, 16 ounces of just-boiled water, 3 minutes of brew time, and an insulated beverage container to keep things steamy as I dole out cupfuls at a time. I add enough milk to achieve shopping-bag-brown color, and sometimes, if I’m feeling special, I’ll add a half spoon of sugar. Being a tea drinker might sound sedate, but within half an hour I am as amped as a race horse and raring to go!There’s not a lot of pretense in a cup of PG Tips, despite the fact that it inspired little prince George’s nickname “Tips.” It’s strong, but never tastes bitter. It’s robust but not muddy, inexpensive without tasting cheap. In 2018, the company started making completely biodegradable pyramid bags, which sweetens the deal, even on the days when I skip the sugar. After all these years—and all these tea phases—it is forever my morning beverage of choice. Coffee can wait.Buy it: PG Tips, $6 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingTeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-03", "author": ["Condé Nast", "Carla Lalli Music"]}