{"id": "90ec47b1ba18e80e67ba21c5242e35ce", "url": "https://www.bonappetit.com/recipe/peach-sorbet-with-crushed-blackberries", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Peach Sorbet with Crushed Blackberries Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssuePeach Sorbet with Crushed BlackberriesBy Andy BaraghaniAugust 13, 20204.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThe splash of vodka we add to this fruity sorbet recipe is the key to a smooth frozen treat: The alcohol helps prevent big ice crystals from forming, making the sorbet easier to scoop out of the loaf pan. Just don’t add more than a couple of tablespoons—too much alcohol will cause the sorbet to melt faster. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here. Ingredients4 servings4medium peaches, chopped, or 4 cups frozen sliced peaches½cup plain whole-milk Greek yogurt2Tbsp. vodka¼tsp. kosher salt¼cup plus 2 Tbsp. honey6oz. fresh blackberries, halved2tsp. fresh lemon juicePreparationStep 1Process peaches, yogurt, vodka, salt, and ¼ cup honey in a food processor or blender until smooth. Pour peach mixture into a loaf pan (a metal pan will conduct cold more efficiently than tempered glass) and place a piece of parchment paper on top, pressing directly onto surface. Freeze until sorbet is firm, about 6 hours.Step 2A little before serving, lightly crush half of the blackberries in a small bowl. Add lemon juice, remaining berries, and remaining 2 Tbsp. honey and let sit, tossing occasionally, until berries have released some of their juices, about 20 minutes.Step 3Scoop sorbet into bowls and top with macerated blackberries.Step 4Do Ahead: Sorbet can be made 3 days ahead. Keep frozen. Thaw in refrigerator 30 minutes before scooping into bowls.How would you rate Peach Sorbet with Crushed Blackberries?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleIs there a way to make this without alcohol?Sarah JOakland, CA8/12/2021Already rated this recipe once with 5 stars. Just wanted to make an additional comment that keeps the rating at 5 stars: Made it with fresh picked strawberries and increased the vodka to 1/2 cup. Still excellent as ever! Sharing this recipe with EVERYONE! As a side note after reading some of the comments. Use RIPE fresh fruit if you want the best taste!KattaWilkes-Barre, PA7/3/2021I think  an additional step is necessary to make a smoother consistency- suggest after blending all ingredients- strain the mixture thru a fine mesh strainer. . TSinDenver,CO4/9/2021This recipe is HEAVENLY! I've been sharing it with everyone! Notice I didn't say I was sharing the Sorbet!\n I  used frozen Chambersburg peaches from this awesome place in Pennsylvania. I also used Peach Vodka and increased the amount to a little over 3 Tablespoons. If you let it soften in the refrigerator like the recipe calls for, it is perfection. It's going to taste even better when I make it over the summer!KattaWilkes-Barre, PA2/28/2021A few things with this. After I read the notes about iciness I decided to churn this in a mixer for 20min and added a little more vodka in hopes of avoiding that issue. Mine still turned out quite dense and with some ice crystals, it's hard to totally avoid with sorbet but this didn't turn out great.\n\nThe flavor was kind of lacking too. Maybe I needed riper fruit, but the honey really overpowered any fruit flavor. So use a very mild honey or maybe replace the honey with sugar to give the sorbet more body and fix the iciness too.bigmoodNew York9/4/2020I’m somewhat lactose intolerant, so I subbed out the yogurt for dairy-free yogurt and the texture was .... off. The flavor is great, but it’s icy and not scoop-able. \nIf I try this recipe again, I’ll try adding more vodka to prevent it from freezing too much. And maybe I’ll get a little buzz 🤪AnonymousChicago, IL8/25/2020This sorbet tastes great, but the texture came out totally wrong--it is very icy, not smooth at all. Should I have added more vodka?AnonymousNew York8/19/2020Can I use gin or tequila if I don't have vodka?Anonymous8/17/2020You have to peel chop then freeze the peaches before you start? AnonymousBaltimore 7/26/2020This sounds so good - I don’t have full fat yogurt, would it work with low-fat yogurt?AnonymousKenmore WA4/13/2020Recipe is very simple and easy but wayyy too much honey. If you are not a honey lover I wouldn’t recommend this unless you can substitute it for something else or just use less. Anonymous9/26/2019So easy but so delicious!  I shared with a friend and she immediately asked for the recipe.  I'll definitely be making it again too.  The addition of the blackberry sauce elevated the dessert to another level.   Yum!New York8/4/2018Explore Bon AppétitFrozen DessertDessertSorbetPeachStone FruitFruitBlackberryBerrySummerEasyGluten-FreeNut-FreeHealthyishFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}