{"id": "911bf7b0d1ba71ebcf015d8195ec3c93", "url": "https://www.bonappetit.com/story/pasta-with-garlic-green-olives-herbs", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "The Only Pasta I Make For My Best Friend Has 8 Cloves of Garlic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Only Pasta I Make For My Best FriendEight cloves of garlic means you really must be really, really close.By Elyse InamineOctober 19, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie TheodorouFacebookTwitterEmailMost friends give friends who just moved into a new home a nice bottle of wine, maybe some paper towels if they’re practical. Me? For my best friend? I brought her a whole head of garlic, a bag of wide-leg pappardelle, a tub of olive oil, and fist-size portions of basil and parsley. Then I made lunch.Specifically, Andy Baraghani’s extremely simple but extremely satisfying pasta riddled with bronzed flecks of garlic, bracing Castelvetrano olives, and all those leafy herbs. It was an elegant and complex meal—“bright, herby, and a little briny,” as Andy described it over Slack—and it couldn’t be easier to pull off.Even while totally distracted by our conversation about the very dark but very fascinating Dr. Death podcast, I could still absentmindedly boil the pasta water and smash eight—yes, eight—garlic cloves in olive oil until they look like little golden nuggets. While my friend and I batted around theories about how this neurosurgeon could have kept going after committing 33 botched surgeries (insane hubris? Actual ignorance?), I tossed those nuggets with red pepper flakes, pitted Castelvetranos, and chopped parsley. “It’s a way to mellow out the grassy parsley flavor,” Andy Slacked me. (We only communicate via Slack, like true millennial coworkers.)Once the pasta was just under al dente, I should have paused the conversation to gently move the noodles from the hot water to the garlic-parsley-olive sauce. But hindsight is 20/20, and instead I burned my forearms with hot splashes. However, I was undeterred because here came the best part: butter. I threw in a few tablespoons of butter and a splash of pasta water to give the sauce the kind of dewy gloss promised by Korean face masks. We finished the dish with sweet, fat basil leaves, a little lemon zest, and a couple teaspoons of lemon juice, and rushed the pot to the table. Then, silence. All conversation ceased as we slurped each butter-drenched strand straight from the Dutch oven. No Dr. Death theory could pry us away from Andy’s pitch-perfect pasta.This is a pasta that celebrates the glory of garlic: how it makes everything taste better, stinks a little, and always seems to linger on. It’s a little bit like a friendship that’s weathered years in an AC-less bedroom, break-ups, maid of honor speeches, new jobs, and very adult accomplishments. And that’s why it’s the perfect thing to make your best friend.Get the recipe:Herby Pasta with Garlic and Green OlivesAn herb-laced riff on aglio e olio, quick and easy.View RecipeRead MorecookingFrom Now On, I Will Always Have a Jar of Garlic Confit in my FridgeBy Emma WartzmancookingA Garlic-Lover’s Chicken Recipe Because Life’s Too Short to Worry About Bad BreathBy Amanda ShapirocookingAjo Blanco Is the Sauce You Didn’t Know You Were MissingBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-19", "author": ["Condé Nast", "Elyse Inamine"]}