{"id": "91202e5b1d2f399f62001d62de9e33f8", "url": "https://www.bonappetit.com/story/my-grannys-cheesy-potato-casserole", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "This Cheesy Potato Casserole Is Literal Decadence | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Granny’s Cheesy Potato Casserole Is Literal DecadenceThis holiday side is worth doubling.By Matt HornNovember 23, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.In the midst of a global pandemic, pitmaster Matt Horn opened Horn Barbecue in Oakland, CA, last month to crowds who line up weekend after weekend. There, he serves Texas-style barbecue and classic sides, like Granny’s cheesy potato casserole, from 11 a.m. until everything’s sold out. We had to know more about those potatoes, so we asked Matt for the recipe and the story behind it, and he was willing to share the family secrets.My grandmother, Alice Horn, is a very, very wonderful woman. She loves to cook, loves good food, and she writes down all of her recipes. She cooks true Southern foods: straight-up soul food. She used to put on these really big dinners for the holidays, and I’m telling you, it was a lot of food. There would be maybe four or five tables where you’d just have just sides, or just meats, or dressings, or desserts, pies and cakes all made from scratch. There was a honey-glazed ham, a smoked turkey, and a deep-fried turkey. A darker gravy and a lighter gravy. We were praying early in the day and then we would eat all day.Those meals are where this cheesy potato casserole came from—she would make a few trays of it, prepping days ahead. It’s a very distinct dish—simple—but it always stood out to me. It’s one of my favorite dishes that she cooks.To make it, thaw 2 lb. frozen hash browns for a half hour or so (in the bag or out). Then, heat 1 can cream of chicken soup (undiluted) with 1 stick butter until the butter is melted. Add 8 oz. sour cream and 1½ cups grated cheddar cheese to the cream of chicken soup mixture and fold in 1 cup chopped green onions. Add the hash browns and mix well, salting to taste, around 1½ tsp. Top with 1½ cups more grated cheddar cheese and bake uncovered for 60 minutes at 325°. It’s done when it’s starting to brown around the edges. One thing my grandma would always say is that when you see the cheese boiling in the middle is how you know that it’s finished. (To make it in advance, you can mix the casserole a few days ahead and keep it in the fridge until baking, or freeze it once it’s cooked.)The combination of the cream of chicken soup mixed with sour cream and cheddar cheese—when all of that combines together, it’s literally decadent. It’s a little crispy up top, but then as you go into it, it’s really succulent.  All of the elements work together, and then there’s a cup of green onions, and that’s what makes the dish. When I told her I was making her casserole at the new restaurant, she said she was honored. I told her I would make her proud. And she smiled.Explore Bon AppétitIt's That SimpleThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-23", "author": ["Condé Nast", "Matt Horn"]}