{"id": "912428e89a952cb9320010e922be0b89", "url": "https://www.bonappetit.com/story/the-pinole-project", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "The Pinole Project Is Putting My Quaker Oats Game to Shame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Pinole Project Is Putting My Quaker Oats Game to ShameThis porridge of cornmeal, oats, and chia seeds is my new favorite morning fuel.By Alex BeggsMarch 21, 2022FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.You know you’ve come far in life when you regularly write about oatmeal for work. Good morning! Happy to be here. And it was a good morning because I began my day with strong black coffee and a bowl of The Pinole Project’s peanut butter and cacao pinole chia oatmeal, which I zapped for two minutes and topped with toasted sliced almonds. Eaten across Latin America, pinole is finely ground cornmeal that’s usually mixed with spices and/or chia seeds to make a filling breakfast porridge. The Pinole Project’s recipe is corn + rolled oats + chia + cane sugar + salt + cinnamon with a trace of lime.The Pinole Project Pinole Oatmeal$10 at Amazon (1 bag, Original)$28 at Amazon (3-bag Variety Pack)The corn here is heirloom white Olotillo corn from Oaxaca, which makes the porridge smell like a just-pressed corn tortilla—deep and corny, made even more fragrant by that pinch of cinnamon. (Olotillo is a type of white corn that’s thousands of years old, which, for corn, is young.) You can microwave your pinole oatmeal, heat it on the stovetop, or make it as overnight oats, letting the chia seeds expand a bit. It’s barely, barely sweet and I was so relieved it contained sugar and not my nemesis, sweeter-than-thou Stevia. The PB & Cacao flavor has cocoa powder and peanut flour, and it’s just as subtle.Maya Jacquez, who founded The Pinole Project in Woodbury, N.Y., alongside her family, says the company is an homage to her abuela, Adela Jacquez, and her pinole recipe. Pinole, as Adela reminded her grandchildren, was fuel for Aztec warriors and the Tarahumara, an indigenous people in Mexico known for being long-distance runners—which means it’ll help you power through your morning even if you won’t be running 50 miles.The bag touts that the oatmeal is vegan and gluten-free and packed with Omega-3s, fiber, and protein, plus all kinds of other nutritional bonanzas. But the flavor of the nutty, savory corn is the selling point for me. It reminds me that some of the most delicious ingredients are the ones that have been here the longest. It’s just the packaging that’s changed.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-21", "author": ["Condé Nast", "Alex Beggs"]}