{"id": "912ad078ce1c2333225d0ff02e18647c", "url": "https://www.bonappetit.com/story/too-much-black-pepper", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "You're Probably Using Too Much Black Pepper | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou're Probably Using Too Much Black PepperEverything you cook needs salt. But pepper? Not so much.By Molly BazJanuary 16, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailCan somebody please tell me when salt and black pepper became automatically, inevitably linked together? At what point in the long history of cooking did someone taste a peppercorn and think to themselves, “Hey, this reminds me a lot of that salt stuff we harvest from the sea and have come to know and love. Maybe we should henceforth use them in tandem in everything we cook! Never again shall a salt crystal stand alone. Salt AND pepper, forever and always!\"I mean, that sounds nuts, right? When you think about what these two seasonings actually do to food, they could not be more different. In a nutshell: Salt makes food taste more like itself; black pepper makes food taste like black pepper. So why do so many people automatically follow a pinch of salt with a couple of cranks of the pepper mill?Learning how to season food effectively is one of the cornerstones of good cooking. When novice cooks ask me why their food doesn't taste as good as they want it to taste, the answer is almost always that they aren't using enough salt. I recommend the following exercise: Make a bowl of buttered pasta using no salt at all. Taste it straight out of the pot. Then add a good pinch of salt to it, toss it, and taste it again. Repeat. Taste again. Repeat that process until suddenly the flavor pops, your mouth beings to water, and things start to get really friggin’ tasty. THAT is the power of salt. It makes food—any food, every food—taste more.But that isn't the case with black pepper. If you were to repeat that same challenge using pepper, you’d add and add and add and never experience that magical, ah-HA moment. That bowl of pasta will start tasting spicier, and more floral, but it will never start tasting like the platonic ideal of noodles and butter. And that’s because pepper does not possess the same magical flavor-enhancing qualities that salt does—it makes food taste like it was seasoned with black pepper.Don't get me wrong—that isn't always a bad thing! Black pepper is delicious, and brings a whole range of different flavors to the table that can be truly bangin’ when applied to the right dish (a properly salted one, of course). I love freshly ground black pepper. Like, love-love it. It brings a subtle background heat to some of my favorite dishes (helllloooo cae sal!). On a blank canvas, like a plate of scrambled eggs, you can really taste the floral, earthy notes that good pepper has to offer, and a big bowl of cacio e pepe just wouldn't be the same without it. I have zero hate and nothing but R-E-S-P-E-C-T for the humble yet mighty peppercorn. But please please please, people, let’s start to honor it for what it is—an incredible and versatile spice—and use it when it's really going to get a chance to shine.Let's let salt be salt, and pepper be pepper. When you stop putting the latter on everything you cook, you'll learn to love it even more. You know what old people are always saying: “Absence makes the heart grow fonder.”You want a recipe that really wants some black pepper? How about these wings:Crispy Peppercorn Chicken WingsThese super-flavorful, no-fry chicken wings turn out best when they’re seasoned ahead of time. You can do this as little as 1 hour in advance, but letting them hang out with salt and those spices overnight is a complete game changer.View RecipeExplore Bon AppétitBasicallyBlack PepperRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Molly Baz"]}