{"id": "91344f1c9372583be1d92fc33c81a5f5", "url": "https://www.bonappetit.com/recipe/lavender-lemon-crinkle-cookies", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Lavender-Lemon Crinkle Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueLavender-Lemon Crinkle CookiesBy Cheryl DayOctober 19, 20213.7(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Christopher Testani, Food styling by Victoria Granof, prop styling by Alex BrannianEmailPinterestPrintEmailPinterestPrintIf the joy of frolicking in a field of flowers could be captured in a cookie, it would be Cheryl Day’s lavender-lemon crinkle. These crackly, chewy cookies from her newest book, Cheryl Day’s Treasury of Southern Baking, balance bright lemon and floral lavender for a tender treat that makes a lovely addition to any cookie platter. Pro tip: The colder the dough, the less messy it will be to roll the balls in sugar.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonSmall #70 Cookie Scoop$15 At AmazonScale$25 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredientsMakes 362cups (250 g) all-purpose flour1Tbsp. finely grated lemon zest1½tsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. dried lavender buds (optional)2large eggs¼cup fresh lemon juice½tsp. vanilla extract½cup (1 stick) unsalted butter, room temperature1cup (200 g) granulated sugar½cup (55 g) powdered sugarPreparationStep 1Whisk flour, lemon zest, baking powder, salt, and lavender (if using) in a medium bowl. Whisk eggs, lemon juice, and vanilla extract in a small bowl.Step 2Beat butter and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment on medium speed until pale and creamy, about 2 minutes. Add egg mixture and beat 1 minute to combine. Reduce speed to low and add dry ingredients in 3 batches, mixing just until combined after each batch before adding more. Dough will be very soft at this point. Cover bowl and chill dough at least 1 hour and up to 2 days. (If chilling longer than 1 hour, transfer to an airtight container; this will keep the dough from drying out.)Step 3Place racks in middle and lower thirds of oven and preheat to 350°. Place powdered sugar in a small bowl. Using a #60 or #70 cookie scoop (or 1 Tbsp.), portion out dough and roll into balls. Working quickly so dough doesn’t have a chance to warm up, drop each dough ball into powdered sugar and roll to coat evenly. Divide cookies between 2 parchment-lined baking sheets, spacing 2\" apart.Step 4Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until puffed and cracked and edges are set, but centers are still soft (cookies will look underbaked between the cracks), 10–13 minutes.Step 5Let cookies cool on baking sheets before serving.Do ahead: Cookies can be baked 3 days ahead. Store airtight at room temperature.Recipes adapted with permission from ‘Cheryl Day’s Treasury of Southern Baking’ by Cheryl Day (Artisan Books). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Lavender-Lemon Crinkle Cookies?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleOur family loved these cookies. They were light and airy and had great lemon flavor. Some tasted the lavender more than others, so next time we make them we'll slightly grind the lavender to disperse it more between the cookies. My son made these and just followed the recipe.JilliniAustin, TX12/20/2021I'd like to add to my last comment. I made another batch after putting the dough in the freezer for a couple hours, making the dough balls smaller, and rolling them in more powder sugar (what some may consider an obscene amount of powdered sugar) and they came out much better. I may make these again now. Will try one with coffee and decide.HayleyJersey City, NJ12/17/2021I agree with the comments. These are more cake-like than cookie; I can't say that I  love them. I, too,  followed the recipe exactly (minus adding in the lavender). I feel like the lemon flavor also really doesn't come through  and they are just kind of bleh. Won't be making these again.HayleyJersey City, NJ12/17/2021Figured the best way to disperse and enhance the lavender flavor was to blitz it briefly, with a small amount of the sugar, in an electric spice grinder - I was right. Stopped just shy of completely pulverizing the buds, then proceeded with the recipe as written. Absolutely delicious cookies (and, duh, the batter flavor was also enchanting!!!) with a perfect level of lavender flavor. For what it's worth, I felt the flavor faded a bit after the first day (very possibly due to the age of my buds), and that still left a near-perfect cookie for anyone who loves a bright, subtle cookie. I'll make these again.kmidwest12/16/2021Meh.  Lavender was practically imperceptible.  At 15 min baking time texture was somewhere between cookie dough and muffin top (thanks other reviewer!)  - very unappealing. Last batch I let bake until edges turned brown —— that was 25 min in my oven. Barely redeemed them — and still lavender only barely came through — only knowing it was there.  Will not make these again. Weighed ingredients and chilled dough so don’t think it was user error.  Marmalade’s momBrooklyn ny11/26/2021I loved the texture, but there was way too much lavender here. Next time I’m going to cut it by half or maybe even 3/4. I also added hibiscus sugar to the rolling process. That was very nice. For a second batch I touched a single blueberry inside each fall and then put them back in the freezer for 10 minutes before rolling them in the sugar. That was also pretty good.GwyddiaPhiladelphia, PA10/31/2021These cookies are deliciously delicate. Almost cake-like in texture. Good lemon-lavender balance- not too overpowering. I kept them in the oven  until the edges were golden brown and they came out with soft fluffy tops and nice crisp bottoms. Perfect with milk or mixed into matcha ice cream. Will probably try the same recipe again  and experiment with different flavorings.Anonymous10/31/2021These are not good. I have made many a crinkle cookie (chocolate) and thought the idea of a lemon one sounded good. These just turn out like cake and not like a crinkle cookie. It was just a pan of muffin tops. Extremely disappointing and I won’t be making them again. I made no substitutions and did all measurements by weight.Anonymous10/23/2021Explore Bon AppétitDessertCookieBakeLemonCitrusFruitLavenderHerbs & SpicesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Cheryl Day"]}