{"id": "914b930b0cd17523de702b13537ae30b", "url": "https://www.bonappetit.com/story/summer-fruit-cocktails", "year": 2020.0, "month": 9.0, "day": 1.0, "content": "Summer’s Last Hurrah Calls For A Fruit Cocktail | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSummer’s Last Hurrah Calls For Fruit in All Your CocktailsWe’ve got three techniques for making the most of late-season peaches, berries, and melons.By MacKenzie Chung FeganSeptember 4, 2020FacebookTwitterEmailLaura MurrayFacebookTwitterEmailAnd just like that, it’s September.While it seems neither possible nor fair, summer is drawing to a close, and with it the brief period of time—at least, here in the Northeast—when berries, melons, and stone fruit are at their lushest, juiciest, and sweetest. It’ll be nothing but lumpy apples this fall for us (until citrus season), so we’re doing our best to include peak summer fruit in each and every meal. Cocktails are a meal, right?While you could just invert a bottle of vodka into a watermelon and call it a day, there are other ways to incorporate fruit into mixed drinks. We consulted cocktail experts T. Andrew Hunter, tasting room manager at One Eight Distilling in Washington, D.C., and Christina Basham, founder of Bubbles + Agave in Columbus, Ohio, on three techniques to let summer fruit shine: muddling, syrups, and shrubs.But first...are you Team Raw or Team Caramelized?Before picking your technique, decide if you’re starting with raw or cooked fruit. To capture the cleanest essence of summer, keep it raw. “Ripe fruits are fresh and bright, even tart if you’re using something like a plum,” says Basham, who recommends adding raw fruits to low-ABV patio-crushers and aperitifs so they won’t be overshadowed by aged high-proof spirits. Consider pairing a raw fruit shrub with a botanical gin or muddled raw fruit with a lighter fortified wine like Manzanilla sherry.This tequila, agave, and pineapple tepache highball will put you right on the beach.\nAlex LauHowever, if you want more complexity, roast your fruit or throw it on the grill. Heat will caramelize the sugars, introducing toffee notes that play well with brown spirits like bourbon and cognac. Grilling will also add a smoky dimension, a perfect complement to mezcal and scotch. “Caramelized fruits will give you those rich, deep sugar flavors,” Basham explains. “You’re probably not going to kick off your evening with a cocktail made with a grilled fruit syrup, but it’ll make a great nightcap.”Now pick your technique:Muddle ItThe technique: If you have a wooden spoon and 10 seconds, you can muddle. Muddling, which just means smooshing fruit in the bottom of a glass until its juices are released, is the easiest way to incorporate fruit into a cocktail, but your result will only be as good as your raw materials. While you can compensate for underripe or lackluster fruit in a syrup or a shrub, muddled fruit has nowhere to hide. So choose your produce wisely.Use it: Try muddling grilled pineapple with aged rum and coconut milk or juicy blackberries with mint, then top with vodka, lime, and ginger beer.Syrup ItThe technique: Infusing a sugar syrup with fruit is not only a way to add summer flavor to cocktails, but also an age-old method for extending the season. “The sugar in a syrup is a preserving agent, just like it is in jams and jellies,” Basham says. “If you're doing a classic 1-to-1 sugar-to-liquid ratio, that’ll last for 30 days in the fridge. But if you make a rich simple syrup, which has a 2-to-1 sugar-to-liquid ratio, you’ll get three months out of it.”There are a couple ways to turn your summer fruit into syrup:Simmer the fruit: The fastest way to make a fruit syrup is by throwing chopped-up fruit in a saucepan with sugar and water, cooking until the fruit infuses the syrup and then straining.Shower the fruit with sugar and let it sit in the fridge: But Hunter often prefers using a cold-process method to retain the brightness of the fruit—think of the difference in flavor between a roasted strawberry galette and a diner-style strawberry pie with a no-bake gelatin filling. “When you cook fruit,” he explains, “you get more stewed, vegetal, almost grassy flavors. So for something like watermelon, where I want that freshness to come through, I won’t apply heat.” Instead, he adds a cup of sugar to two cups of cubed watermelon and lets it macerate in the fridge for a couple of days. Then he purées the melon and its sugary juices, strains it, and combines it with premade simple syrup.Pro tip! Switch up your sweetener: Basham likes to layer additional flavors into her syrups by using different types of sweeteners. “Play around with brown sugar, raw sugar, maple, and honey,” she advises.Use it: Top fruit syrups with seltzer and something boozy, or use them in place of sweeteners in most highballs or classic cocktails. For a seasonal back-porch version of an old-fashioned, Basham “would absolutely do a basil and peach syrup—either raw or roasted—with a honey base.” Meanwhile, Hunter’s summer go-to is a watermelon syrup margarita garnished with a sprig of basil.Shrub ItThe technique: Shrubs combine the preservative powers of both sugar and acid to create a fruity drinking vinegar that will stretch through the fall. “Late-season peaches are perfect for shrubbing,”—Hunter says. “And since that shrub will last me deep into November, I’ll pair them with autumnal flavors—cinnamon, clove, apple cider vinegar.”Summer fruit is made for shrubbing.\nPhoto by Michelle HeimermanTo make a shrub, macerate fruit with sugar, then add your vinegar of choice. A plum shrub would sub in nicely for the hibiscus in this low-ABV vermouth cocktail or, Hunter suggests, as a replacement for the citrus and simple syrup in a New York sour. “But free yourself up to experiment,” he urges. “Don’t use the perfect expensive fruit. These are old techniques born of the need to preserve produce that’s on the brink of going bad. The bruised fruit that’s left over at the end of the farmers market—that’s what you want. It won’t cost you an arm and a leg so you can play around and experiment.”Use it: Basham agrees that a shrub is a September peach’s highest calling. “Especially as they get overripe, all that liquid is ready to leach out of the fruit,” she enthuses. She likes using shrubs in highballs with vodka, gin, or blanco tequila. “They act as both a sweetener and an acid, so you don’t have to add citrus.”Explore Bon AppétitFruitCocktailSummerRead Morecooking4 Easy Tequila (and Mezcal!) Cocktails, No Margarita Mix in SightBy Al CullitonrecipesJust Add Soda: 11 Highball Cocktails to Drink All SummerGallery11 SlidesBy Bon AppétitMargaritaculture24 Classic Cocktails You Need to Know How to MakeGallery24 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-04", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}