{"id": "9154ee7f40f65fa5c9706465cea8ca65", "url": "https://www.bonappetit.com/recipe/salad-pizza", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Salad Pizza Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSalad PizzaBy Jenny RosenstrachJanuary 9, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintWe swapped the red sauce for crisp lettuce tossed in a bracing dressing—and we’re into it. Let the dough sit out for 20-30 minutes, which will make it easier to handle and stretch. We highly recommend making a double batch of pickled onions to layer in sandwiches, salads, and tacos that need a pick-me-up.Ingredients4 servings 1pound store-bought pizza dough, room temperature3tablespoons plus ⅓ cup extra-virgin olive oil3garlic cloves, finely gratedKosher salt, freshly ground pepper1large head of Bibb lettuce, leaves separated and torn4ounces Gorgonzola, crumbled (about 1½ cups)¼cup pickled red onion3tablespoons sliced chives4ounces thinly sliced prosciutto, but any good thinly sliced ham will be delicious here2tablespoons red wine vinegar1teaspoon sugarPreparationStep 1Preheat oven to 475°. Place dough on a rimmed baking sheet and drizzle with 1 Tbsp. oil; turn to coat. Stretch dough outward with your hands until it covers the entire sheet (it should be thin, which is what you want). If dough springs back, let it rest a few minutes to relax before stretching again.Step 2Mix garlic and 2 Tbsp. oil in a small bowl. Drizzle over dough, using your hands to spread across entire surface; season with salt and pepper. Bake dough, rotating baking sheet once, until golden, puffed, and crisp all over, 10–12 minutes. Let cool slightly (so lettuce won’t wilt).Step 3Toss lettuce, Gorgonzola, pickled onion, and chives in a large bowl; season with salt and pepper. Whisk vinegar and sugar in another small bowl, then, whisking constantly, gradually stream in remaining ⅓ cup oil. Pour dressing over salad and toss to coat.Step 4Arrange salad on top of pizza crust and drape prosciutto over. Slice pizza into squares.How would you rate Salad Pizza?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleA delicious go-to as is, but certainly easy to modify. I add avocado when I'm feeling luxurious and often switch up the cheese. The pickled onions really make this recipe.KimiyoLos Angeles11/19/2020We have made this recipe many times now, and it’s a favorite in our house. We always look forward to salad pizza night. Sure, is the commenter who refuses to call this a pizza technically correct? Maybe, but are they technically also refusing to allow more joy into their life? I think so. The salad component in this recipe is so delightful that we make it on its own, as well. My only advice is to be conservative when you start pouring the dressing: we always find that the recipe makes more than is needed.mloefflerSeattle5/6/2020isn't this just flatbread with salad on top?  when i make it -- which i intend to do -- i'll call it flatbread with salad.  it's NOT pizza.  get a grip.hollis5Vero Beach, FL2/8/2019this pizza is sosososo good, it's pretty much the only thing I ever want to eat again. I'm going to keep pizza crust readily available from now on just so I can put all my salads on it. Also - that gif of the pizza being stretched out on the pan is a helpful visual reference, but word of advice: doesn't work the same on a pizza stone. My dough kept breaking apart til I switched it to a sheet pan. Perfect!zoegharrisonGreenville, SC1/11/2018Explore Bon AppétitPizzaLettuceLeafy GreensVegetableGorgonzolaBlue CheeseCheeseProsciuttoHamMeatRed OnionOnionQuickEasySheet-Pan DinnersWeeknight MealsMainNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Jenny Rosenstrach"]}