{"id": "915682f9a2dde4f275ad3f063d4d4cf7", "url": "https://www.bonappetit.com/story/cookie-scoop", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "The Best Cookie Scoop (2021) for Perfect Cookies, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Cookie Scoop for Perfect Cookies, Every TimeThere's no fighting over the “best” cookie when they’re all identical.By Alyse WhitneyDecember 8, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My first purchase with my HomeGoods employee discount was a cookie scoop. It was the early 2000s, and I had been watching Ina Garten make chocolate chunk cookies on Barefoot Contessa, admiring the precise, equal-size dollops she dropped across the baking sheet. And so, browsing through baking gadgets during my lunch break, I bought a scoop as close to a 1¾\" diameter as I could find (following Ina’s very specific instructions). I went home with my shiny new Oxo Good Grips Medium Cookie Scoop and immediately started making dough. Since that fateful day I’ve used it to bake countless batches of consistent meticulously shaped cookies and each time I wonder how I ever managed without one. This is all to say, if you bake cookies even twice a year, you need a cookie scoop in your arsenal.Why do I need a cookie scoop?The biggest benefit of using a cookie scoop instead of any ol’ spoon (or your hands) to transfer cookie dough from the mixing bowl to the cookie sheet is also the most obvious: It creates consistency—the exact same size, shape, and diameter—among each cookie. While having uniform cookies makes for an attractive, professional-looking final presentation, Garten preaches that it also ensures that the cookies bake evenly, and thus, taste perfect too. Plus, using a scoop will keep your hands clean and speed up the shaping process. I’m not sure how many different ways I can say this, but if you’re wondering if this kitchen tool is worth it, it is.What size cookie scoop should I get?The cookie scoop size you should use depends on a few factors, like how much the cookie dough you’re working with will spread and the desired sizes of cookie you’d like to gobble. You’ll often find cookie scoops ranging from #70 (which dispenses about 2 tsp. of dough) to #30 (2 Tbsp.). Since a cookie dough scoop is essentially an ice cream scoop, the numbers correspond to the number of scoops you can get from a quart of ice cream—so the higher the number, the smaller the scoop. For most cookie recipes we recommend using a #30 or #40 scoop, which holds about 1½ Tbsp. of dough. To make a slightly larger cookie—like our favorite chocolate chip cookies ever—we recommend using a #20, which holds about 3 Tbsp. of dough.Less time portioning means more time decorating\nPhotograph by Emma Fishman, food styling by Pearl JonesWhat’s the best cookie scoop money can buy?The Oxo medium stainless-steel cookie scoop, which is a #40, will cover the broadest number of cookie recipes, making it one of the most usable sizes (and a nice gift for bakers). It’s my Platonic ideal of a scooper, thanks to its built-in easy-release wiper—a reliable mechanism that glides across the scoop’s “bowl” and dispenses the dough in a nonstick fashion. Thanks to this little helper, I can get close to a dozen cookies onto a Silpat or parchment-lined baking sheet in two minutes flat, which means I’m that much closer to eating my brown butter and toffee chocolate chip cookies. It’s made with heavy-duty stainless steel and has a nonslip spring-loaded handle. Its soft grip and ergonomic design prevents my hand from cramping whenever I bake big batches of cookies for the holidays, and I love that it is dishwasher-safe.Medium #40 Cookie Scoop$16 at AmazonBut why stop at one?After that first cookie scoop entered my life, I couldn’t wait to get the same one in different sizes. This Oxo set comes with all three sizes that I have now—small, medium, and large—and each piece is equipped with the same high-quality stainless steel, heavy-duty spring action, and comfortable grip that I love. So go ahead, treat yourself! You deserve more than the best cookie scoop—you deserve three of the best cookie scoops on the market.OXO Good Grips Cookie Scoop 3-Pack$48 $40 at Amazon$48 at Food52What else can I use my cookie scoop for?These scoops make portioning cookies a breeze, but ever since I got a set I’ve found so many other uses for them. My large cookie scoop (#20, 3 Tbsp. capacity) is the perfect size for scooping muffin and cupcake batter into tins or scooping ice cream for sundaes. My small cookie scoop (#70, 2 tsp. capacity) is ideal for removing the insides of Russets for twice-baked potatoes or making cute little melon balls for fruit salad. And my medium-size scoop (#40, 1½ Tbsp. capacity), my first love, forms impeccable weeknight meatballs—in addition to loads and loads of perfect cookies. Ina would be proud.This article was written in 2018 by Alyse Whitney and updated in 2021 by Tiffany Hopkins.Explore Bon AppétitShoppingToolsRead Morerecipes47 Easy Cookie Recipes You’ll Make on RepeatGallery47 SlidesBy Alyse Whitneyrecipes99 Christmas Cookies to Fire up the Festive SpiritGallery99 SlidesBy Mehreen KarimcookingMy KitchenAid Hand Mixer Is the Most-Used Appliance in My Kitchen, PeriodBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-14", "author": ["Condé Nast", "Alyse Whitney"]}