{"id": "9160e5c8d4ac906f90c4dec45bbf8342", "url": "https://www.bonappetit.com/story/garlic-broth-save-us", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Help Me, Garlic Broth, You're My Only Hope | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHelp Me, Garlic Broth, You're My Only HopeThe recipe we're all making right now (because germs) and more food news from the week.By Alex BeggsOctober 20, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA office, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Hit me with that garlic brothAw man, everyone is getting SICK. Stay home! One of the first stories I wrote for BA was about what opera singers do to prevent colds and sore throats, and I’ve been making lemon-honey-ginger tea and warbling like a stray cat in my shower ever since. I brewed pot after pot this week, hoping to ward off the germs. To really double down on cold prevention™, I also made a batch of Chris Morocco’s garlic broth in my Instant Pot, which is sort of a silly thing to do because it takes just as long to make as it does on the stove when you factor in pressurizing time. But it seemed like a good idea at the time. I added a Fresno chile, ginger, and then whisked some egg in, stracciatella-style. Staffers Emily Schultz and Sasha Levine also made the same recipe this week. Emily doctored hers up by adding in a slurry of miso + water, ginger, scallions, spinach, and udon. Sasha drank hers with tons of flaky salt. Whether or not we’ll be able to defeat the common cold has yet to be determined. Vampires on the other hand, we haven’t seen them around these parts for days.Want this letter before it hits the website? Sign up for our newsletter!Zach Hilty/BFA.com“Do you see the unicyclist?”That was Ryan Walker, assistant to editor in chief Adam Rapoport, giving directions to the Hot 10 Party this week, smack in the middle of Brooklyn. Inside, a crowd of 1,200 (I didn’t count) ate bites from all of this year’s winning restaurants, as well as some returning alumni like Chef’s Table star Cristina Martinez of South Philly Barbacoa. Contributing writer Priya Krishna overheard a partygoer say: “I went to Pilates before this—it better be worth it.” I hope it was, Pilates lady!! Molly Baz was confronted by strangers skipping any introduction, demanding to know: “Where’s Brad?” At home with his babies! Someone asked Alex Delany if he was Alex Delany. Yes, yes he is. “Well I’m Nick Delany,” he continued, “and my brother’s name is also Alex Delany, and he HATES you!” So we’d like to take this moment to apologize to artist Alex Delany, who wants nothing to do with Bon Appétit, which is totally understandable. Sorry Mr. Delany!THE FOOD. I beelined for Maydan’s melt-off-the-bone lamb shoulder on a creamy tahini sauce with a puffy soft triangle of pita. The very long line for Yume Ga Arukara’s udon was worth every minute. Nyum Bai’s prahok ktiss filled the room with the scent of fish sauce and pork, which made me happy as much as it amazed me—how much flavor was packed into a bite that fit in the palm of my hand! I spotted Christina Chaey pop a perfect cylinder of Nonesuch’s seared daikon into her mouth like it was a peanut M&M.Zach Hilty/BFA.comIn the courtyard where Elske’s David and Anna Posey were scooping apple cider shaved ice while others huddled under heat lamps, I ran into Andrew Knowlton—old deputy editor, new Netflix star—wearing a Beto for Texas shirt. He said he only reads this newsletter instead of the magazine. So this is a test to see if he’s really reading. TESTING, TESTING. (If you want to see Knowlton as a reality TV host where everything in the world, plus some food, seems to be at stake, watch the trailer for his new show, The Final Table, here. We’re planning a drinking game for it already. Gotta support the team.)THAT’S THE LAST PLUG I’LL DO FOR YOU, KNOWLTON!The hangover“I’ve been trying to get a Bloody Mary all day.” “I want an enormous Bloody.” “I want aioli.” “I’m making CACIO E PEPE for dinner.” “I want a boat of French fries.” “I want a big Italian sando.” These are just a few of the notes I took when staffers with faded after-party stamps still on their hands trickled into the office, groaning. For those of us who skipped the after-party, preferring sleep and solitude, we apparently missed a drag queen who makes fantastic babinka based on her grandmother’s recipe, obscene scoopfuls of caviar, and Pet-Nat in branded solo cups. Sounds about right.The bagel emojihas been updated. Apple designers added some jiggly-looking cream cheese to placate the angry hoards. Still oddly unappetizing, but maybe that’s because the bagel’s dimpled texture reminds me of parts of my body better left unmentioned.ARE YOU READYFor THANKSGIVING? Our November issue hit newsstands in NY/LA this week (nationwide next week). And it debuts a squeaky clean redesign by creative director Michele Outland, who talked to The Cut about how she gets it done, my favorite series to read when I’m not getting much else done. Speaking of knowing when to not get it done, I’ve been thinking about this part of Michele’s routine all week: “One rule I definitely do is when I open my eyes in bed, I do not check my emails, because I’m trying to be relaxed and enter the day peacefully.”Photo by Christina ChaeyOverheard in the office“I’m just not a yeast girl,” Christina Chaey lamented, while we ate her slightly dense (due to old, possibly DEAD, yeast) rendition of Claire’s apple coffee cake. It was still amazing. The thinly sliced apple topping is divine—especially with lemon-ginger tea.Food meme of the weekUnnecessary food feud of the weekWhat appetizers does a cocktail party need? The test kitchen argued over what to serve to our Hot 10 chefs at a gathering in the office on Tuesday. Molly ended up making kimchi dip, artichoke dip (yes we already bothered her for the recipe), and nutritional yeasty popcorn. But for some reason Chris Morocco wanted larb. He even ordered the ground pork for it! “Was I supposed to make it?” Molly wondered when Chris SHOWED UP TO THE PARTY THREE HOURS LATE. “Chris has this ability to put a spell on us,” Andy Baraghani explained, “As a witch, I’m impressed.” So to mess with him, the food team Slack group chat pretended to be inundated with work while Chris was out shooting a Christmas cookie story, begging him to return to help them cook for the crowd.CHRIS RESPONDS: “I was punked so bad! Instead of seeing some of the best chefs in the country commenting on our brave and visionary inclusion of larb with the other appetizers, I saw bricks of raw meat stacked in the walk-in and bottles of natural wine being drunk like hipster Gatorade, while I was carting Alex Lau’s computer across town.” Excuses, excuses!Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-20", "author": ["Condé Nast", "Alex Beggs"]}