{"id": "91682895f049aebf4cf1f08dd34a9e70", "url": "https://www.bonappetit.com/recipe/seared-shrimp-with-kare-kare-butter", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Seared Shrimp With Kare-Kare Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueSeared Shrimp With Kare-Kare ButterBy Harold VillarosaAugust 10, 20214.6(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintEvery Filipinx family has their own take on kare-kare, but they generally include peanut butter, achiote (annatto) seed, and often a fermented shrimp paste called bagoong for extra flavor in the stew. Old-school Filipinx cooks make the sauce for it from scratch, but you can find powdered or jarred versions, the best of which is Fila Manila Kare-Kare. It’s the star of this dish, where it cooks down with garlic, thyme, chicken broth, butter, lemon juice, and hot sauce into a glossy sauce for seared shrimp. This peanut-y sauce is perfect with virtually any shellfish—try it with head-on prawns or lobster if you want to go all in. —Harold VillarosaAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonCitrus Juicer$7 At AmazonWhisk$10 At AmazonIngredients4 Servings1lb. large shrimp, peeled,deveined, patted dryKosher salt, freshly ground pepper3Tbsp. grapeseed or vegetable oil, divided3garlic cloves, thinly sliced1tsp. finely chopped thyme¼cup low-sodium chicken broth or water¼cup store-bought kare-kare sauce (preferably Fila Manila)12Tbsp. (1½ sticks) unsalted butter, cut into pieces2tsp. hot sauce1tsp. fresh lemon juiceSliced chives and lemon wedges (for serving)PreparationStep 1Season shrimp on both sides with salt and pepper. Heat 2 Tbsp. oil in a large skillet over medium-high. Cook shrimp until bright pink and just cooked through, about 2 minutes per side. Transfer shrimp to a platter and wipe out skillet (any browned bits left in the pan are okay).Step 2Cook garlic and thyme in same skillet over medium-low heat, stirring constantly, just until fragrant, about 30 seconds. Pour in broth, scraping up any browned bits stuck to bottom of skillet, then add kare-kare sauce and whisk until smooth. Add butter a piece at a time, whisking constantly and incorporating completely before adding the next piece. Once all of the butter has been incorporated, whisk in hot sauce and lemon juice. Taste kare-kare butter and season with salt and pepper.Step 3Spoon kare-kare butter over shrimp and top with chives. Serve with lemon wedges for squeezing over.How would you rate Seared Shrimp With Kare-Kare Butter?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleReally powerful flavourful sauce. Makes loads and freezes well - I serve with fluffy jasmine rice, spring onions (scallions) fish-sauce-pickled cucumbers and chilli and some quickly tossed up samphire to make a proper week-day meal. Works really well with Fried tofu too! HarrietBristol, UK10/25/2021Explore Bon AppétitStewSoups and StewsFilipinoSoutheast AsianAsianShrimpShellfishSeafoodQuickEasyWeeknight MealsOne-Pot MealsMainGluten-FreeSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Harold Villarosa"]}