{"id": "9169df96253e7e57dce17b993a82d948", "url": "https://www.bonappetit.com/story/pretzel-focaccia-superbowl-spread", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Make Pretzel Focaccia, Buy Good Sausages, Win the Super Bowl | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Pretzel Focaccia, Buy Good Sausages, Win the Super BowlEven the easiest homemade bread will make a store-bought spread sing.By Amiel StanekJanuary 27, 2020FacebookTwitterEmailPhoto by Laura Murray, Food styling by Yekaterina Boystova, prop styling by Allie WistFacebookTwitterEmailBon Appétit editor at large Amiel Stanek has spent years trying to help readers get dinner on the table as quickly and efficiently as possible. So when he gets to cook for himself, he likes to slow things down and be a little...extra. This is Not So Fast, a column dedicated to his favorite ingredient: time.I hate football; I love the Super Bowl. I’ll spare you the reasons why the former is the case, and the reasons for the latter should be fairly obvious (see: fried food, drink, revelry). My semi-annual Super Bowl party reflects this dichotomy fairly neatly. I will spend days plotting out my dip strategy, or perfecting my wing sauce, and forget about the logistics of screening the Big Game entirely. Come kick off, some friend will be burdened with the unenviable task of finding the requisite begged, borrowed, or stolen login information and figuring out how to put the damn thing on. (I do not own a TV.)This year, to mark the occasion, I’ve decided to throw a good old fashioned Sausage Party. (A little on the nose—I know, I know.) Since we’ve moved to Upstate New York, I’ve become completely infatuated with Smoke House of the Catskills, an incredible, old-school Germanic butcher shop that makes some of the most unbelievable ‘wursts I’ve ever tasted. Juicy bratwurst. Snappy knackwurst. Delicately-spiced “Munich Grillers.” I’m going to let these sausages do the heavy lifting, seared and sliced and supported by all manner of pickles, sauerkraut, and sauces. In theory, I’m all for a party spread that celebrates good sourcing over laborious cooking; but in reality, I have to make something otherwise I feel like I’m cheating. And that something is going to be Pretzel Focaccia.Hands down, the best play of the game.\nPhoto by Laura Murray, Food styling by Yekaterina BoystovaOf all of the breads that a home cook can make, focaccia has by far the best ease-to-wow-factor ratio. You don’t need a sourdough starter. You don’t need a stand mixer. You don’t need a spreadsheet populated with percentages and weights. All you need is a standard sheet pan, an oven, and a little bit of time. It’s a fantastic party trick: You mix the dough the day before you want to bake it, let it ferment overnight in the fridge (which is key to developing the flavors of the flour; this step cannot be skipped), spread it out into a pan to proof for an hour or so and bake it up to crispy, crunchy, pillowy perfection. And let me tell you: People freak out for hot, homemade bread.My recipe is loosely based on the recipe used at Saltie, Williamsburg’s greatest (and most greatly missed, R.I.P.) sandwich shop. It’s simple, straightforward, and always over-delivers. But a few small innovations make it “pretzel,” and therefore a perfect pairing for all manner of Central and Eastern European encased meat products. First, instead of coating the sheet pan generously with olive oil, it gets rubbed down with plenty of butter and then further gilded with vegetable oil, producing a bottom crust that is appealingly browned without olive oil’s telltale grassy twang. (Plus: butter!) And then the dough gets brushed both before and after proofing with a mixture of hot water and baking soda which alkalizes it, producing a burnished, pretzel-esque crust and signature bitterness. (In the case of most commercially produced pretzels, that effect is achieved with lye, but I’m frankly terrified of that stuff.)The result is a crispy-chewy, salty, deeply-browned pan heaven that tastes like Big Effort with truly minimal work. How you work the pretzel focaccia into your sausage spread is entirely up to you. I’m planning on dividing it into narrow rectangles which can be sliced open part of the way to serve as hot dog-ish buns, but cut squares can also facilitate slices of sausage for a more sandwich-like effect. Either way, load them up with plenty of ‘kraut, slivers of pickle, and generous amounts of grainy mustard and mayo, eat, and repeat until the halftime show is over. I mean, that’s what we’re all watching for anyway, right?Get the recipe:Pretzel FocacciaOne of the easiest breads to make at home gets pretzel-ified with a highly burnished, salt-coated crust and a delightfully bitter twang. View RecipeExplore Bon AppétitSuper BowlNot So FastSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-27", "author": ["Condé Nast", "Amiel Stanek"]}