{"id": "91889c02c6aa6e760f6b9384c8405fe7", "url": "https://www.bonappetit.com/story/vegetarian-reuben", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "A Vegetarian Reuben That Turns My Kitchen Into the Diner of My Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Vegetarian Reuben That Turns My Kitchen Into the Diner of My DreamsBecause I'm not always in the mood for a six-inch stack of meat.By Amanda ShapiroMarch 19, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailEveryone needs a go-to diner order, and mine's a Reuben. Okay, fine, it's also a Cobb salad, but that's only because I'm not always hungry enough to eat a six-inch stack of meat. In my opinion, the best parts of the Reuben are everything but the corned beef: sharp, salty sauerkraut, creamy, tangy Russian dressing, hearty rye bread, and, of course, lots of melted Swiss cheese. This vegetarian Reuben recipe agrees with me, and it indulges my healthyish desire to sneak greens into otherwise decadent dishes whenever I can get away with it.Chris Morocco, who tackles all my half-baked recipe ideas with aplomb, decided to use kale in place of the meat, but any sturdy green is fair game. The greens get lightly sautéed with garlic then mixed with sauerkraut and Morocco's shockingly delicious take on Russian dressing, which is just full-fat Greek yogurt and hot sauce. The kale mixture goes on your bread of choice (no, you don't have to go with rye) with a couple slices of Swiss, and, well, you know how to make grilled cheese—just be sure to butter the outsides of the bread first so your sandwiches can achieve melty, toasty perfection.Maybe someday I'll be able to order a Reuben like this at my local diner (Gee Whiz, I see you!). Until then, I'll make my Reubens at home and order the Cobb salad, please.Kale ReubenSkipping the corned beef in a cooked greens-packed Reuben shouldn’t feel (or taste) like a bummer. Happy to say this one doesn’t.View RecipeExplore Bon AppétitHealthyishKaleSandwichDinersGreek YogurtSauerkrautRead MorecookingYour Tuna Sandwich Has Been Waiting Its Whole Life For Green Goddess DressingBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Amanda Shapiro"]}