{"id": "9197fbdb1ea08c94a13eba1b61400220", "url": "https://www.bonappetit.com/story/its-that-simple-better-butter", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "The Spreadable, Craveable Butter I Make in a Food Processor and Eat on Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Spreadable, Craveable Butter I Make in a Food Processor and Eat on EverythingBetter Butter may or may not be healthier, but it's the only butter I want to eat.By Amanda ShapiroMarch 21, 2019FacebookTwitterEmailTED+CHELSEA CAVANAUGHFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.My grandmother wasn't the cookie-baking type. A stay-at-home mom, she'd decided, at 50, to get a Masters in Nutrition and become a registered dietitian. By the time I was born, she'd earned a family nickname: The Health Police. When we'd visit her and my grandfather, our diets were ascetic: Wasa crackers, steel-cut oatmeal, low-fat cheese, vegetable soups. But there was one decadent thing in my grandmother's kitchen that I'd crave by the spoonful, and that was Better Butter.Better Butter was, at least in my grandmother's mind, a health food. This was the early '80s, mind you: Butter was bad; oil was good. She'd found the recipe in a vegetarian cookbook called Laurel's Kitchen, which I inherited after she died last year. The recipe calls for equal parts room-temp butter and canola oil blitzed in a food processor then chilled. (My grandmother, who was way ahead of her time, used olive oil instead of canola.) Because of the oil, it was always miraculously spreadable and delicious, even straight out of the fridge. I'd melt it onto my warm whole-wheat toast and spread it thickly on my Wasa crackers, and suddenly eating at my grandmother's house wasn't so bad, after all.My mom, who was much looser when it came to our eating habits, saw how much I loved Better Butter and started making it herself. It became the thing we'd spread on pillowy dinner rolls and Swedish pancakes and baked potatoes. I never thought of it as \"healthy.\" And because it was so creamy and good, I probably ate twice as much as I would eat of regular butter anyway.In my adult mind, Better Butter was a childhood food, something I left behind when I went to college—a treat I would enjoy while visiting my parents or grandparents. It never occurred to me to make my own Better Butter until I'd been living on my own for close to a decade. I think what happened was that I started buying good bread for the first time—yeasty, porous sourdough and crusty, crackly miche—but the butter I ate on it always disappointed me, even the wide planks of \"European-style\" butter and the tangy cultured stuff. I wanted something specific. And that something was Better Butter.Extra-virgin olive oil or bust.\nSo I started making Better Butter at home with my own, slightly adapted recipe. While my mom uses \"light-tasting\" Bertolli olive oil, I use extra virgin. (Sometimes I cut it with some canola oil so the taste isn't too olive-y.) I use unsalted butter but add a liberal teaspoon of kosher salt for every cup of Better Butter. You're most likely to see me spreading it on sourdough, sweet potatoes, or homemade muffins, but I've also used it for light sautéeing and in baked goods that call for oil like quickbreads (though I wouldn't use it as a butter replacement in anything that requires flakiness like pastries or biscuits). Once you've got the ingredients in the food processor, it's also easy to add flavorings to your Better Butter if you're into that kind of thing. I've added a couple tablespoons of miso, a quarter cup of dill, or a few teaspoons of garlic powder, all to delicious effect.When people see me pull my Tupperware of Better Butter out of the fridge now, they always ask about it, and when I tell them it's homemade butter, they think I'm crazy until I explain how simple it is to make. \"Oh, so it's healthier butter,\" they say. \"I don't know,\" I tell them. \"It's...just better.\"Spread some Better Butter on a flatbread, why dontcha?This Pizza Dough Flatbread Recipe Can Be Whatever You Need It to BeStore-bough pizza dough and a 15-minute cook time? We'll be right there.View StoryExplore Bon AppétitIt's That SimpleBasicallyButterOlive OilRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-21", "author": ["Condé Nast", "Amanda Shapiro"]}