{"id": "91acbd41d80b0f970526b55e45df806c", "url": "https://www.bonappetit.com/recipe/put-it-on-everything-cashew-sauce-vegan", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Put-It-On-Everything Cashew Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPut-It-On-Everything Cashew SauceBy Lauren SchaeferApril 26, 20184.8(14)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThis rich, creamy vegan(!) sauce is your new all-purpose condiment. Packed with herbs, it's a no-brainer for a seasonal veggies-and-dip situation, but can easily be dressed up to suit any occasion. Swap the herbs and vinegar for lime juice and zest and you've got a perfect taco-topper. Add some chipotles in adobo to make a spicy, smoky bottom-of-the-plate schmear for roasted veggies. Or spike it with some grated garlic and thin it with lemon juice for a killer dairy-free ranch dressing.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketTea Kettle$34 At AmazonMedium Bowl$17 At AmazonPlate$55 At Bon Appétit MarketSieve$18 At AmazonBlender$32 At AmazonSpatula$12.99 At AmazonPlatter$29 At AmazonIngredientsMakes about 2 cups2cups raw cashews1cup mixed tender herbs, such as parsley, cilantro, dill, and/or basil2Tbsp. unseasoned rice or distilled white vinegar1Tbsp. kosher saltCrudités, such as radicchio, carrots, radishes, and batons of bread (for serving)PreparationStep 1Bring 2 cups water to a boil in a tea kettle or small saucepan. Place 2 cups cashews in a medium heatproof bowl and cover with boiling water. Cover bowl with a plate or plastic wrap and let sit 10 minutes.Step 2Strain cashews through a fine-mesh sieve into another medium bowl, reserving soaking liquid.Step 3Transfer nuts to blender, then add 1 cup herbs, 2 Tbsp. vinegar, 1 Tbsp. salt, and half of soaking liquid.Step 4Blend on medium speed, scraping down sides with a spatula and adding more soaking liquid as needed, until cashew cream is very smooth and the consistency of yogurt, 1–2 minutes.Step 5Using spatula, transfer cashew cream to a medium bowl. Serve with crudités alongside.How would you rate Put-It-On-Everything Cashew Sauce?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI didn’t feel like the flavor of the herbs came across strong enough with the recipe as written. I used parsley and dill. I ended up adding more herbs, plus garlic, lemon juice and zest, more vinegar, and a touch more salt. I’d make this again but maybe with cilantro or something with a stronger flavor so that it can cut the creaminess of the cashews. BUT, with some nice spicy radishes, I enjoyed this all the same. yagurlcarlyTucson, Arizona7/3/2020Love this! How long does it keep in the fridge?jordanreyn0ldsAtlanta4/18/2020I have been making this recipe intuitively for about a year now, tweaking a few ingredients here and there. It’s so pleasing and versatile. Adding more water to produce a sauce for drizzling, or less so you can have a thicker, viscous spread. Replacing the herbs with carrots, ginger, and a tad of cumin provides some fun variety. I’ll have to try the cashew soaking step next time! AnonymousArcata, CA1/22/2020I don't even soak the cahsews.  Roasted cashews make a delicious sauce.  Also lots of garlic.  Yup.  AnonymousNYC5/9/2019I love this! I make it all the time and everyone who has tried it loves it. I’ve used cilantro and Italian parsley so far. The tablespoon of salt is perfect I think as long as you use kosher salt. AnonymousSeattle 1/6/2019Don't use the soaking liquid!! It contains enzyme inhibitors and phytic acid that you're trying to get rid of by soaking. AnonymousLos Angeles5/15/2018I NEVER write reviews, but this is AMAZING!!! I do want to use it on everything.  I just did the Whole30 and am adding this recipe as a staple for my diet.  I used flat leaf parsley, dill, and chives.  Incredible.  AnonymousBlacksburg, VA5/4/2018Really tasty! I used parsley, and chives and ramps from my garden. I decreased the salt to 1tsp. but might add a bit more. I’m glad I bought enough raw cashews for a batch in the future. Giving it 5 stars for taste, inventiveness, versatility, and ease of preparation. Shannon DVancouver, WA5/2/2018Loved this! I used a mix of cilantro, chives and flat parsley. I started with a pinch of salt and it needed two, glad I didn’t add the full TB that would have been too much. \nDelicious, will certainly make regularly since so many friends are dairy freettrockwoodNYC5/1/2018A tablespoon of salt I found was way too much. Unfortunately, no one could eat it! I think a teaspoon would have been sufficient. :)gowldenVancouver, BC, Canada4/28/2018Explore Bon AppétitSauceCondimentCruditéCashewNutEasyQuickStarterSnackDairy-FreeVeganVegetarianGluten-FreeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Lauren Schaefer"]}