{"id": "91bacd3cfd2e749906b16040496ade8b", "url": "https://www.bonappetit.com/recipe/big-batch-chicken-thighs-with-fennel-and-scallions", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Big Batch Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueBig Batch Chicken Thighs with Fennel and ScallionsBy Kat BoytsovaFebruary 12, 20194.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintUse a little extra time on a Sunday to make a meal with built-in leftovers and you’ll have the foundation for lunches during the week. Prep these thighs along with Chile-Garlic Cucumbers and Sesame-Scallion Sauce, and spin that into Chicken and Cucumber Rice Bowls and Greens-and-Beans Sandwiches for weekday lunches.Ingredients2 servings (plus leftovers) 8garlic cloves, finely grated1½tsp. crushed red pepper flakes2Tbsp. honey5Tbsp. grapeseed or vegetable oil, divided8skin-on, bone-in chicken thighs2½tsp. kosher salt, plus more3large fennel bulbs sliced into ¾\"-thick wedges (reserve stems and fronds for another use)8scallions, trimmed1lemon, halvedToasted sesame oil (for drizzling)PreparationStep 1Place racks in upper third and middle of oven; preheat to 425°. Whisk garlic, red pepper flakes, honey, and 2 Tbsp. grapeseed oil in a large bowl. Season chicken thighs with 2½ tsp. salt and toss to coat in marinade. Arrange, skin side up, on a parchment-lined rimmed baking sheet; let sit at room temperature while you prepare the vegetables.Step 2Toss fennel wedges and scallions with remaining 3 Tbsp. grapeseed oil on another rimmed baking sheet. Season with salt, then arrange in a single layer. Roast vegetables on top rack and chicken on middle rack, tossing vegetables halfway through, until vegetables are softened and chicken is browned and cooked through, 35–45 minutes.Step 3Divide scallions, two-thirds of the fennel, and 4 chicken thighs between plates. Drizzle with sesame oil and squeeze a lemon half over. Transfer remaining chicken thighs along with any juices from baking sheet to an airtight container; let cool, then cover and chill. Place remaining fennel and lemon half in a separate airtight container; let cool, then cover and chill.Step 4Do Ahead: Chicken and vegetables can be roasted 3 days ahead. Keep chilled.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouHow would you rate Big Batch Chicken Thighs with Fennel and Scallions?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWe love the chicken and fennel.  Leaving scallions in for 45 minutes is too long.  We will try 20 minutes next time.  Love the glaze that was on the chicken skin.Patrick ParmaPortland, OR2/27/2022Absolutely delicious! I’m a thigh & leg girl, my man loves breast and this recipe is easy and itf you are short on time, even delicious without all the extras! Rice, a salad & a dry vodka martini & we are happy as a clam! 💝🍸MimiWall, Nj3/22/2021This recipe comes together really easily and is so flavorful. Make it every other week now. Chicken DinnerLos Angeles, CA1/18/2021This chili-garlic sauce is f#ckng bomb! Esp with the lemon.ihatemuffinsWaco, TX5/24/2019Explore Bon AppétitChicken ThighChickenPoultryFennelVegetableScallionOnionEasySheet-Pan DinnersMainDairy-FreeGluten-FreeHealthyishRoastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}