{"id": "91cb15da5f3743a3e1368e4c99056cc2", "url": "https://www.bonappetit.com/story/tourists-hotel-north-adams-massachusetts", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Breakfast at Tourists Hotel, North Adams Turned Me Into a Morning Person | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Hotel Breakfast Turned Me Into a Morning PersonAt least for the weekend. And, okay, the gigantic camper coffee thermos helped too.By Aliza AbarbanelOctober 15, 2019FacebookTwitterEmailPhoto by Sidney BensimonFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m a semi-reformed insomniac who struggles to get out of bed before 8 a.m. (okay, 9). It probably goes without saying that breakfast is not my preferred meal. But when you’re spending the weekend at Tourists, a designy 48-room lodge in North Adams, Massachusetts, just half a mile away from the Appalachian Trail, something’s gotta give.So when I valiantly signed up for the hotel’s scheduled morning hike, I was surprised and delighted to find myself ordering exactly half of the carefully considered breakfast menu. There were chewy, nutty rye waffles topped with sweet ricotta and cherry compote. Highly aromatic sourdough cardamom buns lacquered with a deliciously sticky-sweet glaze. A fluffy seasonal vegetable frittata served with a tangle of greens. Also copious amounts of strong coffee poured from a steaming camper thermos. It was the perfect meal to get me over the dangling suspension bridge into the trees, and kept me going as I explored the rest of North Adams (MASS MoCA!) and all the casually New England vibes Brooklyners like me crave: dusty antique stores, well-stocked farm stands, and the hotel’s probably haunted farmhouse-turned-bar built in 1813.If it sounds like a lot to get through in one day, well, it was. Usually, my vacation days revolve around doing as little as I possibly can. And when I first woke up in the sleekly minimalist room, all I wanted to do was bundle up in a cozy robe and lounge on the pillowy indigo daybed. But once those rye waffles lured me out of bed, the rest of my day was transformed into a tour de force of weekend activities.Would I be a morning person every day if I lived at Tourists? I’m not convinced, but for the sake of science, I’m already planning a return trip.Go there: TouristsExplore Bon AppétitHighly RecommendMassachusettsHotelsRead MorerestaurantsThe New England Deli Two Bon Appétit Editors Can’t Stop Talking AboutBy Amanda Shapiro and Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Aliza Abarbanel"]}