{"id": "91cde49770bc93b2fd9dc1c3b929476c", "url": "https://www.bonappetit.com/recipe/pork-tenderloin-with-peach-mustard-sauce", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Pork Tenderloin with Peach-Mustard Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Pork Tenderloin with Peach-Mustard SauceBy Bryan FurmanMay 22, 20184.6(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Peden + Munk, food styling by Sue Li, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThe key with any tenderloin recipe is making sure the meat is not overcooked, which is when it gets dry. Find the peach-mustard sauce here. This recipe is from B's Cracklin' BBQ in Savannah, GA. Read more about pitmaster Bryan Furman here.Ingredients8 servings 2pork tenderloins (about 1 lb. each)4tsp. kosher salt1tsp. freshly cracked black pepperVegetable oil (for grill)½cup peach preserves, warmedPeach-Mustard Sauce (for serving)PreparationStep 1Sprinkle pork with salt and pepper and rub all over. Let sit at room temperature 1 hour. Meanwhile, prepare a grill for medium heat and brush grate with oil.Step 2Brush pork with some preserves. Grill, turning every 4 minutes or so and brushing with any remaining preserves, until charred on all sides and an instant-read thermometer inserted into the thickest part registers 130°, 10–12 minutes. Transfer to a cutting board and let rest 10 minutes. Slice ½\" thick.Step 3Serve sliced pork with Peach-Mustard Sauce alongside.How would you rate Grilled Pork Tenderloin with Peach-Mustard Sauce?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleReally good and easy recipe! I agree with the comment below about the temperature, I cooked it until 145 and it was still perfectly juicy. We didn't have any peach preserves on hand so I threw a couple of peaches in a pot with some brown sugar and cooked it down to a preserve-like consistency and it worked perfectly on the meat. Will definitely make this again. Asparagus is good with the mustard peach sauce, too. Chicago6/29/2020Umm, 130° for an internal temp on pork is 15° lower than the latest amendment lowering the safe temp for pork (now down to 145°) so I’m not sure what y’all are cooking, but I don’t think it should be pork loin at that temp! \nNevertheless, I made this recipe last night and cooked to a safe temp on the grill and it was still juicy and tasty, tho I used orange and elderflower marmalade since that’s what I had on hand and it was great. Also subbed mango for peaches for the sauce, delicious! \n\nThe 3 star review is for the safe temp error - y’all ought to know better! timespaceonePittsburgh7/30/2019Simple and easy to make. It is very delicious. I made mine with a potatoes and onions foil packet cooked on the grill.bergstrom.jeffreyRichmond Hill, GA5/28/2018Here we go again with another fantastic Bon Appetit recipe. I was sitting in the house on a Sunday bored with all of my weekly dinner ideas. I opened up my new Bon Appetit like usual and found no less that 5 new recipes. Tried this one immediately and wasn't let down. Juicy, flavorful and that was just cooked in the over, I'm dying to try this on the grill.AnonymousSanta Monica5/27/2018Explore Bon AppétitSouthernAmericanPork TenderloinPorkMeatPeachStone FruitFruitSummerEasyWeeknight MealsMainDairy-FreeGluten-FreeGrillingFourth Of JulyMemorial DayLabor DayJuneteenthDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Bryan Furman"]}