{"id": "91e24fa549d55e533a8f1e5d2331a6a4", "url": "https://www.bonappetit.com/recipe/spicy-pork-skewers", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Spicy Pork Skewers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueSpicy Pork SkewersBy Tom CunananMay 21, 20195.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThe marinade—a sweet, spicy, tangy mixture of chiles, garlic, Sprite, vinegar, and dried mushrooms—is so full of flavor, we don't want even one drop of it to go to waste. That's why we simmer the leftovers (in a pot on the grill!), then use it to baste the skewers as they cook. You can thank Tom Cunanan of Bad Saint in D.C. for this recipe.Ingredients8 servings2lb. skinless, boneless pork shoulder½small red onion, thinly sliced12red Thai chiles, coarsely chopped8garlic cloves, coarsely chopped1cup Sprite or 7UP½cup soy sauce⅓cup cane vinegar (such as Datu Puti) or unseasoned rice vinegar¼cup sugar1Tbsp. black peppercorns1Tbsp. kosher salt, plus more6dried shiitake mushroomsSpecial EquipmentA spice mill or mortar and pestle; twelve to sixteen 8\" metal skewers or soaked wooden chopsticks or bamboo skewersPreparationStep 1Freeze pork on a rimmed baking sheet until very firm around the edges, 45–60 minutes. Remove pork from freezer and slice as thinly as possible. Slice pieces lengthwise into 1\"–2\"-wide strips.Step 2Meanwhile, combine onion, chiles, garlic, Sprite, soy sauce, vinegar, sugar, peppercorns, and 1 Tbsp. salt in a large resealable plastic bag. Grind mushrooms in spice mill or with mortar and pestle to a powder; whisk into marinade. Add pork a few pieces at a time, coating well so they don’t stick together and can evenly absorb marinade. Cover and chill 6–8 hours.Step 3Prepare a grill for medium-high heat. Remove pork from marinade and thread onto skewers. Transfer marinade to a small saucepan and bring to a rolling boil on the grill. Cook 1 minute, skimming off any foam that rises to the surface. Move to a cooler part of the grill.Step 4Season pork lightly with salt and grill, undisturbed, until well browned, about 2 minutes. Turn and baste with marinade. Continue to grill, turning and basting every minute, until cooked through and browned all over, about 4 minutes longer.How would you rate Spicy Pork Skewers?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI would recommend using natural unadulterated cane (sukang iloko) or coconut (sukang tuba) vinegar\ncesnepomucenoPhilippines7/8/2019These were very good and pretty simple to make.  Similar to those chicken skewers you get at a Chinese buffet, but much fresher, brighter flavors.  I assumed we'd have leftovers, but these all got eaten in one sitting!AnonymousTexas7/1/2019I'd recommend soaking the skewers for a few hours prior to threading the pork, this is a traditional filipino bbq and the length of time it will take to get the pork cooked will render your sticks to charcoal.AnonymousOakland 6/7/2019Explore Bon AppétitSkewerFilipinoSoutheast AsianAsianPork ShoulderPorkMeatShiitake MushroomMushroomVegetableMainDairy-FreeGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}