{"id": "91e412c801aeb9266887d4f54a558242", "url": "https://www.bonappetit.com/recipe/vietnamese-braised-short-ribs", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Vietnamese Braised Short Ribs Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDVietnamese Braised Short RibsSponsored by Campbell'sFacebookPinterestTwitterEmail6 - 8 servingsActive Time: 45 minTotal Time: 225 minBraised in Swanson Beef Stock, get the global flavor of your favorite pho without leaving the comfort of home.PrintIngredients2 tablespoons safflower oil5 pounds short ribs, (about 12 pieces)Kosher salt and freshly ground pepper9 garlic cloves, lightly crushed and peeled1 large vidalia onion, coarsely chopped, (12 ounces)4 cups Swanson Beef Stock2 cups red wine, like cabernet sauvignon3/4 cup unseasoned rice wine vinegar1/3 cup honey5 whole star anise1 cinnamon stick3 whole cloves2 ounces fresh ginger, sliced, (about 4 inches)2 tsp. fish sauce2 carrots, peeled into ribbons, (about 2 cups)4 radishes, very thinly sliced, (about 1 cup)2 teaspoons sugarSteamed jasmine rice, for servingRecipe PreparationPreheat oven to 325. In a large dutch oven, heat oil over medium-high. Season short ribs with salt and pepper and cook in batches until golden brown, 3 to 4 minutes per side. Transfer ribs to a plate and leave oil in pot.Reduce heat to medium. Add garlic and onion and cook, stirring frequently, until golden, about 10 minutes. Pour broth, wine, vinegar, and honey into pot and add star anise, cinnamon, clove, and ginger. Stir to combine.Meanwhile, toss carrots and radish with vinegar and sugar. Season with salt. Refrigerate.Return meat to pot. Cover, and transfer to oven. Cook until ribs are fork tender, about 3 hours.Using tongs or a slotted spoon, transfer short ribs to a plate. Set a fine sieve over a medium bowl and strain sauce. Skim fat from top; discard. Pour sauce back into pot and place over medium. Cook until the sauce thickens, about 10 minutes. Return ribs to sauce to coat.Add cilantro to carrot salad and serve with short ribs and rice.Sponsored by Campbell'sGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}