{"id": "91ead968ac1b6891c6ba8d319f177c72", "url": "https://www.bonappetit.com/story/lurisia-chinotto-soda", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Chinotto Is The Non-Alcoholic Drink I Pour Myself When All My Friends Are Tipsy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Non-Alcoholic Drink I Pour Myself When All My Friends Are TipsyIt’s like the best cream soda.By Sarah JampelNovember 7, 2019FacebookTwitterEmailPhoto by Laura Murray, food styling by Kat BoystovaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.For the past several years, I’ve been waking up early to train for various marathons (I know, I need a new hobby). The more often I drink, the more likely I am to hit snooze the next day, which means that glasses of wine and inventive cocktails have been about as rare as actually funny dad jokes. But just because I avoid alcohol doesn’t mean I don’t desire real Adult drinks. When my friends are sipping Greek wine, I need an alternate that’s not always soda and bitters or Diet Coke.And that’s where Lurisia Chinotto comes in. When I first tasted this caramel-colored bitter Italian soda, I thought I was sipping an amaro-forward cocktail. That’s because the source of its flavor—a fruit by the same name—is also a key ingredient in many amari. A member of the citrus family, chinotto (also called myrtle-leaf oranges) are typically orange in color and ping-pong-ball-y in size, with an acidic sharpness that makes them good candidates for preserving and candying (and bad candidates for snacking on raw). Chinotto is grown for commercial purposes (rather than for ornamentation) primarily in Liguria, but they arrived by way of China, as the name implies, back in the 15th century. The drink itself wasn’t invented until the 1950s, some 500 years later.Chinotto the beverage is refreshingly bitter—but not so much so that you can’t drink it like a soda. It has an intense, warm fragrance of cinnamon and clove and the sourness of rhubarb, quince, and grapefruit (that is, all of my favorite fruits). It tastes sort of like a cream soda that’s been stripped of all of its unnecessary sweetness and bolstered with a hit of citrus and spice.You could mix chinotto with spirits for a cocktail, but I just store it in the fridge and pull it out when friends are pouring something with an ABV. I get to pretend I’m Italian and satisfy my craving for a sophisticated drink. And I know I’ll be ready (“ready”) to hop (“hop”) out of bed when the alarm goes off at 6 a.m.Buy it: Lurisia Chinotto, $2.50 for 9.3 oz. bottle at EatalyAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitSodaHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Sarah Jampel"]}