{"id": "91ffbd0fed8022d16fd44a7839850fd6", "url": "https://www.bonappetit.com/recipe/coconut-creamed-greens", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Coconut Creamed Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Creamed GreensBy Andy BaraghaniOctober 15, 20194.9(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhereas some creamed greens can get boring after two bites, these are impossible to stop eating. Pairing earthy, hardy leafy greens with cooling coconut milk, a hot chile, and spices gives this side dish a full range of bitter, sweet, and tingling flavors.Ingredients8 servings1cup unsweetened coconut flakes3lb. mixed hardy greens (such as Tuscan kale, curly kale, Swiss chard, and/or mustard greens; about 4 bunches)¼cup virgin coconut oil6garlic cloves, lightly crushed1large onion, finely chopped1red Thai or Fresno chile, thinly sliced12\" piece ginger, peeled, thinly slicedKosher salt2Tbsp. mustard seeds2tsp. ground coriander½tsp. ground turmeric2cups unsweetened coconut milk½cup coarsely chopped cilantroPreparationStep 1Preheat oven to 350°. Spread out coconut flakes on a parchment-lined rimmed baking sheet and toast, undisturbed, until some are golden brown (some will remain white), 5–7 minutes. Let cool.Step 2Meanwhile, remove ribs and stems from greens and discard. Cut leaves into 1\"-thick strips; set aside.Step 3Heat oil in a large skillet over medium. Add garlic and cook, stirring often, until golden brown, about 3 minutes. Add onion, chile, and ginger; season with salt. Cook, stirring often, until onion is softened, about 5 minutes. Add mustard seeds, coriander, and turmeric and cook, stirring to evenly distribute, until fragrant, about 1 minute.Step 4Add coconut milk to skillet and bring to a simmer. Add reserved greens a handful at a time, letting each batch wilt slightly before adding more. Cook, tossing occasionally, until greens are tender and mixture looks creamy, 15–18 minutes. Taste and season with more salt if needed.Step 5Transfer greens to a platter or large shallow bowl and top with coconut flakes and cilantro.How would you rate Coconut Creamed Greens?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleAs is. Perfect. This entered my Thanksgiving menu years ago and it never left. So much more depth than greens usually have. AKKWMpls, MN11/14/2021I love this traditional Indian dish which is really creamy from the coconut milk. I usually serve it with taroroot.GZ1/31/2021Made it with 2 kinds of kale and it was a big hit. Will definitely make it again. We had it with BA's Slow Roast Gochujang Chicken (with potatoes) and they paired together GREAT!MagnoliaMerSeattle, WA12/16/2020Made this tonight after a haul of mustard greens arrived in my farm share this week.   It was so satisfying and a full meal over rice, loved the spot of sweetness from the coconut at the end and the textural pop of the mustard seeds.  Will definitely be making again!ElizabethAnn15New York City6/1/2020Really delicious! Used beet greens from the garden and a jalapeño instead of the Fresno chile. Finished with lime and everyone raved about it!suecq1California 4/6/2020I decided to test this out before thanksgiving, and while I ultimately decided my 90 year-old grandparents might keel over from the shock of something so non-traditional at their table, I would highly recommend this dish for folks looking for a hearty vegan side for thanksgiving.  It's quite simple and quick to put together and very tasty.  Since I made a meal out of it, I added some leftover roasted chicken, topped with lime juice/zest and cashews, and served over rice.  It was great and def feels like a full meal even without the chicken.  If your making the recipe straight-up for thanksgiving, I would recommend some lime juice and zest to brighten it up.  Thanks for the recipe Andy, you are a treasure.   Montana11/26/2019Explore Bon AppétitCoconutFruitCoconut MilkOther IngredientsKaleLeafy GreensVegetableSwiss ChardMustard GreensFallSideDairy-FreeVeganVegetarianKetoHealthyishBraiseThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani"]}