{"id": "92000d36f9d78b304eda645ebf60581b", "url": "https://www.bonappetit.com/story/tweezer-tongs", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Tweezer Tongs Are the Superior Tongs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTweezer Tongs Are the Superior TongsThey offer the precision of tweezers coupled with the strength of tongs.By Sohla El-WayllyAugust 24, 2020FacebookTwitterEmailPhoto by Sohla El-WayllyFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I never really knew my 12-inch-long tweezer tongs were special until I started getting 50 Instagram DMs a day about them. Don’t you all have these? Well, you should. The Küchenprofi tweezer tongs easily make my top five of desert island kitchen tools—hell, they might even be in the number two spot right behind my chef’s knife! That’s because they can do anything tongs can do—grip, grab, and flip heavy roasts and steaks with ease—but with the precision and delicate touch of tweezers.Now let me be clear: I’m not talking about the fine-tipped little guys that fancy-dude chefs use to plate one micro herb at a time. (But yes, I do also own those and they’re great for getting one caper out of a jar!) I’m referring to these foot-long, heavy-bodied long boys that are a lot like metal cooking chopsticks that have been welded together, so they require no skill or practice to operate.Unlike tongs, these tweezer tongs are slim and compact, fitting into any tool crock, drawer, or even apron pocket if you’re all about that quick draw. There’s no fussy locking mechanism to slow you down while cooking, no weird nooks or pockets for food or hot water to get caught in. And without the sharp scalloped edge of a tong, there’s less risk of tearing up your food as you’re cooking it.Instead, these tweezer tongs have grooves on the inside of their rounded ends, which help you grab even the most slippery noodle from a boiling pot to taste. They have just the right amount of resistance so you can turn a slim piece of asparagus on the grill as easily as a hefty chicken thigh.Now you get why tweezer tongs are the superior tongs! Thank you for coming to my TED Talk.Küchenprofi 12-Inch Stainless Steel Tweezer Tongs$13 $12 at Amazon$20 at WayfairExplore Bon AppétitHighly RecommendShoppingToolsRead MorecultureI Thought This Fish Weight Was Another Useless Kitchen Tool—Until I Used ItBy Sohla El-WayllyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-24", "author": ["Condé Nast", "Sohla El-Waylly"]}