{"id": "922dea25f59224456b98c33d0f6a12ae", "url": "https://www.bonappetit.com/story/veggie-burger-recipe", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "A Veggie Burger Recipe That Doesn't Have 15 Ingredients for Once | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Veggie Burger Recipe That Doesn't Have 15 Ingredients for OnceIt's vegan, grillable, and just plain delicious.By Chris MoroccoJune 20, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailIt takes a lot to get vegetables to come together into burger form and stay there. A whole lot, in fact. That is why so many veggie burger recipes require eggs, gluten, prodigious amounts of starches, and chilling or freezing before they have a chance of holding together. Unlike meat fibers which contract and bind as they cook, vegetables, grains, and legumes just want to fall apart as they heat up. So when I said I wanted to create a grillable, totally vegan veggie burger that came together in under 20 minutes, there was a good chance this would be the mission that I simply never came back from.The fact is that DIY veggie burgers will never be able to compete with meat-based ones when it comes to having a short ingredient list. I still have lingering guilt that, in my quest to create BA’s Ultimate Veggie Burger a few years ago, I ended up with a 19-ingredient-long recipe (and that's just the patty). In my defense, I just wanted the best possible Superiority Burger-style burger, whatever the cost.This time, I came at it from the opposite direction, only using ingredients with massive flavor payoff that require as little intervention as possible. The keys to this black bean burger, as like so many other things, turned out to be mayonnaise and almond butter (stay with me!), which work together to create a firm, rich burger that keeps everything in place (at least until it reaches your mouth.)Go ahead and get your grill started (assuming you have some quinoa already cooked off) because these burgers should only take 20 or so minutes to prepare. Oil the grill grates and shred the tofu, squeezing out the liquid so it doesn’t sog out the burgers. Cook the tofu and beans in a non-stick pan until the tofu is beginning to turn golden brown and the bean skins look dry and are starting to crack apart.While that's happening, whisk the almond butter and mayonnaise until very smooth (you want them to disappear into the burgers to create richness and cohesion, much like the avocado in this turkey burger recipe. Whisk in the garlic, chili powder, and salt, then fold in the tofu and beans, followed by the cooked quinoa. Combine the ground flax with the water until it has a chance to gel (about a minute, and yes this is similar to a flax egg but much more concentrated so don’t skimp). Add the flax to the burger mixture along with the cornstarch and stir well to combine.Form the patties using well-oiled hands and grill over medium-high. These burgers can take a bit of char so let them color underneath before flipping! For condiments, I like to pickle some red onions and combine Greek yogurt (or vegan mayo) with adobo sauce (my favorite thing about canned chipotles in adobo isn’t the chiles themselves), lettuce, and tomato. Despite the short prep time, this burger still has the range of textures that define a good burger, from a charred crispy exterior to a chewy-tender center. Call it a veggie burger, call it a black bean burger, call it whatever you want. It’s just a damn good burger, finally.It's burger time:Easiest-Ever Grilled Veggie BurgersAn impossible assignment: a from-scratch veggie burger that can go right from the mixing bowl onto the grill without falling apart. We found a way!View RecipeExplore Bon AppétitHealthyishBlack BeansVeggie BurgerSummerRead MorecookingThese Outrageous Veggie Burgers Make Us Forget that Meat ExistsGallery5 SlidesBy Martin NordinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Chris Morocco"]}