{"id": "9231125757736c50c80744eb7789bf56", "url": "https://www.bonappetit.com/story/korean-dried-sweet-potato", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "These Sweet Potato Snacks Are My Favorite Fudgy-Chewy Treats | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Sweet Potato Snacks Are My Favorite Fudgy-Chewy TreatsDried goguma is Mother Nature's gummy candy.By Justine LeeMarch 12, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!Maybe the most Korean thing about me, apart from being 100 percent Korean American, is my unbridled adoration for goguma (sweet potato). In college I even had a finsta account under the username Grateful_Goguma where I shared tidbits of my personal life and A LOT of sweet potato photos. Roast them, steam them, or air-fry them and, without fail, they’ll always be delectable. Just when I thought I’d reached peak goguma, I stumbled upon these Korean dried sweet potato snacks a few years back and knew this would be an everlasting love.Being somewhat of a spud specialist, I’ve tried loads of different brands, and JeollaNamdo is hands-down my favorite. Straight out of the bag, the golden spears of dried goguma look like a cross between a piece of Turkish Delight candy and a chubby little french fry. Texturally, they’re incredibly fudgy with a delicate, taffy-like pull. The only processing the sweet potatoes go through is a roasting and drying that boosts their syrupy sweetness without any added sugar. Low and slow dehydrating also means the starches release a white, malty sugar dust that coats each piece. In this snack equation, time equals concentrated flavor and major powdered jelly donut vibes.Each handful of these root veggies come in a sunshine yellow snack-size pouch that I infer as strong encouragement to eat them all at once. I keep a stash tucked away in a special box (labeled “Fun Stuff!”), alongside a supply of kettle corn and almond butter cups, and I reach for a bag whenever that inevitable hangxiety comes a-knocking. If I’m seeking more satiety and sweetness, say, post workout, I like to dice the strips into smaller cubes and toss them with nuts and vegan chocolate chunks to make my own trail mix. While it saddens me to report that I deactivated my finsta account about a year ago, I’m still grateful as ever for goguma.Photograph by Emma FishmanDried Sweet Potato 4-Pack$15 at AmazonExplore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreshoppingI Can't Stop Munching On This Fluffy, Flavorful Popcorn DupeBy Amber GibsonshoppingPistachio Is the Best Nut, and Pistachio Milk Is the Best Nut MilkBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-12", "author": ["Condé Nast", "Justine Lee"]}