{"id": "92413c51db0914b3a3939a351ce26584", "url": "https://www.bonappetit.com/story/what-does-caramelized-mean", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "What Does Caramelized Mean, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Does Caramelized Mean, Anyway?Caramelization isn't only for onions. Get to know our favorite flavor-building maneuver.By Alex DelanyOctober 10, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWe drop the word caramelized a lot over here at Basically, usually when we’re talking about grilling meats and roasting vegetables. Or, well, caramelizing onions. But what is the process of caramelization? And does it have anything to do with Werther’s Originals, the greatest Grandpa candy there ever was? What are we really talking about here?No. We’re not talking about hard candies. Caramelization happens when sugar is introduced to heat. Compounds are released that alter the flavor and the color of the sugar. The most immediately noticeable effect is the darkening of the sugar’s color.You can caramelize sugar straight-up. That’s how we get caramel sauce for ice cream or that beautiful, crunchy top of a crème brûlée. But most caramelization happens with sugars that are naturally found within other ingredients. Fruits and vegetables caramelize in the same way that pure sugar does. It just happens at a slower rate, since there’s less sugar. The browning on zucchini (like you'll see on this flatbread recipe) or peaches is the result of natural sugars being caramelized.Caramelized food develops a flavor that goes beyond the one-noted sweetness of sugar. When sugars caramelize, they develop nuttiness, bitterness, toastiness, and even a little bit of buttery creaminess.You can lightly caramelize or darkly caramelize. Or meet somewhere in the middle.\nAlex LauWhile caramelization does happen with natural sugars, adding another sugary substance to whatever you’re cooking can help jump-start things a bit for foods that have either a low sugar content or no sugar at all. (Side note: Browning, which looks similar to caramelization, can still happen in foods that don’t caramelize, like meats, eggs, bread, and dairy. This is a result of protein breakdown, not sugars browning, and it’s called the Maillard Reaction.) When we make marinades for meats, what we’re really doing is coating them in a mixture that will start to caramelize as soon as it’s exposed to high heat. Glazes work the same way, thickening and developing deep, sweet flavor when brushed onto the outside of browned meats. This is why there should always be a sweet component, like honey, brown sugar, molasses, or regular sugar, in a marinade or glaze.There are two things you need to keep in mind when you want to caramelize something. Caramelization can only happen in dry heat, which means you can’t caramelize while steaming, blanching, boiling, or cooking with a sous vide machine. And caramelization also needs high heat to happen quickly. If you try to caramelize a vegetable in a 300° oven or over a medium-low flame, you’ll end up with caramelization eventually, but it will take a long time to get there. (Think caramelized onions.) High, dry heat is the quickest ticket to perfect caramelization and a crispy exterior.So yes, caramelization is a little science-y. But you can handle it. You don’t need a degree to caramelize. You just need a yearning for extremely satisfying flavor. That shouldn't be too hard to find.Oh, look at that! Caramelized zucchini flatbread!Caramelized Zucchini FlatbreadThe most delicious solution to summer squash fatigue.View RecipeExplore Bon AppétitBasicallyCaramelFruitVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Alex Delany"]}