{"id": "924387fc34d1911dc31e1953ac3e3d73", "url": "https://www.bonappetit.com/story/lana-condor", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Lana Condor Is Probably Home With a Bowl of Noodles Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIt's Friday Night and Lana Condor Is Probably Home With a Bowl of NoodlesThe star of ‘To All the Boys I’ve Loved Before’ doesn't care if you judge her for going to bed at 10 p.m.By Alyse WhitneyMarch 8, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Up next is Lana Condor, star of rom-com To All the Boys I’ve Loved Before and Syfy’s hit new show Deadly Class.Lana Condor may have skyrocketed to fame after starring in Netflix’s To All the Boys I’ve Loved Before last year, but she still has her normal-person moments, like when, a few minutes into our photoshoot, she was bent over a garbage can in heels, barfing. Her newly adopted puppy, Emmy, had gotten carsick on the way over, and the experience had been, let’s say, triggering. But the next moment, she was laughing, back to her perpetually sunny disposition.“I’m not going to say that this was the last time it’s happened, because [Emmy] has barfed three more times since then, and I may or may not have had the same reaction,” she said later. “But my boyfriend cleans it up now.”At the time of publishing, Condor has 6.6 million Instagram followers who tune in for candid stories like this, dish-by-dish recaps of the meals she has in Los Angeles (it’s mostly sushi), and behind-the-scenes looks at stunts for her assassins-in-training TV show Deadly Class (Season 1 is on Syfy now, with a finale to air March 20). But even though the 21-year-old actress looks like she’s constantly having fun on social media, she admits her idea of a wild night is staying home, watching Parks and Recreation, and eating pasta.The food that sparks the most joy for me is.. noodles. It was a really tough decision, because I love sushi, but noodles win. My holy trinity is spaghetti all'amatriciana at Uovo in LA, spicy miso ramen at Daikokuya in LA, and seafood pho with egg and rice noodles at Phnom Penh in Vancouver, where we filmed Deadly Class. I also had the cheapest, most amazing hand-pulled noodles of my life at 88 Lan Zhou in New York City.My food mantra is... to eat what makes you happy. I don’t diet, but I do work out a lot. Cardio sucks, but I do it. I do weightlifting and boxing, and I try to eat in moderation. I’ve tried to take away noodles in my life, and it just doesn’t work—I’m miserable! I always think to myself, “Well, I could starve myself and go on a diet and be fucking miserable. But what if I die in a plane crash? Or, what if I have the most amazing meal of my life, and then I could still die in a plane crash, but at least I'd have a happy belly!\"If I’m cooking at home, it’s probably... fresh fish. Spaghetti vongole, salmon, fish stew. Or pasta like carbonara, amatriciana. Or ratatouille or chicken noodle soup or turkey burgers. I make everything. Well, you know what I can’t make? I honest to God can’t make salad. I think it’s my brain being like, “No, Lana, why would you put the time into making a salad when you could make an amazing bowl of pasta?”The most comfortable piece of clothing I own is... what I’m wearing now: an oversized, baggy sweatshirt from TNA, a Canadian brand.A perfect night to me is... at home, watching TV with my boyfriend and my dog. It’s always been in my nature to be a homebody and to stay inside. Even when I was a little girl, I didn't really do sleepovers—I like to be safe and comfortable in my own space. It takes a lot for me to go out, and it takes all of me to not leave before 10 when I do. On the set of To All the Boys, I went out with the guys a few times, but we had a lot of fun at home, because we all lived together. I would make dumplings for everyone, and you’d be surprised, but even though Noah [Centineo] is so tall, he would only eat like eight dumplings. He eats really healthy. He has better portion control than me.My dream dinner party lineup would include... Chef Evan Funke from Felix in Venice would be cooking. Jenny Han [author of the To All the Boys series], Vanessa Hudgens and Zac Efron even though that isn’t possible because they broke up, Emily Blunt and John Krasinski, and Sandra Oh.I’m listening to... Loooots of Lauv!And currently reading Sleeping Beauties, the new Stephen and Owen King novel.I’d love to travel to... Nairobi again, but for somewhere new, I’ve never been anywhere in Italy, so I want to eat all the pasta there. And I really, really want to go to Japan. I recently took a proper sushi-making class, and it is such an art. I want to go do omakase properly.I won’t go anywhere without... Chapstick and eye masks. I have bad under-eye discoloration just from general sleeplessness, so I love Skyn Iceland’s cooling eye gels. I use them when I want to take a nap, but I have to look like I’m awake. These help me fake it.Explore Bon AppétitHealthyishInterviewsRead MoreLifestyleEverything ‘Schitt’s Creek’ Star Dan Levy Would Put in His IRL Wellness ShopGallery9 SlidesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-08", "author": ["Condé Nast", "Alyse Whitney"]}