{"id": "924996f68fda08f05d15170c16f19c70", "url": "https://www.bonappetit.com/story/bagels-better-than-ever", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "4 Reasons Why Bagels Are Better Than Ever Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture4 Reasons Why Bagels Are Better Than Ever Right NowChefs around the country share the secrets behind their next-level riffs.By The Bon Appétit StaffJanuary 21, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTrends come and go in the bagel world (ahem, rainbow). But Hatch-chile schmears and custom-built wood-fired ovens? They might be here to stay. The bagel has become the latest DIY project among chefs, and they’re giving it a fresh—but not too fresh—look that’s winning over bagel purists across the country. We talked to a handful of folks about what they're doing to keep things innovative and interesting.The Water“When I started R&D for these bagels in 2012, I was extremely focused on the water thing. I tried everything: bottled water, spring water, alkaline water, reverse-osmosis water. Spoiler alert: Its impact on the dough isn’t noticeable. So I ended up using L.A. tap. I’m a born and bred Angeleno, so I wanted to create something that reflected my city because I’m proud as hell of it.” —Nick Schreiber of Belle’s Bagels in Los Angeles.The OvenAt Meyvn in Minneapolis all eyes are on Liza (as in Minnelli), a stainless-steel-tiled oven that sparkles like a disco ball. Chef Adam Eaton credits the wood-fired, gas-assisted oven for imparting a slightly smoky flavor and giving the bagels a blistered exterior and chewy interior. Here’s a look at Liza by the numbers.10,000: The weight, in pounds, of the custom-built oven.20: The amount of people hired to bring the oven into the restaurant.1: The number of bus stops moved in order to install Liza.550: The temp, in Fahrenheit, in which the bagels are bake10,000: The volume of bagels are churned out a week.Bagels coming out of the oven at Meyvn.\nPhoto by Ashley SullivanThe Secret Ingredient“Instead of using barley malt for our bagels, we fell in love with Muddy Pond sorghum syrup from Tennessee. It adds a light molasses note and subtle depth to both the dough and bagel-boiling water. There’s also a historical tie to South Appalachia: When sugar was too expensive, people relied on sorghum. For our bagels, we use a syrup from Muddy Pond in Tennessee and they still make it the traditional way: pressing the sorghum juice between horse-powered, rotating stone slabs and then reducing it to syrup.” —Katie Button of Button & Co. Bagels in Asheville, NC.The Schmear (and Toppings)Here’s what our favorite bagel shops are spreading now.Photo by Chelsie CraigHatch chile schmearEmily Winston, the baker behind Boichik in Oakland, CA, isn’t afraid of the heat. When a friend from New Mexico offered her a batch of hatch chiles, she thought of turning the pungent green pepper into a cream cheese—naturally. Winston spackles it onto cornmeal-crusted bagels, which balances out the fiery flavor.Photo by Chelsie CraigNectarine cream cheeseThe team behind Call Your Mother in D.C. initially started selling bagels at local greenmarkets, and after weeks of ogling their neighbor’s gorgeous nectarines, they finally gave in and made sweet-savory nectarine cream cheese studded with bits of bacon and jalapeño. It’s now available at their new brick-and-mortar spot.Photo by Chelsie CraigCaviarWhitefish goes luxe at Freedman’s in Los Angeles. Owner Jonah Freedman loads his smaller, fluffier, Toronto-style bagels with whitefish cream cheese, cucumber disks, and American Paddlefish caviar, wild-caught in Oklahoma.Photo by Chelsie CraigSherry-soaked raisinsKrista Kern, the chef and owner of The Purple House in Yarmouth, Maine, amps up raisins by bathing them in sweet sherry and smoky ras el hanout before blending into cream cheese.Read MorerestaurantsAtlanta Doesn’t Need New York Water to Make a Really Freaking Good BagelBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-21", "author": ["Condé Nast", "The Bon Appétit Staff"]}