{"id": "9257df5eaab2e2b5357ede95ff2e5b9a", "url": "https://www.bonappetit.com/story/bread-and-salt-bakery", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "I Don’t Even Read the Menu at Bread and Salt Bakery Because Everything Is So Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Don’t Even Read the Menu at Bread and Salt Because Everything Is So GoodI just get whatever hyper-seasonal pizza chef Rick Easton brings out of the oven. By Gaby Melian February 18, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Every time I go to Bread and Salt in Jersey City, it’s an adventure. Chef Rick Easton constantly changes up the pizzas. One minute it’s a very simple Margherita, with tangy tomatoes and a glug of olive oil. The next, lardo drizzled with honey and crunchy, toasty hazelnuts. The reason why the menu never stays the same is because Easton’s super focused on seasonal ingredients. But it’s also because he doesn’t have a big kitchen with tons of space to prep.The restaurant is simple yet inviting, with a garage door that’s rolled up during warmer months and a big line that goes out the door—go during the weekdays to avoid it! Sometimes, you’ll wait 30 minutes just to get to the counter, but I don’t mind one bit. That’s partically because Bread and Salt is BYOB and I start drinking the minute I’m in line. But it’s mostly because it’s worth the wait. The pizzas here are so special: thin and rectangular, they’re all made with quality ingredients, and you can really tell. You’ll eat four slices without even noticing.With the weather the way it is, I’d take a artichoke, onion, and potato pie at any moment, but I’m also counting down the days until the zucchini and stracciatella returns, which tastes like summer in Italy.\nThat said, I don’t even bother reading the menu before I order. I just get whatever Easton brings out of the oven, like I’m at some kind of pizza omakase.Go there: Bread and SaltExplore Bon AppétitHighly RecommendRestaurantsNew JerseyPizzaRead MorerestaurantsI Haven’t Had a Just-Okay Dish at This Little Italian Spot in New JerseyBy Brad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-18", "author": ["Condé Nast"]}