{"id": "9259fb3d1329191d7a7d3917f486238a", "url": "https://www.bonappetit.com/story/rao-best-jarred-pasta-sauce", "year": 2018.0, "month": 5.0, "day": 1.0, "content": "The Best Jarred Pasta Sauce There Ever Was | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRao's Is the Best Jarred Pasta Sauce There Ever WasJarred pasta sauce? Meh. Rao's jarred pasta sauce. Ok, yeah, sounds good.By Alex DelanyMay 1, 2018FacebookTwitterEmailPhoto Courtesy of Rao's/Mathew ZuckerFacebookTwitterEmailWe have a complicated relationship with jarred pasta sauce. Between the no-cook, quick stovetop, and easy butter-roasted options, making your own tomato sauce is pretty easy. But sometimes, you just can’t bring yourself to make sauce. Your day was horrible. Your week was horrible. Your year was horrible. You don’t need to explain. We get it. In that case, we reach for a jar. But not just any jar. We have a pretty loyal relationship with Rao’s Marinara Sauce and firmly believe that it’s the best jarred pasta sauce around. Everyone that works here has daily Rao’s rituals. Songs. Sayings. Handshakes. It’s a cult.OK, we’re not really in a cult. But we do think Rao’s is the best. Generally speaking, jarred pasta sauce is pretty terrible. Sometimes that’s because there are added preservatives or coloring. But mostly, it’s because they taste too sweet, too salty, or maybe even a combination of the two.But Rao’s is none of those things. Rao’s is a pasta sauce that falls in line with the sauces we’d cook, and it starts with the ingredients. Rao’s uses high quality tomatoes and olive oil, without any added preservatives or coloring. The rest of the ingredients won’t surprise you: salt, pepper, onions, garlic, basil, and oregano. You know, the stuff you’d expect to be in tasty marinara. And the biggest omission from that list is added sugar. Which already tells you something about how it tastes.Rao's marinara sauce is very well-balanced with sweetness that comes solely from tomatoes, onions, and garlic. There aren’t any other performance enhancing drugs getting in the way of a balanced tomato sauce.Photo by Chelsie CraigThe flavor tastes...homemade. Yeah, we’d be pretty happy if we made this sauce. It's the kind of sauce we want to spoon over pasta and dip stromboli or calzones in. Compared to other national brands, Rao’s sits on an entirely different plane.While all of these flavors and ratios are important, there’s one ingredient that sticks out more than the rest. In fact, you can tell it’s there immediately. Rao’s uses a large amount of olive oil. You can see it sitting right on top of the sauce, before you even crack open the jar. We love that commitment to the fatty, olive oil-y side of the sauce. That fat is the key to a fantastic, well-rounded marinara.But there’s always an exception to the rule, the thing that makes you amend your beliefs. And in this case, that exception is made from tomatoes, hails from New York, and goes by the name of Rao’s.Buy it: Rao's Marinara sauce, $15 for 15-ounce jar on AmazonAnd once you buy it, dip these calzones in it:Explore Bon AppétitPastaSauceBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-01", "author": ["Condé Nast", "Alex Delany"]}