{"id": "925a1276741a7d9efadb5dae1ab034e9", "url": "https://www.bonappetit.com/story/nori-nut-mix", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Nori Nut Mix | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMore Nori Nut Mix, PLEASEThe only way I get anything done is to use this nut mix as a reward.By Sarah JampelAugust 20, 2020FacebookTwitterEmailPhoto and Food Styling by Emma Fishman FacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Lately I have felt like a parking meter. “Feed me!” I blurt out every two hours to no one in particular, at which point I must have a small treat or I cannot, will not, and shall not go on. In the fugue state of the past five-and-a-half-but-who’s-counting months, snacks—salty or sweet, big or small, homemade or store-bought—break up the sprawling hours and motivate me to get through my to-do list.I am not alone in this. A certain BA staffer who shall remain nameless told me that they keep a family-size bag of peanut M&Ms in the freezer for a reward every time they have filed a story. And my friends give their corgi-beagle mix Elsa a midafternoon “lunch” (really, just a portion of her dinner) to quiet her down over the looong sprawl from noon to eight.My snack of choice is nori nut mix, which is a little spicy, a little sweet, and, thanks to the addition of crushed seaweed at the end, rich, savory, and a touch briny too. A fundamental ingredient in Japanese cuisine, nori is made by chopping or grinding seaweed (the word nori originally referred to all seaweed, but these days nori is mostly made from Porphyra yezoensis), mixing it with water to make a slurry and then, much like paper or rice paper wrappers, pressing and drying into sheets. In Japan, nori is, among countless other applications, used to wrap sushi, onigiri, and temaki; confetti’d into furikake; shredded and sprinkled onto noodles, rice, and salads; crushed with gomasio; and cooked with soy and sugar for the inky condiment nori no tsukudani. This seaweed isn’t exclusive to Japan: It’s known as zicai in China and gim in Korea, where the dried sheets are often seasoned with sesame oil and salt. In Wales, the same seaweed is boiled into a soft paste called laverbread that is sometimes coated in oatmeal and fried for laver cakes. But for this nut mix, the dried seaweed is ground finely so that it can cling to every pecan ravine and walnut valley. Start by tossing 1½ cups nuts (such as walnuts, cashews, almonds, or pecans), ¼ cup sesame seeds, 2 Tbsp. honey, 1 Tbsp. olive oil, a big pinch of mild red pepper flakes (I like gochugaru, but you could also use Aleppo-style red pepper flakes or a much smaller pinch of cayenne or crushed red pepper flakes), and ¾ tsp. kosher salt in a large bowl.Slide the mixture onto a rimmed baking sheet or large cast-iron skillet and bake at 350°, shaking once or twice, until nuts are golden brown, 20 to 25 minutes. Meanwhile, crush 2 toasted nori sheets in a spice mill, mortar and pestle, or by hand—you want a fine powder, but some big pieces are okay! You can also use roasted seaweed snacks here. (I strongly recommend you buy extras to make Eric Kim’s Nori Sour Cream Dip.)When the nuts are done, immediately toss with nori and let cool on the baking sheet. Store in an airtight container for up to a week and crack it open whenever you need it most—for me, that’s when I’m putting off writing an email I don’t want to send, when I’ve just sent said email, and every hour on the hour. Next batch, coming right up!Explore Bon AppétitIt's That SimpleNutSnackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-20", "author": ["Condé Nast", "Sarah Jampel"]}