{"id": "9260d7575fe371852f25b870d2c0c894", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/juno-the-bakery", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Juno the Bakery Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenJuno the BakeryFuel up for those canalside bike rides with these outstanding Østerbro carbsFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: to continue the grand American tradition of standing in line for delicious pastries and bread at this lo-fi bakery from former Noma pastry chef Emil Glaser. He rewards all who brave the line with lovely traditional buns flecked with black cardamom, often hot from the oven, as well as other treats like croissants.ORDER THE: cardamom rolls (saffron around the holidays), croissants, seeded rolls with Comté, tebirkes (poppy seed pastry), and seasonal tarts. Toward the end of the day, sourdough loaves emerge to take home for dinner. Stock up on the seedy rolls for breakfast the next day, perfect with a coffee made from cult Swedish roaster Koppi.THE VIBE IS: minimal but somehow very Instagrammable, thanks to the great light and pretty ceramics.PRACTICAL STUFF: Open Wednesday to Saturday from 7:30 a.m. to 6 p.m. and Sunday from 9 a.m. to 3 p.m. Closed Monday and Tuesday.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVEMirabellePlan a mini croissant- and yogurt-filled vacation at this café-like spot in NørreboroDemocratic CoffeeOne more reason to love the library (or at least this Indre By one): buttery croissants108Noma’s more casual spin-off in Christianshavn, with kombucha-shellacked pastriesExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}