{"id": "92775be9cb5f894fb213cc4e61bd139d", "url": "https://www.bonappetit.com/recipe/yemeni-chicken-matzo-ball-soup", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Yemeni Chicken Matzo Ball Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueYemeni Chicken Matzo Ball SoupBy Einat AdmonyMarch 16, 20214.6(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek Brown, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintChef Einat Admony, chef-owner of Taïm Falafel in New York and D.C., grew up eating this Yemeni chicken soup every Friday, and her family had a special version for Passover. “For seders at my old restaurant, Balaboosta,” Admony writes, “I served a riff on it along with other dishes that combine the cultures of Ashkenazi Jews in Eastern Europe and Mizrahi Jews in the Middle East and North Africa. Showcasing the flavors of where I come from serves as a bridge between Jewish cultures.” Admony likes to make the soup itself ahead of time; she then uses a portion of the broth to cook the matzo balls just before serving, which prevents them from getting mushy.Ingredients6 - 8 ServingsHawaij2Tbsp. ground cumin1Tbsp. ground coriander1Tbsp. ground turmeric1½tsp. freshly ground black pepper1tsp. ground cardamom½tsp. ground clovessoup8skin-on, bone-in chicken drumsticks (about 2 lb.), patted dryKosher salt2Tbsp. vegetable oil1large onion, cut into ½\" pieces1head of garlic, most of outermost skins removed, roots trimmed½small butternut squash, peeled, cut into 2\" pieces3medium Yukon Gold potatoes (about 1¼ lb.), peeled, cut into 2\" pieces2medium carrots, peeled, cut into 2\" pieces2celery stalks, cut into 1\" pieces2dried bay leaves1quart low-sodium chicken broth½tsp. ground cumin½tsp. ground turmeric½cup finely chopped cilantromatzo balls4large eggs¼cup vegetable oil2Tbsp. finely chopped cilantro2tsp. dried fenugreek leaves, crushed, or ¾ tsp. ground fenugreek seeds1tsp. Diamond Crystal or ½ tsp. Morton kosher saltFreshly ground black pepper1cup matzo mealPreparationHawaijStep 1Mix cumin, coriander, turmeric, pepper, cardamom, and cloves in a small bowl to combine.Do ahead: Hawaij can be made 1 month ahead. Store airtight at room temperature.SoupStep 2Generously season chicken with salt. Heat oil in a large heavy pot (at least 7 quarts) over medium-high. Cook chicken, turning occasionally, until browned on all sides, 12–16 minutes. Using tongs, transfer chicken to a plate.Step 3Reduce heat to medium. Add onion and garlic to pot. Cook, stirring, until onion is golden, about 10 minutes. Add squash, potatoes, carrots, celery, bay leaves, broth, and 3 quarts cold water, then return chicken to pot. Cover and bring to a boil, skimming any foam from surface. Add cumin, turmeric, 2 Tbsp. hawaij, and ½ cup cilantro. Reduce heat so soup is at a bare simmer, cover, and cook until chicken is very tender and broth is fully flavored, about 1 hour.matzo ballsStep 4Whisk eggs, oil, cilantro, fenugreek, salt, a pinch of pepper, and ¼ cup broth from soup in a medium bowl to combine. Whisk in matzo meal; cover and chill dough until cold, at least 30 minutes.Step 5Working one at a time, shape dough into ping-pong-size balls (about a heaping tablespoonful each) and add to soup. Cook matzo balls until they have puffed up and look light, 20–30 minutes. Ladle soup into bowls to serve.How would you rate Yemeni Chicken Matzo Ball Soup?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleTasty! Following the first reviewer comments, I used regular-sodium broth and added the water gradually as needed as liquid boiled off. Agree that if you want the veggies firmer you should add them later than is called for, but I didn't and still thought they were delicious.Luc3/31/2021Overall, a good soup and a fun alternative to our regular matzo ball soup. I did think that the broth itself needed to be salted, I’m not sure why that is not included in the recipe. I also felt the vegetables did not need to cook the full hour. The potatoes and squash were definitely verging on overcooked. If we made it again, we would add the vegetables later. I tried to give 4 stars but for some reason the review got stuck at 5 and I can’t change it. LeahBellingham, WA3/28/2021Explore Bon AppétitSoupSoups and StewsYemeniMiddle EasternChicken DrumstickChickenPoultryMatzoOther IngredientsMainDairy-FreeNut-FreeBraisePassoverRosh HashanahHanukkahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Einat Admony"]}