{"id": "927d06908c4ab295452e3c81dc1377dc", "url": "https://www.bonappetit.com/story/todd-richards-soul-cookbook", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "For Todd Richards, Soul Food Is a Gateway, Not a Stereotype | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFor Todd Richards, Soul Food Is a Gateway, Not a Stereotype“Quite honestly, I don’t know what people expect from me anymore. Fifteen years a chef, with a passion for black culture. I’m alright with that.”By Hilary CadiganMay 22, 2018FacebookTwitterEmailPhoto by Eric VitaleFacebookTwitterEmail“My ancestors were slaves. Like our grits, they ate fufu, like our air-dried meats they made biltong, and, as we do, they used salt and vinegar as a means of preservation,” writes Todd Richards in his new autobiographical cookbook, Soul. “The flavors used in Soul cooking remain an expression of where we came from. Equally important, how we cook today defines where we want to go.”Born in Chicago and based in Atlanta, with roots tracing back to West Africa, Richards has dedicated much of his life to bucking the stereotypes that often surround black chefs. The two-time James Beard nominee recalls early in his career when he walked into a high-end kitchen for an interview and the white chef asked him, “What are you going to do, make fried chicken and mac and cheese?” And the thing is, yeah, Richards makes some of the best damn fried chicken and mac and cheese you’ll ever taste. But that’s not the end of his story. Not even close.Richards’ career has taken him from Kroger’s meat counter to the Ritz-Carlton, the Four Seasons, Iron Chef and beyond. Today, the self-taught chef is culinary director for Atlanta’s award-winning airport eatery One Flew South along with rapper Ludacris’ restaurant, Chicken+Beer. In 2016 he opened an upscale hot chicken stall in Atlanta called Richards’ Southern Fried. In 2017 he started a pop-up dinner series with chef Guy Wong and mixologists Krista and Jerry Slater. This year, he released his first book.All this may seem a difficult balancing act, but Richards doesn’t flinch. “Quite honestly, I don’t know what people expect from me anymore,” he says. “Fifteen years a chef, with a passion for black culture. I’m alright with that.”In Soul, which drops today, Richards presents 150 recipes illustrating the diversity of African American cuisine, interspersed with history lessons and influential anecdotes from his past. Like how watermelon went from “symbol of freedom for emancipated slaves” to “enduring racist trope”—and how Richards uses it anyway, taking back the stereotype and giving it new power. Like the way his parents used to mix collard greens with leftover fried rice from a nearby Chinese restaurant, because no culture is a vacuum.  “I often wonder why food gets categorized in such sweeping terms,” he writes. “Limit the labels. You’ll liberate yourself in the kitchen, grow as a cook, and your taste buds will have better dining experiences.”The dishes in the book, gorgeously photographed and loosely divided by ingredient, range from hot water cornbread to grilled sea urchin, peach salad to lamb meatball skewers with fig yogurt sauce. It may sound like a chaotic blend, but Richards makes it personal, and thereby makes it work.“Black chefs are often limited by notions of soul food,” he says, “but you can use it as a gateway.” There’s power in claiming a cuisine, in insisting on its value. Richards points out that while soul food can take a long time to cook (even a simple pot of collards sits on the stove for hours), diners expect to pay very little for it. “From an economic standpoint, how can you have upward movement in society if you’re relegated to taking on the most labor and charging the absolute least?”Todd Richards (center) as a child in Chicago\nCourtesy of Todd RichardsWhile a sense of cultural justice runs deep through Soul, so does the joy Richards takes in cooking and sharing his recipes. His shrimp hot chicken-style, which he serves over homemade grits croutons, is as playful as it is tasty, the coastal South reimagined.“I wanted to progress the idea of shrimp and grits, but still make it familiar enough where a person could see the origin of the dish,” he says. Richards includes the shrimp shells and heads in his spicy, creamy sauce to maximize their shrimpy goodness, and eschews the exterior breading one might expect given the “hot chicken” moniker. “If you coat it and fry it, the essence of shrimp gets lost in the batter.”As for the grits croutons? “Leftover grits solidify in the pot as they cool and usually get discarded as a round sphere of misfortune,” Richards writes in the recipe’s headnote. “Reheating isn’t ideal. Adding water creates a soggy, flavorless mess. Instead, cut cold grits into squares, fry them, and enjoy.”Inherent in everything Richards cooks is respect for the food itself, and for the hands that made it, century after century. “Throwing away grits is sacrilegious,” he says. “I mean, how could you even think about throwing away something that took 40 minutes to cook?”Richards doesn’t consider his book a political statement. To him, it’s just an honest story about family, about history, about hard work. “This book isn’t going to defeat Trump,” he says. “I think he’ll do that to himself. But it is a way to inspire the next generation of cooks. My hope is that they do far better than what I’ve been able to achieve.”Buy it: Todd Richards' new cookbook, Soul, is $30 on AmazonGet the recipe:Shrimp Hot Chicken-Style with Grits CroutonsA classic Southern dish of shrimp and grits made hot chicken-style by chef Todd Richards.View RecipeExplore Bon AppétitCookbooksAtlantaSoul FoodRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Hilary Cadigan"]}