{"id": "9287d2e96241ece60ceff9acd078de51", "url": "https://www.bonappetit.com/story/crispy-potato-poetry", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "I Have Feelings for These Crispy Potatoes, and I'm Fine with That | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Have Feelings for These Crispy Potatoes, and I’m Fine with ThatThere’s walnut dressing and sour cream and room for our relationship to grow.By Alex DelanyMay 16, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Molly BazFacebookTwitterEmailHave you ever caught feels for a potato? Have you ever daydreamed about one? Have you ever let your mind wander around its smashed, crispy edges and creamy, starchy center, instead of absorbing whatever essential information your boss was trying to convey to you? Have you ever written poetry for a spud?No?Of course not. Same. Definitely same. That would be...silly. Who would develop an emotional attachment to a dish of potatoes? Not me, that’s for sure. Not even if there was a bed of sour cream or some walnut dressing involved. Not even if the potatoes were divinely crispy. Definitely not me.But let’s say I did, for the sake of conversation. If I did fall for a plate of potatoes, in a totally hypothetical scenario, it would be these crispy potatoes with walnut dressing. They are absolutely delicious. And beautiful.This dish is essentially the crispiest, smashed potatoes you can imagine, placed on a generous swoosh of sour cream and topped with a nutty, umami-rich dressing that would be good on just about anything. It covers all of the bases: creamy, starchy, salty, earthy, bright, and sweet. And it balances all of those aspects in a way where none of them dominates. They coexist in a utopian society. Not a cult-ish utopia. A normal one. Like I said, it’s beautiful.How do the potatoes get so crispy? And what goes into this dressing to make it that good? Well, the potatoes get crisped up with a two-step cooking process. First, you simmer them for about 15 minutes in salty water. They get barely tender enough to smash. Once they’re all cool, lying out on a rimmed sheet pan, you take another sheet pan and push down on the potatoes, smashing them all in one quick motion. It’s super cool, a true smashing hack. You then toss the potatoes in olive oil, salt, and pepper, and throw the sheet pan into a 450° oven. Let them roast for about 35–40 minutes.LOOK AT THOSE BEAUTIES!!!\nPhoto by Chelsie Craig, Styling by Molly BazFor the dressing, we have to cook a couple things while those potatoes roast. It’s not a big deal. Don’t complain. It’s easy. You cook some walnuts and anchovies in olive oil for about five minutes in a skillet. You transfer that to a bowl and mix it with chile flakes, grated garlic, and salt. If you’re thinking, Damn, that would be so good on roasted carrots. Or some grilled chicken. Or blistered snap peas. Or maybe even a shaved vegetable salad. Congratulations. You’re right. It’s good on basically anything. Your award will arrive in the mail in 5–8 business days.Those taters are finished. (Can I say taters? Do people like that? Who knows? Who cares? I like that word. Taters.) Lay down a big ol’ bed of sour cream all over a large plate. Scatter the crispy potatoes on top, and spoon that walnut dressing over them. Scatter some freshly torn herbs on top, because you’re the type of person who does that. And serve the whole thing with some halved lemons, so anyone who needs a an extra hit of acid (not that kind) has it. Look at those potatoes. Look at their glory.So yeah, here’s the recipe:Crispy Smashed Potatoes With Walnut DressingAnd on top? A condiment made up of walnuts, anchovies, garlic, and red pepper flakes that’s the ultimate umami bomb.View RecipeExplore Bon AppétitSour CreamWalnutPotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Alex Delany"]}