{"id": "92bbdcdb697d2178a4211ec7d1c162d4", "url": "https://www.bonappetit.com/story/hatch-chile-season", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "How Hatch Chile Season Became the Pumpkin Spice of the Southwest | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Hatch Chile Season Became the Pumpkin Spice of the SouthwestHatch chile ice cream! Hatch chile chocolate! Hatch chile hype is real but for a limited time only—and that’s what makes it special.By Priya KrishnaSeptember 13, 2019FacebookTwitterEmailPhoto by Matt Taylor-GrossFacebookTwitterEmailTo many, August and September are a time to wind down after a busy summer, maybe buy a puffy fall coat, or get ready for a new school term. But in the Southwest, those months are a fleeting Brigadoon-like window for sourcing the area’s most wildly hyped variety of produce. It’s Hatch chile season.Think of the Hatch chile like the pumpkin spice of the Rio Grande. It’s a flavor people can’t get enough of; it’s a limited season; it can be found at grocery stores and restaurants in everything from ice cream to sushi to beer. And over the past few years, it has gone from prized local pepper to full-on cultural icon.The Hatch is like no pepper you’ve had before: it’s sweet and smoky, it has a slight funk to it and a grassiness that makes it always taste like it’s freshly picked. Like a jalapeño with more of a character arc.“Once you have a Hatch chile, you always have to have a Hatch chile,” explains Chris Franzoy, the president of Young Guns Produce, a farm in the Hatch Valley, New Mexico. “I can’t explain it. It just does something to you.”The small, slightly wrinkled green pepper was developed in New Mexico in the early 1900s by horticulturist Fabián Garciá, according to Stephanie Walker, Ph.D., a plant specialist at New Mexico State University. Garciá found that the local population didn’t take to the earlier varieties of peppers because the crop grew in unpredictable timetables, plus the taste was too spicy. Through crossbreeding he developed a more uniform, mild chile, which kicked off the development of what is known in the area as New Mexico chiles.Hatch chiles by the barrel-full.\nPhoto by Matt Taylor-GrossThe name, “Hatch chile,” Walker says, is slightly misleading, as many presume that it’s a species of pepper grown exclusively in Hatch, New Mexico. It’s more of an umbrella term, encompassing a group of green chiles grown across the state. According to Sonja Schroeder, the executive director of the New Mexico Chile Association, a traveler in the 1970s was passing through Hatch, New Mexico, tried a local variety of chile, and started calling it the Hatch chile. The name took off.“But if you drive into Hatch there is really nothing to it,” she says with a laugh. “It’s just five buildings surrounded by green chiles. I guess it inspires people.”The Hatch chile has long been essential to New Mexican cuisine, where the official state question (yes, this is a thing) is “Red or green?” referring to the red and green chile sauces that adorn many local dishes. But as folks from New Mexico have moved throughout the Southwest, the chile has become a phenomenon across the whole region.What gets people psyched about the Hatch chile is its limited availability, which makes it feel even more special. The season typically runs from August to September, but depending on weather conditions, that can be shorter or longer. Hatch chiles are uniquely tough to grow too, says Chris Franzoy, whose family has been growing the pepper for five generations. “They require a lot of daily attention,” he says, including closely monitoring irrigation schedules and dealing with weed maintenance and pests. Jimmy Lytle, another Hatch chile farmer, based in Hatch, says they can only grow in this area because of its specific conditions: the hot days and cool nights, the elevation, and the soil.A Hatch chile harvest in New Mexico.\nPhoto by Matt Taylor-GrossThat narrow time frame drives locals to amass Hatch chiles during the season to freeze and use throughout the year, whereas restaurants (and even chains like McDonald’s) across the region will put Hatch chiles in their burritos and burgers as a limited-time offering.One of the biggest drivers of the Hatch chile craze is H-E-B, the Texas grocery chain with a cult following (and an ace marketing squad). Twenty-four years ago, its gourmet store, Central Market, launched Hatch Fest, a season-long celebration of all things Hatch chile. There’s Hatch chile ice cream, Hatch chile cookies, Hatch chile crab cakes, even a Hatch chile sushi with salmon. Before the season starts H-E-B will set up a countdown clock on social media and send out emails with ecstatic subject lines like, “Hatch-steria is spreading!” People will post photos of their Hatch chile haul on Twitter, with comments like, “Letting me go to @HEB unsupervised during Hatch chile season is probably a mistake” or “IT’S HATCH CHILE SEASON, BABY!!!!!!! HATCH CHILE CHEESE, HATCH CHILE COOKIES, HATCH CHILE CHICKEN, HATCH CHILE POPCORN, we’ll even dip your BABIES in HAAAAATCH CHILE” (this is a real post).“The summer months are slow and then Hatch hits and people are coming in and asking us, ‘How are the peppers going to be? What is the heat level? When will they arrive?’” says Chris Bostad, Central Market’s head of merchandising. He adds that people will show up with large coolers to fill with Hatch chile products; it’s second only to the holidays in terms of busiest times of the year. Throughout the season team members will roast Hatch chiles outside the stores to perfume the aisles with that sweet, roast-y smell and get customers excited.Another aspect of the Hatch hype machine: the Hatch Chile Festival in Hatch, New Mexico, every August. What started as a small gathering of 500 in 1972 has grown into 20,000, complete with chile eating contests and a make-your-own ristra workshop (referring to the decorative arrangements of dried chiles popular in the region). Sissy Franzoy, one of the festival organizers, says that after the festival was featured on the Food Network in 2003, attendance skyrocketed, drawing visitors from Japan, Australia, and Germany.That Hatch Chile Festival queen!\nPhoto by Matt Taylor-GrossI ask Schroeder if the New Mexico Chile Association is actively marketing the Hatch chile (similar to, say, the American Kale Association or Avocados From Mexico board). She laughed. They don’t need to. The Hatch chile is embedded into the culture. It’s a full-blown mythology—a spicy, smoky, southwest fantasy filled with emerald green peppers growing in lush fields.If anything, a big problem Schroeder faces is Hatch chile fraud, people growing other varieties of green chiles elsewhere in the world and giving them the “Hatch” label. Unfortunately, there’s not much anyone can do about that, she says—it’s too hard to monitor.But the New Mexico farmers have mixed feelings about the way in which their chile has exploded in popularity. On the one hand, they’ve seen a steady rise in business. On the other, what’s to prevent the Hatch chile from going the way of pumpkin spice, becoming a cliché so tired that there’s a Bath & Body Works scent named after it?“Those are novelties,” says New Mexico farmer Lytle, referring to the Hatch chile beer and Hatch chile cookies. “The real chile people like [Hatch chiles] in enchiladas and chile con carne and stuff. When we eat chile, we eat the chile. We don’t just put a little here and there as seasoning.”H-E-B’s vice president of produce Kyle Stevens believes “people have an emotional connection” to the pepper in a way that they don’t for something like pumpkin spice. “It is a more romantic story than a latté. When you think of Hatch, you think of farmers and chiles and work, and you can connect with that.”Every season the thought crosses his mind: “Is Hatch played out? Is it done?” he says. “The answer is no. There will always be a mystique.”Explore Bon AppétitChileTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-13", "author": ["Condé Nast", "Priya Krishna"]}