{"id": "92bf8a0e0c00c586b5a29e8d3c7e1672", "url": "https://www.bonappetit.com/story/butternut-squash-tarte-tatin", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Butternut Squash Tarte Tatin Is an Ingenious Fall Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Benching All My Thanksgiving Pies for This Ingenious DessertSticky, sweet butternut squash tarte tatin, it’s your time to shine.By Elyse InamineNovember 14, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailOn the Facebook event page for this year’s Friendsgiving, created three weeks ago by one ambitious cook in my squad, friends promised to bring macaroni and cheese...and turkey-infused vodka (a joke, I guess). But by the time the date rolled around last weekend, all that appeared at the table were a couple bottles of wine, Indian takeout menus pulled up on phones, Jenga (lol), and some very hungry people. It seemed like Friendsgiving wasn’t going to happen. Then I showed up with dessert.It wasn’t just any dessert, but pastry genius Claire Saffitz’s butternut squash tarte tatin—her very seasonally appropriate take on the classic French concoction of caramel-shellacked apples layered atop buttery puff pastry, this time made with everyone’s fall favorite veg: butternut squash. That switch gives the whole thing a sweet-and-savory flavor and a satisfyingly tender texture that beats any sugar bomb pecan pie or unnaturally creamy pumpkin puree. It doesn’t hurt either that it’s damn pretty, with burnt-orange shingles and a top coat of shiny, glossy, vanilla-inflected caramel.Fanning out the squash is an art.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiI gingerly placed my masterpiece on the table, like a proud tiger mom who drops off her piano prodigy backstage before a concert. Nonchalant. Maybe even a little smug. Conversation stopped. Jaws dropped. “OMG” punctuated a hushed room. People jumped up to grab forks and plates and started passing around slices of the glistening pinwheel tart. We dug in while we waited for takeout to be delivered. Friendsgiving was back on.That is the power of Claire’s butternut squash tarte tatin: It can’t help but gather people around it. And it’s not hard to pull off, either—if you plan ahead. Claire calls for making your own cheater’s puff pastry, which isn’t as scary as it sounds. (Just ask associate editor Christina Chaey.) You only need time, patience—and a good rolling pin. The rest is easy.Yes, you CAN make your own puff pastry.\nAs the dough chills, thinly chop the butternut squash into half moons and roast it in the oven with lots of sugar and butter until it curls along the edges and takes on almost honeyed taste, like the best fruit leather you’ve ever had. While it cools, cook the caramel with sugar, water, lemon juice, and vanilla extract in a saucepan over medium heat, swirling the pan constantly until it turns a light golden brown. Be vigilant! It happens much faster than you think it will. Drop a few tablespoons of butter into the caramel and pour into a springform pan—in my case, a buttered pie pan worked perfectly fine—and then start fanning out the butternut squash slices, focusing all your OCD efforts on that first layer since that’s what the people will see. Roll out the chilled puff pastry over the pie pan and cut the hanging edges, then poke a few holes with a fork all over the dough and tuck in in the sides with a spoon. Into the oven it goes for the next hour or so, until the puff pastry has risen (PTL!) and comes out lightly browned.The best kind of winter cap is a pastry one.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiHere’s where it gets tricky. Once the tarte tatin is cooled, you need to flip it upside-down, so the pastry is on the bottom and your artful handiwork is on top for everyone to admire. “Don’t think; just do it,” I whispered to myself in my kitchen, psyching myself up like an athlete in a melodramatic Nike commercial. I placed a plate over the pie pan and gripped the edges, then turned it over in one quick move. Other than the butternut squash juices that dribbled on the counter, the flip was a success.I relied on that same adrenaline-fueled maneuvering once we broke out the Jenga, long after we demolished the butternut squash tarte tatin. I pulled out one particularly precarious piece, earning me some more high-fives, OMGs, and a fresh beer. I guess that’s also the power of Claire’s tarte tatin.Get the recipe:Butternut Squash Tarte TatinHold the apples, sub in squash, and mind the jaws dropping to the table for this show-stopping fall dessert.View RecipeExplore Bon AppétitButternut SquashThanksgivingDessertRead MorecookingThe Puff Pastry for Anyone Who Ever Said They Can’t BakeBy Christina ChaeycookingThese Butternut Squash, Coconut, and Ginger Muffins Will Turn You into a Morning PersonBy Jesse Sparkstest-kitchenThis Glazed and Flaky Apple Tart Will Make You Forget All About PieBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Elyse Inamine"]}