{"id": "92c853a452f169ef1c5900140b59260d", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/burdock-and-co", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Burdock & Co. Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverBurdock & Co.A Mount Pleasant go-to that shows off the best of British ColumbiaFacebookPinterestTwitterEmailAllison Kuhl GO HERE: for chef and owner Andrea Carlson’s hyperlocal cooking that shows off British Columbia’s bounty—and all the good vibes. She’s one of the city’s most dynamic  community-centric chefs. The quality and unpredictable nature of Burdock & Co.’s dishes make for a fun and ever-evolving experience.ORDER THE: house-milled arctic sourdough bread with cultured butter to start, then whatever your server recommends off their current menu. The buttermilk fried chicken is one of the few items they keep—and for good reason.THE VIBE IS: a Pacific-Northwest mix of brick, wood, candlelight, and locals. The food may be intricately plated, but it’s also accessible in price, making this an ideal neighborhood spot.PRACTICAL STUFF: Open every day, from 5 p.m. ’til the last regular has left; and for brunch on weekends, from 10 a.m. to 2 p.m. You can reserve online ahead of time.—Lindsay AndersonJANIS NICOLAYExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-14", "author": ["Lindsay Anderson"]}