{"id": "92d69ac9f33be8c323fbfa5886a29eab", "url": "https://www.bonappetit.com/story/boneless-wings-are-a-lie", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "Boneless Wings Are a Lie!!!! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBoneless Wings Are a Lie!!!!‘Silicon Valley’ comedian Jimmy O. Yang goes on a tirade against these “little white meat lies.”By Jimmy O. YangMay 21, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIllustration by Mat WilliamsActor Jimmy O. Yang stars as Jian-Yang on HBO’s Silicon Valley and will play Bernard Tai in the movie adaptation of Crazy Rich Asians this August. Yang is also the author of the memoir How to American: An Immigrant’s Guide to Disappointing Your Parents. Now he’s adding one more thing to his résumé: chicken wing crusader for Bon Appétit.When I was growing up in Los Angeles, my family often frequented El Pollo Loco and KFC. My grandpa told me, “Always order the dark meat. It’s the good parts; the white meat is rough and dry, and it’s for dummies.” I have lived by that creed all my life. The ultimate for me is chicken wings. There’s nothing better than the tender meat wedged between the bones of a wing. Buffalo wings, baked wings, grilled wings, lemon-pepper wings... I can keep naming wings like Bubba Gump can go on with shrimp. Then one day, someone—some diabolical person—abused my trust in chicken wings to create something called “boneless wings.”First of all, are we really too lazy to eat a real chicken wing? I enjoy working my way around the bones and getting my hands sticky with sauce, then licking the sauce off of my fingertips as a bonus. I could practically taste my American citizenship on my tangy fingertips. For the people who prefer to eat boneless wings because of its convenience, they might as well drink Soylent instead of eating at all.THIS IS WHAT WINGS SHOULD LOOK LIKE. FULL STOP.\nAlex LauBased on its name “boneless wings,” I assumed someone had taken the time to debone the wings, which sounded like the fancy labor of a chef like Jacques Pépin. But I quickly realized boneless wings are no wings at all—they are little white meat lies.Boneless “wings” are nothing more than dry chicken breast cut up into pieces to loosely resemble the size of a real wing. It sounds like a creation from Dr. Frankenstein. Boneless wings are not wings! They are not even dark meat! They are bite-sized insults to my palette and intelligence! Any restaurant who serves boneless wings should be indicted for fraud, thrown in the same prison as Bernie Madoff and the scammers who sell “truffle” oil that’s nothing more than a bottle of chemically flavored lubricant. I can’t believe we allow this to happen as Americans who value the truth. If people can get away by calling breast meat as boneless wings, what’s to stop someone from selling rat meat as USDA prime rib-eye? What’s next? “Lifeless Caviar”— a fistful of pine nuts packaged in a tin can? Would you like that?! Boneless wings, I’ve had enough of your crap. This ends here.Boneless Wings Gate is an epidemic that stretches from local burger joints to TGI Friday’s corporate office. We must band together as Americans to protect our freedom and truth in chicken wings. We must topple this slimy snake oil scheme of false advertising. We must earn back the trust of America, one bone-in wing at a time. I hereby propose a Supreme Court case that’ll set an example for all future generations who refuse to settle for a lie: The People vs Boneless Wings.I refuse to be lied to anymore, and so should you.Now make our best bone-in Buffalo chicken wings:Explore Bon AppétitChicken WingRead MorecultureSteak Fries Are Garbage and I Will Not ApologizeBy Alex DelanycookingHow to Make Crispy Baked Chicken WingsBy Alyse WhitneyrecipesOur 23 Best Chicken Wing Recipes for Saucy, Finger-Lickin’ FunGallery23 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-21", "author": ["Condé Nast", "Jimmy O. Yang"]}