{"id": "92da0f6e13dd8a10d8e02b48ef4d2b52", "url": "https://www.bonappetit.com/story/now-serving-cookbook-shop-los-angeles", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "The Quirky L.A. Cookbook Shop Every Food Lover Needs in Their Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Quirky L.A. Cookbook Shop Every Food Lover Needs in Their LifeAt Now Serving, satisfy all your chef zine and Japanese dyed cloth needs. Which are many.By Elyse InamineOctober 4, 2018FacebookTwitterEmailAdam AmengualFacebookTwitterEmailThe new joint that every out-of-town chef hits up when they’re in Los Angeles? Now Serving, a well-curated cookbook and ceramics shop run by former Cut chef Ken Concepcion and his wife and make-up artist Michelle Mungcal. In a little over a year, the couple has made their homey boutique a destination.“My friend said this is like Other Music but for food,” Concepcion says. “We were going for an ’80s/’90s record shop vibe, where you can have a conversation with your guests. It’s not just ‘here’s a book.’ We want it to be an extension of hospitality, where chefs, cooks, and home cooks can feel at home.”Whether it’s stop no. 5 on a nationwide cookbook tour or a refuge for hard-to-find, out-of-print vintage cookbooks and indie food magazines, it’s drawn a crowd of food lovers with an emphasis on books people will actually cook from. As you peruse the shelves of chef zines and tables stocked with otherworldly ceramics and Japanese dyed cloths, you’ll run into chefs like Roy Choi, also in search of the next cool thing in food. Here, Concepcion and Mungcal explain how they channel their love of books into a business.The whole Now Serving fam: Frankie, Concepcion, and Mungcal\nPhoto by Graham WalzerSo, how’d you get into cookbooks?Ken Concepcion: After college, I got an entry-level job at the Library Ltd. in St. Louis, MO, the second largest independent bookstore at that time. I used my employee discount to buy cookbooks by Charlie Trotter, Jacques Pépin, Jean-Georges Vongerichten, and Nancy Silverton. This was in the ’90s, pre-Internet, so it was the only way to learn about these chefs. I was a painting and English major, so I would read cover to cover, then go back and look at the recipes. That’s when I fell in love with cooking and started working at restaurants.What made you decide to open a cookbook shop?Michelle Mungcal: Honestly, it was because we were at a crossroads two years ago. Ken was just promoted to chef de cuisine at Cut, but we wanted to start a family. I knew if I made him leave the restaurant world, he’d be miserable. So, we starting thinking about a cookbook store since Ken has such a significant collection.KC: Also, Cook’s Library closed in 2009. I realized L.A. really needed a place where the cooking community could not only pick up a book or find a nice ceramic bowl but share ideas. Whenever I traveled to New York City, I would always go to Kitchen Arts & Letters. Same with San Francisco and Omnivore Books on Food. Once I got back home, it was so frustrating for me as both a cook and book lover that L.A. didn’t have its own place. It wasn’t just me. Before we opened, chefs would have to do their cookbook launch at big-box stores, like I remember when Daniel Humm did a cookbook signing in a mall. It felt weird.What’s the story behind the name, Now Serving?MM: My sister and I brainstormed for months. We’d always pretend to answer the phone, thinking, What will we get tired of saying over and over again? Now Serving seemed to work.KC: We also wanted something with a little bit of intrigue and mystery. We didn’t want “Ken and Michelle’s Books.” Now Serving holds this idea of immediacy and hospitality.What did you know you had to stock once you opened?MM: Vintage cookbooks, since that was part of Ken’s education—copies of La Technique, David Thompson’s Thai Street Food, books by Diana Kennedy. Food zines that other chefs tell us about, like Compound Butter. And ceramics (I have an addiction to Minh Singer’s Iceland dishes.) At any given time, we have 1,500 books in the shop, plus JB Prince tweezers and MudSlide Stoneware fermentation crocks.KC: We ask ourselves: “Do other cooks have this?” “Would this be in a restaurant’s office or on a chef’s cookbook shelf?” We’re not going to have appliance-driven or diet-driven books or something that someone can just order online. We encourage a sense of discovery with the shop. We want it to make sense. We’re not selling garlic presses.MM: I love my garlic press!Of all the fall cookbook titles, which ones are you most excited about this season?KC: So many. Michael Solomonov and Steven Cook’s Israeli Soul. Matty Matheson: A Cookbook—he’s a cook’s cook. A Very Serious Cookbook by Jeremiah Stone, Fabian von Hauske, and Alison Roman and Estela by Ignacio Mattos and Gabe Ulla both look very cool. Jonathon Sawyer is all about vinegar, so I’m excited about his cookbook House of Vinegar. There’s also Mastering Pizza by Marc Vetri and David Joachim, the new Joe Beef cookbook, the new Dead Rabbit book, Let’s Eat France, Bong Appetit, All About Cake by Christina Tosi, and I Am a Filipino by Nicole Ponseca and Miguel Trinidad. I’m also really interested in the Bestia cookbook because the restaurant is such an institution here in L.A. and it will be a real showcase of what chefs Ori Menashe and Genevieve Gergis do. Probably one of the big ones is going to be The Noma Guide to Fermentation since René Redzepi hasn’t put out a book out in four or five years. As a chef, it blows me away that home cooks are obsessed with it too.What’s next for you guys?KC: That’s the million dollar question. We’re planning to open a luncheonette next door to Now Serving. We’re thinking a classic American luncheonette with tuna melts but also more vegetable forward dishes. After working with Wolfgang Puck for 12 years, I’m obsessed with the farmers’ market and I want to showcase their great work.Read MorecultureThe New Persian Cookbook That Recovers Memories from IranBy Mayukh SencultureChrissy Teigen on the Long Road to Making Her Second CookbookBy Alyse WhitneycultureTarla Dalal's Cookbooks Taught My Mother—And Millions of Indians—How to Cook EverythingBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-03", "author": ["Condé Nast", "Elyse Inamine"]}