{"id": "92e748f113046edb701f7197e9b80408", "url": "https://www.bonappetit.com/story/lemony-chicken-orzo-soup", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Lemon Chicken Orzo Soup is a Quick and Simple BA Recipe That's a Hidden Gem  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Vintage BA Recipe is the Definition of \"Oldie But Goodie”You can hate on orzo all you want.By Rachel KartenJanuary 30, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.This recipe, which was originally developed in 2013, goes against everything the current BA Test Kitchen believes in. It calls for boxed chicken stock, even though you’re essentially making your own by boiling the raw chicken, and it uses orzo, a pasta shape that will cause many editors here to make a face like they just bit into a sour lemon. Here’s the thing: I don’t care. Maybe it’s because I have fond memories of my mom making it for me when I’d come home from college. Or maybe because it’s truly the simplest, most comforting chicken soup ever. Either way, it never lets me down.It’s sort of a cross between a chicken noodle soup and Greek avgolemono. It has all the comforting celery and dill flavors of a classic chicken soup plus the hit of lemon you can expect from avgolemono. Except you can make it in 30 minutes flat.To make it, you cook down sliced leeks and celery, add in chicken and boxed broth (sorry, Test Kitchen crew!), season, and bring all that to a boil. Hang out for 20 minutes, then transfer the cooked chicken to a plate and shred it up. Add orzo to the broth and let that lil’ pasta cook for 8 or so minutes. Remove from heat, stir your chicken back in, add a lot of dill, squeeze in some lemon juice, and crack some fresh pepper on top. That’s it. That’s the recipe.I recently made the soup in my own kitchen, across the country from the kitchen from where my mom would make it for me, and it was just as comforting as ever. It might not obey all the current rules that the Test Kitchen editors abide by, but it holds up. Yes, nostalgia is a pretty good seasoning. But so is a handful of dill, a squeeze of lemon, and a crack of black pepper.Get the recipe:Lemony Chicken and Orzo SoupThis weeknight chicken soup goes Greek with orzo, lemon juice, and a handful of fresh dill.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Rachel Karten"]}