{"id": "92ea31fc4736aa0d846c1aaa03d00953", "url": "https://www.bonappetit.com/recipe/vegetarian-ramen", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "Vegetarian Ramen Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesI-Can't-Believe-It's-Vegetarian RamenBy Andy BaraghaniMarch 2, 20204.1(176)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThe goal here was to achieve a tonkotsu-like broth without using any meat. Tomato paste, dried shiitake mushrooms, kombu, and a little bit of butter help to get you that rich umami-like effect.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonSlotted Spoon$13 $10 At AmazonSun Ramen Noodles$6 At AmazonMedium Saucepan$39 At AmazonLadle$27 At AmazonIngredients4 servings4garlic cloves, thinly sliced¼cup plus 2 Tbsp. vegetable oil1Tbsp. black or white sesame seeds1Tbsp. gochugaru (coarse Korean red pepper powder) or 1½ tsp. crushed red pepper flakesKosher salt4scallions12\" piece ginger, peeled, thinly sliced2Tbsp. tomato paste8dried shiitake mushrooms14x3\" piece dried kombu3Tbsp. unsalted butter, cut into pieces1Tbsp. low-sodium soy sauce4baby bok choy (about 12 oz. total), quartered lengthwise45-oz. packages fresh ramen noodlesJammy eggs, toasted nori sheets, and/or cilantro (for serving; optional)Ingredient infoFresh ramen noodles can be found at Asian markets and some grocery stores. We like Sun Noodle brand.PreparationStep 1Cook garlic and ¼ cup oil in a medium pot over medium heat, stirring often, until garlic is beginning to turn golden, about 3 minutes. Stir in sesame seeds and cook, stirring occasionally, until garlic is golden brown and crisp, about 1 minute. Transfer mixture to a small bowl and stir in gochugaru; season with salt. Set garlic oil aside. Wipe out pot and set aside.Step 2Trim dark green parts from scallions and thinly slice; set aside for serving. Coarsely chop white and pale green parts. Heat remaining 2 Tbsp oil in reserved pot over medium-high. Cook chopped scallions and ginger, stirring often, until scallions are charred in spots, about 4 minutes. Add tomato paste and cook, stirring occasionally, until it begins to stick to the bottom of pot and darkens slightly, about 2 minutes. Add mushrooms and kombu, then stir in 5 cups cold water. Bring to a boil, then remove from heat and let sit until mushrooms soften, about 10 minutes. Remove and discard kombu.Step 3Using a slotted spoon, transfer solids to a blender. Add a ladleful or 2 of broth to blender and purée until smooth. Stir purée back into broth in pot and bring to a simmer over medium heat. Add butter a piece at a time, whisking to combine after each addition before adding more. Stir in soy sauce; season with salt. Reduce heat to low and keep warm until ready to serve.Step 4Meanwhile, bring a large pot of water to a boil. Add bok choy and cook until bright green and tender, about 2 minutes. Using a slotted spoon, transfer bok choy to a plate. Return water to a boil and cook noodles according to package directions. Drain and divide among bowls.Step 5To serve, ladle broth over noodles, then top with bok choy and reserved garlic oil. Top with eggs, nori, and cilantro if desired.How would you rate I-Can't-Believe-It's-Vegetarian Ramen?Leave a ReviewTell us what you thinkReviews (68)Back to TopTriangleI made this as a fun New Year’s dinner project and it was semi-successful after taking advice from the comments. I made it as written but with vegetable broth instead of water, and it still needed an extra boost of flavor in my opinion. I added a hefty amount of miso, probably like 2-3 tablespoons, and that helped give it the umami kick it lacked. I found that the broth got too thick and turned into a saucey consistency - I should have thinned it out and re-seasoned before serving. The garlic oil was delicious and gave everything a nice pop of flavor. Overall probably wouldn’t make this recipe again but it was fun to try.SoapnanaChicago1/6/2022Not sure this was a success for me.  I found the chili crisp like topping strange. Loved the bok choy and egg. The broth was lacking something. Maybe just more salt or soy sauce. Also used 12 oz of noodles and  found that more than enough for 3 large servings and the full amount of broth. It also used 3 pots, a strainer and immersion blender, multiple utensils and that was re-using the same pot more than once.  My husband liked it more than me. I like the idea and probably will make it again with some changes. Will definitely use my own chili crisp.LynnNYC1/4/2022For me, this made two restaurant-sized servings of ramen. I agree with others that you should add a couple tablespoons of miso, then salt really well. The broth is easy enough to pull together that this could be a weeknight meal. Just improvise with whatever veggies you have on hand for toppings. I hate having partial bags of stuff. I cook the whole bag of dried mushrooms in the broth, remove the extras after steeping, and slice them for ramen topping. The garlic oil is delicious; I tossed the leftovers on to  mac & cheese. ErinMilwaukee, Wisconsin12/24/2021Hey hey, as someone who’s made this twice now: 1st time bland and awful that needed loads of extras, and second time absolutely amazing — use powdered Kombu stock!!!! It’s easier, tastier and the difference was just so noticeable. Couple Tsp of miso also well recommended but really just save yourself the hassle and by the sachet kombu stuff. Enjoy!! XTomLondon, UK5/2/2021Andy. This has become one of our go to meals for weekends when we need a vegetarian meal. It is incredibly flavorful - I literally have no idea how some of the other reviewers have gotten bland meals!! Maybe they didn't use good/fresh ingredients? We have followed this to the letter every time we've made it so far and it's always amazing. Our preference is baby boy choi and jammy eggs with it. I may try adding in some miso tonight as others have recommended but really, the recipe as is is amazing. 10/10 would recommend and make again. Kelly Columbia, MO3/28/2021Talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before! This recipe is everything! My girlfriend and I tried several recipes for vegetarian ramen before this one and we were always disappointed. THIS is the recipe we've been looking for. We made a few adjustments- we didn't have kombu, we used vegetable stock instead of water, added 2T miso to the broth and topped with some sweet corn. We also made our own noodles. It was even better than we imagined, we will definitely be making this recipe again!AmélieMontréal, Canada3/22/2021Wow. I was completely surprised by this recipe. The soup has an amazing amount of body and flavor. I added a spoonful of miso and didn’t blend the mushrooms with the rest of the solids. Chicagoan3/1/2021I had my doubts while making this as there are some non traditional ingredients (butter/tomato paste); but after adding 2T miso as suggested by other reviewers, it tied together nicely. The chile oil made so-so dish elevated.AnonymousSeattle 2/18/2021Excellent recipe! Like others, I made some modifications. I salted along the way. I also made a slurry of 2T chickpea miso paste, 1T soy sauce and 1T vegetable boullion. I mixed it together and added it in at the end. I topped with jammy eggs and fried tofu. My husband loves meat and he thought this was great. Anonymousseattle, wa2/15/2021Honeslty....this just tasted like a soupy version of spaghetti with marinara sauce :/... it has good flavor though but I don't know if it's really /ramen/Anonymous2/13/2021This is an amazing recipe - no miso, mirin, tahini, sesame oil, chicken broth etc etc required.  It was AMAZING.  If your broth is bland, then salt it, for god's sake.  It was so good, I might even find a way to thicken it further and make some tsukemen with it.\n\nI was skeptical about the ingredients (tomato paste in ramen?!) but it melded with the other ingredients into a deliciously unctuous, smooth, flavor-PACKED broth.  I swapped ramen for frozen soba because I thought the buckwheaty-goodness would suit the broth better - it would have been good with either.  Also swapped the garlic chili oil (just didn't feel like dealing with it) for chiankiang vinegar and added a 30-minute soy egg (I mean, you can't go wrong with it, right?)AnonymousUpstate SC2/2/2021This is the best ramen I’ve had!! Ad a pescatarian, my ramen choices are limited. Even if I go for the chicken broth, the flavor is usually bland. This was amazing!! I took the recco from other reviews and added miso (red miso in my case). I used broth - chicken and veggie- in place of water, and cooked the book choy IN the broth (cause I didn’t have another pan). My carnivorous husband was supportive, but planning to order take out- and even he liked it! He told me to make sure I kept the garlic chili oil! May not have used as much oil as recommended in the recipe- and used avocado and sesame when it called for oil. Used about 1.5-2 tablespoons of miso and topped with roasted kale! Would be great with crispy tofu too. Delish!! AnonymousLos Angeles 1/28/2021This soup tastes like ... nothing. All the ingredients fade (including the expensive shiitakes).Had to add tons of miso, mirin, soup soy sauce, and tahini. AnonymousPalo Alto, CA1/24/2021I loved this recipe! I followed the comments and added around 2 tbsp of miso and instead of replacing the water with stock I just added a teaspoon of better-than-bouillon.  I was able to find the recommended ramen noodle brand but didn't really like them so will just stick to my usual brand of ramen next time. I will also use a little less oil as I don't like seeing a layer of oil on my broths, just a personal preference.Anonymous1/12/2021Loved this recipe and so did my family. As others stated, I added a bit of miso, fish sauce, and mirin to add more flavor. I think you could use this recipe as a base and add anything you want. I served with 7 minute jammy eggs, bok choy, and cilantro. Next time I’m not going to blend the ingredients and just serve them in the broth. I would sub vegetable broth fir water because why not? Also, used udon noodles since I had them. Very tasty and I will definitely make again. Great dish for vegetarians or carnivores alike!Molly McDonaldSt. Paul, MN1/2/2021Explore Bon AppétitSoupSoups and StewsJapaneseEast AsianAsianShiitake MushroomMushroomVegetableNoodlePasta & NoodlesBok ChoyLeafy GreensRamen NoodleMainVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-02", "author": ["Condé Nast", "Andy Baraghani"]}