{"id": "92f7dce73703051bc8ca0c44fdfe9ff4", "url": "https://www.bonappetit.com/recipe/little-wedge-salad-with-sour-cream-dressing", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Little Wedge Salad with Sour Cream Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueLittle Wedge Salad with Sour Cream DressingBy Molly BazMarch 19, 20194.4(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe KonMari'd the classic wedge, got rid of all the extraneous ingredients, and ended up with a salad that sparks joy: crunchy iceberg and a rich, tangy dressing.Ingredients 4 servingsSour Cream Dressing¾cup sour cream¼cup mayonnaise1garlic clove, finely grated2tsp. finely grated lemon zest3Tbsp. fresh lemon juice1½tsp. kosher salt1½tsp. freshly ground black pepperSalad1head of iceberg lettuce (about 1 lb.)2avocados, halved and cut into wedges1Tbsp. fresh lemon juice1small bunch chives, cut into 1\" piecesPreparationSour Cream DressingStep 1Whisk sour cream, mayonnaise, garlic, lemon zest, lemon juice, salt, and pepper in a medium bowl to combine.Step 2Do Ahead: Dressing can be made 1 day ahead. Cover and chill.SaladStep 3Trim root end of lettuce; discard any wilted outer leaves. Cut into quarters lengthwise, then cut each quarter crosswise into 3\" pieces. Without separating wedges into leaves, transfer to a large platter. Tuck avocado pieces among lettuce and drizzle lemon juice over; season with salt.Step 4Spoon half of dressing over salad and top with chives; season with pepper. Serve with remaining dressing alongside.How would you rate Little Wedge Salad with Sour Cream Dressing?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI loved everything about these cute little wedges - especially the dressing. AnonymousMilwaukee5/11/2020Doubled the recipe for a large dinner party, but otherwise made it exactly as is. It was a huge hit! AnonymousPA7/22/2019This was very good but 1.5 tsp pepper was way too much.  Next time I’d probably do .5 tsp TX6/17/2019Explore Bon AppétitSaladAvocadoVegetableIceberg LettuceLettuceLeafy GreensSummerEasyQuickSideVegetarianGluten-FreeNut-FreeKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}