{"id": "9301b641dda171a954923021c24c0344", "url": "https://www.bonappetit.com/recipe/thuppa-anna", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Thuppa Anna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueThuppa AnnaSeptember 22, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintStir-frying leftover rice in ghee with spices, curry leaves, and mix-ins such as cashews and fresh coconut elevates a staple into something luxurious. Chitra Agrawal, founder of Indian condiment company Brooklyn Delhi and author of Vibrant India, took flavor inspiration for this simple dish from her mother’s home state of Karnataka in South India, where thuppa means “ghee” and anna means “rice” in Kannada, the local language. It can be eaten on its own or served with crunchy fried pappadam or sandige and hot pickle or achar (we recommend Brooklyn Delhi Tomato Achaar, $12). It’s important to season the rice with plenty of salt; you want it to taste savory to complement the sweetness of the coconut and nuttiness of the ghee and cashews.Ingredients4 Servings4cups cooked Sona Masuri or basmati rice1cup fresh or frozen grated coconut or dried unsweetened shredded coconut½tsp. plus 2 Tbsp. ghee¼cup very coarsely chopped cashews½tsp. black mustard seeds1tsp. urad dal (optional)Pinch of asafetida4–5fresh curry leaves1dried red chile, broken in half½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus morePreparationStep 1If using freshly cooked rice, spread it out on a baking sheet and let cool. This will ensure that the grains will stay separate.Step 2If using dried coconut, place in a small bowl and pour in hot water just to cover (coconut should absorb all the liquid, so you don’t need to drain); let sit until coconut is plump, at least 10 minutes.Step 3Melt ½ tsp. ghee in a wok or large skillet with a lid over medium heat. Toast cashews, stirring often, until golden brown, about 3 minutes. Transfer to paper towels and let cool.Step 4Melt remaining 2 Tbsp. ghee in same wok, then add a mustard seed. As soon as the oil around the seed starts to sizzle or the seed moves, carefully add remaining mustard seeds, then urad dal (if using) and asafetida. Quickly cover pan and cook, shaking, until mustard seeds start popping more gradually, about 30 seconds. Uncover pan and continue to cook, stirring constantly, until urad dal turns a reddish golden brown and smells nutty, about 45 seconds; watch it closely so dal doesn’t burn. (If you aren’t using the dal, cook mustard seeds and asafetida until seeds are popping, reduce heat to low, and immediately add curry leaves and chile as directed below.)Step 5Reduce heat to low. Rub curry leaves between your fingers to release their natural oils and carefully add to wok along with chile. Cover immediately (moisture from the curry leaves will cause the ghee to spatter). Once spattering subsides, uncover and stir to evenly coat.Step 6Add rice to wok and stir to coat. Mix in coconut and salt. Cook, stirring often, until heated through, about 4 minutes. Mix about three fourths of cashews into rice. Remove from heat; taste thuppa anna and season with more salt if needed. Top with remaining cashews.How would you rate Thuppa Anna?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is fantastic.  I did not have curry leaves and subbed in pistachios for the cashews but otherwise followed the recipe.  So delicious!  And easy to make a meal with some added protein or veg.  Will definitely be making again. JillDenver, CO1/12/2021I adore Chitra's book, Vibrant India, and have made many recipes from it - all of them delicious. Seeing Chitra writing for BA made me so happy, knowing any recipe from her will be a winner, and Thuppa Anna definitely is. Rice sizzled in spiced ghee with gently toasted and warmed coconut is comfort food of the highest order in these at home pandemic days.  Had some leftover cooked chickpeas, so tossed those into the mix, too. Will put this one into regular rotation. Chicago10/18/2020Explore Bon AppétitFried RiceIndianSouth AsianAsianRiceRice & GrainsCurry LeafHerbs & SpicesEasyQuickSideVegetarianGluten-FreeSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}