{"id": "9303ef2e772844f2ced071805e7004f2", "url": "https://www.bonappetit.com/recipe/picnic-tomatoes", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Picnic Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssuePicnic TomatoesBy Omar TateJune 2, 20205.0(24)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintOmar Tate, chef-owner of the pop-up dinner series Honeysuckle, calls this simple but high-impact dish “picnic tomatoes” because that’s where his mom always served them. She’d slice thick slabs of juicy heirlooms, slather them with mayo and Italian herbs, then line them up on her antique blue glass platter before leaving the house. In transit, the salt would pull out the tomato’s juices which would then mingle with the mayo. The result was a beautiful mess of juice and cream—kind of like a BLT without the bacon.Ingredients8–10 servings2lb. heirloom tomatoes (about 3), sliced ¼\" thickFlaky sea saltFresh ground black pepper3Tbsp. mayonnaise1Tbsp. coarsely chopped basil1Tbsp. coarsely chopped oregano1Tbsp. coarsely chopped parsley2Tbsp. extra-virgin olive oilPreparationStep 1Season tomatoes with sea salt and pepper. Spread each tomato slice with  a thin and even layer of mayonnaise. Arrange dressed tomato slices in an overlapping layer on a large plate.Step 2Toss basil, oregano, and parsley in a small bowl. Scatter herbs over tomatoes and drizzle with oil.How would you rate Picnic Tomatoes?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleReally good.  Made exactly according to the recipe the first time and it was yummy!  The second time I added a clove of crushed garlic and a squirt of lemon juice to the mayo and it was even better.  Kim SMinneapolis, MN7/6/2021Haven't made it yet but I am salivating looking at it. Larry LawlessPalm Springs6/20/2021A match made in heaven! Tomatoes and mayonnaise.  Right up there with peaches in cream.AnonymousLexington, SC4/12/2021YES!!  What a wonderful use of homegrown tomatoes.  My favorite part of a tomato sandwich is usually the tomato/mayo combo, so this is a dream come true.  Wouldn't change a thing.AnonymousIndianapolis9/24/2020Love love love love love. Obviously quality tomatoes weigh heavily into the satisfaction of this recipe - but it offers the same fresh, herby, creamy deliciousness of a caprese salad without being so unoriginal. And it kicks up the umami just a notch, which I love. AnonymousSan Diego8/11/2020As delicious as it is beautiful. The perfect use of tomatoes from the garden. AnonymousJacksonville, FL8/10/2020So simple and delicious!! Mayo + juicy tomatoes is a match made in heaven. The best way I’ve seen to honor your beautiful mid-summer tomatoes in all their glory!AnonymousNew York, NY7/24/2020Explore Bon AppétitHeirloom TomatoTomatoVegetableSummerEasyQuickSideVegetarianGluten-FreeNut-FreeDairy-FreeHealthyishJuneteenthFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Omar Tate"]}