{"id": "9305556e98e24cf9a4d195c0b410b37c", "url": "https://www.bonappetit.com/story/best-ice-cube-tray", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "The Best Ice Cube Tray Gives You Perfect Cubes Without Twisting and Cracking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Ice Cube Tray Gives You Perfect Cubes Without Twisting and CrackingThe Peak Everyday Ice Tray is a serious upgrade to your standard silicone mold.By MacKenzie Chung FeganJanuary 13, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.We were sold a bill of goods. Sometime around 2010, as bartenders morphed into mixologists and the negroni became au courant, the silicone ice cube tray wormed its way into our freezers. This, the refrain went, was the best ice cube tray known to man, and it would revolutionize the home bartender’s mixologist’s cocktail game. Unlike plastic trays, which dispense ingots of ice only with rigorous torsion and cracking, silicone ice cube molds promised to produce geometrically perfect, clear ice cubes with little effort.Fancy cocktails call for fancy ice.\nCut to me with numb hands, trying and failing to twist a two-inch cube out of its compartment with ease and grace. While silicone molds are undoubtedly an improvement on the warped pieces of plastic left in the freezer by my apartment’s previous tenant, I wouldn’t call them the final form of ice cube trays. For one, the property of silicone that makes it a step up from plastic ice cube trays—its flexibility—also makes it difficult to transport from faucet to freezer. It’s floppy and sloshy, like carrying water in a plastic grocery bag. Its lack of structural integrity also means that instead of perfectly square inch or two-inch cubes, I sometimes end up with ice that is trapezoidal or globular, depending on if I managed to squish the tray against a pint of ice cream. And while it is easier to remove ice from a silicone mold…it’s still not that easy.Unless, that is, we’re talking about the Peak Everyday Ice Tray from W&P Design, the best ice cube tray I have ever used. The genius here is that the flexible silicone material is given structure by a stainless steel frame. (This engineering is similar to that of our favorite half-sheet pan, where conductive-but-warpable aluminum keeps its shape thanks to a rectangular rim of steel wire.) With the internal frame, there’s no spillage while filling the mold or transferring it to the freezer. Each tray also comes with a protective silicone lid so you can stack them on top of each other and keep those freezer odors at bay.Photograph by Isa Zapata.  Food Styling by Micah Morton.  Prop Styling by Paige HicksW&P Peak Silicone Ice Tray$14 at Amazon$14 at W&P DesignBut the biggest design improvement is that each cube resides in its own individual pocket. If standard silicone ice molds are like an apartment building, with each ice cube sharing a wall with its neighbors, the Peak ice tray is a block of fully detached single-family homes. And because the tray relies on the steel frame for structure, the food-grade silicone compartments are thinner than your average mold, allowing you to easily flip each easy-release polyp entirely inside out—no twisting, no contorting.True to its word, the Everyday Ice Tray, with its twelve small cubes of one-and-a-quarter inch ice, is my everyday favorite for iced coffee, canned spritzes, smoothies, and cocktail shakers. But I also keep the Extra Large Ice Cube Tray on hand for spirit-forward cocktails, like old fashioneds and, yes, Negronis, that call for larger cubes. Peak even makes spherical mold trays, if ice balls are your thing, and Cup Cubes, which allow you to freeze stocks and soups and baby food in six 8-oz portions. I'm thankful they're all stackable because Peak silicone trays are the only way I make ice at home now, and I need several in rotation at all times—at least until I get my nugget ice maker.W&P Peak Extra Large Cube Tray$14 $13 at Amazon$14 at W&P DesignExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-13", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}