{"id": "930d424e4c37e381261f74f2513c7f2f", "url": "https://www.bonappetit.com/story/never-fail-udon-stir-fry", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "This Udon Stir-Fry Is My Ultimate Clean-Out-the-Fridge Friday Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Udon Stir-Fry Is My Ultimate Clean-Out-the-Fridge Friday MealWhen udon know what to make for dinner, these noodles are the answer. (Sorry.)By Alyse WhitneyMay 18, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.As a once-a-week grocery shopper, Fridays are the days I have to get the most creative in the kitchen. I’m trying to turn anything left in the crisper drawer, the remnants of a rotisserie chicken, and whatever herbs are starting to wilt into what is ideally a quick meal, because it was a long damn week. The “recipe” I turn to when I’m in my most zombie-like cooking state is this udon stir-fry situation: a crispy-chewy, soy-sauced dinner that comes together in 15 minutes. I first made this when the original recipe went live last year, featuring ground pork and cabbage, and I have adapted it at least a dozen times since.What makes this udon stir-fry so great is the texture of the udon noodles themselves. They're slippery enough to be slurpable (in soup or stir-fried form) with a toothsome, chewy bite. The most important thing you need to remember is to, first and foremost, buy the right udon noodles (fresh or frozen, never dried), and also to not overcook them. The best part is that they don’t really require cooking, per se—all you have to do is soak them in a bowl of boiling water for literally one minute, and then they can hang out while you prep the rest of your ingredients. I use an electric kettle to boil water fast for this, but TBH, you could just get your tap as hot as it can go and let them soak a little longer if you’re feeling lazy. The best way to test if they’re ready—as is the case with almost everything—is to eat one. It should be warmed-through, bland and a little bit chewy, which is all going to change when they take a bath in a soy sauce-mirin combination and get crispy while soaking up every bit of flavor.Let fresh udon noodles hang out in a hot tub while you get the sauce ready.\nPhoto by Alex LauThe rest of the cooking process moves pretty fast, so the key to nailing this dish is to have all of your ingredients prepped and ready—once you start stir-frying, there's no turning back. Focus on your noodles and whatever you’re rescuing from the crisper to pair it with. I’ve added spinach, carrots, zucchini, bok choy, and onions with success, but my favorite combination is garlic, ginger, mushrooms, and some sort of protein (rotisserie chicken always works in a pinch). Shiitakes are my go-to for stir-fries usually since they cook quickly to a chewy-crisp consistency that is very similar to the udon. The most recent time I made them, I quick-braised some king oyster mushrooms in soy sauce and mirin and then added rotisserie chicken, a ton of scallions, and syrupy, thick sweet soy sauce. I’ve done it with shrimp and asparagus, and thin-sliced beef and broccoli too.Instagram contentThis content can also be viewed on the site it originates from.In an ideal world, I can make this dish without having to go to the store to buy anything, which is why I keep at least two packs of vacuum-sealed fresh udon in my fridge—they usually last at least a few months. And the noodles themselves are so tasty and satisfying that I have no problem going vegetarian if I don’t have meat in the freezer or leftovers to toss in. A 1:1 ratio of soy sauce and mirin is an easy sauce to memorize, but udon also plays nice with kimchi, butter, and an egg yolk for more decadence, or even a simple teriyaki sauce. Whatever you do, just make it quick and easy so you can get on with your life. Udon know what surprises may be lurking around the corner, but at least you know what you’re having for dinner tonight. (And if you thought you'd get through this post without a pun, udon know me at all!)Get the recipe:Stir-Fried Udon Noodles With Pork and ScallionsWith chewy noodles, crispy ground pork, and crunchy cabbage, there’s no need to serve anything alongside this quick-fire udon noodle recipe.View RecipeExplore Bon AppétitStir-FryNever FailNoodleBasicallyRead MorecookingPorky Udon Noodles That Are Better Than TakeoutBy Alex DelanytechniquesHow to Buy the Best Udon for All Your Noodle Soup NeedsBy Elyssa GoldbergrecipesThe 10 Most Popular Pasta and Noodle Recipes of 2017Gallery10 SlidesBy Alyse WhitneycookingI Can't Stop Putting Sweet Soy Sauce in Alllll the NoodlesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-18", "author": ["Condé Nast", "Alyse Whitney"]}