{"id": "931cac93ed7729c3cf6484ebaef678b7", "url": "https://www.bonappetit.com/story/can-we-respectfully-celebrate-thanksgiving", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Can We Respectfully Celebrate Thanksgiving? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCan We Respectfully Celebrate Thanksgiving?The most important food convo I had this week.By Sonia ChopraNovember 25, 2020FacebookTwitterEmailPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Have you seen the documentary Gather? It’s a beautiful film about food sovereignty—the right to healthy, culturally appropriate food produced sustainably—among Indigenous communities, directed by Sanjay Rawal. I was honored to moderate a discussion between Rawal and ethnobotanist and food sovereignty activist Linda Black Elk last night hosted virtually by the Museum of Food and Drink. I learned so much from watching the documentary (available now on Amazon or iTunes) and from talking to these brilliant folks, and I wanted to share some of my takeaways from the conversation.To be a good ally and a good citizen of the land, do your research. “One of the greatest things that people can do is know where your food came from,” says Black Elk, using Thanksgiving as an example. “The food that everyone’s going to be eating soon, where does the majority of that food come from? Corn, potatoes—potatoes are not Irish, they are indigenous. Corn is an indigenous food as well. Chocolate, pumpkins and squashes, turkeys. Know where they come from, and know about the people who have sacrificed so much to bring those foods to the world.”Want this letter before it hits the website? Sign up for our newsletter!If you’re going to eat indigenous foods or medicines, source them from Indigenous people. This is a good way to support Indigenous producers and communities, who know how to sustainably harvest their food sources, instead of taking something that they may need. Consider California white sage, which Black Elk points out has been appropriated and exploited—white sage is poached or commercially harvested and sold for profit by non-Natives looking to capitalize on wellness trends, leaving it difficult for Indigenous communities to access what they need. “If you are getting that from an Indigenous person, absolutely take it and use that in a good way,” she says. “But don’t buy it from a major chain or a convenience store where it comes in a little shell.”The pandemic has exposed the terrible cost of divorcing Indigenous people from their food systems. Native Americans are four times as likely to be hospitalized due to COVID-19 than non-Hispanic white people, and Black Elk says that goes back to food. “It goes back to eating all of these colonized foods for so long that has caused these incredible rates of diabetes, heart disease, and asthma. Those are the risk factors for complications and death from covid, so it’s this vicious cycle that’s often due to this lack of food sovereignty.”Since the pandemic started, Black Elk says, “There have been so many deaths of fluent speakers, of elders, of people who hold knowledge about food, and language, and medicine,” and that it’s important to prioritize passing that knowledge around. “When the pandemic got really serious here, we started drying meat. We started teaching people, whether they were Indigenous and not, how to save food, how to preserve food if you don’t have electricity.”In Gather, forager Twila Cassadore hunts pack rats.\nPhoto by Renan OzturkUnderstand how food sovereignty applies to you. Rawal says, “Food sovereignty in non-Native communities means understanding who the producers of our food are, understanding that our support needs to go to them, and that it’s important to make sure we know our farmers, know our grocers, know how they treat their workers. Know that you might need to pay a little more to ensure that they remain. The tighter the community is, the stronger and more resilient our local food systems will be.”Think about who is telling the stories. Black Elk and Rawal agree that there is a difference between telling Native stories and giving people space to tell their Native stories. “Most people learn about Indigenous cultures from media made by non-Indigenous people, which can skew stereotypical, biased, and even derogatory and discriminatory,” Rawal points out. “The type of romanticizing, the tropes that people expect to see in Native-American stories—we didn’t care about that [in our film]. We didn’t care to elaborate on the history of genocide because there are no Native people, I believe, that don’t know about genocide. We focused on characters; we focused on healing narratives.”Is there a way to celebrate Thanksgiving and still be respectful of Indigenous people? When people ask her this, Black Elk’s “very simple” answer is no. “You can’t celebrate the day, but you can have a day where you talk about the history, where you talk about the truth.” She points out that some people have started using terms like ‘Thanks-taking’ and ‘Truths-giving’ to acknowledge the difficult history behind the day. “It’s okay to be honest, it’s okay to tell the truth, and still be a thankful person,” she says.How to further support Black Elk, Rawal, their work, and Indigenous communities. Rawal suggests donating to First Nations Development Institute, the co-producers of the film. “They’re accepting donations for long-term COVID relief, which means rebuilding Native food systems. 100 percent of donations go to that work, which is happening across Indian Country.”Black Elk and her husband, Luke Black Elk, through his family’s non-profit, have been making food kits filled with Indigenous foods for elders. To support this work, Venmo Black Elk at @lindablackelk.Please consider watching Gather this weekend. If you do, I’d love to hear what you think. As always, I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-26", "author": ["Condé Nast", "Sonia Chopra"]}