{"id": "932c3b1f897f607e596c715ed90f6f46", "url": "https://www.bonappetit.com/story/jon-and-vinny-delta-airplane-food", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Yes, Airplane Food Can Actually Be as Good as Restaurant Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYes, Airplane Food Can Actually Be as Good as Restaurant FoodL.A. chefs Jon Shook and Vinny Dotolo have it down to a science.By Adam RapoportMay 27, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.When I heard that Jon and Vinny (a.k.a. chefs Jon Shook and Vinny Dotolo) had started doing food for Delta, I was skeptical like everyone else. I mean, how good could airplane food be (even it was being served in the big, cushy seats up front)? But then last summer, on my way back from L.A., there I was, staring down a BLT. Like, a real BLT—two slices of griddled Pullman loaf, crisp, thick-cut bacon, plump tomatoes, little gem lettuce, and homemade aioli. Oh, and homemade potato chips on the side, no less. Jon and Vinny (which is what everyone calls them in L.A., and they even run two hugely successful Jon & Vinny’s restaurants) hooked up with Delta last summer. They now produce nearly 800 meals a day in a catering facility in Inglewood for the carrier’s Delta One flights from LAX to JFK, Boston and D.C., as well as destinations as far flung as Sydney and Paris. They use all the same purveyors and farmers market favorites as they do for their numerous restaurants around the city. But, as detailed below, with their signature meatballs in pomodoro—a must-order both at Jon & Vinny’s and on Delta— they face challenges that no earth-bound chef would ever have to deal with. Here’s how they manage.The AppetizerEverything Shook and Dotolo serve on Delta One they make from scratch, which equates to more control over quality and costs. Here they hot-smoke Coho salmon in-house, blast-chill it, then break it into slabs for a rustic look.The BreadFocaccia is baked and grilled at the duo’s catering facility, then rubbed with a chile-garlic butter once cooled to protect the bread against its worst enemy (drying out) with a layer of fat.Shook and Dotolo outside of their catering facility in L.A.\nThe MeatballsHow do flight attendants fit all those little trays in their carts? No dish can be taller than two inches. “Otherwise the meatballs are the same as what we serve at Jon & Vinny’s,” Shook says. “Brisket and pork shoulder, with pomodoro made from cans of Bianco DiNapoli organic crushed tomatoes and served with a dollop of ricotta and garlic bread.”The SaladSupplying Delta with 1,200 meals a day means lots of salad, which translates to 50 cases of crisp Little Gem lettuce sourced from the Santa Monica and Hollywood farmers’ markets twice a week.The Dressing“Since food is stored at cold temperatures on the plane, olive oil congeals,” Dotolo explains. Buttermilk FTW.Explore Bon AppétitAirplane FoodTravelDish DecodedRead MorecultureThis Might Be the Best Food Gig EverBy Gillian FergusoncultureRed Sauce Meets California at Jon Shook and Vinny Dotolo's New L.A. RestaurantBy Elyssa GoldbergrestaurantsThe Only Thing Better Than Vodka Sauce Is Spicy Vodka SauceBy Josie AdamscultureChefs Jon Shook & Vinny Dotolo On Kitchen Fires and Feeding ModelsBy Josie AdamsPhotography by Elizabeth LippmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-27", "author": ["Condé Nast", "Adam Rapoport"]}