{"id": "932cca1a41f1d2d8f6814a8ca6c8c846", "url": "https://www.bonappetit.com/recipe/big-beans-and-tomato-vinaigrette", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Big Beans and Tomato Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueBig Beans and Tomato VinaigretteBy Kelly MarianiJuly 9, 20195.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintIf you’d like, soak the beans overnight before cooking; it will help them cook more quickly and evenly. The key thing, though, is to be very gentle with the beans while they simmer so they don’t break apart in the process. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients4 servingsBeansHandful of oregano sprigsHandful of thyme sprigs2bay leaves8oz. dried butter beans, rinsed, soaked overnight if possible1medium onion, halved1large carrot, scrubbed, coarsely choppedKosher salt¼cup extra-virgin olive oilVinaigrette and Assembly10oz. cherry tomatoes or 1½ cups chopped heirloom or beefsteak tomatoes1garlic clove, smashed3Tbsp. red wine vinegar⅓cup extra-virgin olive oil, plus more for drizzlingKosher salt2lb. assorted heirloom, beefsteak, and/or cherry tomatoesFreshly ground black pepperHandful of basil leavesMild red pepper flakes (such as Aleppo-style or Maras)PreparationBeansStep 1Tie together oregano, thyme, and bay leaves with kitchen twine. Combine beans, onion, carrot, and herbs in a medium pot. Pour in water to cover beans by about 4\" and bring to a very gentle simmer over medium-high heat. Immediately reduce heat and cook at the barest of simmers, stirring hardly at all, until beans are creamy and tender at the center but not falling apart or mushy, about 1½ hours (this could take longer, depending on the beans). The key is to not agitate, which will help the beans maintain their shape. Remove pot from heat; season beans aggressively with salt. Gently stir in oil. Let cool. Drain beans; discard onion, carrot, and herbs.Step 2Do Ahead: Beans can be made 2 days ahead. Keep in liquid; cover and chill.Vinaigrette and AssemblyStep 3Purée cherry tomatoes in a blender. Transfer to a small bowl and stir in garlic, vinegar, and ⅓ cup oil; season with salt. Let sit 15–20 minutes, then pluck out garlic.Step 4Transfer drained beans to a medium bowl and add vinaigrette; toss gently to coat. Taste and add more salt if needed.Step 5Slice, halve, or quarter heirloom tomatoes and arrange on a platter or divide among individual plates. Season with salt and pepper and drizzle with oil. Spoon beans along with plenty of vinaigrette over; top with basil and a few pinches of red pepper flakes.How would you rate Big Beans and Tomato Vinaigrette?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleWOW these are great! It's March so I didn't have any big heirloom tomatoes to use, so I just made this with the beans and vinaigrette, using Rancho Gordo scarlet runners. Just fabulous. Because I didn't have the tomatoes for the salad, the vinaigrette could have easily accommodated 3/4 lb of beans or maybe more, so if you're making this without the extra tomatoes like me, be sure to scale your beans up a bit. Definitely refrigerate these overnight to let the beans marinate, and then let them come back up to room temp before serving. They're awesome as-is, but would be over the top with a bit of goat cheese and baguette...KatieChattanooga, TN3/24/2022Used Royal Corona beans from Rancho Gordo - plan to have these jumbo beans take a bit longer to cook than their Butter Bean cousins - but otherwise per recipe. Delightfully delicious and easy. Not to mention the \"aaahhh...\"roma of beans simmering is blood pressure lowering therapy.dimmerswitchBoise ID9/29/2021I don't usually like beans much, but the vinaigrette was so AMAZING!  It made this a dish that I'll use regularly for my vegan guests, and my husband.  I also just made the vinaigrette as a dressing for other vegetables and people were struck with how tasty it was.  I have a small Ninja and it fitted perfectly in this easy-to-clean blender.  LynnBuffalo, NY8/23/2021SO yummy! I used BA's Pressure-Cooker Gigante Beans in Tomato Sauce recipe to make instant pot gigante beans for this recipe - highly recommend if you forget to soak beans overnight or just want something quicker. I also made croutons from a near-stale loaf of sourdough and threw those in to soak up all of the vinaigrette... highly recommend! A really lovely way to honor summer's best vegetable :) California8/13/2020The vinaigrette is what makes this dish outstanding! DO add the vinaigrette to the beans and refrigerate at least 24 hrs. before serving to allow the flavor to penetrate the beans for the most enjoyable dining experience. I also added some crumbled feta cheese to add more protein and augment the taste as well. This is a recipe to keep handy as it needs to be made over and over again.munch88NYC7/31/2020This turned out delicious -- I added feta crumbles and didn't have red wine vinegar so subbed in white vinegar, and also subbed navy beans because that's what I had. That tomato vinaigrette is the star, it adds delicious flavor to the beans. The leftover beans store very well in the vinaigrette and get more flavorful the longer they sit. I got three meals out of this recipe, which was great for quick lunches on days two and three!nrestmeyerSacramento7/30/2020I made this last year for a church picnic and it got rave reviews. It really does taste better the next day. I've been wanting to make it again, but could not find the recipe, but here it is. The tomato vinaigrette is awesome.TomKay4834Clarkston, MI7/11/2020I don’t love beans but this was delicious. I stored the leftover beans in the vinaigrette and they were amazing the next day.kyliedixonVancouver9/12/2019This was absolutely delicious. I found butter beans at the farmer's market, and knew I had to make this. I had never cooked beans on the stove top before, but this dish turned out perfectly. I soaked my beans overnight in cold water in the fridge. The skins appeared wrinkled after soaking, and some skins wanted to come off, but once they had been simmering for awhile on the stove, the skins went back to normal and the beans did not look wrinkled anymore. Some of the beans cooked too quickly and turned too soft, but most of them were firm on the outside, creamy and buttery on the inside, and worked perfectly in the dish. I am not a bean expert but I made it work by forging ahead! Please do make this dish, it tastes fresh and bright like summer and made me very happy. Make sure you have a very good olive oil to use also. Drinking the sauce off of your plate at the very end is wonderful.lifeis_shortLos Angeles, CA9/11/2019Explore Bon AppétitSaladSalad DressingLima BeanWhite BeanBeanVegetableCherry TomatoTomatoHeirloom TomatoSummerSideDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishSimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}