{"id": "93304b19274251cd1db8ba8073f8a7f2", "url": "https://www.bonappetit.com/story/coloring-cookbook", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "The Little Coloring Book of Sweet Recipes Lets You Bake LA’s Finest Pastries—and Color Them Too | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBake L.A.’s Finest Pastries—and Color Them TooI love this cookbook. I love this coloring book. I love this combination cookbook and coloring book.By Justine LeeJuly 27, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.My body physically resides in New York City, but my heart beats for Los Angeles—at least as far as dessert is concerned. My palms get sweaty thinking about thick slabs of gooey, vegan, chocolate chip banana bread studded with crunchy boulders of peanut streusel from Valerie Confections. Rustic Canyon’s honeycomb ice cream (with crackly bits of actual honeycomb candy) never fails to leave me in a dreamy sugar-induced haze. And I’ll take a dozen of Zooies rich and chewy oatmeal raisin cookies over the ones from a rather famous Upper West Side bakery I live only minutes away from. As a professional recipe developer whose days involve a lot of baking, take it from me: L.A.’s pastry game is world class.I suppose now is a great time to let you know that I’ve actually never been to L.A., or even California for that matter. But thanks to the Little Coloring Book of Sweet Recipes, I’ve sampled eight of the best desserts the city has to offer. Illustrated by artist Stacy Michelson and published by the L.A. Times, the recipes are curated from the finest bakeries and restaurants in the city. The instructions for every sweet are super well written, full of visual cues, and approachable, so even though I’m a recipe nerd, a more novice baker will have no problem following along.But as the name suggests, this is not only a cookbook—it’s a coloring book as well. Michelson’s food-focused visual journalism (which you can check out in her newly published book) joyfully personifies the featured desserts. Think sassy layer cake slices with long eyelashes, a wobbly flan juggling orange segments, a burnt Basque cheesecake looking nonplussed despite being completely aflame. All the images are printed with enough space for easy coloring. After a day of work, I grab this book along with my favorite pastel Sharpies and collapse onto my yoga mat, reverse savasana, to scribble my heart out for a few hours (self-care takes many forms!).I’ve lost track of how many times I’ve made Proof Bakery’s light and bright citrusy scones. But I can’t wait to make it out to L.A. to sample the real deal—and when I do, I’ll be sure to pack this booklet as a trusty field guide for my much anticipated bakery crawl.Photo by Emma FishmanLittle Coloring Book of Sweet Recipes$12 at Los Angeles TimesExplore Bon AppétitShoppingHighly RecommendBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-27", "author": ["Condé Nast", "Justine Lee"]}