{"id": "9341fb019165f2562dbd4a19d0556aa4", "url": "https://www.bonappetit.com/story/east-wind-snack-shop-brooklyn", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "I Moved Just to be Closer to East Wind Snack Shop in Brooklyn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Picked Up My Life and Moved Just to Be Closer to This Brooklyn Dumpling SpotAfter a taste of East Wind Snack Shop’s dry-aged beef potstickers, wouldn’t you?By Chris MoroccoFebruary 7, 2020FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Milling around at a tofu event (what lives we lead at BA!) years ago, I was blown away by chef Chris Cheung’s tofu-stuffed bao, a rare moment of true eye-widening deliciousness. He mentioned he had a small restaurant, East Wind Snack Shop in Windsor Terrace, a few subway stops north from where I lived at the time in Brooklyn. Just weeks later, I found myself sitting down to dry-aged beef potstickers and Happy Buddha vegetables.East Wind is a dollhouse-size restaurant on a quiet residential block. The kitchen is really just a series of induction burners and a minuscule prep counter, with all the cooking happening in plain sight. Videos of Cheung making dumplings on TV series like “The Martha Stewart Show” play on a monitor on the wall, and seating is limited to a few small tables and tight counters with wooden stools. Yet, there are few places more welcoming and friendly in all of Brooklyn.East Wind Snack Shop is my home away from home. \nDespite what appears to be a carb-heavy menu centered on dumplings and noodle dishes, the food stays light, thanks to crunchy, fresh vegetables and balanced flavors throughout. Pan-fried noodles have just enough salty-sweet dressing. The Happy Buddha vegetables are uniformly crisp-tender, bite-size sections of blanched long beans, delightfully tiny baby bok choy, water spinach, king oyster mushrooms, and mung bean sprouts, all drizzled with a gingery scallion, cilantro, and lemon puree and topped with fried garlic and sesame seeds. The briny-sweet shrimp filling in the har gow nearly explodes with juiciness. Even the deeply beefy potstickers manage to feel restrained with exceptionally thin, blistered handmade dough wrappers.After that first visit, years went by (and Cheung opened up three more outposts of East Wind in Brooklyn). Then one year ago, my family moved to the same neighborhood as the original shop. It was a hellacious journey through the Brooklyn real estate market, but once we found our place and the movers departed, we celebrated with a trip to East Wind. Adrenaline-spent and ravenous, I looked down at my table full of gorgeous stir-fried vegetables, plump dumplings, and pork belly bao, and knew: I was home.Go there: East Wind Snack ShopExplore Bon AppétitHighly RecommendRestaurantsBrooklynNew YorkDumplingsRead MorerestaurantsI Douse Everything in Hot Sauce, But This Cooling Silken Tofu Won Me OverBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-07", "author": ["Condé Nast", "Chris Morocco"]}