{"id": "934dfecf37a87a076b9952f850ae4664", "url": "https://www.bonappetit.com/recipe/summer-beans-with-miso-butter", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Summer Beans with Miso Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSummer Beans with Miso ButterAugust 1, 20184.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintIf you don’t feel like smoking up your kitchen by charring the beans on the stovetop, try grilling or just blanching them instead. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings¼cup (½ stick) unsalted butter, room temperature2Tbsp. white miso½serrano chile, finely grated1½\" piece ginger, peeled, finely grated12oz. Romano, wax, and/or green beans2tsp. extra-virgin olive oilLime wedges and toasted sesame seeds (for serving)PreparationStep 1Stir butter, miso, chile, and ginger in a small bowl until smooth.Step 2Heat a large skillet, preferably cast iron, over medium-high. Toss beans with oil in a medium bowl, then add to skillet. Cook, tossing occasionally, until charred in spots and crisp-tender, about 4 minutes.Step 3Spread miso butter on a platter. Arrange beans over. Top with sesame seeds, then squeeze lime wedges over.How would you rate Summer Beans with Miso Butter?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI was already in the habit of making a pan of charred beans as a light lunch so this was an obvious win- but the amount of miso butter was maybe double the amount needed to sauce the beans to my satisfaction. Which is fine because I just saved the rest. Jake6/18/2021This was delicious! Used string beans and had as a side with grilled meats/veggies. Make sure the butter is very soft and the miso has been out of the fridge for some time so the two combine without lumpsAnonymous8/31/2019Delicious!  That's going to be a repeat around here.  The miso sauce is fantastic.AnonymousDC8/7/2019Delicious and super easy! Great summer meal. AnonymousNew York8/3/2019This recipe was everything I was looking for, and more! If anything, just do yourself a favor and make the miso butter -- I'm going to put this stuff on everything from now on. Next time, I'll add a touch more of the chile!bmacna128/6/2018Explore Bon AppétitAmericanJapaneseEast AsianAsianGreen BeanVegetableMisoCondiments, Sauces & PastesSerrano ChileChileGingerHerbs & SpicesSummerQuickEasySideVegetarianHealthyishSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast"]}