{"id": "934f3a8eceed90872c964591a14b01a6", "url": "https://www.bonappetit.com/story/compostable-kitchen-goods", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "6 New Compostable Kitchen Products to Add to Your Arsenal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSwap in These 6 New Compostable Kitchen ProductsCompostable cling wrap? Welcome to the future.By Alex BeggsJune 30, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah Morton, Prop Styling by Nicole LouieFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My mom used to fling banana peels out of the car window shouting, “They’re biodegradable!” (don’t do this) and then she’d go home and cover enchiladas with plastic shower caps that have probably dissolved into microplastics that fish gobble up. You know that’s what happens, right? THEN WE EAT THE FISH AND THE LITTLE PLASTICS. In my most skeptical moments—especially after watching this John Oliver segment about how corporations don’t give more than a PR hoot about their plastic waste—I’m like, it’s too late. We ruined everything. But that’s a terrible way to think. We (people + corporations) can all use less plastic, period. It’s easier than ever.The truth about “compostable” and “biodegradable” goods, though, is that many of them are probably not going to turn into mulch in your backyard tomato pots. Some of these new products need to go to commercial composting facilities to be processed. Luckily, many cities have these facilities, including mine, Ann Arbor. Shout out to the giant stinky compost bin that’s bigger than my garbage bin, swarmed by flies in my driveway. Love that guy.These new kitchen products are cool and compostable. Check ‘em out, and write your city council rep so you can get a sweet, stinky compost bin like mine.Compostic Cling WrapA new company, Compostic, sent me their green-tinted cling wrap (they also make compostable not-plastic bags) to try out and I was wary it wouldn’t hold a beeswax candle to my Glad wrap. But it’s certifiably clingy. The jagged edge where you rip off the wrap isn’t as sharp, making tearing each perforated sheet a little tricky, a little annoying. (I get why—the box itself can be composted.) Unlike other compostable goods, this wrap can actually break down in your backyard bin “faster than an orange peel,” according to the company. I wrap cheese chunks in it.Compostic Cling Wrap$24 at AmazonClorox Compostable Cleaning WipesAfter a record-breaking year selling out of wipes to stockpiling customers, Clorox came back to the market with a new compostable version of their handy cleaning wipes. These are made of “hydrated silica” and “plant-based cloth.” No word yet on what plant that is, but these can go in your backyard compost if they make up no more than 10 percent of your compost pile. (A gross side note: you can’t compost these if you use them to clean up non-compostable stuff like cat barf or potty-training...messes.)Clorox Compostable Cleaning Wipes$22 at Amazon – Pack of 3Food52 Sponge ClothsAlso known as “Swedish dishcloths,” these plant-fiber-based, spongy, super-absorbent cloths are my favorite thing to wipe down my kitchen counters with because they don’t leave puddles like some OTHER sponges. They get a little gnarly, a little gray, after a few weeks of use, but you can toss them in the laundry to revive ‘em. When they really die, you can compost them (either backyard or municipal).Photo by Ty Mecham/Food52Food52 Compostable Sponge Cloths$49 at Food52 – Set of 10Responsible Products Zippered BagsYou have approximated 347 options for anything-but-Ziploc-bags now, from silicone Zip Top bags to remember jam jars? But certain situations demand something lightweight, reliably zippy, and okay-if-it-gets-tossed (group snacks, field trips, etc.). Responsible’s zippered bags feel like crumply real plastic, are tinted green, and get the job done. These cannot go in backyard compost bins, so make sure to dispose of them with your city or municipality. Responsible also makes plates, to-go cups and containers, garbage bags, and utensils, and they offer wholesale quantities for businesses or someone throwing a party for 1000.Responsible Products Zippered Bags$15 at AmazonZero Waste Club Coconut Scrub PadsIt’s hard to find an eco-friendly sponge out there that can compete with what-can’t-she-do Scrub Mommy. But these coconut husk scrubbers are closing in. They’re biodegradable, and while they look tough, they won’t scratch your dishes. One reviewer boldly says, “I will not go back to sponge.” Note, these might shed a bit—but that’s what sink strainers are for. For tougher crusted-on gunk in your pans, try a bamboo scraper with a clever rounded edge that our art director loves (no shedding!).Coconut Scrub Pads$7 at Zero Waste Outlet – Pack of 5Knork FlatwareThis bamboo + sugarcane flatware is very cute and comes in the happiest blue—but it also takes two years to compost, something to consider when deciding how you’ll use ‘em. On the other hand, because they’re so sturdy, you can actually throw these in the dishwasher, and Food52 says they can handle around 400 washes. These would have come in handy when I had my nieces over and one took my stainless steel Sabre fork and started stabbing the brick patio. Give that kid some compostable flatware!Photo by Ty Mecham/Food52Reusable and Biodegradable Astrik Flatware$48 at Food52Explore Bon AppétitShoppingSustainableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-30", "author": ["Condé Nast", "Alex Beggs"]}