{"id": "934f01e7cc01ad05c943b77362732ee1", "url": "https://www.bonappetit.com/story/amy-sherman-palladino-hates-small-plates", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Ban All Shared Plates! And Other Strong Opinions from the 'Marvelous Mrs. Maisel' Co-Creators | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBan All Small Plates! And Other Strong Opinions from the ‘Marvelous Mrs. Maisel’ Co-CreatorsDon’t even try to share with Amy Sherman-Palladino and Dan Palladino.By Alyse WhitneyDecember 17, 2018FacebookTwitterEmailIllustration by Simon LandreinFacebookTwitterEmailToddlers running around and screaming. Parents drunk on mimosas at 11 a.m. A shared plate with four crostini set down at a table of three. This is what hell looks like for Amy Sherman-Palladino and Dan Palladino, the award-winning writer-director-producers behind The Marvelous Mrs. Maisel, Gilmore Girls, and Bunheads. The pair eats out a lot, and they have plenty to say about what drives them insane—including small plates, molecular gastronomy, and the general lack of a decent salad. The two are about as fast-talking, quick witted, and animated as any one of their characters, trading punches (and punchlines) while the other holds. Here, in between bites of corned beef and turkey “Midge” sandwiches at the recent Marvelous Mrs. Maisel Carnegie Deli popup in New York, they kvetch about their most profound dining nightmares, and offer up one very simple suggestion to any chef who’ll listen.Dan Palladino: I have not adjusted to the shared plate thing at all. It's always awkward for me. Let's say there's four things on there and there's three people—no one will take the fourth one because everyone's too afraid to overstep the bounds. I never know what to eat, I'm always so nervous about sharing. I just always want my own thing.Amy Sherman-Palladino: Your issue with that is because food was very competitive in your family. If you didn't get to that thing that you liked quickly, it wasn't going to be there and you were going to be stuck with the thing you didn't like. Your brother and sister were hungry, and they would always come and take your food.Dan: It was a little competitive. My mother wasn't Italian, so she didn't make an abundance of food. She made servings, so there were specific servings.Amy: Yeah, I had friends like that. You'd go to their house and there'd be four people and there'd be four pork chops, and four perfect portions of peas.When I make Thanksgiving dinner, I always make two turkeys in case I fuck up one. I believe in over-serving, in having an overabundance of food when people come over. Nobody should ever feel like they're going to go home hungry or there's not enough of the thing that they like.By the way, shared plates are not my favorite thing either, because I'm an only child and I like my stuff. We try not to go to those restaurants.Dan: It's when other couples say, \"Hey, let's go to so-and-so,\" and I don't want to be a party pooper, so we do it. I'm very, very nervous. I try to make sure that the stuff ordered is what I will eat. That's the other thing: Because I'm not a foodie, I'm very picky. I'm just always nervous about how to pick, when to pick, what to leave. It's just nerve racking.Amy: But we do tell people that we don't do brunch. We hate brunch, we hate the concept of it.Dan: It's not a real meal.Amy: It’s not a real meal! There's either breakfast or lunch. It's an excuse for people to get drunk at 11 o'clock in the morning, and assume that everyone's going to be fine with their children screaming and running around a restaurant. That's the only reason that brunch exists. So that is the one thing. When people are like, \"Let's do brunch.\" We're like, \"We can't, we don't. We'll have dinner with you, we'll have drinks with you, we'll have any legitimate meal that wasn't made up, but we will not do brunch.\"Dan: Anthony Bourdain, I think, was the one who pointed out in his book [Kitchen Confidential], that it’s the “F You” meal—that's the one that none of the chefs want to prepare, none of the waiters want to work at. It's a room full of unhappy workers making food.Amy: Just have a nice breakfast. Have some eggs and bacon.Dan: Diners. We like diners. But any restaurant that tells you, “Order whatever you want, but it's going to come out when we think it's ready—”Amy: I am paying for this. I should get the salad before the hamburger if I want the salad before the hamburger. We don't do omakase or prix fixe. I don't want them to tell me what I'm going to have. I don't want one quail egg with a sprig in the middle of it. I don't want anything that came out of a science lab. I don't want things that smoke, or a strawberry that's not really a strawberry. Just put a damn salad on the menu. It doesn't need 15 different ingredients in it, it doesn't need nuts and twigs and fruit, and flowers... just some nice lettuce, maybe a radish and a light dressing. Just have one damn salad on the menu that's not terrifying. That's it.Dan: Yeah, because we often have to order them off the menu. Just put it on the menu.Amy: Everybody likes a nice, small salad. And they feel like a schmuck asking for it. Oh, and I don't understand the no bread thing, that you have to order bread or pay for a bread basket. Just give me the bread!Explore Bon AppétitTvRantsRead MorecultureRachel Brosnahan's Winter Strategy Involves Bone Broth and Swaddling Her Dogs in BlanketsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-17", "author": ["Condé Nast", "Alyse Whitney"]}