{"id": "93514370b63d4ad2bd525403617285fd", "url": "https://www.bonappetit.com/story/calzuro-clogs", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Calzuro Clogs Are in the Kitchen Clog Hall of Fame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureClaire Saffitz Introduced Me to My Favorite New ClogsThey’re lightweight, cushy, and crazy looking.By Alex BeggsFebruary 10, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Clomp clomp clomp. Do you hear that? It’s me, clomping my way around the island of Manhattan in my wooden-heeled, well-worn Dansko clogs. I love them, it’s true, it’s on the record. But when I saw Jelly Belly expert Claire Saffitz wearing a pair of ventilated, Smurf-blue Calzuro clogs recently, I had to have a pair. Unlike my bulbous Danskos, these have a sleeker shape and a short heel that helps “reduce fatigue,” but most of all, they’re lightweight and quiet. Order up!Others have written Calzuro appreciations before me. The high-tech co-polymer composition plastic clogs are beloved especially by medical professionals (you can easily clean them in the washing machine—or dishwasher, and bleach to de-germ as needed). There’s something cooler-than-a-Croc about Calzuros—because they’re made in Italy??—but they’re still decidedly oogly. You can get them with ventilation holes if you have sweaty feet, or not, if you plan on spilling soup on them.The, ahem, practical design gets overshadowed by the bright Matisse blue color I got them in; it’s cheerful and inviting. They have a subtle glitter, like my eyeshadow primer and concrete sidewalks. Senior food editor Anna Stockwell has a pair that’s Starbucks-straw green, to which she added some yellow straps (sold separately!). A Calzuro rep told me that people really like to express themselves with different strap colors. That stayed with me for a while.(Fun fact: Some people refer to the straps on the back of clogs as “sport mode.” Recently, I saw a TikTok where a guy says, “Gotta put these into four-wheel drive,” and then he pulls down the heel strap on his Crocs and walks through some snow. Great news: The straps on the Calzuro give you that option too.)Claire was wearing hers with tiny no-show socks and the whole fit, as they say at Gentlemen’s Quarterly, was strong. It said, “Don’t worry about my feet, worry about my food.” Free from distractions, we can strive towards greatness, ya know?Buy them: Metallic Blue Calzuro Upper Ventilation Holes, $104 on Amazon(Don’t forget a comfort insole!)All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MorecultureIt Never Occurred to Me to Have Cooking Shoes, Now I Can’t Cook Without ThemBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-10", "author": ["Condé Nast", "Alex Beggs"]}