{"id": "935b9481e4aff2c209f1409f20506a45", "url": "https://www.bonappetit.com/story/this-trick-makes-tomatoes-more-tomato-y", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Why You Should Salt Your Tomatoes to Make Them Taste Sweeter, Juicier, and More Flavorful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Trick Makes Tomatoes Even More Tomato-yHow to help your tomatoes become their best selves.By Emma WartzmanJuly 24, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailYou’ve heard us sing the praises of salt before. It’s the single most essential ingredient in your kitchen. The biggest mistake people make when cooking is not using enough of it. So on and so forth.By this point, then, you know to salt your pasta water with a heavy hand. And maybe you know to salt your potato water until it has reached ocean-levels of salinity, too. But today we’re here to talk about the importance of salting your tomatoes.Tomatoes are different than pasta and potatoes, of course. They’re not dense carbs that taste like absolutely nothing unless they’re properly seasoned. So why, you might wonder, is a generous sprinkle necessary? Why—especially when tomatoes are at peak-season ripeness and taking a bite of one almost feels like eating a Gusher—must you do more?There are two reasons. One, as senior food editor Molly Baz put it, is that “salt makes food taste more like itself.” This is particularly useful when tomatoes are used in a recipe with a lot else going on. Take this Fancy and Beautiful Tomato Salad, for example. Tomatoes are the star, but there are other intense flavors making moves, too. Herbs, lemon, za’atar, and feta are all fighting for your attention, so you want your tomatoes to be their most tomato-y selves in order to stand out. The salt actually highlights the tomatoes’ sweetness by acting as a foil. Think about it: That’s why there’s salt in nearly every baked good. In the case of tomatoes, the salt is also drawing water out, intensifying the fruits’ natural flavors.In this ultimate caprese, the tomatoes are generously sprinkled with salt. Amen!\nLaura MurrayThe second reason to salt tomatoes is for tomato juice.  In some cases, like with eggplant, zucchini, or cucumber, the liquid that salt draws out is remnant of murky water and can go. All you want is the veg itself, primed for caramelizing, frying, or smashing.But tomato juice is delicious and should be just as prized as the tomato itself. Just like when you're macerating berries in a bit of sugar and salt, the liquid becomes part of the dish. In that tomato salad, it mingles with the dressing, marinates the feta, and coats the pita chips until they become gloriously crispy-gone-soggy.So what are you waiting for? Stop reading this article (oh look, it's nearly done!), go buy some glorious summer tomatoes, and salt away.Tomato time:Fancy and Beautiful Tomato SaladHere’s the first thing you should make when you want to show off the peak-season tomatoes you’ve been waiting all year for.View RecipeExplore Bon AppétitTomatoRead MorecookingThese 2 Ingredients Make Even Mediocre Berries Taste IrresistibleBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-24", "author": ["Condé Nast", "Emma Wartzman"]}