{"id": "9361a3bcb9216448792fc16304322d6d", "url": "https://www.bonappetit.com/story/uk-8-not-to-be-missed-restaurants-in-edmonton", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "8 Not-to-Be-Missed Restaurants in Edmonton | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored8 Not-to-Be-Missed Restaurants in EdmontonBy Destination CanadaJune 14, 2019FacebookTwitterEmailCOOPER & O’HARAFacebookTwitterEmailEdmonton is somewhat of a renaissance city. It’s cool, but coy. Has a lot to offer, but doesn’t want to brag. The capital of Alberta, Edmonton is a center for culture and education, and hosts a thriving arts scene. In recent years, a crop of new restaurants has arrived—like the crowd-pleasing Biera and cocktail-centric Clementine—giving Edmonton major cred in the food world. Area chefs aren’t simply satisfied with making good food; they’re making it artful, interesting, and as local as it comes. Whether they’re boasting farm-to-table traditions or a menu beholden to all-things Italian, these are eight restaurants you won’t want to miss in The Big E.BieraSUECH + BECKChef Christine Sandford is not interested in making standard beer-garden fare. With her impressive resume in tow, having spent time at Michelin-starred In de Wulf and La Buvette in Belgium, she creates a space for lovers of both fine food and great beer. (Biera shares space with Blind Enthusiasm Brewery.) Simple ingredients are the pillars of each dish, exquisite when combined, and are served as creative shared plates: radishes with crispy chicken skins and cold-pressed canola oil or kohlrabi rolls with queso fresco and sunflower shoots. Snack on Old Amsterdam cheese with fermented beer honey, seeded crackers, and house-made sourdough or make a meal of Sudo Farms zucchini or Broek Pork Acres Berkshire pork shoulder.Café LinneaSUECH + BECKAlive with greenery and plants, filled with natural light, and boasting mid-century modern design that makes the best of us swoon, Café Linnea may have forward-thinking sensibilities, but their focus is on tradition. Their M.O. is to rediscover how old-school dishes became classics in the first place. Fresh is king on the French- and Scandinavian-inspired menu (a nod to chef Kelsey Johnson’s heritage) and each dish is based on what’s in season and available from local farmers. While the menu is ever-changing due to their farm-to-table philosophy, Johnson sees to it that every dish puts a twist on tradition. A brunch favorite is oeufs-en-cocotte, currently being served as two farm eggs baked in a sherry cream sauce surrounded by wild mushrooms, onions, and potatoes, and topped with pickled mushrooms and brassica sprouts. Don’t miss other popular items like shrimp tartine and house gravlax. With food this fresh, however, it’s impossible to go wrong.BündokSUECH + BECKLocated on 4th Street Promenade in the Ice District of downtown Edmonton, Bündok (named after “boondocks,” meaning “a far-off place”) features an inventive menu in an austere, but inviting space. Chef-owner Ryan Hotchkiss’ main mission is to celebrate the people and food of the community. He does so with the likes of gorgeous beef carpaccio with grilled onion, radish, and Piave Vecchio; kale with cabbage, kohlrabi, puffed wild rice, and yeast vinaigrette; and sea bream crudo with Thai basil, citrus, chili, olive oil, and apple. While this may sound like there’s a focus on the raw here, Bündok relishes all its flavors, cooked or uncooked, whipping up dishes that are artful and rich, and served only with the freshest ingredients.RGE RDSUECH + BECKWhen you’re craving a down-home meal with a little something extra, when you need to be reminded of Canada’s bounty, or when you want to know what Albertan cuisine looks like, RGE RD represents Alberta’s landscape on a plate. This farmer-friendly restaurant (with a butchery area and in-house meat locker) claims that dishes are inspired by “Canada’s fields and forests, mountains and oceans,” and in true form, they keep it hyperlocal. Chef Blair Lebsack sources most of the restaurant’s ingredients from Edmonton-area farms, with seafood coming from the east and west coasts of Canada. Expect menu items such as the Scotch egg served with chervil aioli and garden greens; a kitchen board of pork rillettes, borscht sausage, smoked hunter's sausage, dill gouda, and buttermilk crackers; and bacon and beef liver paté on toast with brassica mustard, pickled beet, and apple gastrique. It’s Canadian comfort food, truly at its finest.MEATSUECH + BECKMaybe you’re not scratching your head over what could possibly be on the menu at MEAT—they’ve made that pretty clear—but you may be wondering how a city in Canada came to serve such an extensive BBQ menu; rosters like this are usually reserved for Deep-South smokehouses and southern-themed restaurants. While barbecue has been migrating north for years now, this locally owned-and-operated smokehouse in Old Strathcona isn’t concerned with trends. Chef Nathan McLaughlin gets right down to the heart of an authentic Texas-style BBQ experience with family-style dining, homemade sauces, savory sides, and a welcoming space (with communal tables) in which to devour such goodness. Expect simple mainstays done well, like beef brisket (a crowd favorite), BBQ ribs, smoked chicken, and not-to-be-missed sides like baked beans and mac and cheese.ClementineSUECH + BECKSituated in the Oliver neighborhood of Edmonton, Clementine is elegant, gorgeously designed, and full of stories. Chef Roger Létourneau, who also went to Belgium with fellow Edmontonian and Biera chef-owner Christine Sandford, complements a thoughtful cocktail menu with creative dishes featuring ingredients often fermented, smoked, pickled, or cultured. The mussels are marinated in manzanilla sherry with smoked brunost, fried potato, pickled shallots, and herbs. The tartine is served on sourdough rye bread with blue cheese butter and mushrooms marinated in celery vinegar. Even the potatoes, stacked high and covered with vanilla honey, are pickled. Expect to be enveloped in a space inspired by early 20th-century French Art Nouveau, regaled with stories of classic cocktails and delighted by pure, distilled flavor.RostizadoSUECH + BECKDani Braun, Chris Sills, and Edgar Gutierrez first bonded over fresh, authentic Mexican food when they opened Tres Carnales Taquería. Now the trio is going beyond their street-food-inspired Mexican hot spot to give locals an unexpected taste of modern Mexican cuisine. At Rostizado, a diverse array of Mexican food is culled from all 32 states of Mexico, and receives worthy homage with delightfully unexpected dishes like lobster and prawn molcajete (served in a stone bowl) and duck carnitas served on a bed of tamarind salsa. In the traditional way of Mexican rosticerias, the meat gets its flavor from being slow roasted on a rotisserie.\nThe churros, served with salted pasilla milk chocolate and dulce de leche, are not to be missed, either. As if you didn’t already feel transported, you can wash it all down with high-flavor cocktails like ancho tejuino, made with tequila, muddled pineapple, cinnamon-spiced syrup, and fresh lemon juice.UccellinoSUECH + BECKFor years chef Daniel Costa, born and raised in Edmonton, has been turning heads with his Italian endeavors at Corso 32 and Bar Bricco. With Uccellino, however, he’s holding court on a grander scale: The space is as simple as the dishes, modern like the menu, but stunning, much like the presentation of each plate. The goal of this modern trattoria and stand-up bar is to transport guests to everyone’s favorite boot-shaped country, but with flavor-forward Italian food complemented by a wine list of strictly Italian wines. The menu features elevated takes on classic dishes such as tomato, ricotta, mint, and chili crostini; tonnarelli cacio e pepe; and ricotta gnocchi. Each is designed to highlight the ingredients, some imported from the motherland, and others produced locally.Hungry yet? Start planning with seasonally direct flights with WestJet to devour all the local eats of Edmonton today.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Destination Canada"]}