{"id": "936f74d4bb14ac7f3739117533e44b46", "url": "https://www.bonappetit.com/story/fancy-avocados", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Avocado with Turmeric and Garlic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Life Grants You Ripe Avocados, Douse Them in a Turmeric-Garlic SizzleWe call it the Andy Baraghani treatment.By Andy BaraghaniMay 11, 2020FacebookTwitterEmailPhoto and Food Styling by Andy Baraghani FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I know my California upbringing is showing, but I’ve known a lot of excellent avocados in my life. My dad, who was always on salad duty, would scoop a few pieces out for our nightly salad. A few slices would make their way into a turkey and Swiss sandwich. Or I’d smash a few, add salt, plenty of lime, and too much garlic and eat it with good tortillas chips. Now that I’m living on the East Coast perfect avocados are harder to come by, I have to be choosier with how I use the best ones and smarter about how I dress up the so-so ones.That’s where this avocado snack comes into play: In reality, it’s less about the avocado and more about the toasted garlic and turmeric sizzle that goes on top. Savory, crunchy, spicy, and oily, it’s a condiment you can use on a lot of different things and, once you get the hang of crisping up the garlic and blooming the turmeric and chile flakes, it’s pretty easy to riff on. But first, let’s start with the basic version.To make this very simple snack, pour a few generous glugs of extra-virgin olive oil (¼ to ⅓ cup if you want to be precise) in a small skillet. Add 2 cloves garlic, thinly sliced, and ½ teaspoon ground turmeric and place the skillet over medium heat. Cook, giving it the occasional stir, until the garlic starts to sizzle and turns golden and toasty. This will happen in 4 to 5 minutes. Turn off the heat and sprinkle in some chile flakes or black pepper. The amount  really depends on the type of dried chile flakes you’ve got. If you’re using crushed red pepper flakes, like those at a pizza joint, a small pinch should do the trick. If you’re using something a little milder, like gochugaru, Aleppo-style pepper, or urfa biber, I recommend anywhere from ½ teaspoon to up to 1 teaspoon. Season the sizzle with a bit of salt.Now go grab a couple perfectly ripe, buttery avocados. Split them in half and remove the pit. Holding one avocado half in one hand and a spoon in the opposite, scoop out the flesh in big pieces (not one big scoop though) and arrange on a plate. If you have some nice herbs around (mint, cilantro, basil, chives work well), scatter them over top. Sprinkle with some salt and squeeze over the juice of 1 lime or 1 lemon. Pour the garlic and turmeric sizzle over—you’ll immediately see a golden pool forming around the pieces of avocado.Enjoy this as is, or go wild and add some sliced citrus, which would make it more of a salad salad. Or go simple: Skip the fancy plating and just mash the avocado up with the sizzle. No avocado? You could even stir the sizzle into some Greek yogurt for a dip with roasted or grilled vegetables and flatbread.Once you get a handle on the basic version, try experimenting: Add grated ginger or other ground spices, like cumin or coriander, to the mix. Sesame seeds will add a nice crunch if you have some around. Double or triple the quantities if you want some extra to use throughout the week for dressing smashed cucumbers, steamed rice, or even cooked chickpeas or white beans.I might not be in California with avocados piled on the countertops, but for now, this snack is as close as I’m gonna get.Explore Bon AppétitIt's That SimpleAvocadoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-11", "author": ["Condé Nast", "Andy Baraghani"]}