{"id": "937c8a02a2e260d4613b6d0da572f71b", "url": "https://www.bonappetit.com/story/national-barbecue-competition-essay", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Entering a National Barbecue Competition Seemed Like a Good Idea at the Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEntering a National Barbecue Competition Seemed Like a Good Idea at the TimeIt’s one thing to grill for my family. It’s another to enter a competition. How did I get here?By Peter MeehanJune 4, 2018FacebookTwitterEmailIllustration by Hisashi OkawaFacebookTwitterEmailIf the canopy of stars wasn’t so captivating, wasn’t like silver glitter spilled on velvet the color of midnight, I might have just given up. It was the kind of damp cold that turns your bones to glass—a spell of 40-degree weather rolled in on what should have been a swampy summer night—and we’d been outside since the previous afternoon, on a patch of grass ringed by mountains, huddled around the smoker for warmth.I was cooking in my first barbecue competition, in a small town in the Catskill Mountains, and seeking shelter would have meant letting my buddies down. Other, properly prepared, teams were asleep in their trailers and trucks, shelters festooned with Old Glory or Infowars stickers. So onward toward dawn we shivered, checking the schedule and our prep list and debating when to switch from beer to coffee.It could have been anything, I guess: old cars, ceramics, maybe an interest in flying small planes. Entering middle age, perhaps looking to distract myself from my feelings about how my business partner had shut down the mildly artsy food magazine I edited, I fell into cooking over live fire as a life-filler-upper.I became a guy who was “into barbecue,” which, for as true as it is, is still somewhat painful to type. Talking Heads had told us that day was coming, when you wake up and ask yourself, Well, how did I get here?For the past few years, my family and I have been getting out of New York City on weekends and during the summer to go to an old bungalow encampment in a hollow pinned between a swamp and a graveyard. It’s our little slice of heaven with trees and a big lawn and other kids for our kids to play with. There are six other families there, and we—whoever’s up from the city on a given night—routinely eat dinner communally, a dozen or twice as many people sitting down. A whole pork shoulder or all the ribs they had at the supermarket can disappear without anyone even contemplating seconds.The big annual party, which predates me, is a Labor Day pig roast, when everybody’s friends and friends of friends cover the lawn in a patchwork of picnic blankets, bring side dishes or desserts, and make sure their kids don’t drown in the pond. Over the course of a few summers, I went from being a willing helper to spearheading off-season discussions about how we’d do next year’s pig. Now I initiate get-togethers that necessitate the cooking of whole animals whenever possible.Because, like anything I’ve ever been into, I need to up the ante every once in a while to get the same kick. It’s one thing to cook competently for your family, and it leads, often, to cooking for friends in grander quantities. It was another thing when all of this led me to enter a barbecue competition.Actually, I would have vaguely committed to it, forgotten about it, missed registration, and gotten on with my life if it were not for Jonathan Hooper. Jonathan is a fellow dad at the upstate place and the property’s founding pitmaster, a guy who is active on Reddit barbecue boards but who has a real job and life. Over the years, as we’ve gotten to know each other, we’ve undertaken a consistent and escalating program of barbecuing bigger animals, or more of the little ones, and the competition felt, in some ways, like a natural next step. We’d been inching toward the cliff’s edge; it was time to jump.Backyard pig roasts are a Labor Day tradition.\nPhoto courtesy of Peter MeehanI wasn’t unafraid. I am insecure about my cooking in a performative sense: I am a writer, not a cook. I have no investment in the value of trophies, diplomas, and their ilk. My interests lie more in regional barbecue—the ribs or shoulder or brisket cooked over wood you get at the place down the road—than in the style practiced at competitions, which is a thing apart.While there are many governing bodies that put on barbecue competitions, the Kansas City Barbeque Society is the big dog. KCBS says it sanctions 500 meets a year, from “backyard only” competitions, where pros are excluded, to “invitationals,” which require you to have won a trophy to qualify. Four types of meat go before the judges: pork butt or shoulder, pork ribs, beef brisket, and chicken. The scoring rubric that judges are educated in via a one- day seminar is intended to be region-agnostic—as welcoming of vinegary eastern North Carolina pork as of salt-and-pepper Texas beef—but it is not. Rather, it rewards what’s often called “competition style”: a groupthink simulacrum of many styles.Competition barbecue is sweet and saucy. It is pretty in a manicured, post–World War II food-styling fashion—uniform and tidy in a way that most real barbecue isn’t. The aesthetic prescriptions about how the meat should be presented are campy enough that I think John Waters would dig them. (From the rules: “PROHIBITED GARNISHES are lettuce cores, kale stems, and other vegetation, INCLUDING BUT NOT LIMITED TO endive, red tipped lettuce.”)To summarize the difference between regular regional barbecue styles and KCBS BBQ, I’d draw this comparison: In one you are hosing your mutt off in the driveway; in the other you’re scissoring perfect pom-poms on your purebred’s haunches before trotting him around Westminster.The kind of chicken that wins competition is fashioned from skin-on but boneless thighs, tucked into taut little bundles, the final product lacquered in sauce. Jonathan and I apprenticed ourselves to a bearded YouTube guru named Tom Jackson (a.k.a. Chef Tom) to dial in our chicken and ribs game. And it was following him that we finally assented to some of the more arcane practices of winning barbecue: We removed the skin from the thighs, scraped the subcutaneous fat from its underside, then redraped it on the meat after it had brined for 90 minutes.The quantity of honey Mr. Jackson drizzled over and around his ribs was gratuitous if not something more unseemly. We ignored our own moral compasses and played along. This was what the competition gods wanted, and so we spent a few weeks of the summer gearing up for that kind of cooking.The cynical carpetbagging Yankee egghead reason I cooked at the dog show was so that I could call it a dog show without feeling like someone could snipe at me saying I’d never shown a dog. But just like you don’t stumble into owning a show poodle, I wasn’t cooking in the competition by accident.I found myself wanting to be out there, by the woodpile, by the collection of pits that had grown like the lawn furniture of a nightmare neighbor: the one who starts with one car up on blocks and soon enough is hoarding mounds of unclassifiable trash in his yard. Now my neighbor Jonathan and I are that guy, but for meat cookers.I acknowledge that humanity has collectively been trying to improve on cooking over fire since the first monkeyman’s synapses fired in frustration, asking, Jeez, couldn’t we speed this up a little bit? I know the Instant Pot is the dream that humans dispersed themselves around the globe seeking, not the chance to spend another night tending a fire with a whole dead animal on top of it.But I grew up in the suburbs and have lived in cities ever since, the kind of cities where having space for a grill is unlikely. So now I can watch a fire forever, in a pit, in the woodstove that heats our cabin. My kids roll their eyes when I tell them about the colors in the fire—the whites and the blues and what they mean—but then I see them coloring the fire in their drawings with those pencils, hues I never reached for in my Duraflame youth.I’d buy albums of the fire’s hisses and pops to listen to in my city apartment. The roar of a bonfire? The way its heat pushes you away before you realize the warmth of the day has retreated and there are bats overhead and suddenly you want that sear on your shins, that orange glow turning your cheeks red? Yes, please.I liked that cooking over fire was uncertain. Writing cookbooks, I’d spent years developing a facility with other kinds of cooking that I could be assured would turn out. I know most of what a wok does on a home stove, how a 12-inch nonstick pan heats up, how long it takes to melt onions. But for a few years, I didn’t know how the meat would turn out, how the fire would behave, if we’d be conquering heroes or idiots who’d burned or undercooked dinner. It was fun, which is a dumb and easy word, but an elusive feeling at certain times in your life.The competition was held on a field Honus Wagner is rumored to have played some baseball on in a Catskills mountain town called Fleischmanns. The townsfolk, now mostly Hasidic Jews, eyed us as we drove in, and I noticed we didn’t have the matching T-shirts or gleaming five-figure rigs that many of the other competitors had. We had a rented U-Haul pickup and a rickety but beautiful Texas-style smoker I’d bought off of Austin barbecue godhead Tom Micklethwait.And maybe it was all those weekends full of meat-play, those 3 a.m. wake-ups, all the YouTube video watching and looking at cookbooks, but I found myself caring a little about winning something. Maybe it was not wanting to return home looking like schmucks—or wanting to at least be schmucks who had some hardware to show for it. Maybe it was the fact that I’d never won an award for anything despite being in a business that gives out a lot of medals.When judgment was ready to be meted out—all the deliberations and score calculations happen in private—the competitors gathered in a semicircle in front of a tiny stage as the organizers went through the categories, doling out trophies and cash prizes.We had undercooked our ribs—we pulled them too early, and they weren’t as tender as they should have been—and our decision to dress our pork shoulder in the vinegary eastern North Carolina style was a recipe for losing against the ketchup-y confectionery style more proven to win. (We got buried.) So all was riding on chicken and brisket.I was confronted with pride in creation while sitting there, something I feel congenitally averse to. But our chicken was good. My teammate Mark Ibold deserved to win something. He’s not a barbecue idiot like I am, but he had dutifully and beautifully scraped the underside of the chicken skin clean in the early morning and had done an exceptional job as our lettuce fluffer, creating gorgeous and rules-compliant carpets of greenery to present the meat on.The ribs were a little undercooked and not as tender as we wanted.\nPhoto courtesy of Peter MeehanWe had been educated in the style of Texas barbecue by Micklethwait, one of the finest practitioners of the form, so we imitated his brisket as well as we could, but shellacked the burnt ends with sweet sauce in a way that I could imagine our other Chef Tom, the one from YouTube, revving his Harley for. Teammate Seth Prouty, also a civilian, had meticulously stoked the fire and split wood quietly in the dark as he shepherded the meat toward doneness for more than 12 hours.Royal Hooper, Jonathan’s then 11-year-old son, rounded out the team. He was there for some sort of father-son bonding opportunity, but rather than be pressed into indentured servitude as I’d hoped, Royal succeeded mainly in showing how much better at sleeping he was than the rest of us. When, early in the morning, the event organizers apologetically parked the generator for a mechanical bull right next to our tent—there’s a carnival aspect to some of these competitions, but that all gets under way after the serious cooking has happened—he goosed free rides for himself on it for the rest of the day.We sent Royal up to collect our trophies: third place in chicken, second place in brisket. In a field of 17 competitors, these were victories, and the couple who ran the competition couldn’t have been kinder or more complimentary about our finish when we visited the tent to claim our prize money. They said that placing as we did in our first pro competition was a guarantee we’d be back for more.It wasn’t, which isn’t to say we won’t. There wasn’t a gregarious community of like-minded cooks or the chance to expand our minds tasting other barbecue that is part of the promise of most food get-togethers. The hours sucked and the pay was bad.But we didn’t abjectly fail. We didn’t lose any toes to frostbite. There was a moment of cow-scratching- herself-against-a-fence-post satisfaction in the molten yolk of an egg-and-cheese sandwich that warmed us as dawn broke and another of revelation when a pan of pork scraps, water, and salt transmuted itself, as teammate Mark said it would, into a pan of carnitas, meat snacks to fish out with dirty fingers as the competition drew to a close.It was this: an excuse to gather around the fire, to cook with friends, and to do funny things to meat, possibly for praise. If it wasn’t the best of times, it wasn’t the worst, either.Listen to Peter read his essay on the Bon Appétit Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitGrillBarbecueRead Morerecipes80 Memorial Day Weekend Grilling RecipesGallery80 SlidesBy Bon AppétitcultureIt’s Barbecue Season, So Your June Horoscope Comes with a BBQ Side for Every SignGallery12 SlidesBy Catherine Urbanrecipes24 Ribs Recipes to Bring Out Your Inner Pitmaster (or Grillmaster)Gallery24 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-04", "author": ["Condé Nast", "Peter Meehan"]}