{"id": "937d59254a12945b1c9ac8362b77c32e", "url": "https://www.bonappetit.com/story/how-to-store-butter-at-room-temperature", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "How to Store Butter at Room Temperature | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Store Butter at Room TemperatureNo special container required.By Alex BeggsFebruary 24, 2021FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Years ago I wrote about the cult of the Food52 French Butter Keeper. That little stoneware container sells consistently year after year. It promises smooth, creamy, spreadable butter so your toast never has to suffer cold butter violence again. It also looks cute.At the time I lived in an apartment with winter temperatures determined by a blasting radiator and summer heat that I dealt with by taking off more clothes because I’m an A/C martyr. In any season the butter on the counter melted or molded in days. It was never gonna work out for us.Now, in a normal temperature home kept around 67° F in the winter, I’ve perfected the art of room temperature butter. It makes my toast life so much better. Every few days I add a new stick to the dregs of the old. I look after my butter like a low-maintenance pet. And I didn’t need to buy anything.Step 1: Don’t worryAlmost all butter sold in this country is pasteurized—as in it’s cooked. That kills bacteria. Butter is also so high in fat, around 80 percent, that it’s a fortress against most bacteria.* Sitting out for a week on your counter will be FINE. Even the FDA says so. (Well, they’d add “probably fine” because they’re very, very careful.)*Not all bacteria, and the longer the same stick of butter sits out—the more it’s exposed to air—the more it’ll degrade and potentially taste rancid (sour-funky-bad). Maybe you should eat more toast??Step 2: Identify your kitchen temperatureYour kitchen needs to be at a pretty steady room temperature, around 67–72° F, in order to have countertop butter success. In her guide to softening butter for baking, Claire Saffitz wrote that the temperature of softened butter—ready for whipping into a cake—is 68 to 70° F. My kitchen gets so cold at night in the winter that my counter butter is too cold—63 today!, but that’s still easier to spread than straight-out-of-the-crisper butter, which I measured at 43°.If you have a heater or A/C running, that temperature is easy to regulate. But if you’ve got the windows open on a warm Texas summer afternoon, or a blasting radiator in Brooklyn, it’s probably not ideal butter conditions, sorry. Keep your butter in the door of the fridge (that’s the warmest part), and take it out an hour or so before you need to spread it.Step 3: Think about how frequently you use butterI go through a stick of butter every three days on average, which means that any container will work (see step 4). If you don’t use butter that often, you’ll need a container with an air-tight seal so the butter doesn’t pick up any off-flavors floating about the kitchen. My heroes at Cook’s Illustrated explain that the high fat content in butter makes it susceptible to taking those on; this $5 keeper was their winner. That said, I haven’t noticed any off-flavors in butter in my less-than airtight container left out for a week. I think it’s pretty dependent on a few factors (what you’re cooking, where the butter is relative to the stove, how much of a supertaster you are…).Step 4: Pick a containerCalder Dairy near me sells these cow-printed tubs overfilled with 1 pound of butter. The tub is your built-in butter keeper. Looking at it on the counter makes me happy. But that’s a LOT of butter for a week.Usually, I use my vintage Pyrex butter dish in Crazy Daisy, thanks for asking.If I had to make a Pinterest board of butter keepers, it would include this pink “beurre” box from Sur La Table, this minimalist butter wood-topped butter box that appears the perfect size for Trader Joe’s imported cultured butter, oOoo jadeite!, or this $445 “branch finial” painted porcelain dish fit for long-dead British monarchs. You have choices. But avoid metal, which Harold McGee says can “hasten fat oxidation,” (oxidation = what makes food degrade, like apples turning brown) particularly in salted butter.So if you have a lust for commerce, go ahead, buy a hand-crafted, gorgeous little butter keeper, but remember that it’s just a container with a lid. And I bet you have a few of those.French Ceramic Butter Keeper$50 at Food52Explore Bon AppétitButterShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-23", "author": ["Condé Nast", "Alex Beggs"]}