{"id": "9382d697fb4400cc517a7eba1fd47277", "url": "https://www.bonappetit.com/story/freezer-wine", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Freezing Wine is the Best Way to Make Sure You Never Waste a Drop | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusThere's No Better Time to… Save Every Last Drop of WineI always have a baggie of wine cubes in the freezer.By Eric KimMay 27, 2020FacebookTwitterEmailPhoto by Michelle HeimermanFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: What to do when the pour is just a little too generous.As someone who lives and drinks alone (the latter quite regularly, especially these days during quarantine), I often pour myself a much larger glass of wine than I can finish. For years this glass would sit out overnight, half-empty, and glare at me in the morning, only to be poured back in its bottle (gross, I know). But now, to avoid this, I just fill an ice cube tray, freeze it, and then transfer my little wine cubes to plastic bags I keep in the freezer: one labeled RED WINE, another WHITE WINE.I learned this trick from Nigella Lawson, British cookery writer (and my culinary mother). While I learned to cook Korean food at the heels of my biological mom, this habit—along with most of my other kitchen neuroses—can be attributed to Nigella, whose television series I binged just as I was starting to live on my own. Slowly but surely, as I watched her stir risotto, roast chicken, and throw fabulous dinner parties for her friends, I learned how to cook—and how to use my freezer as a pantry.My favorite part of each episode was when she’d open her freezer to show us the stash of bits and bobs. I loved how packed and lived-in it looked, not unlike my own mother’s freezer, every piece of leftover food saved for a rainy day: individual egg whites for pavlova; bacon slices packaged in pairs for easy thawing; stews frozen in single portions for instant dinner; and, my favorite, bags of frozen wine.No wine goes to waste.\nPhoto by Alex LauAs Nigella reasons in the episode entitled “Entertaining,” why waste leftover wine when you could freeze it? It’s genius, really: At the end of her illustrious dinner parties, she takes any vino left over in the bottles (and sometimes, admittedly, at the bottom of people’s glasses) and transfers it to small freezer bags (I’ve found that freezing the wine into cubes first means they’re pre-measured and easier to use).“I know that wine snobs will say this is the most atrocious thing you can do,” she says to the camera, “but I'm telling you, it works incredibly well indeed.” Actually, a sommelier (a.k.a. certified wine snob) I used to date would probably endorse this behavior: He once told me that the quality of any vintage deteriorates anyway as it sits in its open bottle and oxidizes—if you’re not going to drink it right away, then you might as well freeze it for cooking.So while I won’t defrost the wine to drink it again, over time, I will end up with enough cubes of frozen wine for all manner of cooking projects: when I’m making a stew, for instance, and only need a glass (but don’t want to open a whole bottle), or when I’m searing a pork chop or a steak and fancy a splash of wine to deglaze the pan for a quick butter sauce (there’s no need to thaw the cubes because they’ll melt instantly against the heat). Theoretically, one could even freeze leftover rosé for frosé—and if that’s not a party, then I don’t know what is.Eric Kim writes about food, travel, and culture and lives in Manhattan with his dog. You can read more of his writing here.Explore Bon AppétitThere's No Better Time CoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-27", "author": ["Condé Nast", "Eric Kim"]}