{"id": "9388044d0819ef6ef1b7f0713abc4c57", "url": "https://www.bonappetit.com/story/burning-america-wellness", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "I Escaped Burnout Culture and My “Perfect” Wellness Routine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBurning Out on America...and My “Perfect” Wellness RoutineHow I traded barre classes and celery juice for tea and rest.By Rose Truesdale August 25, 2020FacebookTwitterEmailBeatrice SalaFacebookTwitterEmailOn a Sunday afternoon in early March, I am nearly nude and belly down on a massage table in an airy Altbau, squirming fitfully as my alternative therapist digs the tip of her elbow into my left rhomboid muscle. She commands me to fully relax and be present in my body, but I still don’t know how—even after a year of weekly sessions to manage burnout tendencies and trauma—and I worry that my anxiety annoys her. Pressure gives way to pain: I let out a muffled shriek as my hands cramp up into crab claws and my entire body starts to tingle. “Good,” she says succinctly in a German accent.As I dress, we agree this will be our last appointment for a while. COVID-19 has already devastated Italy and Spain and, although Germany eagerly awaits official orders from the federal chancellor, it’s beginning to feel irresponsible to conduct business as usual. “There’s no need to panic, though,” she reminds me. “Panic gets us nowhere.”Over the following months, as the coronavirus proceeded to steal our loved ones, dismantle global economies, and quash our best-laid plans, the German response remained unflappable. “Panic gets us nowhere,” I realized, was not simply my therapist’s advice but a cultural mantra.Although Germany is one of the wealthiest and most medically advanced nations in the world, German health care remains steeped in Teetrinken und Ruhen (“drinking tea and rest”). As a rule, health workers are careful to treat symptoms holistically so as not to cause unnecessary damage, and this has held true even despite a global pandemic, with coronavirus testing centers advising people to stay home and drink tea.Chancellor Angela Merkel, a former citizen of communist East Germany for whom freedom of movement beyond the Iron Curtain was a hard-won right, didn’t issue a lockdown right away, believing that abruptly stripping people of their liberties might induce panic. Instead, businesses and institutions closed gradually: first Berlin’s beloved techno clubs, art galleries, and concert venues, then dine-in restaurants and schools. Generous financial support for gig workers and artists in need was deposited swiftly and with minimal paperwork. Germany’s already robust unemployment benefits expanded, and the government offered Kurzarbeitergeld (“financial support for reduced working hours”) to enable some of my peers to drop down to one or two working hours per day and help companies avoid layoffs. \"The situation is serious. Take it seriously.” Merkel cautioned. You don’t need to tell Germans to take a situation seriously twice: My fellow Berliners and I stayed home, drank tea, and rested.For me at least, life in the U.S. lacked this kind of simplicity and guidance. When my partner, Dylan, asked me to start fresh with him in Berlin four years ago, I agreed. We moved with our registered emotional support dog in tow, two suitcases of painstakingly pared-down belongings apiece, and enough money set aside in savings to help us through a settling-in period. On the plane ride to the next phase of our lives, Dylan’s molar crown fell out in a granola bar—an omen of chaos, perhaps, and a not so gentle reminder that we were uninsured.Six months in, we had already lived in three different apartments: A friend’s loaner flat, a glorified dorm room with a flooding shower, and a sublet on top of Berlin Dungeon, a “haunted” tourist attraction whose employees enjoyed their smoke breaks in our courtyard dressed as bloody 18th-century ghouls. We struggled to acquire freelance artist visas, and once we had them, I remained woefully unemployed…until, suddenly, I wasn’t. Within a week, I became abruptly overemployed, and in over my head.Back home I’d relied on certain small luxuries of the wellness industry—the Whole Foods salad bar, ashwagandha/reishi/manuka honey/hemp milk lattes, and exorbitantly priced barre classes—to cope and self-soothe in times of overwhelmingness. Without them, I started to experience anxiety attacks of the hyperventilating, crumpled-in-a-door-frame variety. I developed perioral dermatitis all over my face, and, in reactive displays of what happens when you fail to meet your own existential requirements, became prone to exploding tears of rage.I now see this fraught, rash-y, wailing period of my life as a symptomatic withdrawal from my addiction to American hustle culture. I’d accepted that life was for optimizing the pursuit of perfection and productivity, and that if I couldn’t be my best self for whatever reason—insomnia, conflict with a loved one, financial insecurity in a foreign country, take your pick—I was failing.Not so in Berlin. In Germany, burnout is considered an epidemic and entitles full-time employees with a qualified doctor’s note to six weeks of employer-paid leave. Many burnout cases also qualify for a Kur (literally “cure”), where those afflicted are sent to a certified health spa for up to three weeks and given a customized nutrition plan, exercise program, and healing treatments to prevent or manage stress-related illness and chronic conditions—all fully covered by Krankenkasse (“insurance,” or literally “sickness cashbox”). Rest is a national priority.In the beginning, I not only resisted Berlin’s holistic approach to burnout, I felt personally attacked by it.Rest had never been a priority for me. In the U.S., my dance with burnout had two moves: manic overexertion, or incapacitated in bed, typically with takeout balanced precariously on my stomach and a Gilmore Girls rerun slumped against my eyeballs. There was no in-between, and throughout my life in the U.S., everything around me seemed to condone—even celebrate—my exhausting routine. I chalked it up to an “entrepreneurial spirit,” my Capricorn Sun, and more or less made it the basis of my whole identity. As a result, Berlin’s rejection of burnout made me feel rejected, not to mention lost and frustrated about having apparently existed for over three decades without a personality.So in the beginning, I not only resisted Berlin’s holistic approach to burnout, but I also felt personally attacked by it. It also became evident that I didn’t understand the meaning of “holistic.” In a past life, I worked 90-hour weeks but considered myself immune to burnout. I drank juice! I bought CBD oil, CBD gummies, CBD bath bombs, and CBD coffee; I once spent $55 on the infamous yoni egg because I read that actively squeezing an expensive rock with my pelvic floor muscles would keep me from living in my head and on my phone: In other words, I got Gooped. It didn’t occur to me that I was trying to heal in reverse—that no amount of celery juice could cure my chronic fatigue, digestive distress, and burgeoning disconnection from my body and self. I could have avoided the need for all that flashy stuff by first pursuing rest.Recognizing that all my earnest pre-Berlin healing attempts were just expensive Band-Aids was, quite frankly, a drag. Once I acknowledged that I had always operated in survival mode, though, I was free to start healing forward: to remember who I am without the overachieving impulses and superfluous vagina crystals, disembroil from some of my destructive patterns, and stop trying to prove myself to no one in particular. It’s all work in progress, of course, but it feels simpler now that my environment supports this work. I wish everyone’s environment supported this work.Preventive health care, in all its forms, is baked into German history. Naturopathic medicine in Germany began with Saint Hildegard of Bingen, a 12th-century Benedictine abbess who purportedly used tinctures, herbs, and crystals on villagers in need of healing. Big Pharma has roots here too: Bayer AG, forefather of pharmaceuticals and creator of aspirin, was founded in Prussia.Germany also has history to thank for the feasibility of paying for care. Nineteenth-century German chancellor Otto von Bismarck was the first to mandate public insurance, and the way it worked then is mostly the way it works now: Employers, employees/freelancers, and the government all pay into insurance funds, resulting in a universal multi-payer health care system wherein both holistic and conventional medicine are made, as I would soon find out, quite cheap.Fixing Dylan’s granola-felled crown was free, even without insurance, because the dentist was feeling generous and liked Dylan’s Chicago Bulls sweatshirt. A friend of mine was billed 20 euros out of pocket for an ambulance ride and two emergency surgeries that would have bankrupted her in the States. Even private holistic practitioners can afford to keep their services relatively inexpensive or offer trades: In return for a few months of services, I edited my alternative therapist’s screenplay. Physical therapy is covered by public Krankenkasse, and traditional Chinese medicine, acupuncture, and visits to the herbalist are covered by private insurance that costs me 16 euros a month.Unlike Germany, America has a corporatized health care system and a trillion-dollar wellness industry trying to fill in the health care system’s holistic gaps. I no longer view the wellness industry as the angel on my shoulder, but one of two tiny Lucifers—evil twins of symbiotic capitalism; where Big Pharma fails, Big Wellness profits, and vice versa. If we can afford to participate in American wellness culture (and marketing would have us think that we can’t afford not to), are we spending our money on long-term care or just makeshift fixes?Instead of prescribing rest, the American health care system and the American wellness industry offer temporary solutions to help us push through—and both industries ultimately profit off of peoples’ burnout.Watching this all play out during a global crisis has been instructive. As social distancing measures all but disappear in Berlin, the COVID-19 death rate among infected patients remains low, possibly due to a strong intensive-care program, widespread testing, and early preparedness. But I have to believe that widespread faith in Chancellor Merkel’s sensible, steadfast leadership has also contributed to Germany’s anomalous well-being: Feeling safe, I’m learning, actually keeps us physiologically safer. It makes sense that people who aren’t forced to exist in survival mode, who have the capacity and modeling to address issues at their root, and who can believe with unwavering assurance that they’ll be able to make ends meet even in the worst of circumstances, are less vulnerable to burnout and therefore less vulnerable to illness. By this logic, a rational administration is another form of preventive health care that residents of the United States don’t have access to.Prolonged stress is the root cause of so many of our health problems. Burnout leaves us susceptible to cardiovascular disease, respiratory issues, and infection as a result of compromised immunity. But instead of prescribing rest, the American health care system and the American wellness industry offer temporary solutions to help us push through—and both industries ultimately profit off of peoples’ burnout. Our intense working hours, our mass consumption, our overstimulation, our endless schlep toward perfection all fuel the machine, and the price to keep the machine running is American lives.Learning to first pursue rest has, at times, felt alienating and lonely. I have glowered at German pharmacists for prescribing me “time” to treat what I know full well is a yeast infection. (Vaginalpilz, by the way, translates to “vagina mushroom.”) I have waited impatiently as a German cashier ignores me and my drug store purchases to finish their sandwich or purl another row on the hat they’re knitting at the register, and I have on multiple occasions received an automated email explaining that the specific person I need to contact for something “urgent” will be on leave for the next three to six months. So while I find that German health care largely functions as a harmonious marriage between holism and modernity, it sometimes moves at a comically lackadaisical pace. Finding a psychotherapist covered by public insurance, for instance, can take months of phone calls, unexpectedly canceled sessions, and more red tape than depressed people are typically apt to handle. Nothing is perfect—not even close.But living and healing in Berlin has also reminded me of who I am without all the superfluous stuff—not an overzealous producer or consumer, but a human with evolving needs; a human who believes everyone deserves care; a human who was courageous/stupid enough to move to a foreign country without a plan and lucky enough to receive some of its benefits during a global crisis.The city is almost fully open. Berliners with bleached mushroom cuts and androgynous black tunics obediently don their fetish masks to board the U-Bahn. An older woman, craving familiarity, braves the grocery store for one solitary dark, seedy loaf of German bread. I meet some friends at a forest rave, where everyone dances together from a safe distance, as if this is how they’ve always done things. I’m grateful to unlearn my old ways among them.Explore Bon AppétitHealthyishessayRead MoreLifestyleIs Your Wellness Practice Just a Diet in Disguise?By Melissa A. FabelloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-25", "author": ["Condé Nast", "Rose Truesdale"]}