{"id": "939c490ab8acd46206d1ae3e18020d8e", "url": "https://www.bonappetit.com/story/how-to-stretch-your-greens", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "How to Cook Greens So They Last All Week Long | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Stretch Your Greens So They Last All Week LongDon’t lose your whole bunch of kale to one night’s sauté.By Alex BeggsSeptember 29, 2020FacebookTwitterEmailPhoto by Laura Murray, food styling by Susie TheodorouFacebookTwitterEmailIn Basically on a Budget, we’ll talk tips, ingredients, and recipes that’ll help you save money and eat well.Fire is hot, rain is wet, and kale cooks down to nothingness. I come home with a huge, leafy bunch of kale and the ENTIRE bag gets consumed in one meal, leaving tomorrow veggie-less. So recently I’ve been trying to get more bang for my buck in the greens department. All you windowsill scallion farmers know what I’m talking about. The challenge: I had two bunches of curly kale to last one week. How would I use it to make it go further?The first bunch I washed and separated into stems and leaves. I tossed the leaves in olive oil and salt and baked them till crispy, then stirred the kale chips into a pound of cooked pasta (as Heidi Swanson does with soba noodles in this recipe). The crunchy greens disintegrated so that every bite had crispy crunchies, sort of like when you add breadcrumbs. But this was healthier? Sure.The next day I chopped the stems into inch-size pieces, fried them in olive oil, and sprinkled with my favorite default seasoning, the Spice House’s garlic salt. I had no idea what I was going to do with them. I stood in the kitchen and ate a small bowl of fried kale stems. That’s what I did. Later that day I added them to a scrambled egg burrito. Is...this...innovation?Bunch two: I cut the kale into ribbons and make a simplified version of Basically’s just-keeps-getting better lentil salad. I mean VERY simplified. The dressing was garlic, oil, and lemon juice, the salad was lentils and kale. In place of feta I used cheddar, in place of fancy green olives I used air. It was DELICIOUS. The kale is massaged so it softens but otherwise remains raw and therefore goes far. The next day I added a hard-boiled egg to the salad. The day after that: strips of one salami round. It’s true! It just kept getting better.Then I ran out of ideas for how to stretch greens, so I crowd-sourced with my test kitchen buddies:Hear me out: herb jamAndy Baraghani said to make herb jam, specifically, his recipe for herb jam. It’s a bunch of greens combined with chiles, ginger, spices, and whatever herbs you have around the house. Then, because the jam is so concentrated, you use only a spoonful here, a spoonful there. By combining it on toast with ricotta or in a bowl with cottage cheese, it’ll go even further.Regarding other greens, he added: “Spinach is useless. Just buy frozen spinach.” Extremely noted, Andy!Photo by Chelsie Craig, Food Styling by Maggie RuggieroBlanch and stashChristina Chaey has a whole process where she blanches her greens, wrings the water out, squeezes them into balls, and freezes them. Then she takes a nest of greens out when she needs to add them to her weeknight steam-fests or quick soups.Stem friendsBoth Chaey and I separate the stems and leaves (for kale, chard, collards, broccoli) so each can be treated as its own part. Toss a few kale stems into your fried grains, or omelets, or at unsuspecting passersby.Puréed soups!Sohla El-Waylly pointed out that pureéd soups, like this simple one with coconut milk, take greens far, especially those that might be on the verge of wilting.Photo and Food Styling by Emma Fishman So obvious, but so true: saladsBut here’s a good tip from Sohla: Bulk up your salads with apples, nuts, and beans (!) to depend less on the greenery.In Chris Morocco’s kale salad, some of the greens are charred VERY briefly so you get different kale textures without losing them into the ether. Clever.Other BA recipes that take greens far:Andy’s kuku sabzi, an herby frittata you can be flexible withAlso on the herb front: you can’t go wrong with this garlicky blender sauceCollard greens are sliced thin and combined with fennel in this crunchy acidic saladThrowback: Claire Saffitz has a collard greens salad with a spicy seed brittle, whoaI’m a big fan of this Swiss chard and tahini dip you could use as a sandwich spreadAnother smart chard move: GALETTE!Witness broccoli two ways in this charred broccoli and peanut saladThis cheesy-nutty broccoli and quinoa salad has lasted me a full work week beforeThe name says it all: Wilted Greens SoupThis crunchy salad has both raw kale and brussels sprouts, plus crisp apples—a keeper for sureExplore Bon AppétitBasically on a BudgetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Alex Beggs"]}