{"id": "93a0625a443c0bf6bd455f03df05e1f1", "url": "https://www.bonappetit.com/recipe/creamy-cheesy-polenta", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Creamy Polenta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueCreamy Cheesy PolentaBy Janice TiefenbachNovember 19, 20193.9(29)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA creamy, cheesy polenta that isn’t as high maintenance as you’d expect. Despite its reputation, polenta does not need to be whisked constantly and attentively for 30 minutes straight. As long as you cook it gently, over low heat, you can get away with whisking it only a few times as it cooks. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena (and goes great with this pork roast).IngredientsMakes about 4 cups3cups (or more) whole milk1cup polenta (coarse cornmeal)3oz. finely grated Parmesan (about 1½ cups)4Tbsp. unsalted butter4tsp. kosher saltPreparationStep 1Bring milk and 3 cups water to a boil over medium-high heat in a medium saucepan. Reduce heat to medium. Whisking constantly, gradually add polenta; bring to a simmer. Reduce heat to low, cover pan, and cook, whisking every 10–15 minutes, until thickened and no longer gritty, 30–35 minutes. Remove from heat and add Parmesan, butter, and salt. Cook, whisking, until butter and cheese are melted and polenta is the consistency of porridge, about 1 minute.Step 2Do Ahead: Polenta can be made 3 hours ahead. Store covered at room temperature. Reheat over medium-low, adding milk as needed to loosen.How would you rate Creamy Cheesy Polenta?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleIt was confusing with the 3 cups of milk and water.  The first time, I forgot the water.  I referred back to the ingredient list and not the instructions.  But hopefully, the second batch will be better.AnonymousLos Angeles, Ca5/23/2021The recipe would have been good, except for WAY TOO MUCH SALT!   Maybe they meant 1/4 teaspoon?   Start with that then add so as not to ruin the taste.  AnonymousToronto, ON3/3/2021Reviews helped interpret a really yummy recipe McNeelyChefOregon Coast11/14/2020Absolutely I would make this recipe again.  I cut recipe to 2/3 and cooked as per instruction but only salted to taste and it was perfect.  One of the best recipes I’ve ever made.  AnonymousNorthwest Territories, Canada10/19/2020The directions are misleading. It seems to suggest you need 6 cups of liquid, whereas the ratio is 3:1 liquid to cornmeal. This seems the source of confusion.\nAnonymousCT10/6/2020For a first timer, this turned out terribly. Ingredients shows 3c of milk. Directions say to bring milk and 3c of water to boil. Thought “this sure is a lot of liquid,” but figured I’d just stick to the directions....to my ruin. Next time, no water > is adding water a mistake in the directions(?) And I’ll start with 2c milk adding as it thickens. I'll try again. kimmie mullenSan Diego9/12/2020I started with two cups of milk. From past experiences...you can always add more milk.AnonymousMichigan7/23/2020As many others did, I cut this recipe in half, but didn't have any whole milk or cream so I used two cups or partly skimmed milk with one cup of water, and kept the cheese and butter portions up and it turned out really good. Was my wife's first time eating creamy polenta but it will not be the last as it was very well received. Good recipe.jcs6Edmonton, Canada6/10/2020I made this but I halved the recipe since it was just my fiancé and I. We have never had polenta prior to this but now we are sold! It was delicious and I can’t wait to make it again. AnonymousVirginia Beach, VA5/7/2020OK, time for the review.  I made this for myself, so I *halved* the recipe.  I used all whole milk (3 cups), 2 TBS butter, and 1/2 tsp of salt - and it was great!  Creamy and cheesy and perfect with a pork chop and steamed broccoli.  I've definitely added this recipe to my repertoire - thanks!WhatevermanMA, USA5/1/2020Sorry, but this isn't a review.  It's more of a question that I wont get answered before I make a first attempt at the recipe.  From reading the comments, the salt in the original recipe is an issue - and I can understand with the 4tsp called-for.  My question is whether the milk should be diluted 50% with water; I couldn't tell from the reviews whether people thought the dilution produced the right consistency or not.  SO - knowing I wont get an answer to this before supper is due: I intend to make a half recipe with only whole milk (2C) and 1/2tsp (or more) of salt.  PLEASE: I'm curious to know whether you folks liked the 50% dilution, but even if no one replies, I'll post my review of my version.WhatevermanMA, USA4/30/2020I was worried by the negative comments, but the polenta came together beautifully for me! Admittedly I only had no whole milk, but I used 2 1/2 cups of semi skimmed milk, and 1/2 cup of heavy cream, to be as close to the richness of whole milk as possible. I would say to taste the polenta after each teaspoon of salt, as I found 1 teaspoon was enough. \nIts really tasty! Akin to creamy cheesy mashed potato, I could eat it straight with a spoonAnonymousIsle of Man4/24/2020To negative reviewers.... use less salt and milk next time.  No reason for the negative reviews. If you don't like it, don't eat it....or learn how to cook!AnonymousMichigan4/17/2020Brilliant!  Easy and delicious.  My husband, who was not familiar with polenta, is now a huge fan.Cassie MFlorida4/14/2020Agreed with other reviewer, which I wish I had read before making. Too watery, too salty. Never really “thickened” for me. I think the fatal flaw in this recipe is adding water to the milk. I won’t try again to find out.BadPolentaUSA4/5/2020Explore Bon AppétitItalianEuropeanPolentaRice & GrainsSideVegetarianNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}