{"id": "93a9f56236096d565823eba472c21614", "url": "https://www.bonappetit.com/story/oxo-silicone-measuring-cups", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "The Test Kitchen Swears By These Silicone Measuring Cups | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By These Silicone Measuring CupsGoodbye glass, we’re onto new materials.By Zoë SessumsMarch 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailSenior food Editor Chris Morocco cooks (almost) every single day of the year. He’s always in the kitchen—developing recipes, filming demos, meal planning, feeding his family... So when he makes a statement like, “there’s a dearth of good liquid measuring cups out there,” I sit up and listen.“I’m over glass measuring cups,” he continues, settling into one of his thorough, tested, mad scientist–like arguments. “Most measuring cups are made from brittle glass, not the hefty borosilicate glass that can withstand heat changes better and are more resistant to breakage. Plus, try stacking those handled measuring cups. They become a cumbersome, unwieldy assemblage.”The solution, he said, was OXO Good Grips Squeeze & Pour Silicone Measuring Cups. And then he explained why. They’re structured enough to stand up on their own, but flexible enough to squeeze into a narrow spout for precise pouring. The material dissipates heat to protect your hands from whatever hot contents they hold, and their honeycomb-like textured surface means your grip won’t slip. They have “amazing nesting abilities” so you won’t lose space to all those protruding handles. AND, they can also go directly from the microwave to the refrigerator or freezer (or vice versa) without breaking. Oh, and they’re very easy to clean.Available in 4-cup, 2-cup, 1-cup, and “mini” sizes, they’re so handy, they might even take the place of other kitchen tools. Take a morning pancake feast for example: Skip the bowl and mix your ingredients right in the largest measuring cup. Ditch the ladle, and pour the batter into perfect rounds straight into the pan. Fill another, smaller cup with some maple syrup and pop it in the microwave til warm. Pass it around the table without scaling your kids, and fear fewer drips at the same time.If that won’t convince you, then just take it from always-in-the-kitchen Chris: “They’re everything.”Buy It: OXO Good Grips 3 Piece Squeeze & Pour Silicone Measuring Cup Set, $20 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-28", "author": ["Condé Nast", "Zoë Sessums"]}