{"id": "93aebbb6055728d7774b2df000885807", "url": "https://www.bonappetit.com/story/david-mcmillan-sober", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "My Restaurant Was the Greatest Show of Excess You’d Ever Seen, and It Almost Killed Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Restaurant Was the Greatest Show of Excess You’d Ever Seen, and It Almost Killed MeWhen the chefs of Joe Beef in Montreal gave up alcohol, their whole restaurant changed.By David McMillan of Joe BeefFebruary 20, 2019FacebookTwitterEmailPhoto by Chanelle Sinclair and Gabe WilliamsFacebookTwitterEmailA couple weeks ago I interviewed the chef-owners of Joe Beef, David McMillan and Fred Morin, at Books Are Magic in Brooklyn about their new book: Joe Beef: Surviving the Apocalypse. Midway through the Q&A, the two chefs—who are legendary, along with their iconic Montreal restaurant, for bacchanalian-level eating and drinking—began discussing their recent sobriety and how it has impacted the culture of their restaurants. They spoke with such candor that I asked McMillan to talk more. Here’s what he had to say. —Julia KramerI was never falling-down drunk. I was never belligerent. I always got my work done. I was never unkempt. I was always clean, I was always shaved, I always performed at work. I was always kind and gracious in the dining room. But I lived in hell.When we opened Joe Beef in 2005, we were inspired by Martin Picard at Au Pied de Cochon, by these grandiose bistros of Paris, by seafood towers, by excess. We were two portly men who ate and drank well. I was and still am very insecure about anybody coming to the restaurant and not having a spectacular meal. I want people to drink and eat to excess. I promote it.The community of people I surrounded myself with ate and drank like Vikings. It worked well in my twenties. It worked well in my thirties. It started to unravel when I was 40. I couldn’t shut it off. All of a sudden, there was no bottle of wine good enough for me. I’m drinking, like, literally the finest wines of the world. Foie gras is not exciting. Truffles are meh. I don’t want lobster; I had it yesterday. What am I looking for, eating and drinking like this every day?I started asking myself questions about alcoholism. What was I showing my children by eating and drinking like a Viking in front of them at the cottage? I wasn’t acting on many opportunities because I was hungover most of the time. I was medicating with food. I was medicating with alcohol. And finally it just got to a point where I was just really unhappy. My managers knew it, my staff knew it, and it strained my personal life at home. I Googled “Stop drinking,” “How do you stop drinking?,” “Are there pills you can take to stop drinking?” I’ve done a thousand Google searches over five years. I’ve tried to quit drinking 100 times and failed 110 times.It was a gift for me when I realized: I’m done. I was either at one restaurant medicating or at another one medicating or another one medicating. I think all my managers got together one day and realized I was always medicating somewhere. A little over a year ago, they interventioned me and sent me off to a rehab center that a few friends had gone to. I wasn’t resistant, because I was so unhappy. I learned a whole bunch of things about myself, about sobriety, about traumatic events that had happened to me in my childhood. I didn’t even know what the word codependent meant before I went to rehab. I didn’t know what people-pleasing meant. I didn’t know what an enabler was. Ultimately I took a crash-course in alcoholism, wellness, and the language of sobriety.In rehab they tell you: We recommend strongly that you stay away from bars and restaurants and the wine trade. We recommend strongly that you look for another job. I have no formal education. I’ve been working in kitchens since I was 16 years old. I have a wine company. I also make wine. And my whole existence in raising my family is based on the act of selling food and wine. I know nothing else. My rehab knew the reality: The fact is, I’m going back to the restaurant. I understand your recommendations. I may fail. But all I know is the restaurant business.Three months after rehab, I was still wary about going back to the restaurant. I went to my friend Ryan Gray’s restaurant, Elena. He said, “Put on your apron, put on your chef shirt, you’re gonna do the pass.” And I did the pass. I did the pass a dozen times. I drank San Pellegrino water, and I worked a 12-hour shift until I was exhausted, and at midnight I went home to my bed, and I watched Netflix until I fell asleep, and I did it again and again. And I got my courage back about working in a restaurant without consuming alcohol. At that point I went back to my own restaurant, and I worked in my restaurant and applied what I had learned.Photo by Dominique LafondWhen I was no longer acting like Joe-Beef-Viking-David-McMillan—at the bar opening magnums and telling stories and sending people Calvados and having a Campari soda in the afternoon with the staff and bringing the staff to the bar across the street and buying everybody shots and beers—when I broke that in myself, there was a trickle-down effect that followed.As I started taking care of myself, the staff started mimicking me. All of these young cooks who came to cook at Joe Beef, who look up to me and Fred [Morin], saw, well, David’s not drinking anymore, and he’s going to bed early, and he’s talking about what’s cool on Netflix. Then my staff was going to bed early and watching Netflix. My comptroller said staff drinking is down like crazy. We have the numbers. We used to give out 30 or 40 glasses of wine at the end of the shift, and it’s down to 10, and half the staff is drinking kombucha.When I became sober, there was this openness from the staff, because I spoke a different way. Before I was centered on: What am I going to drink? Who am I going to drink with? What are we eating? My language changed from being self-centered in my alcoholism to being a better boss, a better friend who actually enjoyed people. I got to know people again through tea and coffee with people. I don’t waste so many man hours talking about wine like I did before, like weed guys talk about weed. Now I actually care what you did this weekend. Now I actually care what your next move is when you leave Joe Beef. Now I actually care about the happiness of these people I’ve been working with for 15 years. Because before I didn’t care: I only cared about myself. I feel that I owe the people I work with, because they saved my life.At first, Fred he was like, “Fuck this, what’s Dave doing?” He hated me, I felt. Then he saw: Dave loves going to work. Dave’s happy. He’s smiling and he’s talking with the customers. He saw what I had and wanted it. Fred got sober really quickly after me. Now he’s six or seven months sober, and he’s in a very happy place.Many people were reaching out to me, inside of my own restaurants and among my peers at other restaurants. The amount of people reaching out to me who wanted to ask me questions, as if I had the solution, was staggering. Not many in the restaurant industry will speak about this stuff. We’re still sweeping the dust under the carpet.We’ve brought many people to different meetings around town. We’ve taken money out of the till and sent people to speak with private therapists. We have a meeting at McKiernan [one of our restaurants] on Sunday nights. It’s a non-AA–sanctioned meeting, where we re-wrote a little bit of the introductory speech of AA to leave the religious stuff out of it, because we noticed that a lot of people are apprehensive, especially in Quebec—there are people that need help, want help, but that categorically refuse help just because the word God or Jesus or that stuff is associated with the language of recovery. The meeting is open for everybody but it’s mostly for restaurant workers, and if anyone needs more help than what’s provided in that discussion, we have options for them to speak to somebody outside in a personal setting.As chefs we are asked constantly to do charity work. I raise $750,000 every year for Atlantic salmon. But I realized that when I have staff members who need to go see a therapist, I don’t have $100 to give them. It’s insane that we raised $750,000 for fucking salmon, and I don’t even have a bank account with $20,000 in it to send my coworkers to rehabilitation. The fact is we’re a motley crew of pirates who all need to speak to someone a bit. So we’re working to host a dinner with a bunch of chefs in the city, and form a registered charity to have professional therapists assess restaurant workers and then be able to send them either to therapy or to a rehabilitation center. It’s baby steps. But we raise so much money for things I honestly don’t care about. Why don’t we raise money for things we actually need and care about, right?Photo by Jennifer MayFor a lot of people who have read our first book, or seen us on Bourdain being hammered, or have heard about us from New York chefs who have visited the restaurant, they associate coming to Joe Beef with drinking with me. I built the company on my liver. My and Fred’s people-pleasing—our codependent behavior, our alcoholism—served us very well for 15 years. Every visiting chef and food writer from North America was like, “Holy shit, these guys are mad people.” “That was the greatest show I’ve ever seen.” “I’ve never drank and ate so well.” “Those guys are legends.”I literally have to tell everybody: I no longer drink, I’m super boring now. Some guys are like, “Oh man, really? I came all the way here from Minnesota. I’ve been saving up to come to Joe Beef. I really wanted to drink with you.” I almost feel like, holy shit, this young line cook, who has our book dog-eared, who fucking “likes” every post we do on social media, who saved his hard-earned money to come here, and I’m not going to drink with him? I feel like shit about it. You came all the way to Sea World and there’s no orca. The whale exhibit was closed that day.But it’s only the real ignorant meatheads who would say something awful, like that they would not come back to the restaurants because we didn’t drag out the hammered Krusty the Clown to drink Calvados out of a jeroboam with them. Lots of my customers now say to me, “David, I have to tell you that there were times when I left this restaurant worried about you. Because I knew that I came here once every two weeks and did the show with you, but I knew that for you, the show was every day. And I’m so happy for where you are right now.”I love the stage and all that, but I’m not going to stay on it until we’re just a bunch of performing clowns for the public, so it can turn into the saddest show on earth, because that’s where it was going. If Joe Beef fades away to obscurity, so be it. If I die tomorrow, I’ve had a wonderful career. I thank all of the wonderful people who came. I gave it my best. I gave everything to you, the public. Now I have to take care of myself.Explore Bon AppétitRestaurantsFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-20", "author": ["Condé Nast", "David Mcmillan Of Joe Beef"]}