{"id": "93b08aa83b7c74eb8c9a1ac25e960767", "url": "https://www.bonappetit.com/story/branded-meet-the-dumpling-for-every-occasion", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Meet the Dumpling For Every Occasion | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredMeet the Dumpling For Every OccasionBy Austrian Tourist OfficeMarch 15, 2019FacebookTwitterEmailApricot Dumplings © Österreich Werbung, Wolfgang SchardtFacebookTwitterEmailThere’s no denying that dumplings are a feel-good food. Whether they’re filled with soup or coated in pesto, these round, squishy carbs trigger satisfied yawns and euphoric food comas. So why wouldn’t Austria, lover of spaetzles and strudels, build an entire cuisine around them? In the German-speaking country, the locals refer to these supple handfuls of dough as knödel (knuh-del). They may be sweet, cheesy or tangy, and in the small Alpine territory, flavors change from valley to pillowy valley. There’s even a favorite knödel depending on which corner of the country you’re occupying. Knowing there are this many delicious dumplings at your fingertips, you’ll be planning your trip to Austria before you finish the final paragraph. But first, get to know the lay of the land.Germknödel in Arlberg\nGet Germknödel in ArlbergPicture yourself mountain-side in the Austrian Alps, craving something delicious to satisfy you after a day-full of hiking. You’re in Arlberg–a soaring Massif in Western Austria–and there’s also a steaming yeast dumpling on your plate, topped with poppy seeds, sugar, and melted butter. A light prick of your fork into the germknödel reveals warm plum jam inside bouncy dough. Arlbergians hike to Rud-Alpe or Ulmer Hütte to order their sweet dumplings for lunch, dinner, dessert, or all of the above. Germknödel are traditionally a treat for the snowy winter months, but if you call ahead, restaurants will make them on request.Speckknödel © Österreich Werbung, Wolfgang Schardt\nSavor Speckknödel in InnsbruckAustrians aren’t shy about their love of quality meats. In outdoorsy Innsbruck, speck (smoked pork belly) goes in everything, including bread dumplings. Made from pieces of kaiser roll soaked in milk, speckknödel taste like a hug that fills you up after a day in the Tirolean backcountry. Try them with a glass of schnaps at Gasthof Weisses Rössl or Stiftskeller in historic Old Town. Unlike the syrupy liqueur you once discovered in your parent’s liquor cabinet, schnaps is made from real Tirolean fruit and receives a careful distillation from one of the many local producers.Crave Kaspressknödel in SalzburgerLandThe countryside around Salzburg claims the highest concentration of award-winning restaurants in Austria—plus, there are nine themed “culinary pathways” to guide you to the best kitchens in the area. It’s from this food Olympus that kaspressknödel, or pressed cheese dumplings, first fell into a bowl of salty beef broth. They’re made with local cheeses, like beer cheese or grassmilk cheese, and are fried in clarified butter. Some might prefer them with salad or just a creamy dipping sauce.Flying Chef in Austrian Airlines Business Class © Austrian Airlines\nIf you travel for food, you know that every meal counts, which is why Austrian Airlines offers Business Class passengers multi-course menus served by their onboard Flying Chef. Fly non-stop to Vienna from one of six U.S. gateways, and you’ll be treated to several gourmet courses as well as a coffee house above the clouds, serving a selection of freshly prepared classic Viennese coffee specialties. The menu is inspired by Austrian staples, so you might even get a knödel fix along the way.Apricot Dumplings © Österreich Werbung, Wolfgang Schardt\nMarvel Over Marillenknödel in GrazApricot dumplings, or marillenknödel, are Austria’s most seasonal dumpling. In July and August, restaurants in Graz pit crates of perfectly ripe apricots, wrap them in quark cheese dough, boil them, and toss them in caramelized bread crumbs. The apricots hail from nearby mom-and-pop farms that earn Graz a reputation for exceptionally fresh, simple food. Austria has the largest percentage of organic farmland in the world, with 2079 organic producers in the province around Graz alone. You can sample the results at one of the city’s open-air farmers’ markets.Wherever you decide to stop on your Austrian food adventure, be sure to find a hotel that cares as much about great food as you do in the Austria Hotel Collection. In between knödel tasting, settle in and enjoy meals prepared by celebrated Austrian chefs. Perhaps they’ll even have their own rendition of the doughy mainstay? You’ll just have to find out.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-12", "author": ["Condé Nast", "Austrian Tourist Office"]}