{"id": "93bd8faf43cfb0eee1c55d54dadafab8", "url": "https://www.bonappetit.com/recipe/corn-and-peach-chaat", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Corn and Peach Chaat Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCorn and Peach ChaatBy Sohla El-WayllyAugust 11, 20205.0(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Sohla El-WayllyEmailPinterestPrintEmailPinterestPrintEvery day after work, my abu would throw together a chaat with whatever was around. This afternoon chaat was his happy hour, and he wouldn’t even remove his shoes until he’d scarfed down a bowl. Chaat is a street food found throughout South Asia that can appear in a multitude of forms, from pani puri, which are crispy semolina shells filled with tart tamarind water, to bhel puri, a mix of puffed rice and peanuts dressed with fiery mustard oil. Anything can be a chaat as long as there’s a mix of crispy textures, acid, spice, and, of course, funky, salty chaat masala for seasoning. This chaat recipe is inspired by my father’s, and made with ingredients I have around during peak summer. Juicy ripe peaches, raw sweet corn, and roasted peanuts get tossed with aromatics and dressed in a perky nimbu pani, a spiced salty limeade. The whole thing is the perfect refreshing, recharging antidote to a day spent out in the sun. —Sohla El-WayllyIngredients2 servings2ears of corn, husked1medium ripe peach, cut into ⅓\" pieces½small red onion, cut into ⅓\" pieces2green Thai or serrano chiles, thinly sliced1garlic clove, very thinly sliced11\" piece ginger, peeled, cut into matchsticks⅓cup coarsely chopped cilantro⅓cup salted roasted peanuts or other nut½tsp. freshly ground black pepper2tsp. sugar, divided2½tsp. chaat masala, divided¼cup fresh lime juice⅓cup aloo bhujia, sev, or crushed potato chipsPreparationStep 1Stand corn upright in a medium bowl and slice off corn kernels with a sharp knife. Using back of knife, scrape along the cob to release corn milk into bowl. Add peach (making sure to get all of the juices into the bowl too), red onion, chiles, garlic, ginger, cilantro, and peanuts to bowl and toss to combine. Sprinkle with pepper, 1 tsp. sugar, and 1 tsp. chaat masala and toss again. Divide between shallow bowls.Step 2Stir lime juice, remaining 1½ tsp. chaat masala, and remaining 1 tsp. sugar in a small measuring glass until sugar is dissolved. Add ½ cup ice water and stir to combine. Divide lime water among bowls of chaat and top with aloo bhujia.How would you rate Corn and Peach Chaat?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleFirstly, shout out to Sohla for consistently making my favorite recipes on this whole site.\n\nThis recipe is one of the tastiest things I've ever had the pleasure of eating. It's the perfect blend of crunchy and citrus-y and just-a-hint sweet. It's been really hot here the past couple of weeks, and this really, really hit the spot. I've made it about four times since first making it a little over a week ago, it is THAT good. Go get the ingredients for it now (this is peak summer-y produce)! Don't walk, run! ;) AnonymousCalifornia8/21/2020Making this tonight for my Indian-American husband. We love riffs on chaat. At our house we make a version of samosa chaat. Bake frozen samosas (4-6 depending on size) and while chilling cut into smaller pieces and combine the following: one red, yellow or orange pepper, 2-3 Persian cucumbers (Sliced, salted and places in colander to drain), a big handful or two of finely chopped spinach and cilantro. Chop samosas when at room temp and add to veggie bowl. The add tamarind chutney and cilantro chutney (both available at any Indian grocery) about 1/3 a cup of each perhaps more to taste. Add chaat masala start w a tablespoon or two. Add 1/2 cup of whole milk yogurt and combine. Finish w a squeeze of lemon, some fresh chopped cilantro and sev. My sister says this would be her last meal on earth given the option. Enjoy! 💖✨AnonymousNew York8/18/2020This is amazingly good. I made a bowl on Saturday and then another on Sunday. There is a fair chance that I will make another today. yum.\n\nDoes anyone have any recommendations for other Chaat variations?AnonymousBoston8/17/2020Is the corn raw? Doesn't it need to be cooked at all first? Anonymous8/12/2020Explore Bon AppétitSouth AsianAsianCornVegetablePeachStone FruitFruitSummerEasyQuickSnackDairy-FreeVeganVegetarianGluten-FreeFourth Of JulyMemorial DayLabor DayRamadanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-11", "author": ["Condé Nast", "Sohla El-Waylly"]}