{"id": "93c1d8277cf61fa7d45ffd7b507c6d52", "url": "https://www.bonappetit.com/story/laura-harrier", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Laura Harrier on Taking Spike Lee's Phone Calls, Circuit Training, and Natural Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLaura Harrier on Taking Spike Lee's Phone Calls, Circuit Training, and Natural WineThe BlackKklansman actress has had a whirlwind year, but she's staying balanced with plenty of Vitamin C.By Caitlin BrodyAugust 7, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailFor actress Laura Harrier, good things happen while traveling. “I was on an island in Greece last summer with my friends and I got a phone call from a number that I didn’t know,” recalls the 28-year-old, who got her breakout role in Spider-Man: Homecoming last year. Turns out, it was Spike Lee. “I was about to hang up because I thought someone was prank calling me! He told me he wanted to see me for his new movie.” The only problem? She had to get from the Aegean sea to the concrete jungle of Manhattan the very next day. “He was like, ‘Vacation’s over. See you in New York.’” A plane-ride later, Harrier found herself in a “marathon audition” that included an intense improv session with Lee that lasted over an hour. He called her the next day and offered her the role of Patrice, a black power activist in his hot-button film BlacKkKlansman, based on the true story of the first black police detective to infiltrate the Ku Klux Klan. Critics have said it’s Lee’s best film in years.After BlackKklansman premiered at the Cannes Film Festival in May, Harrier jetted off to Porquerolles in the South of France to unwind with friends. “The next morning, Spike called. He was like, ‘We won something. Come back to Cannes!’” The film nabbed the coveted Grand Prix prize. “Every time I’m on an island, Spike finds me. It’s crazy!” she says with a laugh. When we spoke to Harrier at the end of July, she had been bouncing between Cannes, Porquerolles, Saint-Paul-de-Vence, Paris, Rome, Sicily, Brooklyn and Los Angeles—over the course of just three months. For most of us mere mortals, that kind of travel would require a Sleeping Beauty-style recovery, but Harrier has it down. Here’s how she manages to stay sane while living out of a suitcase.You’ve been jetsetting like a madwoman, and you only just got back from Italy two days ago. What’s your travel M.O.?When I’m traveling, I try to fully embrace wherever I am—for me, that means embracing the food. If this is a trip that’s super memorable and special to me, it’s worth it to indulge. I’m going to have the gelato; I’m going to eat all the things. And then when I get home, I will go to the gym everyday. When you’re in these special spaces in the world, the full experience means having all of the things. I let myself do that and try not to feel guilty.How do you deal with jet lag?You reach a point where you feel kind of crazy all the time, but being outside as much as possible usually helps. Whenever I’m in a new city, I try to walk everywhere. But I think the best cure is just to jump in the ocean. It cures everything!What about when you’re actually on the plane—have any hacks?I always use Sisley’s Black Rose Cream Mask on the plane, and I always have a silk eye mask and Caudalie’s Beauty Elixir Spray. I’m that person.What was one of your most memorable meals while you were in Italy?I spent a week in Sicily with two of my best friends, eating pasta and driving around. We actually became friends with these cute Italian guys who we met on the beach. They came over and cooked for us one night; it was great! I never like sardines, but one of the guys pan-fried them and poured this crazy lemon-basil sauce all over them. It was amazing! He also made pasta with swordfish. The meal was so insane. I was like, is this my life right now? We also went to a natural wine vineyard in Sicily. It was magic.There’s a great natural wine bar in Brooklyn called June. Have you ever been?I love June! We went there one year for my birthday and cleared it out. Their sparkling orange wine is insane. I’m really into natural wine. But I also love a dirty martini—in moderation, because those are dangerous. I love eating, drinking, and going out, so I just have to exercise and be aware of what I’m eating at other times. I’m all about balance.What’s your approach to exercise when you’re home and aren’t getting your steps in all over the streets of Europe?I actually woke up this morning and went to a barre class at Physique57. I kind of hate barre—it’s so hard. I like SoulCycle, and have an amazing trainer, Kirk Myers, at Dogpound here in New York. We do circuit training, and I box there.And on the rare days when you’re not traveling, what’s a typical morning like for you?I always make coffee, and then I take these really gross Lypo-Spheric Vitamin C packets. They’re gooey and taste like trash, but they’re supposed to be good for you. I take a shot of green juice as a chaser, and then I’ll have avocado toast or peanut butter with a banana. I try to meditate a bit, too. I was using Headspace and then I was like, I can do this on my own. But I just sit there. (Laughs)Explore Bon AppétitHealthyishCelebritiesprofileRead MorecultureMandy Moore on the Gluten She Does Eat and the Snack That Got Her Up KilimanjaroBy David WaltersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-07", "author": ["Condé Nast", "Caitlin Brody"]}