{"id": "93c707bcb4d66d049d37eee7c4a8df9d", "url": "https://www.bonappetit.com/story/why-im-still-having-happy-hour", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Why I'm Still Doing Happy Hour, Even in the Time of the Coronavirus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingWhy I'm Still Having Happy Hour, Even At a DistanceI can't tell 10 a.m. from 2 p.m., but I do know when it's time for a drink.By Al CullitonMarch 20, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis month on Happy Hour with Al, Al Culliton, Basically's resident bartender, is explaining why—and how—she's still making cocktails, even (and especially) in the context of social-distancing.I have nothing to complain about during this time of uncertainty. I’m here at home with my partner. We’re both working from home. We have more than enough food and a goodly stock of liquor. If you’re able to take the time to read this, you are probably lucky, too. But, like all of us right now, it’s difficult to get a handle on a sense of what day it is and how to make things feel normal. Some of my friends have posted their little schedules for their own days, or the ones they made for homeschooling their kids, some are wearing clothes they’d normally wear to work, or doing certain things at the same time every day. Me? I’m doing cocktail hour.This may shock you, but I typically don’t drink cocktails every night. In recent days, that’s changed. For me, making cocktails at home (which I encourage readers to do in each of my monthly articles) provides a similar comfort to cooking, but it feels different, more akin to doing a face mask. (Okay, I’ve never done that, but I’ve heard it’s relaxing.) Cocktail hour isn’t necessary, and it won’t sustain you physically, but taking the time to prepare a drink for yourself that’s completely unnecessary and enjoyable is emotionally nourishing.It’s certainly helped in our household. Before I make my drink, I tidy up my desk and make sure all of my lunch and snack dishes are done. (So many dishes when you’re eating three meals a day at home…) Then I offer my partner a cocktail. Sometimes she wants one, sometimes not. When she does, she chooses one of her favorites: a Negroni or Boulevardier, Gimlet, Manhattan, anything with bourbon… It’s nice to be able to do something for your favorite person, who is also stuck with you during this strange time.The Ferrari is equal parts Campari and Fernet-Branca.\nPhoto by Laura MurrayAs for me, I’ve been saying yes to cocktails every night. (A serious note before we proceed: Please consider the state of your mental health before indulging in this particular ritual.) I’ve been really into some simple, sturdy 50/50 amaro-based drinks lately, and they’ve been fueling this evening cocktail ritual. My favorite is the Ferrari, an equal-parts drink (a shot, really) with murky origins in San Francisco, that’s the best of two bitter worlds, 1 oz. Campari and 1 oz. Fernet-Branca. Since the former is an aperitivo and the latter is a digestivo, it works just as well before dinner as after. (Don’t worry, we’ve been working on an amaro story for you and you’ll understand all of this better soon!) My pal Alex Delany is a big fan of mixing the artichoke-based amaro Cynar with Laird’s applejack and I’ve been drinking that some nights, too, with an ice cube and an orange twist.Extend the gift of a cocktail to those close to you. If you’re quarantined with a partner or some roommates, offer them a drink! If you’ve got kids in the household (or folks who don’t drink!), make a mocktail with citrus, whatever syrup you have on hand (simple, grenadine, ginger, etc.), maybe some soda, and a fun garnish. If you can, make an extra cocktail in a small bottle or jar, leave it on your neighbor’s doormat, call them to tell them it’s there, and stand six feet away. If you’re on your own at home, you might take some joy in the nascent-but-growing movement of virtual cocktail hours taking over during this time of social distancing. I’m really looking forward to tonight’s cocktail hour. I’m thinking martinis.And here’s an idea: If you’re a person of means, consider reaching out to your favorite bar or bartender (maybe you follow them on Instagram?) and tipping them for the cocktail they would have made for you. The U.S. Bartenders Guild has a fund going now that a lot of people I know have applied, or will be applying to, in an attempt to meet their basic expenses. Please donate if you can. There are “virtual tip jars” popping up on Venmo and other platforms for different parts of the industry, and for various companies and cities. Also, my friend MacKenzie Fegan just wrote this piece about how you can ensure your favorite bars, restaurants, and food-related businesses will be there when this is all over.So when you’re at home, drinking your nice cocktail, chatting with your roommate (or your friend over Skype), raise a glass to (and Venmo) your local bartender and daydream about your first drink back at their bar.Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlCoronavirusHappy Hour with AlBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-20", "author": ["Condé Nast", "Al Culliton"]}