{"id": "93c8a102f90d6192541e5edf64170813", "url": "https://www.bonappetit.com/story/black-panther-free-breakfast-program", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "How The Black Panthers Party’s Free Breakfast Program Laid the Groundwork for Modern Activism | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Black Panthers Fed Their Communities—for FreeThe Black Panther Party’s Free Breakfast Program fed schoolchildren at no cost and laid the groundwork for modern activism.By Valerie BoydMarch 23, 2021FacebookTwitterEmailPhoto by Stephen ShamesFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.When Black Panther Party member Ericka Huggins left prison on May 25, 1971, she was hungry.She had been hungry every day for the two years she’d served at Connecticut’s Niantic Correctional Institution, a high-security facility for female offenders. There, prison officials used food—the persistent coldness of it, the lack of nutrients in it, the sheer nastiness of it—as a weapon of control. Fruits and vegetables were scarce, and meat was mysterious. “It was just air food,” Huggins remembers. “You couldn’t tell what it was because it was gray, no matter what.” But the incarcerated women had no choice. “You ate it or starved.\"Eventually, Huggins and other women chose to starve. They staged a hunger strike on behalf of pregnant prisoners, who received no prenatal vitamins or additional nutrients. Embarrassed by the media attention, prison officials “were forced to improve the food,” Huggins says, “but not by much.”The Black Panther Free Breakfast Program in action at St. Augustine's Church in Oakland.\nPhoto by Stephen ShamesNo wonder, then, that she was drawn to the Panthers’ Free Breakfast Program when she was released, after her case ended in a mistrial and the trumped-up charges of murder and kidnapping were dropped. Launched in 1969 to feed under-resourced American children and combat hunger—which the Panthers called “one of the greatest forms of oppression”—the program was flourishing when Huggins moved back to Oakland, California. She soon became director of the Oakland Community School, which served home-cooked breakfast and lunch five days a week to hundreds of schoolchildren. “It was just so nice to see that the children were not going to the classroom hungry,” Huggins recalls. They “knew they were loved.”The Panthers secured food—eggs, meat, bread, fresh fruit—through donations from individuals, small stores, and local supermarkets, sometimes through threat of boycott. The free meals filled a critical need in the community. “Our waiting list included unborn children,” Huggins recalls.One day, she remembers, several boys lingered in the schoolyard, playing basketball as she locked up the school for the day. The boys told her that their parents worked multiple jobs and long hours, so no one—and no food—awaited them at home. Huggins went to the school’s head cook, Melvin Dixon, with an idea:“Comrade, the children are always hungry,” she started. Dixon cut her off. “We’ll have dinner tomorrow,” he said. From then on there were three meals a day.At its peak the nationwide Free Breakfast Program fed thousands of children daily, with at least 45 chapters in major cities from Los Angeles to Boston, and in rural communities throughout the South. It paved the way for the USDA’s School Breakfast Program, permanently authorized in 1975.Fifty years later the Free Breakfast Program serves as an enduring model for numerous initiatives that address food insecurity, particularly in the wake of the pandemic—programs such as D.C.’s Bread for the City, FrontLine Farming in Colorado, Harlem Grown in New York, and the Interfaith Food Shuttle in North Carolina.More broadly, the Panthers laid the groundwork for such obvious descendants as the Black Lives Matter Movement and for current calls to defund the police. “If you think of it like the ebb and flow of the ocean, the Black Panther Party was a wave,” Huggins says, “then the Black Lives Matter network is a wave.”Huggins is 73 now and lives close to the site of the Oakland Community School, home to a program that helps formerly incarcerated men reenter society. She frequently runs into former students who thank her for feeding them so many years ago. “This used to be my school,” one told her, “and it was the best part of my life.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Valerie Boyd"]}