{"id": "93e4c8a92a13145c21fcb5cc2dde206d", "url": "https://www.bonappetit.com/story/ho-foods-nyc", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Only Ho Foods Can Sate My Cravings for Taiwanese Beef Noodle Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Tried Everything to Fill the Beef Noodle Soup–Shaped Hole in My Heart, and Then I Found This PlaceOnly Ho Foods can satiate my cravings for the Taiwanese staple.By Elyse InamineApril 2, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m not an expert on Taiwanese beef noodle soup, but I certainly eat like one. After slurping my weight of the stuff in Taipei for a week, I returned to New York City very aware of the big, gaping, bowl–shaped hole in my heart. I became obsessed with finding the best version in town, and after months of eating my way through a very real boom of new Taiwanese restaurants, I finally found it at Ho Foods. The version chef-owner Richard Ho serves out of his teeny-tiny spot (there are only 10 seats) in New York’s East Village is a thing of absolute beauty: Glossy, soy-braised beef shanks from sustainable butchery Happy Valley Meat Co. An intricately layered broth made of the braising liquid, jellied beef stock, and a little bit of “mother broth” from the previous day’s batch. Flappy, white flour noodles with the right amount of chew. Mustard greens, salt-pressed and fermented for about a month. And if you’re willing to pay a little extra (which, if you know what’s good for you, you will), a chile crisp–esque finger bowl of beef fat seasoned with three types of chiles. Altogether, it’s like sinking into a pair of 100 percent cashmere joggers (they exist!): It’s satisfying and cozy and, at the same time, so next-level luxurious.Go there: Ho FoodsExplore Bon AppétitHighly RecommendRestaurantsNew YorkRead MorerestaurantsAn Eating Tour of Taipei, TaiwanGallery12 SlidesBy Matt GrossrestaurantsEddie Huang on Taiwanese FoodBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Elyse Inamine"]}