{"id": "93eac3b566ab21bfa9dd3d8be0c73a4a", "url": "https://www.bonappetit.com/story/how-one-bon-appetit-editor-makes-dinner-guests-feel-like-family", "year": 2019.0, "month": 11.0, "day": 4.0, "content": "How One Bon Appétit Editor Makes Dinner Guests Feel Like Family | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow One Bon Appétit Editor Makes Dinner Guests Feel Like FamilyFor Bon Appétit Senior Food Editor Molly Baz, the best dinner parties are the delegate-your-friends kind with a full oven and a hearty, no-fuss feast. By Café AppliancesNovember 26, 2019FacebookTwitterEmailFacebookTwitterEmailBringing people into your home for a dinner party is an intimate thing, and everyone’s style is different––which is how it should be. Unique. For me, menu inspirations come from every corner of my life. At work, I’m around food all the time. I look at pictures of food all day. But part of what I love about my job is that, in the Test Kitchen, I’m surrounded by talented chefs, each of whom have a unique perspective, relate to cooking in different ways, and bring their own personality to their craft. The conversations and ideating that happen at work are so inspiring and, of course, spill over into my personal life.As if devouring recipes every day on the job weren’t enough, I’ve also made an important ritual of visiting this tiny, magical, wonderful cookbook shop in my neighborhood. On weekend mornings, I’ll go drink coffee and pore over the selection. I’m currently writing a cookbook that’s meant to inspire novice cooks of my generation. It’s all about taking loftier fundamental techniques and distilling them into something simple, powerful, and streamlined for readers. But because I spend so much time developing recipes, when I’m hosting friends I like to be very free about the way I cook. I don’t want to have to think so much about the amount of pots I’m using or utensils involved.In a perfect world, my home kitchen would have all the innovative appliances that I have access to at work. I’d love pieces from the Café Modern Glass Collection. They’re these gorgeous appliances that are not only high tech and chef-inspired, but also designed to be as sleek as they are effective. They have reflective-glass finishes and angular, modern lines, which go hand in hand with my minimalist aesthetic. Double wall ovens with chic, glass-touch controls and WiFi to control from your phone would revolutionize my hosting experience. My hosting style is simple and laid back, but my cooking is meticulous. I want my space to reflect that.I love to throw parties in which things don’t have to be so highly considered. A while back we had about 16 people over (which is a lot for a New York City apartment!) for a jamon party. We set up a big leg of ham on the counter top, where I carved strips of ham and passed it to guests throughout the night. Everyone else made pintxos, and we sprinkled them around the apartment for people to graze on throughout the night. This way, the party still had a focal point (ham!), but it was casual, and everyone was still full at the end of the night.As for more traditional, seated dinners, good contenders include a mixture of dishes meant to be served chilled or room temperature. With these more structured dinners, I’m always considering how much of each appliance my menu will demand. I lean into big roasted meats, things that can hang out, or are great at room temperature: roasted vegetables or a pot of beans I can make ahead of time. The Café Modern Glass Collection features a six-burner range with heavy-duty, edge-to-edge grates and smart features that automatically track progress, modify temperatures, and adjust cook times. Can you imagine? It would be like having a chic, well-dressed personal assistant in the kitchen, the perfect complement to an extensively thought-out sit-down dinner.While I love the entire process of preparing food for my friends, my favorite part of the night is the last 30 minutes before the food hits the table. Each dish is getting its final touch, the kitchen is warm and fragrant; everyone is hungry and there’s so much anticipation around the meal. That’s when I start delegating. I want my guests to feel like they’re having dinner with family. Many of us don’t live near our parents anymore, and I love bringing people together around a table in a home, where it’s not so formulaic, like in a restaurant. So I ask my friends to set the table at the last minute, to bring wine or make cocktails, to pick up ice or make an appetizer. Then we sit down together and enjoy something that everyone contributed to. That’s what it feels like when you’re part of a family.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-26", "author": ["Condé Nast", "Café Appliances"]}