{"id": "93ead83abb2d8e4d45dae5b06b693ec4", "url": "https://www.bonappetit.com/story/pandemic-cooking-practical-magic", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Pandemic Cooking Isn’t About Hope. It’s About Practical Magic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusPandemic Cooking Isn’t About Hope. It’s About Practical MagicAnd it stopped being depressing once I started making what I actually wanted to eat.By Zoe YangAugust 18, 2020FacebookTwitterEmailIllustration by Rose WongFacebookTwitterEmailThere’s a story in Chinese mythology about a girl who drowns in the sea and becomes a bird called Jingwei. Jingwei vows to fill the sea and spends eternity flying back and forth, dropping one pebble into the water at a time. In recent days, I’ve found myself thinking of Jingwei often. Is her story one of dedication? Or futility?As someone who works for a large medical group, most days feel like dropping pebbles in an ocean. Recently, my therapist asked me what I’m hopeful about, and I struggled to answer. I didn’t know how to explain that I see hope as a form of magical thinking, and I’m tired of magical thinking. Magical thinking changes all the time: No on masks, yes on masks. Maybe avoid heartburn medications—on the other hand, maybe not. A vaccine by fall, now by spring. The coronavirus has already reduced medicine to talismans, politics, and hope; I need something else.Like many others, I’ve been cooking.I bought my fair share of beans and pasta back in March. But once I was home, surveying the lentils, the pintos, the boxed mac and cheese, I wondered why I’d bought all these things that had never been part of my routine. Every time I looked at them, I was reminded of all the places I couldn’t go, all the things I couldn’t do. I missed Chinatown and Flushing, places where I had spent most of my time before the pandemic, soaking myself in supermarkets and food courts for entire days.I made one pot of beans and I knew I would not make another, but when I looked at my soybeans, something clicked. I’d seen my mom make soy milk in a pressure cooker, so that’s what I did. Water and soybeans—simple enough. It seemed wasteful to throw out the pulp, so I turned it into pancakes. There was so much soy milk, it was only logical to set some of it into silken tofu, and then to cook a little ginger with sugar to drizzle over it. All of a sudden, I was back at Golden Unicorn, taking that last bite of doufuhua when it’s the only thing you can fit into a belly already stuffed with har gow and cheung fun.The next week, I rigged my bamboo steamer into a makeshift tofu press. When it worked—when I got to drag a butter knife through my block of tofu and feel its gentle yield—I felt like the sorcerer’s apprentice.I called my mom.My mom wasn’t always a cook. After we moved to the States when I was six, necessity drove her to the kitchen and homesickness inspired her to begin recreating from scratch all the little things we’d taken for granted in Nanjing. Family dinner was sacrosanct, but also fairly bizarre—she was always trying to figure out how to make things like jiuniang, or youtiao, or duck fat shaobing, but also trying out lowbrow American hacks like melting American cheese on steamed broccoli, crumbling ramen noodles into salad, or baking meat and fish in a coating of pre-seasoned “Italian” breadcrumbs. My diet was mostly Chinese failures and American shortcuts.Her kitchen experiments, even when they failed and there was pot after pot of rotten jiuniang rice littering the apartment, conveyed a can-do spirit. From her, I learned that things like cured duck eggs and tofu did not spring into existence in some factory, nor did they require mystical hours at the hands of an artisan. I also learned that neither time nor money were correlated with tastiness. I loved her almond Jell-O with syrupy canned mandarin oranges as equally as I loved her hand-kneaded mantou.Before the pandemic, I tried to follow certain beliefs de rigueur around food as far as finances would allow: that freshness is deliciousness, that slow beats fast, that the most organic, sustainable and local choices are the most ethical choices. Under new constraints, I’ve found that these dictums cannot stand, at least not consistently. Some days I have the privilege of fresh produce, other days I have the privilege of time, and other days I have neither. If it means that my ingredient base has become less local, and that I’m relying on more canned or frozen items from far away—even as I’m also making more things from scratch—I’m okay with that. The circumstances demand flexibility. It turns out that growing up in a household of displaced people has made me surprisingly comfortable with cooking this way.I spend my workdays chipping away at tasks that feel impossible, my head filled with the uncertain swirl of virtual visit logistics, testing, PPE, social distancing directives, and reimbursement policies. Imagine you’re trying to untangle the biggest pile of cords in the world, but you’re not sure if any of those cords are connected to functional devices, all while someone screams at you from the sidelines. I think this is how my mom felt when we first moved to the U.S., and she was facing down her own set of impossibles: going to school, working, and raising young kids all while being broke and tenuously documented. I think I understand now why she was flooded with marvel and joy every time she finally nailed a recipe.What I struggled to explain to my therapist: to be able to make mapo tofu from scratch, starting with a humble dried soybean, is more powerful than hope. It’s actual, practical alchemy. Only in that moment do I no longer feel as if I am uselessly flapping my wings to beat back an ocean.Pandemic cooking stopped being depressing once I started making what I actually wanted to eat. Even if I couldn’t grocery shop as often as I wanted to, cooks and writers I’d long looked up to helped me stretch what I had: from the forager Marie Viljoen, I learned when and where to find mugwort, Japanese knotweed, field garlic, and pokeweed through spring to supplement my store-bought herbs and greens. From the blogger Maangchi, I adapted kimchi methods to make my precious Chinatown vegetables last longer between trips. From my former mentor David Ferguson of Restaurant Gus in Montreal, I remembered that old cheffy secret: a well-made Caesar salad is still the best way to make romaine lettuce and pantry staples feel like a million bucks. It’s not lost on me that my favorite cooks are all immigrants, people who’ve had to go upstream, reverse-engineering not just prepared dishes but the very pantry ingredients that go into them, adapting as they go.From the flourishing I see on Instagram—all the seeds and starters and ambitious bakes—I can tell I’m not the only one stretching. Under the surface of our imposed stasis bubbles a huge amount of collective creativity. But we’re just the latest inheritors and transmitters of ancient knowledge, since every great cuisine in the world has figured out how to make scarcity taste like bounty. In each of their blueprints I find inspiration: a kuku sabzi-like approach to wilting greens and herbs only requires egg and a little flour to make a meal. Strong black tea leaves, dried noodles, romaine, fish sauce, and some pantry crunchies (fried shallots, peanuts, sunflower seeds) can get you to an approximation of Burmese tea leaf salad. Banh xeo’s heady fragrance and crackling texture requires not much more than rice flour and canned coconut milk. Spam musubi, a true wartime invention, is well, just Spam and rice and dried seaweed. And hominy—whew, like the soybean—not just an ingredient but a whole portal.As the pandemic wears on, I return, again and again, to Chinese food, which is my heart food. In quarantine, my mom and I have become co-conspirators, swapping links from the app Xiachufang (Get to the Kitchen), which is like a Chinese version of Allrecipes. The recipes are full of living information submitted by ordinary geniuses, all cheerily pragmatic.The pandemic has made clear that following recipes to a T, particularly ethnic ones, has always been an act of preciousness, not authenticity. There have always been hard times; what’s constant is that people cook from their environments. Instead of tradition, I honor craving. When the weather got nice, I craved liangfen, the mung bean jelly salad my parents would make batches and batches of all summer long, but I didn’t have mung bean starch. I used sweet potato starch instead, and tossed in foraged baby mugwort leaves instead of cilantro. It wasn’t correct, but it was right.Not that everything has been successful. An attempt to ferment my own tofu simply resulted in...rotting tofu. My radishes went moldy instead of becoming lobo gan. A focaccia dough made with immature sourdough starter taunted me for three days, refusing to rise. My mom was never upset when her own attempts failed. She ate what she could and tried again. In cooking, only the triumphs live on.In the Chinese language, the Jingwei story is a well-known idiom for perseverance in the face of the impossible—精卫填海—but the idiom leaves space for ambiguity: the bird cannot accept change and is thus doomed to use its immortality to fight a past death. Its transformation is wasted.It seems clear that medicine will never be the same again; society will never be the same again. Putzing around in one’s kitchen won’t cure the coronavirus or its lateral economic harms, but if the question, “what are you hopeful about?” implies a need to make predictions about a murky future, I have been fortified by looking to—and cooking from—near and distant pasts. By definition, every food we cook today is from a lineage of survivors; recipes themselves are survival texts. We’re all adding annotations to this ongoing record, sometimes writing whole new chapters. To me, this is genuine magic, not just magical thinking.Last week, my mom called to tell me what happened when she tried out my tofu method. She didn’t quite think through how to strain the curds, so all the tofu slipped out of the cheesecloth and down the sink. As she told me, she started giggling over the silliness of her mistake, until she was laughing so hard that I could practically hear the tears eking out. It was the best sound I’d heard in weeks. Compared to everything else, what a gentle way to fail.Explore Bon AppétitCoronavirusRead MoreLifestyleAs Coronavirus Panic Spreads, I Went in Search of Wuhan’s Defining DishBy Zoe YangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Zoe Yang"]}