{"id": "9400fe133133bb41b83e5fd4cd48170e", "url": "https://www.bonappetit.com/recipe/grain-salad-with-tomatoes-and-cucumbers", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Grain Salad with Tomatoes and Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueGrain Salad with Tomatoes and CucumbersBy Ignacio MattosApril 17, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe call for semi-pearled grains because they cook more quickly and have a roughened-up texture that helps them soak up the dressing. Browning them first deepens their flavor. Serve this salad alongside a picnic menu of beef sliders, shrimp empanadas, and Italian sundaes with Nutella.Ingredients8 servings 2cups semi-pearled farro or speltKosher salt⅓cup pine nuts3medium Persian cucumbers, peeled, cut into ¾\" pieces3medium tomatoes, thinly sliced1pint Sun Gold and/or cherry tomatoes, halved crosswise1small red onion, very thinly slicedJuice of 1 lemon (or more)⅓cup extra-virgin olive oil2Tbsp. red wine vinegarFreshly ground black pepper2cups torn basil leavesPreparationStep 1Preheat oven to 350°. Cook farro in a large Dutch oven or other heavy pot over medium heat, stirring often, until golden brown and toasted (it should start to smell like popcorn and some grains may pop), about 4 minutes. Remove pot from heat and pour in cold water to cover grains by 1\"; throw in a healthy handful of salt. Set pot over medium-high heat and bring water to a boil. Reduce heat and simmer, skimming foam occasionally from surface, until grains are tender but still have some bite, 25–35 minutes. Drain and transfer farro to a large bowl.Step 2Meanwhile, toast pine nuts on a rimmed baking sheet, tossing once, until golden brown, about 5 minutes. Let cool.Step 3Add pine nuts, cucumbers, both kinds of tomatoes, red onion, lemon juice, oil, and vinegar to bowl with farro and toss everything together to combine. Taste and season with salt, pepper, and more lemon juice, if desired.Step 4Top salad with basil just before serving.Step 5Do Ahead: Farro can be cooked 1 day ahead. Let cool; cover and chill.How would you rate Grain Salad with Tomatoes and Cucumbers?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious, my husband just asked me to make it again!AnonymousWisconsin5/9/2018Explore Bon AppétitSaladFarroRice & GrainsSpeltTomatoVegetableCucumberEasySideDairy-FreeVegetarianVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}