{"id": "941cac7887058f861ffd39114a8920ec", "url": "https://www.bonappetit.com/recipe/chickpeas-and-dumplings", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Chickpeas and Dumplings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChickpeas and DumplingsBy Sarah JampelApril 20, 20204.6(76)Read ReviewsTriangleEmailPinterestPrintPhoto by Sarah JampelEmailPinterestPrintEmailPinterestPrintThis recipe gives off major chicken-soup vibes but is entirely vegetarian—and you don’t have to simmer vegetables or cheese rinds for hours to get there. The lightning-fast broth gets its flavor from caramelized miso and nutritional yeast (a trick we picked up from Bay Area cookbook author and food writer Andrea Nguyen). The gluten-free dumplings are soft on the outside and pleasantly chewy on the inside. If you aren’t sure what to do with the rest of the bag of chickpea flour, try making socca (chickpea pancakes).Ingredients4 servings ¼cup (15 g) nutritional yeast flakes or 3 Tbsp. (15 g) nutritional yeast6Tbsp. extra-virgin olive oil, divided, plus more for serving1medium onion, finely chopped¾tsp. ground turmeric, divided½tsp. kosher salt, plus more2Tbsp. yellow miso4garlic cloves, divided115.5-oz. can chickpeas, rinsed, or 1½ cups cooked chickpeas1cup (100 g) chickpea flour½tsp. baking powder½tsp. cayenne pepperFreshly ground black pepper½cup finely chopped dill⅓cup plain whole-milk Greek yogurt, plus more for serving2medium or 3 small celery stalks, thinly sliced on a diagonalPreparationStep 1Place nutritional yeast in a small bowl or measuring cup and pour in ⅔ cup hot water; stir to combine. Set aside.Step 2Heat 2 Tbsp. oil over medium in a medium pot. Add onion and ½ tsp. turmeric, season with salt, and cook, stirring often, until onion is softened and starting to brown around the edges, 5–7 minutes.Step 3Add miso to pot and finely grate in 3 garlic cloves. Cook, stirring and smashing down on miso constantly, until miso starts to darken and stick to the bottom of pot (similar to tomato paste), about 2 minutes. Add chickpeas and stir to coat. Carefully pour in golden liquid that’s floating atop the reserved soaking nutritional yeast, leaving as much of the sediment behind as you can (about ½ cup should remain but don’t stress if a little slips in); discard. Add 4 cups water. Increase heat to high and bring to a boil. Reduce heat so mixture is at a gentle simmer, cover pot, and cook soup while you make the dumpling batter.Step 4Whisk together chickpea flour, baking powder, cayenne, ½ tsp. salt, and remaining ¼ tsp. turmeric. Season generously with black pepper. Add dill, ⅓ cup yogurt, 4 Tbsp. oil, and 2 tsp. warm water, then finely grate in remaining garlic clove. Stir with a wooden spoon or rubber spatula until no dry spots remain. Your dough should be thick and sticky.Step 5Using damp hands, form dough into 10 balls (the easiest way to do this is to divide the dough in half, then divide each half into 5 pieces); place on a cutting board as you go. Gently drop dumplings into soup, cover pot, and simmer gently, until dumplings puff dramatically and float to the surface (to check for doneness, take 1 out and cut it open; it should be cooked through—the interior should look soft and not too dense), 7–9 minutes. Add celery, being careful not to smush dumplings, and simmer, uncovered, until celery is crisp-tender, about 3 minutes. Season broth with salt and black pepper.Step 6Ladle broth and dumplings into bowls and top with a dollop of yogurt. Drizzle with oil and season with more black pepper.How would you rate Chickpeas and Dumplings?Leave a ReviewTell us what you thinkReviews (40)Back to TopTriangleThe dumplings did not work out at all. The dough looked nice but didn’t cook at all in boiling water or expand a little even after 15 minutes. \nHowever the soup base was pretty good and I will make again, just with double all the seasoning including celery.Anna Foster3/25/2022I loved this recipe! It’s simple enough to make on a weeknight but still impressive. I followed the other reviewers’ advice and chilled the dumpling dough for a bit and they held together perfectly, even during reheating the leftovers. I wouldn’t skip the celery unless you really hate it.SoapnanaChicago5/5/2021Really and truly delicious. I went vegan and used the nooch sediment in the dumplings instead of yogurt and also made the dumplings earlier to chill per advice below. Rough chopped some fennel with a reduced amount of celery because one of us hates celery (me, it is me) and it's a perfectly crunchy sub.  Everything turned out perfectly. I plan to make this again and again.CMDLA CA5/1/2021Discovered I was out of white miso and subbed with ~1.5TBSP  Doenjang. Between that and the nootch this soup looked beautiful, tasted pretty good, but smelled REALLY funky on day 1. So funky I decided not to share with neighbors like I’d planned. I thought I’d made a big mistake. However, as the days passed the flavors melded together more and more and the funk dissipated. It got more and more savory and balanced with each passing day. \n\nAlso added an extra cup of water; also chilled the dumplings before dropping them in. Those are good tips. Cutting the celery on a bias is a good call too! Those big bites of celery were so good. AnonymousChicago2/5/2021I enjoyed this a lot and will make again for sure.  Like others, I used the sediment in place of the yogurt to make it vegan and that seemed to work fine. I omitted the celery and garnished with fresh cilantro and a little smoked paprika plus it needed more salt. I think I will try garnishing with some Trader Joes mango chutney tomorrow when I heat up leftovers.\nAnonymousNC1/10/2021I have made this repeatedly and it continues to be a favorite. I ran out of dill in the garden and used finely chopped green carrot tops instead which made a great twist. I thinly chopped the carrots as well and threw those in along with the celery which worked well. Additional changes which tasted lovely were a fennel and celery combo, and fennel fronds mixed in with the dill. I made it vegan on occasion and used the yeast \"sludge\" for the dumplings instead of yoghurt; it made a firmer dumpling, but still very good! I used cashew cream or a dash of almond cooking cream swirled on top for the yogurt finish. Ellen12/30/2020This turned out to be really delicious but thanks to the helpful comments I made some easy modifications.  First I reversed the order.  After reading how the dumplings couldn't maintain their shape I remembered that when making matzo balls make the dough, cover it and then refrigerate for 30 mins.  Then I began the soup following everything but for layered flavors I used stock instead of water ( I did add 1 cup of additional water per people's wise suggestions).  One tip - have the grated garlic ready for when you add the miso (btw I only had red miso and it was fine, I was going for taste more than visual) as you have to work fast in mashing it.  Once the soup was simmering I took the dough out of the fridge and made them into balls, I covered them again and set them in the freezer for 10 mins.  This really helped them to set and the I used a ladle and lay them in the soup and they did great, puffed up nicely and I let them cook for almost 9 mins on a low simmer.  I too added frozen peas as well as the celery which provided a nice crunch.  Will definitely make this again!  Good luck.JmeleemcdNYC12/18/2020This was great. I substituted seared cauliflower florets for the celery because, ugh celery. Omitted onion because we're not an onion household, what can I say. I had dried dill instead of fresh, so took down the amount to deal w stronger dried herbs flavor. I had mellow white miso paste instead of yellow - it was delicious, tbh. The savory, rich broth is SO DELISH. My partner was very animated over the broth! Craveable. The cauli and chickpeas were delightful, and I loved the flavor of the dumplings. Going forward, I might make twenty small bite-soze dumplings instead of 10 giant ones. Will definitely add this to the weekly rotation. Thanks for this recipe. Urbanite12/11/2020This recipe is so good and so fast - I can't recommend it enough. AnonymousSeattle. WA10/20/2020My attempt at making this wasn't as succesful as I hoped it would be - the dumplings kind of fell apart, although some chunks were left. I also found them to be surprisingly spicy. I don't know what went wrong, but I still liked the soup in the end. The yogurt was a really nice addition.Anonymous9/24/2020this soup is wonderful! after doubling the recipe, we didn't have enough dill so we added lemon zest (as suggested by another reviewer) and dried tarragon, which worked well. AnonymousCalifornia7/20/2020This was super easy to make and very yummy! A great vegetarian option. I added peas as one of the comments said they did and I thought it was a great addition. I also wasn't fussy about the sediment from the nutritional yeast and I really don't think it made a difference in the result, so I wouldn't worry too much about it if you're using powdered yeast as I did. Subbed white miso for yellow since that's what I had and it was totally fine. Anonymouscalifornia 7/17/2020I really enjoyed this recipe and the prep is very manageable. My main takeaway is that the recipe instructs holding back the nutritional yeast sediment to keep the broth transparent. I made the broth twice, once adding the sediment and once withholding it. The broth with the sediment was slightly more flavorful, thick and opaque/cloudy. The broth without the sediment was still very good, but did not taste quite a \"deep\" or umami as the sediment broth. Oddly enough, my least favorite part of the dish were the dumplings. I felt that the amount of turmeric in them was right at the point where the texture began to feel gritty and a bit unpleasant. Frankly, the soup sans the dumplings was my favorite part. In the future, I think I might try toasting half the chickpeas and adding them to bowls when serving, since I really enjoy the texture when they are crispy. I imagine that the dumplings could be substituted for fried tofu, a poached egg, matzo ball, or other protein...I might try a meatball or falafel. AnonymousBay Area, California6/18/2020I didn't have high hopes for this recipe, to be honest. I worried it was going to be gimmicky & weird-- but it's actually great! Very comforting and simple but not bland. My spouse isn't wild about celery so I swapped out peas, which was a hit. It also gets bonus points for using all the \"weird stuff\" that is lurking in my pantry like nutritional yeast and besan and easy enough to pull together at the last minute for a weekend lunch. Will make again & again.Seattle6/8/2020This recipe was so good, it deserved me coming back here to write a review. This really made a perfect soup, I had all of the ingredients on hand, and from start to finish, everything only took about an hour. I subbed the yogurt in the dumpling batter for the remaining nooch sediment to make it vegan. Thanks Sarah and BA, will definitely be making this again!AnonymousNew York5/26/2020Explore Bon AppétitSoupSoups and StewsNutritional YeastOther IngredientsMisoCondiments, Sauces & PastesChickpeaBeanVegetableChickpea FlourFlourWinterEasyMainVegetarianNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Sarah Jampel"]}