{"id": "941dac3e8c0bd6fa88c3e8d88253587e", "url": "https://www.bonappetit.com/story/what-is-miso", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "What Is Miso, the Secret Weapon in Every Healthyish Pantry? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Miso, the Secret Weapon in Every Healthyish Pantry?Salty, earthy, and funky, miso is the fermented, versatile ingredient that we put in everything from pasta salad to apple pie.By Sarah JampelJanuary 4, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.Sure, the concept of a \"secret ingredient\" might be kind of silly. But if we tell you there's a secret ingredient and you guess miso, you'll probably be right. We use miso to add a salty savoriness to polenta, to balance the sugariness of caramel, and to give salad dressing an anchovy-free oomph. But what is miso and where does it come from? Let's find out, shall we?Okay, what is it?At its most basic, miso is a fermented paste that’s made by inoculating a mixture of soybeans with a mold called koji (for you science folks, that’s the common name for Aspergillus oryzae) that’s been cultivated from rice, barley, or soybeans. Over weeks (or even years!), the enzymes in the koji work together with the microorganisms in the environment to break down the structure of the beans and grains into amino acids, fatty acids, and simple sugars.The use of miso goes back millennia in Japan, where a bureau to regulate its production, trade, and taxation was established by Emperor Mommu in 701 (!), and traditional miso-making is an art form.Though most of the miso sold in the US is kome-miso, made from a combination of soybeans and rice koji (cookbook author Hiroko Shimbo puts that number at 95%), you can also find mugi-miso (soybeans plus barley) and mame-miso (soybeans alone). The color, aroma, and taste varies based on where it’s made, the proportion of soybeans to koji, and the fermentation time and conditions.If you’re avoiding soy or you’re looking for something a bit quirkier and less traditional, there’s a whole gang of new wave miso-esque varietals made from farro, lima beans, adzuki beans, and chickpeas that offer a similar salty depth.What's to love?Salty, earthy, and, yes, funky, miso has the sort of deeply layered flavor that can only be the result of nature and time. It’s the key to umami-rich broth without the meat, to creamy salad dressing with the optimal balance of salt, and to glaze that leaves fish crispy and caramelized .We’re already fans of baking with salted butter, and we’ve been using miso to balance the sweetness level of doughnuts, jams, and cobbler to an even greater degree.Which should you buy and where should you start?Let the color of the miso help you predict how it will taste (and how you can use it). There are over a thousand different types, but in The Miso Book, John and Jan Belleme simplify them into two major groups. Some miso is smoother than others. If you're working with a chunky variety, you can whisk it with liquid, then press it through a fine mesh strainer.\nFirst, sweet miso: light in color, with a proportionally high amount of koji to soybeans and a relatively short fermentation time, it’s mellow and refreshing (you can sample it by the spoonful). If sweet miso is sandwich bread, dark miso (often labeled as red or brown miso) is a hearty miche. A longer fermentation time, higher salt content, and proportionally more soybeans to koji makes it saltier, earthier, and more intense, with a pungency that’ll hit you right in the sinuses.Senior food editor Chris Morocco recommends starting with sweet miso as an entrypoint. Not only does its milder flavor make it more versatile as an accessory ingredient, but it also dissolves more easily into dressings, soups, and sauces.Whichever type of miso you’re selecting, look for a minimal ingredient list: Ideally, you’ll want just soybeans, rice or barley, salt, and sometimes alcohol, which is used as a preservative. Morocco recommends the Miso Master brand, made in North Carolina. South River Miso, out of Massachusetts, is another favorite brand in the test kitchen. You’ll find much larger selections of miso at Japanese markets—just remember that darker means more powerful.The many varieties of miso\nHow should you store it?You can keep miso in an airtight container in the refrigerator indefinitely, though it may get darker or denser over time. You can also store it in the freezer, which will not change its texture or flavor.How can you use it?Well, soup, obviously: Start with the classic, then tinker it into chicken noodle miso, kimchi and egg miso, or another variation.But you probably won’t get through a whole container of miso only making soup. Morocco likes to take advantage of it as an accent note—rather than a headliner—in less traditional places: Try blitzing it with pecans and spreading it on a sandwich for a fancier PB&J. Or blend it with herbs for a pesto you can mix with ramen noodles, swirl into soup, or spread on a pizza, or with tahini for a mayo-like dressing that will be at home in chicken or egg salad.Blend miso into butter and use it to coat green beans, rub on corn, or smear into garlic bread.Or go sweet! Use miso butter as the basis for a miso blondie or snickerdoodle, or cream together miso, butter, and confectioners’ sugar for a sandwich cookie filling. You can even incorporate miso into a sweet potato pie for a version that's far from one-note.As you experiment, keep in mind that darker miso delivers big, bold flavor better suited for hearty stews and braises, whereas sweet miso is your go-to for sauces, glazes, and baking projects.Now put your jar to use:Corn & Chickpea Bowl with Miso-Jalapeño TahiniA quick sear gives corn kernels caramelized edges and concentrated flavor. Here, they're cooked with crisp chickpeas, then tossed with za'atar and dressed with a mixture of ginger, jalapeños, miso, and tahini. View RecipeRamen Noodles with Miso PestoThis cilantro-miso pesto is bright and delicious on springy ramen noodles.View RecipeRoasted Broccoli and Tofu with Creamy Miso DressingToasted sesame seeds can often be found in the Asian sections of some supermarkets, sometimes labeled Gomasio. If ever there was a time of year to keep a big jar of them on hand, pre-toasted and ready to go, this is it. They are the perfect crunchy topper for everything from salads to soups and roasted vegetables.View RecipeExplore Bon AppétitJapaneseIngredientsHealthyishFermentationRead Morecooking1 Simple Miso Soup Recipe, 5 Ways to Make ItBy Alex BeggsPhotography by Laura MurraycultureI'm Obsessed With This Very Specific Yuzu FurikakeBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-16", "author": ["Condé Nast", "Sarah Jampel"]}