{"id": "94334c5e1c20cd3b9404574b4e63c2ec", "url": "https://www.bonappetit.com/story/instant-pot-bbq-ribs", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "These Instant Pot Ribs Are Allllll About the Sticky, Spicy-Sweet Glaze | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou’d Never Know These BBQ Ribs Were Cooked in the Instant PotThey’re worth getting messy for.By Alyse WhitneyJune 20, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat Boytsova, Prop Styling by Emily EisenFacebookTwitterEmailWhen you think of weeknight dinners, you probably don’t immediately think of ribs. But that’s all about to change, thanks to food director Carla Lalli Music’s new Instant Pot ribs recipe. Not only do they come together in a flash, but they’re glazed with a sticky, spicy-sweet sauce that you’ll lick right off your fingers—because you’ll be eating with them.Any pressure cooker (stovetop, electric, Instant Pot, or other brand of multicooker) will do for this recipe. You’re just speeding up the pre-cook process before they hit the grill. Instead of going low-and-slow in the oven for hours, the ribs get tender in nine minutes under high pressure. To pack in as much flavor as possible, the ribs are dry-rubbed with Chinese hot mustard powder (or regular mustard powder, like Colman’s, which will have a little less bite), garlic powder, sugar, and salt. They can hang out for as little as an hour or up to 48 if you want to prep them the night before or in the morning before you go to work. The four pounds of ribs in this recipe will serve four people as a main dish, or more if you end up making them for a BBQ and put them out alongside other grilled meats, burgers, and hot dogsThe next layer of flavor come from using mirin at the bottom of the Instant Pot to steam the ribs. This sweet Japanese rice wine will help balance out the spicy mustard powder and the Sriracha in the glaze. After the meat is done pressure cooking, it will be tender but not quiiiiite fall-off-the-bone, meaning you can grill it without it falling apart and easily pick it up to eat.But the moment we’ve all been waiting for is the glaze. After reducing the mirin-and-pork-infused juices from the Instant Pot with ginger, Sriracha, white vinegar, fish sauce, and sugar into a syrupy glaze, slather it on the ribs, grill, and repeat. (If you don’t have a grill, you can also broil the ribs, but keep an eye on them so the sugar doesn’t scorch.) The sugars will caramelize until the ribs are dark brown, and the salty-spicy-sweet glaze will make the whole thing glisten. This sauce doesn’t skew too sweet or too spicy: it’s perfectly balanced. It’s sticky enough that you have an excuse to lick it off your fingers instead of using a stack of napkins, and you can say you’re saving the environment at the same time.This crunchy slaw will go greaaaat with ribs.\nBecause these ribs are spicy and fatty, they are best served with a crunchy slaw, a chewy grain salad, or anything bright and refreshing. Any of your standard BBQ sides will do. And if this sauce isn’t speaking to you, listen closer. Just kidding—any ribs recipe can be converted to this pressure-cooker-then-grill method (like our best-ever barbecue ribs), so feel free to change up the rub and sauce to whatever you’re in the mood for. Weeknights will never be the same again.Get the recipe:Instant Pot Glazed and Grilled RibsTender, succulent ribs that spent 9 minutes under pressure and then hit the grill. Weeknight ribs are in your future.View RecipeExplore Bon AppétitRibsGrill BarbecueInstant Potpressure cookerRead MorecookingInstant Pot Split Pea Soup with Bacony Croutons Because It’s Still Ham SeasonBy Alex Beggs and Carla Lalli MusiccookingThe Instant Pot Dal Formula That Makes Dinner In MinutesBy Priya KrishnacookingThis Is the Most Underrated Instant Pot FeatureBy Sarah JampelcookingHow to Make Coconutty Pressure-Cooker Short Ribs in 1 HourBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Alyse Whitney", "Carla Lalli Music"]}