{"id": "944457ec4d2eee2ee67085d9184a41a9", "url": "https://www.bonappetit.com/recipe/strawberry-snacking-cake", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Strawberry Snacking Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStrawberry Snacking CakeBy Sarah JampelJune 5, 20194.4(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintDon’t be surprised at how quickly this olive oil and cornmeal-enriched sheet cake will disappear. The strawberry flavor comes from a swirl of jam and a pretty layer of sliced berries on top. Because the strawberries will shrink and sink a bit during baking (how much depends on their size and sweetness), make sure they’re placed shoulder to shoulder on top of the batter.IngredientsMakes one 13x9\" cake8oz. strawberries, hulled, thinly sliced lengthwise1cup plus 3 Tbsp. sugar, divided, plus more for panKosher salt¾cup extra-virgin olive oil, plus more for pan1½cups (180 g) all-purpose flour½cup (60 g) fine-grind cornmeal½tsp. baking powder½tsp. baking soda3large eggs2large egg yolks½cup plus 2 Tbsp. sour creamFinely grated zest of 2 lemons3Tbsp. fresh lemon juice2tsp. vanilla extract½cup strawberry jam (preferably Bonne Maman)PreparationStep 1Preheat oven to 350°. Gently toss strawberries, 1 Tbsp. sugar, and a pinch of salt in a medium bowl. Let sit, stirring occasionally, until ready to use.Step 2Grease a 13x9\" pan with oil. Line with parchment paper, leaving an overhang on 2 long sides. Grease parchment with oil. Generously sprinkle pan and parchment with sugar, tilting to coat pan in an even layer; tap out excess.Step 3Whisk flour, cornmeal, baking powder, baking soda, 1 cup sugar, and 1 tsp. salt in a medium bowl. Whisk eggs, egg yolks, sour cream, lemon zest, lemon juice, and vanilla in a large bowl until well combined. Add dry ingredients to sour cream mixture and whisk gently to combine. Using a spatula, gradually fold in ¾ cup oil until batter is smooth and homogenous with all of the oil incorporated.Step 4Scrape batter into prepared pan and spread evenly. Using a small spoon, dollop jam onto surface. Using a butter knife or small offset spatula, gently swirl jam into batter. Arrange reserved strawberries on top of batter in even rows, touching at widest points. Sprinkle all over with remaining 2 Tbsp. sugar.Step 5Bake cake until risen and deeply bronzed with no damp spots in the middle and a tester inserted into the center comes out clean, 40–45 minutes.Step 6Do Ahead: Cake can be made 4 days ahead. Cover with foil and store at room temperature.How would you rate Strawberry Snacking Cake?Leave a ReviewTell us what you thinkReviews (44)Back to TopTrianglePerfect with either a cup of coffee, or glass of champagne.  Fresh whipped cream is all you need.Robin H.Atlanta, GA3/13/2022Pretty amazing. Also browned top under the broiler since it didn't get the same coloring in photo. As for the jam, Smucker's worked fine, though I did put the jam in the microwave for half a minute or so to make it a little runny. then I drizzled it all over the cake instead of dolloping (is that a verb?) and swirling it. I've also determined that \"snack size\" is about a 4\" square. Maybe 5.LaureenBPortsmouth, RI9/6/2021This is one for the rotation of light, I-can-have-one-more-piece-because-it’s-light-whoops-I-ate-half-of-it, lovely desserts! I could also see a square of this on an English tea platter, beneath a swirl of whipped cream, sandwiching a smear of lemon curd, or possibly even featuring another seasonal fruit so I don’t have to wait for summer to make it. The only instruction I failed to follow was to shoulder the strawberry pieces and it didn’t make a difference in the appearance. Please ignore any low ratings and make this cake!Rachel Los Angeles 9/4/2021I'm writing this review as I snack on a square now. ;) A low-fuss, delicious summertime treat perfect for outdoor gatherings. Now that it's strawberry season y'all have no excuse...make this!! \n\nMy only comments are that if you're bringing it to an event I would bake it the day of for the crunchy edges and top to stay in tact; I made mine the night before and let sit overnight covered and it had sogged away all the crispity crunchiness by the next day. Also, although my strawberries did not sink, my jam did -- does anyone know how to fix/prevent this from happening? I was really excited about pretty jam swirls in my cornbread-esque cake! I may add more lemon next time to make it more akin to a strawberry lemonade. As other reviewers have noted, um, it's a lot of sugar...probably could cut back and not miss it.SARosslyn, VA6/14/2021This was disappointing, it was not bad but it wasn’t amazing. I was excited by the reviews but ultimately just kinda like a weird spin on cornbread. Made it a day ahead and don’t think that really helped, I actually think it made it a whole lot uglier. I might recommend this as an interesting side for a barbecue. Definitely not Saturday night dessert.ParisSunnyvale CA6/6/2021When I added the 3/4 cup of oil it felt like way too much.  I'm wondering if anyone has tried it will less oil?\nIt is really good.Beth GLos Angeles, CA5/31/2021warning: i modified the recipe based on what i had on-hand.\nmade this yesterday, as i had fading strawberries. I didn't have cornmeal (i know, who doesn't have cornmeal in the pantry?!?) so i used 1/2c of almond flour for texture. reduced sugar to 1/2c, with preserves, final result was plenty sweet. used cherry preserves, as i already had a jar open.\nall this to say... this is a tasty, low effort, forgiving recipe. feel free to riff on it, still comes out great.Anonymousnew york5/29/2021Made this delightful cake this morning and brought it to the emergency room nurses to celebrate Nurse’s Week...everyone thought it was stupid delicious.  It’s lovely for a brunch/tea time offering.  I missed the part where it gets better overnight...will have to make another one.  Mine didn’t brown really well so I put the broiler on and got some nice carmelization on top.  This is a keeper! Kellie VaranoMaine5/9/2021I could eat this forever! Used 1/2 cup of sugar in the batter. The second time I made this, I replaced the strawberries with rhubarb. Perfect. So tart. I used the strawberry jam brand the recipe recommended and it didn't sink to the bottom.MaddieToronto, ON4/27/2021This is a straightforward, easy and fun cake to make. I subbed semolina for cornmeal and it worked fine. I took care to cut the strawberries thinly, and they didn't sink, but you're not going to get perfectly even slices like in the picture if you're working with the exact quantity of strawberries, because some slices from the edges of the fruit will be smaller. By the time it came to use them, they were breaking down and a bit mushy, so picking out the best slices was a bit tricky. It was still pretty though, just not as picture perfect. I stirred the jam to make it more workable before i dolloped it, and it sank, but it doesn't really matter. I served it with a skoosh of cream, and the lemony flavour came through wonderfully. heatpadScotland4/18/2021It looked exactly like the picture! It is so good and it is gone. I was sure I would have to share it all over the neighborhood but we just were not letting it go. \nI used a tiny bit of dark brown sugar on the bottom. Yum. My berries did not sink, nor did the jam. The jam needs to be stirred up a bit before you add it in little bits and then slowly swirl. Medium slices of berries need to be put down ever so gently. Know your oven, this is paramount. cdEast Coldenham4/15/2021I thought this cake was good for what kind of cake it is. It's a bit grittier than a normal cake due to the cornmeal and obviously doesn't have frosting which makes it drier. I did find it quite sweet, but I thought it paired nicely with black tea or coffee. I ended up substituting yogurt for the sour cream which seemed to work fine. I'd make it again if I was bored on a rainy weekend. ReneeMinnesota4/14/2021I live at 5000+ ft altitude so I adapted the recipe by using less baking powder/soda and a little less sugar and it turned out great! My strawberries were actually pretty crappy but they were great for this purpose (I imagine that the reviewers who complained it was too sweet had very ripe berries and very sweet jam) and the amount of sugar was spot on for my jam/berries. Taste yours to make sure! I like that the cornmeal gave the cake texture but my husband wasn't a fan of its crunch, it is more like a \"snack\" cake than a traditonal \"cake cake.\" It reminds me of a jello poke cake but more fancy and less sweet. Would be so good with some whipped cream. TcranebirdWyoming4/12/2021An easy, tasty, and lovely recipe. I followed it as written, and the cake came together in about 20 mins. I baked it for 35 mins and it came out perfectly. I think I’ll go heavier on the lemon zest next time.SarahLos Angeles, CA4/8/2021Somehow this defaulted to a 5 star.  I would rate a 4 on how the instructions are written. \n1- You don’t need the parchment paper.\n2- make sure in step 3 to watch for dry ingredients and don’t mix the wet stuff with the dry until blended ~ if you bake and read at the same time, it’s easy to make it all at the same time in one bowl.  It came out fine nevertheless.  \n3- definitely let it sit a night.  \n4- they refer to jam, the instructions said to just sugar the strawberries and let them sit.  Not sure if the should have been stewed.\n5- depending on how sweet your strawberries are, you may wish to add or delete sugar.\n4- serve with a scoop of vanilla ice scream.\n\nEasy to make ~ enjoyAnonymousVA4/7/2021Explore Bon AppétitCakeDessertAmericanStrawberryBerryFruitCornmealFlourSummerEasySnackNut-FreeBakingFourth Of JulyMemorial DayLabor DayBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-05", "author": ["Condé Nast", "Sarah Jampel"]}