{"id": "946c54461ffaef7d750eed2e12c0b495", "url": "https://www.bonappetit.com/story/tahini-dondurma-pasha-delights", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Pasha Delights Tahini Gelato Is What All Tahini Desserts Aspire To | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Tahini Gelato Is What All Tahini Desserts Aspire ToIt’s nutty, super creamy, and near-savory.By Alex BeggsAugust 19, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When I went to the Fancy Food Show earlier this summer, I tried a lot of new and snazzily packaged and totally forgettable snack products. Hemp-dusted chocolate almonds? Okay. Caffeinated granola bars? I’ll stick to cocaine, thanks. But Pasha Delights Tahini Dondurma (“Turkish-style gelato”), passed to me on a tiny sample spoon by a blasé employee who’d had a long day, reaaaally did it for me.It was delicious. Even in an air-conditioned convention center, eaten off wax-coated paper, after 157 other samples.The dondurma had a slightly chewy texture that’s what makes it so unique—and fun as hell to eat. Natural thickeners and a high percentage of cream give it that dense, stretchy effect. And it’s extremely creamy. The tahini flavor is prominent and nutty and near-savory. It’d be fantastic with some macerated strawberries on top.Pasha Delights is run by a husband and wife who come from food science backgrounds. They’re based in New Jersey, where they also make a lovely date-rose flavored dondurma along with pistachio, sea salt caramel, and other flavors. And since an online order requires six pints minimum to purchase, you can go wild. Right now, Pasha Delights is new on the market and only sold online, so Whole Foods, Kroger, Albertson’s—listen up!Buy it: Pasha Delights Tahini Dondurma, $10All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendIce CreamTahiniTurkishRead MorerestaurantsThe Hype Ice Cream I’m Willing to Wait in Long, Near-Rioting Lines ForBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-19", "author": ["Condé Nast", "Alex Beggs"]}