{"id": "947916da1f1d6e04770cb13d5586b32d", "url": "https://www.bonappetit.com/story/moistest-cake-vegetable-oil", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "The Secret to the Moistest Cake? Regular Ol' Vegetable Oil | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Secret to the Moistest Cake? Regular Ol' Vegetable OilButter isn't always better.By Molly BazApril 9, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Pearl JonesFacebookTwitterEmailNo shade to butter, but I think it’s high time we acknowledge the power and versatility of regular old vegetable oil in cake baking. Don’t get me wrong: Butter is bomb. It’s what makes some of our favorite baked goods the exceptional, revelatory, life-altering things that they are. Croissants! Biscuits! Cookies! OH MY! But butter is not always better, and I’d like to take a few moments to tell you why.Let’s kick things off with a discussion of moistness. (Apologies in advance if you can't stand that word, because I'm about to use it a lot.) When it comes to cakes, moistness is something to strive for—its what makes eating them so g-d pleasant! If you’ve ever had a dry cake, you understand the difference. Vegetable oil contributes moistness far more reliably, a result of the fact that oil remains liquid at room temperature while butter solidifies. Liquid contributes to the sensation of moistness, and therefore cakes made with oil often present as moister than their butter-based counterparts. (And will stay moist on the counter longer, too.)Now let's talk about tenderness. Most of the time, you want to take a bite of cake and feel it almost fall apart in your mouth—that's tenderness. Again, a great way to understand tenderness is to consider its opposite: toughness. A cake becomes tough when too much gluten has been formed while mixing the batter. Gluten is formed when water interacts with flour during the mixing process. Because butter is actually comprised of around 80 percent fat and 20 percent liquid, that 20 percent of liquid will interact with the flour, form gluten, and contribute to the toughness of a cake. Vegetable oil, on the other hand, is pure fat. Fat inhibits gluten formation, and since there’s no water present in vegetable oil, there's less of a chance that you'll accidentally end up with a tough-crumbed cake. That said, every oil-based cake will still have a liquid component—the flour still needs to hydrate—so it is still possible to over-work this kind of batter and form an unappealing amount of gluten, and it's still important to be mindful of stirring too vigorously once your wet ingredients meet the dry.Have I convinced you yet? Without any intervention on the part of the baker (a.k.a. YOU), your oil based cakes are already bound for supreme moistness and tenderness. (It's worth noting that olive oil performs in the same way, but definitely contributes a more pronounced—and sometimes awesome!—flavor.) Need more convincing? Give this ridiculously delish carrot loaf cake recipe a shot, and I think you’ll agree that vegetable oil deserves as much love as your beloved butter.The ultra-moist carrot cake in question:Basically Carrot Loaf CakeThe most casual-cool carrot cake of all time.View RecipeExplore Bon AppétitBasicallyCakeBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-09", "author": ["Condé Nast", "Molly Baz"]}