{"id": "94849f8cba0148068533dd3d71ebd957", "url": "https://www.bonappetit.com/story/trader-joes-reviews-january-2022", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "New Year, New Trader Joe's Snack Reviews | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNew Year, New Trader Joe’s Snack ReviewsWelcome to another weird year of reviewing as many new Trader Joe’s foods as I can get my hands on—to let you know that you can skip the Cacio e Pepe puffs.By Alex BeggsJanuary 28, 2022FacebookTwitterEmailFacebookTwitterEmailI just had HOT COCOA OATMEAL for breakfast and my fingers are twitching as I type. I’m so hyped on sugar and the anticipation of sharing this month’s best and beastly Trader Joe’s snacks with you. For new readers (not you, Bobbi), this is my fifth year of persistently, honestly reviewing as many new foods as I can find in the aisles of America’s kookiest grocery store. (And, bonus! We recorded a Trader Joe’s–obsessed episode of BA’s Food People podcast.) My sworn oath: never, ever lie to you. So yeah, I was just kidding about the beastly thing, nothing this month is that bad. Except for the agave-sweetened Vegan Caramelized Onion Dip, a solid puck of sweet coconut oil unworthy of your chips or your dollars.ContentThis content can also be viewed on the site it originates from.Now, to the newbies!Gluten-Free’s the Way to BeGluten Free Organic Rolled Oats with Ancient Grains & SeedsOatmeal that’s souped-up with quinoa and other fibrous whole grains that help you poop. You need to add your own maple syrup and brown butter and eye of newt—whatever the hell makes oatmeal not taste like chalky, industrial mush. This one is not going down in history for me.Gluten Free Cinnamon Coffee Cake MuffinsBut these muffins are! When the first two ingredients listed are sugar and canola oil, you know you’re in for a good time. These sour cream coffee cake muffins were as moist as a recently used dish sponge, even three days after I bought them. I love that in a baked good: indestructibility. Immortality! They have cinnamon crunchies on top that make the experience texturally dynamic. They’re bound with gluten-free rice flour, but are they, really? I think they’re bound by the magical thinking that makes people associate “gluten-free” with “healthy.” These muffins have no business being this good.Cocoa & Sea Salt Instant OatmealAnd here we have the hot cocoa oatmeal, as I call it, because that’s what it is. The sea salt angle is great marketing and appeals to an audience who says they don’t want chocolate for breakfast but OH, they DO. The cocoa flavor is a little dull, a little muted, like the month of January here in Michigan. Scoop in some peanut butter and you have REESE’S OATMEAL.Things in PouchesMini Chocolate Chip Pancake & Waffle MixJust add water and you got yourself a floppy little chocolate chip pancake. Though I suspect buttermilk would be even better. A great option to take camping. Or to keep in your van, for all you van-lifers. Still out there, huh?Hemp HeartsWake up at 6:10 a.m., wash your face at 6:12, meditate at 6:16, make your smoothie with crunchy little hemp hearts at 6:47. These are the regimented steps I’ve seen on TikTok of beautiful attempts to control one’s own mortality. Not mine. My heart is hemp-less.SnacksyOrganic Cacio e Pepe PuffsPass on these puffs. They have that not-processed-enough stale quality, which is the trade-off that comes with buying organic puffs. I found the cacio e pepe flavor overplayed and yet, not played enough. The cheese powder barely tastes of anything other than your satisfaction from saying “cacio e pepe” into the empty, cold room.SeasoningsGreen & Red Hatch Chile FlakesI’m riding the hatch chile hype train until my tongue goes numb. Spicy flakes! No complaints.BBQ 101 Seasoning BlendHeavy on the brown sugar. On popcorn, it reminded me of Lay’s barbecue chips and the time I slapped sunscreen on my back but didn’t rub it in well, resulting in two white handprints on my shoulder blades all summer. And it was a long summer. If you prefer seasoning with some heat, make this one.CheesyItalian Lagorai Semi-Soft CheeseThis is like farmer’s cheese. It’s creamy and so mild I won’t even pretend I tasted anything. Use it to fill pierogies or make scrambled eggs luscious. Or better yet, blend it with some white wine and butter (oh, helllll yeah) and have yourself fromage fort, a French cheese spread that Jacques Pépin makes with nubbins of gourmet cheese and a single slice of American because he knows something the rest of us have yet to uncover. The secret to a long and happy life.Vegan Feta Cheese AlternativeA smooooth, smooth square of feta-flavored potato starch and coconut milk. It’ll taste like the first time you tried cheap Brie in high school—sour and farm-y and lactic and confusing, forcing you to question whether you know what’s truly good in this world (and decide what you’re going to have to pretend is). I don’t need this kind of provocation from cheese. No thanks!Vegan Caramelized Onion DipEhhhhhhh. I thought Trader Joe’s Vegan Cream Cheese Alternative was pretty decent, and I believe that’s the base here, though it’s a little too solid (from the cold coconut oil) and in need of a stirring and warming up to be dippable. Don’t we all! But then they went and added agave syrup and gave it a funky sweetness that I didn’t want to waste my precious Cape Cod chips on. They deserve better.Pizza Bread CheeseI’ve encountered Scandinavian bread cheese at various Midwest farmers markets where sellers will give you oozy, grilled cheese samples on toothpicks cooked right there on a George Foreman. Irresistible! It’s slightly squeaky, like Halloumi, with a spotty brown, bread-like crust, hence the name. Trader Joe was like, let’s make it PIZZA-FLAVORED, because he knows his audience. Slice it, put it on bread, and slam it into the toaster oven. Six minutes later it’s melted, bubbly, browned, and satisfying that after-school-pizza-bagel craving.FrozenKalua Pork Spring RollsThese pork spring rolls have so much fake smoke flavoring that I googled “liquid smoke cancer?” and found out that it’s less carcinogenic to eat smoke-flavored foods than to eat smoked foods. How about that!Taiwanese Green Onion PancakesThese are golden and puffy in three minutes flat and I loooooove them.Chicken and Chimichurri EmpanadasMushy inside, but that’s no crime. A thousand times better than the terrible Southwest Chicken Quesadillas.Impossible Chicken NuggetsCoulda fooled me!Okie Dokie Oat Non-Dairy Frozen DessertThe name is a clever play on “hokey pokey,” a New Zealand honeycomb sponge candy. The bits of honeycomb in the ice cream add a fun, sticky crunch, but they have a butterscotch-y quality that reminds me too much of the awful sugar-free butterscotch candies we used to mail to my grandma’s nursing home along with a nip of scotch-scotch hidden in some slippers (true story). I prefer the strawberry oat ice cream at TJ’s.SaucyVegan Creamy Dill DressingMy new favorite salad dressing at Trader Joe’s. Trust me, I was surprised too. The creamy cauliflower base has undergone some kind of treatment to not taste like cauliflower and the overall effect is downright ranch-y. Would buy again.Organic Chunky Homestyle GuacamoleFinally, a good guacamole at Trader Joe’s. In college, I used to live on the square two-packs of guacamole, which have an unnaturally smooth texture that defies the will of the guacamole gods and offends most mortals from the kingdom of Texas. (I just read Circe—loved it!) This stuff is chunky, as promised, not too watery, and seasoned with a few specks of jalapeño. Almost, almost as good as homemade.Explore Bon AppétitCultureTrader Joe'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-28", "author": ["Condé Nast", "Alex Beggs"]}