{"id": "9494caebe4bf64c237d3714d9e443bfe", "url": "https://www.bonappetit.com/recipe/rice-pilaf-with-lemony-brown-butter-mushrooms", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "Rice Pilaf With Lemony Brown-Butter Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRice Pilaf With Lemony Brown-Butter MushroomsBy Asha LoupyNovember 1, 20214.6(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThis noodle-heavy rice pilaf is delicious on its own, but what makes it swoonworthy is the topping: caramelized mushrooms. Cooked in a generous amount of butter, the mushrooms are finished with lemon zest, lemon juice, and tender herbs, bringing a bright, zippy freshness to these roasty-toasty, earthy funghi.The dish plays incredibly well with others—serve alongside slow-roast salmon fillets, crispy chicken thighs, pan-seared pork chops, and even your Thanksgiving turkey. If you want to bulk it up and keep the pilaf vegetarian, nestling planks of feta and tossing some extra parsley and dill on top is equally dreamy.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonIngredients4–6 servings1½lb. mixed mushrooms (such as oyster, maitake, crimini, and/or trumpet)5Tbsp. extra-virgin olive oil, divided4oz. angel hair pasta, broken into ½\" pieces (about 1 cup)8Tbsp. unsalted butter, divided2large shallots, thinly sliced2garlic cloves, finely chopped1½cups basmati or long grain rice2sprigs thyme2dried bay leaves4cups low-sodium vegetable or chicken broth2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more½tsp. freshly ground black pepper, plus moreZest and juice of 1 lemon½cup chopped mixed tender herbs (such as parsley, dill, and/or tarragon)PreparationStep 1Cut or tear mushrooms into large bite-size pieces (if using, crimini, slice ¼\" thick or, for more delicate varieties like oyster and maitake, tear into large pieces). Place in a large bowl and set aside.Step 2Heat 1 Tbsp. oil in a large skillet over medium. Toast pasta, stirring constantly, until deep golden brown, about 2 minutes. Transfer to a small bowl. Reserve skillet.Step 3Heat 2 Tbsp. butter in a medium Dutch oven or other heavy pot over medium-high. Cook shallots, stirring occasionally, until browned and crisp, 8–10 minutes. Add garlic and cook, stirring, until just starting to turn golden, about 1 minute. Add rice, stir to coat in shallot mixture, and cook until edges of grains turn translucent but centers are still opaque, 2–3 minutes (cooking off some of the starches and coating the rice in fat will help the grains stay separate when they cook in the broth).Step 4Add pasta, thyme, bay leaves, broth, 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and ½ tsp. pepper and stir to combine. Bring to a boil. Cover pot and reduce heat to low. Cook until rice is cooked through and liquid is absorbed, 20–25 minutes. Remove from heat and let sit (still covered) 20 minutes. (Do not uncover the rice before resting—you want to keep all the steam in there.)Step 5Meanwhile, heat 2 Tbsp. oil in reserved skillet over medium-high until just beginning to smoke. Arrange half of reserved mushrooms in a single layer in pan and cook, undisturbed, until golden brown underneath, about 5 minutes. Season with salt and pepper, toss, and continue to cook, tossing often and reducing heat as needed to prevent scorching, until golden brown all over, about 5 minutes longer. Transfer to a plate. Repeat with remaining mushrooms and 2 Tbsp. oil and more salt and pepper.Step 6Cook remaining 6 Tbsp. butter in same skillet over medium-high heat, stirring often, until it foams, then just starts to brown, about 4 minutes. Add mushrooms and cook, tossing often and spooning butter over, until butter smells nutty (it should have deepened in color even more), about 5 minutes. Remove from heat and stir in lemon zest, lemon juice, and half of the herbs. Taste and season with more salt and pepper if needed.Step 7To serve, uncover rice pilaf and fluff with a fork. Transfer to a platter or large shallow bowl. Spoon mushrooms over and drizzle with any sauce remaining in skillet. Top with remaining herbs and season with more pepper.How would you rate Rice Pilaf With Lemony Brown-Butter Mushrooms?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleAbsolutely delicious!!! Was a big hit at the Friendsgiving dinner I took it to. It has become one of my go-to recipes now.\nkitkatAnn Arbor12/30/2021This was really tasteful! I made it for christmas eve dinner and everyone loved it! AnaSanto Domingo, DR12/25/2021Can this be made a head of time and heated up? Anonymous12/14/2021This recipe is a keeper for sure!  Made a double-batch in my dutch oven for Friendsgiving and the rice & pasta turned out super fluffy and flavorful with a nice texture.  The tip to not open the lid is a good one- of course, I opened the lid to check for doneness, but once I felt good about pulling it off the heat, I just replaced the lid and let it heat up for a little longer to re-establish that valuable carryover steam with the lid tightly on until it was time to eat.  I will say that 1 whole lemon (juice & zest) per batch seems like an awful lot.  I cut back to a 1/2 lemon for my double-batch recipe and it seemed to almost border on too acidic.  I think a lot of it has to do with the lemon you are using as some are more acidic, juicy, bigger, etc.  I'd recommend easing into the lemon, taste as you go, so it doesn't overpower the balance with the nuttiness and earthy flavors you worked so hard to establish. Overall fantastic recipe and I will definitely be making again.Melissa EmbreeLong Beach, CA11/30/2021I’ve already made this 3 times.  The texture of the shallots, the mushrooms and the rice is perfect.  I didn’t add the lemon last time — i added extra mushrooms and it was delicious.Cookingthedinner 11/29/2021Made this for Friendsgiving and it was a huge hit. Many steps but worth it. RobinHartford CT11/26/2021Delicious separate, divine together. \nRan out of real butter for one of my batches of mushrooms, but even though I couldn't sizzle those ones in browned butter, the end result still tasted scrumptious. The burst of lemon came through beautifully against the richness of the rice pilaf. mwahTaylaAlexandria, VA11/23/2021I made this exactly as written and while it had a few more steps than I'd usually do it was more than worth it. The toasted pasta (I used fideos) and lemon juice and zest really made it perfect.  This will be on repeat in my house.Moira11/14/2021Would this work at all with vegan butter?\nAlyGA11/13/2021Sounds fab - I've bookmarked the page. Do you suppose the pasta could be subbed for rice noodles to make it gluten-free??JanToronto11/12/2021insanely goodAnonymous11/12/2021We made this with farro instead of rice (because we didn't have rice) and replaced the broth with equal parts white wine and water (because we didn't have broth) and we couldn't be happier with the result!! So delicious. We will be making this all the time for guests so they think that we are fancy without actually having to be fancy :) Thank you for this recipe!!RyanPhiladelphia11/4/2021@anonymous The pasta gets toasted uncooked while it is still dry and then cooks with the rice in the dutch over in step 4. Happy cooking this roasty toasty rice pilaf! JuliaMissouri11/2/2021In step 2, is the pasta supposed to be cooked or uncooked at this step? Anonymous11/1/2021Explore Bon AppétitRice PilafMushroomVegetableLemonCitrusFruitBrown ButterDinnerSideVegetarianEntertainingRiceRice & GrainsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-01", "author": ["Condé Nast", "Asha Loupy"]}