{"id": "949858fd55d87a1ca5f481225cd97214", "url": "https://www.bonappetit.com/recipe/cheesy-winter-squash-gratin", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Cheesy Winter Squash Gratin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueCheesy Winter Squash GratinBy Molly BazJanuary 12, 20214.4(60)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma FishmanEmailPinterestPrintEmailPinterestPrintYou can make this cheesy squash gratin with virtually any winter squash, but choosing types you don’t need to peel, such as colorful delicata or sturdy acorn, keeps prep to a minimum. Mix and match a few different varieties to make the finished dish pop. Whether you use a mix of squash or just one kind, slice the pieces all the same size so they cook evenly.Ingredients4 - 6 Servings5Tbsp. unsalted butter, divided, plus more for pan3½lb. delicata and/or acorn squash, halved, seeds removed, cut crosswise ¼\" thick1large white onion, thinly sliced10garlic cloves, thinly sliced2¼tsp. kosher salt, divided6oz. frozen kale, spinach or blanched greens, thawed, squeezed well½tsp. crushed red pepper flakes1Tbsp. thyme leaves, plus sprigs2cups heavy cream4oz. Parmesan, finely grated, divided6oz. sliced rye or country-style bread, torn into ½\" pieces (about 3 cups)PreparationStep 1Place racks in upper and lower thirds of oven; preheat to 400°. Butter a 13x9\" baking dish and arrange squash in dish. Heat 2 Tbsp. butter in a large high-sided skillet over medium. Add onion, garlic, and ½ tsp. salt and cook, stirring often, until onion is softened and starting to turn golden brown, 8–10 minutes. Stir in kale, red pepper flakes, and 1 Tbsp. thyme and cook, stirring, 1 minute. Using tongs, scatter onion mixture over squash, making sure to get it into all the crevices.Step 2Combine cream, three quarters of Parmesan, and 1½ tsp. kosher salt in skillet (no need to wipe out) and cook, stirring, until hot but not simmering, about 3 minutes. Carefully pour over squash, using tongs to turn squash to coat evenly. Cover tightly with foil, transfer to lower rack of oven, and bake until squash is just shy of tender, 25–30 minutes. Remove foil and continue to cook until cream is thickened and no longer liquid-y and squash is very tender, 18–22 minutes.Step 3Meanwhile, wipe out skillet and melt remaining 3 Tbsp. butter in skillet over medium heat. Add bread and remaining ¼ tsp. salt; toss to coat. Transfer to top rack in oven and bake, stirring once or twice, until golden brown and crisp, 14–16 minutes. Let cool.Step 4Heat broiler. Scatter breadcrumbs over gratin, crushing into smaller pieces as you go, then top with remaining Parmesan. Transfer gratin to top rack and broil until bubbling and browned at the edges, about 3 minutes. Top with a few thyme sprigs to serve.How would you rate Cheesy Winter Squash Gratin?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI used a delicata (unpeeled) and a butternut (peeled). Subbed fresh blanched collards for the kale and subbed pecorino/romano for the parmesan and only used 4 cloves of garlic (not 10!). Takeaway: This was insanely good. As another reviewer suggested I just mixed the whole thing together in the baking dish and poured the cream and cheese over it. At first, it doesn't seem like there is enough of a creamy topping but it steam cooks and you're left with a perfect amount of cheesy-ness. Portia H. Santa Cruz1/12/2022I love this recipe and have made it many times. I’ve used both acorn and butternut squash - both great and you don’t have to peel them! I really love the taste of this recipe (and I put as many green things in a I can, this last time was blanches broccolini and spinach) and will try a version next time with a non-dairy milk instead of cream to see if I can cut down on the dairy. FrannyBrooklyn, NY12/6/2021Used unflavored/unsweetened soy milk in place of heavy cream, and all acorn squash. I did stir it up a few times while cooking per other review suggestions, and everything came out tender and creamy and delicious! The rye crisps are an excellent texture contrast. FaithNashua NH9/29/2021This was a very good dish and the recipe was pretty easy to follow. I followed almost exactly. I just would like something to cut the sweetness and richness a little more. Because of that I think it should only be a side. I tried adding lemon juice to but it wasn't enough. Overall a great dish AnonymousBeckley, WV2/11/2021Made this with acorn squash (from the store instead of the farmer's market), it was very beige.  I also used fresh kale instead of frozen and could have used much more.  The squash didn't seem to cook very evenly (despite having cut it fairly uniformly)--if I had to do it over, I may have stirred it half way thru before topping it.  But, I probably won't have to do it over.  Bone Apple TeethMemphis, TN2/4/2021Tasted fine but the directions seemed really silly. Why “arrange” the squash in the pan and “scatter” the onion-kale mixture (but make sure it gets into the crevices), when you’re supposed to then pour the cream-Parmesan sauce over it all and then use tongs to distribute it evenly?  It would make so much more sense to put all those components in a big old mixing bowl, toss them together and the pour into the baking dish.\n\nAlso what does “just shy of tender” mean?  Jane CMosier, OR1/27/2021so delish!!! I made a non-dairy version with a mix of coconut cream, oat milk, and a little bit of cornstarch (vegan cheese too). Definitely great as a standalone dish or as a side. Bottom line: you gotta try thisJillchicago, il1/27/2021This recipe was outstanding and a real crowd pleaser!  I used ambercup squash and blanched fresh kale instead of frozen, but it was still great.  The only hiccup was during the broiling step; the dish wasn't under the broiler for even a minute when the bread crumbs caught fire!  However, everybody thought it was still delicious after I extinguished it and turned off the smoke alarm.  I'm definitely going to make this again only, next time, I won't be making it flambé style!Steve from BuffaloBuffalo, NY1/26/2021I absolutely loved the Cheesy Winter Squash Gratin! I used half Delicata and half Acorn Squash. It made so much that we have leftovers! Yay! It would be great for company...when it's safe to have company again in the future... Wouldn't change a thing. Erin RiesTelluride, CO1/23/2021All I had in the pantry was a big butternut squash which added some a great savory sweetness to the dish! I didn’t have enough parm so I added some grana padana and a bit of Gouda and it turned out great! I used half ciabatta and half multigrain loaf on top and I used so much , it was the best part! I loooove the crunchy top it the most exciting part, glad I have this recipe in my back pocket but im wondering if our beloved Molly Baz gave them this recipe before or after leaving Sarah  HopeKansas City 1/23/2021On a whim, topped with Romesco sauce.  Delicious!  Added even more to an already spectacular dish.AnonymousHouston, TX1/22/2021Absolutely delicious! I used cranberry walnut bread on top. So yummy. Could’ve added more kale. OliviaCT1/21/2021Really good! I subbed in butternut, mozzarella, fresh kale, and used both whole wheat and country bread. It turned out great.MiaAustin1/20/2021The grocery store had no dried or fresh thyme so.... I browned some sausage to throw in. What can I say? It was delicious. I also cut back a bit on the cream and peeled my acorn squash. KateMinneapolis1/19/2021This recipe was delicious! Definitely not dry for me, however I don't have a broiler so I skipped that step. Regardless, it was perfect. I will give 2 tips: 1) do NOT put any more salt that what is listed in the recipe. I won't say that it's salty as is, but even a tad bit more and it would be too much; 2) whatever cheese you use (the recipe calls for parmesan) will dominate the flavors of the dish. I used Asiago cheese and it was delicious but definitely one of the more intense flavors behind the garlic. OliviaBrooklyn, NY1/17/2021Explore Bon AppétitGratinKaleLeafy GreensVegetableAcorn SquashSquashDelicata SquashWinterEasySideNut-FreeVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Molly Baz"]}