{"id": "949c64df5d89ca201647d576883677e0", "url": "https://www.bonappetit.com/story/lazy-way-to-dice-an-onion", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "How to Dice an Onion With a Box Grater | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Laziest Way to \"Dice\" an OnionNow that I know this trick, I'll never go back.By Sarah JampelNovember 20, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailMy confession of the hour is that I almost never dice onions. I know how to dice an onion, and I have a sharp knife that’ll get the job done, but I find it...pretty tedious? Mind-numbingly boring? A hard-to-justify time suck? Oh, I’m being dramatic? Maybe so, but the closest I get to \"dicing\" is roughly chopping.But as much as it pains me to admit it, there are times when roughly chopping just won’t do. If you’re looking for super-tender bits that melt away into the sauce for shrimp scampi pasta or disintegrate into soffritto for minestrone—it is important that the onion be in tiny pieces that will cook quickly, evenly, and all the way through.So I was thrilled to see that Sohla El-Waylly understood—and accommodated—my laziness. In her new recipe for Fideos With Chicken Thighs and Kale, she doesn’t ask you to dice an onion (hoorah!): Instead, she has you shred it to bits on a box grater. In a mere matter of seconds, the large holes of the grater turn an intact onion half into a pile of scraps. The pieces are a little uneven, sure, but it’s nothing a quick run-through with your knife won’t fix. The box grater strikes again, as if we didn’t already know that the trusty old tool isn’t a one-trick pony.This technique (permission to call it a \"hack\" please???) is game-changing. Not only is it much faster than dicing, but it also goes one step further in breaking down the onion and exposing its watery insides, meaning that it will get even jammier and softer as it cooks.So the next time a recipe calls for dicing an onion (or even a shallot!), put down your knife and try your box grater instead. Your stuffing, collard greens (can you tell I’m in the Thanksgiving mindset?), and dal will not suffer—and you will surely benefit.Okay, this is the part of the story where I say something about how great graters are, I think. But instead, I’m just going to leave you with this recipe:Fideos With Chicken Thighs and KaleWith a crispy, toasted top hiding saucy, tomato-y noodles, this one-skillet broken spaghetti dish is anything but one-note.View RecipeBuy it: Norpro Stainless Steel Grater, $7 on AmazonAll products featured on Basically are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-20", "author": ["Condé Nast", "Sarah Jampel"]}