{"id": "94a8aa073192c1df57b00028e779f144", "url": "https://www.bonappetit.com/recipe/scallion-pancakes-2", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Scallion Pancakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesScallion PancakesBy Sue LiPhotography by Alex LauSeptember 15, 20214.4(41)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThe secret to layered, flaky, chewy-crunchy Chinese scallion pancakes? It’s all in the roll (and the spin, and the re-roll). Thankfully, the boiling water in this recipe helps keep the dough pliable and easy to work with. Before the first round of rolling, the dough is brushed with chicken fat or vegetable oil, which not only helps with texture but adds a richness to the dough.If you’re tight on time, consider saving this recipe for another day and trying Millet Scallion Pancakes or these ones inspired by Korean pajeon, both of which don’t require rolling and come together fairly quickly.Editor’s note: This recipe was originally published on August 30, 2016..All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCloth Bowl Covers$18 At AmazonSmall Wooden Rolling Pin$11 At AmazonPastry Brush$9 At AmazonWire Rack$23 At BA MarketIngredientsMakes 8  ServingsPancakes2½cups all-purpose flour, plus more for surfaceKosher salt1tablespoon toasted sesame oil⅓cup chicken fat, warmed, or vegetable oil2bunches scallions, thinly sliced (about 2 cups)8tablespoons vegetable oil, divided, plus more for brushingSauce3tablespoons unseasoned rice vinegar2tablespoons soy sauce1teaspoon chili oil½teaspoon sugar¼teaspoon crushed red pepper flakesPreparationPancakesStep 1Whisk 2½ cups flour and 1 tsp. salt in a large bowl. Mix in sesame oil and 1 cup boiling water with a wooden spoon until a shaggy dough forms.Step 2Turn out dough onto a lightly floured surface and knead, adding flour as needed to prevent sticking, until dough is smooth, about 5 minutes. Cover; let rest at room temperature 1 hour.Step 3Divide dough into 8 pieces. Working with one at a time, roll out on a lightly floured work surface as thin as possible (each should be approximately 10\" in diameter). Brush about 2 tsp. chicken fat on dough and top with about ¼ cup scallions; season with salt. Roll dough away from you (like a jelly roll) into a thin cylinder, then, starting at 1 end, wind roll onto itself to create a coil (like a cinnamon roll). Cover and repeat with remaining dough. Let rest at room temperature 15 minutes.Step 4Working with 1 coil at a time, roll out on a lightly floured surface to a 5\" round (keep other coils covered). Repeat with remaining dough and stack as you go, separating with parchment or lightly greased foil brushed with vegetable oil.Step 5Heat 1 Tbsp. vegetable oil in a medium skillet over medium-low. Working with one at a time, cook pancake, turning frequently to prevent scallions from burning, until golden brown and crisp on both sides and cooked through, 8–10 minutes. Transfer pancakes to a wire rack and let rest about 5 minutes before cutting into wedges.SauceStep 6Whisk vinegar, soy sauce, chili oil, sugar, and red pepper flakes in a small bowl until sugar is dissolved. Serve alongside pancakes for dipping.How would you rate Scallion Pancakes?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleI have been making them for years with this recipe. They are perfect fresh or frozen. My family always asks for them and I never say no.Ken BerkSarasota 1/11/2022This is a great recipe! Cooking the pancakes is time intensive so I recommend starting two skillets so it will go faster. I also did not do chicken fat, I used vegetable crisco instead and the result was great! I also left out the second salt step, the step when you roll out the dough and add the scallions and a little bit of extra salt. I figured between the soy sauce dipping sauce and the disco, it would be salty enough and I was right.AnonymousWashington DC10/28/2021This is horrible!! Flour and water for the dough? That’s the recipe for glue. And that’s exactly what it came out as. So elastic, it’s hard to roll and def can’t roll it thin. The worst recipe I’ve made in a long time. AnonymousDenver10/26/2021I made it as described but did not need to make them all right away, so I covered 6 in the fridge, separated by parchment.  The fresh ones were great, but the ready-to-fry discs were just as good the next day or two.  Then, I tested how it would be to pre-cook a couple and freeze them after cooling and another couple in the refrigerator to reheat the next day in a 400 degree oven for 5 minutes on each side.  The reheat ones from the fridge were crispy and a bit tougher than they should've been.  I will try he frozen reheats, but suspect they are best eaten immediately after frying.Tulsa JugglerOrmond Beach, FL10/13/2021First, these are delicious and taste exactly like what you would expect at a Chinese takeout.  This was a date night activity, so we didn’t mind how long they took to make. However, I am glad we ordered takeout for the rest of the menu because it would have been an exhausting evening otherwise. \n\nWe followed the recipe exactly and from start to finish it took us about 3.5 hours, including about 1.5 hours of down time which we used for clean up, wine, and water coloring. \n\nWill I make these again soon?  Unlikely, but I’m glad to know I can. Karla JamaicaLong Beach, CA11/7/2020These were so good; I’d venture to say restaurant quality/flavor. I followed the recipe exactly using vegetable oil. I cooked one at a time and wish I had used a larger pan and cooked more at a time to speed up the process. My picky kids at them all up.AnonymousBerkeley10/9/2020These are fantastic, fun to make but do take a long time.  This is my second batch.  I’ll cook 2 to go with dinner and freeze the rest in packs of 2.  They thaw out fast and cook up great.  I cook quick on med-high heat for color on both sides then turn it down and continue on low til they cook through.AnonymousCambridge 8/22/2020one of my favourite BA recipes. very time consuming but worth it for such a moreish delight. haven't been able to find chicken fat though, I just use duck fat. Anonymousaustralia 5/14/2020RAMPed up this recipe - used ramps in place of scallions - and used probably an extra 1/4 cup of water to get the dough together, but this was a great base recipe to play with, and turned out seriously delicious.  It's definitely a project, but is something different and fun to try when we've got the time.  Ate alongside Chinese sausage for a great meal!  AnonymousChicago5/3/2020I followed this to a T! And they turned out beautifully.. me and my boyfriend accidentally finished the whole plate.. thank you! AnonymousPennsylvania5/1/2020The technique for making these is solid but the cooking times are a lie. 8 to 10 minutes over a low heat will get you raw pancakes with no colour to them (nothing like the illustrative photo). Why not just be honest in the recipe that they take significantly longer than that? F C-SSomerset5/1/2020These were so successful and actually much simpler than they appeared. The cook time was pretty long, but if I had done more than one pancake at once I could've improved thatAnonymous4/27/2020So good! I was sorta shocked by the ratio of scallion to flour, but the end result is fairly perfect. This was also denser and thicker than those that I had when I lived in china, but I also only had self rising flour on hand, so that may have had something to do with it? AnonymousWashington DC4/26/2020Harder to make than I was expecting, especially since the scallions have a tendency to break through the dough when rolling. But that's my inexperience, not the recipe's fault. As other reviews note, this recipe is much more time-consuming than you might think. But wonderfully crispy and flaky!AnonymousNew York4/24/2020Delicious and addictive-- though not better than those I get from the local takeout place. It was a fun project for a Saturday afternoon. I subtracted one star only because this recipe is very time-intensive. I can't see myself making it more than once a year.always_more_garlic4/18/2020Explore Bon AppétitPancakeChineseEast AsianAsianScallionOnionVegetableSnackStarterSideDairy-FreeVegetarianVeganFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-08-30", "author": ["Condé Nast", "Sue Li", "Alex Lau"]}