{"id": "94c629f1d83c8359b7c40b19e66566b2", "url": "https://www.bonappetit.com/recipe/day-old-doughnut-bread-pudding", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Doughnut Bread Pudding Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDay-Old-Doughnut Bread PuddingBy Amiel StanekOctober 16, 20195.0(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis recipe is a great way to use up stale doughnuts, but if you’ve got freshly made ones, that works too. Start with classic glazed or sugar-coated yeasted doughnuts, which have a light and airy texture, rather than cake doughnuts, which are dense and will turn to mush when combined with the custard. The bread pudding will puff heroically near the end of its baking time, like a soufflé, but fall shortly after it comes out of the oven; don’t worry, it’s supposed to do that! The final texture is somewhere between an eggy bread pudding and a clafoutis, and it’s pretty hard to stop eating.Ingredients6–8 servingsUnsalted butter (for pan)12stale or fresh glazed or sugared doughnuts (about 1 lb. 6 oz. total)4large eggs4large egg yolks4cups half-and-half2Tbsp. sugar1Tbsp. vanilla extract½tsp. kosher saltFinely grated zest of 1 lemon¼cup raspberry preservesPowdered sugar (for dusting)Cold heavy cream (for serving; optional)PreparationStep 1Place a rack in center of oven; preheat to 325°. Butter a 2-qt. baking dish. Cut each doughnut into eighths and arrange on a parchment-lined rimmed baking sheet. Bake until dry and crisp, like little sugary croutons, about 15 minutes. Let sit until cool enough to handle. (Drying out the doughnut pieces will help them absorb the custard.)Step 2Vigorously whisk eggs, egg yolks, half-and-half, sugar, vanilla, salt, and lemon zest in a large bowl until light, uniform, and foamy. (You can also process in a blender until combined if you want.) Add doughnuts to bowl with custard. Gently toss and push down on them so that they absorb maximum liquid without falling apart. Let sit 5 minutes, then toss and press gently again. Repeat tossing and soaking twice more for a total soak time of 15 minutes, allowing the doughnuts to fully drink up the custard.Step 3Transfer doughnuts and any remaining custard to prepared baking dish. Dollop preserves over, avoiding edges of pan where it can burn during baking. Bake bread pudding, rotating pan halfway through, until puffed, golden brown, and bubbling along the edges, 50–60 minutes.Step 4Let bread pudding cool 20 minutes. Dust with powdered sugar. Serve with cream alongside for pouring over.Step 5Do Ahead: Doughnuts can be baked 1 day ahead. Store in an airtight container at room temperature.Photo by Alex Lau, food styling by Pearl JonesHow would you rate Day-Old-Doughnut Bread Pudding?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI only had 6 donuts, so I made a half batch, but WOW! Perfectly sweet and creamy. Even my housemate who doesn't like custard liked it.MeganMichigan12/16/2020So easy, so so good!AnonymousOakland6/8/2020I scaled this recipe down to use 3 (yeasted/glazed) doughnuts and split the custard between 2 buttered ramekins. It was rich without being overly sweet and (seed in) raspberry jam was a nice compliment for a bite of acidity and texture.smellyhipsterAstoria, Oregon6/5/2020Holy Smokes, this was amazing! Thanks for the recipe!!!Anonymous4/5/2020Ahh, I now see the 325 degrees. It worked out very well at 350 degrees  though! Love it. Thank youAnonymous3/28/2020Trying recipe now, but with a little extra lemon zest because I’m  using lemon curd instead of raspberry preserves. Also accidentally added a half cup of light brown sugar looking at a separate recipe.. Had to assume the temperature for baking is 350 degrees, not sure if I’m just blind or it was excluded.MountainKiddSouth Lake Tahoe 3/28/2020Delicious! Made this for breakfast. The only difference is I made home-made caramel toffee sauce and placed a layer of it on the bottom, and drizzled a little on the topsumi-eAustralia10/21/2019With a side of Stiff Peak Chantilly CreamAnonymous10/20/2019Everything but the raspberry preserves.. completely slipped my mind.\n\nbut the Krispy Kreme BreadPudding was a complete W !\nJon JusufJakarta, Indonesia10/20/2019Explore Bon AppétitCasseroleDessertAmericanNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Amiel Stanek"]}