{"id": "9505c4033194958a0fa817f39e59c2ec", "url": "https://www.bonappetit.com/story/loading-a-dishwasher", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Load a Dishwasher | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingYes, There is a Correct Way to Load a DishwasherSince you're probably doing more dishes than ever.By Ali FrancisApril 10, 2020FacebookTwitterEmailIllustration by Tim LahanFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to wash the dishes.“Why don’t we have a dishwasher?” I used to whine at my mother, to which she would cackle—elbows deep in a sudsy sink, eyes darting between me and my big brother—and respond: “I already have two dishwashers.”When I finally moved into my own apartment, those long nights spent scrubbing dishes with travel-themed towels far behind me, I was utterly enamored by the giant silver cube in my kitchen. But I did not know how to use it. What is this oddly satisfying cage thing for? Is it safe to put in my wine glasses? Must I rinse first? Heck, are these dishes even clean?Without solid advice, I fumbled my way through, warping wooden boards, blunting sharp knives, opening it after the cycle ended to find most of the dishes weren’t very, uh, clean. But while dishwasher roulette may be a fun game for a 19-year-old, you’re probably using your machine more than ever—and now’s a good time to learn how to make sure it’s serving you well. Follow these foolproof guidelines:1. Pre-rinsing? Not necessary.Parents everywhere: earmuffs. If you’re planning on leaving your dirties in the machine for a while, however, you can run the rinse-only cycle to stifle gross odors. It’s more water-efficient than rinsing by hand, and will prevent dish-appointment (that feeling when you open the machine only to find crusted on bolognese and filmy water spots everywhere). But if you’ve got a full load ready to go, scrape off the serious gunk and bits of food, hit start, and don’t look back. If you're stuck with an older model and you've noticed it can't do its job, rinse away—you know what works for your machine.2. Note the hard NOs.Don’t dish-wash sharp knives, which will dull. (Butter knives are fine because they are already kinda dull.) Wooden items, like spoons and cutting boards, could warp or crack, so keep them out. Pans, especially of the nonstick variety, don’t belong—they’re bulky and damage-prone. Those twisty reusable straws? Asking for trouble. Essentially, the cardinal rule is this: Don’t put anything in there that you couldn’t (or wouldn’t want to) replace—ceramics, family heirlooms, fine china.3. Keep your utensils together, but not too together.For the most powerful wash, position the tines (sharp doodads) of forks and the bowls of spoons sticking up. And keep knife blades stabbing downwards (for safety). Remember, we’re social distancing: For the water to properly clean every surface, and to minimize scratches, don’t cram too many utensils into the basket at once. Spoons have a tendency to, well, spoon, so try to keep them in different compartments.4. Location, location, location.Load from back to front to fit in more stuff. Unload from bottom to top so you don’t drip on your dry dishes. Thin plastics (like quart containers and takeout bowls) should live on the top rack to prevent them from melting. And be sure to batten the hatches: Rogue plastic bits tend to drop to the bottom, where it’s hotter. Place bowls and cups facedown or at an angle so they don’t harbor puddles, and keep plates on the bottom shelf where the spray is strongest. Don’t nest things like Russian dolls; if the water can’t reach something, it won’t be cleaned.5. Never wonder if it’s clean or if it’s dirty again.Right after you empty the machine, add the detergent. That way, when you see the soap, you’ll know it’s ready to load. Magic! Also, a little detergent goes a long way. You can use less than the recommended amount if your dishes aren’t too feral. Just don’t use more than what’s recommended in your user guide: That’ll leave a filmy residue on your fancy glassware.6. Don’t block the jets.At 1 a.m. it is very human to want to just shove your cookie sheet or lasagna pan onto the bottom rack and walk away. But you’re going to block the spray arm. And that’s like trying to dust your house by blowing on everything: You’ll look dumb and you’ll make matters worse. Big stuff goes on the sides, and needs to sit at an angle. (Like the cups, remember?)7. Always run it full.Please, for the love of our planet. But you knew that one already, right?Explore Bon AppétitCleaningToolsCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-10", "author": ["Condé Nast", "Ali Francis"]}