{"id": "95085bcf3ff0fae1e91ef4592be92a04", "url": "https://www.bonappetit.com/story/baking-questions-people-ask-me-all-the-time", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "The 10 Baking Questions People Ask Me Literally All the Time, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe 10 Baking Questions People Ask Me Literally All the Time, AnsweredTo my friends, family, and followers: Read this before you text and/or @ me, please.By Claire SaffitzMay 16, 2018FacebookTwitterEmailFacebookTwitterEmailPeople are always asking me baking questions—from strangers DMing me on Instagram, to friends I don’t otherwise talk to anymore texting me, to my own mother and sister calling me on the phone demanding answers. I’m always happy to field questions like these because they help to give me a sense of they way people interpret the recipes I write and where they get tripped up. That said, there tends to be quite a bit of...repetition. So, here are the kinds of questions I’m asked most often, narrowed down into four main categories, along with the most common answers. So the next time you’re baking and have a question about a recipe, refer to this and see if your query is covered. (Mom, if you’re reading, I’ll still respond to your calls and texts, but maybe take a look and see if this helps first.)1. The “Can I Substitute…?” QuestionsThis one comes up A LOT. Everyone wants to know if they can substitute one ingredient for another, whether it be for convenience, health, or dietary reasons. Generally, if you’re a baker who’s still learning the ropes, substitutions can be risky. It’s always best to make a recipe the first time as written, and only after that initial success should you make substitutions. Even then, only change one ingredient at a time to eliminate multiple variables. When you’re at that point, read on...Q: Can I substitute...whole wheat for all-purpose flour?A: Replacing white flour with whole wheat generally makes baked goods denser, drier, and more crumbly because the germ and bran in whole wheat absorbs more water. So in the case of baked good where you want a light and tender texture, like cake, it’s just a bad idea. In the case of pancakes, muffins, and quick breads, though, where the batter tends to have more liquid, you can usually get away with substituting up to 25% of the white flour for whole wheat. It will definitely have an impact on the texture, but usually in a way that is intriguing rather than disastrous, and will add some flavor and nuttiness to the equation.Q: Can I substitute...coconut oil or a different fat for butter?A: Generally speaking, no. Any recipe that starts with creaming butter and sugar together—so, most cookies and cakes—rely on the special properties of butter that allow it to be whipped. The action of working air into butter during creaming contributes to a light, fluffy texture for baked goods. At the same time, butter’s unique physical properties also makes it essential in creating a flaky texture in things like croissants and pie dough. Substituting another fat for butter often negatively affects the desired final texture.Q: Can I make __________ gluten-free or vegan?A: Only advanced bakers should endeavor to adapt non-vegan recipes to be vegan, or gluten-full recipes to be gluten-free. There are all sorts of tips and tricks when it comes to subbing vegan ingredients for eggs and dairy, but it’s tricky to say the least. My best advice is to find an existing vegan or gluten-free recipe from a reliable source and start from there.Want that apple butter cake to come out clean? You're gonna need parchment paper.\n2. The “Do I Really Need…?” QuestionsI get it! It’s annoying to have to go out and buy specialty baking equipment or ingredients. You want to know which things are essential to the success of a recipe and which aren’t. Here’s my take:Q: Do I really need...parchment paper?A: Parchment paper is an essential baking tool because it creates a nonstick surface. If you want cakes to release cleanly, brownies to lift out of the pan, and cookies to slide off the sheet, parchment paper is a must. It can be a little pricey, but it’s also available in pretty much every baking aisle and is 100% worth it—way better than having a cake that you worked so hard on refuse to come out of the pan.Q: Do I really need...cake flour?A: With light cakes like angel food or sponge, cake flour is necessary because of its lower protein content. If a recipe calls for cake flour, it’s probably for a good reason. In a pinch, you can turn all-purpose into a fine substitute for cake flour by swapping 2 Tbsp. corn starch for the same amount of flour per cup of all-purpose.Pumpkin sheet cake gets the party started.\nChelsie Craig3. The Strategy QuestionsI get tons of practical questions from readers about the best strategy for baking for a party, brunch, or potluck. No one bakes under perfect conditions and we’re all trying to work around complicated schedules. It's all about knowing the acceptable ways that the procedure for a recipe can be modified to suit your situation and kitchen.Q: This recipe makes 24 cupcakes but I only want 12. Can I cut it in half?A: Yes, usually without any problems. Cut all the quantities of ingredients in half and proceed with the recipe as written. Sometimes you need to halve an odd number of a ingredient that’s hard to split, like eggs. In that case, I’ll beat a whole egg and eyeball half into the recipe (save the other half for egg wash). Doubling or tripling a recipe can be a little tricky, though, because you can begin to exceed the capacity of a standard mixer.Q: I don’t have a stand mixer—can I still make this?A: It can be very challenging for a home baker to mimic the power of a stand mixer when it comes to actions like mixing bread dough or creaming butter and sugar. It’s not impossible, but it will require more time and a lot of elbow grease. If you’re serious about baking, an inexpensive hand mixer is a necessary, no-brainer investment. Though it’s pricey, a stand mixer is an extremely useful and versatile piece of equipment, so consider adding it your wish list if you have baking ambitions.Q: Can I make this recipe ahead?A: Most cakes, bars, pies, tarts, and cookies can be made ahead by at least a day. Let cool completely, cover with plastic or store airtight, and store at room temperature. (I don't recommend refrigeration because chilling can change texture.) You can also make way something way in advance, cover tightly, and freeze. Let frozen baked goods thaw gently in the fridge for a day, then let come to room temperature before serving.Not too light, not too dark, this olive oil cake looks juuuuuust right.\nAlex Lau4. The “What Went Wrong?” QuestionsWhile baking failures feel like a waste of time and ingredients—and they are, don’t get me wrong—you can also learn a lot about what not to do next time. A lot of times it actually isn't your fault at all! These are the most important questions to ask and answer; every baker needs to mess up before they can get better.Q: My cake got too dark and tastes dry, what went wrong?A: It may be that the recipe isn’t very good...but in all likelihood you just baked it too long. If you baked it for the time written, this may indicate that you have a “fast” oven, or one in which things bake at an accelerated rate. The next time you bake, set your timer for less time and check for doneness sooner.Q: My cake sunk and is gooey in the middle, what went wrong?A: Yep, you under-baked it. Even if a cake looks golden around the edges, if it sinks in the middle during cooling and has a gooey instead of springy texture, it didn’t bake long enough. If you ever have a question about whether or not a cake is done, err on the side of caution and bake it a couple of minutes longer. This isn’t long enough for it to dry out, but it will help ensure that you don’t undershoot your mark. Use all the reliable tests for doneness—sight (look for browning), touch (a cake tester or toothpick inserted into the middle should come out clean, and the center should spring back when you poke it), and smell (it should smell toasty and fill the whole kitchen).Ready to bake? Try these one-bowl scones:Easy Blueberry Cream SconesThink of these scones as the easier, cooler cousin of the blueberry muffin.View RecipeExplore Bon AppétitBasicallyBakeCakeCookiePastryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-16", "author": ["Condé Nast", "Claire Saffitz"]}