{"id": "951b03b5db56a1edc27c72deb864f859", "url": "https://www.bonappetit.com/recipe/cashew-chilate", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Cashew Chilate Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueCashew ChilateSeptember 22, 20205.0(4)Read ReviewsTriangleEmailPinterestPrintPhotographs by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintWhile this cozy, warming beverage is totally awesome consumed on its own, it just so happens to be the perfect nutty, slightly sweet, somewhat untraditional accompaniment for a savory Salvadoran dessert like Quesadilla.IngredientsMakes about 6 cups2cups raw cashews1tsp. whole allspice33\" cinnamon sticks, divided6cups whole milk¼cup sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltFlaky sea saltPreparationStep 1Preheat oven to 325°. Toast cashews on a rimmed baking sheet, tossing halfway through, until golden brown, 12–14 minutes.Step 2Meanwhile, toast allspice and 2 cinnamon sticks in a medium saucepan over medium heat, stirring often, until fragrant, about 3 minutes. Add cashews, milk, sugar, and kosher salt and reduce heat to low. Cook, stirring occasionally, until cashews soften and flavors infuse (do not let milk boil), 20–25 minutes. Let cool slightly.Step 3Transfer mixture to a blender and purée on high speed until very smooth and the consistency of heavy cream. Wipe out saucepan. Strain chilate through a fine-mesh sieve back into saucepan. Reheat chilate over medium-low, stirring occasionally, until hot.Step 4Ladle chilate into mugs and finely grated remaining cinnamon stick over; sprinkle with sea salt.Step 5Do ahead: Chilate can be made 1 week ahead. Let cool. Transfer to an airtight container; cover and chill. Reheat over medium-low heat before serving.How would you rate Cashew Chilate?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI love the flavors, heft and warmth of this recipe.  It does require a good blender because of the solid spices.  I tried blending it in a food processor because I don't have a blender and it didn't work that well.  I had to remove the whole cinnamon sticks.  (It was a hot mess!)  I love hot beverages and this is a good addition to the repertoire.  Portland, Oregon10/24/2020So two things:\n\nFirst, in answer to the other commenter, yes, the recipe is correct as written and you blend the spices into the drink. Very nicely spiced at the ratios here. \n\nSecond, the recipe says to strain through a fine sieve. I would recommend using a medium-fine colander instead. I used my fine sieve first and it caught all the spice bits but also most of the blended cashew solids. This significantly thinned out the drink. Passing it back through a slightly coarser colander did the trick, catching the leftover spice bits but letting the cashew solids pass through. The result was a delicious and full-bodied drink. \n\nTip: delicious (very) cold too!AnonymousPrinceton, NJ10/10/2020Actually asking a question before I make this- it would appear you blend up the cinnamon sticks along with the rest. Is that true??? Sounds entirely wild to do so and I'd hate to waste all that milk and cashews if it turns out that is, in fact, an awful idea. henrykat1Chicago 10/7/2020Explore Bon AppétitHot DrinkDrinks AllCashewNutDrinksGluten-FreeNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}