{"id": "951d8ffc5301a53709638841b6c3f337", "url": "https://www.bonappetit.com/story/rev-dr-heber-brown-iii", "year": 2021.0, "month": 8.0, "day": 5.0, "content": "Rev. Dr. Heber Brown III's Black Church Food Security Network Turns Churches Into Gardens  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Turn a Church Into a GardenRev. Dr. Heber Brown III wants to connect Black churches with Black farmers—and transform a historic source of trauma into a source of power.By Jewel WickerAugust 30, 2021FacebookTwitterEmailBrown (center) with his team, Namita Money (left), Shirley Taylor (right), and Sha'Von Terrell (not pictured), at the Pleasant Hope Baptist Church garden in BaltimorePhoto by Reginald CunninghamFacebookTwitterEmailIt wasn’t until Rev. Dr. Heber Brown III decided to transform the front yard of his church into a garden that he began to remember his own connection to farming. The senior pastor of Pleasant Hope Baptist Church in Baltimore grew up picking string beans and tomatoes from his grandparents' backyard. He'd listen to stories about how his great-grandmother used to preserve food in towering stacks of mason jars—enough to share with her whole rural Virginia neighborhood. Today he carries that legacy forward as founder of the Black Church Food Security Network, an organization that connects churches with farmers in numerous states. His goal? To create alternative food systems that address systemic issues such as racism and climate change.In addition to fostering connections and teaching Black churchgoers to grow their own food, Brown’s own church regularly hosts a market where they sell tomatoes, cucumbers, summer squash, radish, okra, and other produce at affordable prices. They even grow their own herbs and make elderberry syrup to serve during communion instead of the usual packaged juice.Last year, amid the global pandemic and a nationwide racial reckoning, Lizzo and Dua Lipa were among the celebrities to champion the Black Church Food Security Network, attracting funding from partnerships and a major increase in public donations. I caught up with the reverend to learn more about the inspiration behind the network, the enduring legacy of Black churches, and the outdated nature of our current food system.Ten years ago I started really paying attention...to a pattern I saw in my congregation: People being hospitalized for diet-related issues. I wanted to do something about it beyond the spiritual support that is common for a pastor. So we took a portion of the church’s front yard, about 1,500 square feet, and started growing our own produce.The death of Freddie Gray...at the hands of the Baltimore police came five years after that. In the midst of the uprising, we saw city government and social support agencies back up off the Black community. Public transportation stopped running for a few days. The school system closed and 80,000 Black students who depended on school cafeterias for breakfast and lunch couldn't get that support. And so, bending the existing assets of Black churches—their kitchens, the vans, the people, the space—we began connecting with Black farmers so we could feed ourselves. That’s how I launched the Black Church Food Security Network, in hopes of connecting Black churches with Black farmers. Word started to spread beyond Baltimore. Today we have more than 60 Black farmers providing fresh produce to the congregations within our network.Our current food system is propped up by... plantation economics and has a deep legacy of enslavement and oppression. There's little that can be done to completely reform and change that system, and for me, little motivation to dedicate the few years I have on this earth to trying to change such a gargantuan system that has been oppressive for centuries. What I’d like to do is co-create alternative micro food systems, not just because of the racism and the oppression in the current food system, but also because of the impending challenges around climate change, the growing concerns around geopolitics, and COVID-19, which showed us how fragile our current food system is.There’s a lot of trauma... around farming and gardening in the Black community. Historically, many Black families left or were forced out of the South and off their land. The ripple effect of that trauma can be passed from generation to generation so the idea of farming can bring up some difficult memories. We had to create space to recognize that the land never terrorized us. Corn, tomatoes, cucumber, and watermelon never disrespected or violated us. The land is not the source of our trauma; it can be a source of our power if we organize those assets and resources together.I know I’ve failed if...this effort ceases to exist once I'm no longer here. Food is a sacred symbol in every Black church. I say to people often that after the pulpit, the second holiest place in the building is the kitchen. The Black church has been around for a very long time; our greatest shot at having something that extends far beyond our lifetime is planting it in our soil and watching it blossom.Explore Bon AppétitCulturePerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-30", "author": ["Condé Nast", "Jewel Wicker"]}