{"id": "951f380d41dadfa6d8d0398b4cbbc4c2", "url": "https://www.bonappetit.com/recipe/lemon-chicken-thighs", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Lemon Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueLemon Chicken ThighsBy Molly BazMarch 20, 20183.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintChicken thighs are our desert-island weeknight protein. Their dark meat translates to reliable juiciness, and their delectable skin gets as crispy as cracklin’s. This one-skillet method is capped off with a punchy and bittersweet lemon vinaigrette built on the brown bits left in the skillet. And that’s what you’re going to want to drag each bite of chicken through. And to think it’s only Tuesday.Ingredients2–4 servings 4skin-on, bone-in chicken thighsKosher salt, freshly ground pepper¼cup white wine vinegar4garlic cloves, crushed2lemons, halved1½tsp. honey½tsp. Aleppo-style pepper3Tbsp. extra-virgin olive oilPreparationStep 1Pat chicken thighs dry and season well with salt and black pepper. Place in a large resealable plastic bag and add vinegar. Seal bag and gently massage chicken to ensure all thighs are coated in vinegar. Chill 1 hour.Step 2Preheat oven to 400°. Remove chicken thighs from bag and pat dry with paper towels. The drier the skin, the crispier it will be when cooked.Step 3Place chicken thighs, skin side down, in a dry large cast-iron skillet and set over medium heat. Cook undisturbed until they easily release from the pan, about 4 minutes. Continue to cook, moving chicken around occasionally to ensure the skin is cooking evenly, until golden brown, 8–10 minutes. Add garlic and transfer skillet to oven. Bake until chicken is cooked through, 10–12 minutes. Transfer chicken and garlic to a plate.Step 4Set skillet over medium-high heat and cook lemons, cut side down, until edges are deeply charred (they should be almost black), about 5 minutes. Transfer to plate with chicken and garlic and let cool slightly.Step 5Squeeze lemon juice into a small bowl; add garlic, honey, and Aleppo-style pepper and whisk to combine. Whisk in oil and any accumulated juices on plate with chicken. Season vinaigrette with salt and black pepper.Step 6Drizzle half of vinaigrette on a platter and set chicken on top. Serve with remaining vinaigrette alongside.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Lemon Chicken Thighs?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleNo way this is cooked through after just 12 minutes. The side without skin looked very pail. Anonymous6/24/2021I have made this recipe a couple of times now and I really love it. It's super simple and tasty. Can easily be dressed up and changed depending on what you have in the fridge. I would definitely recommend it. LouNew York City3/15/2021Tried this recipe tonight. Timing was off for browning the thighs over medium heat: thighs came out not browned enough. Recipe for vinaigrette was not a crowd favorite: overwhelming vinegar flavor. Used exact measurements. AnonymousChicago4/21/2019Should the dry pan be preheated before you put the patted down chicken in?AnonymousLos Angeles CA3/13/2019Tasty! The vinaigrette adds some zing. AnonymousOR4/11/2018Explore Bon AppétitChickenPoultryChicken ThighLemonCitrusFruitEasyMainDairy-FreeGluten-FreeNut-FreeKetoHanukkahPassoverRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Molly Baz"]}