{"id": "952db9f379e77efe54356b09bcdffd6c", "url": "https://www.bonappetit.com/story/best-potatoes-for-mashing", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Choosing the Best Potatoes For Mashing Depends on Your Mashed Potato Goals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are the Best Potatoes for Mashing? Well, That DependsWhether you want light and fluffy or dense and creamy, these potatoes get the gold medal in mash.By Nico AvalleNovember 11, 2021FacebookTwitterEmailPhotograph by Emma Fishman, Food styling by Susie Theodorou, prop styling by Sophie LengFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As with most simple recipes, choosing the right ingredients is key when making mashed potatoes—the best mashed potatoes are made from the best potatoes for mashing. No matter how much melted butter, sour cream, or white pepper you add, if the tubers are gummy or grainy, your dish is a goner. Meanwhile, start with superb spuds and the rest is, pardon our pun, gravy.So what are the best potatoes for mashing?We consider Yukon Gold potatoes the best choice for classic dense mashed potatoes. Their rich texture and subtle creaminess make them great for all of your mashing needs. A true all-purpose potato, they’re also good for shredding, roasting, grilling, blending (?!), and shingling. So when you’re shopping for your Thanksgiving, Friendsgiving, or really any occasion that calls for the smoothest, creamiest side dish imaginable, keep an eye out for their bright yellow skins.According to senior food editor Christina Chaey, there’s a few reasons Yukons get BA’s gold medal in mashing year after year. “For starters, Yukon Golds have a naturally buttery flavor compared to other common potatoes, so you have a richer tasting natural potato from the get-go,” she says. That buttery flavor will only get boosted when it comes time to add actual butter or cream leading to perfect mashed potatoes in the end. “Yukon Golds also have a tendency to absorb less water than most other potatoes [as they cook], so they don’t run the same risk of getting water-logged or gummy,” Chaey points out.What other potatoes are good for mashing?Whereas Yukon Golds are considered medium-starch potatoes, russet potatoes are high-starch potatoes. That starchiness leads to mashes that are on the lighter and fluffier side. Unlike Yukon Golds, which produce dense, rich scoops of super creamy mashed potatoes, russets turn out pillowy and soft.While many recipes call for russets to be peeled, cubed, and boiled before they’re mashed, we actually prefer a no-boil oven method, which ensures these extra-starchy potatoes don’t take on too much water. Roast the potatoes whole until totally tender, then remove the skin, mash the flesh, and incorporate melted butter and half-and-half (or heavy cream). Careful, though: Overworking cooked russet potatoes (say, by throwing them in a food processor) will release too much starch, turning them into a sticky glom.If you’re feeling indecisive, you can always use both, like we do in this recipe for mashed baked potatoes. Yukon Golds and russets are baked side by side on high heat and mashed together into sweet, silky harmony, then loaded with chives, roasted garlic, and black pepper for a side that brings the best of both worlds.What’s the best tool for mashing potatoes?You’ve got the good potatoes, now what? The best tool for mashing depends on the type of mash you’re looking for, the mashed potato recipe you're following, and (last but far from least), the amount of storage space you have:Potato MasherLo-fi, cheap, and easy to store, we love a good old-fashioned potato masher—provided that you don’t mind a mash with a few lumps. (Just call it “rustic.”) If you don’t have a masher, a fork can get the job done, Chaey says.OXO Potato Masher$14 at AmazonRicerFor the smoothest, most uniform mash possible, you’ll need a potato ricer. Picture a garlic press’s big sister and you’re on the right track. Passing your boiled spuds through a ricer will reduce them to uniform shreds in seconds—good news for you because spending too much time mashing can lead to gummy results even if you start with the right potatoes. Remember: Yukons are more forgiving than most potatoes, but just like you and me, every tater has its limits.Stainless Steel Potato Ricer$14 at AmazonFood MillThis old-school contraption breaks down potatoes with an efficiency similar to a ricer, but can also be used to make jam, tomato sauce, and all kinds of smooth homogenous things. The downside? It takes up more space and is kind of a pain to clean.Food Mill$50 at AmazonFood Processor/Stand MixerIt’s a trick! Never, under any circumstance, do you want to make mashed potatoes with either of these devices, which will overwork cooked potatoes into a gummy, gluey mess. Trust us on this one.Bonus Option: Veggie PeelerIf you’re using a ricer or food mill, say goodbye to those skins, which won’t make it through the small holes of the machine. Otherwise, you’ve got a choice: Removing the potato peels will make for a more uniform texture, but there’s also nothing wrong with leaving your peels intact for a bit of homestyle charm. If you do choose to ditch those peels, we prefer a Y-style peeler, which will tidily shuck the skin from any fruit and veggie while leaving the skin on your fingers completely intact.Vegetable Peeler$10 at AmazonLike your toppings and mix-ins, the tools you use are pretty much a matter of taste. In truth, the same can be said for all things mashed potatoes: Fluffy and light or dense and buttery, it’s up to you to choose a direction for your dish. And once you do pick a lane, choosing the right types of potatoes is simple. Now that you have the answers in hand, the best mashed potatoes you could possibly imagine are in reach.Comfort food goals:Garlic-Miso Butter Mashed PotatoesMellow roasted garlic and sweet-salty miso paste bring big flavor to this buttery, easy-to-love mash.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-11-09", "author": ["Condé Nast", "Nico Avalle"]}