{"id": "953631bb8f66ec82710407fdf5aeda43", "url": "https://www.bonappetit.com/story/kimino-ume-sparkling-plum-juice", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "Kimino Sparkling Ume Plum Juice Is Made to Be Savored (But I Can’t Help But Gulp It Down) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Sparkling Ume Plum Juice Is Made to Be Savored (but I Can’t Help But Gulp It Down)Made with seasonal fruit from Japan, it’s sweet-tart, delicately bubbly, and excellent mixed with gin.By Sarah JampelJanuary 11, 2022FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.To break up the work-from-home day, some people take an afternoon walk, jump in the shower, or pair a steaming hot coffee with a little something sweet. I often do all of the above—and I also pour myself a fancy refreshing beverage. When I’m feeling ambitious, that’s a matcha Arnold Palmer, a pomegranate molasses lemonade, or a Thai iced tea with coconut condensed milk. (Welcome to Sarah’s Beverage Program.) But when I want to open a bottle and get straight to drinking, it’s Ume Sparkling Juice from Kimino.Photograph by Emma FishmanKimino Ume Sparkling Plum Juice$4 at Weee!$65 at Amazon (12-pack)I love all four flavors of these Japanese drinks, which are made with hand-picked seasonal fruit and water from the mountains of the Hyōgo Prefecture west of Osaka. The yuzu is puckery and the Ringo apple is floral and rosy, but it’s the ume that stands out for me. Tart and tingly, it’s made from green ume plums—which are actually more closely related to apricots—and each sip starts sweet but finishes with the surprising sour savoriness of underripe stone fruit. The bubbles are fine and delicate (think Champagne). They tickle without distracting from the sweet-tart flavor that comes from a mixture of ume juice and ume purée.In the afternoon, I sip the chilled drink straight, willing myself to stretch the bottle out until my last meeting is over. (It is all too easy to get caught up in the wonderful refreshment and look down at an empty glass!) But once my computer is closed for the night, I’ll mix the sparkling juice with a bit of gin. (I’m sure that cocktail connoisseurs could come up with much more creative combinations—but Sarah’s Beverage Program After Dark still needs some work.)Even the empty bottles are pleasing in size and shape. I’m collecting them and removing their stickers, with plans to employ them as vases for single flowers. Beauty! Simplicity! And a reminder of delicious drinks come and gone all too quickly.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-11", "author": ["Condé Nast", "Sarah Jampel"]}