{"id": "953a553900aa19e5917c2b1db9dcc8a0", "url": "https://www.bonappetit.com/recipe/cold-toddy", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Cold Toddy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueCold ToddyBy Andy BaraghaniNovember 20, 20185.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintYou know how at parties you can get a little, uh, hot under the collar? That’s where we got the idea to take down the temperature of a classic hot toddy for a more refreshing approach to the seasonal mix of tea, citrus, spices, and rye whiskey.Ingredients8 servings1medium orange5–6medium lemons43\" cinnamon sticks14\" piece ginger, peeled, smashed, plus more thinly sliced for serving4Earl Grey tea bags1tsp. whole cloves⅔cup honey2cups rye whiskey1tsp. orange or regular bittersOrange twists (for serving)PreparationStep 1Using a vegetable peeler, remove zest from orange and 1 lemon in wide strips, leaving white pith behind; slice fruit in half. Squeeze juice from orange into a small bowl (you should have about ¼ cup). Squeeze juice from lemon into a measuring glass. Slice remaining lemons in half and squeeze juice into glass to measure 1 cup total; save any remaining lemon halves for another use. Set orange and lemon juice aside.Step 2Place zest in a small saucepan. Whack cinnamon sticks with the side of a chef’s knife to break up a little and add to saucepan along with smashed ginger, tea bags, cloves, and 1¾ cups water. Bring to a boil and immediately remove from heat; let sit 5 minutes. Remove tea bags, then stir in honey; let cool completely, about 20 minutes.Step 3Strain tea mixture through a fine-mesh sieve into a pitcher and add rye, bitters, and reserved orange juice and lemon juice. Add 2 cups ice and stir until ice is melted and toddy is very cold.Step 4To serve, pour toddy into tumblers filled with ice and garnish with ginger slices and orange twists.Step 5Do Ahead: Tea mixture can be made 3 days ahead; cover and chill. Toddy can be made 1 day ahead; cover and chill.How would you rate Cold Toddy?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIt was 85° on Christmas Eve this year so I went searching for a cold holiday drink and found exactly what I was looking for with this Cold Toddy. It was a huge hit and has already been requested for next Christmas.BlakeFort Worth, TX12/29/2021This is awesome and we make it every year JenlunewTampa, FL 11/26/2021Explore Bon AppétitCold DrinkDrinks AllCocktailRye WhiskeyWhiskeyAlcohol & Other DrinksEarl GreyLemonCitrusFruitOrangeFallDrinksThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Andy Baraghani"]}