{"id": "9542c7160cdff44ee067dfdc0de5d744", "url": "https://www.bonappetit.com/recipe/slow-cooked-chicken-stew-with-kale", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Chicken Stew with Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueSlow-Cooked Chicken Stew with KaleBy Claire SaffitzSeptember 18, 20184.0(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintSkip inferior store-bought broth and just add water to this stew and make your own. We found a way to get every iota of value from the chicken bones. Letting the stew sit the full 12 hours really helps all the flavors meld together. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servingsChicken Skin Gremolata8pieces chicken thigh skin (reserved from stew; see below)1small garlic clove, finely grated2Tbsp. finely chopped parsley1tsp. finely grated lemon zestKosher salt, freshly ground pepperLemon Oil1small lemon, preferably organic and unwaxed, very thinly sliced into rounds, rounds cut into quarters⅓cup extra-virgin olive oilPinch of sugarKosher salt, freshly ground pepperStew and Assembly4lb. skin-on, bone-in chicken thighs (about 8), patted dryKosher salt, freshly ground pepper6oz. bacon (about 6 slices), chopped4large shallots, peeled, quartered lengthwise2heads of garlic, top third removed½cup dry white wine1bunch parsley, stems tied together with kitchen twine2bay leaves8cups torn curly kale leavesThinly sliced radishes and/or thinly sliced red onion (for serving; optional)PreparationChicken Skin GremolataStep 1Preheat oven to 350°. Arrange chicken skin in a single layer on a rimmed baking sheet and bake until dark golden brown and crisp all the way through, 12–18 minutes. Let cool, then coarsely chop.Step 2Combine chicken skin, garlic, parsley, and lemon zest in a small bowl; season with salt and pepper and toss to combine.Lemon OilStep 3Combine lemon, olive oil, and sugar in a small bowl. Season with salt and pepper and let sit at least 10 minutes, mixing once or twice.Step 4Do Ahead: Lemon oil can be made 2 days ahead. Cover and chill. Bring to room temperature before using.Stew and AssemblyStep 5Season chicken thighs all over with salt and pepper. Cook bacon in a large Dutch oven or other heavy pot over medium-low heat, stirring often, until brown and crisp, 7–10 minutes. Using a slotted spoon, transfer bacon to a small bowl.Step 6Increase heat to medium-high. Working in 2 batches if needed, cook chicken thighs, skin side down, in the same pot until skin is golden brown, 7–10 minutes. Transfer to a large plate and turn skin side up. Remove pot from heat. Let chicken cool slightly, then pull skin from meat and transfer to a shallow bowl; cover and chill (save for making the gremolata).Step 7Return pot to medium heat and cook shallots and garlic, cut side down, in the same pot, tossing shallots occasionally, until shallots are browned in spots and garlic is golden brown, about 5 minutes. Add wine, stirring to release any bits stuck on the bottom of pot, and cook until reduced by two-thirds, about 2 minutes. Add parsley, bay leaves, reserved bacon, and 8 cups water, season generously with salt and pepper, and bring to a simmer. Return chicken thighs to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is tender and easily pulls away from bones, 1–1½ hours.Step 8Transfer thighs to a cutting board and let cool 10–15 minutes; keep liquid at a simmer. Pull meat from bones and tear into bite-size pieces; discard bones. Transfer meat to a medium bowl and cover with plastic wrap. Add kale and simmer until kale is tender and liquid is very flavorful, 25–30 minutes.Step 9Remove stew from heat, add meat back to pot, and let cool uncovered until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).Step 10Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard parsley, bay leaves, and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Chicken Skin Gremolata, Lemon Oil, radishes, and/or red onion as desired.Step 11Do Ahead: Stew can be made 3 days ahead. Keep chilled.Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethHow would you rate Slow-Cooked Chicken Stew with Kale?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleIt was one of the best stews I have ever had. GarrySan Diego , California1/23/2021I became obsessed with this stew for a while. All my guests thank you, I'm sure.AnonymousVancouver, Canada1/14/2021Absolutely love this soup! I adjusted it so I could toss everything in my instapot and call it good. Also added garbanzo beans to mine for some extra heartiness.Khrystina-Lee Seattle 12/30/2020Really flavorful soup! I also modified with the garlic—I cooked the cloves whole and left whole in the soup. Because they cook so long, they practically disintegrate. Don't skimp on the chicken skin and lemon! The toppings really set this apart! Will definitely make again.AnonymousWashington, DC11/24/2018Delicious! I made this stew on Sunday afternoon as a nice change from my go to chicken soup. A few modifications: rather than using the whole garlic clove, I peeled a smashed the garlic cloves with the side of my chef's knife until the cloves were just shy of a garlic paste. I also 1/8th the shallots lengthwise for slimmer pieces. Lastly, subbed white wine for apple cider vinegar and used my own chicken stock from the freezer; this added a nice depth of flavor. All in all, recommend! And the bacon was a hit with my boyfriend. TaygoldaperStamford, CT10/22/2018Thanks to everyone who left a review. We've revised the steps with the garlic (cutting the third top off each head), shallots, and chicken bones so you don't have to fish them out amongst the kale. It should be much easier now!Bon_AppetitNew York, NY10/18/2018I’m surprised by the negative reviews. I followed the recipe from the magazine which were chronologically slightly different. I peeled the garlic and shallots prior to cooking and I used white wine vinegar instead of wine which gave the stew a pleasant tang. I did the gremolata last-came out great.AnonymousQueens, NY10/15/2018I made a few changes and this soup was divine. Bonus - I think .... and please don’t quote me Keto Professionals... but this could be a Keto friendly soup. I used chicken bone broth instead of water except for two cups. The confusing garlic shallot bones directions I threw out and just did what I know and fished all that out after removing the chicken. I threw the bones back in to simmer for a bit. Added kale. Fished said bones out. Then added chicken back in. Absolutely freaking delicious. Oh and cloves were added back in ... because ... why not? ZhannetteCalifornia10/15/2018Getting ready to make this and have just read through all the comments on the garlic.   I plan to cut the top off of the entire bulb, brown, and then add to the soup in a  stock sachet so that it's easier to get the skins out.   Garlic skins are very flavorful and will add umph to the broth!, and then I can make a game-time decision about whether the whole cloves should be added to the final soup.  More once I've cooked it!AnonymousSan Francisco10/13/2018I have to agree with other reviewers when it comes to this recipe. As written, the recipe is unclear and I think can result in a subpar soup. I did, however, make some changes that resulted in a fairly decent soup:\n-I  too was confused by the garlic instructions and decided to take it upon myself to peel the garlic and then toss it into the soup. I did the same with the shallots. Peeling the shallots was no problem, but peeling the garlic was hugely labor intensive. \n-One of the bigger changes I made was to add some cream of chicken to the soup as it cooked. Like other reviewers, I found that the broth was bland. However, adding the cream of chicken thickened it up a bit and gave it more depth and flavor. In addition to the cream of chicken I also added a parmesan cheese rind to add some extra flavor.\nI think the basic concept of this recipe is great--it has a lot of potential. However, it needs a few extra additions in order for it to be a repeat meal in my house. I will make it again--just not the way its written.Anonymous10/10/2018this recipe is very good, but the instructions are lacking - thus only 3 stars.  unpeeled garlic should only be used in a dish/broth that will be strained.  anticipating this, i sautéed the garlic in the bacon fat, removed and discarded.  i then added some grated garlic in the next step.  i also peeled the shallots before sautéing.  i bought a rotisserie chicken, boned it, leaving some bits and added the bones and carcass to quality stock. cooked down and strained, using that instead of water.  gremolata is boffo, but don't make ahead.  refrigeration makes it soggy.AnonymousEdina, MN10/8/2018This stew is really flavorful and the toppings just make it even better.  Pulling out the bones once the soup was done took a lot of time and effort. When making this recipe I would do it the typical way in which the broth is made first and then the ingredients ex. kale is added afterwards. Anonymouscanada10/5/2018Was quite excited to utilize the chicken skin gremolata (I mean, genius!) but didn’t feel like bothering after tasting the soup. Very bland and disappointing, even after letting it rest for a day. Directions for shallots and garlic were missing and it was extremely difficult to fish out garlic skin, shallot skin, and chicken bones from a stew swimming with 8 cups of kale. Would have preferred making a true homemade stock, straining, and then adding other ingredients. AnonymousChicago10/5/2018I agree that garlic instructions would be helpful! Ended up with a lot of indivudual cloves (from the top half of chopped heads) that I fished out: I removed the skins and returned the lovely cooked garlic to the pot. Pretty time-intensive, though.  I like the stew better without the lemon oil - will skip this next time. AnonymousRichmond, VA10/4/2018Same Question -what about the garlic? Pulled out skin after stewing and returned the cooked cloves to the pot to chill. Will see how it turns out. AnonymousSan Francisco10/2/2018Explore Bon AppétitStewSoups and StewsAmericanChicken ThighChickenPoultryBaconCured MeatMeatKaleLeafy GreensVegetableFallWinterMainGluten-FreeNut-FreeKetoBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}