{"id": "9566e6244ccb336547a3466ccd897070", "url": "https://www.bonappetit.com/recipe/smoky-eggplant-dip-eggplant-moutabal", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Smoky Eggplant Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueSmoky Eggplant Dip (Eggplant Moutabal)By Kamal MouzawakApril 16, 20194.7(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Andy BaraghaniEmailPinterestPrintEmailPinterestPrintThe flavor of this woodsy, earthy Middle Eastern dip comes from cooking eggplants on a grill or a gas stovetop until the skin blackens and the flesh collapses in on itself. Alternatively, you can broil the eggplants in the oven, turning occasionally, until charred and tender. They might not end up as smoky, but the final dip will still taste great. Check out our other recipes for a truly flavorful Lebanese feast, and read more about Kamal Mouzawak, the restaurateur-hotelier-humanitarian behind the recipe.Ingredients4 servings2medium globe eggplants (about 1¾ lb. total)⅓cup tahini¼cup fresh lemon juice3Tbsp. extra-virgin olive oil, plus more for drizzlingKosher saltPomegranate seeds and black sesame seeds (for serving)PreparationStep 1Remove grate and prepare a charcoal grill for medium heat (coals should be covered with ash and glowing red with no black remaining). Place eggplants directly on coals and cook, turning occasionally, until skins are completely charred and flesh collapses, 15–20 minutes. (Alternatively, you can char over a gas burner on medium-high heat, turning occasionally with tongs, 12–15 minutes.) Transfer to a colander set over a medium bowl. Let cool 15 minutes.Step 2Remove skins from eggplants (it’s okay if some bits of charred skin don’t come off). Transfer flesh to a sieve set over a bowl and let drain 10 minutes.Step 3Transfer eggplant flesh to a food processor; add tahini, lemon juice, and 3 Tbsp. oil and process until creamy; season dip with salt.Step 4Transfer dip to a bowl and top with pomegranate seeds and black sesame seeds; drizzle with more oil.Step 5Do Ahead: Dip can be made 1 day ahead. Cover and chill.How would you rate Smoky Eggplant Dip (Eggplant Moutabal)?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI have a very similar recipe from my sister-on-law's mother who was raised in Moldova.  She grills the eggplant, cools it, separates the burnt skin from the inside (its a tedious job, but necessary), washes it very well, then presses it to remove the liquid, then into food processor until smooth; chopped onions, vegetable oil, and salt.  That's it.  No tahini at all.  That wonderful smoky, sweet flavor of the eggplant comes through.  I do three eggplants at a time, and get a nice size bowl.  Sally C.bradford, pa6/27/2021Looks great, but are you supposed to char the eggplant in a pan if you have to use a stove, or are you supposed to hold it over the open flame?Ellen LittleCharlotte, NC USA10/15/2019This was delish!! I didn't feel like Maki g a special trip just for the pomegranate and black sesame seeds, so I didn't have pretty garnishes, but I did not miss them. The hubby and I ate this with olives and naan and it was devoured. New fave!!!jennaprather65924Lincoln, Nebraska 8/16/2019Do you have any thoughts on what could be done with the charred skin besides throwing it away? I mean I know it's mostly ash, but I've seen burnt onion powder used in food before, I just have no idea how I would make it.kkfood4/27/2019Explore Bon AppétitCondimentDipMiddle EasternLebaneseEggplantVegetableTahiniCondiments, Sauces & PastesStarterSnackDairy-FreeGluten-FreeVegetarianVeganHealthyishGrillingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kamal Mouzawak"]}