{"id": "956cd082e8f9ec97d42b11669623d530", "url": "https://www.bonappetit.com/recipe/japanese-curry-with-winter-squash-and-mushrooms", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Japanese Curry With Winter Squash and Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJapanese Curry With Winter Squash and MushroomsBy Christina ChaeyDecember 9, 20214.6(62)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata. Food Styling by Micah Morton. Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintMy family ate instant Japanese curry rice, or kare raisu, for dinner at least once a week when I was growing up. We always used boxes of S&B Golden Curry. I thought it was magic how the dark brown cubes inside transformed a pot of water, hearty vegetables, and chunks of stew beef into a thick velvety spicy curry in minutes. It didn’t occur to me that you could make your own curry spice mix from scratch—minus the preservatives and fillers—until I was an adult.There are countless ways to prepare homemade kare raisu, but the one nonnegotiable for me is S&B Curry Powder, which has a blend of 17 spices and delivers the nostalgic flavor of the curry I ate as a kid. For this recipe you’ll make a golden brown roux of butter and flour to which you’ll add the curry powder and some garam masala; this will be your curry base that will thicken up and flavor the finished kare. I use seared mushrooms and sweet kabocha squash in this vegetarian version, but you could swap in any number of veggies and proteins, such as potatoes, turnips, daikon, and chunks of chicken or beef. —Christina ChaeyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan$60 At AmazonVegetable Peeler$10 At AmazonWhisk$10 At AmazonSmall Saucepan$155 At AmazonChef's Knife$34.53 At AmazonIngredients4 servings4Tbsp. unsalted butter¼cup all-purpose flour¼cup S&B curry powder2tsp. garam masala3Tbsp. vegetable oil, divided8oz. mixed mushrooms (such as maitake, royal trumpet, shiitake, and/or crimini), torn or sliced into 2\" piecesKosher salt, freshly ground pepper1large onion, chopped1medium carrot, peeled, sliced on a diagonal ½\" thick2celery stalks, sliced on a diagonal ½\" thick3garlic cloves, finely chopped11\" piece ginger, peeled, finely chopped6cups low-sodium vegetable broth12oz. kabocha squash, scrubbed, or other winter squash, peeled, seeds removed, cut into 1\" pieces (about 2½ cups)1Tbsp. plus 1 tsp. honeyThinly sliced scallions and cooked short-grain rice (for serving)PreparationStep 1Melt butter in a small saucepan over medium heat. Whisk in flour and cook, whisking often, until roux is light golden brown, 5–8 minutes. Stir in curry powder and garam masala and cook, stirring, until very fragrant, about 1 minute. Remove from heat; set curry roux aside.Step 2Heat 2 Tbsp. oil in a large saucepan over medium-high. Cook mushrooms, tossing occasionally, until golden brown, about 5 minutes; season with salt and pepper. Transfer to a small bowl; reserve saucepan.Step 3Heat remaining 1 Tbsp. oil in reserved saucepan over medium. Add onion, carrot, and celery and season with salt and pepper. Cook, stirring occasionally, until vegetables are slightly softened and onion is translucent, 6–8 minutes. Add garlic and ginger and cook, stirring, until fragrant, about 2 minutes. Pour in broth and bring to a boil. Reduce heat and add squash and mushrooms; simmer gently until liquid is reduced by a third and vegetables are very tender, 20–25 minutes. Whisk in honey and reserved curry roux until incorporated and roux is lump-free. Simmer, whisking occasionally, until sauce is thick enough to coat the back of a spoon, 5–10 minutes. Taste curry and season with more salt if needed.Step 4Divide curry among shallow bowls; top with scallions. Serve with rice.Do Ahead: Curry can be made 4 days ahead; let cool. Transfer to an airtight container; cover and chill.How would you rate Japanese Curry With Winter Squash and Mushrooms?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleOutrageously good, thank you! I found more time efficient to make the roux whilst the veg was initially simmering. Can’t wait to make again!Jessica New York2/11/2022Watched the cooking video for this recipe and thought, “Great!  I can finally use that curry powder I have in my cupboard!”  Didn’t have enough shitaake mushrooms so I adjusted the recipe accordingly.  Planning on making panko crusted beef tomorrow to add to my leftovers! Well written recipe! Heather East Orange, NJ1/8/2022LOVE the fact that I can get the same flavor of the boxed block curry that I grew up with sans the unhealthy additives & preservatives. The flavors of the curry spice mix worked well with the addition of fresh garlic, ginger, and garam masala with a hint of subtle sweetness to round out the flavors from the touch of honey. I followed the recipe exactly, but will make a few adjustments next time. I found the amount of time the vegetables were cooked to be unnecessary- especially the carrots. I found the 20 minute simmer to cause the veggies to break down so much that the veggies began disintegrating & I was missing texture in the end. Next time, I’ll probably wait to add the carrots, potato/kabocha, and mushrooms to allow the base to start coming together first so I can have more control over the texture of the veggies. I grew up with green beans in my “kare” so I’ll definitely add those next time as well. I’m thinking 5-10 min with the veg would be plenty. Next time, I’m thinking of making a double batch of roux & freezing a portion in these silicone molds I have (made for storing homemade baby food) to have some ready-to-go curry cubes handy. Overall great flavor & I’ll definitely be making again :)Mel ELong Beach, CA1/6/2022While it did take us about 2 hrs to make in its entirety (mostly due to lack of experience with kabocha and how to prep it), it was well worth the effort. Will be making this for many fall/winters to come!LauraNashville, TN12/31/2021This turned out beautifully. Perfect flavor balance - just like a restaurant! I subbed the mushrooms and winter squash out for chicken and potatoes. Will be using this recipe again!CarmenOakland12/30/2021Good flavor but kind of gloppy texture with the rice.  By itself it works.AnonymousCalifornia12/30/2021Great recipe! Really easy and swappable. Used shiitakes and broccoli. The roux turned out to be kinda pasty (not saucy), not sure if that was the right way but it turned out good anyways! Deifnitely like that this recipe is sans all the preservatives found in the cube version.SamSingapore12/28/2021Amazing recipe! This was my first time trying a Japanese curry and could not have stumbled upon a better recipe! Full of flavour and great texture, although it did took me a while to prepare it was totally worth it. I live alone so I made half a recipe so I would have another serving for the following day, it reheats perfectly.TeresaPeru12/27/2021Excellent recipe. Loved this meal on a cold winter day. Fragrant, sweet, spicy, umami. It did take me a while to make. Maybe 1.75 hours with all the prepping. I’m not a very experienced chef, but this was restaurant quality.Andy ChallengerChicago12/22/2021one of the best recipes i've made in a while! i subbed chicken stock and delicata squash bc it's what i had at home and it didn't disappoint. definitely will be making this again!kellyejdnew rochelle, ny12/15/2021this is one of the best BA recipes i’ve ever made! it’s a warm hug in a bowl. i followed the directions exactly and it’s beyond delicious. my only substitution was using butternut squash because i couldn’t find kabocha. this will be going into our regular rotation! alyssawest long branch, nj12/13/2021I used leftover dashi instead of vegetable broth. Very tasty!Chris SColorado Springs, CO 12/11/2021I made this curry with a few additives/substitutes. I did not have access to all of the mushrooms so used a variety pack and found it a great substitute. I added potato’s which for next time, I will leave out. Used chicken broth vs veggie table broth and found it tasty, but once I added the roux mixture, found I needed to add .5-1 more cup of water to loosen it up. I usually use a curry cube for this type of recipe but found the homemade one in this to be exceptional. Substituted a grated apple for the honey and it was fantastic. I would recommend a cabbage salad as a side to break up the dense ness of the dish, but overall 10/10 flavor for vegetarian dish. LindseyDenver, CO12/11/2021Explore Bon AppétitDinnerMainEasyWeeknightVegetarianNut-FreeJapaneseEast AsianAsianCurryKabocha SquashSquashVegetableMushroomMaitake MushroomShiitake MushroomCrimini MushroomRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-09", "author": ["Condé Nast", "Christina Chaey"]}