{"id": "95738c633d6f8f904b440d3dbd9dbfb0", "url": "https://www.bonappetit.com/recipe/ultra-fluffy-pumpkin-pancakes", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "Pumpkin Pancakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesUltra Fluffy Pumpkin PancakesBy Zaynab IssaOctober 13, 20214.6(40)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintCanned pumpkin and a healthy dose of cinnamon and fresh ginger give classic buttermilk pancakes a fall-forward makeover, with salted maple butter and toasty pecans thrown in for good measure. These pancakes get their substantial lift from the acid in the buttermilk interacting with the leavening agents; lightly beating the egg whites gives them the similar fluffiness you’d get from whipping whites, minus the elbow grease. Because the pumpkin purée adds extra moisture to the batter, it’s important to cook the pancakes low and slow so they have time to cook all the way through before the outsides get too brown.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonFlexible Metal Spatula$9.99 At AmazonWhisk$10 At AmazonPastry Brush$9 At AmazonMeasuring Cups$18 At Bon Appétit MarketIngredients6–8 servingsBatter2large eggs1½cups buttermilk1cup pumpkin purée (preferably Libby’s)¼cup (50 g) sugar3Tbsp. melted unsalted butter12\" piece ginger, peeled, finely grated1tsp. vanilla extract2½cups (313 g) all-purpose flour2½tsp. ground cinnamon2tsp. baking powder¾tsp. baking soda1½tsp. Diamond Crystal or 1 tsp. Morton kosher saltmaple butter and assembly½cup (1 stick) unsalted butter, room temperature4Tbsp. pure maple syrup; plus more for serving (optional)½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1cup pecansVegetable oil (for pan)PreparationbatterStep 1Separate yolks from eggs over a small bowl to catch egg whites. Place yolks in a large bowl. Add buttermilk, pumpkin purée, sugar, butter, ginger, and vanilla to egg yolks and mix with a rubber spatula to combine. Whisk flour, cinnamon, baking powder, baking soda, and salt in a medium bowl to combine, then gently add to buttermilk mixture and mix until dry ingredients are mostly hydrated. Briefly beat egg whites lightly with a fork, then add to batter and mix until completely incorporated. Let batter sit 10 minutes.maple butter and assemblyStep 2While the batter is resting, heat softened butter in a microwave-safe bowl in microwave 10 seconds. The butter should be extremely soft but still pale yellow in color and not melted. Add 4 Tbsp. maple syrup 1 Tbsp. at a time, whisking vigorously after each addition to fully emulsify before adding more, about 2 minutes total. Whisk in salt; set aside.Step 3Heat a large nonstick or cast-iron skillet over medium-low and toast pecans, tossing occasionally, until fragrant, about 5 minutes. Transfer to a plate and let cool; coarsely chop.Step 4Lightly brush same skillet with oil and increase heat to medium. Stir batter, and, using a ⅓-cup measuring cup, scoop a heaping cupful of batter into skillet. Repeat a few more times to fill pan but leave enough room around pancakes to keep them from touching. Cook pancakes until bottoms are golden brown, edges begin to dry out, and bubbles form on surface, about 4 minutes. Flip and cook on other side until golden brown and pancakes are cooked through, about 3 minutes. Transfer to a platter and repeat process with remaining batter, brushing skillet with more oil between batches if needed, until all pancakes have been cooked.Step 5Divide pancakes among plates and top each with a heaping tablespoonful of reserved salted maple butter. Drizzle more maple syrup over if desired and scatter pecans on top.How would you rate Ultra Fluffy Pumpkin Pancakes?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleLOVE these pancakes!  They are my go-to brunch pancake if I want to impress someone.  They puff up and are light and fluffy, and the maple butter sauce is the five-star finisher.  DebraBOrange County, CA1/22/2022Bon Appetit never disappoints. I made these pancakes exactly as directed and they were delicious and fluffy as described. The cinnamon and fresh ginger were noticeable but not overwhelming. The salted maple butter was heavenly. I’ve made sweet potato pancakes that required whipping egg whites in a mixer and folding into the batter, but beating whites by hand was adequate and more convenient than pulling out the mixer. I did beat them until they were frothy and folded into batter rather than straightforward mixing. Carol Brooklyn, NY 1/19/2022Recipe halved very well. Fluffy Best pancakes ever  Flour by weight and rested 10 minutes. Skipped the topping due to nut allergies  but so yummy with plain yogurt and fruit.  Maureen Vancouver Canada 1/16/2022After reading the reviews, I modified a bit.  I used 2 cups of buttermilk, replaced the grated ginger with my usual spices I would put in pumpkins pie, and cooked in an electric skillet at 320 with the cover on. With those modifications, the pancakes are a 5!!AnonymousMaryland1/16/2022I made this based on the instructions (excepting replacing the buttermilk with kefir) and I cooked them at 320F, 3 minutes per side. They ended up very good. I recommend measuring the flour by weight and not beating the egg whites too much in order to prevent the batter from being too thick. The pancakes alone could use for flavor (more spices?) so they really need the maple butter and pecans. MichaelLiberty Lake, WA1/9/2022I made this recipe exactly as the directions said.  The batter was super thick, slippery and (for lack of a better word) \"gloopy.\"  It doesn't behave like regular pancake batter but if you are patient and shape your 1/3 cup pancakes as best you can with this funky batter you will be rewarded with luscious, thick, fluffy and yummy pancakes.  The maple butter is also to die for!  This one is a keeper.Anonymous4715011/13/2021I agree with those who thought the batter was too thick, flour ratio to milk and squash was way off\nwonder what others  did who found the pancakes fluffy, that I don't know about\nmaybe the flour here in dry California is too dry? and needs more liquid?\nJoy of Cooking says 1 1/2 c buttermilk, 1 1/2 c flourkalatoCentral Valley CA11/9/2021Thank you for this wholesome recipe.\nI tweaked it to make it dairy - free\nSubstituted- \nFor butter- coconut oil\nFor buttermilk- coconut milk/ almond milk\nFor tinned pumpkin puree- home-baked pumpkin\nWhite flour- whole spelt flour\nI also ground the spices in mortar+ pestle, adding Cardamom pods\n4 quail eggs\nThe pancakes came out scrumptious. Held together well. Topped with a few drops of ginger syrup snd shredded dates.\nThis is probably a different recipe. Delicious , nutritious , wholesome and satisfying\nJerusalem chickJerusalem Israel11/2/2021I agree with Dan. Made these today and there’s something off about this recipe. I added a ton more milk/buttermilk (2+ cups) and a bit of extra baking powder and it was much better. The first batch before thinning it out took over 30 minutes to cook! Kat DC10/30/2021Made half the recipe just for myself. Wow these are awesome! Fluffy and moist, the best pancakes I’ve ever made! Maybe the 10 minute resting period is the secret? Whatever it is, I’m definitely making these again for guests! Just delicious on a fall morning.Barbara ZWashington DC10/28/2021I have never left a review, but I have also never made such FLUFFY pancakes, so I felt compelled. I prefer a more mild pumpkin spice situation—so this was great, but the spices could definitely be ramped up if that is your desire. Part of me is now wondering if I should open up a bakery and exclusively sell these pumpkin pancakes, so keep an eye out. AnonymousAustin, TX10/27/2021I’m reviewing before I’ve even made! For me, BA is a trusted source for solid recipes - many that rank among our favorites. I have a kid with Type 1 Diabetes and it would be sooooooo nice to have a handy nutritional label for each recipe. Insulin doses are delivered according to carb amounts, and to have nutrition info would make life oh-so-much better. As is, I retype recipes into another website to get the nutritional breakdown. I’d rather be eating…AnonymousHood River, OR10/27/2021This batter was way too thick and stiff. The pancakes were stodgy and not fluffy at all. Comparing this to other recipes, I think it has too much flour. I would not make this batter again.DanBoston10/24/2021if making on an electric griddle what would you set the temperature to?KPKY10/18/2021Very tasty! Well-spiced, and delicious with the addition of the maple butter! AbbyChicago, IL10/17/2021Explore Bon AppétitBreakfastPumpkinSquashVegetableButterPancakeEasyMaple SyrupBrunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-13", "author": ["Condé Nast", "Zaynab Issa"]}