{"id": "957875ab38af0030f2166284f32bfec5", "url": "https://www.bonappetit.com/story/its-that-simple-cocoa-almonds-last-minute-edible-gift", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Cocoa Almonds Are the Last-Minute Edible Gift You Need This Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCocoa Almonds Are the Last-Minute Edible Gift You Need This WeekThey're cheap, they take 15 minutes to make, and they'll make you look like Martha Stewart.By Kat BoytsovaDecember 20, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Frances BoswellFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed. This week: last-minute cocoa almonds!The holiday season is a marathon. Tonight is another party, but this time you didn’t have time to make cookies, or bake a cake, or run out to buy a bottle of nice wine for your hosts. You wish you did—you just...didn’t. Well, guess what? This is the perfect time to make these super-simple cocoa almonds—my favorite last-minute edible gift that is comprised of just five ingredients, and comes together in 15 minutes. I repeat: 15 minutes!First things first: Preheat your oven to 350°. Spread 2 cups of whole raw almonds on a sheet tray and pop them in the oven for about 10 minutes, making sure to give them a toss at about the halfway mark so that they toast evenly. You can tell when they're really done by giving them a sniff—they should smell roasty-toasty and delicious. (You can use already-roasted almonds, but you'll still need to pop them in the oven to heat up a bit; they need to be warm for the coating to stick.) Once your nuts are nicely toasted, transfer them to a medium heat proof bowl and drizzle over 3 tablespoons of maple syrup and ½ teaspoon vanilla extract. Toss them vigorously until each almond is coated and shiny, which will take about two minutes—be patient!Not an almond fan? Other nuts will work here too—just keep an eye on the roasting time.\nPhoto by Ted CavanaughOnce the almonds are all glossy, use a fine mesh strainer to sift 3 tablespoons of powdered sugar over them. (This is my favorite part because powdered sugar is like the sweet equivalent to snow—sing a little Christmas jingle while it floats down over Almond Town!) Now, toss the almonds thoroughly again until each nut is evenly coated in a thick, sugary coating. Dump them back onto the same sheet tray you used to toast them, spread them out, and let them hang out for a few minutes so the syrup has a bit of time to set. Then grab your fine mesh strainer again and sift 1 tablespoon of cocoa powder over the almonds, tossing with your hands to make sure they're evenly coated. And just like that: You're done! If this isn't a good enough reason to start buying almonds in bulk, I don't know what is.The cocoa almonds are best if you let them cool completely before storing in an airtight container, but if you’re in a real hurry you can just go ahead and pack them up (they’ll be cool by the time you get to that party). I love to pack them in a Mason jar and tie a little red ribbon around the lid—a little flair to show you care. And there you have it: a cocoa almond recipe that will ensure you never show up empty-handed to a holiday party ever gain.Looking for a savory edible gift? We got you:Even Lazy People Can Make This Fancy Edible GiftView StoryExplore Bon AppétitBasicallyIt's That SimpleGiftsHoliday GiftsAlmondCocoaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Kat Boytsova"]}