{"id": "95903a88e5e460ce0cf009f9a20d0e5d", "url": "https://www.bonappetit.com/story/smartphone-tripod-mount", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "This Smartphone Tripod Is Actually Very Useful For Connecting With Friends and Family | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Can’t Believe I’m Telling You to Buy a Tripod and Mount For Your Phone, But Here We AreI don’t know how I would have gotten through the last four weeks without this goofy contraption.By Amiel StanekMay 7, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I never thought that I would say this, but I really think you should consider buying a tripod and a mount for your smartphone. Gah! I shuddered just writing that. Because prior to this point, I associated such devices with the cringiest modern portmanteau of a portmanteau: vlogging. (That’s a combination of “video” + “blogging,” which is itself a combination of “web” and “log.” That made me shudder, too!) But we are where we are, living in the shadow of COVID-19, when the stress of being forcibly separated from friends and family in the interest of public health can feel, well, totally heartbreaking. Wouldn’t it be nice to not also have to grapple with the absurdity of balancing your phone against every right-angled surface in your home in an attempt to stay in touch with said friends and family? I hate to say it, but a tripod and a mount...really helps.The Bon Appétit Test Kitchen is Cooking at Home\nIn fairness, I didn’t even buy the equipment I’ve been using—the fine folks on our video team shipped them, along with some other self-taping equipment, to us so that we could continue to crank out that #content while in quarantine. I will admit that I rolled my eyes when I pulled them out of the box. But my gosh I don’t know how I would have gotten through the last four weeks without this goofy contraption. It allows me to position my phone on the counter so that I can cook along with friends, to arrange my parents at table height so it can feel like we’re all sitting and enjoying a drink together, to be able to move freely from room to room on a video chat without having to experiment with every ledge and shelf in my home. And in these strange and uncertain times, that’s big news!You might be thinking to yourself, Hey, this guy said he didn’t even buy these things! How can I really trust this endorsement?! That’s fair enough! But you know what I did do? I bought them for my parents! Because they work. And because they’re worth it. And because I love my parents. And because my mom’s FaceTime videography was giving me vertigo, tbqh. Do with that information what you will.Buy it: Joby JB01507 GorillaPod 3K Kit Tripod, $57 on Amazon, and Joby GripTight Mount Pro, $30 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingRead MorecultureThis Granny Cart Is My Saving Grace Right NowBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Amiel Stanek"]}