{"id": "95945298ee6c4354a79c8fcf1b9202bb", "url": "https://www.bonappetit.com/recipe/pistachio-and-mint-pesto", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Pistachio and Mint Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssuePistachio and Mint PestoBy Janice TiefenbachNovember 19, 20194.5(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintAn herbaceous, zippy pesto to serve with crudités (like this one) or whatever else inspires you. There’s really no way to avoid bruising the mint when blitzing it to a paste in a blender, so don’t be alarmed when this pesto turns a forest-green color. Any leftover pesto will happily transform deeply roasted root vegetables into something worthy of center stage. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.IngredientsMakes about ¾ cup⅔cup raw pistachios⅔cup extra-virgin olive oil1tsp. kosher salt¼tsp. freshly ground black pepper2cups (packed) mint leaves, plus more small leaves for serving½oz. finely grated Parmesan (about ½ cup)½lemonPreparationStep 1Preheat oven to 350°. Toast nuts on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool. Finely chop 1 Tbsp. nuts and set aside.Step 2Blend oil, salt, pepper, and remaining nuts in a blender until nuts are finely ground. Add 2 cups mint and blend until a coarse purée forms; season with salt and pepper. Transfer dip to a small bowl; stir in Parmesan.Step 3Just before serving, squeeze juice from lemon into dip and stir well. Scatter some mint leaves and reserved toasted nuts over.How would you rate Pistachio and Mint Pesto?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleSorry left review for the wrong recipe. It was for lamb meatballs & mint pesto. Sorry ToonooSyr ny10/25/2021Loved it!   One bite might get you a little more garlic, another more mint, even the parsley is a nice surprise and the  the raisin . I was told to keep this one so it just wasn’t me.making it was easy & baking it made it not greasy.ToonooSyr ny10/25/2021Very good, very easy pesto, perfect for a quick summer dinner. I halved the recipe, subbed basil for mint since that's what I had, and tossed with pasta and it turned out delicious! Want to try again with mint. AnonymousPhiladelphia8/1/2021Came here to say DO NOT SKIP OUT ON THE LEMON! Step 3 read like an optional garnish/flourish for me, but it wasn’t until I added about half a lemon’s worth of juice that the flavors fully came together with that irresistible “let me just try one more bite” quality. The flavors meld even more as it sits in the fridge. AnonymousChicago, IL7/15/2021I haven't made this yet but I bet it would be spectacular with lamb...CarswellCanada6/15/2021This is totally freakin' delicious. Used it as a dip for cauliflower, carrots, radishes, fennel, and endiveacookfromdetroit1/3/2020Explore Bon AppétitSauceDipPistachioNutMintHerbs & SpicesQuickEasyMainVegetarianGluten-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}