{"id": "9595e4a2cf68592f65defb2649eb3b6b", "url": "https://www.bonappetit.com/story/what-is-coconut-milk", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "What Is Coconut Milk? And Are You Using the Right Kind? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopbasicallyWhat Is Coconut Milk? And Are You Using the Right Kind?There are a few types of coconut milk on grocery store shelves. Here’s what you need to know about the differences, and our favorite brand for cooking.By Alyse WhitneyOctober 2, 2018FacebookTwitterEmailFacebookTwitterEmailThis we know: You can't milk a coconut. So what is coconut milk, exactly? Well, it’s not milk in the dairy sense, but close to its level of creaminess. It is basically just shredded coconut flesh that is pureed with water and strained to create a rich, shock-white liquid that can lend body, flavor, and richness to soups, curries, wilted greens, and much more. The kind for cooking typically comes in a can, and differs a lot from the cartons of non-dairy \"milk substitute\" that people use for smoothies and cereal. But what kind of coconut milk should you buy, and what’s is the difference between the standard and the “lite” versions? And what about coconut cream?! We’ve got answers for you.Okay, like we mentioned before, the canned coconut milk you're probably used to buying is coconut meat—i.e., the white stuff inside a coconut—that has been mixed with some water and blended until smooth, sometimes with the addition of a stabilizer like guar gum. When you crack open a can, there’s often a layer of solid white stuff at the top, which is what's known as \"coconut cream,\" and is the richest part of the equation, containing more fat and protein than the milky-looking liquid it is sitting on top of. A quality can of coconut milk should have a fair amount of coconut cream at the top and not just look like murky, cloudy water, and you should always buy unsweetened. Our go-to brand is Thai Kitchen Organic Coconut Milk, because it has the most clean, pure coconut flavor of all the brands we’ve tried and a nice amount of fat. You can shake the can up to combine the cream and the milk, or just dump it into a pot and stir—it will come together in the cooking process.So when we're talking about coconut milk, that's what we're normally talking about. But there are a few other products that you might come across while shopping that are worth knowing about. For one, you will sometimes be able to find cans labeled \"coconut cream,\" which, as you might guess, is richer and fattier than your standard issue coconut milk—it’s just a whole can filled with the extra-rich stuff that floats to the top of a normal can of coconut milk. It’s pretty decadent, and can sometimes be used in the place of regular coconut milk, but be careful: It is a lot thicker and contains less water, so it might screw up the hydration level in a baking recipe.And then, confusingly, there's cream of coconut, which is a different thing entirely. Cream of coconut is also made from pureed coconut meat, but is blended with a ton of sugar, and is normally used for sweet, rather than savory, applications—think blended drinks like piña coladas. There's nothing wrong with cream of coconut per se, but you definitely do not want to accidentally use it in the place of regular coconut milk in, say, a curry dish, unless you want it to taste like dessert.Coconut-Curry Braised Chicken Thighs, anyone?\nPhoto by Caleb AdamsFinally, there's also something out there called “lite coconut milk,” which is essentially the two-percent milk of coconut milk. It’s pretty much the opposite of coconut cream—it has less fat than regular coconut milk, and tends to be more watery-looking in the can. Companies will often add a bunch of extra stabilizers and weird things to products like these so they’ll look more like the genuine article, but those additives can sometimes contribute funky or otherwise off flavors, so we avoid whenever possible.So yeah: Coconut milk is a very good thing, as long as you get the right stuff. It can add big flavor and richness to braised meats (like these chicken thighs or slow-roasted short ribs), a big pot of dal (made with lentils), or pretty much any soup or stew-y thing that wants a little something-something. Keep a can or two in your pantry and be ready for a flavorful dinner anytime—you’d be coconuts not to.Go forth and coconut milk!Coconut-Curry Braised Chicken ThighsThis simple, big-flavor chicken thigh dish is a great intro to the fundamentals of braising—once you've got the method down, you can braise just about anything.View RecipeExplore Bon AppétitBasicallyCoconut MilkCoconut CreamRead MoreWhat Is Coconut Cream Anyway?By Emma WartzmanThese Noodles Are My Weeknight Feeling-Like-a-Zombie DinnerBy Alex DelanyCoconut-Ginger Chickpea SoupShrimp and Coconut Curry with Rice NoodlesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast Spotlight© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Alyse Whitney"]}