{"id": "95a246096939b2bb5c90f4827988f758", "url": "https://www.bonappetit.com/story/eda-rhyne-distillery", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "At This Appalachian Distillery, Eda Rhyne, Moonshine Could Be Medicine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAt This Appalachian Distillery, Moonshine Could Be MedicineEda Rhyne wants to turn North Carolina’s legacy of bootleggers and herbalists into a source of pride—and a new generation of complex liqueurs.By Mark JohansonSeptember 23, 2021FacebookTwitterEmailEda Rhyne co-owners Chris Bower and Rett Murphy inside the distillery's tasting roomPhoto by Jack SorokinFacebookTwitterEmailSnake down the knobby Appalachian hills of the Blue Ridge Parkway into the city of Asheville, detour toward the historic Biltmore Village, and you might just find yourself at the warehouse-like distillery of Eda Rhyne. Inside you’ll see a giant mural from local artist Hannah Dansie depicting the distillery’s namesake: a woman from an old ghost story that takes place in neighboring Haywood County. Rest your bones on a vintage bubblegum pink sofa and toss back a $6 cocktail fueled by earthy amari. If you experience the drink the way Eda Rhyne hopes you will, a few sips could send you right back to the fragrant forests and fields of wildflowers in those loamy hills above, whose blue-tinged silhouettes now curve across the horizon.Asheville is a forward-thinking mountain town in western North Carolina that thrives on both defying Appalachian stereotypes and holding them up to a mirror. At Eda Rhyne that means confronting Appalachia’s notorious history of illicit distilleries, which pump out high-proof moonshine for humble but proud mountain folk. What’s far less known, yet no less significant, is that some of that same liquor was traditionally syphoned off for a local medicine maker. Each hollow would have one, and they’d build up a rainbow of medicinal spirits by macerating local flora in alcohol to extract its remedial properties.Eda Rhyne co-owner Chris Bower wants more people to know about that second part of the story. He says it’s been suppressed over the years as outsiders made locals feel ashamed for their folk remedies—a shame he wants to turn into pride by selling the spirits online nationwide. Bower hails from a crafty cast of family characters that includes moonshiners, bootleggers, and matter-of-fact herbalists with a stubborn affection for these ancient hills. Even his grandparents, who he says were teetotalers, had a cabinet at their rural Haywood County home with mason jars of corn liquor, which they only touched for medicine-making.“I started learning about local edible medicinal plants as a young kid from my pappy and my grandmother,” Bower says. His grandparents treated the area’s hollows and hills like a pantry, searching for the 1,100-odd Appalachian plant species historically foraged for their medicinal properties. As a young adult he apprenticed to make liquor in the woods, following “old-timers or hippie mommas” as they transformed barrels of golden corn mash into a transparent spirit so fierce it’d burn your throat going down. With each run, he says, he’d drop in a few foraged finds.That interest in medicinal Appalachian spirits eventually led Bower to Rett Murphy, an organic farmer turned distiller who also has some outlaw blood in his genes. (His great-grandmother, Alma Pinnix, was a famed guerrilla gardener before the term even existed.) Murphy had a similar madcap idea to commercialize traditional herbal liqueurs the way amaro makers have in Europe with products like Campari, Cynar, and Ramazzotti. If these kinds of folk spirits were celebrated across the Atlantic, why couldn’t they have a similar fate in America too?The pair opened Eda Rhyne Distillery in 2018 to design craft interpretations of traditional herbal liqueurs, pairing heirloom corn and grains with sustainably harvested botanicals from the surrounding Blue Ridge Mountains. By law the co-owners can’t—and won’t—make any claims about the medicinal qualities of their line of eight spirits, “but a lot of the plants we use have been used traditionally as folk medicine,” Bower assures, including elderflower (for relief of flu symptoms) and rhubarb (for digestion).Like the Carthusian monks of the French Alps who carefully guard the ancient recipe of 130 herbs and plants that go into Chartreuse, Murphy and Bower are similarly bound by a vow of silence about the foraged finds that fuel their Carolina amari. Some spirits, like the Rustic Nocino, have tidier profiles steered by a star ingredient (in this case, wild black walnuts). Others, such as the marvelously complex Amaro Flora, pair the earthy bitterness of roots and tree bark with a fragrant spritz of mountain flowers, sending your taste buds tramping into the bountiful Appalachian backcountry.“Every bottle has a batch number on it, which I think is important because they are all a little bit different,” Murphy says. “That’s because the plants we deal with are not just seasonal; we’re working with nature, so the plants change flavor characteristics every year.”That annual variation is perhaps most evident in Eda Rhyne’s top seller, the Appalachian Fernet, a witch’s brew of over 30 Carolina herbs that hit the market right at fernet’s hipster height in 2018. This local take on the classic Italian digestif is the bottle that first landed the Asheville distillery on shelves beyond the Carolinas. You can now find it, as well as some of its other spirits, at liquor stores in seven states and online. Web sales began this month and bottles are now shippable to more than half the country.“When people come from New York or Argentina to try this fernet, they say it’s completely different,” says Bower, explaining that the inky black spirit is not as overtly minty as your typical Fernet-Branca, since the wild mints of Appalachia are quite subtle.“Not only are we using our local plants, but the profile and character of the spirits we make are more rustic,” Bower adds. “They’re more folky. They’re like our mountains. They’re not super refined. They’re not super sweet. They’re very much in the tradition of the terrain in which we live, which is rugged and rustic.”Amassing ingredients for these rustic spirits is an austere endeavor. Bower and Murphy, for instance, carve paths into the forest each spring to pick young Lindera benzoin (spicebush) leaves, which the Cherokee (whose ancestral knowledge informs much of Appalachia’s traditional medicine) have long used for colds, rheumatism, and anemia. The leaves, which will be vapor-infused into a vodka, have to be plucked in the dank, dewy air of early morning before the sun hits in order to lock in their piquancy. Murphy explains that these meticulous harvesting habits, which he calls wildcrafting, are “all about finding the greatest expression of flavors we have here in the mountains.”Eda Rhyne also researches historical crops to try and bring back flavors that are disappearing across Appalachia. The base ingredient in its rye whiskey, for example, is Seashore Black, a rye varietal common across the South up until about a century ago when most grain production moved north. Slow Food USA, a grassroots organization founded to prevent the disappearance of local food cultures, rediscovered this nutty grain on Wadmalaw Island, South Carolina, in 2016. Soon after, Eda Rhyne bought it all up to create a whiskey that Murphy says has “some harking back to what it would have tasted like if you got a homemade rye whiskey made around here a hundred years ago by your neighbor.”Eda Rhyne is not only taking inspiration from what it calls the “ancient art of the hills” and bringing it to the masses; it’s out to reset narratives about Appalachia and its people by casting its difficult terrain as a therapeutic landscape and its historic outlaws as mavericks. It’s sustainably growing native ingredients on a local farm and making folk knowledge a point of pride, bottling up ideas passed down from generation to generation and sending them off to big city liquor stores. The hope is that outsiders can see the value—both gastronomical and (possibly) medicinal—in the evocative flavors of the Appalachian terroir.Explore Bon AppétitCultureTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-23", "author": ["Condé Nast", "Mark Johanson"]}