{"id": "95a8a729913cee38a937cc29340e8db5", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/botanica", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Botanica Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesBotanicaSpend the whole day in Silver Lake at this breezy, vegetable-laden all-day spotFacebookPinterestTwitterEmailGentl and HyersGO: for chef-owners Heather Sperling and Emily Fiffer’s abundant vegetable-focused spreads and one of the best outdoor patios in the city. Botanica has it all.ORDER THE:  grilled lamb kebabs covered in a giant salad and the seasonal tartine, which could include caramelized leeks, smoked eggplant, or seared mushrooms since the menu changes often. In the morning, we love the gluten-free teacake, served warm with roasted fruit and organic whipped cream, and the Turkish eggs are everything we want in a savory breakfast: a lemon-soaked salad, yogurt, poached eggs, and the most luscious cornmeal focaccia hiding underneath it all. Oh, and did we mention natural wine? That’s the name of the drinking game here. Let the expert servers guide your way.WORD TO THE WISE: The shop in the front is more than just eye candy. Take home a bottle of pét nat, some loose leaf tea, or a jar of their homemade granola that’s to die for. And just try to resist the gluten-free oat cookie with smoked cinnamon staring at you in the pastry case.THE VIBE IS: understated Silver Lake cool: Everyone is beautiful in an “I woke up like this” way. But don’t be intimidated; the staff couldn’t be friendlier, and the long, airy space is as perfect for a solo breakfast as it is for a romantic date.PRACTICAL STUFF:  The restaurant is open every day: 9 a.m. to 2:15 p.m. for lunch, and for dinner, 5:30 to 10 p.m. Monday through Thursday and Sunday and 5:30 to 11 p.m. on Friday and Saturdays.  The market, which serves coffee, baked goods, and specialty grocery items, is open from 9 a.m. to close every day. Reservations can be made through Resy or by phone.—Amanda ShapiroBrandon HarmanGentl and HyersWE ALSO LOVESqirlIt’s not a restaurant, it’s a Silver Lake community with a major cult followingNight + MarketThai street food, Sunset Boulevard-styleTrois FamiliaWhere Silver Lake goes for French-Mexican-Californian brunchExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}