{"id": "95b5e3db75a251d0b8373f06587d620d", "url": "https://www.bonappetit.com/recipe/grilled-potato-salad-with-chiles-and-basil", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Grilled Potato Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Potato Salad With Chiles and BasilBy Molly BazAugust 12, 20194.9(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl Jones, Plate by Heath CeramicsEmailPinterestPrintEmailPinterestPrintThis dish is everything we love about a German potato salad (bright vinegar, fresh herbs, a little heat), plus the added benefit of a grilled, smoky, char. The still hot-off-the-grates spuds get tossed in dressing that’s equal parts spicy, sweet, herbaceous, and nothing sort of addictive. If you don’t have access to a grill, fear not—simply char the potatoes and onions in a cast-iron grill pan.Ingredients4 servings2lb. baby Yukon Gold potatoes½cup kosher salt, plus more⅔cup unseasoned rice vinegar3Tbsp. fish sauce1Tbsp. honey¼cup plus 3 Tbsp. extra-virgin olive oil, plus more for drizzling2red Fresno chiles, thinly sliced1large red onion3garlic cloves2cups basil leaves2Tbsp. toasted sesame seedsPreparationStep 1Cover potatoes with 3 qt. water in a large saucepan. Stir in ½ cup salt. Bring to a simmer over medium-high heat. Reduce heat to medium and continue to simmer until potatoes are just tender when pierced with a skewer or paring knife, about 12 minutes. Drain and let cool slightly.Step 2Meanwhile, prepare a grill for medium heat. Whisk vinegar, fish sauce, honey, and 3 Tbsp. oil in a small bowl. Stir in chiles. Season dressing with salt; set aside.Step 3Cut onion in half through the root, then cut each half into 5 wedges so that they’re still held together by the root.Step 4Finely grate garlic into a large bowl. Whisk in ¼ cup oil. Add onion wedges to bowl. Smash potatoes lightly with your hands as you add them to bowl, tossing gently to coat with garlic oil. Season with salt.Step 5Grill potatoes and onion wedges, turning occasionally, until charred all over, 12–15 minutes. Wipe out bowl you tossed the potatoes in, then return potatoes and onions to bowl when they’re finished grilling.Step 6Pour dressing over potatoes, tossing to coat. Add basil (tearing any large leaves in half) and sesame seeds. Taste and season with salt if needed, then toss again to combine.Step 7Transfer potato salad to a serving bowl. Drizzle with oil.How would you rate Grilled Potato Salad With Chiles and Basil?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleYummy.  I used medium sized redskins, and they worked.  I accidentally added the garlic, and all veggies to dressing, before grilling, and it was good, but too salty.  My fault.  So still 5 stars.  I cannot wait to try this as written, as it all worked, and the potatoes were crispy and the whole dish presented beautifully!!  Other reviewers state that the dressing makes too much.  True.  But it can always be used on grilled chicken thighs the next day!!  KristiColumbus, Ohio7/7/2021This is soooo good. Might want to add the onions a little later to the grill or make sure they're on top in the first minutes, because they char way faster than the potatoes. Dressing is A LOT, and it is very much on the sour side of things, maybe a liiiitle too much, but that could also be my because of the brand of vinegar I used.  CarlyAmsterdam1/14/2021Any thoughts on making this ahead of time to bring to a party and serving at room temp a couple hours later? Wondering how the texture would be. Has anyone tried it?Anonymous9/4/2020I made this exactly as written and it was truly perfect. One of the best potato salads I’ve ever had and it will definitely be in my regular rotation!! AnonymousPortland, Oregon4/17/2020This made way too much dressing for the potatoes, but just added about 1/2 of it and it was delicious. Used a cast iron to “grill” it on the stove top and get those nice chars. Fav potato dish I’ve made so far AnonymousSan Francisco 4/3/2020I just made this for Labor Day weekend with a guest for dinner. I had to make a few changes--don't own a grill, so I roasted the potatoes and onion in a 400 degree oven for about a half hour, turning them over once. I also had to use what I had in the house, so used a couple of mini sweet peppers for color and a Thai chili for heat. Both changes worked, and the dish was a hit. Would definitely make it again.j_ellisChicago, IL9/2/2019Explore Bon AppétitSaladPotato SaladPotatoVegetableFresno ChileChileBasilHerbs & SpicesYukon Gold PotatoSummerEasyWeeknight MealsSideDairy-FreeGluten-FreeGrillingFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-12", "author": ["Condé Nast", "Molly Baz"]}