{"id": "95b6e738f9cbf85f25ab3082956af42d", "url": "https://www.bonappetit.com/story/kamal-mouzawak", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Kamal Mouzawak Is Lebanon’s Celebrated Restaurateur-Hotelier-Humanitarian | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKamal Mouzawak Is Lebanon’s Celebrated Restaurateur-Hotelier-HumanitarianWith his network of restaurants, B&B’s, and Beirut’s first farmers’ market, the entrepreneur aims to showcase the diversity of Lebanese cuisine, and support the women who make it.By Andy BaraghaniMay 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmail“I know that a difference can be made by doing small gestures rather than preaching,” Kamal Mouzawak says while sipping on a glass of arak, the anise-flavored spirit from the Levant.Though I would argue his gestures are not so small, they are certainly making a difference. Over the past 15 years, Mouzawak has built bed-and-breakfasts, restaurants, and Beirut’s first farmers’ market with one goal: to create places that unite and give voice to Lebanese people from different faiths and political backgrounds, especially women.Mouzawak restored Beit Douma with his partner of 20 years, fashion designer Rabih Kayrouz.\nPhoto by Alex LauThe inn’s personal decor makes it feel as though you’re in someone’s (very stylish) home.\nPhoto by Alex LauAt the farmers’ market, Souk el Tayeb, I met a woman named Mona al-Dorr selling her man’oushe, a puffed flatbread speckled with za’atar that she had made at home for years before finding an outlet at the souk. I saw Nada Saber, who was selling jars of hot-pink pickled turnips, known as mouneh, or Lebanese preserves. There were Muslim women alongside Christian women, working together to highlight the culinary traditions of Lebanon.The souk spawned Mouzawak’s first restaurant, Tawlet, where each day one woman sets the menu with dishes from her respective region, like kibbeh basaliyehl from Kfardlekous in northern Lebanon, made with bulgur, caramelized onions, and pine nuts. Since Tawlet Beirut opened in 2009, Mouzawak launched four more restaurants, providing jobs and a platform for women all over the country. “I want people to know that this lady—and all the ladies of the Souk el Tayeb and Tawlet—now have a role outside of being a wife or mother,” says Zeinab Harb Kashmar, one of the cooks at Tawlet, through a translator.BA’s Andy Baraghani with Mouzawak.\nPhoto by Alex LauOne of Mouzawak’s latest projects is more dream house than do-good venture, but it serves an important goal just the same. It’s Beit Douma, a five-room 19th-century bed-and-breakfast that Mouzawak restored in the town of Douma, one of Lebanon’s best-preserved historic villages. Situated on a hillside 90 minutes from Beirut, Beit Douma prizes local items on its menu as well as in its decor. “Beit Douma gives you a sense of place. The cover on your bed is from the village of Douma. The wine you’re drinking is from the area. The dessert is made by [the manager] Sarah’s mom,” he says. “It should serve as an embassy of pride for the region.”The lunch rush at Tawlet Beirut.\nPhoto by Alex LauUpstairs at Beit Douma. The textiles, prints, pillows, and dishes are sourced from the region.\nPhoto by Alex LauWhen I visited, I cooked alongside Tawlet’s executive chef, Andrea Bouez. Many of the dishes we made—cinnamon-dusted lamb chops; a crunchy cabbage tabbouleh with piles of mint and parsley; marinated chicken skewers served atop flatbread—originated from the women who work at the restaurant and Souk el Tayeb. (Get all the recipes here.) Each dish did more than feed us. It honored the unique backgrounds of the individual women who developed them, while celebrating the larger cultural heritage of the country as a whole.Below, four women cooks share their stories.Photo by Alex LauMona El Dor (Oum Ali)“I’ve known Kamal for 18 years, and was one of the first women to work with him at Souk el Tayeb when it opened in June 2004. It started out really small, with just 10 stands. At first I was working on my own in the stall, selling my mouneh—jams, labne, olives, and other Lebanese preserves—and later man’oushe, flatbreads, which I had been making at home for years. Business started really slow; no one was coming at first. I was even throwing bread away. But then it started to pick up as word got around. Kamal got more women open stands, and seven months later, it moved to downtown Beirut. Now there are more than 80 stands at Souk el Tayeb on Saturdays. At my stall, I have four women to help me with the breads and pastries, and you have to wait in line for an hour and a half for my man’oushe. All the demand meant I could open a shop in Beirut, Oum Ali—my nickname, “mother of Ali”—and collaborate with other restaurants in the city who want to use my breads.Since I started working with Kamal 15 years ago, I’ve been able to live the life I’d always dreamed about. I grew up in Majdelzoun, a village in the south of Lebanon, and I didn’t want my four kids to live there, to receive a poor education. Joining Souk el Tayeb and Tawlet enabled me to bring my family to the city and to put my kids through school. I always wanted to be the person who studied everything, but I couldn’t. I’m very happy to be able to do this for my kids.”Photo by Alex LauNada Saber“For years my husband and I had a small food shack in the village of Kherbet Kanafar, in the Bekaa Valley, but we had to close down when the bombings started in 2005. He went to work with my brother doing interior design, and I kept making my mouneh at home. A friend told me that she knew someone who had a souk, and that she wanted to introduce me to him. Kamal checked out my samples and told me, ‘You’ll start next week.’ Over time, I increased our quantities to meet the demand—my husband even left his job to work with me at the stand. Even with the bombings, we didn’t stop the souk for a second. Everything else was shut down, but we opened every week, no matter what. The souk grew up, and I grew up with it.”Photo by Alex LauGeorgina El-Bayeh“I used to spend all my time at home, just visiting with all the other ladies of my village of Kfardlekos. My husband worked, and I raised the kids. Since joining with Tawlet in 2009 and then Souk el Tayeb after that, it’s all shifted. Now I’m the one who works. I’m the one that supports the household. I was even able to open my own storefront in my village, Georgina’s Kitchen, where I prepare and sell the things I make. (My specialty is kebbeh and stuffed vine leaves.) Working here has turned me into a super star; I have my own fan base at the restaurant! One of the biggest highlights for me was going to Copenhagen for the MAD food symposium, and cooking with René Redzepi. There we were, 20 home cooks, with hundreds of Michelin-star chefs from around the world. We were very proud to be among them, showing off Lebanese food.”Photo by Alex LauZeinab Harb Kashmar“Before I met Kamal, I worked with other women making mouneh in the village of Halloussieh, in the city of Sour. Our cooperative was known for our olives, and when Kamal heard of them, he offered us a stall at Souk el Tayeb. In the beginning, Kamal would come by and taste our olives; then he started to buy them to use at Tawlet. One day, about five months into my time running the stall, he asked me to come cook at the restaurant. I was scared. I didn’t know how to cook professionally. He told me, ‘The way you cook for your kids, you’re going to cook here.’I’m fully Lebanese, but since working with Kamal, I’ve learned so much about Lebanon and the different ways of cooking—including many of the forgotten dishes from my own village. My menus at Tawlet are all about trying to reintroduce them, to preserve the traditions and keep them alive. Before this, I had nothing to do. Now I have a presence, a role in the city. This lady—and all the ladies of the Souk el Tayeb and Tawlet—is not just a wife sitting at home.”Explore Bon AppétitLebanonRead Morerecipes7 Recipes For a Truly Flavorful Lebanese FeastGallery7 SlidesBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-15", "author": ["Condé Nast", "Andy Baraghani"]}