{"id": "95c0f2d26e553390cafde1d99eeb6101", "url": "https://www.bonappetit.com/story/bellocq-turmeric-chai-tea", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "This Turmeric Chai Tea Is My Proven Winter Coping Mechanism | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Turmeric Chai Is My Proven Winter Coping Mechanism I stash a packet in my desk drawer for sniffly mornings, gloomy afternoons, and any other time I need a boost that doesn’t come from an espresso machine.By Aliza AbarbanelDecember 4, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Last winter, when weeks of icy sidewalks and wooly socks torpedoed my soul, I turned to tea. I drank endless mugs of genmaicha and oolong, attempting to distract myself with warm liquids and unfamiliar blends. It wasn’t as good as a tropical vacation, but it got me through March.I flirted with iced tea throughout summer, but now that I’m officially back on bad terms with the weather forecast, I’m re-upping my tea stash with sachets of yaupon, assam, oolong, and Bellocq’s Canyon Chai.Usually, my qualification for a good varietal of tea is that it must have caffeine. (Going to bed early is not one of my virtues.) But I make an exception for Bellocq’s light and sunny turmeric-based chai, which is lifted by a highly aromatic blend of rose hips, cardamom, ginger, and smoked black pepper. While it’s not as punchy as your typical black tea-based masala chai, it’s still spicy and floral—and very good with a splash of oat milk (or whatever milk you prefer). And while I don’t get that all-important jolt of caffeine after downing a cup, I also don’t feel jittery if I follow up that cup with several more. That’s a blessing, because this blend is good for two steeps per serving.Right now, my desk drawer is stocked with it, ready to answer the call of sniffly mornings, gloomy afternoons, and any other time I need a boost that doesn’t come from an espresso machine. Still, I plan on bringing home at least a bit of the loose leaf blend to mix into hot toddies. If that’s not a good winter preparedness plan, I don’t know what is.Buy it: Bellocq No. 121 Canyon Chai, $17 at Bellocq TeaAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendTeaShoppingRead MorecultureThe Spice Collection That Saved Me When I MovedBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-04", "author": ["Condé Nast", "Aliza Abarbanel"]}