{"id": "95c1d3a1a552c61312683f314fd4208a", "url": "https://www.bonappetit.com/story/crispy-meatballs-weeknight-secret-weapon", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Ground Beef Meatball Recipe Is My New Weeknight Dinner Secret Weapon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Crispy Meatballs Are My New Weeknight Secret WeaponRoast 'em hard-and-fast on a single sheet-pan and drizzle with zippy salsa verde for dinner success.By Aliza AbarbanelOctober 24, 2018FacebookTwitterEmailFacebookTwitterEmailI’m not a vegetarian, but I’m definitely not a do-or-die carnivore either. I’ll take a baby steak over a hulking rib eye any day, and most of the time I’ll opt for crispy glazed tofu over either. My meat philosophy is simple: Use meat as a seasoning in a dish, not as the dish. These crispy beef meatballs, which pair ground beef with crunchy chopped walnuts, briny capers, and plenty of herbs, neatly fit the bill. They come together in no time, and are a delicious, economical, all-purpose protein that can round out any otherwise plant-based meal.Meatballs may have a rep for being stodgy and taking forever to cook, but these crispy little guys are a whole different breed than the spaghetti-dwellers you may have encountered before. (No shade intended—Sunday Supper, I’ll always love you!) I’d even dare to call 2018 ‘The Year of the Meatball’ here at BA, where we like ‘em golf ball-sized and paired with a bright herby sauce. Here's how these come together.Before you do anything else, preheat your oven to 425° and arrange a rack in the middle. We’re going to prep two things at once here—the meatball mix and salsa verde—so grab two bowls and grate a garlic clove into each. Finely chop up any mix of herbs that gets you going (I went with dill and basil) and split the pile between the bowls, then do the same for capers. You’ll need to chop up some walnuts too, but save those all for the meatball mix, where they’ll add a fun layer of texture and nutty flavor.Now it’s time to bring the meatballs together by adding an egg, paprika, salt, oil, along with a cup of panko breadcrumbs. Mix with your hands, then add the beef and continue to mix gently until it’s incorporated but not overmixed. If you work the mixture too much, the meat will become tough and springy, so be gentle. If you want to check your meatball seasoning, now is the time! Pinch off a little piece and crisp it in a skillet to give it a taste. Once you’re happy with the flavors, drizzle some olive oil onto the sheet pan, roll the meatballs into golf ball-sized balls, and into the hot oven they go.Another thing I love about this recipe: It’s ridiculously fast. These meatballs only need to bake for about 10 minutes or so. Set a timer, and give the pan a shake halfway through to encourage crispy browning on all sides. While the meatballs cook, you can finish the salsa verde by adding lemon zest, lemon juice, olive oil, salt, and pepper. Don’t be afraid to add more lemon juice or salt if the flavors aren’t quite there—you want a bright, punchy sauce to stand up to the meatballs. When the meatballs are done, transfer them to a platter and serve with that salsa verde on the side for drizzling.Nobody will fault you for eating these crispy meatballs straight-up, but they’re a versatile ingredient for countless other meals too. Use them to anchor a grain bowl, round out a noodle-y soup, or add some heft to a plate of roasted veggies. Share them with friends, or hoard them all for yourself and eat them for lunch all week. Just know that when the first batch runs out, round two is never that far away.Get the recipe:Crispy Sheet-Pan Meatballs With Salsa VerdeThe quickest, most fuss-free and delicious meatball recipe that ever was or will be.View RecipeExplore Bon AppétitBasicallyMeatballGround BeefSalsa VerdeRead MorecookingThis Genius No-Soak Black Bean Soup Makes Its Own Delicious BrothBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-23", "author": ["Condé Nast", "Aliza Abarbanel"]}