{"id": "95c5edfe2b66306247cc5c9a971958c0", "url": "https://www.bonappetit.com/story/beet-pesto", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "Beet Pesto Is Easy to Make With Roasted Beets, Olive Oil, Garlic, and Parmesan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Beet Pesto From That One Shriveled Beet Haunting Your RefrigeratorYou know exactly which beet we’re referring to.By MacKenzie Chung FeganMarch 7, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat BoytsovaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we talk you through the dishes and drinks we make with our eyes closed. Today, beet pesto.I always have one more beet than I need. Whether I’m making pickled eggs, a vegetarian reuben sandwich, or a rich chocolate cake, I always end up with an extra beet rattling around in my vegetable bin. Some may blame my winter CSA, others may blame dark magic—but there it sits, growing progressively smaller and more shriveled as it languishes, the Miss Havisham of root vegetables.My solution is beet pesto. It’s earthy, it’s savory, it normalizes eating pesto in winter. The taste is familiar—your picky kid just might eat it—but with unexpected depth, sweetness, and color. It freezes well, and if you have a white farmhouse sink, it will look like the scene of a bloody crime. Dramatic!Here’s how to make beet pesto:Preheat your oven to 375°. Wrap your forgotten beet in tin foil—no need to peel—and pour in 1 Tbsp. olive oil and sprinkle with salt before sealing it tightly. Roast the beet until a paring knife easily pierces it. The cook time will depend on how large your beet is, but start checking after half an hour. Be careful as you unwrap the foil as steam will escape.Once your beet is roasted, let it sit, unwrapped, until cool enough to handle. The peel should come away easily with a little help from a paring knife. Roughly chop the peeled beet into large cubes and add to a food processor with 1 garlic clove, 2 large handfuls of basil, a couple ounces of Parmesan cheese, and salt. Blitz the ingredients, adding olive oil through the feed tube until everything comes together and looks like pesto—the exact amount will vary depending on the size of your beet(s).As with any non-recipe recipe, beet pesto is endlessly customizable. Add nuts if you have them—any kind will work, but I’m partial to cashews or pistachios. If I have soft goat cheese on hand, I’ll throw some into the food processor and watch as the mixture turns a gorgeous creamy pink. Have two sad neglected beets? Your pesto will be beet-ier. Did your Aerogarden deliver a bumper crop of basil? It’ll be brighter and herbier.As for serving, toss beet pesto with pasta, swirl it into Greek yogurt, and top it with a fried egg, plate it with pretzels and crudités for dipping, slather it onto crostini, or spread it onto the bread of your grilled cheese sandwich. It’s so versatile that you just might find yourself buying extra beets on purpose.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-07", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}