{"id": "95cf91aa6b0839cdbcfd95435797bce5", "url": "https://www.bonappetit.com/story/carbonated-coffee-drink-espresso-orange", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "The Carbonated Coffee Drink Your Morning Actually Needs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHere’s the Carbonated Coffee Drink Your Morning Actually NeedsThe Spritzy Americano is not a coffee tonic, thank you very much.By Alex DelanySeptember 26, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailHave you ever made a personal discovery that led you to believe—for a brief sliver of time— that you were a genius, a radical free thinker that had blazed a ferocious trail into the unknown? A few years ago, I started making a coffee drink that I call the Spritzy Americano, a mixture of seltzer, espresso, and orange juice. For a second, I thought I was a trailblazer, but then I moved past my delusions of grandeur and realized that people have probably been making a carbonated version of the Americano for quite some time.And they have. Espresso soda has been a thing in the Americas since the 1800s and even earlier than that in Europe. But the more I posted it on Instagram and carried it around the office, the more people asked me what the hell I was drinking. The citizens were curious.Espresso and orange give the Spritzy Americano its flavor.\nPhoto by Chelsie CraigThe Spritzy Americano is a straightforward, refreshing, lively way to start—or keep moving through—your day. This is a cold, balanced, bitter beverage. Now, before you think, Ooofff, bitter? Bad coffee is bitter. Plain baking chocolate is bitter. Burnt Garlic is bitter. I hate bitter. No. Thank. You. Sir, let me clarify. The Spritzy Americano is bitter in the way that a Negroni, a bar of beautiful dark chocolate, or a complex Italian amaro is bitter. The bitterness is an integral part of the beverage, balanced by the other elements, in this case, sparkling water, orange juice, and orange peel.Most specialty mixed coffee drinks are sweet. Frappuccinos are milkshakes. Coffee tonics had their moment. Lattes topped with cinnamon and nutmeg and pumpkin shavings exist. This is not a coffee tonic or a milkshake or a declaration that the seasons are changing. The Spritzy Americano is not any of that. Here’s how you make it:You want approximately 5 oz. of seltzer water, 2 oz. of espresso, and 2 oz. of fresh orange juice. This lineup is flexible, but being within ½ oz. of those measurements will give you the right balance—just enough sweetness from the orange juice, and a body that feels neither thin nor sludgy. The texture of the Spritzy Americano is smooth and lightly carbonated. If you’re the type of person who needs a sweet coffee beverage, a splash of simple syrup is acceptable.This is going to get a little nerdy for a second, but the temperature of the liquids matter here. You don’t want to use cold seltzer. You should use room temperature seltzer that is poured over ice. Room temperature water will not shock the espresso when you add it to the Americano. Shocking the espresso with cold water will bring out intensely bitter flavors in the coffee, masking the fruity, roasted chocolate flavor. Letting the espresso and the seltzer cool together will make for a better drink. The liquid should be added in this order: Ice. Room temperature seltzer. Espresso. Orange juice.There's the Spritzy Americano, looking righteous.\nPhoto by Chelsie CraigBut there’s one more thing to add. You’ve seen bartenders wave around a citrus peel over some artful cocktail masterpiece they just created, right? They do that for a reason. The oils in the peel of the citrus give a concentrated, floral, pleasantly-bitter orange flavor to the drink. Peel and bend 2 2” strips of orange peel over the drink, rub them gently along the rim of the glass, and then slide them into the drink along the side of the glass. It might feel a bit extra, but this is what brings the Spritzy Americano together at the close.And you know what could bring you even closer to the Spritzy Americano? Some booze. The addition of 1½ oz. of amaro takes this thing to a whole new realm. You want an amaro with some depth of flavor but not too much menthol character, something like Braulio, Averna, or Cynar.So did I invent the Spritzy Americano? No. But did I invent the Spritzy Americano Spritz? Also, probably not. None of that matters though. What matters is that you shake up your coffee routine. As the weather cools and the sky turns gray, you need to put that citrusy, caffeinated, bubbly pep in your morning step. Give your morning the ol’ razzle dazzle. Give it the Spritzy Americano.More of a creamy coffee person? Here ya go:If You Love Iced Coffee, This Iced Coffee Shakerato Will Melt Your Face Right OffFrothy and foamy, cold, sweet, and caffeinated. The time is now.View StoryExplore Bon AppétitCoffeeEspressoOrangeSeltzerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Alex Delany"]}