{"id": "95d104289357d79c359fd19f4d6b4805", "url": "https://www.bonappetit.com/recipe/broccoli-and-garlic-ricotta-toasts-with-hot-honey", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Broccoli and Ricotta Toasts with Hot Honey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueBroccoli and Garlic-Ricotta Toasts with Hot HoneyBy Claire SaffitzSeptember 18, 20184.5(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintCrispy roasted broccoli proves it works just as well as an appetizer as it does a side dish. Use broccoli stems in any recipe that calls for florets; their crunch provides a nice textural contrast. Leave the peels on the garlic cloves so they steam and become creamy inside their skins when roasted. If you don’t have ricotta, mix the mashed roasted garlic into mayonnaise instead.Ingredients6 servings 1baguette, sliced ½\" thick on a diagonal (about 12 slices)6Tbsp. extra-virgin olive oil, divided1head of broccoli, stem peeled, stem and florets chopped into ½\" pieces1head of garlic, cloves separatedKosher salt1Tbsp. honey1Tbsp. white wine vinegar½tsp. crushed red pepper flakes1½cups fresh ricottaFreshly ground black pepperPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 400°. Arrange bread slices in a single layer on a rimmed baking sheet and drizzle with 2 Tbsp. oil. Toss on baking sheet to coat, then arrange again in a single layer. Place broccoli and garlic on another rimmed baking sheet and drizzle with remaining 4 Tbsp. oil. Season generously with salt and toss to combine.Step 2Place broccoli on top rack and bread on bottom rack and roast until bread is golden brown and crisp, 10–12 minutes. Remove bread from oven and continue to roast broccoli and garlic, tossing once, until broccoli is browned all over and garlic is tender, another 15–20 minutes. Let cool slightly.Step 3Meanwhile, whisk honey, vinegar, and red pepper flakes in a small bowl.Step 4As soon as garlic is cool enough to handle, squeeze cloves out of their skins and mash in another small bowl to form a paste. Add ricotta and mix well; season with salt and black pepper.Step 5Spread ricotta over toasts and top with roasted broccoli. Arrange on a platter and drizzle with honey mixture.How would you rate Broccoli and Garlic-Ricotta Toasts with Hot Honey?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleMade this as a Christmas Eve appy (the red, green, and white seemed like a festive combo). Turned out well and despite some bewildered looks, people loved it.Kurt S.Vancouver, BC12/27/2021Such a great Monday night meal. Super easy to make, yet hardy enough to feed the whole family. KGScottsville, Va8/24/2021This is a go to for parties and celebrations. It’s easy to swap out broccoli for other veggies as well to add variety. Love it Eat it!TempegalPhoenix, AZ5/29/2021I really enjoyed eating this. The honey/vinegar drizzle really compliments all of the flavors so nicely. I liked the drizzle so much that I separated half of my ricotta and mixed in the drizzle before spreading on toast for a portion of my baguette slices. Will definitely make again.Kristine WSan Diego, CA3/17/2021I used plain greek yogurt rather than ricotta--that's what I had on hand. Simply fabulous.Cath HatSacramento, CA1/1/2021So delicious! I served sprinkled with minced red bell pepper on top and had extra ricotta/garlic that I used as a side dip with an arrangement of red bell pepper slices around the rim. It is a beautiful appetizer, especially for Christmas with the colors! All I can say is it was the hit off the night! Everyone loved it!Margaret447Massachusetts 10/11/2020These turned out great! I made the toasts with a super stale baguette under the broiler in my oven, I also did not add any oil while toasting them. These were a hit at happy hour, I will definitely make again.AnonymousSan Francisco5/12/2020Super good! I brushed the bread with the oil, and made sure to flip the slices after baking for 5 minutes, depending on your bread it might bake much faster so keep an eye on it! The hot honey sauce paired with the garlic ricotta is inspired. Definitely double up on the honey sauce!raulduke055/6/2020This was soooo delicious! I accidentally kept my toasts in the oven too long so they were hard enough to chip a tooth and these were STILL a huge hit. Easy enough (mashing the garlic is annoying but totally worth it) and will definitely need to make more of that hot honey for dipping! Next time I might try to microplane a small clove of fresh garlic into the ricotta to give it a bit of a garlicky kick. And will definitely take another commenter's suggestion to try with brussels sprouts! YUM! AnonymousIndianapolis, IN9/21/2019The two reviews on this recipe that aren't 5-star seem to be centered on having bought low-quality ricotta  -- but this is a hit either as a party app or a full blown dinner if you use a bigger slice of toast. I've made it both ways several times and they're gobbled up. The flavors go so well together and roasted brocolli is a dream. For the dinner-sized spin use a softer bread to toast up -- or else it may get too crunchy and be a bit of a pain to bite into!AnonymousHouston, TX8/5/2019I wanted to like this. Even with the garlic (which i couldnt get to mash and had to chop even after over cooking) the ricotta didnt taste like anything but watered down milk. The broccoli is good as expected, and the hot honey sauce was very good, but the ricotta's blandness just couldnt be overcome.AnonymousMichigan5/7/2019Ugh, I love this recipe. Made it for two holiday parties and even dared to take it home to my family's Christmas Eve (it's sacred, new recipes are not often welcomed). Total hit everywhere I went, quick and easy to put together and the hot honey is an added surprise. Also looks cuteAnonymousBrooklyn, NY4/2/2019This was gorgeous. The garlic in the ricotta is a game-changer! Will be trying this with Brussels sprouts as well. Love the hot honey!AnonymousCalifornia3/14/2019Perfectly Putrid. Much like the game it went with. I make some mean vegan crostini cocotions this was the worst!Seattle WA2/4/2019Explore Bon AppétitToastAmericanBroccoliVegetableRicottaCheeseFallStarterSnackVegetarianNut-FreeHealthyishRoastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}