{"id": "95d3e51ee18e04495c41ddd0aeba20ee", "url": "https://www.bonappetit.com/recipe/yellow-tomato-bloody-mary", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Bloody Mary Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueYellow Tomato Bloody MaryBy Molly BazJuly 10, 20185.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintBruised tomatoes dripping with juice are tailor-made for a fresh Bloody Mary. They might not be on display at the farmers’ market—beauty queens, they’re not—but they’re often there if you ask.Ingredients4 servings 2lb. very ripe yellow tomatoes, cored, coarsely chopped1celery stalk, coarsely chopped, plus celery heart stalks with leaves for serving6Tbsp. fresh lemon juice¼cup Castelvetrano olive brine, plus olives for serving¼cup finely grated peeled horseradish3Tbsp. hot sauce (preferably Cholula)2tsp. Worcestershire sauce2tsp. sugar4tsp. kosher salt, divided, plus more1lemon wedge6oz. gin1tsp. freshly ground black pepper1tsp. mild red pepper flakesSun Gold tomatoes (for serving)PreparationStep 1Blend yellow tomatoes and chopped celery in a blender until smooth, about 1 minute. Strain through a medium-mesh sieve into a large pitcher, pressing on solids to extract as much juice as possible. Whisk in lemon juice, olive brine, horseradish, hot sauce, Worcestershire sauce, sugar, and 3 tsp. salt. Taste and season with more salt if needed. Cover and chill at least 1 hour and up to 3 days.Step 2Combine black pepper, red pepper flakes, and remaining 1 tsp. salt in a shallow bowl.Step 3To make each cocktail, rub the rim of a 12-oz. glass with a lemon wedge, then dip into spicy salt. Fill glass with ice and pour in 1½ oz. gin. Top with 5 oz. Bloody Mary mix; garnish with cherry tomatoes, celery heart stalks, and olives.How would you rate Yellow Tomato Bloody Mary?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllTomatoVegetableLemonCitrusFruitHorseradishHerbs & SpicesSummerEasyDrinksHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}