{"id": "95dbd6d4200d99533e5714ee720a868a", "url": "https://www.bonappetit.com/story/never-fail-grand-aioli", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "This Aioli Recipe Makes Other Dips Jealous | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAioli Is the Queen of Dips, Long May She ReignEvery dip is beautiful and special, but this aioli recipe takes the cake.By Emily SchultzAugust 24, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris MoroccoFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.My ideal day (week, year) would consist solely of sitting on the beach in Italy, drinking endless spritzes, listening to the same Fleetwood Mac album on repeat and eating only things that can be dipped into other things. Because Stevie Nicks is my queen and because everyone knows dips are the best way to eat food.There are healthy dips and dips with shredded chicken and blue cheese in them (shout out to the best Super Bowl food of all time, buffalo chicken dip). But the most delicious and versatile dip of all time is aioli. And in the above perfect Groundhog Day scenario outlined above, that is the dip I'm eating from now until eternity.Maybe you’re thinking, what is aioli, anyway? Well, I'll tell you. Aioli, which is basically the same thing as mayo, is an emulsion, a situation in which un-mixable ingredients—in this case egg yolks and a bunch of oil—are beaten together to form a thick, fluffy suspension. Add in some Dijon mustard, salt, and lemon juice, and you've got a fantastic aioli sitch, the perfect thing for dipping everything from carrot sticks to hunks of bread to boiled shrimp.Back in the day, this was done in a mortar and pestle—garlic, not egg yolks, would be ground to a fine paste, and then olive oil would be painstakingly beaten in drop-by-drop. Now, a lot of people just do it in a blender or food processor, which is a lot easier and faster but maybe...less fun? My favorite way, which kind of splits the difference, is to do it by hand, but with a whisk, which I think is best for nervous home cooks because you can see and control everything that's happening. Here's how it goes down.Chunks of cucumber love aioli almost as much as I do.\nFirst, you combine egg yolks, mustard, garlic and salt in a large metal bowl. This is the base that you'll stream the olive oil into to create that emulsion affect (insert spooky noises here). Before the oil goes in there, drape a kitchen towel over a Dutch oven, and place the bowl inside it, which will stabilize it and keep it from moving around while you're whisking—a little trick I learned one afternoon while hanging in the BA Test Kitchen looking for snacks. Now for that olive oil stream. Whisking constantly, you want to dribble in your oil one drop at a time at first, and once the situation starts to look fluffy you can start pouring in a thin, steady stream. You can totally use a liquid measuring cup with a spout for this, but I actually think the easiest way is to use a squeeze bottle that you've measured your oil into, which gives you waaaay more control. This whole process takes a while, and is definitely an arm workout, so put on some tunes so you don't get bored. Invite your friends over. Learn a new language. Watch the new season of Orange Is the New Black. Do your thing. (You can also do this in a blender or food processor, but just make sure your machine has an opening where you can stream olive oil in while it's running. It’s so quick this way! The only downside is cleaning all of the different pieces, which feels impossible sometimes.)Before you know it you'll have a thick, beautiful bowl of aioli goodness. Season it with salt, make sure it's plenty lemony and garlicky, and you've just booked yourself a one-way ticket to dip nirvana.Now that you have the dip, you’re going to need things to dip into it. (P.S.: fingers work). I love to find the crunchiest, most seasonal veggies I can. Barely-blanched asparagus and bright pink radishes in the spring; snippy snap peas and crisp, sturdy lettuces in the summer; and thinly sliced carrots and other root vegetables in the colder months. Since life is about balance, I also like to load up my crudités platter with chunks of focaccia and a ton of mortadella, the most underrated meat in alllllll the land. Bring it to the coast of Italy. Bring it to a Fleetwood Mac concert. Bring it to your coffee table and eat the whole dang platter by yourself. Welcome to your best life.Get the recipe already!Grand AioliDip everything–all of the things—into this garlicky mayonnaise.View RecipeExplore Bon AppétitBasicallyNever FailAioliDipCruditéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-24", "author": ["Condé Nast", "Emily Schultz"]}