{"id": "961456a8167a9853082c5f94860f944e", "url": "https://www.bonappetit.com/recipe/hot-caesar-spinach-dip", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Hot Caesar Spinach Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopHot Caesar Spinach DipBy Heinz® Mayonnaise December 4, 2018EmailPinterestPrintEmailPinterestPrintEmailPinterestPrintActive Time20Total Time40Creamy Heinz® Mayonnaise is the base for this Hot Caesar Spinach Dip.Ingredients6 servings1pound spinach, thick stems trimmed2tablespoons extra virgin olive oil1small yellow onion, finely chopped1large garlic clove, minced2slices rustic of bread, torn into small pieces1cup shredded mozzarella3/4 cups parmesan cheese, grated1/2 cup Heinz® Mayonnaise1/2 cup sour cream1tablespoon fresh lemon juice2teaspoons dijon mustard1/2 teaspoon anchovy pastefreshly ground black pepperKosher saltlettuce, radicchio, and carrots, for servingPreparationStep 1Preheat oven to 400°. Cook spinach in salted boiling water until wilted, 30 seconds. Drain and rinse. Squeeze out as much excess liquid as possible. Coarsely chop.Step 2Heat 1 tablespoon oil in large skillet over medium-high. Cook onion until golden, 4 minutes. Add garlic until fragrant, 30 seconds. Add spinach. Stir until pan looks dry, 1 minute. Scrape into heatproof bowl.Step 3Clean skillet and return to medium-high. Add remaining oil and breadcrumbs. Stir until golden, 5 minutes. Transfer to plate.Step 4Stir mozzarella, ½ cup parmesan, mayonnaise, sour cream, lemon juice, dijon, and anchovy paste into spinach mixture; season with salt and pepper. Scrape into 1-qt. baking dish. Top with breadcrumbs and remaining parmesan. Bake until bubbly and golden, about 20 minutes. Serve with lettuce, radicchio, and carrots.How would you rate Hot Caesar Spinach Dip?Leave a ReviewTell us what you thinkExplore Bon AppétitDipCruditéSpinachLeafy GreensVegetableAnchovyFishSeafoodParmesanCheeseMozzarellaEasySnackStarterSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Heinz"]}