{"id": "9625ca816c769a2b4799f14fd3be4e77", "url": "https://www.bonappetit.com/recipe/curried-egg-tartines", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Curried Egg Tartines Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCurried Egg TartinesBy Zaynab IssaNovember 23, 20214.4(16)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintWhile we would happily eat a plain slice of crispy fried bread, one piled with a creamy curried egg salad and herbs is way more exciting. This egg salad is ultra-lush thanks to Kewpie mayonnaise, which is made with egg yolks only (traditional mayo uses whole eggs). It’s offset with fragrant, earthy curry powder, fresh mixed herbs, and the crunch of fried bread. We like Madras curry powder because it has a bit of extra heat, but you can use regular curry powder and cayenne pepper to your taste if you prefer.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronKewpie Mayo$6 At Weee!Slotted Spoon$13 $10 At AmazonLarge Saucepan$60 At AmazonSerrated Knife$54 At KorinLarge Nonstick Skillet$50 At AmazonIngredients4 Servings8large eggs3radishes, trimmed, thinly sliced (optional)1cup coarsely chopped tender herbs (such as parsley, chives, and/or dill)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, dividedJuice of 1 lemon3scallions3Tbsp. extra-virgin olive oil, divided4thick slices country-style bread (such as ciabatta or sourdough)1½tsp. curry powder (preferably Madras)½cup Kewpie mayonnaise1Tbsp. Dijon mustardFlaky sea saltAleppo-style pepper (for serving)PreparationStep 1Using a slotted spoon, carefully lower eggs into a large saucepan of gently boiling water one at a time. Cook, adjusting heat as needed to maintain a gentle boil, 9 minutes. Transfer eggs to a bowl of ice water and let cool, about 10 minutes.Step 2Meanwhile, place radishes (if using), herbs, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a medium bowl. Drizzle lemon juice over and toss to combine; set herb salad aside.Step 3Separate dark green tops from scallions and thinly slice; set aside. Thinly slice remaining white and pale green parts; set aside separately.Step 4Gently crack eggs all over and peel, starting from the wider end, which contains the air pocket; discard shells. Coarsely chop eggs (keep pieces large).Step 5Heat 1 Tbsp. oil in a large nonstick skillet over medium. Add 2 slices of bread and cook until golden and crisp underneath, about 4 minutes. Transfer to plates and arrange fried side up. Repeat with another 1 Tbsp. oil and remaining slices of bread.Step 6Heat remaining 1 Tbsp. oil in same skillet and cook curry powder and reserved scallion white and pale green parts, stirring occasionally, until slightly softened and fragrant, about 3 minutes. Transfer scallions to a large bowl, add mayonnaise, mustard, and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and mix to combine. Add eggs and reserved scallion greens and gently fold to envelop eggs in dressing.Step 7To serve, top fried bread with egg salad and herb salad. Sprinkle with sea salt and Aleppo-style pepper.Do ahead: Egg salad can be made 3 days ahead. Cover and chill.How would you rate Curried Egg Tartines?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI love my egg salad with chopped pimento stuffed olives. Ive also always used curry in my egg salad and m deviled eggs.Hellmann's has always been my go to. Tried Duke's and didn't taste right to me. I believe my palate didn't care for the oil in it. Maybe it's just being a Yankee. The radishes are a great addition.Nancy Scott2/20/2022Delicious recipe.  Followed as is (but I didn't have any radish) and it was perfect.  MinihToronto, ON1/9/2022This turned out delicious! A perfect late morning breakfast on a Sunday. I’m not a big fan of mayonnaise so I just used some leftover “light” mayo from Kroger instead of buying something new; next time I might try Greek yogurt which is my usual substitute for mayo. I think the radishes are absolutely necessary! They give a pleasant little crunch on top of the egg salad. KlavyHouston, Texas1/9/2022I recently made a similar egg salad with toast. I cut up radish, red pepper, and tomato really small & rough cut some boiled eggs. After adding a little greek yogurt I used a little bit of coriander & S&P to season. Delicious!Anonymous12/20/2021Interesting receipe. I will note that traditional mayonnaise is NOT  made with whole eggs, it's made with egg yolks. Duke's mayonnaise (made by Sauer's) is made with yolks and readily available throughout most of the U.S. South.Leon JesterSouth Central Virginia12/19/2021Can’t wait to try.\nLooks and sounds deeee-lish!AnonymousPalm Springs 12/19/2021Explore Bon AppétitBreakfastLunchDinnerSnackMainStarterEasyQuickWeeknight MealsVegetarianDairy-FreeToastEggRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}