{"id": "9626141b9991a121c0db0b0c5c5542c2", "url": "https://www.bonappetit.com/recipe/coconut-turmeric-relish", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Coconut-Turmeric Relish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut-Turmeric RelishBy Claire SaffitzMarch 20, 20184.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe sweet, spicy, and tart flavors in this coconut-turmeric relish recipe make it a perfect match with cauliflower (any way you like it). Use it on top of cauliflower rice, cauliflower steaks, a crunchy shaved cauliflower salad, or simple roasted cauliflower.Ingredients2–4 servings ¼cup golden raisins¼cup fresh lemon juice4garlic cloves, thinly sliced⅓cup extra-virgin olive oil¼cup unsweetened coconut flakes1Fresno chile, seeds removed, finely chopped1½\" piece ginger, peeled, finely grated1Tbsp. mustard seeds½tsp. ground turmericKosher salt, freshly ground pepperPreparationStep 1Combine raisins and lemon juice in a small bowl; let sit 15–20 minutes for raisins to plump.Step 2Meanwhile, combine garlic, oil, and coconut in a small saucepan and set over medium-low heat. Cook, swirling pan often, until oil is bubbling and garlic and coconut are golden, 6–8 minutes. Remove from heat immediately and stir in chile, ginger, mustard seeds, and turmeric. Transfer to a heatproof measuring glass and let cool.Step 3Add raisins and lemon juice to garlic mixture and toss to coat; season relish with salt.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Coconut-Turmeric Relish?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleA delicious reason to eat cauliflower often! I put the steak on a bed of arugula and served with the yogurt and relish -- delicious! Complex flavors, with perfect balance. Thank you.AnonymousSeattle, WA7/6/2021I made this for simple roasted cauliflower, and I was very impressed with the depth of flavor components here. Will definitely make it again. Personal Chef JaneTucson, AZ2/7/2021Very good! I’ll used it over rice, & maybe riced cauliflower.  Easy to make, looks great.  The photo looks like coconut chips instead of dried coconut flakes. Maybe I’ll try that... it looks better!  And salt enhances the flavor.\nSubstituted a jalapeño plus a little chipotle powder after seeing how hot a Fresno is!  Anonymous11/17/2020Delicious! I doubled the recipe with 3 Tbsp. ghee and used jalapeño and a little chipotle powder instead of Fresno pepper after reading how hot the Fresno is!  I’m going to try it on plain Greek yogurt as a crudités dip. Love the flavor & crunch.Anonymous11/17/2020Holy cow, this stuff is addictive--next time I will make a double batch.  Really, really, really tasty.AnonymousSeattle4/8/2019Explore Bon AppétitCondimentCoconutFruitTurmericHerbs & SpicesEasyDairy-FreeVeganVegetarianGluten-FreeHealthyishFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}