{"id": "962af265d7a1e224d8289506a862c49c", "url": "https://www.bonappetit.com/story/foodie-mothers-day-gifts", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "9 Mother's Day Gifts for Every Kind of Mom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture9 Mother's Day Gifts for Every Kind of Foodie MomCooking (and non-cooking) presents that'll make Mom proudBy Ashley MasonApril 19, 2018FacebookTwitterEmailCourtesy of Chelsea MillerFacebookTwitterEmailMama always said it’s the thought that counts. So as you’re stressing over what to get her this Mother’s Day—especially if she didn’t pass along her Martha Stewart-like knack for homemade crafts—take a few breaths. Whether you opt for a useful new chef knife or an indulgent bagel spread for six, she’s going to love what you pick out. And if she doesn’t, well, at least you can order a lot mimosas at brunch. Here are nine Mother's Day gifts nearly every mom can get behind.Photo by Williams SonomaFor the mom who already owns the limited edition KitchenAidShe loves the challenge of making something from scratch, so transforming wheat berries, oats, and quinoa into flour with the KitchenAid Grain Mill will be right up her alley. Our editor-at-large Christine Muhlke tried it out and was pretty pleased with the results. An adjustable knob that lets her choose the fineness of the grind—course for a porridge base for pork ragù or fine for an alt-grain banana loaf—keeps up with her endless list of DIY projects.But It: KitchenAid All Metal Grain Mill Attachment, $86 on AmazonPhoto by Chelsea Miller KnivesFor the mom who breaks down a whole chicken like it’s NBDSince she appreciates a good, sharp knife, give her a tool that’s as badass as she is. These blades from Chelsea Miller, a knife maker based in Brooklyn, are hand-forged from repurposed carbon steel horseshoe files (hence the stunning diamante texture). The durable blade sharpens easily and the rough edge is ideal for grating Parmesan or garlic.Buy It: Chelsea Miller Chef Knife, $800 from Chelsea Miller KnivesPhoto by James Ransom/Food52For the mom who shops at the farmers’ market/CSA/etc.Blow her mind by setting up her own personal herb garden in the kitchen. This stylish brass greenhouse has its own LED light (with a built-in timer), which means even in spaces starved for natural light tender microgreens and fragrant basil should flourish (if she remembers to water them).Buy It: Modern Sprout Brass Grow-Anywhere Growhouse, $150 from Food52Photo by La TiendaFor the mom plotting her culinary pilgrimage to SpainTake a hint and buy her something that’ll remind her of the Andalusian countryside like this cold pressed olive oil duo from La Tienda. Its producers Castillo De Canena make small batches of olive oil from a picturesque 16th-century castle in the foothills of the Sierra Mágina. (Cool story, right?!) This oil is from the orchard’s first day of pressing, which is delicate and more aromatic (they say it tastes like artichokes and rosemary) than other varieties. It’ll pair nicely with that tortilla española you’ve been meaning to make for her.Buy It: Duo of 'First Day of Harvest' Extra Virgin Olive Oils, $100 from La TiendaPhoto by Evan SungFor the mom whose ideal dessert is actually just a mountain of chocolateMom, meet your match. Sure, she’ll say these jewel-like bonbons from Stick With Me Sweets look too pretty to eat, but as soon as she pops one in her mouth it’s curtains for this candy box. The New York-based chocolatiers put together nostalgic flavors like speculoos s’more, PB&J, and malted milk chocolate. We suggest getting two boxes: one for Mother's Day and one for after Mother's Day brunch.Buy It: Stick With Me Sweets Bonbons, $88 from Stick With Me SweetsPhoto by Ben Kist for MARCHFor the mom who has hosted more dinner parties than Ina GartenChances are a few new cloth napkins will always be welcome. The producer of these pale blue ones, Vermont-based Creative Women, partners with textile companies in Africa, South America, and India to promote economic independence for women—a great conversation piece for her next get together.Buy It: Creative Women Pulled Napkins, $22 from MARCHVia TRNKFor the mom who really really loves coffeeInstead of gifting her yet another coffee gadget, get her a sophisticated cream and sugar set that she’ll love using every day. This porcelain pair from Japanese maker Hasami easily stacks, so there’s more room for the important things, like her extensive coffee cup collection.Buy It: Japanese Porcelain Cream & Sugar Set, $56 from TRNKPhoto by Jen Snow, Courtesy of Russ & DaughtersFor the mom who stores her shoes in the ovenNew York institution Russ and Daughters sends a spread of its signature smoked salmon, bagels, and all the fixings for six, no cooking required. The box comes complete with a chocolate babka, a Russ and Daughters mug, and a branded tote bag. If the dishwater is also “out of service,” consider sending some paper plates too.Buy It: New York Bagel Brunch, $115 from Russ and DaughtersFor the mom who puts together a mean cheese trayThere’s a reason Scandinavians have been using these slotted cheese slicers for generations: They’re incredibly efficient at cutting through blocks of hearty Jarlsberg and Havarti. Even if Alpine cheeses aren’t her thing, this sleek server adorned with a traditional Dala horse will look great on her next spread.Buy It: Skandinavisk Hemslojd “Dala Horse” Cheese Slicer, $19 from HusetThis super-easy ricotta cake is another Mother's Day win:Explore Bon AppétitMother's DayGift GuidesShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-09", "author": ["Condé Nast", "Ashley Mason"]}