{"id": "962c9d5a4872f98c3be2ae0d00582ee2", "url": "https://www.bonappetit.com/story/oxo-greensaver-herb-keeper", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "Every Herb I Ever Put in My Fridge Went Limp...Until I Got the OXO GreenSaver Herb Keeper | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEvery Herb I Ever Put in My Fridge Went Limp...Until I Got This ThingThe OXO GreenSaver Herb Keeper truly does save your herbs from a slimy demise.By Hilary CadiganDecember 16, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I will admit: My first reaction when my husband Rob brought home this weird plastic basket contraption from Marshall's was to scoff. I believe my exact words were: “WTF is this?” Followed by: “It looks like one of those things that’s gonna take up way more fridge space than it’s worth.” But, reader, I was wrong.How wrong? Well, let me put it this way: Thanks to the OXO GreenSaver Herb Keeper (which is a bit of a redundant name, but I’m no longer here to judge), I now have fresh dill going on THREE WEEKS in my fridge that isn't even limp.See, fresh herbs—like humans!—need good airflow, humidity control, and plenty of hydration to thrive. And the plastic produce bags or interlocking polyethylene clamshells most herbs come in provide none of these things. But you know what does? The OXO GreenSaver Herb Keeper, baby. Its interior basket gently cradles your precious herbs, keeping them from getting all clumpy and slack. The sealed top maintains just-right humidity inside, and you can even add an inch of water to the bottom of the container to keep your herbies hydrated, like a bouquet of flowers.And guess what? The thing costs $12, which is about 1/18th of the lifetime sum I’ve wasted on fresh herbs that have gone full black slime status in my fridge. So yeah, fine, I was wrong, Rob was right, and the OXO GreenSaver Herb Keeper now enjoys a permanent place of residence in our fridge, happily ever after.Buy it: OXO GreenSaver Herb Keeper, $12 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRead MoreshoppingReal Talk: Do You Need A Stand Mixer?By Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-16", "author": ["Condé Nast", "Hilary Cadigan"]}