{"id": "9632e6f0ac0fcc4c1f459c465be02ec4", "url": "https://www.bonappetit.com/recipe/roast-sausage-and-fennel-with-orange", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Roast Sausage and Fennel  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueRoast Sausage and Fennel with OrangeBy Claire SaffitzSeptember 18, 20184.7(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintThis sheet-pan sausage dinner is here for you when doing a pile of dishes isn’t on your to-do list. Roasting the sausages at a higher temperature helps them achieve the same golden brown color you’d get from searing them in a hot skillet. Thinly sliced shallots, leeks, or cabbage would all be great here too. And think of fennel fronds as a bonus that comes with the bulb; use them anywhere you would another tender herb like parsley or dill.Ingredients4 servings 2medium fennel bulbs, fronds reserved, bulbs halved through root end, thinly sliced lengthwise1small red onion, halved through root end, thinly sliced lengthwise3sprigs rosemary4Tbsp. extra-virgin olive oil, divided, plus more for drizzlingKosher salt, freshly ground pepper6sweet Italian sausages (about 1½ lb. total)1medium navel orange1Tbsp. red wine vinegarFlaky sea saltPreparationStep 1Place a rack in highest position in oven; preheat to 425°. Combine fennel bulbs, red onion, and rosemary sprigs on a large rimmed baking sheet. Drizzle with 3 Tbsp. oil, season generously with kosher salt and pepper, and toss to combine. Arrange sausages on top, spacing evenly and nestling into vegetables. Prick sausages all over with the tip of a paring knife and drizzle with 1 Tbsp. oil. Roast until sausages are browned on top and cooked though and fennel is tender and deeply browned in spots, 25–30 minutes.Step 2Meanwhile, coarsely chop reserved fennel fronds (you want about ¼ cup); set aside. Cut the ends off orange to reveal flesh. Rest orange upright on a cut side and cut down around orange to remove peel and white pith, rotating it as you go; discard peel. Working over a small bowl, hold orange in your hand and cut between membranes to release segments into bowl. Squeeze membranes to extract any remaining juice into bowl; discard membranes. Add vinegar to orange segments and juice and toss to combine; season with kosher salt and pepper.Step 3Remove baking sheet from oven. Using your hand or a spoon to block segments, pour juices from orange over sausage and fennel mixture. Set orange segments aside and let sausages and fennel mixture cool 5 minutes.Step 4Transfer sausages and fennel mixture to a platter. Crumble rosemary leaves over and scatter reserved orange segments and fennel fronds on top. Season with sea salt and a bit more pepper; drizzle with oil.How would you rate Roast Sausage and Fennel with Orange?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleLove this.  So easy but filling and delicious.  I always ad cabbage, sometimes leeks, kale, what ever I have on hand. I use mandarins and orange juice for convenience and it dose not change results.  Fresh rosemary best, but have subbed dried in a pinch and ad them to dressing early on.  \nDo not use too much EVOO.  Veggies give off lots of moisture.  Do spin pan and shuffle ingredients mid way through and also recommend using convection if you have it. NCM2093/24/2022Great combo, thank you for the recipe! notsoevil receptiCroatia2/12/2022Easy and delicious! Added white beans to the mix. AnonymousBelmont, NC1/7/2022Oh Wow! So good! I used an Italian pork sausage from the local farmers market. Was short on onion so added sliced green onion and garlic, plus cabbage in lieu of the fennel bulb.  Made the addition of blue cheese with the orange juice while resting....so good! Will definitely be making again soon - likely with the fennel which would also be superb.lmmart24Santa Fe11/2/2021Amazing! Hot summer day here - so we dropped our pan on the gas grill & kept an eye on the temp... Came out Perfectly!  We did add some left over cauliflower (1/2 a head) and we 1/8thed a red bell pepper (for flavor and color). Again - Perfection!  Will DEFINITELY find a spot in the regular rotation! Winter OR Summer! Isabelle PetersonFairfield, CT9/1/2021Delicious flavor combo, and couldn't be simpler. I agree that it works to have the onions and fennel sliced thickly, 3/8 to 1/2 inch. I had some nice bok choy and roasted that along with the fennel and onions, and it worked great--I think because of the fennel in the sausage and the fennel in the fennel :) it balanced very well. This is a keeper for me, and it works almost as well with vegan sausage as with pork sausage, as long as you're using something that captures that sweet, fennel-seed quality.SBentonWestport, CT3/26/2021Made this on a cold winter night, the perfect sheet pan dinner! AnonymousDurham NC2/21/2021Really great. The whole family loved this dish. I cooked it on a whim to use some nice fennel we had. Due to Covid 19 lockdown, and spontaneity, I had to make some substitutions.\n\nFirst I subbed the navel for Mandarin oranges. I juiced one of them whole, and simply peeled and separated the one other, removing as much pith as I could. This still worked beautifully and the kids were stoked to get Cuties in a dish made my daddy!\n\nSecond, my last red onion had yielded to a fuzzy little white colony of friends so I subbed in a couple medium shallots. I found the aromatic element to be up to par, but honestly missed the color that would've come with proper red onion slices.\n\nThird, no sweet Italian sausage, so I used some chicken apple. \n\nThe end result was still really special. The family all really liked everything. Sweet, tangy, and complex for a dish that takes about 8 minutes of active work. On a technical note, I would recommend slicing the fennel bulb around 3/8\" thick to prevent it from burning before the sausage is cooked. mattcarterSeattle6/3/2020This is one of my favorite, quick and easy weeknight dinner recipes! I have had times when I burn the fennel/onions so I would suggest cutting them on the larger size so they finish with the sausage. Otherwise if they are finished early, I just take them out and let the sausage roast on their own.jslotnickEmeryville, CA4/30/2020Explore Bon AppétitAmericanSausageMeatFennelVegetableOrangeCitrusFruitRosemaryHerbs & SpicesEasySheet-Pan DinnersWeeknight MealsMainDairy-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}