{"id": "9650872bae587f41d7a80a9e07eca1f8", "url": "https://www.bonappetit.com/recipe/green-beans-palya", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Green Beans Palya Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGreen Beans PalyaBy Chitra AgrawalAugust 16, 20204.5(15)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sarah JampelEmailPinterestPrintEmailPinterestPrint“Palya is a classic South Indian recipe usually composed of a single vegetable chopped into bite-size pieces and sautéed in oil that has been seasoned with black mustard seeds, asafetida, chile, and curry leaves” says recipe developer and cookbook author Chitra Agrawal. “The dish is then finished with lemon juice, grated coconut, and cilantro. Depending on which state in South India you are in, this same preparation is referred to by different names, such as thoran or poriyal. While seasonal produce is preferred, the combination makes even the saddest of vegetables at the back of your fridge sing. Green beans are my favorite choice, but the recipe is extremely flexible and can be applied to beets, cabbage, potatoes, and, as I recently discovered, asparagus.” Read more about palya here. To make it a full meal, serve with chitranna or plain rice, raita  or yogurt, and achar. Green beans palya also pairs well with roti.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Skillet with Lid$40 At AmazonWooden Spoon$6 At AmazonIngredients4 Servings¼cup fresh or frozen grated coconut or dried unsweetened shredded coconut1lb. green beans1tsp. chana dal (optional)1tsp. urad dal (optional)½tsp. black mustard seedsPinch of asafetida1Tbsp. vegetable oil1dried red chile4–5fresh curry leaves¼tsp. ground turmeric¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1Tbsp. (or more) fresh lemon juiceCilantro leaves with tender steams and Chitranna, yogurt or raita, and achar (for serving)PreparationStep 1If using ¼ cup frozen grated coconut, microwave in a small bowl in 15 second bursts or place in a colander and set under warm running water until thawed. If using ¼ cup dried unsweetened shredded coconut, place in a small bowl and pour in hot water to cover. Let sit until ready to use.Step 2Trim or snap off stem ends of 1 lb. green beans. Align 4–5 beans on cutting board and slice into ¼\" pieces. Repeat with remaining beans.Step 3Combine 1 tsp. chana dal and 1 tsp. urad dal (if using), ½ tsp. black mustard seeds, and a pinch of asafetida in a small bowl. Heat 1 Tbsp. vegetable oil over medium-high. As soon as oil is shimmering, add a mustard seed. When the oil around the seed starts to sizzle or the seed starts to move, add remaining spice mixture. Cook, covering with a lid as needed to contain the mustard seeds while they are popping and stirring so mixture evenly toasts, until very fragrant and sputtering has subsided, about 1 minute.Step 4Reduce heat to low. Break 1 dried red chile in half and add to wok. Rub 4–5 fresh curry leaves between your fingers to release oils and add to wok. Cover immediately (the moisture from the curry leaves will cause the oil to spatter). As soon as sputtering subsides, uncover and stir to evenly coat in oil.Step 5Increase heat to medium; add green beans and ¼ tsp. ground turmeric to the pan and toss to combine. Mix in ¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt and cook, tossing, 1 minute. Add 2 Tbsp. water and reduce heat to medium-low. Cover, and cook beans until tender, about 5 minutes.Step 6Uncover beans and stir in ¼ cup fresh grated coconut, thawed frozen coconut, or drained dried coconut. Cook, tossing, 1 minute. Remove from heat.Step 7Coarsely chop some cilantro leaves with tender stems. Stir in lemon juice. Taste and season with more salt or add more lemon juice if needed. Scatter cilantro over. Serve with Chitranna or plain rice, raita or yogurt, and achar.All together now!\nPhoto and Food Styling by Sarah JampelHow would you rate Green Beans Palya?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis sounds wonderful, however, I do not know some of the ingredients listed here, i.e. Chana?  Urod? Or Chitara?  Are these spices or herbs?  What are the substitutes in America?  I would appreciate a response. NahidLos Angeles11/22/2021Having traveled in south India, this is the dish I miss the most but have never seen on any American Indian restaurant's menu. I'm so glad I can finally make it at home!!Grace A.Boston, MA12/22/2020Absolutely delicious! I paired it with the chitranna which I used brown basmati rice for and added a touch of kashmiri chili powder. AnonymousLondon8/27/2020Victoria (if you see this!!), Yes, you use the uncooked dals. They get toasty, nutty, and crunchy when they're fried in the oil. Hope that helps!Anonymous8/20/2020I really liked making this, and I paired it with the chitranna. The only substitution I had to make was I used basil leaves instead of curry leaves. \n\nI definitely think that the asafetida is required for this dish and can't be substituted. I bought chana dal and urad dal for this, but could see using some substitutions if those are difficult to find. (Though I didn't have issues finding them in an Asian Market).\n\n(I used the chana dal and urad dal straight from the package, it added some nice crunch to the dish.)AnonymousPhoenix, Arizona, United States8/20/2020Haven't made the recipe yet, but it looks great and it's on my list for the next green beans coming in my farm box. I'm curious though whether the chana dal that this calls for should should be added straight out fo the package? Like, hard and uncooked?Victoria, BC, Canada8/18/2020Authentic South Indian recipe. All the spices are readily available in Indian/Asian stores. Can be made with any seasonal vegetable  AnonymousSan Francisco8/16/2020You can tell Adam Rapport is no longer at BA with the release of this recipe. You would never see a recipe with so many difficult to obtain ingredients under his leadership. The fact that this a Basically recipe is even a further miss by BAAnonymousNew Jersey 8/16/2020Explore Bon AppétitIndianSouth AsianAsianGreen BeanVegetableCoconutFruitCurry LeafHerbs & SpicesSummerEasyQuickSideGluten-FreeDairy-FreeVeganVegetarianSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-16", "author": ["Condé Nast", "Chitra Agrawal"]}