{"id": "966f01c0f4ec4742aabfc9cfb6defbf4", "url": "https://www.bonappetit.com/story/vanessa-rissetto", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Vanessa Rissetto: “There’s a Nutrition Divide in This Country. So I Became a Dietitian.” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle“There’s a Nutrition Divide in This Country. So I Became a Dietitian.”Dietitian Vanessa Rissetto wants a health care system that works for all, and she’s not going to sugarcoat it.By Alex BeggsJanuary 21, 2021FacebookTwitterEmailPhotograph by Lauren AnzevinoFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is registered dietitian Vanessa Rissetto, the acting director of NYU’s Dietetic Internship Program and cofounder of Culina Health.The nutrition world is divided. But the word divide doesn’t even present it accurately, that makes it seem split down the middle. It’s not. Around 12.9 percent of registered dietitians are people of color, and it’s keeping an entire field from progressing. It’s keeping an entire field of medicine from helping people who need their care most.Related: The Myth of Healthy Eating with Christina Chaey and Vanessa RissettoContentThis content can also be viewed on the site it originates from.Vanessa Rissetto, a registered dietitian in New Jersey, sees it for what it is: ingrained, structural racism. When I spoke to Vanessa a few times about her entry in the industry, and where it’s at now, she starts talking fast, dropping all the F-bombs and naming names. She gets animated, and eventually, exasperated. She’s hilarious and warm, and she will only tell you the truth. As one of only a handful of Black dietitians in the country, she carries an undue burden to make change in the industry. She’s doing it. But she has a few things to say, so I’ll let Vanessa take it from here. —Alex Beggs, senior staff writerMy favorite breakfast as a kid was a toasted English muffin with Cheez Whiz. In college I went through a six-pack of Pepsi every three days. So much Sbarro. Now I’m the acting director of New York University’s Dietetic Internship program.Back when I was a student in NYU’s nutrition program, my class was all rich, skinny white women. Years later not much has changed: 81 percent of registered dietitians are white. This creates an unbalanced system that lacks cultural competence. Black people are made to feel that our food is bad and unhealthy, and that to work with a dietitian means cutting it out altogether. Every day, as these dietitians cry about diet culture and post expensive collagen powders on Instagram, Black people are dying because of structural racism in health care.As I watch protests across the world against the devaluation of Black lives, it strikes me that this is not just true for the justice system; it’s true for all our systems. Black households are 2.5 times as likely to be food insecure as white households. If you’re food insecure, and I’m touting organic fruits and vegetables as the only way to go, you might resign yourself to believing that health is just not attainable for you. Black people have higher rates of obesity, heart disease, and cancer—not because of the color of their skin but because they’re systemically undertreated and 1.5 times less likely to have health insurance. That’s the real reason they’re considered “prone to chronic disease.” But health care functions as though race itself is a biological factor.I am counseling a couple, Harold and Jess, who are Black. Harold has diabetes and had worked with a white physician for four years without success. They told me they sought me out so they would be seen and heard. I worked on a nutrition plan with them, and after a few weeks, Harold had regained control of his blood sugar and lost 20 pounds. Jess lost 10 by association. It should make us all sad that they needed a Black practitioner to get that basic level of support.To diversify the field, the Academy of Nutrition and Dietetics needs to limit barriers to entry. The Academy’s new rules will require that to sit for the registered dietitian exam you’ll need to have completed your master’s degree—another two years of school (whereas nurses only need an associate’s degree). Then you have to do an unpaid internship for a year while paying off $103,000 in tuition. So far the academy has been noncommittal when discussing how to break down these barriers.I became a dietitian because I was inspired by one who saw me as an individual. She listened to my story and made no assumptions based on my race. I do the same for my patients, but we need more. We need to make nutrition education accessible for everyone. We need to produce more than two Black dietitians out of every 100 who qualify. We need health care that listens to Black people when they need our help.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyleA Nutritionist on Why She Doesn't Always Buy OrganicBy Brierley HortonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-21", "author": ["Condé Nast", "Alex Beggs"]}