{"id": "96736fcb39ca11d68530077de2b4920d", "url": "https://www.bonappetit.com/story/best-restaurants-inglewood-super-bowl", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Everywhere You Should Eat in Inglewood, Home to Super Bowl LVI | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsEverywhere You Should Eat in Inglewood, Home to Super Bowl LVIAll the restaurants, cafés, and coffee shops Los Angeles locals love the most.By Elize Diop and Brad JohnsonFebruary 9, 2022FacebookTwitterEmailIllustration by Paul SpellaFacebookTwitterEmailWith the Super Bowl coming up this weekend, it’s easy for us at Bon Appétit to focus on the food that we’re cooking at home: nachos, dips, wings, and all the rest of the Big Game spread. But this year, in honor of Super Bowl LVI being hosted at the SoFi Stadium in Los Angeles, we asked two locals—Elize Diop, a staff writer on HBO’s forthcoming show, Rap Sh*t, and Brad Johnson, a longtime restaurateur and host of the Corner Table Talk podcast—to share their favorite spots in Inglewood, the host neighborhood. Whether you’re gearing up to watch the Cincinnati Bengals face off against the L.A. Rams or just looking for a good meal in the area, here’s where to eat in Inglewood, L.A.Breakfast and BrunchPhotograph by Andrea D'AgostoThe Serving SpoonI go here when I want to feel like my mom cooked me breakfast. The portions are perfect and everything is seasoned to perfection. I love the bacon omelet with a side of cheesy grits. While you wait for a table, you can take a look at the hundreds of photos of celebrities and regular customers who love the Serving Spoon. —Elize DiopHilltop Coffee + KitchenFull disclosure: My sister is an investor. But even without her involvement, I wouldn’t miss the breakfast or lunch. Here the food is super colorful with unique flavor combinations. If I’m there for breakfast, I order one of the super-filling breakfast sandwiches or burritos. A side of the verde sauce takes both of these to a whole other level. If I’m there for lunch, I’ll order a short rib grilled cheese with a side of buffalo cauliflower. The food is consistently delicious and filling—in a way that doesn’t feel heavy. Any of the seasonal lattes are worth trying, but my personal year-round favorite is the matcha-chata, a matcha-horchata hybrid that’s creamy, cinnamony, and ice-cold (or hot if that’s your thing). —E.D.Photograph by Erica AllenPost & BeamWhile it’s not technically in Inglewood, this Baldwin Hills spot, 15 minutes from the neighborhood, will appeal to anyone looking for a great Sunday brunch, whether you like savory or sweet. Before I began splitting my time between L.A. and Miami, this was my spot, literally: I opened and owned Post & Beam for years before selling it. When I’m back in Los Angeles, I still go for shrimp and grits, outstanding buttermilk pancakes, and the Napa peach Bellini. —Brad JohnsonLunch and DinnerMaria’s Ricos TacosWhen I want a really good California burrito, this is my spot. I opt for grilled chicken instead of carne asada. While you’re there, try the super refreshing piña drink—a pineapple-spinach juice that’s so deliciously sweet, you’ll forget there’s spinach in it. —E.D.Photograph by Stephen Mastrocola/@OenoFilms Sunday GravyOne of Inglewood’s newest hidden gems makes some of the tastiest Italian food I’ve ever had. The meatballs and ricotta are out of this world. I’ve never ordered anything I didn’t love from this restaurant. The fresh pasta and artisan bread make all the difference. You can taste the quality in every bite. —E.D.All of their pastas are made fresh by Florentyna’s. Don’t miss the lasagna, which often sells out—and, as the menu says, once they’re out, they’re out. —B.J.Ms. B’s M & M Soul FoodIt’s soul food. You know what you like. I’m partial to the turkey wings, cabbage, candied yams, and banana pudding. —B.J. Photograph courtesy Jerusalem ChickenJerusalem ChickenThis is a casual neighborhood favorite located less than five miles from the Super Bowl stadium. Everything looks, smells, and tastes delicious, but I’m especially a fan of the lemon chicken and rice. The crispy skin, the tangy sauce, and the fluffy rice combine to make an ideal meal on the go. —B.J.Desserts and DrinksPhotograph Courtesy of Sweet Red PeachSweet Red PeachI will wait in line for their desserts, which fulfill all of my sweet cravings! They have an amazing red velvet strawberry cheesecake cupcake that is super decadent, fluffy, and moist (do people still hate that word?). Another cupcake I love is the peach cobbler cupcake that’s topped with pieces of glazed peaches. Such a tasty treat. There’s usually a line out the door so be prepared to wait for your goodies. —E.D.Simply WholesomeIt’s a few miles from Inglewood, but this place has a terrific vibe and great people-watching. My favorite juice is the Reawaken, made with organic mint leaves, apple juice, orange juice, fresh sprouts, turmeric powder, and a hint of crystallized ginger. —B.J.Explore Bon AppétitSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-09", "author": ["Condé Nast", "Elize Diop", "Brad Johnson"]}