{"id": "96766e33f52e012b9f693a544268acb9", "url": "https://www.bonappetit.com/recipe/coconut-ginger-and-mushroom-noodles", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Coconut, Ginger, and Mushroom Noodles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueCoconut, Ginger, and Mushroom NoodlesBy Lara LeeNovember 2, 20204.2(43)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'mytrek Brown, Props from Meilen CeramicsEmailPinterestPrintEmailPinterestPrintThe high notes of these vegan, umami-laden noodles from Lara Lee, the author of Coconut and Sambal, are caramelized shiitake mushrooms, amplified by toasted coconut and ginger, brightened with quick-pickled mushrooms on top. Kecap manis and black rice vinegar gives depth, sweetness, and acidity, bringing the other flavors of the dish into sharp focus. No kecap manis? Substitute 2 Tbsp. dark soy sauce mixed with 2 Tbsp. palm sugar or brown sugar.Ingredients4 Servings2Tbsp. granulated sugar½cup plus 2 Tbsp. black (Chinkiang) vinegar or unseasoned rice vinegar6Tbsp. light soy sauce, divided12oz. shiitake mushrooms, stems removed, thinly sliced, divided15” piece ginger, peeled, cut into matchsticks, divided½cup raw cashews½cup unsweetened shredded coconut8oz. dried soba noodles2Tbsp. kecap manis (sweet soy sauce)6Tbsp. vegetable oil, divided12canned baby corn, halved crosswise8oz. green beans, trimmed, cut into thirds6small shallots, thinly slicedPreparationStep 1Preheat oven to 350°. Heat sugar, ½ cup vinegar, 2 Tbsp. soy sauce, and ⅓ cup water in a small saucepan over low, stirring to dissolve sugar. Add a quarter of mushrooms and half of ginger. Return to a simmer and cook 4 minutes. Let pickled mushrooms cool.Step 2Spread out cashews on one side of a baking sheet and coconut on the other. Toast, undisturbed, until most of coconut is golden brown, 5–7 minutes. Remove from oven; transfer coconut to a plate. Toss nuts; continue to toast until golden brown, about 5 minutes longer. Transfer to plate; let cool.Step 3Meanwhile, cook noodles according to package directions. Drain and rinse under cold running water. Set aside.Step 4Whisk kecap manis, 2 Tbsp. oil, remaining 2 Tbsp. vinegar, and remaining 4 Tbsp. soy sauce in a small bowl; set sauce aside.Step 5Heat 2 Tbsp. oil in a large pot. Cook remaining mushrooms, stirring occasionally, until browned, about 5 minutes. Transfer to a plate; wipe out pot. Heat 1 Tbsp. oil in pot; cook corn and beans, stirring occasionally, until tender, about 5 minutes. Transfer to plate. Reduce heat to medium; heat remaining 1 Tbsp. oil in pot. Cook shallots and remaining ginger, stirring, until softened, about 2 minutes. Return mushrooms, corn, and beans to pot and toss to combine, then toss in noodles. Add cashews, coconut, and reserved sauce and cook, tossing, until noodles are coated in sauce and warmed through, about 1 minute.Step 6Divide noodles among bowls and top with drained pickled mushrooms.How would you rate Coconut, Ginger, and Mushroom Noodles?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThe umami flavors make this dish special. You can easily condense the steps by just doing all the vegetables as a stir fry and roasting of the cashews and coconut in a cast iron pan earlier in the day or the day before. Next time I will also probably do the pickling earlier so it'll come together fast and cut down on the counter-clutter.  Whatever veggies you have on hand will work - for us it was snap peas and baby cauliflower instead of corn and green beans. I liked all the ginger - cut it toothpick size almost though. It's a keeper for us.AnonymousMiami,FL2/27/2021This was such a treat—deeply savoury, sweet, tangy with crispy and chewy textures throughout. My toddler and I made this together (I stir-fried his version first with just a bit of the sauce mixture), as directed. All of us (well, two adults and a toddler on lockdown together) loved the dish. Thank you!Episcopal priestUSA2/25/2021Changed it up a bit based on what we had.  Used asparagus instead of bean and cut them in half both ways, added a sliced garlic clove and shrimp.  I did not have shallots so used some red onion.  And my husband bought a small card of corn instead of small corn,  I cooked the corn with the asparagus which roasted it a little.  was amazing.   Also the sauce was a mix of soy and coco aminos.   Turned out great.AnonymousMt Dora, Florida2/13/2021We loved this, hearty and generous (5-6 servings, I'd say? leftovers heat well on stove). The pickled mushrooms are great, full of flavor (although agree with others, a little heavy on the ginger, I might cut next time and will definitely chop finer matchsticks!). To streamline dirty dishes: I did the pickled part in a small saucepan then made the separate sauce in a bowl, as directed. But I skipped the oven and used already roasted lightly-salted cashews, and just toasted the coconut in a large frying pan (sort of wok shaped). With all that done, I boiled noodles in that same pan (a little awkward, but saved a pot). Then proceeded with recipe. It was still a lot of steps, but at least fewer dishes!Hannah1/22/2021Way too many steps for flavor that didn’t really payoff. I agree with another poster that there were so many servings and not much flavor. I ended up dumping half of it just due to the sheer volume of product left over. I followed recipe exactly except I had to substitute hearts of palm for the baby carrots due to availability. KatyLos Angeles, CA12/26/2020The pickled mushrooms are the cherry on top and really amp up the flavor.  More prep than I like but it was worth it in the end.  Lasted for many tasty work lunches.LTChicago12/15/2020Delicious recipe, such lovely flavours, absolutely loved the pickle with especially the ginger. \nAnd the coconut YUMMMM!\nGreat potion sizes. Loved it!! Caroline ThomasNorfolk12/6/2020So good. Definitely more than 4 servings. I had to substitute the kecap manis with soy sauce and brown sugar, still tasted delicious. I loved all the different flavor notes – toasty nuts and coconut, sour pickled mushrooms, umami sauteed mushrooms, bitey ginger, a little sweetness. I personally will go easy on the ginger next time, it was a bit overpowering since it's used in two applications. Nevertheless, I enjoyed eating this for lunch all week!BrittneyDallas, TX12/5/2020We loved this recipe. I usually follow recipes to the T the first time I make them. This was no exception. Didn't find it difficult as I did a lot of the prep ahead. I did substitute portabella mushroom as our grocer did not have shiitake. They were perfect. And speaking of mushrooms, the pickled ones were delicious. Will double that amount next time! will enter this winner into the rotation!!LoriTacoma, WA12/5/2020Very good. I toasted the cashew and coconut on the stove- easier to watch the desired level of toasting this way. I also added sugar snap peas instead of green beans because that’s what I had on hand and added a diced jalapeño pepper. This makes a big batch 6-8 servings. RcmartoneHouston, TX11/21/2020Yum! This was delicious. I made it exactly as written.  I had never used black vinegar, and I thought it added a great interesting flavor. I put a lot of sriracha on mine - great combo. Erin Peshastin 11/17/2020Delicious! The combination of noodles, pickled mushrooms,  baby corn and kecap manis is an amazing combination.  I am excited to make this again AnonymousBoston MA11/10/2020Taste-OK (seems a little under-seasoned? Maybe MSG would help?) \nTime/effort-high! Lots of prep, lots of dirty dishes, lots of steps\nYield-way more than 4 servings! So far I've had about 4 servings from this but there's about 1/2 of the recipe left. \nOther-please keep it up with the vegan recipes! ErinPortland, OR11/6/2020Explore Bon AppétitCoconutFruitGingerHerbs & SpicesShiitake MushroomMushroomVegetableMainDairy-FreeVegetarianVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-02", "author": ["Condé Nast", "Lara Lee"]}