{"id": "9680b60c4605aa55c618351012efa616", "url": "https://www.bonappetit.com/story/leftover-buttermilk", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "What to Do With Leftover Buttermilk  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLeftover Buttermilk Is a Blessing, Not a CurseYou bought buttermilk and only used 2 tablespoons for a recipe? Here’s what to do with the rest.By Sarah JampelJuly 16, 2019FacebookTwitterEmailFacebookTwitterEmailSo you made Carla Lalli Music’s Giant No-Flip Blueberry Pancake, which calls for 1 1/2 cups of buttermilk, and now you’re stuck—pardon me, you’re blessed—with a half-full bottle of leftover buttermilk. You’re buttermilk rich!Maybe in your past life you would’ve let that buttermilk languish in the fridge, slowly migrating to the back behind the who-knows-how-old jam and the maybe-it’s-chili-sauce, only to be disposed of when your lease ends and you’re forced to clean out the fridge.In your new identity as a wildly resourceful kitchen whiz, however, you will consider that buttermilk to be a boon, not a burden. It’s about to make your biscuits higher and your chicken juicier.Consider this pancake an extremely good reason to buy buttermilk.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesFirst, what is buttermilk? In times of olde, it was the liquid leftover from churning butter. In grocery stores today, most buttermilk cartons consist of milk that has been cultured with bacteria, causing it to thicken and sour.And what is it good for? The sweet, buttery treats you live for. While not as sour as vinegar or lemon juice, buttermilk contributes a subtle tang that gives your palate a break from that sugar and fat. Because it’s acidic, it also acts as a tenderizer, eating away at long strands of gluten that could make muffins, cakes, or quick breads tough. And because buttermilk is thicker and creamier than milk, what it goes into comes out softer and richer.But that’s not all. Buttermilk contributes to leavening, working with its friend baking soda to produce the carbon dioxide gas that cause batters and doughs to rise when they hit heat, making for fluffier pancakes and crackly-ier fried chicken (because more rising = more air bubbles = crispier breading).If you find Kate's Buttermilk, snag it. It's the real deal, made the old-fashioned way.\nLaura MurraySpeaking of chicken (we were!), buttermilk tenderizes meat, which makes it a great marinade. (Have you even heard of Samin Nosrat?) It adds a zingy punch to places where you’d normally add milk or cream—like soups and chowda-s, dressings, mashed potatoes—so you can eat more dairy without feeling like you’re…eating more dairy.When making subs and swaps, remember: Buttermilk is more acidic than milk, less fatty than cream, and thinner than yogurt. As a general rule, don’t mess with baking recipes (which have been specifically formulated for a certain type of dairy), but experiment with dishes where the, ahem, chemistry, isn’t as important. Start with adding just a bit of buttermilk in place of the called-for fat, then go from there.Here are 10 no-brainer ways to use it up:Use it to brine a chicken before roasting (the acidity makes the meat super tender)Add a splash into your favorite creamy dip (have chips at the ready!)Make a simple buttermilk dressing with lemon juice, olive oil, salt, then toss with your favorite simple green salad (or swap out part of the yogurt in our Every Night Salad and use buttermilk instead)Fry chicken? A little ambitious, but with buttermilk in the fridge, you’re “halfway” (okay, 8 percent) thereButtermilk ranch, for drizzling over pizza or dunking carrotsSweeten with sugar, then pour over sliced peaches or a handful of ripe berries (mmm!)Blend into your next smoothie (bonus points if you add roasted strawberries and tahini)Mix with mayo and lemon juice, then use that to soften a summer slawReplace some of the whole milk for buttermilk when you’re mashing potatoes…...or making Adult Mac and CheeseButtermilk will last for two to three weeks once it’s open (signs it’s bad: it’s too thick to pour or measure; it’s discolored or, gasp, moldy; it’s sour-smelling and less buttery-tasting). That gives you all the time in the world (okay, okay two to three weeks) to work on your buttermilk biscuit game. Clocks start now!Even more buttermilk recipes:1 / 37ChevronChevronBA’s Best Buttermilk PancakesView RecipeExplore Bon AppétitButtermilkDairyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Sarah Jampel"]}