{"id": "968c43ac3b8c75a3d6429a95a39f6429", "url": "https://www.bonappetit.com/story/gochugaru-korean-chile-flakes", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "Please Don’t Tell My Other Chile Flakes That Gochugaru Is My Favorite | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePlease Don’t Tell My Other Chile Flakes That This One Is My FavoriteI sprinkle fruity, sweet, and smoky Korean gochugaru on basically everything I cook.By Christina ChaeyMarch 8, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailOpen my spice drawer and you’ll find no fewer than four kinds of chile flakes, all of which are meticulously labeled with green tape and Sharpie because that is the kind of freak cook I am. I refuse to do the sane thing, which is to Kondo it all and stock only one kind (Carla Lalli Music is good at this; I am not), because I love them all too much. I crave the fiery heat from a good shake of crushed red pepper flakes on pastas and pizza. I sprinkle savory and bright Aleppo-style pepper on everything from dips to quick pickles to avocado toast. But the chile flake I cook with the most often is Korean gochugaru (GO-choo-GAH-roo).This crunchy fennel dish gets dressed in a spicy-tangy-sweet gochugaru sauce.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelI think of gochugaru as an ideal gateway chile flake for spice scaredies. Its heat is gentle and nowhere near as hot as an equivalent amount of crushed red pepper flakes—think more like poblano- or jalapeño-level hot. And where some chile flakes are blah and one-note, gochugaru has so much more to offer with its fruity, smoky, and sweet smell and flavor. It’s the ingredient that gives kimchi its signature heat and color, and also a common flavoring agent in Korean soups and stews like Kimchi Jjigae or the fiery soft tofu stew known as soondubu.But gochugaru’s uses extend far beyond the world of kimchi and kimchi-based stews. Use it to make the garlicky chile oil that’s spooned over these steak short ribs. Shower popcorn, dips, and toasts with a hit of that crimson glitter. Make Crunchy Gochujang Fennel, because spicy fennel deserves to be more of a thing. Make senior food editor Chris Morocco’s hot-sweet-salty take on bulgogi, then make it two more times this week because it is that good.Look for brands that say \"taekyung\" or \"taeyangcho\" on the package—this means the chiles have been sun-dried rather than artificially dried.\nPhoto by Chelsie CraigNow that I’ve convinced you it’s perfectly normal and acceptable to add another chile flake to your budding collection, here are a few Helpful Buying Tips: First, it’s absolutely worth paying a bit more for the good stuff. In the world of gochugaru, that means looking for the words “sun-dried” (also “taekyung”/“taeyangcho”) on the package. Look for coarse flakes, which resemble flaky sea salt, and are the go-to style in Korean kitchens (finer gochugaru is often used for making gochujang.) Many Korean cooks keep a huge bag of gochugaru on hand (I store in my freezer to keep it fresh), but if you’re not planning to make gallons of your own kimchi, buy in smaller quantities and re-up as needed. And although you can now generally find gochugaru at well-stocked Asian grocers, I find it can be overwhelming to compare brands on the spot, which is why I recommend buying it—where else?—online.Buy It: Medium Spicy Tae-kyung Korean Red Chili Pepper Powder, $10 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitKoreanChileSpiceShoppingRead MorecookingYou Probably Have Way Too Many Spices in Your Spice DrawerBy Carla Lalli MusiccookingThese Buttery Kimchi Noodles Are My Desert-Island Pantry DinnerBy Christina ChaeycookingThis Kimchi Tofu Soup Saves Me When My Sinuses Go On the AttackBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-08", "author": ["Condé Nast", "Christina Chaey"]}