{"id": "969c823761d2f7a0cd044a06e9c2b06a", "url": "https://www.bonappetit.com/story/spring-feud", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "All ‘Gussed Up and Nowhere To Go | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll ‘Gussed Up and Nowhere To GoAs in, asparagus. A quick and easy stir fry recipe was the highlight of Alex Beggs’s week, plus more from her Friday newsletter.By Alex BeggsMay 23, 2020FacebookTwitterEmailPhoto by Laura Murray, food styling by Rebecca JurkevichFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.‘Gussed upWith two bunches of fat, new season asparagus from Detroit’s Eastern Market (the only place I’m a regular now), I made this pork and asparagus stir fry + side of white rice earlier in the week. The next day we used the leftover rice and a stray Ball Park Frank to make hot dog fried rice and it’s too bad we don’t have a recipe for that, but you can use your imagination.Get the recipe: Pork and Asparagus Stir FryWant this letter before it hits the website? Sign up for our newsletter!Photo by Laura Murray, Food Styling by Susan Spungen Witness my fitness“You’re a sexy coffee table!” Okaaaay. I was bear-squatting (new move) during an Aaptiv workout called “Buns on Deck” with my favorite trainer, Ackeem, who had me envisioning my flattened back as a surface for condensating water glasses and bowls of peanuts. “I’m EXERCISINGGGGG” I grunted to no one.I’ve found small ways to stay active in isolation, and using this audio workout app is what’s been working for me. Until I injured my knee squatting in front of the fridge looking for snacks, things were going great. Now I’ve got to ice it and recover. Hope your week was better!My sister’s was. She made the Basically billionaire bars, which she calls “enhanced Twix,” and stashed the remainder of the batch in her freezer. That’s the only way I could make this opening section about a recipe for you to click!!Make them: Tahini Billionaire BarsAlex LauAs our lives change, from whateverBefore I became a young professional, I was a nanny to a boy named Henry and next week he is graduating high school, well, sort of. Virtually. Remotely. Via Zoom? Who knows. All I know is I won’t be able to go and that makes me sad. I didn’t know how to cook a damn thing when I was in charge of his well-being, so I blanched a lot of broccoli. One evening, while I was watching the broccoli float in a pot of boiling water, Henry walked over cradling his cat, Mr. Victor, and said, “Alex, Mr. Victor wants a kiss on the head!” and suddenly Mr. Victor’s tail swipes under the broccoli pot and IS ON FIRE. I said a very bad word! There was much shrieking! We patted the tail out with a kitchen towel. Mr. Victor scurried away with his singed tail-tip but the scent of burnt hair in the kitchen remained.Congratulations, Henry!Photo by Alex LauGood morningI love love loved this piece by Dwight Garner about breakfast in (great) books. Best read with brown butter oatmeal and hot coffee. “I’d like to be more like Ralph Ellison,” says Garner, “who wrote to a friend that he dismayed people ‘with the vast damage I could do to a pan of biscuits.’” I also had no idea how much James Bond liked scrambled eggs!Haha but reallyUnnecessary food meme of the weekUnnecessary food feud of the weekAlex LauTucked in a Slack channel where articles are previewed, Adam Rapoport dropped a controversial take: “I would like to officially go on record as saying that spring is bullshit.” “You’ve said this on every Zoom I’ve been on with you,” replied Emily Schultz, rolling her eyes through the WiFi wavelengths. “Omg that is old news everyone knows spring is BS,” added known abbreviator Molly Baz. Meryl Rothstein even wrote about Spring Suckage last year. Wow! Who knew people had so many feelings about SEASONS. Here I was, just enduring them one after the next, year after year! “I'm eating rhubarb under a down comforter,” grumped bed-dweller Christina Chaey. “Spring is the worst season,” said Emmy-nominated weatherman Alex Delany: “It’s fall but instead of wanting to put a coat on, you want to take one off. And it's raining.” Carla Lalli Music mused on the shortcomings of spring in the Northeast, where “our farmers’ market right now has: 9-month old apples, pock-marked radishes, and year-old maple syrup. And you have to get in a fistfight for some ramps.” Sohla El-Waylly came in cold: “I’m firmly anti-summer and want it to be winter year-round.” “I like spring,” said Sarah Jampel, but her three words sort of dissipated into the breeze like dandelion fuzz.(For the record I’m pro-spring, pro-rhubarb daiquiris.)Explore Bon AppétitBeggs NewsletterRead MorecookingThis Pink Drink Is My Favorite Way to Consume RhubarbBy Alex BeggscookingAn Asparagus Stir-Fry That’ll Get the Whole Family to the TableBy Deb PerelmancookingHow to Buy the Best Tahini For the JobBy MacKenzie Chung FegancookingRhubarb Shrub is Spring in a BottleBy Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-23", "author": ["Condé Nast", "Alex Beggs"]}