{"id": "969f64fcf56799a86142593d732fa577", "url": "https://www.bonappetit.com/story/chocolate-tahini-woo-hoo", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Chocolate Tahini, Hello, You Want This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChocolate Tahini, Hello, You Want ThisThat’s right. Chocolate tahini.By Alex BeggsJanuary 23, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIt’s important in the life of a snacker to have a collection of condiments and spreads so vast you’ll never get bored. Or this is what I tell myself when I go hunting in the pantry for my precious chocolate tahini. That’s right. Chocolate tahini. Not black tahini—which we also love. Everybody’s favorite sesame paste now comes in sweet chocolate flavor and there is nothing not to love about this fact.This brilliant product has the smooth, spreadable texture of regular tahini, but a rich, chocolaty flavor that I have to admit—tastes like frosting. The jar beside my keyboard as we speak is Sesame King, ($11 on Amazon, though you might be able to find it cheaper at your local grocery store) which comes in this wonderfully normal white plastic jar with a close-up of a sensual strawberry in a tahini bath. High in fiber! It whispers atop the label. Vegan! Peanut free! 100% Pure! Non-GMO! I almost forgot one: Gluten-free! There’s a lot going on here. But this is a chocolate spread, people, made with powdered sugar.  If you want health food, try the produce aisle.At first, I treated it like Nutella, spreading it on crusty toasted bread, and dipping apples in it because apparently I’m an 8-year old watching Kim Possible after school. Then I graduated to eating it straight from the plastic jar in moments of need. But there’s so much more you can do.Warm up your milk of choice with some tahini and boom, tahini hot chocolate is born.\nAlex LauActual cooking-wise, you can have a lot of fun playing with it in all of your favorite tahini desserts. I make tahini hot chocolate with it (have you ever had this? You need to have this), dollop it into this wildly good sesame banana bread batter, or make chocolate tahini cookies. Note that because the chocolate tahini has added sugar in it, when you substitute it for regular tahini in any recipe, you’ll want to decrease the amount of sugar elsewhere to balance the sweetness. For example, when I made these tahini cookies with the chocolate tahini, I decreased the sugar from ¾ cup to ¼.So look into your crowded pantry—is that a tiny void between the buckwheat flour and dried persimmon? I know just the thing that can fit in there.Buy it: Sesame King's chocolate tahini, $11 on Amazon.Feeling savory instead? Make this green tahini sauce, then put it on everything:Explore Bon AppétitWere Into ItShoppingTahiniChocolateBA RecommendsRead MorecookingThese Tahini Cookies Are Like Peanut Butter Cookies 3.0By Alex BeggscookingThese Gluten-Free Tahini Brownies Are Annoyingly GoodBy Chris MoroccoshoppingBlack Tahini Is Exactly What It Sounds Like, Which Is DeliciousBy Christine Muhlkerecipes36 Tahini Recipes for Hummus, Cookies, Noodles, Meat, and MoreGallery37 SlidesBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-23", "author": ["Condé Nast", "Alex Beggs"]}