{"id": "96a3a0ac17335a6f7c1dbb9da6019d61", "url": "https://www.bonappetit.com/story/sarah-pratt-butter-cow-iowa-state-fair", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "How to Sculpt a Life-Size Cow From Butter, and Other Lessons From a Professional Butter Artist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Sculpt a Life-Size Cow From Butter, and Other Lessons From a Professional Butter ArtistIn the fall and winter, Sarah Pratt is a special education teacher. In the summer, she sculpts butter.By Emma MannheimerAugust 22, 2018FacebookTwitterEmailCharles Ommanney/The Washington Post/Getty ImagesFacebookTwitterEmailThe request to sculpt a stranger’s head out of butter was one Sarah Pratt would have usually turned down. But it was for a surprise birthday party. Thrown for an aspiring Minnesotan dairy princess! A dream the woman had since childhood! And she had curly hair!“I don't know why I did it,“ Pratt tells me, laughing. It seemed like an artistic opportunity.It certainly wouldn’t have been her first. Head, that is. Pratt has sculpted loads of butter heads atop butter bodies—Harry Potter, Captain Kirk, Monopoly’s Rich Uncle Pennybags—but this summer marked the first time the face of an utter stranger chilled in her refrigerator.Pratt is recounting this story for me on a sweaty August Sunday during the Iowa State Fair. It’s 8:30 in morning and the fairgrounds are showing signs of deep-fried life. Pickledawgs slumber gently in ham blankets waiting to be dropped in oil at the Dawghouse Concessions stand, while down the road, syrupy pieces of cherry pie will be skewered then, duh, fried. We’re standing near a glass-front cooler observing Pratt’s most celebrated creation, the icon of America’s most American state fair: the Iowa State Fair Butter Cow.Close your eyes and envision a life-size cow, perfect in every bovine respect—back straighter than the edge of a cardboard milk carton, udder attached high and wide—only, carved from enough butter to slather 19,200 pieces of toast (around 500 pounds). It’d probably look a lot like what I’m staring at. “It’s intended to be the ideal cow,” Pratt explains. “Generally, even the grand champion [cow] doesn’t even have all of those aspects.”Pratt and the butter cow in-process.\nAP Photo/Charlie NeibergallBorn in the tiny town of Toledo, Iowa, Pratt is the fifth-ever appointed Butter Cow sculptor in the fair’s history, a tradition thought up in 1911 as a promotional feat for the golden fat as well as for Midwest dairy farmers. Pratt, 41, doesn’t remember a time visiting the fair as a kid and not seeing the meta, milk-made cow. It wasn’t until age 14 she got hands-on. While assisting a friend who competed in 4-H, a teen-aged Pratt bombed at real-life cow tasks and was herded to the cooler where she could presumably do the least damage. There, the legendary Norma “Duffy” Lyon—the great aunt of her 4-H friend, fellow Toledo local, and 45-year veteran Butter Cow carver—coached Pratt in softening 1,000-plus pounds of frozen butter into a pliable medium, the ins and outs of the tools needed to craft everything from sweetly staring cow eyes to individual tail hairs, and creative problem solving (“What would Norma do?”). More than the butter stuck: For 14 consecutive summers, Lyon called her budding apprentice back.Glorious.\nJohn Dominis/The LIFE Picture Collection/Getty ImagesPratt studied under Lyon until age 28, when she was handed the reins to go solo. Now, a grade school special education teacher by fall-winter-spring and butter artist by summer, she makes the rounds chiseling locally sourced salted (it acts as a preservative) butter at the Kansas, Illinois, and Iowa state fairs. This is the 13th year she’s designed Iowa’s dairy darling, welding the metal-and-wire armature that supports the sculpture, then tooling the oily form of a Jersey cow (“The sweetest cow of them all”) onto it with bare hands.Surveying her chef d'oeuvre from within the 40-degree cooler, Pratt absentmindedly works a handful of butter. It emits squelching noises with each knead and the air surrounding us is flavored like obscenely ripe blue cheese—the gross smell of decade-old butter reused annually, becoming progressively smoother with each carving.“The face is kind of my favorite but it’s also been my greatest nemesis,” she says thoughtfully. “You think you know what something looks like until you try to recreate it.” With no arts degree, Pratt is self-taught in all aspects of the job: from the nuances of different cow breeds to the techniques required to translate lifelike musculature through a dairy-based spread. This year, she also carved a 1918 John Deere tractor for the fair.If the weird world of butter sculpting strikes you as something that belongs to a select group of individuals, good call. “There might be half a dozen butter sculptors in the nation. I look at their sculptures online, but we’ve never been in the same place at the same time,” Pratt says. Yet she is slowly changing that by developing sculpting curriculum to share and teach the centuries-old art form locally at schools in West Des Moines.In many ways, Pratt sees butter akin to traditional mediums like clay. The one undeniable difference (aside from the fact it’s the only delicious one) is the ephemeral nature of the stuff—the sculptures are dismantled and turned back into, well, butter at the fair’s end, bucketed and locked in a deep freeze near the edge of town until next year. “It’s kind of like life,” she says. “You build up a life, then something’s gonna happen, and you just build it up again. Yeah, it’s a process but there’s beauty in that process, I think.”We shake hands as I depart the cooler, slightly numbed. Stepping into the sunlight, a slick sheen of butter glitters on my hand.Related: What It's Like to Be a Professional Chocolate TasterSculpt butter—or make your own, like Brad:Explore Bon AppétitButterIowaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-22", "author": ["Condé Nast", "Emma Mannheimer"]}