{"id": "96baf795a7e3fad0d1db926583f830f9", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/everson-royce-bar", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Everson Royce Bar Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesEverson Royce BarWind down with chefs at this Arts District barFacebookPinterestTwitterEmailRen FullerGO: for ERB’s signature balancing act of sending out chill vibes and fine-tuning all the right things (a simple, satisfying burger, taquitos!).ORDER THE: bar snack-y foods that Matt Molina, a James Beard award-winning chef, has perfected, like smoky potato taquitos with a refreshing tomatillo-avocado salsa, the single burger with prime beef chuck and dill pickles, extra crisp fries, and the “token” Frenchie salad with lots of crunch (little gems, breakfast radishes). Randy Clement of Silverlake Wines runs the beverage program (and co-owns the space with Molina), so let the staff guide you to kind of wine you’re in the mood for.THE VIBE IS: your very stylish friend’s backyard party. Sure, you can’t go wrong sitting at the sleek bar or cozied up at one of the black leather booths inside, but you’re in always-sunny L.A. and that’s enough reason to hang out in the back with all the other Arts District locals and chefs off the clock.PRACTICAL STUFF: Open every day: Monday to Thursday and Saturday, 5 p.m. to 2 a.m.; Friday, 4 p.m. to 2 a.m., and Sunday, 2 p.m. to midnight. It’s not super necessary, but you can reserve ahead.—Elyse InamineRen FullerWE ALSO LOVERustic CanyonWhere seasonal veg meets serious meat in Santa MonicaThe Walker InnFor when you want something quiet, cool, and intimate in KoreatownWinsomeL.A. plays itself at this whimsical Echo Park caféExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}