{"id": "96c47a9adb072d9febb4e67f633eeae5", "url": "https://www.bonappetit.com/story/flowers-of-vietnam-detroit", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Flowers of Vietnam Is As Detroit As It Gets | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFlowers of Vietnam Is As Detroit As It GetsOur food scene seems to promise a Detroit experience without actual native Detroiters. This restaurant is the good kind of exception.By Dream HamptonJune 6, 2018FacebookTwitterEmailPhoto by Michelle & Chris GerardFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.“I only want problems worth having,” a wise but exasperated Detroit native (a stranger seated nearby) once said over dinner. Detroit has a food problem. Our new food problem isn’t connected to our old food problem, which was misdescribed by the concerned as everything from “food desert” to “food swamp.” What, in fact, began happening when I was born in my beleaguered hometown in the ’70s was a corporate boycott of our super black city. It extended from restaurants to grocery stores that would open, say, up to half a dozen locations in historically Waspy neighborhoods like Grosse Pointe, while pretending Detroit itself didn’t exist. Detroiters, who, it turns out, do indeed eat food, solved that problem long ago by transforming over a thousand vacant lots into beautiful food gardens. No, our new problem is the same old segregation that led to the white mob riots in 1943 and the black rebellion in 1967. We've got new restaurants seemingly so averse to hiring from Detroit's local population (83 percent of whom are black), that they posted billboards in Brooklyn and Manhattan looking for waitstaff.What could truly be an exciting food scene is made ridiculous by staff casting that is simply offensive. Our food scene seems to promise a Detroit experience without actual native Detroiters. I’m spending a significant portion of a pretty small article complaining about said food scene because that’s what us Detroiters do: plop down in one of the newest joints that is flash-frying squash blossoms to perfection, only to bemoan the white-washing of it all.The salt and pepper prawns.\nPhoto by Michelle & Chris GerardFlowers of Vietnam is a blissful exception to Detroit’s segregated landscape. In 2016 chef George Azar, then 27, convinced his Palestinian dad to let him do weekend night pop-ups in the Mexicantown Vernor Coney Island diner he leased. We flocked there for the salty Tôm Rang Muối (salt and pepper prawns), while George stood behind the counter bullying us into eating the shrimp’s crunchy shell head “the right way.”Azar worked in kitchens such as Alinea in Chicago and Bouchon Bistro in Las Vegas, but like a lot of us Detroiters, he felt compelled to return home for what finally looked like the city’s long promised renaissance. Later, Azar began focusing on contributing to Detroit’s rebirth, “which may feel clichè but definitely feels right as a Detroiter.”Detroit’s hipster restaurant revival began in earnest in 2005 at Phil Cooley’s barbecue spot, Slows, so Azar knew to include familiar items on the Flowers of Vietnam menu. “The whole reason that I serve chicken wings is because I know my fellow Detroiters, and I know my Michigan clientele. I’m like, Look bro, look, here’s these chicken wings. They’re into it because they’re crispy and glossy. After, I’ll spring the fact that the caramelization comes from fish sauce.”Flowers of Vietnam was named one the country’s best new restaurants by GQ in 2017, and went from pop-up to full-time restaurant this January. When Azar transformed the Coney into more than a pop-up, he “wanted to keep the Coney alive as much as possible.” When he created the horseshoe bar and uncovered distressed walls, he simply sealed the exposed platers.Most of Flowers of Vietnam’s cultlike following, who’ve been returning since it was a pop-up, are loyal because the food is bright, authentic, delicious. Some of us native Detroiters are relieved to see a place whose kitchen is brilliant and consistent and where the floor looks like we’re in the D. As to why his fellow local restaurateurs can’t seem to find even a black dishwasher for their open kitchens: “I don’t know, maybe they’re scared that women from Birmingham [MI] will turn around and head back to the suburbs. Not me. I put Vera right up front at the host stand. She’s as Detroit as it gets.” Indeed, Vera rubbed my back as she guided me to the bar because I’d failed to make reservations at Detroit’s newest and best hot spot. When the bartender told me my favorite, the bok choy, had been 86ed ten minutes before I sat down, a cool white couple slid me their untouched side dish of the charred, spicy, sweet stems and silently accepted my grateful fist bump.dream hampton is a writer, cultural critic, and filmmaker currently producing a docuseries about R. Kelly for Lifetime television.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsDetroitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Dream Hampton"]}