{"id": "96d0f6549dad3b8a3c3384162fd6ec09", "url": "https://www.bonappetit.com/recipe/broccoli-melts", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Broccoli Melts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueBroccoli MeltsBy Sarah JampelFebruary 9, 20214.8(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintHere’s a working-from-home lunch that’s quick enough to make between Zooms and will send you well on your way to meeting your daily veg quota. While there’s something satisfying about the airy crustiness of a baguette, halved ciabatta rolls or slices of sourdough or whole wheat bread would work just as well.Ingredients2 Servings1small shallot or ¼ red onion, thinly sliced1Tbsp. plus 1½ tsp. sherry vinegar or red wine vinegarPinch of sugarKosher salt, freshly ground pepper1small head of broccoli (8–10 oz.)3Tbsp. extra-virgin olive oil1garlic clove2Tbsp. mayonnaise1tsp. hot chili sauce (such as Sriracha)26\" pieces baguette, halved lengthwise4slices sharp cheddarPreparationStep 1Heat broiler. Combine shallot, vinegar, sugar, and a pinch of salt and pepper in a small bowl. Stir to combine; set aside.Step 2Trim and peel broccoli stem. Remove stem from crown and finely chop. Cut crown into florets, then coarsely chop into bite-size pieces.Step 3Heat oil in a large ovenproof skillet over medium-high. Add broccoli; season with salt. Cook, stirring occasionally, until browned in spots, about 3 minutes. Reduce heat to medium, add ¼ cup water, and cover. Cook until tender, about 2 minutes. Reduce heat to low and uncover. Grate in garlic; add reserved shallot mixture. Cook, stirring, until vinegar is mostly evaporated, about 15 seconds. Transfer to a bowl. Reserve skillet.Step 4Mix mayonnaise and chili sauce in a small bowl. Taste and add more chili sauce if desired.Step 5Broil bread, cut side up, in reserved skillet until lightly toasted, about 1 minute (watch carefully!). Remove from oven and spread mayo mixture over. Spoon broccoli mixture on top, going all the way to the edges (don’t be afraid to pile it on). Drape a slice of cheese over (tear in half if needed).Step 6Broil, watching carefully, until cheese is bubbling and browned, about 3 minutes. Season with pepper.How would you rate Broccoli Melts?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI was really excited to make this sandwich and very disappointed in the results. First of all, it was a lot of work; chopping broccoli, cooking broccoli, grating garlic, thinly slicing red onion and mixing together the mayonnaise.  All said and done, too much work for a low return in the flavor of the results.AnonymousVienna, VA4/27/2021Quick and delicious! Really awesome lunch time meal!AnonymousHouston, TX3/19/2021I made some changes to make it more lazy. I quick pickled the shallots in the vinegar and roasted frozen broccoli with seasoning to cook it. I topped the toasted bread with the hot sauce mixture, broccoli, shallots and cheese and toasted it. Didn't need to use anything but my toaster oven/air fryer and it was delicious!  hansika3/3/2021Simple and delicious. Also great with Italian bread, Swiss cheese and zucchini. Very versatile recipe, will probably try this with all sorts of veggie.AnonymousNY2/19/2021Sooo good! Easy and delicious Colleen M.Wyoming, Pennsylvania2/18/2021Explore Bon AppétitSandwichBroccoliVegetableCheddarCheeseQuickEasyWeeknight MealsMainVegetarianNut-FreeHealthyishBroilLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Sarah Jampel"]}