{"id": "96dd5967f9bc5260b6f2718f1572e273", "url": "https://www.bonappetit.com/story/almonds-anchovies-and-pancetta-november-cookbook-club", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Our November Cookbook Club Pick is Cal Peternell's 'Almonds, Anchovies, and Pancetta' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur November Cookbook Club Pick: ‘Almonds, Anchovies, and Pancetta’ by Cal PeternellA veg-forward cookbook that puts meat in its place (as a handy way to let vegetables shine).By Sarah JampelNovember 1, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Dana BonaguraFacebookTwitterEmailEarlier this summer, some friends and I gathered for a potluck-style dinner party only to find that every single one of us had brought a version of salad. Sure, some were bulked up with crispy bacon, or fried mushrooms, or crumbled cheese, or lots of cooked grains (and, to be honest, mine was mostly pasta), but the takeaway was clear: We all craved vegetables of different shapes and sizes, and lots and lots of greens. Not a big meat centerpiece to be seen.Vegetable-forward cooking, where veg occupies the lion’s share of the plate, is the way most of the world has eaten for millennia. Recently, though, it’s become trendy in American restaurants, and it’s front and center in Cal Peternell’s newest cookbook, Almonds, Anchovies, and Pancetta. The sixty recipes are divided into three eponymous chapters—almonds, anchovies, and pancetta—based on which ingredient is the source of meat (he calls almonds, the clear outlier, “the meat of the plant world”). Petenell uses these ingredient as supporting characters: They’re there to add fat and salt, and thereby flavor and heft, to dishes that are largely plant-based. (The book’s subtitle is “A Vegetarian Cookbook, Kind Of” after all.)Peternell came up with the idea when he was posed with the question, “What’s next for you after Chez Panisse?”—the famed California restaurant where he worked for two decades—at a party for one of his other books. “I’ve always had this fantasy about opening a restaurant called Anchovies and Pancetta, where those are the only meats served,” Peternell said. He added in almonds, which are comparable in terms of fat and umami content, for strict vegetarians. This way of eating, he writes in the introduction, is “healthy, leans toward sustainability, and is economical in a way that pleases both palate and pocketbook.”What makes this book special—and why you’ll want to cook from it whether you’re a vegetarian or you love a good steak—is Peternell’s ability to translate his chef skills to an audience that might not have access to a sous-vide machine and peak-season Sun Golds. His first book, Twelve Recipes, was written for his son, who was leaving home for the first time and cooking in an apartment with a galley kitchen, a rental stove, and a limited budget and schedule. “I was able to keep that concept in my head and allow that to dictate the voice,” Peternell explained to me. He avoids constructing barriers to cooking by choosing his battles carefully, offering only the instructions that he believes will significantly improve the end result, and only in the form of invitation, not admonishment. If Peternell asks you to do something, you can trust that there’s a good reason behind it. “Forge ahead, but think about what would be different if you had a better pan or a sharper knife. Aspire to that.”Pancetta braised until it's fall-apart tender, then mixed with sautéed greens, makes for a savory, smoky side.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraSome recipes are, indeed, aspirational—like artichokes and new onions baked with anchovies and bread crumbs, or warm bread with lardo and black truffle—while others are simply good flavor combinations and delicious-sounding ideas: greens with braised pancetta and garlic; roasted sweet pepper and egg salad with anchovies, olives, and capers; cucumber and green tomato salad with avocado, fish sauce, cilantro, and lime; and steamed clams with almond and parsley butter. Do I hear your stomach grumbling?You know what else anchovies taste great in?And no matter the difficulty level, every recipe will teach you something: Maybe it’s a new kitchen tip (you’ll make less of a mess chopping almonds if you crush them first with a rolling pin) or technique (to pan-roast eggplant so it’s cooked through and evenly brown, place a a slightly smaller skillet, wrapped in foil, on top of them to weigh the slices down). There’s even a bit of Greek mythology (including a creepy story about Zeus, the fertility goddess, and almond trees that you'll have to read for yourself). Peternell gives himself permission to go on tangents in the headnotes, covering everything from the Rossellini movie Stromboli to the steel-drum and ukulele band Sister Exister.Taken together, these intros, which are so much more fun to read than straight recipe-explainers, serve as windows into what connects this delightfully random array of recipes (okonomiyaki, almond butter cookies, a “weird and wonderful” sauce called Anchoïade de Croze): the tastes and experiences of Peternell himself.Combine the rambling prose with Peternell’s practical advice and delicious flavor combinations, and cooking through the recipes feels like having a personal cooking lesson—and a long chat—with the chef himself.Charming illustrations, like this opener for the chapter on anchovies, appear throughout the book.\nPhoto by Chelsie CraigBut wait! Some nitty-gritty advice about our three stars:Almonds: A good Californian, Peternell cooks with whole organic almonds, almost always toasted to bring out their full flavor and crunch. “At some point you will say toast, schmoast and just use your almonds raw,” Peternell knows. “We've all done it.” But in his chef-dad way, he encourages us to give toasting a try and see how much better the finished dish can be.Anchovies: Peternell likes Rizzoli and Agostino Recca anchovies, and prefers those that come salt-packed in jars. If you’ve bought anchovies packed in a metal tin rather than a glass jar, be sure to use them within a few days so that they don’t oxidize and take on a metallic taste. (To extend their life, transfer them to a sealed glass container and make sure they’re covered either with oil or salt, depending on what they came in.)Pancetta: For American-made pancetta, Peternell turns to Fra’Mani or La Quercia. (For the truly adventurous, Peternell also has a recipe for making pancetta yourself, starting with skin-on pork belly.) You’ll want to choose your thickness based on the pancetta’s destiny: You can eat very thin slices raw, like prosciutto, but more commonly, you'll use slightly thicker slices to crisp in the oven or a skillet before crumbling over salads and pastas, and bacon-thick pieces to sauté as a flavorful base for soups, casseroles, and, of course, carbonara.Olive oil: Okay, so this isn’t one of the titular ingredients, but it does play an important role in a huge percentage of the book’s recipes. If you get your hands on good olive oil (we’re just about to enter peak olive oil season in California), use it. Unlike wine, it doesn’t get better with time. “Let it run down your chin and enjoy it,” Peternell says.Don’t mind if I do, Cal. Don't mind if I do.Get the recipe:Greens with Braised Pancetta and GarlicThis satisfying veg-forward dish proves that sometimes the role for meat is as a supporting actor helping to make green things shine.View RecipePick up a copy of Almonds, Anchovies, and Pancetta wherever you buy cookbooks. And if you want to learn more about the BA Cookbook Club and how to start your own club, you’ll find all that right here.Explore Bon AppétitCookbooksPancettacookbook clubRead MorecultureMeet Our October Cookbook Club Pick: Season by Nik SharmaBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Sarah Jampel"]}