{"id": "96efcde1da5b3b82d64841f746fd2eb9", "url": "https://www.bonappetit.com/recipe/tri-tip-steak-with-tiger-bite-sauce", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Tri-Tip Steak With Tiger Bite Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueTri-Tip Steak With Tiger Bite SauceBy Yia VangApril 20, 20204.8(49)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintTiger bite sauce lives up to its name: it’s spicy and deep in umami. Make a double batch and use it throughout the week because you’re going to want extra. This recipe is from Union Hmong Kitchen in Minneapolis, where chef Yia Vang works his wood-fired magic.Ingredients4 servingsSteak2Tbsp. Sichuan peppercorns2Tbsp. coriander seeds1Tbsp. cumin seeds2lb. tri-tip steak or two 1-lb. sirloin steaks¼cup vegetable oil3Tbsp. oyster sauce1Tbsp. fish sauceSauce and assembly1½cups cherry tomatoes1tsp. vegetable oil1small shallot, finely chopped4garlic cloves, finely chopped4Thai chiles, finely chopped½cup finely chopped cilantro1Tbsp. fish sauce1Tbsp. oyster saucePurple Sticky Rice and Little Gem or butter lettuce leaves (for serving)Special EquipmentA spice millPreparationSteakStep 1Toast Sichuan peppercorns, coriander seeds, and cumin seeds in a dry small skillet over medium heat, tossing often, until spices are very fragrant and slightly darkened in color, about 3 minutes. Transfer to a spice mill and let cool; finely grind.Step 2Pat steak dry; season all over with salt. Whisk oil, oyster sauce, fish sauce, and spices in a large bowl. Add steak; turn to coat. Cover and chill 4–12 hours (for the most flavor go the full time!).Step 3Remove steak from marinade and place on a plate. Let sit at room temperature 1 hour before cooking.Step 4Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Grill steak over direct heat until lightly charred, about 2 minutes per side. Move steak over to indirect heat and cover grill, placing vent (if your grill has one) over steak so it draws heat up and over it. Grill, turning steak occasionally, until an instant-read thermometer inserted into the thickest part of steak registers 120°, 20–25 minutes for medium-rare.Step 5Transfer steak to a cutting board and let rest 15 minutes before slicing it against the grain.Sauce and assemblyStep 6While the steak is resting, place a wire rack on direct heat side of grill, arranging so bars run perpendicular to grate. Toss tomatoes with oil in a medium bowl; season with salt. Grill tomatoes in a single layer on rack, turning occasionally, until lightly charred all over and beginning to burst, about 5 minutes. Return to bowl as they’re done and let cool.Step 7Pulse shallot, garlic, chiles, and a pinch of salt in a food processor until mixture starts to resemble a paste. (This is even better in a mortar and pestle, which will create a finer texture.) Add cilantro and pulse until very finely chopped.Step 8Lightly crush tomatoes with your hands and add shallot mixture, lime juice, fish sauce, and oyster sauce. Season sauce with salt; let sit 10 minutes. Serve steak with sauce, rice, and lettuce.How would you rate Tri-Tip Steak With Tiger Bite Sauce?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleReally good. It has several steps: 1st prepare the dry rub ingredients, coat the steak and let it marinate (I let it sit overnight); 2nd make the sauce by grilling the tomatoes, finely chopping shallots garlic and chiles, combining lime juice with fish and oyster sauces, then mushing the tomatoes and combining all the ingredients! 3rd grill the steak and let it sit. 4th adding some of the sauce to the now sliced steak. worth the effort but hard to keep it all straight. The sauce was not as spicy as i thought it would be and I even used more thai chiles than called for. I bought dried and soaked them in hot water.HbcookHuntington Beach, CA6/20/2021Amazing and stand out flavor. I have impressed many guests with this recipe. Stick to the recipe as much as possible! The chef who created this knows what he’s doing.Ana RabaChicago4/4/2021This was delicious! I will be the worst kind of commenter on a recipe however, and offer how I changed things:\n\n- I used 2lbs of skirt steak and marinaded for about 5 hours (it was perfect). To serve, cut against the grain into strips which were a perfect size and fit for the lettuce cup.\n- I used black peppercorns instead of Sichuan. I was worried the black peppercorns might be too much, and I think ultimately I could have dialed them back, but it was still delicious.\n- Juice of 2 limes (but I'm a sucker for citrus)\n- Campari tomatoes instead of cherry. I also grilled 5 scallions and added to the blender with the tomatoes. They added a nice smokey flavor.\n- Thai chilis could not be found so I bought 1 fresno. I ended up using about a 1/2 an inch of it after de-seeding. I'm not a spice wimp but even that little provided a (pleasantly) hot sauce, I have no idea how anyone is using 4 chilis that are apparently like, 10x the spiciness of one fresno?  \n\nServed with sesame jasmine rice, charred broccolini, a sesame cucumber and watermelon radish salad and little gem lettuce cups. This one is definitely a keeper!Alexandra RabeLafayette, CA4/1/2021This is our family’s favorite recipe! We have done the marinade with different time lengths and really like it at 8 hours. Also we’ve made the tiger bite sauce with different levels of spice considering how many serranos we have from our garden. 4 Thai chiles, 3, then 9 serranos and then we settled for 3 serranos this last time and it was amazing. Especially in the summer this is fabulous with fresh tomatoes, herbs and chiles from the garden but we also had it for Christmas dinner with jasmine rice and charred broccoli. **please note that the recipe above is missing limes for the sauce!! You’ll need to juice 2.**Cassie KMinneapolis, MN12/27/2020My son made this for dinner last night and it was incredible. A real flavour kapow. It’s was definitely a big hit. We’ll be making it again. SaraMelbourne, Australia 12/7/2020Instead of grilling can I cook in the oven? If yes, how long and at what temperature?Swapna11/23/2020WOW! Just... wow. This was WELL worth the trek to the Chinese market to find Sichuan peppercorns. This might be my new favorite recipe. I used Applewood lump charcoal which worked well and didn't impart too much of a smoke flavor. Our plates were darn near licked clean. This is absolutely going into my regular rotation.AnonymousSan Francisco, CA8/12/2020Ridiculous!!\n\nDon’t be intimidated by this amazing recipe! It’s so incredibly delicious especially with he abundance of fresh ingredients from the farmers market- specifically cherry tomatoes, cilantro, shallot, garlic and if you have access to it, pasture raised beef. \n\nI nearly tripled this for a small gathering and it was easy, easy, easy! \n\nI have cooked with Sichuan peppercorns before and a little goes a long way. That being said, I opted for 3 T Sichuan peppercorns only and it was plenty (if making a large batch like I did). We also went to the butcher and bought an entire Tri tip sirloin and cut it to 3 lbs. If you have a hard time finding Sichuan peppercorns, try Mala Market. The subtle numbing, yet toasty and floral notes of the Sichuan peppercorns is incredible with the grilled tomato finishing sauce.\n\nFound that the meat could marinate for 8 hours and still have wonderful flavor. The tomato sauce with Thai chili is the star, tho - holy cow - so delicious! Be careful when crushing the hot tomatoes by hand - but don’t be intimidated by the mix of ingredients. \n\nDon’t be intimidated by the chilies! They work so well with the other ingredients, your mouth doesn’t get scorched. We had a friend who really is not a “hot food” fan and he loved it!\n\nI went to our local Asian market and bought a pot, bamboo steamer basket and sticky rice for under $15.00. I had black rice in the pantry. I added more sticky rice that 3 T bc I like sticky rice and for making “the ball” you really need more sticky rice. You can also successfully make the rice by soaking it for 4 hours if you cannot soak for 12.\n\nThe blistered green beans with fried shallot were also delicious! Especially bc they came from the farmers market as well. \nBc I didn’t have a large mortar and pestle, I put all aromatic ingredients into a small sturdy ziplock bag and used a meat tenderizer hammer to make the paste of lemongrass, shallot and garlic. Also, one small shallot is about a heaping tablespoon. That was the one bummer about the recipe - it wasn’t converted into T or other standard measurements for things like “one small shallot” - so I used a heaping tablespoon. Shallots vary greatly in size this time of year. Also, “ juice of two small limes” was again dependent on the size of the limes, so I just used 3 T. Again, I nearly tripled this recipe and found that there was a nice amount of play to some of the ingredients which have a strong backbone like the Sichuan peppercorns, lime juice, shallot, etc...\n\nHad butter lettuce handy for making a nice bite sized wrap and loved that as well - the lettuce adds its own dimension.\n\nWe paired it with a bottle of 2017 Dutton Goldfield Pinot Noir from Marin County. Outstanding! Cannot wait to make again and to also try the other recipe for chicken.\nAnonymousMichigan 7/19/2020This was Fabulous!  i marinated for 24 hours before cooking.  I had some extra chicken thighs that needed to be used, so I also added them to the marinade.  Both the Tri Tip and the chicken worked so well in this preparation!  The depth of flavor was outstanding, and I had some cherry tomatoes from m garden to grill.  I did not have a grill basket, so I grilled tomatoes on the grates, and everything was just fine.  Will definitely make this again!! \nAnonymousLos Angeles, CA7/9/2020Delicious in a punch your taste buds kind of way.  Lots of flavors and zing - almost too much. Plain white rice was definitely the appropriate side to cleanse the palate between bites. Reminded me of the over the top flavors at Mission Chinese. EssieDeeStamford ct6/21/2020This steak is insanely good. I’ve never had anything like it. It is great with or without the sauce. The marinade has the most unique flavor and adds so much depth to this steak. I marinated it for about 8 hours. I couldn’t find the Sichuan peppercorns at the Asian market so I used black peppercorns instead. I will be making this again. I’ve recommended it to several people already.AnonymousOro Valley, Arizona5/28/2020TIGERLICIOUS! This steak made me slow down and savor each lil tiger bite. I used filet mignon and it was so good. Unusual, delicious... I think I finally understand Umami. I was a bit skeptical when I first made my sauce. I actually made it Paleo by using avocado oil and substituting coconut aminos for oyster sauce, and I used two red chiles and two jalapenos (sans seeds) because I have the digestive system of a baby. I thought maybe I had ruined it, but once the sauce was combined with the steak it was AMAZING (also just the right amount of heat). As others have mentioned, Limes are missing from the recipe. I used the juice of two limes and it was perfection IMHO. I marinated my steaks for about 12 hours and made the sauce ahead of time too, and I think that was key. The flavor of the sauce just got better and better. Twas worth the effort!CraverlyGulf Shores, Alabama5/28/2020We used this marinade on hanger steak and it was beyond good.  So good that the first time we made I forgot to serve the sauce, and we didn't miss it.  The second time we made it I remembered to serve the sauce but we found the combination far less appealing.  The sauce overwhelmed all of the other flavors and, IMHO, made the whole dish confusing.  Don't get me wrong - I think the marinade and the sauce were both good, but not on the same dish.  I have since tried both the marinade and the sauce on fish as well as meat and both were crazy good, but not together., so I only gave it 4 stars.   independently, I would give each 5 stars.AnonymousPortland, OR5/25/2020BEST STEAK EVER! I was feeling super fancy after plating this delicious meal and it was sooo easy. I subbed 2 Serrano peppers and half a jalapeno as I didn't have any Thai chilies on hand and still had the delicious kick. Chef Yia Vang talks about that Umami flavor and it is no joke. This dish will be a forever keeper. Thank you for sharing this amazing recipe. WOWSER. Oh and drizzled that Tiger Bite Sauce on my egg scramble this morning.... Heaven. BBgrlBoise, ID5/18/2020Great excuse to grill! Marinading the steak overnight was a gamechanger... Between the meat & the sauce, you get everything: umami, spicy, salty, sour. Made a couple minor subs due to what we had on hand, but fish sauce & oyster sauce are a must. Served with white rice, lettuce and homemade pickled carrots & daikon.AnonymousSeattle5/18/2020Explore Bon AppétitAsianSteakBeefMeatSichuan PeppercornHerbs & SpicesSummerMainDairy-FreeGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Yia Vang"]}