{"id": "96fe12d40fa6ad95453acafedccc05b7", "url": "https://www.bonappetit.com/recipe/kuku-sibzamini-with-lemon-yogurt", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Kuku Sibzamini With Lemon Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKuku Sibzamini With Lemon YogurtBy Shayma Owaise SaadatNovember 10, 20214.3(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThese traditional Persian-style potato patties are made with sibzamini—“apples of the earth,” a.k.a. potatoes. The patties’ scent and color comes from saffron, a staple in Persian cookery, which is ground into a powder to draw out intense color and flavor. Adding a bit of water to the powder makes the magic happen: A pool of intense vermillion forms, to be added to your eggs and potatoes. A combination of baking powder and baking soda lightens the batter as it cooks, making for fritters that are crispy on the outside and fluffy on the inside.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSpider$6 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonIngredientsMakes about 16Yogurt1cup whole-milk Greek yogurt1tsp. finely grated lemon zest2Tbsp. fresh lemon juice1tsp. Diamond Crystal or ½ tsp. Morton kosher saltFritters and assembly1½lb. medium Yukon Gold potatoes (3–4), scrubbed, halved1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more1tsp. saffron threads4large eggs1tsp. baking powder1tsp. baking soda½tsp. freshly ground black pepper¼cup extra-virgin olive oil, plus more2Tbsp. finely chopped dillLemon wedges (for serving)1tsp. finely grated lemon zestPreparationYogurtStep 1Whisk together yogurt, lemon zest, lemon juice, and salt in a small bowl. Chill lemon yogurt until ready to serve.Fritters and AssemblyStep 2Place potatoes in a large saucepan and pour in cold water to cover by 2\"; season water with salt. Bring to a boil, then reduce heat and simmer potatoes until fork-tender, 20–25 minutes. Drain and let sit until cool enough to handle. Peel potatoes; transfer to a large bowl and coarsely mash with a potato masher or fork.Step 3Using a mortar and pestle or a teacup and the back of a spoon, grind saffron to a powder. Transfer to a medium bowl and stir in 1 Tbsp. warm water; let sit 1 minute. Whisk in eggs, baking powder, baking soda, pepper, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt until well combined. Gently stir egg mixture into potatoes to combine (the batter should be thick).Step 4Heat ¼ cup oil in a large skillet over medium-high until shimmering. Working in batches and adding more oil between batches if needed, drop batter in heaping tablespoonfuls into pan and flatten to 3\" in diameter. Cook fritters until crisp and golden brown, about 3 minutes per side. Transfer to a wire rack set inside a paper towel–lined baking sheet; immediately season with salt.Step 5Transfer fritters to a platter; scatter dill over and arrange lemon wedges around. Top lemon yogurt with lemon zest and serve alongside.How would you rate Kuku Sibzamini With Lemon Yogurt?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleFor those freaking out about saffron: A) Spanish saffron isn’t very good and is over priced given its poor quality if you were thinking of using it; B) saffron is traditionally used in traditional Persian recipes; C) Persian saffron is much stronger than Spanish so less is required. Most people who regularly use saffron grind a whole pack in a spice grinder. This isn’t a good solution if you use it once a year as it will fade like any other ground spice. A teaspoon of ground saffron is way too much and would taste medicinal. Somewhere btwn 1/4 and 1/2 tsp of ground saffron would suffice. \n\nThere’s nothing quite like saffron to take a simple dish to the next level. If “potato pancakes” aren’t your thing then don’t dress them up. Hell, don’t make them at all!HeidariTehran12/5/2021For anyone freaking out about the saffron, you can stretch it to a point with some tumeric dissolved in water.  It would be delicious even without the saffron, but please Google traditional Persian recipes before advising weird additions or replacements.  Less is moreSaskiaSanta Monica12/5/2021... 'no' dice cucharada de 'azafrán en polvo' (mucho dinero), sino 'moler' seria en grano (barato en dinero) en un mortero; en fin ''lean bien' o, ir a un curso de análisis y comprensión de texto ... ( una bromita, no vayan).Anonymous12/1/2021Swap out saffron for a little smoked paprika or regular paprika if saffron is out of your budgetAlyx Coe11/26/2021This recipe, like it says is based on Persian cuisine AND saffron is commonly used in their recipes. Don't use it if it's too expensive for you. My goodness! jlgrinage11/24/2021Holy smokes, that is a gold-mine worth of saffron. \nThis peasant budget won’t stretch that far. CaramelloBeeBrisbane, QLD11/22/2021Potato pancakes with a fortune sort of saffron- get realAnonymousAlbuquerque NM11/20/2021Think! Please!  If it were your own money you were spending, would you blow twenty five or thirty dollars on the saffron called for in this recipe to make potato fritters?!   Recipe developers, and traditional recipe copiers, often forget that many of the ingredients called for in old recipes may be rare and very expensive in this country today.  To be relevant, if that is the ultimate aim and not only selling gadgets and advertising, come down from the Ivory Tower to where the rest of us live. Hector Lahera Clearwater, FL11/18/2021That is quite expensive with a whole tsp of saffron.AnonymousSeattle11/14/2021Explore Bon AppétitPersianMiddle EasternLemonCitrusFruitYogurtOther IngredientsPotatoVegetableYukon Gold PotatoFritterappetizerSideDinnerFryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-10", "author": ["Condé Nast", "Shayma Owaise Saadat"]}