{"id": "9714aad33bb2cbfea38291f5b8146acd", "url": "https://www.bonappetit.com/story/katianna-hong-chef-pregnancy", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "I Left My Dream Job to Pursue Another Dream—Starting a Family | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Left My Dream Job to Pursue Another Dream—Starting a FamilyAfter 12 years in the restaurant industry, chef Katianna Hong is using her leave to explore something totally new.By Katianna Hong, as told to Elyse InamineSeptember 3, 2019FacebookTwitterEmailPhoto by Eric RubyFacebookTwitterEmailA year before it even opened in 2017, The Charter Oak in Napa was one of the most talked about restaurants in the country. It checked all the boxes: a high-profile chef-owner (Christopher Kostow); a fine-dining sister property (The Restaurant at Meadowood); a very on-trend wood-fired kitchen; an attached farm; and a rising star  leading the kitchen, Katianna Hong. Hong was plucked from her role as chef de cuisine at Meadowood, leaving behind her tweezers for a more rustic kind of cooking. Once The Charter Oak finally did open, it was an immediate hit. And so was Hong. She earned numerous accolades—including a spot on our 2018 Top 50 best new restaurants list—and became a fixture in Napa. So it came as a surprise when Eater announced this past July that Hong was not just going on maternity leave but departing from The Charter Oak altogether. Why would she would leave the place where she made her name? And why now, so soon after opening, and while she’s at the very top of her game? Here, in her own words, Hong explains her choice to say goodbye to the restaurant industry...for now. —Elyse InamineFriday, July 19, was my last dinner service at The Charter Oak. It was good, but, you know, I’m ready to move on. I’ve been thinking about this question with my husband John Hong for a while now: “What are we going to do next?” But once I became pregnant, we began asking ourselves another question: “How are we going to still be chefs and start a family?”What motivated me as a young chef in the first place was this idea of living a really creative lifestyle. That’s why I was attracted to the three Michelin star style of cooking earlier in my career. You got glimpses of people’s genius, which is exciting and rare. And Meadowood was an insanely creative environment.I don’t mean to speak badly of it, but when you’re in your 20s, you’re free. You don’t have any outside responsibilities. You can dedicate all your time and focus to work. That’s what John and I did. We missed holidays. We didn’t maintain relationships with friends who weren’t in the industry. We lived in this bubble of work and didn’t really think about our future. I loved it—the commitment, the structure, the creativity, the intensity, the pressure, the professionalism.Looking back, I’m grateful for my nine years at Meadowood, but it was so ego-driven. It turned into an attention-seeking thing, not a personal thing. And when you’re working head down for so many years, you put personal growth on hold. Trying to figure out what interested me, what made me happy, what I needed to build for my future outside of work—that got overwhelming. It was easier to just work more.After a while, I felt like that wasn’t enough for me. I wanted more balance in my life, so it wasn’t all about work. It was then that I understood it was time to move on. So three years ago, I left my position as the chef de cuisine at Meadowood and went on to open The Charter Oak with Christopher Kostow. John needed an opportunity to be in charge, so he took my old position. I needed a change.The Charter Oak opened my eyes. I worked with different types of people who had other interests and families outside of the restaurant. I realized that people can have different priorities. Before, I was so all or nothing; I’d look at them and think, “Oh, you’re not really committed.”John has always wanted a family. He’d been bugging me for five years to have kids. I was always like, “Maybe next year.” In my mind, I just thought there was going to be a perfect time and it wasn’t now. I realize this was more of an excuse, like “Oh, I can’t because I have to work.” I was always adamant that my career came first. To think about potentially throwing that away seemed scary.I honestly had no idea how someone could do both. I haven’t worked with a lot of women in general, and the only women who were pregnant or had kids were always working in the office—never the kitchen. But there are tons of women who do this and have families and are successful. Nicole Krasinski. Karen Shields. Dominique Crenn. For me to think that it wasn’t possible, I had to call my own bullshit.But the thing that really changed my mind about having a family was talking to my friend Brandon Rodgers, the executive chef of the Benu restaurant group. He was like, “Trust me, you will become a better chef when you have kids. You will grow personally, which in turn will help you grow professionally.” I stopped seeing my work and my family as two different things. Instead, I started to think of being a parent as a new chapter in my career as a chef. Which I also knew meant that, when I did decide to start a family, I wouldn’t be able to stay at The Charter Oak.The end goal for John and me has always been to work together at our own place. For years, we read cookbooks and menus and talked about hypothetical restaurants we wanted to open. But that’s all it was, just talk. Until one night in October, I was like, we just need to do it—to start a family, and try our own thing—and just see what happens. My age suddenly weighed on me. And I didn’t want to miss the opportunity to start a family because I couldn’t make up my mind, or because the circumstances weren’t perfect. We just needed to make the move. On Christmas Eve, I found out I was pregnant. I figured I’d work at The Charter Oak for as long as I could, and then John and I were on our own.Being pregnant while working, I learned to feel more, I guess, entitled to things. I couldn’t be the first one in the restaurant and the last one out. I had to put my body and myself first, and unfortunately in this industry, you don’t care for yourself that often. You don’t sit down. You don’t sleep. You’re dehydrated. The idea of saying I needed those things made me feel uncomfortable. But after a while, I was fine with it. My body needed it and there was someone else to consider. It empowered me to care for myself.Christopher was very supportive, asking me how I felt and what we could change, little things like not standing as long and working shorter days, eight hours instead of 15. Being pregnant changed things for me in terms of how I approached my work. It made me want to improve the quality of life for my cooks. I became more sympathetic to other employees who had things going on. Before at The Charter Oak, I’d get angry and want stuff done a certain way. There wasn’t an awareness for others.I worked until I was eight months pregnant, before stepping away for the new chef to take over. Now we’re planning our move back to L.A., where our families are, and where we’ll eventually open our own restaurant. In the meantime, I’m on maternity leave (paid for by the state of California) for about six months. John is going to take a little time as well. He needs to decompress. He’s been so engaged for so many years on a specific project. He really does need to take some time to think about what he actually wants to do.It’s not wrong to have the singular, competitive, creative drive like we used to have. But there is a different level of cooking that excites me now: food that is personal, cooking in a way that’s meaningful. For us, that means connecting with our Korean culture. This is big for me because my professional and personal lives have always been two separate things. But now I feel like it’s extremely powerful and rewarding to combine my love for my work and my love for my family. My vision of cooking is no longer just me and a handful of young cooks grinding it out all day.I have this picture in my mind of John and me at our future restaurant. One of us in the office working on some menus or going through invoices; the other in the kitchen prepping. Our kids are sitting in a corner with cousins and grandparents, eating a Korean lunch that we prepared and put our hearts into. The grandparents take all the kids to the park after lunch and we see them at home later. Of course, this is somewhat fantasized. In reality, it’s probably going to be much more hectic, maybe a little dirty and stressful. There might even be some kids screaming or crying. But it’s nice to have a new dream.Explore Bon AppétitChefsRestaurantsFirst PersonRead MoreLifestyleSo Your Friends Had a Kid. Here's How to Hang Out With Them Even If They Eat Dinner at 5 p.m.By Meryl Rothstein and Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-03", "author": ["Condé Nast", "Katianna Hong", "As Told To Elyse Inamine", "Julia Kramer"]}