{"id": "97160a626c331cf6fa73aa7c8470e32a", "url": "https://www.bonappetit.com/recipe/shaved-fennel-salad-with-croutons-and-walnuts", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Shaved Fennel Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueShaved Fennel Salad with Croutons and WalnutsBy Andy BaraghaniMarch 20, 20184.9(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis is an antidote to every side salad that ever was. Instead of meh greens, it’s got shavings of fennel that bend and twist but keep their refreshing crunch. It’s got a lean dressing and nuggets of deeply toasted croutons, meaty walnuts, and shards of Parmesan. It has acidity and zing—lemon juice, the zest, vinegar, mint, and red pepper flakes—just in case you were worried about palate fatigue.Ingredients4 servings2cups coarsely torn sourdough bread½cup walnuts6Tbsp. extra-virgin olive oil, divided, plus more for drizzlingKosher salt3Tbsp. sherry vinegar or red wine vinegar1garlic clove, finely grated¼tsp. crushed red pepper flakes2fennel bulbs with fronds¾cup torn mint leaves½lemon2oz. Parmesan, shavedPreparationStep 1Preheat oven to 400°. Place bread on one side of a rimmed baking sheet and walnuts on the other side (they cook at different rates). Drizzle bread with 3 Tbsp. oil; season with salt. Toss, squeezing bread with your hands to help it absorb as much oil as possible, until evenly coated. Bake until walnuts are golden brown and croutons are deeply browned and very crisp, 8–10 minutes for walnuts, 12–15 minutes for croutons. Let cool, then coarsely chop walnuts.Step 2Meanwhile, combine vinegar, garlic, and red pepper flakes in a medium bowl. Let sit 10 minutes to let garlic mellow and flavor the vinegar.Step 3Whisk 3 Tbsp. oil into vinegar mixture, then add croutons and chopped walnuts. Season crouton mixture with some salt and toss to coat and let croutons soften slightly; set aside.Step 4A kitchen towel is a great way to protect your hand from the sharp blade of the mandoline.\nPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiRemove stalks and fronds from fennel bulbs. Remove fronds from stalks and coarsely chop; thinly slice stalks. Place in a large bowl. Cut fennel bulbs in half and thinly slice on a mandoline (if you have one; if not, practice your knife skills). Add to same bowl along with mint. Zest lemon half over salad, then squeeze in juice. Season with salt and toss to combine.Step 5Divide reserved crouton mixture among plates and top with half of the Parmesan. Arrange fennel salad over; top with remaining Parmesan and drizzle with oil.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Shaved Fennel Salad with Croutons and Walnuts?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis salad is now one of my favorites. Very light and refreshing. Evan C Bham, AL 1/14/2022This salad was absolutely phenomenal! I added pomegranate seeds on top and it was a CLUTCH move. Also, I’m a chronic over-garlicker, but today chose to follow directions and one clove gives the perfect amount of bite. No more, no less. And again I say, if you’ve got pomegranate seeds, add them!!Kaitlyn FarrisChillicothe, IL10/31/2021Refreshing salad that I usually make during fall and Christmas holidays. I usually toss in some crumbled bacon  and mandarinr orange slices as well. Serve with herbal tea while the main course is cooking.Most refreshing salad Rochester Minnesota 11/26/2020I would make this again in a heartbeat! Usually not a big fan of fennel, but this recipe changed my mind. I substituted walnuts for pecans and used dried mint in the dressings instead of fresh mint. Overall, amazing!!AnonymousOttawa, Canada10/4/2020Loved this! I've made this a few times adjusting with what I had in the house, including subbing the walnuts for pistachios (YUM, but toast in pan rather than oven), subbing coriander for mint (also great) and adding some smokey bacon (can highly recommend, pork and fennel are a winning combo)Emma JonesCape Town, South Africa8/5/2020Really easy to make and delicious. Will definitely be making again. AnonymousBrooklyn, NY6/17/2020So delicious! Used what was in the house so ended up subbing almonds for walnuts and basil for mint. Awesome way to eat fennel.AnonymousDC3/17/2020I'm not crazy about fennel but happened to have some on hand so I decided to try this salad. It's probably one of the most delicious salads I've ever had!JuliusrainSan Francisco11/25/2019Definitely my favorite way to eat fennel. The salad is super fresh, crisp, and flavorful!AnonymousNorth Carolina9/5/2019Nice one Andy, delicious! AnonymousNew York8/12/2019Explore Bon AppétitSaladFennelVegetableWalnutNutQuickEasySideVegetarianHealthyishEasterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Andy Baraghani"]}