{"id": "97164a735bc8fa963be28226bee353fb", "url": "https://www.bonappetit.com/story/cafe-ohlone-roasted-potatoes", "year": 2020.0, "month": 10.0, "day": 5.0, "content": "These Crispy Roasted Potatoes Have Deep Roots in Ohlone History | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Crispy Roasted Potatoes Have Deep Roots in Ohlone HistoryAt Cafe Ohlone in Berkeley, cofounders Vincent Medina and Louis Trevino make a deliberate choice to cook dishes that their elders would recognize, including these duck-fat-laden potatoes.By Vincent Medina and Louis Trevino, as told to Christina ChaeyOctober 29, 2020FacebookTwitterEmailPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioFacebookTwitterEmailOur Indigenous community in San Francisco’s East Bay doesn’t really relate to the narrative of the first Thanksgiving because, when that was happening on the East Coast, our Ohlone ancestors were living in a traditional way, still very unaffected by colonization. But those same forces of harm came here much later for a similar reason. Colonizers settled this place for themselves and cleared people from the land by any means necessary, including genocide and slavery. Our people survived that. Now we use this time to be together, spend time with family, express gratitude, and eat good food, though how we connect with our community will look different this year since our current interactions with our elders are limited to Zooms and weekly community food drop-offs.This dish is based on a very traditional recipe that’s hundreds of years old and made with our native Brodiaea potatoes, which are little dime-size potatoes that come from a long purple flower you can only find during the springtime. Typically, they’d be roasted in winnowing baskets set in hot coals to give them that crunchy skin and soft interior. Our people would then dip the potatoes in an abalone shell filled with harvested East Bay salt as they ate.For thousands of years, our people used to have controlled burns to open up meadow space and put the seed Brodiaea potatoes back into the soil so the next year’s harvest would be even larger. But with colonization came the commoditization and privatization of lands, and California has since banned the burns that made those potatoes possible. Our people told us about these squares of spaces that used to be just full of potatoes, where you would be able to gather enough for your whole family. When we find those patches today, we’ll gather about 15 potatoes the entire season. And that’s in a good year. But we know that by digging up just a few potatoes at the right time, we’re aerating the soil and dropping a new growth back into the ground. We savor these little tiny morsels—eating them makes you want those Brodiaea patches to grow back stronger. It’s a reminder not to be selfish; we have to think of other elements that are alive, not just us.We make a deliberate choice at Cafe Ohlone, our restaurant in Berkeley, to cook almost everything using only ingredients that our elders and ancestors would recognize. If we can’t find something that was here 200 years ago, then we’re forced to find an alternative that comes close to the integrity of those traditional foods. Instead of Brodiaeas, we now use a farmers market heirloom variety called the Russian banana fingerling, which has a similar rich, buttery taste. We boil them with lots of herbs, like California bay laurel, and salt that we harvest from the East Bay shore. Then we drizzle them with either duck fat or smoked walnut or sunflower oil, and roast them with Indian green onions until the outsides of the potatoes become super caramelized and crisp and the insides get nice and soft. You can see the landscape of this area reflected in the dish: It really brings home the interconnectedness of our land, food, and culture.Get the recipe:Crispy Potatoes With Bay and ScallionsThis recipe is based on a traditional dish of the Ohlone tribe indigenous to California’s East Bay.View RecipeExplore Bon AppétitThanksgivingFirst PersonChefsNative AmericanRead MorecultureThe Ideal Thanksgiving Wine Is Versatile, Slightly Chilled, and OrangeBy Miguel de LeoncultureI Could Never Get Grandma’s Thanksgiving Dressing Quite Right—Until She Was GoneBy Jasmine GuillorycookingThere’s No Such Thing as Bland Food in a Puerto Rican Household. Case in Point: PavochonBy illyanna MaisonetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-29", "author": ["Condé Nast", "Vincent Medina", "Louis Trevino", "As Told To Christina Chaey"]}