{"id": "971b38fe1cf44c946591d99c399f1dea", "url": "https://www.bonappetit.com/recipe/shrimp-and-basil-stir-fry", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Shrimp and Basil Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShrimp and Basil Stir-FryBy Andy BaraghaniAugust 1, 20184.9(118)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, , Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintThere’s so much more you can do with your farmers’ market basil than making pesto! Just toss a bunch in a hot pan as the finishing touch for charred shrimp that’s been flavored with a spicy, garlicky marinade, resulting in a fuss-free summertime dinner. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings3Fresno chiles, coarsely chopped6garlic cloves, smashed¼cup sugar2Tbsp. fish sauce1tsp. kosher salt4Tbsp. vegetable or grapeseed oil, divided1lb. large shrimp, peeled, deveined2cups basil leaves (about 1 bunch)Lime wedges (for serving)PreparationStep 1Blend chiles, garlic, sugar, fish sauce, salt, and 3 Tbsp. oil in a blender until smooth. Transfer marinade to a medium bowl and add shrimp; toss to coat. Let sit 10 minutes.Step 2Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Just when oil begins to smoke and working in batches if needed, add shrimp, leaving marinade behind, and cook, turning once, until lightly charred around the edges, about 1 minute per side. Remove pan from heat. Add basil and toss vigorously until basil is wilted.Step 3Transfer shrimp mixture to a platter. Serve with lime wedges alongside.How would you rate Shrimp and Basil Stir-Fry?Leave a ReviewTell us what you thinkReviews (69)Back to TopTriangleMade this for the First time tonite. Outstanding. Used jepenos and Seranos since couldn’t find Fresnos. Made a sausage with the marinade and sherry. Outstanding NadineBrewster MA11/14/2021This recipe is delicious. Served it over brown rice and steamed broccoli. Outstanding!Marie LAmelia Island, Florida9/24/2021A+ easy and delicious recipe. I didn't even blend the ingredients for marinade, but just minced together and worked great. \n\nI used the finished shrimp for spring rolls, and added avocado, basil, sliced paprika, jalapeno. AnonymousWashington DC8/30/2021A keeper! \nI didn't have shrimp so made with cod fillets, so never got a good char, but was still fabulous.  And, no Fresno chiles around, so used sambal.  Served with sauteed baby bok choy with a touch of oyster sauce.  Can't wait to make again, and with shrimp.ellenbaltimore, md8/14/2021Utterly fabulous. So easy and so flavourful. You can serve it with so many things and truly it comes together like that. Perfect for when I’ve had a busy day of work. \n\nI like to devein my prawns so that’s the only pain!Peter KLondon, UK 7/29/2021So incredibly good! Served with quickly sautéed summer squash because I didn’t want to take the time to make rice (definitely will next time - I put about 1/2 of the marinade in the pan halfway through, made a great sauce). Used whole Fresnos as it was just for me, but when I make it again for my less spice tolerant husband I may de-seed them. This will absolutely be a weekly treat this summer. Abigail Willamette Valley, OR7/18/2021Unable to get fresno peppers, so I used Jalapeno instead. Since a few folk had commented on saltiness, I cut salt to 1/2 tsp. I had a mixture of Thai and sweet basil for the herbs. It was very tasty. Served it on basmati rice with green beans and fresh crispy gherkins.  Very good dinner was had by all. AnonymousRoanoke, VA7/16/2021This has been added to the rotation! The shrimp has such a great spicy-sweet flavor, and it was great to avoid premixed marinade to achieve that. My store did have the Fresno chile, but they were a bit pricey imo, so I went with a cheap and classic serrano (1, my bf does not do spicy) and it came out great. Served with white rice.itsappleredCedar Park, TX7/2/2021I couldn’t believe how much this recipe blew my mind, it has the best flavors from all over the world! It has spice/heat, which I love. However you can temper down the recipe by not using the peppers.  I thoroughly recommend this shrimp basil recipe to anyone who is tired of the same old boring meals every day. This recipe will make your heart smile! 😊Anonymous6/19/2021Made this like four times now, as a shrimp taco and I eat so much like its my new fav recipe!!! AnonymousSweden 4/23/2021Absolutely fantastic. I used only 2 Fresno chilies and it was plenty spicy.  Incredibly flavorful.  Served it with rice pad Thai noodles.  So much better than the local take out place that served Basil Thai noodles. Will be making this on a regular basis. PilarHuntington Beach CA2/17/2021Great flavor but a bit too salty, imo.CBBSF, CA1/5/2021The only problem I had was that I didn't make more! Absolutely delicious! Scott Hendersonville, NC12/18/2020Amazing recipe! I have made this several times over the past few years and it's always a pleasure. I can never find fresno chiles at the store so I always use jalapeño peppers instead. I also let my shrimp marinade for at least 30 minutes. Anyway, great recipe as is! AnonymousCleveland, OH12/9/2020I loved this recipe both exactly how it is and with an extra fresno chilli! Huge crowd pleaser. I served this with rice noodles and it was an instant crowd pleaser ( crowd of 4 in Covid times). I know fried peanuts would go well too but that would make it super Thai...this was different finger food and went great with white wine and beer. Spicy but awesome!KhipiCooksCambridge, MA12/8/2020Explore Bon AppétitStir-FryAsianChineseEast AsianShrimpShellfishSeafoodBasilHerbs & SpicesFresno ChileChileVegetableWeeknight MealsMainNut-FreeDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast", "Andy Baraghani"]}