{"id": "9723878640974619b9b30dfa98f7f102", "url": "https://www.bonappetit.com/story/one-strip-masala-chai", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "The Masala Chai Blend That Convinced Me to Buy Chai Blends | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Masala Chai Blend That Convinced Me to Buy Chai BlendsOne sip brings me back to family teatime in Delhi.By Sonia ChopraNovember 20, 2020FacebookTwitterEmailEmma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!Most days I’m perfectly happy keeping my chai routine simple: just water, black tea, and spices. It’s strong and good with just the right amount of heat. (My tip: Add what seems like the right amount of ginger and then triple it.) But on rare occasions—particularly gloomy rain-filled days or homesick ones—I confess I have tried to re-create the milky-sweet tea from my grandmother’s house in India. It’s an attempt to replicate the comfort and coziness her drink stands for in my mind.I’ve never quite gotten it right. Maybe I used the wrong tea, the wrong mix of spices, or the wrong alt milk. Maybe I can’t get the timing down on exactly when to add what to the boiling pot of water: Add the tea too early and it’s too strong, add the spices too late and it’s too bland…and when does the milk go in again? Or maybe it’s simply because I haven’t tasted that tea in about a decade, since I started to avoid lactose, and I’ve been chasing a memory more than anything else.So I was thrilled when I first tried One Stripe Chai’s new masala chai blend, which made a cup of tea that would be right at home at family gatherings in Delhi but is also foolproof enough for me to make, alone and multitasking, in Brooklyn. I’ve known founder Farah Jesani for years and think the company’s chai concentrate is the best on the market (their earthy haldi doodh blend is equally game-changing) and stands out against competitors for being not too sweet and actually well-spiced.I had yet to find a dry mix worth spending money on, so I was cautiously optimistic about its new loose-leaf blend. Most blends, in my experience, make a cup of tea that ends up too bitter or too weak, and over the years I kind of gave up. But One Stripe’s blend is spiced exactly to my taste (spicy!) and doesn’t need sweetener, and even more than that, the directions make the preparation so easy: Mix equal parts water and choice of milk together with a few teaspoons of the masala chai and boil them for a few minutes. It takes the guesswork out of the process, simplifying chai so that it isn’t an elusive alchemy. It’s just a very, very good drink.Chai Me At Home Blend$16 at Etsy$16 at One Stripe ChaiLove very good drinks? Try the haldi doodh blend next!Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThis Tea Strainer Made Me a Loose Leaf ConvertBy Meryl RothsteinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-20", "author": ["Condé Nast", "Sonia Chopra"]}