{"id": "97304fc8d9121ba73f189b67815a2980", "url": "https://www.bonappetit.com/story/a-dinner-party-isnt-about-food", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "A Dinner Party Isn’t Really About the Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Dinner Party Isn’t Really About the FoodWhen the vibe is just right, what you eat is secondary.By Adam RapoportOctober 1, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole HerriotFacebookTwitterEmailMaybe you’ve got friends like Torrey and Steven. Whenever you text them, they’ve got something happening. Friends stay- ing over, others coming to dinner. They are never not hosting.But unlike the rest of us, they don’t respond with a noncommittal “Oh, we should totally get something on the books for another night,” and then, 73 group texts later, maybe you lock down a date in six weeks’ time.Instead, their response is always the same: Just come on over. And so, more often than not, we do.This past summer, with my wife Simone away, my son Marlon and I headed out to the beach for the weekend with Simone’s cousin Tony. We rolled up to Torrey and Steven’s at 7 p.m. on a Friday, and the house was in full swing.Margarita fixings had assumed their rightful place on the kitchen counter. Marlon reached for a grapefruit sparkling water in an ice-filled cooler. A big bowl spilling over with limes, lemons, and avocados sat on the dining room table. Yes, it was more decorative than anything, but its message was clear: This house is about a good time, and you are always welcome.Brothy, beautiful clams.\nPhoto by Alex LauYou might assume that this all comes effortlessly to Torrey and Steven—that they simply throw together a meal with what- ever looks good at the market. They don’t. They’re like most of the readers of Bon Appétit, I imagine. They bookmark recipes from magazines and websites, they follow them to a T, they return to the ones that work, and, most important, they do all their prep work before their guests arrive.That night the house was filled with a crew of a half dozen of Torrey and Steven’s friends. It didn’t matter that none of them had met Cousin Tony before. Or who sat next to whom. Or who did what for a living. Or that Marlon spent a good 20 minutes schooling us 40-somethings on each and every dance move from Fortnite.We all settled into the evening, recognizing that we were lucky to score an invite, even if, in reality, we were crashing. Eventually, with the July sky pitch-black, we meandered out to a firepit in the backyard, plopped down into Adirondack chairs, and stared hypnotically at sparks escaping into the night. And, oh yeah, the food. It was really, really good. Torrey had made a pot of brothy, spicy clams that he ladled over slabs of charred, garlic-rubbed bread. We dug into racks of cumin-scented Sichuan-style ribs and marinated strip steaks. Also, a cooling, limey coleslaw and miso-butter corn on the cob because, vegetables.They nailed all of it. But the thing is, entertaining really isn’t about the food. We just think it is.Get the recipe:Clam Toasts with PancettaShellfish and pork are a power duo. The salty-sweet pancetta soffritto is the backbone of this clam toast (a kitchen favorite during tastings).View RecipeExplore Bon AppétitEntertainingRead MorerestaurantsGjusta Is My Quintessential, Never-Miss L.A. SpotBy Adam RapoportcookingI Can’t Wait to Make This Basic Carrot CakeBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Adam Rapoport"]}