{"id": "975114d0431f18e79703580dee9f7722", "url": "https://www.bonappetit.com/story/best-food-advent-calendars-2021", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "10 Best Advent Calendars (2021) for Food Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping10 Chocolate, Candy, and Tea Advent Calendars Because It’s Time for ExcessFrom truffles and caramels to oolongs and those Harry Potter jelly beans, there’s an advent calendar for everyone.By MacKenzie Chung FeganNovember 15, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I was growing up, the holiday season meant two things: Pee-Wee’s Playhouse Christmas Special on repeat and Trader Joe’s advent calendar. Every day in December I would carefully open a perforated flap in the cardboard box, revealing a quarter-size milk chocolate shaped like a bell or star or present. Hell if I knew what advent was (still pretty unclear, tbh), but that monthlong tease was something I looked forward to all year. As an adult my tastes have matured, which means I’ve branched out beyond milk chocolate to advent calendars featuring black licorice, loose-leaf teas, and experimental truffles. Pee-Wee remains nonnegotiable.Below you’ll find some of the best advent calendars for 2021—and they are, no joke, selling out as I file this, so if one catches your eye, don’t sleep on it. If these best sellers are out of stock, allow me to point you to Cost Plus World Market (12 Days of Hot Sauces), Food 52 (we haven't forgotten about you, Hanukkah observers), and—if beauty and skin care are your vices—Sephora, all of which have great selections.Harry Potter Advent CalendarIf you’ve got a kid (or if you yourself are that kid) who can’t get enough of those Christmas scenes at Hogwarts, this Williams-Sonoma Harry Potter candy advent calendar is right up your Diagon Alley. You’ll find Fizzing Whizbees, gummi slugs, and, of course, Bertie Bott’s Every Flavour Beans. While I didn’t get a booger jelly bean, I did eat something that tasted decidedly of mulch. Fun for the whole family?Harry Potter Advent Calendar$80 at Williams SonomaDelysia Chocolate Truffle Advent CalendarNicole Patel’s truffles sound gimmicky; the Austin chocolatier is known for flavors like Thanksgiving Stuffing and Smoked Brisket. I’d dismiss Delysia as catering to the booger-jelly-bean crowd except that Patel’s flavors actually work—and they’re rooted in real-life holiday treats. Her chocolate advent calendar features a five by five grid of numbered truffles, each inspired by a different festive dish from around the world. That includes warm-spiced standbys like figgy pudding and lebkuchen as well as more out-there flavors like fried chicken (peppery like a well-seasoned coating) and doro wat (chocolate and Berbere make a great combo, turns out).Delysia Chocolate Truffle Advent Calendar$75 at DelysiaVahdam Teas Advent CalendarFor all but the thirstiest tea drinkers, Vahdam’s advent calendar is the gift that will keep on giving long after December is over. Each day you’ll unbox a different tin containing 17 grams of loose-leaf black, green, or herbal tea—more than enough for multiple servings. Most are blends (the several varieties of chai are my favorite), but for the purists you’ll find first flush Darjeeling, oolong, and Assam as well. My Christmas countdown calendar oddly skipped December 20 and contained two December 22’s—which I didn’t mind since that meant a double portion of Vahdam’s deliciously floral rose black tea.Vahdam Teas Advent Calendar$80 $68 at Vahdam Teas$70 at AmazonBonne Maman Advent CalendarIf jam is your jam, Bonne Maman’s holiday advent calendar is back, and it is an absolute delight. Each day you’ll be rewarded with a one-ounce jar of fruit spreads, magically transforming your house into a charming bed and breakfast. There’s a lone jar of honey tucked away behind a closed door as well. The flavors are a cut above your standard grocery store offerings—there’s peach with jasmine, sweet orange and passion fruit, and fig with cardamom, the appropriate descriptor of which is, I believe, “scrummy.”Bonne Maman Advent Calendar$35 at AmazonMcCrea’s Caramels Advent CalendarIf you’re chocolated out, check out this Christmas advent calendar of individually wrapped caramels hidden behind a wintry anthropomorphic street scene featuring a hamster with a tambourine. Massachusetts-based McCrea’s Candies makes caramels that strike just the right balance between meltingly soft and jaw-achingly firm in both classic (maple and chocolate peppermint) and more unconventional (rosemary sea salt and cinnamon clove) flavors. My only quibble is that the packaging is a little finicky; several of the caramels dislodged from their divots, so I had to dig around to find all the goodies.McCrea’s Caramels Advent Calendar$38 at Food52$38 at Uncommon Goods24 Beers of CheerIt’s a bit of a stretch to call this a “calendar,” but a case of beers by any other name tastes as sweet. Inside the box are craft offerings from the likes of Golden Road Brewing, Goose Island, Elysian, and Kona Brewing Co. The cans run the gamut of styles and ABVs, from a thirst-quenching 4% mango wheat beer to an imperial IPA from Seattle’s Redhook Brewery that clocks in at 8.6%. Depending on whether you prefer DIPAs or sours, you probably won’t love all 24 beers equally, so I recommend getting some friends together and crushing the calendar in one go.24 Beers of Cheer$68 at ReserveBarLakrids Danish Licorice Advent CalendarFor freaks like me 24 days of Christmas licorice is the best holiday gift imaginable. Danish brand Lakrids by Bülow is one of my all-time favorite candy companies, and its countdown calendar does not disappoint. Hidden behind each door is an individually wrapped two-pack (one for me, one for also me) of chocolate-coated licorice in flavors like salted caramel, strawberries and cream, and vanilla mango. These little-sweet-little-salty crunchy-shelled marble-size balls might convert even avowed licorice haters—but if not, more for you.Lakrids Danish Licorice Advent Calendar$55 at Food52Sugarfina Santa’s Workshop Advent CalendarThis candy collection’s packaging is among the best of the bunch. Little boxes decorated to look like envelopes peep out from behind the cellophane windows of Santa’s workshop. Inside each you’ll find plenty of gummies, both sour and sweet. There are a few chocolates as well, but this calendar is definitely for the person who opts for Sour Patch Kids over Reese’s Pieces at the movie theater.Sugarfina Advent Calendar$55 at Neiman Marcus$55 at ReserveBarCoco Christmas Advent CalendarLike Vahdam’s tea advent calendar, this offering from Scottish chocolatier Coco yields generous portions—each day of the holiday countdown you can look forward to a beautifully wrapped mini bar of chocolate. Coco is all about investing in origin (meaning the places where cacao is actually grown), so its chocolate is made close to the source before being shipped to Scotland and crafted into flavors like salted caramel milk chocolate and Isle of Skye sea salt dark chocolate. This hefty calendar (over a pound of chocolate!) is decorated not with snowmen or caroling cats but with a bold, graphic pattern in black and white—very nondenominational, very moderne.COCO Christmas Advent Calendar$75 at Food52$75 at FoxtrotMaison du ChocolatMost of the other entries on this list come in boxes of various shapes and sizes, but Maison du Chocolat’s advent calendar looks like a volleyball-size Death Star. It features a loop at the top so you can hang it from your Christmas tree or dangle it juuuuust out of reach from children too young to appreciate fine French pralines and ganaches. You’ll find a mix of milk and dark chocolates hidden behind each door. All are good, but the caramel ganaches are the best.La Maison du Chocolat$75 at La Maison du ChocolatExplore Bon AppétitGift GuidesCultureShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-09", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}