{"id": "97632433b43b3ce68b42542dd5547dc0", "url": "https://www.bonappetit.com/recipe/hot-honey-shrimp-and-creamy-grits", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Hot Honey Shrimp and Creamy Grits Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDHot Honey Shrimp and Creamy GritsSponsored by The Home DepotFacebookPinterestTwitterEmail4 servingsUsing a pressure cooker to cook the grits for this twist on a Lowcountry favorite means you don't need to babysit a pot on the stove for an hour.\nRecipe by Christina ChaeyPrintIngredients1 cup white corn grits (not instant)Kosher salt2 Tbsp. unsalted butter4 oz. sharp cheddar cheese, grated3 garlic cloves, thinly sliced½ tsp. crushed red pepper flakes2 Tbsp. honey1 Tbsp. hot sauce3 Tbsp. vegetable or canola oil1 lb. large shrimp, peeled and deveined, patted dryCilantro and lime wedges, for garnishRecipe PreparationBring 4½ cups of water to a boil in a medium saucepan. Carefully add water to pressure cooker set to “Sauté” and slowly sprinkle in grits and 1 tsp. salt, whisking constantly. Bring grits mixture to a simmer, whisk again, then seal pressure cooker according to manufacturer's directions. Cook at high pressure for 9 minutes. When timer goes off, manually release pressure. Carefully open lid and whisk vigorously a few times until grits are smooth and creamy. Whisk in butter then gradually add cheese, whisking until melted. Taste and season with more salt, if desired. Keep warm while you prepare the shrimp.Whisk garlic, crushed red pepper flakes, honey, hot sauce, and oil in a medium bowl until combined. Add shrimp, lightly season with salt, and toss until coated. Let sit 15 minutes.Preheat air fryer to 450°. Cook shrimp, tossing once, until bright pink and opaque, about 3 minutes.Whisk grits once more to smooth out. Divide into shallow bowls and top with shrimp mixture. Serve with more hot sauce, cilantro, and lime wedges alongside for squeezing over.Sponsored by The Home DepotRelated VideoHot Honey Shrimp and Creamy GritsGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitThe Home DepotSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["The Home Depot"]}