{"id": "97790ffde7c19349825f76cdac16e2bb", "url": "https://www.bonappetit.com/story/wellness-coworking", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "This Coworking Space Dedicated to Wellness Made Me Feel Profoundly Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Tried 'Wellness Coworking' and It Made Me Feel Profoundly AloneThe Assemblage coworking space in Manhattan is a tribe, but it is not my tribe.By Rachel Sugar March 7, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn I Did The Thing, Rachel Sugar sacrifices her time and her sanity in the name of wellness \"research.\" Up next: a day at the Assemblage, a wellness-focused coworking space.The first time I enter The Assemblage, I am late to meet the Empath. The Empath is one of the many perks of The Assemblage, which is less a coworking space than a cocoon of hyper-productive wellness. In addition to the Empath, there is kundalini yoga and unspecified yoga. There is Breathwork. There is a class called “Sound.” There is meditation and business coaching and, every Friday, a cacao ceremony. All of these take place in a large glass room bedecked with several gongs.Does your office have a gong room? Maybe it should. Rodrigo Niño thinks so. He founded The Assemblage after a cancer diagnosis led him to spend two weeks in Peru taking ayahuasca and coming to terms with death. “What I saw, in this hallucination, was how all living things were connected as one, but we were not aware of it rationally,” he told the New York Times. When he returned to New York, he founded The Assemblage on the principle of radical connectivity.“We truly need to have a place of convergence for those who understand that there is more than who we are,” he told the Times. “For those who feel we could be defined not only by the known, but by the unknown.” Aesthetically, this translates to a workspace—“house,” as they call it—that feels like a cross between an open office and a spa and the city of Los Angeles. Also a Tarot deck. The first floor, which is also called “the living room,” has banquettes and a café for your daily ayurvedic meals (included with membership) and coffee tables made out of slabs of very glamorous tree trunks. Also, there are plants. Big plants. Small plants. Mosses. Fronds. Niño “believes in biophilia,” Susanna Woodley, the Assemblage’s director of sales tells me. “Inserting nature into your workspace helps to reduce anxiety. It helps to reduce stress levels. It definitely purifies the air. There’s just something magical about walking into this space to work; my shoulders just come down.\"I break for a 45-minute sound bath in the gong room. It is the most relaxed I’ve been in months.My shoulders are not down. My shoulders are very, very up. It is time for the Empath. The session is called “Ask the Empath.” “What do people ask you?” I ask the Empath, whose real name is David Sauvage, and who is absorbing my energy from a cross-legged position on the gong-room floor. He seems distressed by my distress, because of all his empathy. “I can consciously enter someone’s emotional field and figure out what is going on with them,” he told the Guardian, explaining his profession. So he tells me about me: that I am comfortable with stress but uncomfortable with softness; that I am good at focus but bad at trust. I wonder if this is what is responsible for all my problems, past and present, and I focus on not crying.The Assemblage NoMad—the flagship Assemblage, though there is also one in the Financial District, and soon, a third on Park Avenue—is a tower of well-being. There are four floors of co-working spaces, all different. “It’s nice to go to another area to just unblock that chi and help the creative process,” Woodley says. There is a space that feels like a library, with chic, minimalist desk lamps and books that have all been donated by a shaman, with titles like “The New Psychedelic Revolution” and “The Toltec Secret,” and one about the social impact of millennials. There is a canopied nook—“the nest”—and an area dotted with floor pillows, which makes it ideal for their “more intimate gatherings,” programming about grief and loss and sex. “The first time I went to one,” Woodley says, “I was just floored at how open everybody was.”Instead of alcohol, the Assemblage offers \"boosts\" with names like \"Spirit\" and \"Balance.\"\nPhoto by Emma FishmanAbove The New Psychedelic Revolution, there are several floors of dedicated desk and office spaces. Above that is The Alchemy Bar, which looks like the sexy Middle Ages and “exists to facilitate true connection to one’s highest state of being through the power of botanicals.” Instead of doing shots of alcohol, which is not served at The Assemblage, you can do healing “boosts” of “Spirit,” “Balance,” and “Joy.”I spend the day working at The Assemblage. I take calls from the absurdly spacious phone booth. I work on an article about the California wildfires, then I break for my Ayurvedic lunch, which is Caribbean-inspired, with black bean soup and coconut rice and enormous shrimp. Later, I take a “boost” of “Brain,” because I am supposedly working, and then I break for a 45-minute sound bath in the gong room. It is the most relaxed I’ve been in months.The Assemblage is overwhelmingly nice. Everything is nice. The plants are nice. The ayurvedic shrimp are nice. The chairs are nice. The phone booths are nice. The light is warm. The people are beautiful, in clothes that are beautiful and hats you wear for fashion reasons and not because it is cold. The water comes in still or sparkling.Once I imagined work/life balance was about boundaries, not taking a sound bath in your office.In theory, you could never actually leave. The coworking monolith WeWork, with its kegs and foosball tables, has expanded into so many aspects of human existence, with living spaces (WeLive), gyms (Rise by We), and schools (WeGrow)—a whole Wecoverse!—that it changed its name to “The We Company” to encompass all the many ways they We.The Assemblage is a percentage of a fraction of the size of We. But it, too, is a highly curated ecosystem. It also offers “co-living,” in the form of 79 “hotel-style apartments” at the John Street outpost, which can be booked for days or weeks or months. This spring, it will be opening an Assemblage restaurant to supplement the current food offerings. At The Assemblage, you don’t have to leave your office to do yoga or meditate: Why would you? It’s all here. In the evenings, it offers a full slate of events programming: talks on blockchain, cryptocurrency, adaptogens, crowd-funding. All memberships include access to retreats at The Sanctuary—an upstate oasis of wellness—and access to the Assemblage’s online platform. Even when you’re not there, you never really have to leave.Membership at The Assemblage costs between $495 and $3,900 (or more) per month.\nPhoto by Emma Fishman“We have a really diverse community,” Woodley tells me, “but I think what connects them all, really, is that they just want a space that promotes a better work/life balance.”A better work/life balance costs between $495 a month for coworking space and $3,900 (plus) for a small-company-sized private office. (If you already have an office, but want community, there’s a $200/month “Assembly” level membership, offering “an oasis for mind, body and spirit” after 5 p.m. on weekdays and all day on weekends.) I am acutely aware that, were I not writing about it, I could not afford to be here. “I don’t deserve this!” I keep thinking, and then I realize, no, of course not, no one does. Nice things aren’t about deserving them. They’re about affording them. This is perversely comforting. I wonder if I should get a hat.Once I imagined work/life balance was about boundaries: not checking work email on weekends, keeping your phone out of the bedroom, taking your vacation days, turning off your computer by 10 p.m. Work/life balance is not taking a sound bath in your office.If I can’t stop checking my phone, I can at least do it in a biophilic space with ayurvedic shrimp and regularly scheduled cacao ceremoniesBut The Assemblage doesn’t see it that way. Everything is connected. You can’t separate wellness from the work day; wellness is all the time. You come here to do your job but also to eat your locally sourced meals. You take your calls, and then—without leaving the building—you do your yoga and your breath work and your guided meditation. Work isn’t a job; it’s just one aspect of a lifestyle.And maybe that’s more realistic. If I can’t stop checking my phone, I can at least do it in a biophilic space with ayurvedic shrimp and regularly scheduled cacao ceremonies, attended by a tribe  of people who could, in theory, also be my friends. What The Assemblage is trying to offer—what all these co-work-live spaces are trying to offer—is a ready-made community of people who share priorities and values, so that our business ventures can liaise synergistically with our personal pursuits, or, in real words, we can feel like we are part of something and not like we’re alone.But, at The Assemblage, I feel profoundly alone. The Assemblage is a tribe, but it is not my tribe. There is a singular loneliness in realizing that you are a visitor in a place you don’t belong. That the place is objectively very nice only makes it worse. Don’t I like nice things? When I stopped worrying that I was facing the wrong direction, I had a pleasant sound bath. I drank free expensive coffee. I charged my computer at an abundance of working outlets. Another person who is not me would love this. As the Empath had told me, I struggle with bliss.By the time I leave the warm glow of The Assemblage, it’s snowing—a heavy, slushy snow, coating Manhattan in slippery gray sludge. Outside, everyone seems miserable, shuffling toward trains, heads bowed, like very angry penguins. Nothing is nice. And yet, for the first time all day, I have the feeling people who love The Assemblage must have in The Assemblage: a sense of belonging.Explore Bon AppétitHealthyishNew York CitySelf CareI Did the ThingTrendsRead MoreLifestyleI Drank From the $80 Crystal Water Bottle. Here's My Story.By Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-07", "author": ["Condé Nast", "Rachel Sugar"]}