{"id": "978aeead69c7ce8268d85231ea329db4", "url": "https://www.bonappetit.com/story/next-level-vegas", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Next Level Vegas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredNext Level VegasNow’s the time to try some of the latest, greatest and most noteworthy bites and sips on the Strip.By Las Vegas April 24, 2018FacebookTwitterEmailAll Rights ReservedFacebookTwitterEmailThe Ultimate French Toast @ Bardot BrasserieAriaBrunch lovers take note: This epic French Toast is a tower of sweet tooth perfection.Crazy Delicious Shakes @ Black Tap Burgers and BeerThe VenetianBeyond their award-winning burgers, craft beer and cocktails, it’s the Instagram-famous Crazy Shakes™ that are worthy of a visit.Epic Layers of Flavor @ Mesa GrillCaesars PalaceChef Bobby Flay’s staple spot had a full menu revamp with new dishes bursting with his signature Southwestern flavors.A Luxe Mini Bite @ Rose. Rabbit. Lie.The Cosmopolitan of Las VegasFor those who want to indulge in luxury ingredients in every bite, this playful take on caviar is a serious dining experience.Vegas Uncork’d 2018: May 10 - 13Buy tickets and learn more at VegasUncorked.comRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Las Vegas"]}