{"id": "979c10d5bef66ad5eeeb6ca3eead6026", "url": "https://www.bonappetit.com/story/no-us-without-you-othon-nolasco", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "No Us Without You Is Feeding the Essential Workers Who’ve Fed Us | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsNo Us Without You Is Feeding the Essential Workers Who’ve Fed UsCofounder Othón Nolasco on the true meaning of hospitality.By Othón Nolasco, as told to Aliza AbarbanelSeptember 30, 2020FacebookTwitterEmailNo Us Without You gathers groceries to give to undocumented restaurant workers in L.A. Photo by Mel CastroFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.Earlier this summer bartender Othón Nolasco shared the story behind No Us Without You in our Restaurant Diaries. No Us Without You is a nonprofit that provides free 75-pound grocery kits to hundreds of undocumented restaurant workers and their families in Los Angeles on a weekly basis. It’s a proactive response to the lack of support, whether that be substantial government aid or inclusion in a restaurant’s GoFundMe, for workers who are the backbone of the restaurant industry. In this update, Nolasco explains how he and fellow hospitality vet Damian Diaz have expanded No Us Without You despite challenges along the way, and how the hospitality he experienced working in restaurants and bars drives him to care for the people he loves in this industry. —Elyse InamineWhen my partner Damian Diaz and I were running restaurants and bars, we often ate just once a day. And that only happened because the undocumented kitchen staff would make us a plate and have us sit down and eat. Now we’re providing food security for undocumented restaurant workers, a big part of the restaurant industry in Los Angeles that’s being forgotten. We’re proud to feed those who have fed us for years.When we last spoke in May, No Us Without You fed 300 families every week. By mid-June we had about 450 families with another 150 families in our queue. There was a huge amount of direct marketing to the community we serve: CNN Español did a piece on us, along with Telemundo and Univision. But back then we were still waiting for our 501(c)(3), so we were in limbo in terms of receiving funding or applying for grants.Any time we take someone into our program, we’re responsible for them. We don’t have the option of saying, “Oh, we don’t have a budget to feed your family again this week.” It’s become very evident to Damian and me who really cares about the people they work with. I know that restaurants are just trying to survive right now—I can’t even imagine being a proprietor again and trying to pivot to takeout and alfresco dining—but there are a lot of people we used to respect that we don’t respect anymore because they haven’t done anything but worry about themselves.But there are so many good-hearted, overly generous restaurant workers in this city too. The chefs from Providence did a burger pop-up in their home and donated the proceeds to us. HomeState and the band Chicano Batman came up with a vegan taco special to benefit us and the Watts Empowerment Center. For four months Royce Burke, the chef at Secret Lasagna, gave a lasagna to our families anytime a customer bought a full-size lasagna or casserole. We were picking up 300 lasagnas every week. It was great for our families to get something already prepared with love that they didn’t have to make.Around June, more help came. We got an email from the beautiful people at United Way of Los Angeles who gave us $50,000 in rent relief. We hand-delivered 50 checks for $1,000 to our most-in-need families. It was such a surreal moment. A few bigger corporate sponsors we worked with in our previous life as hospitality consultants came up with game plans for how they could support No Us Without You once we got our 501(c)(3). Tecate took care of the lease on a refrigerated truck, plus insurance, for a year and donated enough money that we were able to bring everyone who was in our queue into our program. In two weeks we went from 480 families to 650 families. Sysco gave us six reach-in refrigerators at no cost, which allowed us to implement a contactless delivery program run by volunteers. This way we were able to get food to families who had COVID-19 and had to self-isolate and families who had car issues. As of mid-July, we’re officially a 501(c)(3). And now we’re serving almost 1,200 families a week.Our office is in Boyle Heights, and our neighbors began to notice all the delivery trucks and watched us moving 100,000 pounds of food every week. Little old ladies, families with kids, some people who aren’t undocumented or have a shift or two but still need food. This entire time we had tunnel vision—focused on feeding unemployed, undocumented restaurant workers—but I wondered: What can we do to feed our own neighborhood?So in late July, we set up a grocery pick-up for our neighbors in Boyle Heights with help from Vesta Food Service, which allowed us to expand our offerings and cut our costs. We posted old-school lost-dog-style flyers around the neighborhood, telling people to show up at 9 a.m. one day to get food, no questions asked. We also started a community fridge after seeing it on Instagram. Most community fridges rely on random people to stock them and clean them, but we stock ours with the same food that we feed our families in No Us Without You and treat it like a restaurant reach-in—it’s sanitized daily and everything is wrapped and labeled with a date. There are a lot of unhoused people in the neighborhood, so we also get sandwiches from El Cochinito. At this point we have probably 80 to 100 families visiting the fridge each day, and we know everybody now. We might be outside talking and people will ask us if they can take a gallon of milk, potatoes, and a chorizo? We have to let people know: Don’t be bashful. This food is for you.You don’t need walls and tables to be hospitable—you just have to treat people like your guests. When we first started distributing food, our friend Cynthia from Topo Chico wanted to donate water. Families would come up and we’d ask if they wanted flat water or sparkling water, just like in a restaurant. They’re never made to feel like they’re getting a handout. I think hospitality is the perfect example of “treat others the way you want to be treated”—no one likes going to a bar and feeling unimportant or not respected.So far, our food distribution has been really smooth. I think it’s because our volunteers are all friends that we’ve worked with in restaurants or bars. We’re not experts—we’re learning as we’re going—but there’s a level of trust across the board. No one is late or doesn’t show up or has something better to do that day. We all know how to care for people.Explore Bon AppétitFirst PersonRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Othón Nolasco", "As Told To Aliza Abarbanel"]}