{"id": "97cfca60dec1cac5f8751f13bd86e963", "url": "https://www.bonappetit.com/recipe/kale-pesto-with-whole-wheat-pasta", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Kale Pesto With Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueKale Pesto With Whole Wheat PastaBy Chris MoroccoDecember 26, 20194.5(142)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChef and cookbook author Joshua McFadden’s justifiably famous kale pesto inspired us to keep spreading the word that there is still no better or more delicious way to eat your greens. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonLarge Pot$55 At AmazonHeatproof Measuring Cup$18 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketTongs$13 At AmazonIngredients4 servings1large bunch Tuscan kale, ribs and stems removedKosher salt12oz. farro pasta or whole wheat pasta⅓cup raw pistachios¼cup extra-virgin olive oil1garlic clove1oz. Parmesan, finely grated, plus more for serving2Tbsp. unsalted butterFreshly ground black pepperPreparationStep 1Cook kale leaves in a large pot of boiling salted water until bright green and wilted, about 30 seconds. Transfer to a rimmed baking sheet with tongs; keep water boiling. Let kale cool slightly; wring out excess water with your hands.Step 2Cook pasta in pot of boiling water, stirring occasionally, until al dente.Step 3Blend nuts, oil, garlic, and ⅓ cup water in a blender or food processor until very smooth. Add kale and 1 oz. Parmesan. Purée, adding water 1 Tbsp. at a time as needed, until smooth. Transfer pesto to a large bowl.Step 4Using tongs, transfer pasta to bowl with pesto; add butter and ⅓ cup pasta cooking liquid. Toss, adding more pasta cooking liquid by the tablespoonful if needed, until sauce coats pasta. Divide among bowls; top with more Parmesan and a few grinds of pepper.How would you rate Kale Pesto With Whole Wheat Pasta?Leave a ReviewTell us what you thinkReviews (94)Back to TopTriangleReplaced the wheat pasta with Banza chickpea linguine and added some shredded chicken breasts as well. Very tasty combo. Love the kale pesto. Will make again. MichaelLa Jolla 2/8/2022Replaced the parmesan with nutritional yeast and the butter with Miso and added a Tablespoon of lemon juice.... absolutely wonderful. This will be a regular at our house.\nDarren WilcoxWichita Kansas1/11/2022Great! But needs a little bit of acid, probably from lemon. Goes beautifully with a tin of chili tuna though! Tuscan kale is hard to find where I am so I used green kale and cooked it longer.AnonymousBoston1/3/2022Great Recipe.Anonymous1/3/2022This is a go-to recipe — tastes really comforting and wholesome. I’ve made it in different ways, with different nuts, but I think the recipe as-is (+ one garlic clove) is really tasty. AnonymousMilwaukee, WI12/30/2021I love this recipe! Well actually I love my bastardized version of it — I didn’t have pistachios so I used cashews, and I don’t eat dairy so I substituted white miso paste for the butter and cheese. I’m sure the cheesy version is better but fellow non-dairy losers like me can still enjoy! Kate is great Portland 8/27/2021Absolutely delicious! With such a flavorful sauce I couldn't tell I was eating kale and whole wheat pasta. I followed the recipe exactly, plus like other reviewers recommended, I added salt and lemon juice at the end. I served this pasta with salmon, and I will definitely make it again! AnonymousPhiladelphia, PA1/30/2021I’ve made this recipe half a dozen times now and it’s 10/10!  My meat loving husband likes it, my picky kids eat it, and it freezes beautifully.   It’s adaptable to what ingredients you have on hand and very forgiving if you don’t quite have the exact ingredients (using spinach or collards). I always use 1lb or regular pasta and tripling the recipe for the sauce, freezing the other half.  I find that ratio works well if your using 1lb of regular pasta instead of 12oz of whole wheat pasta.  It does taste better with basil (it’s fine without) but do make sure your pistachios are raw!  It doesn’t taste right if they have been roasted.  I also always need way more than 1/3 a cup of pasta water but again, that’s super easy to eyeball.  Great job on this on BAJenny PChicago1/19/2021Delish!  Per the reviews, I added a generous pinch of salt and the juice of half a lemon and it was perfect.  I processed mine in the blender and it was perfectly smooth and beautifully green.  Definitely would make again.JennNew Orleans, LA1/12/2021The pesto needs salt before it goes into the pasta bowl. Has zero taste without. I agree that lemon juice is a must. The kale gives this pesto an earthy, heavy flavor that we didn’t  love. We prefer basil or cilantro.  Jane11/6/2020my blender sucks, so I couldn't get it as smooth as it looks in the pics, but the flavor was spot on. Definitely recommend adding some lemon juiceAnonymousSouth Carolina8/3/2020Incredibly tasty!! My blender wasn't super strong so I had to add a lot of water to get it to liquify without chunks, but it ended up being really really good. Creamy and it didn't feel like raw kale at all. Could not really tasty any pistachio flavor, so will increase that next time, and the garlic was a little strong so will cut that down, but there will definitely be a next time!Ariana de SouzaCalifornia6/7/2020I made it after watching Chris’ video last week, and it turned out great, though I left the clove of garlic out, which I believe would definitely have made the pesto more multiple-layered in flavour. And I personally find it a bit too creamy, will try control the amount of parm next time (yeah it’s in my rotation now.willding96970Beijing, China6/1/2020Made this with my first harvest of balcony kale and oh my heavens is this delicious.  Made the recipe mostly as-is, but added a tad more garlic and forgot the butter (put it in the leftovers tho). I pureed in the ninja blender and got a beautifully smooth and creamy consistency with no kale chunkage.  Gave it a hit of balsamic the first go round, bit currently enjoying the leftovers straight up.  Quick, easy, and soooo delicious.  Has earned a spot in my rotation for sure. AnonymousKansas City5/20/2020LOVED this. I used spinach since I can’t never find kale here at the grocery stores in Japan. But I loved it. Added a bit more Parmesan because I thought it needed a bit more saltiness. It comes out a beautiful green color and truly delicious. adamleclairOsaka, Japan 5/20/2020Explore Bon AppétitPastaKaleLeafy GreensVegetableSpaghettiPasta & NoodlesEasyWeeknight MealsMainVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Chris Morocco"]}