{"id": "97fa10fe84548357107b4f5c1fb4e924", "url": "https://www.bonappetit.com/story/summer-reads", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Everything I'm Reading (and Eating) This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEverything I’m Reading (and Eating) This SummerFood and fiction forever!By Sonia ChopraJune 24, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.When I was a kid I took part in a lot of programs that encouraged young students to read more books by, well, bribing us with things like pizza and ice cream. I was (and still am) a big fan of books and food, so afternoons reading turning into evenings with free treats were the best of both worlds for me—and always felt kind of like I was getting away with something.I had the same rush when, for our June–July issue (out now; subscribe to get future issues!), my coworkers green-lit a story featuring seven newish novels that all have a lot to do with food. There’s a beautiful generation-spanning story centering four Dakota women and the seeds that sustain them; romances set against two rival phở spots, a charming English B&B, and the dreamy Italian coast; and a murder mystery wherein our protagonist’s ex, a food critic, dies in her aunt’s Filipino family restaurant. All the novels are, I think, ultimately uplifting, and if you’re looking for a summer read (that pairs perfectly with a summer snack), I hope you’ll check them out.Since I didn’t include any children’s books in the print story, I wanted to share a few fun, kid-friendly options for the littles in your life:Ice cream shop Salt & Straw launched a super fun summer pint collection, which is inspired by five books for young readers in partnership with Scholastic.Ahead of the release of Kalamata’s Kitchen, a sweet new book featuring young heroine Kalamata and her reptile pal Al Dente, young open-minded eaters can sign a Taste Bud pledge.And finally, these are the new picture books that have been added to my gifting rotation: Aram Kim’s Sunday Funday in Koreatown, with its gorgeous illustrations of dishes like kimbap and patbingsu; the bright, fun, perfect-for-summer, paleta-filled Paletero Man by Lucky Diaz and Micah Player; and beautiful, moving Watercress by Andrea Wang and Jason Chin.It’s hot here in Brooklyn, and I’m definitely spending more time reading on the sofa and less time in the kitchen. Meaning I’ll only brave my oven for the quick hits: Christina Chaey’s spicy braised tofu, Sarah Jampel’s sheet-pan gnocchi, and contributor Rosalyn Vera’s perfect-for-brunch mollettes, which were a fast favorite in our home. I’d love to hear what low-fuss recipes you’re cooking from the BA archives, and, of course, what you’re reading too. I’m at sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-24", "author": ["Condé Nast", "Sonia Chopra"]}