{"id": "98020fce98b9ab671319fccb689cb9b2", "url": "https://www.bonappetit.com/story/filipino-pop-up-bakeries-social-media", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "There Are 10,000 People Waiting for These Filipino Doughnuts. That's No Surprise. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThere Are 10,000 People Waiting for These Filipino Doughnuts. That’s No Surprise.Social media has not only created a huge customer base for a new group of Filipino pop-up bakeries but provided a platform to watch this evolution of Filipino baking in real time.By Jasmine TingApril 7, 2021FacebookTwitterEmailPhoto by Kenneth Camara / Courtesy KORAFacebookTwitterEmailIt was 4 a.m. by the time chef Kimberly Camara finished transforming her New York City apartment into a makeshift bakery for Kora, her Filipino doughnut shop. She’d spent the last two days prepping dough, fillings, and glazes, and on this sleepy Friday last fall she pulled out folding tables stored underneath the couch and plugged in two small fryers. While she waited for the rest of her team to arrive—her mother, brother, and cousin—she and her partner, Kevin Borja, rolled and shaped the doughnuts on the folding tables. Altogether, they fried, glazed, and boxed about 500 doughnuts for customers to pick up. And while that may seem like a lot of doughnuts, this barely makes a dent in Kora’s nearly 10,000-person waitlist.“It’s daunting,” Camara says. After she and Borja were laid off from their jobs—a research development cook and a server at Union Square Hospitality Group, respectively—back in March, Camara cobbled together leftover ube pastry cream and brioche dough and sold them as doughnuts via Instagram. “There was no monetary motivation behind it,” she says. “It was literally just like, I want to do something.” She thought they’d be doing this for about a month, but now a year later, they’re trying to keep up with the staggering number of orders they’ve gotten. Recently they opened their own commissary space to keep up with their never-ending orders.Kora cofounders Kimberly Camara and Kevin Borja\nPhoto by Kenneth Camara / Courtesy KORAThe Pili & J from Kora, a brioche doughnut filled with pili nut mousseline and mora jam\nPhoto by Kenneth Camara / Courtesy KORAWhile business for delivery apps has more than doubled during the pandemic, Instagram has become a source for takeout. The Kora team was shocked by how fast their following grew. But they weren’t surprised that people were interested in Filipino flavors. “I think society has become more open to trying things because of the internet, honestly,” Camara says. “Obviously, ube is one of the main things that people are so excited about, just because it’s purple and tastes great. I see a lot of Filipino cuisine being hailed and sought out.”Kora is one of several new Filipino online pop-up bakeries slammed with overwhelming demand. The Dusky Kitchen and JEJOCA, both located in New York City, have consistently sold out of Filipino sweets sampler boxes within a day or two of opening up online orders. The team behind Salamat Cookies in Indianapolis received double the orders they expected in their first week in business last May. Now, 24,200 cookies later, Salamat has registered as an LLC, launched an official website, and is looking into renting a commercial kitchen. In Milpitas, California, chef Francis Sibal started Kuya Pields in response to the popularity of the baked goods he made and donated to frontline workers at the hospital where his sister works. “People were too embarrassed to say, ‘Hey, could I just buy it?’ knowing this whole thing was for the front liners,” he says. “I didn’t plan to start a business. It all just happened.”And it’s happening now—with a lot of chefs out of work and able to dedicate their skills and time to more personal projects; home bakers ready to take their hobby to the next level; and so many of us stuck at home, on our phones, and in search of something soothing, scintillating, and sweet. All this has led to the current Filipino baking evolution we’re seeing right now on social media.Baking has long been a part of the Philippine culinary canon, reflecting a history of cultural melding. In precolonial times, with the influence of Malay ancestors, natives made cakes out of sticky rice and coconut milk. In a 16th century account, Italian historian Antonio Pigafetta described kakanin—the general name for Filipino rice cakes wrapped in banana leaves and given to the Spanish as gifts—as “resembling sugar loaves, while others were made in the manner of tarts with eggs and honey.” Philippine food historian Doreen Fernandez noted in her book Palayok that there were so many variations of kakanin, specifically subtly sweet baked bibingka and fluffy steamed puto, that written records from Spanish missionaries couldn’t capture how rich the baking tradition had been.The Spanish government established the first bread bakery in the Philippines around 1631, and pandesal was born. It was initially made out of wheat flour, tough and crusty like a French baguette. But because the Philippines wasn’t big on wheat production, bakers eventually turned to weaker flours made of low-protein wheat, like all-purpose or cake flour, which led to the pillowy, bread-crumb-dusted rolls Filipinos know today. “It is the bread of our history, at the core of our culture, at the heart of our tastes,” Fernandez writes of pandesal. “It is brown and plain like the Filipino, good by itself or alone, crisp on the outside and soft on the inside. It is good, basic and strong—just the way we are, and would like the nation to be.”As Filipino immigrants moved to the U.S., they brought with them these baking traditions. Step into any Little Manila, and you’ll easily find a bakery mainstay with soft pandesal; ensaymada, cheese-topped brioche rolls; chiffon cupcakes known as mamon; dacquoise-like cakes with layers of buttercream, meringue, and cashews aptly dubbed sans rival; brazo de mercedes, a fleecy meringue roll filled with custard; and all kinds of colorful kakanin. Some of these bakeries have become household names. Philippine Bread House in Jersey City, New Jersey, has been around since the 1970s and is beloved for its ube-flavored Swiss rolls and mango sponge cakes. Since its founding in 1979, Valerio’s City Bakery has grown into a mini-chain with four locations in California, all doling out hot pandesal and white loaves swirled with ube, cheese, or mongo (red mung bean).Blood orange and dark chocolate sponge cake with a coffee-coconut-chestnut cream filling and cardamom- and cinnamon-spiced Swiss meringue  \nPhoto by Jessica Joan CausingJessica Causing, owner of JEJOCA online bake shop\nPhoto courtesy Jessica Joan CausingJessica Causing was inspired by her great-aunt’s 40-year-old bakery Gemmae Bake Shop in Long Beach, California, when she started her own online bakery JEJOCA, which is currently on hiatus. Gemmae’s is renowned for its ensaymada, pandesal, and bibingka, but over the years it’s also added items that combine Filipino flavors with American baking traditions, like mango cream cheesecake and ube pistachio tart. “I grew up eating a lot of Gemmae’s stuff,” Causing says. “That collaboration between the flavors and the baked goods definitely inspired me.”Even as food with Filipino ingredients became more widely available (Trader Joe’s ube waffles!), baked goods stayed mostly within the Filipino community. But with the rise of Instagram bakeries and other online platforms during the pandemic, more people are actively seeking out these treats.When food writer Kiera Wright-Ruiz saw photos of the Dusky Kitchen’s pandan polvorón, Filipino shortbread, she knew she just had to try them. To her, they seemed like the “ultimate gift” at the end of a long day during the pandemic. “Something that draws me to Filipino flavors, in particular, is the merger of cultures,” she explains, “I’m half-Latinx and half-Asian. So in general, it’s just really interesting for me to see ingredients or dishes that I know from the Latinx angle and see how that has been translated to Filipino culture.”“They were unlike anything I had ever seen,” says EmJ Hova, a private tutor who discovered Kora on social media. “The doughnuts looked like a work of art. The vibrancy of the colors, the flavors, and just the story that Kim was bringing with her Filipino history and her grandmother, everything spoke [to me].”After pining over the doughnuts for months, she and her partner got their first Kora box last fall. “I was marveling at the fact that you can make a doughnut that doesn’t involve chocolate or sprinkles or just plain custard. Everything was so unique and special.”Filipino flavors and ingredients stand out in the landscape of beige baked goods on our Instagram feeds, which is part of the reason why Camara thinks they do so well on the platform. “I’m not surprised,” she says. “You can’t help but notice that vibrant purple hue when scrolling through your feed.”Part of this is thanks to the ripple effect of the Filipino diaspora. During the earlier months of COVID-19 lockdown, my TikTok feed was filled with videos of home bakers based in the Philippines making ube-cheese pandesal and posting themselves tearing apart the bun to reveal a cheesy center. Sibal says that watching this pushed him to begin baking in the first place for frontline workers. Before the pandemic, Sibal was used to cooking a variety of international cuisines as a company chef at Google HQ, but Kuya Pields allowed him to focus on the food he grew up with.Abi Balingit of the Dusky Kitchen\nPhoto by Jason DessaletPassion fruit and sesame seed Pocky sticks from the Dusky Kitchen’s Christmas Pasalubong tins.\nPhoto by Abi BalingitMeanwhile, home bakers used this time to experiment and do something new. The Dusky Kitchen was always something ad operations manager Abi Balingit hoped to do but only now found the bandwidth to make strawberry and pandan polvorón; linzer cookies inspired by turon, banana spring rolls; and pumpkin pie hopia, a moon cake–like pastry influenced by Fujianese immigrants to the Philippines.After watching the rise of these bakeries on Instagram and TikTok over the past several months, I’ve realized that I, and millions of others around the world, have had front-row seats for something special unfolding before our eyes. We’ve witnessed the continued ingenuity of Filipino bakers, and in turn, the evolution of Filipino baked goods, using traditional Filipino ingredients and modern baking techniques. And now there is an audience beyond the Filipino community for these baked goods.“Doughnuts are the vessel that we’ve chosen to introduce these flavors to people who don’t already know about them,” Borja says. Camara says that they hope to venture beyond doughnuts and desserts to offer a full Filipino dining experience inspired by her grandma’s recipes.“I feel like I was destined to do something with this apartment because it’s in the middle of Little Manila, with all the Filipino community and the resources available to me,” Camara says. “Filipino cuisine is so rich, and we want to explore that richness.”Explore Bon AppétitFilipinoSocial MediaRestaurantsRead MorerecipesThese 6 Filipinx Recipes Turn Pantry Staples Into a Cozy Winter MenuGallery11 SlidesBy Angela GarbesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-07", "author": ["Condé Nast", "Jasmine Ting"]}