{"id": "980b04816f05a34326b9edb7ad08c004", "url": "https://www.bonappetit.com/recipe/cheesy-cabbage-gratin", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Cheesy Cabbage Gratin Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueCheesy Cabbage GratinBy Andy BaraghaniOctober 15, 20194.7(53)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintEvery editor who claimed this cheesy gratin would be “too much!” ended up going back for seconds and thirds. We think you’ll do the same.Ingredients8 servings1medium head of green or savoy cabbage (about 3½ lb. total), cut through core into 8 wedges2Tbsp. extra-virgin olive oil1½tsp. kosher salt, plus more1tsp. freshly ground black pepper, plus more2medium shallots, quartered through root end4garlic cloves2cups heavy cream1Tbsp. thyme leaves, plus more for serving1Tbsp. unsalted butter3oz. Gruyère, grated (about 1½ cups)½oz. Parmesan, finely grated (about ½ cup)PreparationStep 1Place oven racks in upper third and middle of oven; preheat to 350°. Place cabbage on a rimmed baking sheet and drizzle with oil; season lightly with salt and pepper. Roast until tender and edges are golden, 40–45 minutes. (This is an essential first step: It draws out the excess moisture, ensuring that the cream mixture doesn’t get watery.)Step 2Meanwhile, bring shallots, garlic, cream, 1 Tbsp. thyme, 1½ tsp. salt, and 1 tsp. pepper to a simmer in a small saucepan over low heat. Cook, stirring occasionally, until shallots and garlic are very soft, 15–20 minutes. Let cool slightly. Transfer to a blender; blend until smooth.Step 3Rub the inside of a 3-qt. shallow baking dish with butter. Arrange cabbage in dish so wedges are lying on a cut side; pour cream mixture over. Bake on middle rack, uncovered, until cream thickens, 30–40 minutes. Let cool 30 minutes.Step 4Heat broiler. Sprinkle Gruyère and Parmesan evenly over cabbage. Broil until cheese is bubbling and gratin is deeply browned, about 4 minutes. Top with more thyme.Step 5Do Ahead: Gratin (without cheese) can be baked 1 day ahead. Cover and chill. Bring to room temperature before sprinkling with cheese and broiling.How would you rate Cheesy Cabbage Gratin?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleThis is an excellent dish.  I’ve made it twice in the past two weeks.  This last time I omitted the cheese, and we didn’t miss it.  This reheated perfectly well for us, too.  Highly recommend!AmyNew York11/25/2021This was just okay. The sauce never thickened enough to coat the cabbage, and the cheese just kind of sat on top and didn't melt into the dish. It seemed to me that the ingredients never really came together. I planned on taking this dish for Thanksgiving dinner; since we have gluten-intolerant guests, I intend to bind the cream sauce with cornstarch or arrowroot. I may also leave out the thyme and add a little nutmeg. And definitely reduce the salt. My family did not go back for seconds, and we love cabbage.AliceKPittsburgh 11/20/2021This was ridiculously good. It is the perfect side for steak and would make a great vegetarian entree. I disagree that it doesn't reheat well...my husband and I just sopped up every bit of the leftovers. AnonymousPittsburgh5/1/2021First Grattan. Popped my Grattan cherry will be back to you not long.AgnuromCginvers5/1/2021Why is cabbage so undercover glorious? \n\nI cheated and made a cheaper version: 1 can evaporated milk + 1/2 cup heavy cream.  Sauce cooked down kinda fast, so I added some water before the broil step. It was still luxe. Perfect topped with the economical cheddar/gruyere melange from Trader Joe’s. So delicious and not super heavy! The hidden garlic pieces were treasured. \n\nWould totally make this again full version (or my cheater version). [I even think one could even get away with swapping up to half of the cream out for thickened non dairy for tummy reasons. ]TishLos Angeles, CA2/15/2021This recipe is bomb, but it made a ton of food, and my kids weren't interested, so what to do with all the leftovers? We fried up a pound of bulk spicy italian sausage and added 2 quarts of chicken broth. Hot damn, what a treat. Did I top it with some sour cream even though I know how much whipping cream was already in the dish?  Absolutely. Did I regret it? Not one bit. Kate SDenver2/4/2021Very tasty however too much pepper. And, when I make it again I will put the cheese into the cream so it blends more into the roasted cabbage as it bakes. Very tasty indeedAnonymousPalm Coast Fl1/9/2021This is so good. I needed a recipe to use my garden cabbage. The heads aren’t big enough on their own, so I used a combo of leaves, the head, and a few leeks I had on hand. That cream-garlic-shallot-thyme mixture is delicious.\nZoeHouston, TX12/27/2020This was delicious! When planning your menu, let this be the only rich dish because it will overwhelm anything else. So good. I think next time I might cut back on some of the Gruyère, it felt a little too intense for my taste, but it was still so good; couldn't wait to have leftovers the next day!LizWest Orange, NJ12/26/2020Absolutely delicious dish. Thank you. Natalia Denver, CO11/27/2020Wow! First off, I only like cabbage on egg rolls, so I was very skeptical when making this dish. But I got a cabbage in my produce box and did not want it to go to waste. This dish is amazing! So glad I can eat cabbage now. However, I did use red cabbage instead of green, half and half instead of heavy cream, and mozzarella cheese instead of Gruyere. It came out perfect. Strawberries404NC7/1/2020This is a tasty dish.  The second time I made it, I used 1/2 tsp less salt.  Someone else pointed this out & they are right...too much salt.AnonymousSaint Augustine, Florida5/9/2020I've been meaning to come back and review this dish.  I made it to go with our Christmas dinner, and it was an absolute hit!  It's been months since I last made it, and I can't stop thinking about it! StephaninieSouth Carolina4/29/2020Fabulous!  Roasting the cabbage is key.  Great flavor.  I would cut back to 1 tsp of salt.  I used swiss and parm.AnonymousMN4/2/2020Neither my husband nor my son like cabbage, and both of them went back for seconds.  I was directed to \"put this recipe in the family cookbook.\"  The sauce was one of the most delicious I've ever made, and I agree with the person who suggested making a little extra next time.  Important to cut the cabbage wedges equally and check tenderness before removing it during the first roast.  Some of the pieces weren't entirely done, something easily remedied the next time I make it--and there WILL be a next time!AnonymousCornwall, NY3/19/2020Explore Bon AppétitCasseroleGratinCheeseGruyèreGreen CabbageCabbageLeafy GreensVegetableSavoy CabbageFallWinterMainSideVegetarianGluten-FreeKetoThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani"]}