{"id": "980eb988123933558c319b4acdaa40fa", "url": "https://www.bonappetit.com/recipe/slow-cooked-cherry-tomatoes-with-coriander-and-rosemary", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Slow-Cooked Cherry Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSlow-Cooked Cherry Tomatoes with Coriander and RosemaryBy Claire SaffitzAugust 14, 20184.6(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintDouse ripe cherry tomatoes in lots of olive oil and slow-roast to golden deliciousness. Then use it as pasta sauce, a topping for bruschetta, a grain bowl addition, a side to scrambled eggs...we could go on and on.Ingredients6 servings1½lb. ripe cherry tomatoes½head of garlic2sprigs rosemary½cup extra-virgin olive oil¾tsp. coriander seeds¾tsp. kosher salt1Tbsp. red wine vinegarPreparationStep 1Place a rack in middle of oven; preheat to 350°. Toss tomatoes, garlic, rosemary, oil, coriander seeds, and salt in a shallow 2-qt. baking dish to combine.Photo by Chelsie Craig, food styling by Claire SaffitzStep 2Turn garlic cut side down, then roast tomatoes, tossing 2 or 3 times, until golden brown and very tender, 40–50 minutes. Let cool slightly, then add vinegar and toss to coat.How would you rate Slow-Cooked Cherry Tomatoes with Coriander and Rosemary?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleThis was excellent!  I made it with thyme and rosemary sprigs, leaving out the coriander because I didn’t have it.  I plan on making a large batch next time so I can have some on hand as well as freeze some in small containers.P CaseyRockbridge Baths VA1/5/2022delicious can’t wait to made eat ENJOY thanks for recipes Jeannette Bailey Wichita Falls Tx.3/15/2021This dish is a staple in our house, from crostini appetizers to ramen.  We keep a jar of it in our fridge most weeks to jazz up puttanesca, eggs, Mac and cheese, soup, the possibilities are endless.  Sub Rosemary for thyme, press the garlic, skip the coriander, it’s all good!!  Have fun and play with it! Threesco Coquitlam, BC3/14/2021Great way to use my CSA cherry tomatoes. A little juicier than pictured, but still deliciousAnonymousDC7/19/2020Delicious! Picture this: a perfect slice of sourdough toast, a smear of ricotta cheese, and these beautiful tomatoes on top-- bon appetit. I had a bottle of gourmet rosemary flavored olive oil I was dying to use, and this was the perfect solution. 10/10 would make again, and I don't usually like tomatoes very much. I'm converted.AnonymousPaso Robles, CA5/2/2020Great recipe! Skipped the coriander, added a couple of thyme sprigs along with the rosemary. Enjoyed with crostini and burrata, will also likely serve with some sautéed zucchini.\n\nQuestion: Would this freeze well in smaller batches? Anyone have experience with this! Thanks!Lucy DBoston, MA8/28/2019So good! And so easy! Served with burrata, and this will a dinner party constant in my house :)Tanaya AlpaiwallaNew York12/8/2018This is my new favorite way to have tomatoes! I prepared the recipe as is and I love the oily-tomatoey-juicy goodness that is left behind! I dip bread in the oil and spread the tomatoes on top. H-E-A-V-E-N! EbobeboSaint Louis9/15/2018Wonderful recipe. I will cut the oil in half next time the juices from the tomatoes makes a nice amount of sauce. I just dipped some Como bread, Joshua McFadden's roasted almonds and a glass of Pinot Noir. Lovely. I used whole coriander.\nFall has arrived.iz2Duvall, WA9/10/2018The cherry tomatoes are awesome and would you grind the coriander first or just leave whole? Excellent with chicken.White Rock, Canada8/24/2018Explore Bon AppétitSauceAmericanCherry TomatoTomatoVegetableRosemaryHerbs & SpicesSummerSideSnackDairy-FreeVeganVegetarianGluten-FreeNut-FreeHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}