{"id": "980fb66db4f771a8a6faecf588fa2421", "url": "https://www.bonappetit.com/story/celery-leaves-feud", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Chill, It’s Corn Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChill, It’s Corn SoupA throwback recipe to make on sweltering summer days, and more from the week at BA.By Alex BeggsJuly 27, 2019FacebookTwitterEmailPhoto by Ditte IsagerFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A blast from the pastIt was so hot last weekend that to stand still risked my thighs conjoining into one sticky leg, and all I wanted was cold soup. “Isn’t that an oxymoron?” asked Carla Lalli Music. I don’t care! I considered gazpacho. Predictable. Green gazpacho? You have my attention. CHILLED CORN SOUP WITH LOBSTER SALAD? I’m there. This 2013 recipe by Rebecca Jurkevich has a blurry photo from the days our website photo resolutions were low, which didn’t deter me, but made my imagination run wild.I liked how it sounds like a country club prix fixe lunch menu that comes with an icy glass of vodka, plus it’s incredibly easy to make. The corn kernels simmer with onion, garlic, water, and thyme. Ya blend it. Strain it. Chill it. Done. The texture was sooo creamy and smooth. Delicious on its own. Even better with a sunken island of lobster meat tossed with a simple dressing of shallot, dijon, and lemon. (I skipped the celery leaves, more on that later.) Yes it was expensive to buy lump lobster meat, but it was a special occasion! Saturday! Worth every $$$$.Get the recipe: Chilled Corn Soup with Lobster SaladPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykTurn up the nightshadesI ended up staying inside and cooking a lot that weekend. So I’ll also direct you toward Andy Baraghani’s tomato salad with warm basil dressing, which sounds fancy, but I promise is a cinch. The dressing is garlic and shallot cooked in oil until starting to crisp, then you move it off heat and add as much basil as you can handle (boom, wilted), and a few anchovies that’ll dissolve in the oil. Next time, I’m doubling the dressing because I used the leftovers the next day on tomato salad Round 2 and it was just as good cold. My favorite quality in food right now.Get the recipe: Tomato Salad with Warm Basil DressingAlex LauBut alsoA THIRD THING. Claire’s rice noodle salad with shrimp is RIDICULOUS. I made it two nights this week—swapping leftover slow-cooked cod for the shrimp—because I had to use up that can of coconut milk for the sauce. I highly, highly recommend it.Get the recipe: Rice Noodles with Shrimp and Coconut-Lime DressingWant this letter before it hits the website? Sign up for our newsletter!In the newsI mean, in the wedding announcements—this story, about a romance between a software designer and a professional juggler who “juggles a knife with a piece of cheese on the end while being held in the air by six people (called ‘the dinner of death,’ the stunt involves him eating the cheese off the knife).” I have so many questions! What type of cheese? What type of knives—those cute stubby cheese knives? Big sharp machetes? Are there crackers???MeanwhileMini Andy and a Giant Brad were filming something together this week. It requires gallons of oil. I’ll let YOUR imagination go wild this time, because it’s top secret, for now!See ChaeyChristina Chaey made her solo Test Kitchen video debut, cooking a cold buckwheat noodle dish in which you make a sauce out of ice cubes. Cool! I mean, chill. Sort of a theme this week. Also in this video, a bold case for NOT salting your pasta water. Above, Chaey carved the Thanksgiving in July turkey for the entire staff. The hero we deserve!Watch it: Christina Makes Buckwheat NoodlesWhat’s new at Trader Joe’s?All this stuff. But also, a new GT Dave’s kombucha flavor, strawberry lemonade, that’s exclusive to Trader Joe’s. And very pink. We tried it in the office this week and some people found it too sour and candy-like, while Alex Delany, Julia Kramer, and I loved its unabashed sweetness and aggressive lime kick. Sort of reminiscent of strawberry-kiwi Snapple. That’s a little inside info from me to you.Memo from the marketThe fine folks of GrowNYC, which hosts the city’s farmers’ markets, sent me an email with their etiquette additions to this month’s column, including: “Do not try to complete a transaction while on the phone or with headphones on,” and “Be a conscientious photographer and ask for permission from farmers (and shoppers) before taking a pic.” A sign of the times. (Please note: my column is for humor purposes, nothing is legally binding advice, unless your name is Steven!)Some eggsI love this tiny art book of photos of eggs, by Kelsey McClellan and Michelle Maguire. See what’s inside here.Unnecessary food meme of the weekUnnecessary food feud of the weekThere was one ingredient I left out of the chilled corn soup, and that was a garnish of celery leaves. Why would I buy a package of celery only for the leaves? “THIS IS OUR MILLION-DOLLAR IDEA,” said Molly Baz and Alex Delany in LOUD unison. Celery leaves, sold like herbs among the parsley and chives at the supermarket “where they belong.” Delany insists they make a dreamy spritz garnish. Good luck with that, friends. “If you love celery,” said Carla, “you’ll love celery leaves.” (Last week she told me, “if you love cake, you’ll love muffins.”) “They are overused by the media elite,” she added—meaning ... us, I think—“but I do love them.”“I would never go out of my way to buy them,” said Christina Chaey. “But some stalks don’t come with leaves and you feel like you failed,” replied Aliza Abarbanel, pointing out how many recipes we have that call for them, like Josh McFadden’s amazing celery, date, and parm salad, and too many recipes to count by Andy Baraghani. “I wish they could be sold on their own,” Andy texted me, wistfully. Gaby Melian wrote, “#iloveit celery leaves and parsley leaves in salads 4ever!!”Get the recipe: Flaky Cod with Celery SaladExplore Bon AppétitBeggs NewsletterRead MoreChilled Corn Soup with Lobster SaladTomato Salad with Warm Basil DressingRice Noodles with Shrimp and Coconut-Lime DressingFlaky Cod with Celery SaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-27", "author": ["Condé Nast", "Alex Beggs"]}