{"id": "9813f98e3f31d91a843a973bbc812c5d", "url": "https://www.bonappetit.com/recipe/spicy-kimchi-sweet-potato-fritters", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Spicy Kimchi–Sweet Potato Fritters Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Kimchi–Sweet Potato FrittersBy Diana YenSeptember 12, 20214.3(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintThe key to getting crispy burnished edges on these fritters is to wring out as much liquid as possible from the sweet potatoes before frying. The spice from the chopped kimchi in the fritter batter and the gochujang yogurt dipping sauce offset the natural sweetness of the sweet potatoes. A great appetizer or an indulgent snack, these are best eaten right away. If you’re feeling extra-ambitious, make your own homemade kimchi too. —Diana YenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBox Grater$13 At AmazonCast Iron Skillet$30 At AmazonFlexible Metal Spatula$9.99 At AmazonIngredientsMakes about 251lb. sweet potatoes (about 2 large or 3 medium), peeled2large eggs¾cup drained finely chopped kimchi½cup all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepperVegetable oil (for frying; about 1 cup)½cup plain whole-milk Greek yogurt1Tbsp. gochujang (Korean hot pepper paste)PreparationStep 1Preheat oven to 200°. Grate sweet potatoes on the large holes of box grater or in a food processor with the grater disk. Transfer to a clean kitchen towel or several layers of paper towels. Gather ends of towel and squeeze over a large bowl to wring out as much liquid as possible; discard liquid. Wipe out bowl and place sweet potatoes, eggs, kimchi, flour, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt in bowl; season with pepper. Mix batter with a fork to combine.Step 2Pour oil into a large cast-iron or nonstick skillet to come ¼\" up sides; heat over medium-high until shimmering. Drop heaping tablespoonfuls of batter into skillet, taking care not to crowd. Using a heatproof spatula, gently flatten fritters. Cook until undersides are browned and crisp, about 2 minutes. Turn over and cook until browned and crisp on the other side, about 2 minutes. Transfer fritters to a rimmed baking sheet lined with several layers of paper towels and let drain. Transfer to a wire rack set inside a rimmed baking sheet and slide into oven to keep warm. Repeat with more oil and remaining batter.Step 3Mix yogurt and gochujang in a small bowl; season with salt. Transfer fritters to a platter and serve with gochujang yogurt for dipping.How would you rate Spicy Kimchi–Sweet Potato Fritters?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleSweet potato latkes!AnonymousShenandoah Valley, VA1/29/2022This may be blasphemy but I can totally see these fritters in a pita bread a la falafel.  They would be amazing and have way more crunch.  I love falafel, but my least favorite part of the sandwhich is the falafel itself.  ;)  Thanks for this inspiration!  My two cents.beejayCalifornia1/22/2022Think we could bake these?JOhnAustin, TX 78756, USA9/12/2021Explore Bon AppétitSweet PotatoEggKimchiFlourKosher SaltBlack PepperOilGreek YogurtgochujangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-12", "author": ["Condé Nast", "Diana Yen"]}