{"id": "9813a83c9a0e70afbc8bb889c831b550", "url": "https://www.bonappetit.com/recipe/miso-pesto-with-ramen-noodles", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Ramen Noodles with Miso Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueRamen Noodles with Miso PestoBy Andy BaraghaniFebruary 13, 20184.4(63)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintSpringy ramen noodles and a cilantro-miso sauce bring a welcome twist to a classic pesto recipe.Ingredients2 servings 4cups baby spinach2cups cilantro leaves with tender stems1Tbsp. white miso1garlic clove½cup grapeseed or sunflower oil1tsp. toasted sesame oil1tsp. fresh lemon juiceKosher salt25-oz. packages fresh ramen noodles (you can find them fresh at Asian grocery stores and some Whole Foods—we like the Sun Noodle brand)1Tbsp. unsalted butter, cut into small piecesToasted sesame seeds (for serving)PreparationStep 1Bring a medium pot of water to a boil.Step 2Meanwhile, purée spinach, cilantro, miso, garlic, grapeseed oil, sesame oil, and lemon juice in a blender until mixture is smooth and very green. Season with salt and pour pesto into a medium bowl.Step 3Cook noodles according to package directions. Drain and add to bowl with pesto. Add butter and toss until butter is melted and noodles are coated in sauce.Step 4Divide noodles between bowls and top with sesame seeds.Step 5Do Ahead: Pesto can be made 1 day ahead. Cover and chill. Color might darken slightly.How would you rate  Ramen Noodles with Miso Pesto?Leave a ReviewTell us what you thinkReviews (46)Back to TopTriangleThought this had good flavor but was very greasy. I don't shy away from fat but 1/2 cup for 2 servings felt intenseJess1/17/2022Sooooo good! Great way to use leftover greens. I already can’t wait to make this again. AnonymousToronto12/27/2021We had this for dinner last night and really enjoyed it. I did not have spinach on hand but did have swiss chard I had previously blanched and frozen so subbed that in for the spinach (per 1 cup of fresh greens I use 1 ounce of blanched) and it worked just fine. I can get fresh ramen noodles from a local asian market.\nI might cut back on the neutral oil a bit just to see if it works but otherwise I am a fan.AnneSacramento, CA4/30/2021Sadly this was not a hit for us. It was very dry granted based on others I used less oil. Other than that I made per recipe. Will not make again. CamiejoPlaya del Rey3/10/2021Delicious quick and easy lunch. I used 6oz dry linguine wheat pasta instead of 2x5oz fresh noodles in the recipe, and used half the amount of oil (1/4 cup olive oil). A little tricky to blend the sauce, but half the oil was plenty. It tasted like a generous amount of oil. Super tasty. Will make it again soon. Thanks, Andy!\nTinaCA12/3/2020Love this but made some minor adjustments — for the herbs I did half cilantro half mint the first time and half parsley half mint the second time — both were very delicious! The mint adds an extra brightness that worked well with the flavors. I doubled the lemon and cut the oil by half. As someone else said, it definitely benefits from being well salted. lalasf11/17/2020I'm reviewing this again because I've made it over half a dozen times since my first review. This is my go-to dish to use up ANY greens I have lying around from my CSA. I just made it today using arugula, spinach, cilantro, garlic scapes, and a spring onion, and it's great. No, it doesn't have as strong a flavor as traditional ramen, but it's not traditional ramen. It's a different dish. And it's great!emonydaxwisconsin8/27/2020This was so good! Loved the freshness and the fact that it had me eating handfuls of spinach without complaint :) Like others, I had to sub the noodles and used plain old spaghetti, and it worked just fine. I did find that it needed more acid and squeezed some more lemon juice on top at the end. I also topped with crispy onions for some crunch and a salty bite!AnonymousWashington, DC6/10/2020I thought this was pretty good but not as good as most BA recipes out there. Being European, I had some trouble with \"4 cups\" as quantity of spinach, instead of weight. In the end, I went by the video and interpreted it as roughly two big hands full. This may have significantly altered the taste of the finished product, but I found my version lacked just a bit in flavor, despite trying to amp it up with more lemon juice and miso. Will probably try again in a smaller batch so it's easier to change up a bit. celinenerdThe Netherlands5/13/2020Recipe looked delectable but I was disappointed. The pesto is good but not as sharp and flavorful as its OG cousin, and the ramen left it all feeling a little lackluster, even with shrimp on the plate. Could see throwing the sauce atop a lean protein like chicken or pork. Maybe good for a pantry-clearer, but I wouldn't use all those fresh herbs and greens in it unless they were on their way out. AnonymousMadison, WI5/12/2020I was so exited to make this dish and was really looking forward to this meal but sadly, we did not enjoy this dish and could not finish. We felt there was something amiss and lacking in the dish. AnonymousNew York City5/8/2020So good! I halved the recipe since I made for 1, and cut the oil in half further (so only 2 tbsp). Loved the freshness the cilantro brought. I have some left over and will definitely use on top of eggs & roasted vegetables.AnonymousNashville4/8/2020This is really good!!! I did make a few little changes but I think overall the flavor profile was probably the same. I didn't have cilantro but I DID have leaves of scallions that I needed to use up, so I threw those in. Then I added a little tiny bit of rice vinegar. Finally, I used ghee instead of butter. It came together super easily with no fuss in my food processor and the color and texture of the miso pesto was really fab. Can't wait to use this recipe to use up fresh spinach all summer. emonydaxwisconsin3/8/2020This was so delicious I made seconds (and ate them all) immediately!! This will definitely become one of my staple go-to's!!AnonymousAustin, TX3/5/2020This might be the recipe from BA that I've made most often. Super fast, easy, incredible taste. I love that it has a lot of spinach, and it seems like one of those recipes that's 'accidentally vegan' (if you omit the butter) but you wouldn't notice or care, 'cause it's just delicious. I mostly don't use the butter, because I think it tastes fresher without it, and also find that the pesto is \"clingy\" enough. Be sure to add enough acidity and salt :) AnonymousVienna, Austria1/11/2020Explore Bon AppétitRamen NoodleNoodlePasta & NoodlesSpringQuickEasyWeeknight MealsSideVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Andy Baraghani"]}