{"id": "9825d3454e784dabd9bcdaa67628f0bd", "url": "https://www.bonappetit.com/recipe/beef-and-bacon-stew", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Beef and Bacon Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBeef and Bacon StewBy Molly BazDecember 9, 20184.9(97)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintYou can call it beef bourguignon if you want to sound fancy—nobody has to know how much easier it is than the French classic. About the wine: Resist the urge to buy the cheapest bottle you can find, and choose a red wine that you'd be happy to drink, especially since you'll drink some of it and use the rest. And while serving this hearty stew with some torn bread is definitely the fastest way from point A to point B, it would also be incredibly delicious spooned over some boiled or mashed potatoes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Bowl$18 At AmazonDutch Oven$80 At AmazonMedium Bowl$17 At AmazonVegetable Peeler$10 At AmazonWooden Spoon$6 At AmazonTongs$13 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonIngredients4 servings1750 ml bottle dry red wine12½-lb. boneless beef chuck roast1tsp. freshly ground black pepper1Tbsp. kosher salt, plus more8oz. bacon3medium red onions3medium carrots8garlic cloves4large sprigs thyme2Tbsp. white miso paste2Tbsp. all-purpose flour1cup parsley leaves and tender stemsCrusty bread (for serving)PreparationStep 1Preheat oven to 300°. Open bottle of wine and pour yourself a glass, then proceed with prepping your meat and vegetables. You’re going to do some very light butchery—fear not! It’s easy. Place 2½ lb. beef on a cutting board and cut into 2\" cubes. It’s all good if they’re not perfect, just try to cut them in relatively evenly-sized pieces so they will cook at the same rate. Transfer beef to a large bowl, season with 1 tsp. pepper and 1 Tbsp. kosher salt, and toss to coat.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Cut 8 oz. bacon crosswise into 1\" pieces. Transfer to a large Dutch oven. Set on stove (but don’t turn it on yet).Step 3Clean your cutting board or flip it over so you don’t contaminate your vegetables with meat stuff. Time to do some veg prep! Cut root ends off 3 onions, then cut each onion in half through the cut ends. Remove and discard peels, then cut each in half again (you should have 12 quarters total). Transfer to a medium bowl.Step 4Scrub 3 carrots, then peel. Cut off and discard tops. Cut carrots in half diagonally. If the top halves of carrots are particularly thick, cut those in half lengthwise. Transfer carrots to another medium bowl.Step 5Smash 8 garlic cloves with the side of chef’s knife. Peel off and discard skins. Add all but 1 garlic clove to bowl with carrots, reserving clove for later.Step 6Heat Dutch oven over medium. Cook bacon, stirring often, until crisp, 11–13 minutes. Use a slotted spoon to transfer bacon to a large bowl, leaving bacon fat behind in the Dutch oven.Step 7Increase heat to medium-high and, using tongs, add beef in a single layer. Cook, undisturbed—seriously, don't touch it!—until well browned on one side, 5–7 minutes. Turn and cook until well browned on the other side, 5–7 minutes longer. Don't rush this part—browning the beef well will contribute tons of flavor to the stew. Transfer beef to bowl with bacon.Step 8Reduce heat to medium. Add onions to pot cut side down. Cook, undisturbed, until golden brown on one side, 2–3 minutes. Turn and cook until browned on the other side, 2–3 minutes longer.Step 9Add carrots, garlic, 4 sprigs thyme, and 2 Tbsp. miso; season with salt. (If miso seems like a weird addition here, just trust—it'll lend tons of savory depth to your braising liquid without making the whole thing taste like miso soup.) Cook, stirring occasionally, until garlic is just beginning to turn golden and miso coats bottom of pot, about 2 minutes.Step 10Sprinkle 2 Tbsp. flour evenly over vegetables and cook, stirring, until veggies are coated, about 30 seconds. This will help to thicken the braising liquid.Step 11Add the rest of your bottle of wine to pot, scraping bottom of pot with a wooden spoon to get up any stuck bits, and bring to a simmer. Cook, stirring, until you can no longer smell the alcohol, about 2 minutes.Step 12Nestle beef and bacon back into pot along with any juices that have accumulated. Add 2 cups water (or enough to just barely cover beef with a few pieces poking out). Return to a simmer, cover pot with lid, then transfer to oven—we love braising in the oven because the heat is much more even than it would be on the stovetop. Bake 1 hour and 30 minutes.Step 13Uncover pot, giving everything a good stir, and continue to cook until beef is very tender, 30–60 minutes longer.Step 14While beef is cooking, finely chop 1 cup parsley and transfer to a small bowl. Finely grate reserved garlic clove into bowl with parsley and toss to combine.Step 15Taste and season stew with salt, if needed. Divide stew among bowls and top with parsley gremolata. Serve with crusty bread alongside.How would you rate Beef and Bacon Stew?Leave a ReviewTell us what you thinkReviews (48)Back to TopTriangleIncredible, gremolata is a must to brighten up such a rich stew. Will be making this again and again!.KingPizzaCleveland, Ohio1/1/2022Amazing don’t skimp the gremolata.Anonymous10/26/2021Can I use sirloin for this? Instead of chuck?Eric3/11/2021I made this stew exactly according to the recipe for a dinner with my sisters and husband.  It was the most delicious stew any of us have ever tasted.  A week later and I'm still hearing praises about how wonderful this stew was.  Mary HDallas, TX2/1/2021Holy WOW! If I could leave 6 stars I would. This is by FAR the best beef stew recipe I have had in my life. I hate to say it, but it is even better than mom's stew. This was easy, made the entire house smell like the inside of a Ski Chalet, was super tasty, and extremely tender (fall apart). I took other reviewers suggestions and it made a meal we eagerly ate every night for a week! It is now a permanent part of our standard rotation. Also.. I have never had my husband rave about ANYTHING I make as much as this.\n\nWhat I did differently:\nI cut up the veggies before the meat to save on germ transfer opportunities\nI used a GOOD Cab Sav (~3/4 bottle)\nI used 6 carrots and cut them slightly smaller (~2\" in length)\nI used 2 of those giant red onions instead of 3 'medium' (what store has medium anymore?) and roughly chopped them\nWhen I took it out of the oven to stir, I added yukon gold potatoes (cut into ~2\" sections) and 8 oz of roughly cut up mushrooms\nI let it cook for 60 min after I put it back in the oven, then turned the heat to 225F and let it sit in there until we were ready to eat (~60 more minutes)\nWhen I pulled it out at the end, I added FROZEN peas (let them heat up in the stew) to my liking (~1.5C- yes, I love peas)\nI skipped the parsley/garlic addition\n\nAn additional note that may or may not apply: I used a 6+Qt Le Creuset Dutch oven. It was barely big enough to fit all the meat in it during the searing step (could have been how I cut it up?), and with all the bacon grease left over, it was hard to get it all to 'brown', since the beef fat started to add to the bacon grease and they started boiling instead of searing. I removed the majority of the grease with a turkey baster (which worked out great) and just re-added it before the next step.Emily SRidgecrest, CA1/22/2021This was GOOD. I made it per the recipe instructions subbing the miso paste with fish sauce, didn't have miso paste. I also cooked it longer on the stove top after it came out of the oven (could have just left it in the oven for an additional hour). I also did not eat it until the next day (not planned) but was able to lift off the fat after a day in the fridge. I reheated it, in its entirety, on day 2 and served it with egg noodles. CSCNorthwest, CT1/19/2021I know it generally a good idea to clean the cutting board after cutting meat but does it really matter if ultimately you will throw everything together and cook for 2 1/2 hours in the same pot? WhalemanSacramento 1/13/2021Tastes lovely, but found the sauce very watery, anyone else find this?AnonymousDublin ireland1/13/2021This looks amazing.  Can I use a slow-cooker instead?Ash Boston, MA1/6/2021This is a delicious recipe. I make it once or twice a month, especially during the cold months. I would change very little. The biggest thing I would change is the prep order. Why is the recipe telling you to prep your meat before the vegetables? You'll be way better off prepping all vegetables first, then meat, then start cooking once all prep is done. This means you don't need to clean or flip your cutting board, you just do all your prep on one side then stick it in the dishwasher(assuming not wood).\n\nSecond thing, the recipe doesn't specify a flame height when returning the dutch oven to the stovetop. I do med-low and that works well for me.\n\nThird, rather than 3 medium-sized carrots(like in the images), I would do 5+ small carrots(not baby, but those very thin short specialty/organic carrots you get in bunches, multicolored is even better), they tend to hold up better during cooking and just look better when serving.\n\nFourth, this is one of those recipes where it helps to let it sit on very low or no heat for a few hours after completing it, or let it sit in the fridge overnight and reheating it the next day. The longer the meat sits in that broth the better it's going to taste. For this reason, I start it in the morning, finish it in the early afternoon, then let it sit on very very low heat(smallest burner on lowest setting) for the remaining hours until dinner.\n\nThat's all I've got. Like I said, all really minor tweaks. It's an all-around great recipe. Preparing it a couple of times gives you enough insight into the recipe to be able to tweak it to fit your preferences.HalSeattle, WA1/4/2021I don't generally care for beef stew and my husband is satisfied with Dinty Moore! This was perfect for both of us. I used only about 1/2 a bottle of wine and 2 cups of beef broth. Added peas and potatoes after the covered round in the oven and then added quartered white mushrooms before reheating for serving. This was fantastic and RICH. I accidentally used an entire pound of bacon and removed at least half of the bacon grease before adding the beef. Next time, and there will be a next time, I'll add the peas and the mushrooms toward the end as I prefer my peas less mushy. Carol in STLSt. Louis, MO1/4/2021Reduced the amount of wine to 2/3 of the bottle and substituted miso paste for miso soup packet (thanks to a comment below) - genius!\nAmazing the day after AND two days after\nAnonymous12/20/2020Ok, the wine you use really matters, because a whole bottle in the stew means the wine flavor is going to be unavoidable. The first time I made this I used a bottle that was too much on the acidic side, which I tried to rebalance by adding honey, which worked. The oven-braising means that this stew comes out PERFECT. I am henceforth never braising on the stovetop ever again because of how tender the beef turned out. The only thing I would change about the recipe after making it is rather than leave the onion in huge pieces, go the traditional method and dice them up so that they melt into your stew; I don't think chewing on the pieces of limp onion was a great textual experience. I have this in the oven right now as I speak using a better bottle of wine and I'm excited to taste the difference. VSeattle, WA12/10/2020Made this for my son whom I cannot see right now die to the pandemic. I used to make him stew when he first moved and and was at school so it's a good memory for him and gives me something to give him besides endless heart emojis. claireVancouver BC11/29/2020I love this recipe and I've made it three times now. This time, I only had 1.5 lbs. of beef so I added some quartered, peeled, and rinsed Yukon Gold potatoes part-way through. This stew is very rich and filling and super flavorful; don't skip on the better wine or the crusty bread :) MBMPortGreenville, SC, USA10/26/2020Explore Bon AppétitStewSoups and StewsBaconCured MeatMeatBeef ChuckBeefWinterEasyMainDairy-FreeNut-FreeBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-09", "author": ["Condé Nast", "Molly Baz"]}