{"id": "982eed9b48e34ac74bfd7217c15eaae7", "url": "https://www.bonappetit.com/story/baking-by-weight", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "How Do You Bake By Weight When the Recipe You're Following Only Provides Volume? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Told Me to Buy a Kitchen Scale But the Recipe Doesn't Give Weights. Now What?We promise we haven't betrayed you.By Sarah JampelFebruary 20, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.We’ve begged you to bake with a scale so you can measure flour and sugar and nuts and cocoa powder by their weights rather than their volumes. We were so serious, we made it number one on our list of baking rules to guarantee success. We published not one but two articles about why scales are useful even if you don’t mess with baking (but especially if you do). Heck, we even hired several small aircrafts to skywrite “Just Buy A Scale Already” over Miami Beach. Are we sounding desperate?So let’s assume our pleas have worn you down: You got a scale! But now you’ve run into a small problem, which is that the recipe you want to bake doesn’t provide weights. So many don’t—including those on this very website (like this easy sheet cake with chocolate-cream cheese frosting). How do you bake by weight when the weights are nowhere to be found? What’s a resourceful baker to do?Look, it can also weigh spaghetti!\nPhoto by Chelsie CraigFirst, you can Google it. I don’t mean that in the obnoxious “let-me-Google-that-for-you” quip I used to spout at my parents when I was 15. I mean: You can Google how much 1 cup of flour (or sugar, packed brown sugar, almond flour, activated charcoal, matcha, puffed millet…) weighs. In other words, the world wide web contains volume-to-weight conversions for practically any ingredient you might be working with. (King Arthur Flour has an especially useful searchable database that I’ve got bookmarked on my own browser.) If you find the weight of 1 cup but your recipe calls for ⅔ cup or 4⅓ cups, well, that’s where some very easy algebra comes in. Before I start baking, I usually spend a couple of minutes with Google and a pencil, writing down the weight conversions alongside the given volumes.Once you look up the weights for go-to ingredients time and time again, you’re bound to remember them. In the BA Test Kitchen, our standard is that 1 cup all-purpose flour equals 125 grams and 1 cup sugar equals 200 grams. Even if you only remember those two numbers, you’ll save yourself from dirtying a lot of measuring cups.Second, if you must measure by volume (let’s say your scale is out of batteries or you don’t have WiFi to Google), measure flour by the spoon-and-level method instead of the dip-and-scoop method. It will give you a cup that’s closer to 125 grams. Here’s how to do it: Use a fork to rake through your flour to lighten it up. Spoon it gently into a cup, taking care not to compact. Then use the back of a knife to level off the top in one straight sweep. Dipping-and-scooping, on the other hand, makes a more dense and compacted cup, which will result in heavy cakes and puck-like cookies.Perhaps, one day, all baking recipes will include weights (but none of the presidential candidates are running on that platform). Until then, Google is there to make sure that scale you so diligently purchased is getting good use.Buy it: Escali Primo Digital Scale, $20 on AmazonAll products featured on bonappetit.com are independently selected by our editors. If you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-20", "author": ["Condé Nast", "Sarah Jampel"]}