{"id": "9839dd6992d68c359e174a489223e97b", "url": "https://www.bonappetit.com/story/what-is-potlikker", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "What Is Potlikker? For Starters, Powerful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Potlikker? For Starters, PowerfulCarla Hall’s favorite soul food staple makes for thick gravies, flavorful veggies, and rich stews.By Antara SinhaFebruary 16, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Potlikker (or “pot liquor”) is simple enough to describe—it’s the brothy liquid gold left behind after boiling greens and beans—and its roots in Southern culinary traditions and heritage run deep. For Nashville-born chef Carla Hall, potlikker is more than a delicious by-product of braising; it’s a cultural bridge between preconceived notions of soul food and what the cuisine represents today.Carla Hall's Soul Food: Everyday and CelebrationCarla Hall's cookbook is a available now.\n$15 at Amazon$30 at Bookshop.org“When people think about soul food, they think of heavy dishes like gravies, macaroni and cheese, and candied yams,” Hall says. “I want to highlight potlikker as a cultural connection to soul food.” An ingredient whose use sheds a light on the complex racialized history of Southern cooking, potlikker was once valued only by diligent enslaved Africans who saved the nourishing broth for their families after cooking greens. Eventually, potlikker became so popular that in 1931 an Atlanta newspaper editor stirred a nearly monthlong public debate involving the governor of Louisiana and whether cornbread should be dunked or crumbled into it. photograph by Scott Suchman“Potlikker was so much a part of growing up,” Hall says. “Most people don’t analyze what they’re eating as a child.” Now, in her cooking, writing, and eating, “I intellectualize it.” Here Hall shares her personal approach to making potlikker as an intentional first step to imbuing a number of knockout dishes with layers of flavor. Think of these delicious, aromatic-packed potlikkers as ultra-concentrated broths, each one becoming a base ingredient for two different hearty comfort recipes.A bright Fennel Potlikker finds its home in both a lemony vegetable bowl with barley and velvety shrimp and grits. A take on the classic Country Ham Potlikker becomes the base of a luscious gravy for smothered pork chops and a zippy vinaigrette for a sweet and savory apple and bean salad. A rich Smoked Paprika and Sun-Dried-Tomato Potlikker buoys brothy orecchiette with savory-sweet turnips and braises hearty chicken thighs.Through these recipes Hall celebrates the origins of potlikker as an ingredient born of thrift, nutrition, and necessity. “I want [people] to see that it’s accessible,” Hall says. “Once you make the potlikker, everything else is easy.”Photograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehFennel PotlikkerFennel is rarely used in broths because its anise flavor is so strong. Here Hall doubles down on those licorice notes by adding Pernod, an anise-based liqueur that’s a natural pairing with seafood and vegetables. Use this potlikker as a deeply flavorful base for these two dishes, or anything that would benefit from an intensely aromatic broth.VIEW RECIPELemony Spring Vegetable and Barley BowlTake a bite of spring in the form of this one pot-dish filled with fresh asparagus, tender green peas, and the creamiest barley around.View RecipeShrimp and Grits With Fennel PotlikkerA bowl of velvety grits and saucy shrimp with Carla Hall’s herbaceous potlikker at the base of it all.View RecipePhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehSmoked Paprika and Sun-Dried Tomato PotlikkerThis plant-based potlikker pulls tons of umami from a handful of pantry staples. Whole sun-dried tomatoes will work just fine; simply drain them (if needed) and finely chop before adding. Use it to ramp up the flavor in vegetarian recipes like this brothy orecchiette pasta or braised chicken thighs.VIEW RECIPEBraised Chicken Thighs With Olives and HerbsFall-off-the-bone chicken thighs are braised to perfection in a smoky tomato potlikker.View RecipeBrothy Pasta With Miso-Butter TurnipsAll we are saying, is give turnips a chance.View RecipePhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehCountry Ham PotlikkerCarla Hall’s deeply savory take on potlikker is made by slowly simmering country ham with garlic and crushed red pepper flakes. In it, country ham is dry-cured and often smoked, resulting in a very concentrated flavor. Smoked ham hocks will give similar intensity to this savory broth. Hall uses this potlikker as a gravy to up the ham factor in pork dishes and to build a game-changing salad dressing.VIEW RECIPEBean and Vegetable Salad With Potlikker VinaigretteTender roasted squash, crunchy apples, and creamy beans come together with a spicy country ham vinaigrette to create a balanced cold-weather salad.View RecipeSmothered Pork Chops in Potlikker GravyCarla Hall’s juicy smothered pork chops serve up layer upon layer of Southern comfort.View RecipeExplore Bon AppétitcookingCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-16", "author": ["Condé Nast", "Antara Sinha"]}