{"id": "984f1b0af3cc9cd8983e7e163078400c", "url": "https://www.bonappetit.com/recipe/lemony-salmon-and-spiced-chickpeas", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Lemony Salmon and Spiced Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueLemony Salmon and Spiced ChickpeasBy David TamarkinJanuary 8, 20194.2(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue Li, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintEverything’s better in bowl form, and this salmon dish flavored with a garlicky za’atar dressing is no exception. Reprinted With Permission From COOK90: The 30-Day Plan for Faster, Healthier, Happier Meals By David Tamarkin, Published By Little, Brown and Company, 2018Ingredients4 servings1lemon, thinly sliced, seeds removed½cup extra-virgin olive oil, plus more for drizzling11½-lb. salmon fillet, preferably skin-on½tsp. kosher salt, plus moreFreshly ground black pepper115-oz. can chickpeas, rinsed, patted dry1garlic clove, finely chopped2tsp. za’atar1tsp. fresh lemon juice4cups baby arugula or baby spinach4radishes, trimmed, thinly slicedFlaky sea saltPreparationStep 1Place a rack in lower third of oven; preheat to 300°. Toss lemon slices in a large bowl with a drizzle of oil. Arrange slices in an even layer on a rimmed baking sheet. Set salmon on lemons. Season salmon all over with kosher salt and pepper, then drizzle and rub with some oil. Roast until salmon is just barely opaque in the middle, 12–17 minutes, depending on thickness. If you like your salmon well-done, cook it a few minutes longer, but keep in mind that you risk the chance it will dry out. Let salmon cool, then flake into medium-size pieces with a fork.Step 2Meanwhile, bring chickpeas, garlic, za’atar, and remaining ½ cup oil to a bare simmer in a small skillet over medium-low heat. Cook, stirring occasionally and reducing heat if needed, 10 minutes. Stir in ½ tsp. kosher salt (less if your za’atar is salty) and remove skillet from heat.Step 3Using a slotted spoon, transfer chickpeas to a medium bowl, leaving oil behind. Whisk lemon juice into oil; taste dressing and season with more kosher salt and a few grinds of pepper if needed.Step 4Toss arugula in a large bowl with 1 tsp. dressing. Divide among bowls along with radishes, chickpeas, and salmon (and lemons if desired); drizzle with more dressing. Sprinkle with sea salt and more pepper.How would you rate Lemony Salmon and Spiced Chickpeas?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleA quick but filling and adaptable recipe. I didn't have any radishes so it felt a little bit too oily and one sided for me so I'll consider using more lemon (and less oil on the salmon) next time. AGermany5/10/2021Based on other reviews, I added an additional garlic clove and extra tsp. of za'atar, and fresh dill at the end, but I still thought this needed more flavor. I made half the amount of salmon, but the full amount of chickpeas and dressing — and we ate all of the chickpeas. Giving it four stars though because it's a great starting point and easy to adapt. Next time, I will add more spices to the chickpeas and add feta to the bowl. If you're making the full 1.5lbs of salmon, I would definitely double the amount of chickpeas. JessBrooklyn, NY11/10/2020This was a fairly filling dish and was relatively easy to prepare. Also, easily modifiable. Didn't have any greens on hand, so threw some cooked, frozen green beans in the dressing in a pinch. AnonymousSilver Spring, MD8/21/2020My way to go when I want to eat chickpeas. Delicious with or without the salmon.AnonymousFrance4/10/2020Not bad! Not my favorite salmon recipe (highly suggest the tumeric/coconut salmon on BA which is heavenly) but loved the chickpeas! I had a great za'tar that i don't get to use nearly as often as I would like and enjoyed the salmon. I wrapped the salmon in aluminum foil with tomato's on top of the lemon and cooked much faster and evenly! Highly suggest. india.witkin7017NYC1/30/2020This was AMAZING. We also couldn't find za'atar and substituted cumin/paprika/thyme like what other reviewers have said. Truly delicious and very weeknight friendly. Anonymouschicago, il8/27/2019Absolutely delicious combination of olive oil, lemon and addictive za'atar. A hit at my lunch party when served over brown rice. Tasty and so simple, what's not to like?grabadoraPuerto Rico7/17/2019This is absolutely delicious.  I inadvertently recylced the magazine this was featured in and I found it on line so as not to lose the recipe.  The chickpeas are delicious.  I couldn't find the spice in my local market so I used cumin instead.  Outstanding.  The salmon was so tender and the rest of the incredients really make the bowl.  I added grated parmesan to the greens, with lemon juice.  steflindquistPhoenix2/2/2019Just too boring and the texture combinations did not work for me. Like others made up my own Zatar mix and used a lot more to get the flavor, reduced the EVO and increased the oven heat based on the size of the salmon. But really not worth the effort (even though its an easy dish).flow2stuart9081Portland, ME1/25/2019I appreciate how easy this recipe is, and the accessibility of the ingredients! I got lucky that the super market stocks za'atar.\nI agree that this called for way too much EVOO. Stir-fried it the next day with butter and more lemon, minus the radishes and it was fairly decent. thinking it might make a good frittata topping or omelette filling as well. It's not a bad recipe, it just needs some help. The salmon needs color, and a 300˚ for 20 minutes just didn't cut it for me. EagleM16Denver, CO1/22/2019This was amazing! Yes, I had to go to 3 stores to get the za'atar (2 Whole Foods were out - think a lot of Bon Appetit readers were making this). Any stores that carries Spicely (the little green boxes) should have it. San Francisco1/20/2019I googled how to make your own za'atar and it worked out fine.  Did a little change-up, used lemon olive oil and only 1/4 c., and used two large garlic cloves.  Also roasted the salmon at 400 for about 12 minutes.  Also, drizzled a little of lemon oil on top before servingszavadil1Mpls.1/17/2019Za'atar is nowhere to be found in local grocers in my area. Improvised with Paprika & Cumin and it was delicious. I agree with the other review, 300 degrees did nothing, I had to finish at 350 for an extra 5-7 minutes then broil for 1 minute to get the top finished off. 1/2 cup of olive oil is wasteful unless you're feeding 8-10 people. 1-2 tbs with the lemon juice is enough. I also tossed the radishes in a squeeze of lemon juice so they'd have something to them. \n\nOverall, great and quick to make. Just needs a few realistic tweaks to execute. AnonymousOrlando, FL1/16/2019This was good, but not great.  There are too many tweaks I needed to make to have this dish work.  First, the salmon was basically raw at a 300 degree oven after 17 minutes.  I added 5 more minutes and the thinner piece of salmon was fine.  The thicker piece of salmon needed close to 10 more minutes, and it was still rare at its thicker parts, but that was fine. The half cup of EVOO was too much, considering the recipe said to dress the greens with 1 teaspoon, plus a little drizzle when all is done.  More like 1 tablespoon to actually dress the greens.  1 teaspoon of lemon juice for almost a 1/2 cup of oil??  I put 3 teaspoons of lemon juice and it barely made a flavor difference.  2 teaspoons of Za'atar?  Not much flavor from this expensive seasoning.  It wasn't hard to make, but it wasn't really worth the effort.  I enjoyed it, my teenage daughter liked it, but my hubby thought it was lacking.Monica LombardiVirginia Beach, VA1/14/2019Explore Bon AppétitSalmonFishSeafoodChickpeaBeanVegetableZa'atarHerbs & SpicesQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "David Tamarkin"]}