{"id": "9859fbee1ed0cee6dfef55afbed76fc2", "url": "https://www.bonappetit.com/story/making-wine-with-danilo-marcucci", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Making Wine With Yoda | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMaking Wine With YodaAn Italian master taught me how the region’s best natural wines get made. And then he taught me some more.By Marissa A. RossJuly 10, 2018FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmailHe said it out of nowhere, in the same stern tone he used to dictate fermentation processes or to tell someone where to park: “You should make wine.” I searched his face in the patio light for any sign of humor. It was April 2018 in Abruzzo, Italy, nearly a year to the day since I’d met him. After he said it, he didn’t curl a lip or crack a smile. There wasn’t even a nose twitch. As far as I could tell, Danilo Marcucci was carved of the same Umbrian limestone that lay beneath his vineyards. And he was serious.Marcucci refers to himself as “a simple Umbrian man,” but in the world of natural wine, he is a master. He has 13 vintages under his belt. He’s a consultant for nearly a dozen wineries scattered across the country—from outside Rome to Trento in the Alps. He is prolific, methodical, and idealistic. And I’m an unruly wine columnist who writes nonsensical tasting notes that could be ripped straight from a Lewis Carroll book.“Oh, come on!” I crowed, throwing back my glass of sparkling Grechetto with a smile. He once asked me to hoe weeds at his winery in Ceppaiolo, and I lasted about 45 seconds. He knew my hands were soft and useless. But again, he didn’t laugh. I explained how I respected winemakers too much to make wine myself. I didn’t know anything about farming. I couldn’t make wine. “You have the taste, the mind, the philosophy,” he said. “The rest I can teach you.”I shook my head and rolled my eyes. Marcucci tapped his fist on the table. “You know, I’m sorry,” he said. “I was mistaken. I thought you were strong, but you are weak.” Without hesitation, my right hand shot up, index finger pointed. “Hold on. I’m not weak,” I spit, the wine rushing to my ego. I finished my glass before pouring myself another for no reason but dramatic effect. I leaned back with my chest puffed and there it was. Marcucci was finally smiling (slightly). He knew he had pushed the right button.“I’m not so sure,” he shrugged, gathering his belongings. He left me on the patio.The author and her Jedi wine master at Tiberi vineyards in Umbria.\nPhoto Courtesy of Marissa A. RossOne year earlier I had never heard of Danilo Marcucci. I was in a van, tracing the white- flowered countryside of Abruzzo on the way to Vini Rabasco, when I first learned his name. I was surprised to learn Marcucci was not only the head winemaker of the beloved Vini Conestabile but also the head consultant—or as he says, “collaborator”—on many of my favorite Italian wines. The Rabasco “Cancelli” Montepulciano I had compared to a Fellini character—archetypal yet complex, simple yet so damn sensual. The Furlani Sur Lie Alpino Macerato, a sparkling Pinot Grigio, that was so good my only note was just a big cursive scribble that read “All the feelings!!!” Marcucci was behind it all—the humble guru hiding in the shadows of a galaxy far, far away and the opinionated vigilante plotting from the caverns below his castle. He’s the Yoda of Italian natural wine. Or maybe the Batman.Technically, his castle is a manor in Monte Melino in Perugia. More technically, it belongs to his wife, the Countess Alessandra Conestabile della Staffa. Regardless, it has legitimate bats, and he drives a black Audi A6 Avant that could be mistaken for a low-key Batmobile. He looks the part too, magically appearing just as he is needed, with crossed arms, furrowed brows, and salt-and-pepper hair, always in a perfectly tailored shirt whether he is in the vineyard or out to dinner. He is shrewd and serious, speaking slowly in low-toned phrases that come out like profound poetry in his broken English.I was endlessly fascinated by him but also a little afraid. Most men who are that serious about anything have little patience for me. I’m a five-foot-four woman with a ten-foot personality who exudes equal amounts of anxiety and ego, who chatters excitedly and is prone to passionate fits about everything from the Beatles to who are these people who wear just their socks into airplane bathrooms. But I elicit a particular brand of contempt from men who are that serious about wine. Behind my back they talk about how I’m ruining wine by drinking straight from the bottle on Instagram. To my face they say things like “You don’t know how to taste. But if you take off your shirt, I’ll teach you.” And they never forget to tell me it’s “cute” that I wrote a 300-page book about wine, as if it didn’t require any hard work or skill.But I wouldn’t let that stop me from learning everything I could from this Marcucci character. On this visit he guided a group of us through his wines. I asked a billion questions, elbowed my way to the front of every tasting, and sprinted down four flights of stairs after eating three pounds of pasta to clarify his position on using volcanic sulfur to protect against powder mold in the vineyard. When I sat shotgun while he sped through Spoleto, I swallowed the lump in my throat and asked if I could come back to really study his work. I braced myself, waiting for this very serious wine man to say I should stick to drinking in bikinis.Marcucci in his Conestabile Della Staffa vineyards in Umbria, discussing the changing climate of Italy.\nPhoto Courtesy of Marissa A. RossInstead, Marcucci gave me a seat at a table I’d never been invited to. Without taking his eyes off the road, he said, “Scared of the light of success, I did all of my work in the shadows.” Because what else would Yoda/Batman say. When he did turn to me, he offered to host me in Italy later that summer to learn.I returned in August 2017, the once vacant vines now bursting with vibrant green leaves. I listened as Marcucci delivered sermons about the importance of minerality and diversified agriculture. I watched as he coated 30-year-old Cabernet Franc rootstock in wax to graft it with Aleatico. Under the canopy of Montepulciano vines, drooping with grapes that looked nearly navy blue under their hazy coats of native yeast, Marcucci taught me how to measure sugar and inspect seeds for acidity. Every grape, every plant, every rock is individually assessed—and celebrated—for its part of the whole.Marcucci lives by a strict code of winemaking: no chemicals in the vineyard, no technology in the cellar. But “no technology” doesn’t mean he pumps his juice into a Crock-Pot and lets whatever happens happen. Working strictly with spontaneous fermentation—where a wine begins fermentation naturally without added yeast—he is attentive and attuned to his wines, living within the small intersection of science and spirituality. He tried to illustrate the process through diagrams, but they left us sighing. You cannot chart when wines should be racked if you’re deciding by how they smell on that day. Nor can you articulate when a wine is just bitter enough that you should jump into a 1,000-liter vat and pull out the green seeds by hand. That takes true connection.One day we were driving to his newest project, Vini di Giovanni, when Marcucci announced, “Today, we harvest.” Much like polar bears and coral reefs, the traditional harvest season in Italy has been thrown off-balance by climate change—we were a month ahead of schedule. I was unprepared in a tank top and shorts but thankful I’d remembered my Flonase.Marcucci handed me a pair of clippers and a crate. I dug my bare knees into the long grass and thistles, the rocky soil covered in dead branches and prickly weeds. I could sense the hives running up and down my legs, but it didn’t matter. I felt connected to wine in a way I never had before.I started writing about wine because it was transportive. I couldn’t afford to travel in my 20s, but with a bottle of wine, I could close my eyes and be in Sicily or Santorini. It allowed me to experience places I’d never been. I could smell them, taste them, live through them. And now here I was actually in Umbria, with the smell of crushed red grapes on my shirt, the dirt I loved to taste under my nails, and hives all over my calves.After the Ciliegiolo was picked, we walked up the rolling hills to Vini di Giovanni’s tiny cellar. It had two steel tanks, two vats, and an old wooden winepress. Marcucci strapped on a rubber apron. “Wash this down, drag that hose there, bring those crates here,” he instructed. Floods of coral juice poured out of the press into vats along with a pied de cuve, a native yeast starter. Marcucci mixed the pied de cuve into the juice with the full length of his arm, then rested and stared into the frothy abyss. We tested the levels, then went in for a lunch of homemade ricotta and other homemade stuff, but mostly homemade ricotta. By the time we finished, the Ciliegiolo had started fermenting.The afterparty—and aftermath—of SelectioNaturel's portfolio tasting in Umbria.\nPhoto Courtesy of Marissa A. RossMarcucci continued to teach me. Before I left we tried wines of the masters who had influenced him. A 2004 “Jakot” revealed stories of how winemaker Stanko Radikon made Marcucci aspire to be a revolutionary. A 1986 Lino Maga Barbacarlo explained Marcucci’s quest to defend terroir. Back in Los Angeles, I’d send long emails about bottle aging and other geeky wine stuff I can’t believe I care about almost ten years after I first reviewed Two Buck Chuck on YouTube as a joke. In Paris after the spring wine fairs, we got into a screaming match about carbonic maceration over a 2005 Morgon. It didn’t matter if I was listening like an eager schoolgirl, conversing like a professional peer, or arguing like a Sicilian (as Marcucci says), he always respected me. He asked my opinion, listened in return, and let me fight him as passionately as he’d fight me.Alone on that patio in Abruzzo, I didn’t know what to do with Marcucci’s suggestion. Could I make my own wine? I shook away his compliments about how I had the taste and mind, but that’s why he had pulled up that seat for me. That’s why he had put that time into teaching me. He gave me confidence in a world that tried to strip it from me. And he’s Yoda/Batman.The next day we were at a Selectio Naturel tasting in Umbria, trying all my favorites—Rabasco! Furlani! And a new winery, Vini di Giovanni, with a wine called the “Ciliegiozzo Frizzante” Ciliegiolo. Its first fermentation was in an open vat for ten days before being aged in fiberglass. Its second fermentation started under a crescent moon and had been aging in bottle one month. There were only 650 bottles made. It was the color of ruby red grapefruit glistening in the sun. It smelled like roses that are barely peeling open, raspberry, and thyme and literally tickled your nose with the spice of pink peppercorns. It tasted like microbial fireworks of cranberry that pop as fast and steady as a racing heart near a crush, and that Umbrian dirt I cleaned from under my nails with my teeth.“It’s your wine!” Marcucci said, smiling. I rolled my eyes and laughed. I had picked some grapes, moved some crates, pulled some hoses. We both knew that was not winemaking; that was mostly me eating ricotta. I swallowed the lump in my throat. “But really, when can I come make wine?”“Whenever,” he said, as serious as ever. “You are very strong.”Marissa A. Ross is BA’s Unfiltered columnist and the author of Wine. All the Time.: The Casual Guide to Confident Drinking.Explore Bon AppétitWineItalyRead MorecultureHow to Get the Most Out of Your Somm ExperienceBy Marissa A. Rossculture5 Great Writing Wines, aka Wines to Drink on DeadlineBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Marissa A. Ross"]}