{"id": "985ada89a61f793ff90119923e89feaf", "url": "https://www.bonappetit.com/story/anxiety-symptoms", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "My Anxiety Symptoms Were Ruining My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleBefore I Could Get Over My Anxiety, I Had to Admit It Was RealThe tricks I’d developed to maintain my facade just weren’t cutting it anymore.By Kyle BeecheyJanuary 3, 2020FacebookTwitterEmailIllustration by Rachel JoFacebookTwitterEmail2019 was the year my anxiety got real. When I had to admit I wasn’t just anxious, like can’t-sleep-the-night-before-the-interview anxious, but that I had anxiety. The kind that might need a formal diagnosis. The kind that probably needed medication.I should have seen it coming. In 2019, I cycled through four or five different freelance jobs to support myself. I was working before work, going to work, and coming home to continue working. That’s when the panic attacks, bouts of mania, and depression took hold.I’ve struggled with anxiety in some form or another since I was a child. And a lot of it stems from the relationship I had with my father, who never seemed to think I was good enough. He was unmoved by my accomplishments and quick to criticize. If something was wrong, it was my fault: a crumb left on the counter, a scratch on the living room floor or a window left open during a storm. In elementary school, I played all the sports and joined all the clubs. In high school, I had a 4.0 every semester and was a social butterfly. I couldn’t get more perfect on paper. All I wanted was my father’s validation, but it never came.I decided, then internalized, that nothing would impress him. I believed his criticisms were true, and that I had failings, and that they were my fault. When I got into every college I applied to, I remember feeling proud of myself for the first time. My father showed no excitement. When I chose a prestigious school on the other side of the country, not the school he wanted for me, we had one of the biggest arguments of my life.There is a deep thread of mental illness in my family, both diagnosed and undiagnosed. Schizophrenia, Autism Spectrum Disorder, ADHD, and anger management issues all have branches on the Beechey-Grover family tree. We didn’t talk much about it at home; it was too painful to ask my mother to revisit her childhood. But I was a curious observer and recognized that, in my family, unlike other families I knew, the highs were high and the lows were low. I was also aware that I had escaped the diagnoses of some of my other family members, and that my insomnia, teeth grinding (the dentist said I had the teeth of a woman forty-years older), jaw-clenching, and hitting myself whenever I did something wrong were not “serious.” I thought that, since I didn’t exhibit signs of being on the autism spectrum and wasn’t affected by paranoid delusions, I was fine. I was just high-achieving. I just couldn’t allow myself to make mistakes.By my twenties, I had a well-developed roster of mostly healthy coping mechanisms I would turn to when it felt like the world was crashing in on me. On the cusp of a meltdown? Try running or swimming or yoga. Less obvious tools included grocery shopping, baking for no particular reason, socializing with “safe”people, having a dedicated sleep routine, and going to the movies alone.The clock moved from 3:00 a.m. to 5:00 a.m. as my thoughts spun out into self-doubt and panic.Then, in the fall of 2019, I had a streak of terrible professional luck. A few potential brand-consulting clients fell through, I lost a writing job. Several professional contacts stopped responding to my emails. Five or six leads for prospective jobs and sources of income suddenly turned to none. A series of great meetings led nowhere. Until one didn’t. My luck turned around, jobs flooded in, and with them my anxiety took on crippling intensity. I went from your run-of-the-mill, overworked, overcommitted, under-slept New Yorker to a crazed version of myself, complete with hyperventilating episodes, migraines, claustrophobia, insomnia, and mania.Slowly, my typical middle-of-the-night worry—obsessing over email responses and belated thank you notes—shifted to financial calculations that always found me just short of making rent. The clock moved from 3:00 a.m. to 5:00 a.m. as my thoughts spun out into self-doubt and panic. Instead of allowing myself to fall back to sleep, I’d get up, bleary-eyed, and get to work. I became a permanently on-edge zombie. My razor sharp focus was gone. I walked into rooms and immediately forgot why. I was scattered and irritable.One Sunday morning, I was feeling good for once. I was in the early stages of brainstorming a short film and I ran the concept by my boyfriend. What I wanted was affirmation, but what I got was feedback. It wasn’t original, he said. In fact, it was kind of boring. That was the end of our pleasant morning. I felt myself slipping, the room became a fun-house mirror, and I was suddenly losing it, crying and hitting myself. When my boyfriend tried to hug me, I pushed him away. The look on his face told me I was ruining our relationship. He’d witnessed too many of my episodes.I was still able to keep up appearances when I needed to—at work, friends’ birthday dinners, client meetings. But the facade crumbled when I was at home. There, even seemingly inconsequential obstacles and mishaps—the stove needing repair, misplacing my favorite workout leggings or losing my night guard—sent me into a screaming, crying tailspin. I hit myself hard enough to bruise. I dug my nails deep into my skin. I clenched my teeth so tight I got a migraine that lasted for days. I knew I shouldn’t have, but I also knew what I’d learned as a child, which was that it was all my fault and I’d never be good enough.One Tuesday afternoon, I found myself waiting to cross 2nd Avenue. I’d just gotten off a phone call during which I’d learned that a film project I’d been working on for four years was at another standstill. I’d devoted years of my life to making the film in the hopes that it would give me the career I’d always dreamed of. I watched as traffic sped by. “Why was I even bothering to wait for the light?” I asked myself. Getting hit by a car seemed easier than being told “no” again. And again and again.That was when I realized my mental health issues, whether diagnosable or not, were not something I could ignore any longer. I wasn’t hearing voices or losing my temper like others in my family, but my obsession with being perfect had taken over my life. I couldn’t feign normalcy any longer. I decided to channel all my stubbornness and perfectionism into making a real change.I started talking to my family and my boyfriend. Everyone showed up immediately with an outpouring of support: phone calls, text messages, hand-written notes. I was lucky to find myself with an amazing support system including, surprisingly, my father, who became a voice of encouragement. Forever a freelancer himself, he knew a lot about coping with the ebbs and flows of jobs.I’ve decided that 2020 is going to be my year of contentment.I began by making a few subtle adjustments to pull myself back to something like center. After overcoming my own resistance, I began a meditation practice. At Three Jewels, a little oasis of yoga and meditation in the city, I sit with a small group and together we focus on our breathing, and after a while, the 24 emails waiting in my inbox and the latest round of edits become less important.Those half-hour classes moved me to develop a gratitude practice—a way to celebrate the basic but miraculous facts of my life, things as obvious as the legs I walked into class on, which helped shift my focus off the crushing weight of my career goals and onto the tiny victories I had every day.I also discovered what everyone else already seemed to know, which is that CBD is an amazing anxiety aid. I take it as a tincture in the morning and evening. I make sure to always have a few gummies in my purse. It mellows that on-edge feeling that surfaces even after the best meditation sessions. And CBD has helped tremendously with my migraines and tension headaches so I can use less ibuprofen.The final new tool in my kit was a group class with a wellness coach, whose assignments include daily journaling. At the end of every day, I email her a log of the good, the bad, and the trivial, which over time has helped me chart patterns. And, knowing that someone else will be reading helps hold me accountable. (It’s honestly the most affordable therapy I’ve ever had.)They seem small, but these practices have magically added up. Now when my brain switches into panic mode, I name things I’m grateful for: my physical health, my mom, my great friends; my relationship with my family, even my dad, who I now count as an ally. The relationship I’ve held with my boyfriend for over 11 years. My apartment. I know that something as simple as talking to others can reflect for me how stupid lucky I am, and that I’m not alone. I can look to those around me who have lived through much worse for a reminder that if they did it, so can I.I’ve decided that 2020 is going to be my year of contentment. I’m going to try my best to cultivate happiness regardless of where I am professionally, and regardless of my anxiety, which isn’t going away, same as the panic attacks that may arrive even after a week of healthy, positive, life-affirming behavior.I wasn’t supposed to let it happen, but I had anxiety about writing this article about my anxiety. Self-observation is exhausting. This whole contentment thing is going to be very hard. I know I’m going to fail a lot. But now, more than ever, I believe in hard work and the importance of sharing my experience. Knowing we’re not alone is as helpful as everyone says it is. I’ll keep working at this anxious life.Explore Bon AppétitHealthyishessayRead MoreLifestyleHow I Conquer Existential Dread By Meal Planning for My FamilyBy Stephanie GanzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-03", "author": ["Condé Nast", "Kyle Beechey"]}