{"id": "985ea419940dfbe5a139721d849c3cc7", "url": "https://www.bonappetit.com/recipe/charred-broccoli-salad-with-figs", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Charred Broccoli Salad With Figs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueCharred Broccoli Salad With FigsBy Bacchanal WineSeptember 14, 20215.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintA high-speed blender will give you the smoothest consistency for the broccoli-tahini purée in this adaptation of the charred broccoli salad from Bacchanal Wine in New Orleans. You can also use a food processor; the finished purée will just have more texture. This recipe makes more purée than you need, but you can use the hummus-like condiment as a dip for warm pita or raw vegetables, or as a sandwich schmear.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonBlender$32 At AmazonTongs$13 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonIngredients4 Servings2lb. broccoli (about 3 medium heads), ends trimmed, stems peeled¼cup extra-virgin olive oilKosher salt, freshly ground pepper½cup labneh or whole-milk plain Greek yogurt2small garlic cloves, finely grated, divided½cup coarsely chopped dried figs (such as Turkish or Mission)Zest of ½ lemon3Tbsp. fresh lemon juice, divided1cup tahiniSmall handful of mixed tender herbs (such as mint, tarragon, and/or parsley), leaves torn if largeSumac (for serving)PreparationStep 1Prepare a grill for high heat. Cut broccoli lengthwise into ¼\"-thick planks (try to keep crown and stem attached). Toss broccoli planks with oil in a large bowl to coat; season with salt and pepper. Grill, turning occasionally, until charred all over (they’ll look burnt, and that’s a good thing) but stems are still crisp-tender, about 5 minutes; reserve bowl. (Or you can broil broccoli in a single layer on a rimmed baking sheet, undisturbed, until well-charred on 1 side, 14–16 minutes.) Transfer broccoli back to reserved bowl and cover tightly and let sit 30 minutes to steam.Step 2Meanwhile, whisk labneh, half of garlic, and 2 Tbsp. water in a small bowl until smooth and the consistency of ranch dressing (add more water if needed). Season dressing with salt and pepper.Step 3Cut broccoli into bite-size pieces (about 3\"), separating florets from stems as you go. Coarsely chop stems and measure out 1 cup; set aside. Return remaining broccoli to bowl; add figs and 1 Tbsp. lemon juice. Toss to combine; season with salt and pepper. Set aside.Step 4Blend tahini, reserved broccoli stems, remaining garlic, remaining 2 Tbsp. lemon juice, and ½ cup water in a high-speed blender until very smooth and the consistency of a loose hummus. Season purée with salt and pepper.Step 5Spread ½ cup purée on a platter. Top with reserved broccoli salad and spoon dressing over (you won’t need all of it). Scatter herbs, sumac, and lemon zest over.Do ahead: Dressing can be made 3 days ahead. Cover and chill.How would you rate Charred Broccoli Salad With Figs?Leave a ReviewTell us what you thinkExplore Bon AppétitBroccoliVegetableSaladFigFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Bacchanal Wine"]}