{"id": "9863ffb38b7098bbab7fc50bff94d02d", "url": "https://www.bonappetit.com/story/the-tech-bros-are-hungry", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "The Tech Bros Are Hungry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Tech Bros Are HungrySilicon Valley diet culture and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroApril 25, 2019FacebookTwitterEmailPhoto by Alex Lau, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This story about tech moguls acting like stoic monks has been on my mind since I read it last week. It’s about how The Real Tech Bros of Silicon Valley are starving themselves, taking cold baths, and not wearing coats in the winter. I know, I know, tech bros do the darndest things (see: \"foiling\", microdosing, bread). But I find this form of masochism to be particularly fascinating—and particularly messed up. As Ruth Margolis points out, your garden-variety, six-figure-earning, Soylent-drinking tech drone may dabble in intermittent fasting, but it’s the super-rich, billionaire-plus club that’s adopted the hardcore forms of self-denial, like subsisting for more than a week on nothing but water, coffee, and tea. (Real question though: Are their personal chefs all out of jobs?) Margolis calls it “a sort of reverse elitism,” a way for stratospherically wealthy people to show off their supposed normalcy. But, uh, when was the last time you fasted on days that started with the letter “S,” like Twitter founder Jack Dorsey? I think these punishing habits are less about being just like us and more about expunging massive guilt via bizarre forms of self-flagellation. Whether they realize it or not, these men (yes, they're all men) feel guilty about how they got their money and at whose expense.But also...it’s an eating disorder! As a society, we’ve gotten better at calling bullshit on diet culture. Women’s magazines are no longer solely dedicated to weight-loss tips (and how to please your man). The media has gotten more careful about not glorifying rail-thin celebrities. Even Gwyneth Paltrow’s wildly successful wellness empire has gotten plenty of flack for being a diet company in disguise.\nBut when boy billionaires start proselytizing about week-long fasts and punishing exercise routines, it’s not a diet or a disorder; it’s a biohack. It's the new frontier of science! As Monica Hesse sums it up in the Washington Post: “It’s both remarkable and depressing to watch Jack Dorsey blithely describe a diet that would put any woman—or any non-wealthy man—into the penalty box of public opinion.”Kinda reminds you of when male politicians talk about parenthood, amirite?Anyway, if the billionaires leading us into the techno-future tried to be more like people—living, eating, eventually dying—instead of robot gods, I think we’d all be in a better place.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleLunch is the New DinnerBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Amanda Shapiro"]}