{"id": "98710f70001c6920e3ff2b8cd8c75274", "url": "https://www.bonappetit.com/story/catalan-escalivada", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "When I Go Nuts at the Farmers Market, I Make Catalàn Escalivada | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Go Nuts at the Farmers Market, I Make Catalàn EscalivadaIt’s my simple solve when summer eggplants, peppers, and onions start piling up.By Heather EddyAugust 18, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Kat BoystovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My husband rolls his eyes and groans. A pyramid of peppers and several squat, shiny eggplants cover our one small patch of countertop. Two heaving totes sit on the floor, one full of squash, the other tomatoes. “You know this is my crazy time of year!” I reply, throwing my hands up in defense. The late summer farmers market. I can’t help myself.I know I’m not alone in my feverish acquisition of produce when the season starts to wane. The key to avoiding overwhelm is quickly turning your haul into simple dishes that are not only delicious, but also take up less fridge space. And where better to turn for inspo than to Mediterranean kitchens, which are long on bounty but historically short on cold storage? You already know ratatouille, the French classic, but now I’d like to introduce you to its Catalàn cousin: escalivada.My first taste of this silken mélange of peppers, eggplant, and onion came during a tapas-and-Txakoli binge in Boston’s South End, years before I ever set foot on the Costa Brava. At their enduring hotspot, Toro, chefs Ken Oringer and Jamie Bissonnette make a meaty version with smoked eggplant, a take on the tradition of roasting the vegetables directly in the coals.Escalivada is a non-recipe recipe: whole sweet peppers, small eggplants, and thickly sliced rings of sweet onion are slicked with olive oil, seasoned with salt and pepper, and slow-roasted until soft and yielding, then splashed with more olive oil and glugs of nutty sherry vinegar. The beauty here is that the quantities are flexible, and you can adjust how much of each vegetable to use based on whatever it is you need to use up.If the grill’s fired up, you can roast the veggies whole over the flames, turning to cook and char evenly until everything is softened. Or, you could wrap them individually in foil and roast directly in the embers, piling coals on top. For the apartment-bound, two hours on a sheet pan in a 375℉ oven does the trick, though maybe you’ll want to wait for a cooler, rainier day. Regardless of how you cook the veggies, once they’re cool enough to handle, remove the skins and seeds from the peppers and tear or slice the flesh into rough pieces. Peel the skin off the eggplant as well and slice it into long strips. You can arrange the peppers, eggplant, and rings of onion prettily on a platter and dress with olive oil, sherry vinegar, and more salt and pepper, or just toss it all together gently in a bowl with all the seasonings—it’s a beautiful mess either way.Versions of this dish exist in so many places, and they shape-shift depending on the local flavors. In southern France, ratatouille is seasoned with rosemary, thyme, and oregano, the resinous herbes de Provence dotting its scrubby landscape. In Greece, the same ingredients might be dressed with lemon and brightened with fresh, fragrant dill. You can really go your own way with this dish.Serve escalivada at room temp alongside a grilled rib eye or swordfish steak. Have some for a snack-dinner with crusty bread, cheese, and olives. Or do as I do, spooning scoops straight from the fridge (where flavors intensify overnight), whether I’m lazing and grazing around a holiday rental or sweating it out in the city. It’s the epitome of relaxed vibes. So next time you lose it at the farmers market, no worries: Let escalivada help you keep calm and veggie on.Explore Bon AppétitcookingIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-18", "author": ["Condé Nast", "Heather Eddy"]}