{"id": "98723e83910e1991aa3f519bedf600ab", "url": "https://www.bonappetit.com/story/paul-w-downs-bread-rant", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Paul W. Downs Is Totally Obsessed With Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Don’t Care What You Say, Bread Is The Most Important Part of a Meal‘Broad City’ comedian Paul W. Downs rants about his totally sane obsession.By Paul W. DownsFebruary 7, 2019FacebookTwitterEmailPhoto by Tibrina HobsonFacebookTwitterEmailThere’s nothing I love more than bread. Well, okay, money. But as far as food goes, it’s bread. Warm, crispy, bread. Also room-temp bread. I’ll even take day-old toast.Now I know what you’re thinking. “Paul W. Downs is a known sex symbol, an icon of physical fitness. His body is his instrument and it is so finely tuned. How could he love bread so much and keep it so tight?? Bread is carbs and carbs are the enemy!” Thank you. But bread is not the enemy to me.You see, my love of bread started early. My parents are both great cooks, but when was a kid my dad upped the ante and started making incredible Italian rustic loaves at home. We didn’t have a steam injection oven, so he would throw a cup of water into a hot oven before putting the loaves in to bake. I think it may have contributed to the machine’s early demise. But it was worth it. I grew up in a rural part of northwestern New Jersey and one year my father entered his bread in the Sussex County Farm and Horse show. (See, very rural). He won a blue ribbon for Best Bread. But then his bread also took home Best In Show…for all the baked goods. So yeah, my dad can beat your dad in a rural farm and horse show bake off.My sister Emily got the bread bug worse than I did. After working alongside Jim Lahey at Sullivan Street Bakery and as a pizzaiola at Keste in New York, she now makes bread for local restaurants and markets, and sells pizza out of a mobile wood-fired oven in Warwick, New York. If I wasn’t spoiled before, now I am. For life.You get it. I know bread and I love it. Many times I’ve asked for another serving of bread and finished a whole basket without even touching my main course. I’ll happily take my uneaten duck breast or lobster tail to go. “Can you wrap this up for me so I can throw it away in a week or so?” I’ll ask my server.So here’s the thing: RESTAURANTS WITH BAD BREAD SHOULD BE CLOSED DOWN. Don’t bother being in the food service industry if you’re not going to pay attention to the most important part of the meal!Now, before I get to more (totally rational) ranting, I know not every kind of restaurant has bread. I’m not an idiot! But if you’re a place that serves any kind of bread—I’m talking naan, I’m talking pita, I’m talking baguette, I’m talking a freakin’ dinner roll—you better make that ish good! It’s not rocket science.I think a restaurant’s rating should be completely determined by their bread. First impressions are important and bread is the first thing you get. If you’re like me, you have to tear into that bread immediately and order with a full mouth. If that first bite is bad, it sets a tone for the rest of the meal. If it’s warm and dense, with a crisp crust, I might demand a basic Italian joint be given a Michelin Star. On the other hand, if a “fine-dining” “hot spot” has bread that’s dry or stale or clearly frozen and reheated, you truly might as well close up shop, because I’m gonna talk so much shit that it’s gonna happen eventually anyway. And don’t try to disguise it with fancy add-ons. No olive or fennel pollen is going to make bad bread good.So if the restaurant industry is reading this and ready to change, to finally put some love and attention into freshly made breads, they might feel they need to be compensated. Some restaurants already do: They charge for bread. And guess what? I think this is totally fair. Some people are outraged. Well chill, people. You don’t think the best part of the meal is worth $4? Well, it is. When it’s incredible.Take Cooks County in L.A. (RIP). My girlfriend and I loved the $4 cast-iron bread so much that we would order three (yes, three) servings as soon as we sat down. Quantities were limited and they sometimes ran out, so we ordered early so we could have some to start, some to sop up our mains, and extra to take home. We were so notorious for hoarding the goods that they changed the restaurants policy: No orders of bread to go. Good thing they never checked my pockets.Actor, writer, and producer Paul W. Downs stars as Trey Pucker on Comedy Central’s ‘Broad City,’ currently airing its fifth and final season.Explore Bon AppétitBreadRantsPop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-07", "author": ["Condé Nast", "Paul W. Downs"]}