{"id": "98735ee5ae71471c505c886eb3d74886", "url": "https://www.bonappetit.com/recipe/salt-and-pepper-cauliflower", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Salt-and-Pepper Cauliflower Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueSalt-and-Pepper CauliflowerBy Justin LeeApril 20, 20214.5(38)Read ReviewsTriangleEmailPinterestPrintPhotograph by Frank Frances, food styling by Lillian Chou, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintThis crispy salt-and-pepper cauliflower from Fat Choy chef and owner Justin Lee sidesteps the fuss of frying your florets without compromising on crunchiness. (Who really wants to deep-fry at home anyways?) Leave the hassle to the restaurants and instead just roast them in the oven until deeply browned. Click this way for more of our favorite cauliflower recipes.Ingredients4 Servings1tsp. freshly ground black pepper½cup plus 3 Tbsp. vegetable oil, divided1large head of cauliflower, cut into 1\"–2\" floretsKosher salt3medium shallots, thinly sliced12oz. silken tofu2Tbsp. white miso5garlic cloves, finely chopped2medium jalapeños, halved, seeds removed, finely chopped3Tbsp. fresh lemon juiceCilantro leaves with tender stems and steamed rice (for serving)PreparationStep 1Place a rack in lowest position of oven; preheat to 450°. Whisk pepper and ¼ cup oil in a large bowl to combine. Add cauliflower, season with salt, and toss to coat. Spread out cauliflower in a single layer on a rimmed baking sheet and roast until dark brown and crisp underneath, 15–20 minutes. Remove from oven and turn cauliflower over. Roast until second side is dark brown and crisp, 10–15 minutes.Step 2Meanwhile, heat ¼ cup oil in a medium skillet over medium. Cook shallots, stirring occasionally, until deeply golden brown and beginning to crisp, 6–8 minutes. Transfer shallots to a blender, add tofu and miso, and purée until smooth. Transfer tofu sauce to a small saucepan and set aside. Wipe out skillet.Step 3Pour remaining 3 Tbsp. oil into same skillet and add garlic and jalapeños. Cook over medium heat, stirring occasionally, until garlic is golden and crisp and jalapeños darken slightly, about 4 minutes. Strain through a fine-mesh sieve set over a small bowl. Season garlic and jalapeños with salt; set aside. Let oil cool and set aside for another use.Step 4Place saucepan with tofu sauce over medium-low heat and cook until warmed through. Once you see a bubble or two, remove from heat and stir in lemon juice; season with salt.Step 5Spoon tofu sauce on a platter and top with roasted cauliflower; scatter cilantro and reserved crispy garlic and jalapeño over. Serve with rice alongside.How would you rate Salt-and-Pepper Cauliflower?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleVery good. It's the best way to eat tofu. My husband really like it too. This would also be good with other vegetables like cabbage, eggplant, or green beans. NesraJaneWyoming8/20/2021Delicious! For the sauce: instead of putting it back in the skillet at the end, you can microwave it in the bowl you’re serving in. No need to make that mess. The leftover sauce is basically a delicious vegan French onion dip for chips or veggies ShelbyWyoming5/28/2021I have made a few of  Fat Choy's recipes and they are delicious!   There is absolutely no reason not to be Vegan.  Thanks for sharing these awesome dishes  with the general public. SandyN.Y.  5/27/2021SO delicious! Definitely could add another half to whole head of cauliflower. Will definitely be keeping this recipe in regular rotation!MeeshSan Mateo, CA5/24/2021This was really good. Had to sub thinly sliced onion for shallot and it worked well. One step missing from the method (IMO) is to transfer shallot and oil to the blender, not just the shallot. Feel like you could get away with 2 heads of cauli. 450 convection total oven time for me was closer to 15 min total. Next time would blend some herb directly into the miso sauce. Also had way more sauce then cauliflower, so used the left over oil from the garlic and jalapeños, added a bunch of lemon juice and more cilantro and turned it into a v good vinaigrette. BenChicago5/11/2021I loved the general vision of this recipe, but the miso sauce was too bland so I added rice vinegar, lime juice, fish sauce, soy sauce, and chili paste, which together seemed to improve it quite a bit. I also love crisped shallots and didn't want to waste the texture by blending it in with the miso sauce, so I crisped the shallots with garlic and jalapenos for the topping, which was excellent. AnonymousOregon5/10/2021Outrageously delicious. Made the dish exactly as written and would not change a thing. It's a keeper!RickSan Francisco, CA5/10/2021This was delicious ShellyBrooklyn 4/29/2021Explore Bon AppétitChineseEast AsianAsianCauliflowerVegetableTofuOther IngredientsMisoCondiments, Sauces & PastesWeeknight MealsEasySideDairy-FreeNut-FreeVegetarianVeganHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Justin Lee"]}