{"id": "98753ba79e3dc6b37d12033adc7b6055", "url": "https://www.bonappetit.com/story/mini-whisk", "year": 2019.0, "month": 8.0, "day": 5.0, "content": "A Mini Whisk is Better Than a Giant One—Prove Me Wrong | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Mini Whisk is Better Than a Giant One—Prove Me WrongWhisky business.By Sarah JampelAugust 29, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI admit that I am drawn to small kitchen equipment—mini offset spatulas, mini Silicone spatulas, mini food processors, mini prep bowls—for their size alone. So cute! So collectable! So easy to lose to the chaos of my kitchen!But the mini whisk—the MVP in the roster of my shrunken tools—is not just adorable: It’s also one of the most reached-for utensils in my kitchen. It can do everything a big whisk can do—and then some.I should first clarify: I’m not talking about those microscopic baby whisks that you received as part of a hot cocoa gift set. (Who am I, the Tiny Chef?) I’m referring instead to a whisk I’d actually dub “petite”—it’s right below medium-sized (mine is 9 inches top to bottom), with a slender handle that’s comfortable to grip and tines that are long enough to be effective and spaced-out enough to not get gunked up with batter or bits.She's beauty and she's grace.\nPhoto by Chelsie CraigThe reason I’m always reaching for my petite whisk is because I’m usually whisking small quantities: a cup of flour with some baking soda and salt to go into a cake; mayo, rice vinegar, and gochujang to make a dipping sauce; olive oil and vinegar for a vinaigrette; chopped chocolate with warm cream for ganache; ¼ cup of heavy cream to top my personal post-dinner ice cream scoop (I realize this sounds crazy); a couple eggs for breakfast. And I’m normally doing these small jobs in small bowls (or, more likely, pint containers) in order to reduce the surface area of the stuff that’ll need washing.Using a large whisk in a small bowl is like squeezing your legs into just-washed jeans: Fits, yes, but without any wiggle room. The little whisk, on the other hand, fits comfortably in all of my vessels—even my mugs and my itsy butter warmer—with enough breathing room to still do its job and get in all the edges and crevices. There’s no risk of cream splatters or flour showers, and by the very nature of its shape, it’s more effective at aerating and homogenizing than the fork you’ve been resorting to.Sure, a big whisk comes in handy if one needs to whisk four dozen eggs for brunch at the family reunion, but mine is allocated to the closet: The only time I’d ever drag it out is if a) I had to play a spur-of-the-moment T-ball came and needed a bat, or b) the power went out and I, for some reason, had to whip large quantities of cream or egg whites by hand.Otherwise, the mini whisk can do what the big whisk can—scramble a reasonable number of eggs for a frittata, make a smooooth pudding, even assist you with a giant pancake—but it’s less unwieldy. How’s that for small but mighty?Buy it: Norpro 9-inch Stainless Steel Whisk, $14 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Sarah Jampel"]}