{"id": "9879c2d44e4595259dcf3c3433f5b45d", "url": "https://www.bonappetit.com/story/dinner-party-playlists", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "6 Perfect Dinner Party Playlists So You Don't Have to Think About It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Made You 6 Perfect Dinner Party Playlists, You’re WelcomeBecause you’ve got cooking to do.By The Bon Appétit StaffOctober 14, 2021FacebookTwitterEmailIllustration by Brittany Holloway-BrownFacebookTwitterEmailThis story is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.At dinner parties, getting the mood right is just as crucial as getting the food right. That’s where music comes in. Sure, you could eat in complete silence if you want to depress your guests. Or you can curate some tunes to get the party going in a way that’s so memorable that guests come up to you with the ultimate ego-stroking question for any DJ: Can you send me your playlist?Are you hosting a cozy gathering with close friends? A giant feast with dozens of people and plus-ones? We’ve sifted through our Spotify accounts to find the perfect party playlist for your needs. These are playlists that we’ve used at our own dinner parties, so they’ve already been guest-tested and approved.For the Pajama Party PotluckContentThis content can also be viewed on the site it originates from.“As a Taurus, I was literally born to curate comfy vibes for an evening at home with good friends and even better food. I first made this playlist for a holiday pajama party potluck I hosted where guests were encouraged to BYOB (bring your own blanket). It’s an eclectic mix of chilled-out tunes that pairs well with a hearty pot roast, some boozy eggnog, and a warm slice of pound cake. If you’re the eccentric kind of host who puts out a face mask bar and likes the playlist jumping from Erykah Badu to Modest Mouse to Shaggy, we’re birds of a feather.” —Chala Tyson Tshitundu, assistant editorFor the After-PartyContentThis content can also be viewed on the site it originates from.“Hosting a dinner party in the evening and a party party later that night? This playlist, heavy with R&B and hip-hop, seamlessly transitions from a slow, “gooey” vibe to an upbeat, bouncy energy. It’s engineered to make you shovel those last bites of dessert, get up, and dance. I started this party playlist right around the same time I moved into a new apartment in New York with six other strangers, and I fell into their weekly roommates dinner party tradition during quarantine that brought us all closer together. One day they designated me to curate music that would help us forget about that food coma, and we’ve been using this one ever since.” —Julia Duarte, art assistantFor the Not-Christmas FestivitiesContentThis content can also be viewed on the site it originates from.“Christmas isn’t really my holiday—I’m not religious, and I’m lukewarm on capitalism. But I do love the trappings of Christmas. The scent of pine. Hot buttered rum. Cozy dinner parties that end around a roaring fire. And during these dinner parties, I want to be listening to songs that sound like Christmas but aren’t literal Christmas songs. Don’t know what I mean? “Everyday” by Buddy Holly is a classic piece of non-Christmas Christmas music. Ditto Kate Bush’s “Army Dreamers,” Cocteau Twins’ “Lorelei,” or any song ever from an Icelandic musician. Cue up my playlist “A Very Secular Xmas” (shout out to my collaborators Emily and Liz!) and get in the holiday late-December spirit.” –MacKenzie Chung Fegan, senior commerce editorFor the ~Cultured~ Cocktail HourContentThis content can also be viewed on the site it originates from.“My college roommate was an editor for our campus music magazine—so I was usually the one handling playlist curation. His taste leaned a bit too specific, with every band’s introduction requiring a mini lecture on what actually constitutes Midwestern emo or where the always-shifting border of hyperpop currently rests—a one-sided chat you can only have so many times. In this playlist, I attempt to soothe the snobs with cuts from the Talking Heads and William Onyeabor (influential, but not way too obscure) while sprinkling in some indie faves like Haim and Japanese Breakfast that anyone would be hard-pressed to roll their eyes at, keeping vibes upbeat, synthy, and fun. Feel free to dip once 100 gecs comes on; the conversation’s only going downhill from there.” —Nico Avalle, digital production assistantFor Dining Alfresco in the Balmy Breeze (or Imagining It)ContentThis content can also be viewed on the site it originates from.“Hollywood and Instagram and a billion cookbooks (and my own stomach) have successfully convinced me that Southern Italy is a promised land when it comes to long, gorgeous dinners that are sumptuous in both look and taste. Since I can’t jet off to the Gulf of Salerno at the moment, I’ve brought its summery vibes to my own apartment. Listen to this highly specific playlist, full of vintage bops by Italian singers, to evoke a meal out on a bougainvillea-covered balcony in a little town overlooking the Tyrrhenian Sea. You’re pouring glasses of limoncello for the table. George Clooney is one of your guests. You’re very rich!” —Karen Yuan, lifestyle editorFor Date NightContentThis content can also be viewed on the site it originates from.“A wedding reception is...basically a giant dinner party, right? I spent hours sifting through the tunes of mine and my husband’s many lifetimes in order to curate a playlist that evokes an airy romanticism studded with nostalgic gems. And I think I succeeded. This playlist is an audio-timeline of every little love story in our lives. I handpicked songs that symbolize moments we’ve shared not only with each other, but also the love and memories we share with our guests. I have to say, I did shed a tear as I watched my closest friends and family sway and sing along to these beloved melodies while they went in on plates of tandoori chicken.” —Mehreen Karim, recipe production assistantExplore Bon AppétitCulturePartiesLifestyleDinner PartiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "The Bon Appétit Staff"]}