{"id": "98ad2e1aae91b54706eb206bf68ea002", "url": "https://www.bonappetit.com/story/last-minute-gifts-good-cause", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "6 Last-Minute Gifts That Go to a Good Cause | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle6 Last-Minute Gifts That Go to a Good CauseForget rush shipping and donate to one of these excellent organizations.By The Healthyish TeamDecember 24, 2019FacebookTwitterEmailIllustration by Fran CaballeroFacebookTwitterEmailLast-minute gift-givers, listen up: Even the speediest shipping can't teleport indestructible bamboo plates or design-y French presses to your doorstep in time for morning. But there will always be time to dedicate a charitable donation on behalf of someone you love. So for our last gift recommendation of the season, we asked a few of our friends to recommend the organizations closest to their hearts.Generation Hope“When I was in college, one of my mentors shared how she got pregnant when she was an undergraduate, and that it would have been nearly impossible to stay in school if not for the support she received from Generation Hope. Ten years later, when I was a mentor for a youth poetry group, one of my teens told me she was pregnant. It was the summer before her junior year. I did not know how best to help her, but I remembered the group my mentor had mentioned and put Cici in touch. Generation Hope was also pivotal in helping my kiddo attend college. She graduated last spring with honors.” –Elizabeth Acevedo, author of The Poet X and With the Fire on HighThe National Bail Out“The National Bail Out is an organization bailing black mothers out of jail for low level crimes. We don't take time to acknowledge that the black community is largely a matriarchal community. When mothers are in jail, families are destroyed, meaning communities are destroyed. National Bail  Out does  incredible work, and you know your money is making an impact.” –Maya Shaw, owner of Shaw. lifestyle shopNational Domestic Violence Hotline“I'm a domestic violence survivor, and the National Domestic Violence Hotline is the only national hotline dedicated to providing lifesaving information and resources to victims and survivors. One in three people identifying as women will experience intimate partner violence in their lifetime, but government funding for hotlines and shelters that assist victims and survivors is virtually nonexistent, and our legal systems are not set up to support and protect victims. The NDVH does incredibly important work to help victims escape their abusers when there's nowhere else to turn.” –Lauren Friel, owner of Rebel Rebel wine bar in BostonDoctors Without Borders“Doctors Without Borders does life-saving work delivering free medical care to vulnerable people around the world. They have a particular focus on conflict zones and crisis situations. I saw the impact of their work with refugees first-hand when I visited the island of Lesvos in Greece, where they have been running missions rescuing refugees and migrants from drowning in the Mediterranean sea and supporting refugees in camps. They are independent and impartial, but aren't afraid to speak out when they witness human rights violations, giving them a unique voice in the international arena. All in all, great work!” –Yasmin Khan, author of ZaitounNew York Sun Works“New York Sun Works is a non-profit organization building innovative science labs in urban schools throughout the city. They have a phenomenal Greenhouse Project Initiative that spotlights hydroponic farming technology to educate students and teachers about the science of sustainability. We partnered with NY Sun Works to help create our public art installation, a living, growing rice paddy, on South Oculus Plaza at the World Trade Center in Manhattan earlier this year. It was an incredible, collaborative experience and this organization is doing such important work to further sustainability in schools.” –Danielle Chang, founder and CEO of LUCKYRICEThe AtticStarted in 1993, The Attic is a safe space that creates opportunities for local LGBTQIA youth to grow into their own and find their voice. As someone whose brand is centered on community, the idea of safe and inclusive spaces is always on my mind. I also love that the Attic works to reduce the stigma around being LGBTQIA through diverse programming and partnerships around Philly. –Shannon Maldonado, owner of Yowie boutique in PhiladelphiaExplore Bon AppétitHealthyishGift GuidesShoppingRead MoreLifestyleThe Healthyish Gift Guide for People With Impeccable TasteGallery16 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-24", "author": ["Condé Nast", "The Healthyish Team"]}