{"id": "98b8d41da4a3befd939621ba2f168c54", "url": "https://www.bonappetit.com/story/brown-butter-glaze", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "This Brown Butter Glaze Tastes Like Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIt May Be Mid-Winter (Oof), but This Brown Butter Glaze Tastes Like SpringCover your pound cakes, your waffles, your oatmeal, your fruit!By Antara SinhaJanuary 7, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Pearl JonesFacebookTwitterEmailWhat's better than a good recipe? When something’s so easy you don't need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, brown butter glaze.As much as I love all of the warming, toasty, cozy flavors of the holiday season, on this side of the New Year I’m ready for a refresh when it comes to dessert—there’s only so much cinnamon and pumpkin spice a person can take. The antidote to cold weather-induced fatigue: a brown butter glaze that tastes like just a little tease of warmer, brighter days ahead. With a nutty, rich base offset by floral, fruity St-Germain and plenty of lemon juice, it smells like springtime and is the everything-syrup you’ll want to douse all your desserts in.It’s delicious as a glaze for pound cake, as in Danielle Bell’s Lemon-Elderflower Pound Cake, but with its tangy sweetness, it’s versatile enough for just about anything: Spoon it over waffles or pancakes, stir it into your oatmeal, shake it into a spritz, dunk fresh fruit into it, or fold it into homemade whipped cream. My favorite application has been drizzling it over vanilla ice cream as a sundae topping.If you’re as ready for a return to floral, fruity, bright desserts as I am, here’s how to make this easy, speedy brown butter glaze, which comes together in a few minutes with one saucepan and one whisk. Cook 4 Tbsp. unsalted butter in a small saucepan over medium-low heat, swirling often, until the butter foams, browns, and has a pleasant nutty smell. (Take care not to burn it at this step!) Then add 6 Tbsp. sugar and cook, whisking constantly, until the sugar dissolves. Whisk in ⅓ cup fresh lemon juice and a pinch of kosher salt and cook until the mixture reduces slightly, about 5 minutes, and then add 2 Tbsp. St-Germain and ½ tsp. vanilla extract and cook until syrupy, about 2 minutes.That's it! You've got a tangy-rich sauce that's ready to pour over any and all desserts that need a floral, fragrant, sweet oomph. It's almost enough to make you forget we've got several months of winter still to come.Get the recipeLemon-Elderflower Pound CakeRoasting strawberries is a great way to get that Valentine’s Day staple on your dessert menu, even with out-of-season berries.View RecipeExplore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-07", "author": ["Condé Nast", "Antara Sinha"]}