{"id": "98c02cba3e44fe12b002d546f6965835", "url": "https://www.bonappetit.com/story/halloween-candy-feud", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Almond Joy or Almond Despair? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAlmond Joy or Almond Despair?Senior staff writer Alex Beggs goes into the yearly Halloween candy debate, green bean casserole, and her new favorite food TV show.By Alex BeggsOctober 27, 2018FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Alex LauA moment of silenceRest in peace, dear Dorcas Reilly, inventor of the green bean casserole. Let’s toast a can of cream of mushroom soup in honor of the woman whose vision not only saw how a soup could bind a pot of green beans, but topped the whole thing with crunchy fried onions. Reilly worked in the Campbell’s test kitchen and loved cooking so much that after a full day of developing recipes, she’d go home and cook some more—a lot of soup, according to her husband. While our recipe gets a little bougie with homemade mushroom béchamel, the French’s fried onions on top stay true to the 1955 original. According to Campbell’s, over 20 million homes will serve green bean casserole on Thanksgiving, which is an incredible culinary legacy to leave, if you ask me.Want this letter before it hits the website? Sign up for our newsletter!BooSevered plastic arms hung from the ceiling of Hunter House Hamburgers in Birmingham, Michigan, where I recently stopped in with my family for an early dinner of slider-sized cheeseburgers, root beer floats made with 6 inches of soft serve afloat a cup of Barq’s, tots, and very salty fries. Meaning perfectly salted. A zombie slouched over the ATM. On our drive home, we passed a house with a skeleton family arranged in a barbecue scene, with a plastic baby on a Weber grill, and my appreciation for Halloween decor has never been surpassed. Suddenly I’m craving some popcorn balls.Courtesy of NetflixSpeaking of spookyI’ve been watching The Curious Creations of Christine McConnell on Netflix, a freaky scripted cooking show about a woman who sculpts edible art and her motley crew of misfit muppet housemates. At first I thought all of the Sudafed/NyQuil I’ve been taking was to blame for how weird the show was, and then I realized nope, it’s just a very weird show. I love every minute. The pastel, vintage Pyrex-stocked kitchen and McConnell’s spotless wardrobe contrast against the hairy, bloodthirsty, but lovable creatures who live with her, my favorite being the chocoholic raccoon with a fork for a paw. Yep. I’m entranced by her sculptural skills, the hours and adept (human) hand it takes to make a realistic Ouija board cookie out of shortbread and molten hot isomalt (to make the hardened, polished finish), airbrushed to resemble antique mahogany. She deep-fries werewolf paw doughnuts in a smoking cauldron on her stovetop. McConnell’s character is like Stepford Wives meets Witches of Eastwick, soft-spoken with a hint of evil, something to aspire to, really.Alex LauBread of the deadRick Martinez’s sweet and fragrant pan de muertos—Mexican Day of the Dead bread—is a lot easier than McConnell’s ouija board, if you’re looking for a sweet to get in touch with your ancestors. It’s a tender, eggy dough spiced with anise, orange blossom water, and rich with a stick and a half of butter.Food meme of the weekI’m chaotic neutral.Photo by Chelsie Craig, Food Styling by Kate BuckensMeat me upI need this meaty kielbasa stew like a roaring fireplace and flannel underwear. All. Winter. Long. Serves 14. 😮Unnecessary food feud of the weekThere are some candies you only see around Halloween. People have strong feelings about these candies. Poor snaggle-toothed candy corn, it never stood a chance for year-round glory! Who the hell is Mr. Goodbar? Why are Almond Joys so good? “@abeggs obviously you’re out of touch with America,” said Carla Lalli Music. “Never heard of a SNICKERS???” Touché. “How can you sit here and disrespect Reese’s like this?” replied Aliza Abarbanel. “Milk duds = the duds,” womp-womped Sarah Jampel, respecter of molars. “Mounds are so much better than Almond Joy what the heck @abeggs,” Kate Fenoglio piled on. “Halloween is the one time of the year I eat a Butterfinger,” Sasha Levine typed through slippery fingers. “I want to know the psychopaths who walk among us who call them ‘Reesie’s Piecies’’ Christina Chaey whispered. “I once made Halloween decor of Reese Witherspoon and Reese’s products,” Alyse Whitney shared. And with that image in mind, I’ll quietly step out now.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-27", "author": ["Condé Nast", "Alex Beggs"]}