{"id": "98c424b993ab5d89943534cae748ea42", "url": "https://www.bonappetit.com/story/gangstas-to-growers", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Gangstas to Growers Knows How to Change the World, One Ridiculously Tasty Bottle of Hot Sauce at a Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGangstas to Growers Is Changing the World, One Tasty Bottle of Hot Sauce at a TimeThe Atlanta-based company makes tropical, pungent hot sauce that aims to reduce recidivism in formerly incarcerated youth.By Hilary CadiganOctober 12, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIt started, as many great things do, with a hint of desperation. Abiodun Henderson had agreed to make sauce for a dinner benefiting her Atlanta-based social enterprise, The Come Up Project, and the day of the dinner had arrived, sauce-less.“It was last minute,” Henderson recalls, laughing. “I went to Dekalb Farmers Market and just picked up a whole bunch of random seasonings: lavender, turmeric, muscovado sugar. I had never even heard of muscovado sugar.”Though she’d worked in restaurants for well over a decade, Henderson’s jobs had always been front of house, not in the kitchen. But she did some internet research and worked off a few recipes she found on YouTube. Riffing with the more unexpected ingredients, she added plenty of habanero and cayenne peppers for heat, rounded it all out with a reliable base of onions, garlic, and apple cider vinegar. The result? A fragrant, fiery blend the color of Georgia clay that somehow tastes great on everything.“It’s a super blast of tropical, pungent heat, but it finishes very clean and a touch sweet,” says our highly discerning (read: very picky) senior food editor, Chris Morocco, noting how subtle hints of lavender back up the intense heat of the habanero. “Honestly, you could just literally spoon it into your mouth.”Gangstas to Growers' Sweet Sol hot sauce.\nPhoto by Emma FishmanA few weeks after the charity dinner, Henderson and her team were brainstorming ways to help fund the Come Up Project’s core program, Gangstas to Growers, which seeks to reduce recidivism in formerly incarcerated youth (statistically, more than 50 percent of young people end up back in the system within three years of release) by teaching them an array of important life skills. The program’s approach is holistic, but much of the work revolves around agriculture and food—Henderson partners with SWAG Co-op, a Southwest Atlanta farmers’ organization dedicated to sustainable urban food systems, along with other food businesses and restaurants around the city. After graduating, classes of six to ten trainees, ranging in age from 18 to 24, are placed into jobs and externships around the city.“The original idea was for the young people to come up with a product we could sell,” Henderson says. “We were deciding between tomato sauce or hot sauce. Then Beyoncé came out with her song, you know, ‘hot sauce in my bag, swag,’ and that was it. Beyoncé decided for us.”Gangstas to Growers trainees came up with the sauce’s name, Sweet Sol, during a marketing workshop, and they gather weekly at a church kitchen in Atlanta’s West End to make it. Henderson and her team started off peddling the sauce at local events and farmers markets, but it now ships nationwide through the Come Up Project’s website.Born and raised in Brooklyn, Henderson experienced the fruits of activism early, and the struggles, too. Her mom—a Liberian-born social worker, educator, and entrepreneur who started both a school and an employment agency for immigrant women—died of AIDS-related complications when Henderson was 14. Her dad, a “rank and file Black Panther member,” passed when she was 29, eight days before the start of the Occupy movement.Henderson was working as a waitress at an Atlanta airport restaurant when her father died, and the news sparked something in her. She took the money she’d inherited and joined the thousands that had gathered on D.C.’s National Mall for Occupy Congress. There she met Malik Rhasaan of the offshoot group Occupy the Hood, which seeks to centralize the strife of underserved black communities. “I looked at all the signs, like, who am I supposed to be?” Henderson says. “I’m supposed to be doing this work.”Henderson returned to Atlanta and homed in on her own neighborhood, Westview, where rapid development had begun to displace predominantly black residents en masse. She enrolled in a training program with an urban agriculture center called Truly Living Well and upon graduating took over a defunct community garden, where she started teaching basic growing skills to local kids. In 2016 she turned her attention to the older set, and piloted Gangstas to Growers. “I found my organizer family within the farmers,” she says. “In my experience, the folks in local food movements are the most grounded, the most void of ego, the most thoughtful about how we can really be liberated and what this work should look like.”Today, Henderson is halfway through her second class of trainees and focused on securing investment for a hot sauce production facility and creating partnerships with local food businesses in Atlanta so they can one day employ Gangstas to Growers graduates. Her ultimate goal is to build a local food cooperative that can train and employ everyone who wants to get involved. “Coming from Occupy the Hood, that’s what we’re about: one hood at a time, block by block,” she says. “Black folks got the answers, we just need the resources.”Buy SweetSol Hot Sauce, $8All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishInterviewsRead MoreLifestyleFermented Hot Sauce Is Definitely Having a MomentBy Juno DeMeloRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-12", "author": ["Condé Nast", "Hilary Cadigan"]}