{"id": "98dc7d8c05417a1e06f84f9949d759dc", "url": "https://www.bonappetit.com/recipe/broccoli-rabe-with-chile-and-garlic", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Broccoli Rabe with Chile and Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueBroccoli Rabe with Chile and GarlicBy Chris MoroccoApril 16, 20193.5(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintBlanching tames the bitter bite of broccoli rabe without robbing it of its addictive spiciness: A quick dip in salted water makes it more palatable and tender, so that it cooks quickly in the skillet.Ingredients4 servings Kosher salt1bunch broccoli rabe8garlic cloves, thinly sliced¼cup extra-virgin olive oil, plus more for drizzling½tsp. crushed red pepper flakesPreparationStep 1Bring a large saucepan of salted water to a boil. Working in 2 batches, cook broccoli rabe just until bright green, about 10 seconds. Drain and let cool slightly. Squeeze excess liquid from broccoli rabe and coarsely chop.Step 2Cook garlic and ¼ cup oil in a medium skillet over medium heat, swirling skillet occasionally, until garlic is just beginning to brown around the edges, about 3 minutes. Add broccoli rabe and red pepper flakes and cook, tossing occasionally, until tender, 6–8 minutes; season with salt. Serve broccoli rabe drizzled with more oil.How would you rate Broccoli Rabe with Chile and Garlic?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleDelicious! I added a little lemon juice at the end. AnonymousMichigan 4/8/2020You need to SHOCK the broccoli rabe after you've blanched it in order to preserve the gren.UDregs4/21/2019This is not a review.  I want to make this, but what is a bunch broccoli rabe equal to?  Every grocery store packages theirs differently.Redmond, WA4/21/2019Explore Bon AppétitBroccoli RabeVegetableGarlicChileQuickEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianKetoHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Chris Morocco"]}