{"id": "98e181da6a8007038375c2ffcf88a9ec", "url": "https://www.bonappetit.com/story/favorite-healthyish-thanksgiving-recipes", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "These Are My Favorite Healthyish Thanksgiving Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Are My Favorite Healthyish Thanksgiving RecipesTwice-roasted sweet potatoes, bejeweled rice, and more recommendations from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 21, 2019FacebookTwitterEmailPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, and Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last weekend’s trip to L.A. was a whirlwind of exceptional bites (that masa-fried kelp at Onda, that chivichanga at Sonoratown), sips (that rice whiskey at In Sheep’s Clothing), and vibes (every single part of Mercado Sagrado).Now I’m back with a chest cold, jet lag, and a craving for soba. Brothy soba with clams, to be exact, which Sohla El-Waylly developed for Healthyish as a miso-y, sake-infused riff on linguine with clams. I think it’ll pair perfectly with a bottle of Jus Jus, a low-ABV (like 3.5 percent!) sparkling wine that tastes like super-tart grape juice and works as well in a cocktail as it does on its own in a fancy coupe glass.It’s weird to work at a place where you start talking about Thanksgiving in June and are taste-testing turkey by August. Now, finally, the rest of the country is paying attention, and you’re all like GIVE ME ALL THE RECIPES. Well, we got you. And over here at Healthyish, I’m particularly excited about this gluten-free, vegetarian stuffing that [drum-roll please…] doesn’t require making cornbread ahead of time. Andy Baraghani infuses a cornbread batter with all the aromatics, alliums, and mushrooms you want from a good stuffing then bakes everything in one skillet so you have plenty of room in the oven for other stuff.In Sarah Jampel’s monthly column, she writes about why you shouldn’t stress about making a second main course if you or your guests are vegetarian. It’s all about nailing that side dish matrix, which TBH I’d use whether you’re cooking a turkey or not. If you’re still looking for ideas, here are a few of my favorite healthyish-leaning Thanksgiving recipes:Squash with Dates and ThymeTwice Roasted Sweet Potatoes with Hot HoneyRoasted Carrots with Creamy Nuoc Cham DressingKung Pao Brussels SproutsBejeweled RiceGluten-Free Coconut Turmeric PieAnd, lastly, I hate to say these words but, well, shopping season is almost upon us. To make it as low-stress as possible this year, we’ve got one Healthyish gift guide with ideas for all the high-maintenance (and low- and regular-maintenance) people in your life. We’re going to add to it every week for the next six weeks, so check back often and make sure you’re subscribed to our weekly newsletter so you don’t miss a rec.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-21", "author": ["Condé Nast", "Amanda Shapiro"]}