{"id": "99028c618d0b96df3e27e59d81423cc7", "url": "https://www.bonappetit.com/story/how-to-pick-tomatoes", "year": 2021.0, "month": 8.0, "day": 5.0, "content": "How to Pick Tomatoes That Are Ripe and Ready | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Pick Out Really Great TomatoesThe best tomatoes are heavy and smelly.By Sarah JampelAugust 31, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWhen a tomato is good, it’s good—so it’s no wonder that passionate cooks wax poetic about these vibrant late-summer beauties. But when you pick up a dud that turns out mealy, mushy, and bland, it can put you off tomatoes for a while. Until someone invents a Good Tomato/Bad Tomato app (please, no), you’ll have to rely on your old-fashioned senses to select the juiciest, most flavorful specimens. These tips will keep you on the right track toward tomato bliss, whether you’re at the supermarket or farmers market.Look localIf you’re fortunate enough to live in or close to a tomato-growing region in the country, your best bet is to seek out locally grown tomatoes in the height of summer, when they’re at their peak. The most excellent tomatoes are almost always going to be the ones that have traveled the shortest distance, and are more likely to be ripened on the vine rather than in the back of a refrigerated truck.Hold but do not squeezeYou’ve got to pick ’em up! Smaller tomatoes should be firm but not hard; larger tomatoes should feel heavy for their size and neither too solid nor too soft or swollen. (Remember: They’ll continue to ripen on your counter at home.)Seek out tomatoes that are uniformly ripeAvoid tomatoes that have hard or pale spots near the stem as well as ones with large bruises or cracks that are too long or deep to trim away. They should be shiny, with a smooth, uniform skin.Take a whiffIf you’re not getting much of an aroma, it’s likely the tomato is underripe. A great tomato should smell floral and almost basil-y—you’ll know it when you smell it.Embrace the rainbowDuring peak season (mid- to late-summer is when tomatoes are at their best) is when you’re most likely to come across a variety of multicolored tomato varieties at the farmers market or in the produce aisles. They all have their own, distinct flavors worth trying out: Orange and yellow tomatoes are often less acidic (read: milder and sweeter) than their darker, redder counterparts.If it’s not summer, choose cherriesWhen you need an off-season tomato, the smaller ones are your best bet. Because they’re less likely to bruise in transport, smaller varieties like cherry tomatoes can ripen on the vine longer before being harvested, which means they’re usually more flavorful than their larger counterparts. When given the choice between cherry and grape, go with cherry. They’re juicier and tastier, with a thinner skin that makes them superior for bursting into pasta sauce or eating raw.It’s not cheating to use cannedEven at peak season, tomatoes in a can may be more convenient if your goal is to cook ’em until they break down completely—say, for a sauce or braise. No need to skin or seed! They also have consistency on their side. Once you find a brand you like (the BA Test Kitchen swears by Bianco DiNapoli Whole Peeled Organic Tomatoes), they won’t vary in acidity or sweetness like fresh tomatoes will.After all that, you deserve a salad…Tomato CaesarAn extra-thick Caesar dressing gives this tomato salad its oomph—and keeps it from sogging out at the picnic.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-31", "author": ["Condé Nast", "Sarah Jampel"]}