{"id": "990936a00205c87dcc47abb3fc19348a", "url": "https://www.bonappetit.com/story/squish-your-mushrooms", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "To Make Better Mushrooms, Squish Them | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Make Better Mushrooms, Squish ’EmMushroom lovers, rejoice. Mushrooms skeptics, open your minds.By Bettina MakalintalJanuary 4, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailI could eat mushrooms every day. And when I plan my grocery shopping just right, I do. This affection is, at times, controversial; many people hate mushrooms, eagerly attributing their distaste to the fungus’s taste and texture. I’d argue it’s almost always a case of misplaced blame: Why beef with the mushroom when it was the cooking method that did you dirty? Sure, if you don’t cook enough water out of mushrooms, you will get something that’s a little waterlogged (after all, mushrooms are between 85–95% water)—but when I make mushrooms, they’re dense (what some might call “meaty”) but with some textural variation. The firm mushroom flesh is paired with golden brown crust and frizzled crispy edges. And the way to my ideal ’shrooms is simple: Squish them! I learned this technique from the Sarno brothers, the mushroom savants behind Wicked Healthy, who use it to turn big chunks of mushrooms into beautifully charred steaks that can be seasoned and sauced in any number of ways. My mostly meat-free life has been better ever since.To do it you’ll need mushrooms—I generally go for oyster mushrooms, maitakes, or lion’s mane, since these come in large chunks with frilly edges and nooks and crannies that’ll cook into fun to eat textures—and two pans that nestle inside each other and are ideally cast iron, which are heavy and retain heat well. I generally use one 10\" and one 12\" pan.To start, heat up the larger pan and add just enough neutral oil to coat the surface. When it’s hot, add the mushrooms either as one big chunk or torn into a few smaller pieces. As soon as you hear the mushrooms start to sizzle and sear, put the second pan on top (I sometimes add a protective layer of foil on the bottom of the smaller pan) and let the weight of the cast iron do the work.Every so often press the top pan down, taking care to use a kitchen towel or pot holders since the mushrooms kick up some steam. When you notice that the top pan has settled slightly, pick it up and flip the mushroom hunk, making sure that the bottom side has become flat and seared. Add a little oil and repeat the process on the other side until the cluster is evenly browned and much smaller. If there’s some liquid left in the pan, remove the top pan and let the liquid cook off. From here, lower the heat to medium and season the mushrooms with salt, pepper, and whatever other spices you want (adding them at this stage prevents them from burning during that initial sear). You could baste the mushrooms with herby butter, like you might treat a steak, or add a sauce—this mushroom is really a blank canvas! The end result is a crispy, craggy mushroom cutlet that has more than once in my life made a mushroom hater go, “Oh, this mushroom is actually good.”Instagram contentThis content can also be viewed on the site it originates from.Even when I don’t want an entire mushroom cluster flattened into a perfectly seared slab, I follow the same principle. Cooking a handful of quartered shiitake caps in a skillet? A couple portabellas with their stems removed? Press them down with a heavy-duty metal turner, forcing that moisture to give way to gorgeous color and texture. (Smash burger? More like smashroom.)We’ve entered a new year, so say it with me: No more soggy mushrooms. You deserve better; so do the ’shrooms.Explore Bon AppétitMushroomRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Bettina Makalintal"]}