{"id": "991a562324611be023cd3f454eed6172", "url": "https://www.bonappetit.com/recipe/peanut-chutney", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Peanut Chutney Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssuePeanut ChutneyBy Priya KrishnaMarch 19, 20193.6(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintBlending together chiles, peanuts, cilantro, ginger, and lime juice creates a hearty, textured chutney that packs some heat. It will brighten up any crudités platter, and it’s also great simply slathered over a slice of crusty bread or used as a punchy condiment.Recipe adapted with permission from Indian-ish by Priya Krishna with Ritu Krishna (Houghton Mifflin Harcourt). Copyright © 2019. IngredientsMakes about ¾ cup2small Indian green chiles or serrano chiles, halved11½\" piece ginger, peeled, quartered½cup chopped cilantro½cup unsalted, dry-roasted peanuts1½Tbsp. fresh lime juiceKosher saltPreparationStep 1Blend chiles, ginger, cilantro, peanuts, lime juice, and 3 Tbsp. water in a blender, adding a splash of water if needed to get it going, until mixture resembles a coarse paste. Season with salt.Step 2Do Ahead: Chutney can be made 1 week ahead. Cover and chill.How would you rate Peanut Chutney?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI don’t get why people are being so harsh in these comments. I think peanut chutney is terrific as an accompaniment for bready dippers like idli. butter toast would be fine too, it needs something to soak into. You just need a small smear, no need to make cups and cups of this recipe.Anonymous5/25/2021This is ok and I’ll eat it an serve to guests, but won’t make again. Note this makes only 3/4 cup, so it’s very fussy to scrape that small amount out of the bottom of your blender. Flavor is fine, nothing to write home about, even after adding some extra lime and salt. Cilantro/lime is my favorite flavor combination, but this still didn’t do much for me.Jackie MMadison, WI11/27/2020Very flavorful and has a lot of heat. I added more peanuts and cilantro with about a half cup of greek yogurt to make the texture smoother and tone down the spice a bit\nAnonymousIL5/31/2019Doesn't taste like peanuts, doesn't taste like cilantro, doesn't taste like ginger. The end results is less than the sum of its parts. Very bland. Not worth the effort. chickenfogNorthern California4/1/2019This is a great combination of flavors.tuscantableMinnesota3/26/2019Explore Bon AppétitCondimentChutneyDipCruditéIndianSouth AsianAsianPeanutNutCilantroHerbs & SpicesEasySnackStarterVegetarianDairy-FreeGluten-FreeVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Priya Krishna"]}