{"id": "9922884ffbc21357a7b028da34353bf3", "url": "https://www.bonappetit.com/recipe/grilled-scallops-with-nori-ginger-and-lime", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Scallops with Nori Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Scallops with Nori, Ginger, and LimeBy Andy BaraghaniMay 21, 20194.5(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWe always seek out dry scallops, which will sear and caramelize better. Ask your fishmonger before you buy—it really makes a difference. To make them easier to grill, we thread the scallops onto sets of two skewers, not one, so they don't spin around willy-nilly when you pick them up. Then hang the skewers off the edge of the grill so you can pick them up with your (gloved) hands—no need for tongs.Ingredients4 servings⅓cup mayonnaise2tsp. fresh lime juiceKosher salt1toasted nori sheet1tsp. ground coriander½tsp. ground ginger2Tbsp. vegetable oil, plus more for grill12large dry sea scallops, side muscles removed, patted dry½lime3scallions, dark green parts only, very thinly sliced1tsp. Aleppo-style or other mild red pepper flakes or gochugaru (coarse Korean red pepper powder)Special EquipmentA spice mill; eight 8\" wooden skewers, soaked at least 1 hourPreparationStep 1Prepare a grill for medium-high heat. Mix mayonnaise, lime juice, a pinch of salt, and 1 Tbsp. water in a small bowl; set lime mayo aside.Step 2Finely grind nori in spice mill. Transfer half to a small bowl; set aside for serving. Transfer remaining nori to a large bowl and mix in coriander, ginger, and 2 Tbsp. oil. Add scallops and toss to coat.Step 3Thread 3 scallops onto 2 skewers. (This will keep scallops in place and make them easy to turn. You can also use this method for shrimp and small peppers like shishito and Padrón.) Repeat with remaining scallops and skewers. Season both sides with salt.Step 4Clean and oil grate, then immediately place scallops on the outside edge of the grill so that the skewers are hanging off the side. Grill, turning scallops with handles of skewers, until grill marks appear and scallops are just cooked through, about 3 minutes per side, depending on their size.Step 5Spread lime mayo on a platter and place skewers with scallops on top. Finely grate zest from lime half over, then squeeze juice over. Top with scallions and sprinkle with Aleppo-style pepper and reserved nori.How would you rate Grilled Scallops with Nori, Ginger, and Lime?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleExcellent recipe. We seared the Scallops on a heated nonstick pan, flipped once and turned off the heat.\nServed with Rice, Seaweed Salad and good Sake. Perfect combo. Thanks to everyone at Bon Appétit !MNew Orleans LA3/12/2021A terrific recipe! I agree about not adding water to the mayonnaise! Added lime juice instead. AnonymousAlexandria, VA12/7/2020Ok these are so good. Did these in my cast iron (no skewers) and served with white rice to soak up the richness. The two of us demolished these and wish I made moreAnonymousSan Francisco 10/1/2020Great, pretty, and tasty alternative to regular wine, butter, garlic, or so scallops.  Very easy to make and prepare, took little time.  I didn’t have a spice mill and had a hard time grinding the nori.  I ended up with a bag and chopper, and that helped but I ended up with flakes more than fine pieces.  It didn’t seem to affect the taste.  I followed the directions for the Mayo-lime spread and it worked out fine and was delicious.  The Aleppo-style pepper was hard to find, and it really only added to the appearance.  You could use paprika instead.  puzzledMinnesota6/30/2019Oh my! This is spectacular. I know I'm a throwback to Miracle Whip, added the recommended water, but it needed more lime juice. I didn't have Nori on hand, so I substituted Wasabi Furikake. It was a marriage made in heaven. An uncomplicated recipe that tastes like five stars! Definitely will make this again!angkbWashington 6/20/2019Made this last night. Asparagus is in season so we grilled a bunch alongside the scallops. Didn't add water to the sauce because I thought it would be too watery and I was right. Added a half teaspoon more of lime juice instead. Came close to licking the plate clean--the asparagus made good mops for any remaining sauce. Definitely making this again.Brimfield, Massachusetts6/7/2019Explore Bon AppétitSkewerScallopShellfishSeafoodSummerMainNut-FreeDairy-FreeGluten-FreeKetoHealthyishGrillingMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Andy Baraghani"]}