{"id": "992b4d7691ac186652212d1f372327db", "url": "https://www.bonappetit.com/story/grilled-chicken-sandwich", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "A Grilled Chicken Sandwich Doesn’t Have to Be Boring and Floppy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Grilled Chicken Sandwich Doesn’t Have to Be Boring and FloppyIt can be FANCY and FENNEL-Y and don’t forget the special sauce.By Alex Beggs and Molly BazAugust 23, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Judy ManciniFacebookTwitterEmailThis grilled chicken sandwich recipe (thighs only!) gets the BA treatment from senior associate food editor Molly Baz. The goal was to dispel any associations you might have with the sandwich: the sort of floppy, slightly rubbery fast food versions with a single, soggy leaf of lettuce. It's inspired by Caesar salad, inspired by mayonnaise, inspired by the idea of special sauce, inspired by grill marks, and the words “charred buns.” Here are the components that make this the best grilled chicken sandwich you’ll ever make (probably!?):Respect paid to the special sauceIt begins with a marinade of Dijon mustard, Worcestershire sauce, garlic, lemon, and pepper, whisked and emulsified into a tangy-creamy Caesar-mayo dressing with a slow pour of olive oil. The chicken marinates in some of that while you doctor up the rest for your special sauce (add cornichons and mayo for best results).Chicken notesBoneless, skinless chicken thighs are close to impossible to overcook, and the marinade makes them even juicier than normal. Grilled over medium-high heat, they’ll be done in 8-10 minutes. However: please let them rest for five minutes to account for carryover cooking and allow all of the juices to recirculate within the meat. While they rest, make the fennel slaw.Shaved fennel requires a mandoline, just buy one already! (Here’s our favorite).\nPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiWhat, fennel?Yes! A fennel-basil slaw adds an unexpected but very welcome fresh crunch to all the char and acidity. (“And don’t forget that I originally had castelvetranos in that slaw, which Adam Rapoport immediately squashed. Was worth a shot,” noted Molly.) Lemon juice tones down the licorice-ness of the fennel—the fennel instead functions like a crunchy pickle would (and is something that blew our minds the first time we had this lamb burger at Hart’s.) The chopped-up fennel fronds (look like dill) are the final garnish. I like the way the photo shows them scattered casually, like a wind blew in and the fennel fronds found their place in the chicken sandwich universe.Don’t forgetTo grill the bun. 30 seconds, done.Other toppings includeLettuce. Tomato.Some assembly requiredThere’s a method to Molly’s madness, which is to build from the ground up in the following order on mayo-dressed buns: lettuce (she pronounces this “le-toose” which you don’t need to know but now know), tomato, chicken, and then fennel slaw. The order keeps balance in the chicken sandwich universe. And finally, the recipe concludes with my favorite final line in any recipe: “Close sandwiches with top buns.” Everything in its place.Get the recipe:Grilled Chicken Sandwich with Caesar-ish DressingDeeply charred mustardy chicken thighs are paired with a crunchy and refreshing fennel-basil slaw for the ultimate summer-night chicken sandwich.View RecipeExplore Bon AppétitChickenSandwichGrill BarbecueFennelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Alex Beggs", "Molly Baz"]}