{"id": "992cf0cf12524c9f547e985d308026ab", "url": "https://www.bonappetit.com/story/thanksgiving-potluck-rules", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Our Smartest Thanksgiving Potluck Strategies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Simple Rules for Mastering the Thanksgiving PotluckDon’t leave your potluck up to, well, luck. These guidelines will guarantee your BYO holiday is more support than stress.By Sarah JampelNovember 13, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailA potluck-style Thanksgiving is, plain and simple, very logical: You can cross a handful of dishes off your scroll-sized list, free up kitchen (and head) space, and make your guests feel involved. Plus, your great aunt or cousin’s boyfriend might bring something delicious that you would’ve never thought to make on your own.It can become more of a stressor than a solace, however, when one friend shows up asking to use the oven and another, stuck in traffic, is in possession of the only batch of mashed potatoes for the party. To make sure your Thanksgiving potluck works in your favor, follow this plan. They’re so helpful, in fact, they’re also rules to live by when choosing your contribution as a guest.1. Assign within reason: A cooked turkey should move no farther than the distance between the oven and the table. Farm out salads, casseroles, and other hearty, sturdy dishes that can be carried under one arm (but might take up a lot of room in your own fridge). Cranberry sauce is the perfect candidate: It’s easy for someone to transport, it can be served chilled or at room temp, and it only gets better with time, meaning your valiant volunteer can make it days ahead.2. Assign smart: The best assignments are good at room temp and avoid minimal “finishing touches.” Ask a guest to bring a frozen dessert or a piping-hot soup and it won’t be that way when it arrives. And unless you have burners, sheet trays, cutting boards, and oven space to spare (...who are you?!), think of dishes that can be made as far in advance as possible. And guests, don’t leave any garnish prep to the last minute: Toast nuts, mix vinaigrette, and wash and tear herbs at your own house, then transport them in separate containers if you’re worried about wilting or sogging. Leave only the final toss for game time.3. Know your guests’ limits: Request that the perpetually late friend bring dessert, not an appetizer.4. Divide and conquer: If you’re hosting a massive group, divvy up certain staples, like potatoes and stuffing, among several guests so that no one has to quadruple a recipe. (If you’re the competitive type, you can turn this into a taste-off. Just kidding—kind of!)5. When in doubt, ask for an appetizer: If nothing else, something to snack on will satiate any peckish guests, buying you time to finish setting up.6. Prepare to receive the bounty: When friends come bearing Tupperwares, make sure you’re adequately stocked up with utensils, bowls, and platters for serving. Or be clear up front that the vessels and silverware are part of the assignment, and guests need to bring their own.7. Think beyond food: Get cooking-phobic friends and family involved by asking them to bring wine glasses, napkins, ice, or even a (really thoughtful) playlist. If all else fails, there’s always dish duty.Explore Bon AppétitEntertainingThanksgivingPotluckRead Moreculture10 Post-Game Rules for Thanksgiving DinnerBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Sarah Jampel"]}