{"id": "99356587040a99adce4bd5512141f83d", "url": "https://www.bonappetit.com/story/apocalyptic-snacks", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "When Did Snacking Become So...Bleak? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen Did Snacking Become So...Bleak?Mush in pouches, dehydrated everything, and endless jerky. Why are we eating like it’s the end times?By Alex BeggsJanuary 27, 2020FacebookTwitterEmailPhoto by Laura Murray, Styling by Allie WistFacebookTwitterEmailThe other day I was exiting the New York City subway and a woman made direct eye contact with me and said: “Jesus is coming.” And, sensing I’d heard that one before, added: “Very soon.”Like, this week? I wondered. Because if so, I need to get my snacks in order.I know exactly what to buy, because I’m a trade show-attending, grocery store newsletter–subscribing, avid snack news–following kind of person. I try every new product at Trader Joe’s even though it hurts sometimes. I spend the kind of time perusing the chip selection at Kroger that I do in the hallowed aisles of Sephora. Study, devotion, curiosity. And I can’t help but notice, for the past few years now, that snacks have gotten more...apocalyptic.What I mean is: they’re unnecessarily nutrient-packed and efficient. Vitamins, yeah. And So. Much. Protein. They’re dehydrated and shelf stable for probably centuries if we last that long. They’re blended into liquid and mush form, requiring no chewing (in case our teeth fall out in the blast?). They’re condensed into bars and turd-like energy “rolls” to fit into our pockets when we’re forced to roam in the aftermath of the incoming alien invasion and/or alien war. Jesus might be coming (back). Aliens are always in the cards. Nuclear War, imminent. Unstoppable natural disasters loom. Or maybe it’ll just be us, ruining everything with our boring daily activities, like driving.Either we’re preparing for the apocalypse, or these snacks are simply reflective of how we spend most of our time: working. We work as furiously as the mice used in all of those studies about the workplace. We measure our productivity in real-time data and pride ourselves on the ability to Slack while on a conference call while watching Twitter scroll by. It’s an endurance sport that you never stop adding miles to. And so we need to be fueled. Fast. These efficiency snacks are brainwashing us into thinking we’re busier than we are, thirsty marketing targeted at our increasingly overworked, underpaid, stressed labor force. Will you, bigtime busy person, die without a superfood smoothie pouch? Maybe!All the food groups: jerkies, pouches, dissolvables.\nPhoto by Laura Murray, Styling by Allie WistHere are some of the snacks of which I speak:The pouches. Every toddler in my life is walking around with a mango yogurt pouch wagging out of their mouths like an extra long plastic tongue. Now there are pouches for adults—which is great for those whose physical needs require it—but they’re overtly marketed to adventurers. Like pouches of oatmeal to take camping or to the cubicle you practically camp at, or these peanut butter pouches, pouches of superfood smoothies, pouches of protein smoothies, and squeezable chia pouches.Don’t tell me my life is as on-the-go as a toddler’s. It’s not! I’ve already figured out how to walk, therefore I can spend the rest of my days sitting. After the apocalypse, I’m foretelling, we’ll revert to baby form. We’ll squeeze protein into our weary mouths and dance in diapers made of recycled pouch plastic and howl at the moon who’s no longer accepting new tenants. But until then, I’m gonna eat oatmeal out of a bowl.In the chewables, there are individually wrapped cookies promising to provide enough protein for a powerlifter. Millions of bars, in general, each with their own con, like these lady-specific, dreaming-about-donut-flavored ones that will make future us mourn for donuts when this is all we have left. There are dissolve-in-your-adult-toothed-mouth brussels sprout puffs, because we’ll have to get our greens in when the ground’s all burnt up. There are dehydrated cubes of cheese—Moon Cheese—that our compatriots, the little lab mice, would recognize and adore. Those are pretty good.In the challenging chewables, there are a myriad of jerkys to bulk you up while you order solar powered generators online. There’s salmon jerky that makes you beautiful and gives you cat treat breath. Chipotle soy jerky. Something’s-off vegan jackfruit jerky. Jerky turkey sticks. Buffalo bites with cranberry. “Beef thins.” Dehydrated bison bites with chia. Slabs of pineapple jerky. Zesty Thai mushroom jerky. The bougie healthy office workers who hike on the weekends don’t need this protein, and yet, we can’t get enough of it. It signals efficiency. Protein = strength. Strength = wrists that can withstand 12 hours of straight typing, clicking, thumbing.The apocalypse snacks repulse me and then they pull me in. The zesty Thai mushroom jerky was just what I needed to avoid writing this paragraph five minutes ago. I didn’t have to cook it, which is a small joy. An instant hazelnut oatmeal cup was easy to pour boiling water into and wait three minutes for. Cheese snacks will always be cheese snacks; no matter how close to the moon they are, I will eat them.Survival foods know a secret buried shallowly inside me. They know that I want someone, something to take care of me once in a while, like an $8 snack crammed with protein and an ad agency design deck. Food that promises to take care of the exhaustion of living might seem like a welcome relief, but eventually I’ll be hungry again. Instead, I want my apocalypse food to be frozen quarts of bean soup I spent three hours making on a Sunday. (The generator will keep it cold.) I’m betting the lady on the subway stairs was wrong. We’ve got some time yet. Time to cook oatmeal and cookies and pork chops. And wait it out.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-27", "author": ["Condé Nast", "Alex Beggs"]}