{"id": "993854c0eaebb3b1110c0f7f1b992106", "url": "https://www.bonappetit.com/story/avocado-toast-cocktail", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "This Avocado Toast Cocktail Is My New Favorite Brunch Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Avocado Toast Cocktail Is My New Favorite Brunch DrinkIt's not as gimmicky as it sounds, I swear.By Alyse WhitneyMarch 13, 2018FacebookTwitterEmailBar MezzanaFacebookTwitterEmailI thought I was over avocado toast until I tried an avocado toast cocktail. With a few hours until a flight from Boston to NYC, I popped into one of my favorite Italian restaurants, Bar Mezzana, in search of pasta and a mid-afternoon cocktail that wasn’t a mimosa or Bloody Mary. My eyes immediately settled on a drink called “Smoothie Moves” (I love a pun!) with “avocado toast cocktail” written next to it.I was deeply skeptical that it would be a spiked green juice or, worse, a thick smoothie with a shot of vodka. But I trusted Bar Mezzana’s beverage director Ryan Lotz and put my fate in his hands. Soon after, a coupe glass filled with a light green drink and rimmed with spice-flecked breadcrumbs arrived at the table. I took a deep breath, took a sip, and braced for impact. Damn. It was really good.The avocado and kale didn’t come through right away, but there was a slight bitterness from the greens that balanced out the sour and sweet of a lot of lime juice. It was a little thicker than a vodka-soda, but that made for a pleasant creaminess that contrasted with the crunch of breadcrumbs—like avocado toast. The key to that texture is from emulsifying avocados into Prairie Organic Vodka, a corn-based spirit made using co-op farms in the Midwest. It costs about the same as Tito’s but has a little more texture and viscosity that works in this cocktail.This avocado margarita from Curra’s Grill in Austin is a blended, icy drink—the Smoothie Moves from Bar Mezzana is more like a vodka gimlet.\nEva KolenkoWhen I got back to New York, Lotz talked me through the recipe he and bar manager Gwen Hagerty created, and it’s not as difficult as I expected. First, blend 1 liter of vodka with two ripe—or even a little overripe—avocados and strain through a single layer of cheesecloth. If you want to make less, use one avocado per 500 ml of vodka: This amount will big-batch 10 to 12 cocktails. This base liquor will maintain its color for about a week in the fridge before turning brown, but it’s still usable after, and you can add a little lemon juice or apple cider vinegar to help keep it green.Next, pulse 1 cup of destemmed kale into crumb-sized pieces (or chop very thoroughly with a knife) and combine with 1 cup of simple syrup, and then strain through a single layer of cheesecloth. After you have those two components in your fridge, you can shake 2 oz. avocado vodka, 0.75 oz. kale syrup, and 0.75 oz fresh lime juice together anytime. For a pitcher of 10 drinks for a party, the conversion is 1-¼ cups avocado vodka, 1 cup of kale simple syrup, and 1 cup of lime juice stirred together. To serve, rim a cocktail glass with a mixture of ¼ cup salt, ¼ cup unseasoned breadcrumbs, 1 Tbsp. Maras chile or Aleppo-style pepper, and 1 tsp. cayenne.This perfect brunch drink goes down almost a little too easy. The kale cuts through the sweetness and keeps it light on its feet, and you could easily substitute the kale syrup or avocado vodka in your next gimlet or margarita. Next up I’m hosting a taco night with chorizo breakfast tacos and grilled steak tacos because this avocado toast cocktail will pair well with all of the above. Maybe I’ll even skip the guacamole and let people drink their avocados instead. Scratch that—I’d never skip the guac, but I’ll definitely make this drink a new tradition.This queso would pair well with an avocado cocktail:Explore Bon AppétitAvocado ToastAvocadoCocktailHealthyishBostonRead MorecultureWhy Are We Still Talking About Avocado Toast?By John BirdsallcultureTrader Joe’s Tiny Avocados Are More Than Just CuteBy Alyse WhitneycultureLies We Tell Ourselves About Avocado ToastBy Molly Youngtechniques5 (New!) Ways to Top Avocado ToastBy Dawn PerryPhotography by Alex LauRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Alyse Whitney"]}