{"id": "9945160d1f6e1e7bbe5225340b43982b", "url": "https://www.bonappetit.com/story/bywater-american-bistro", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "I Will Eat Anything Chef Nina Compton Cooks, and So Should You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow an Unrequited Chef Crush Led Me to My Favorite New Orleans RestaurantMy love for Nina Compton’s cooking started from afar, and culminated with perfect snapper.By Hilary CadiganJune 19, 2019FacebookTwitterEmailCourtesy Bywater American BistroFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My crush on Nina Compton started from afar, but totally wasn’t creepy, I swear. In some ways, it was born out of a crush on New Orleans itself, a city I haven’t stopped annoyingly waxing poetic about since I went for Mardi Gras as a college freshman. But it also had something to do with a photo of plump head-on shrimp skinny-dipping in a cast-iron pan full of Calabrian chile butter that I happened upon in 2016 while scrolling through Instagram. It was a thing of beauty, and it turned out to be the creation of this new chef who’d just arrived in my favorite city from St. Lucia (by way of Miami) and opened a French-Caribbean restaurant called Compère Lapin.I didn’t get a chance to actually taste Compton’s food until last year’s Southern Foodways Alliance symposium, where the chef somehow managed to pull off a near-perfect 350-person lunch. The cowheel soup she served—made from real cowheels and cleverly tied to a Caribbean folktale about a beautiful man-killing woman, identifiable as an evil spirit only by her cow foot (I mean, come on)—was the most delicious thing I ate in a weekend packed with delicious things. It was thick like velvet, with ginger and pumpkin and stewy lentils and habaneros rounding out the lush broth of roasted cow feet. I could’ve bathed in the stuff. My vague crush became a full-blown obsession. Not like, starting-an-Instagram-fan-account-level obsession, but close.A few weeks later, by sheer coincidence, I found myself back in New Orleans, with time for only one unplanned meal. So, duh, I picked Bywater American Bistro, Compton’s newest restaurant, a sophisticated celebration of local flavors and ingredients with nary a plastic beaded necklace in sight. There, I ate the dish that ended it all: a simple yet perfectly steamed red snapper blanketed in Crystal hot sauce-kissed Hollandaise. The sauce gets pumped through a whipped cream canister, making it so light and so fluffy that it resembles what I’ve always thought clouds might taste like. And despite the fact that Compton and I had yet to speak a word to each other, it felt like the end of a rom-com, where everything falls into place and a jangly pop song starts to play. The credits roll and we all live happily ever after.Go there: Bywater American BistroExplore Bon AppétitHighly RecommendRestaurantsNew OrleansRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-19", "author": ["Condé Nast", "Hilary Cadigan"]}