{"id": "9947fd32a5e3b38cae3b5024e4e5e495", "url": "https://www.bonappetit.com/story/make-a-killer-fruit-salad", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Make a Fruit Salad No Matter the Time of Year | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make a Killer Fruit Salad No Matter the Time of YearIt’s a simple formula: sweet-juicy fruit, crunchy-salty nuts, and chewy-fatty cheese.By Carla Lalli MusicMarch 4, 2019FacebookTwitterEmailPhoto by Gentl & Hyers, Food Styling by Susie Theodorou, Prop Styling by Nina LalliFacebookTwitterEmailThere is going to be one day this summer when I lay my hands on the most perfect peach in the universe. When that day comes, I am going to wait till no one else is around, and I’m going to perch myself right above the kitchen sink, and I am going to eat the great peach. I hope I’m in a bathing suit when this happens, and at the very least I better not be wearing shoes.I look forward to that August afternoon, which will serve as a reminder that peak produce is worth waiting 365 days for. But the rest of the year, though, fruit could really use a boost.I believe that fruit should be eaten not just out of hand, and not just for dessert, but in savory situations too. And when I want to serve it as an actual dish—and not, you know, just a snack—I start with salt, pepper, and olive oil. Those essential seasonings make good things taste even better, and if you think it’s weird to put salt and pepper on, say, a fig or a clementine, remember that tomatoes are a fruit. Cucumbers: fruits. Avocado, also a fruit. You salt and pepper those things on the regular. Most fruits, especially if they are very sweet, will also benefit from a smidge of something acidic too. Imagine watermelon with a spritz of fresh lime juice, tomato with sherry vinegar, apples and lemon, or strawberries and balsamic. That right there is an added-value fruit situation.But when I want to take fruit all the way to salad-town, I will also consider textures. What I want in my fruit salad is exactly what I want on my snack board: Fruit, cheese, honey, and nuts. Just about any fruit will pair well with a firm, salty, not-too-funky cheese. Figs and manchego. Apples and cheddar. Pear and Parmesan. Persimmon and a mild blue. These are classic and I hope intuitive, but if you’re not sure, eat a sliver of each together and see if they get along.Finally, the crunch factor. In my book, Where Cooking Begins, I came up with a skillet-toasted recipe for nuts that calls for olive oil, honey, salt, and pepper to turn them into a spicy-sweet condiment. You can give this treatment to any nut—almonds, hazelnuts, walnuts, pecans, pistachios. Ask not what you should use, but use what you have on hand.Once the nuts are toasted and dressed, spoon them over the fruit and let everything sit for 15 minutes. In that time, the olive oil and honey will pool on the plate along with the fruit juices and any vinegary thing you added. The cheese will soften and pick up these flavors too. In this little blip of time, the salad will manufacture new delectable flavors, becoming jazzed-up and improved versions of themselves. The best part is that you don’t have to wait a whole year before you can have this. Over here, I’m still waiting on that peach.Get your hands on some fruit:Fresh Fruit with Cheese and Peppery NutsMake this fail-safe combination of sweet-juicy fruit, crunchy-salty nuts, and chewy-fatty cheese your all-season salad template.View RecipeExplore Bon AppétitHealthyishFruitSaladRead MoreLifestyleHow to Make Any Vegetable More Exciting With the Power of a Yogurt MoatBy Emily Fiffer and Heather Sperling Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-04", "author": ["Condé Nast", "Carla Lalli Music"]}