{"id": "9959d1179811f1c4e9e7a6c2923a5439", "url": "https://www.bonappetit.com/story/caramelized-ginger-chicken-soup", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "This Chicken Soup Recipe Has Caramelized Ginger and Trust Us, It Works | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere’s Caramel in This Chicken Soup and Trust Us, It WorksYou’ll want to drink this broth by the gallon.By Christina ChaeyMarch 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI don’t use a recipe approximately 99 percent of the time I make chicken soup. If I crave a zingy broth, I’ll opt for a knob of ginger, a halved chile, and a bunch of cilantro. If I want a classic-style soup (with egg noodles, always with egg noodles), I’ll toss in handfuls of parsley, thyme, dill, and lots of black peppercorns. Sometimes I’ll go full-on mama-style and throw a whole chicken in my biggest pot with half an onion and few fat chunks of carrot and celery, cooked until the vegetables are so soft you can sieve them through your teeth.The option to not follow a recipe exactly (or skip it altogether) is why I’ve always preferred cooking to baking, a sport in which precision is next to godliness. So when senior food editor Andy Baraghani asked me to cross-test his Chicken Soup with Caramelized Ginger and informed me that I’d be making a caramel as part of the recipe, the pastry n00b (do people still say that??) in me quaked. (The title suggests you’re caramelizing the ginger like you would onions but no, you’re making a caramel that you combine with ginger for this unexpected but ingenious broth.)Caramelizing things is scary! But I promise this one is quick and painless and will give your finished broth an undercurrent of delicious, dark-sweet complexity that sets it apart from your typical chicken soup. And this isn’t your typical chicken soup. There’s a ton of ginger—a whole 6\" piece—making this a dream sick-day-soup. The caramel mellows out the spice of ginger, leaving an intensely bright, flavorful broth that you’ll want to drink out of a Thermos all day. Plus, it gives you bragging rights, because at the end of it all, you’ll not only know how to make chicken soup, you’ll also know how to make a caramel.You’re going to make what’s called a “wet caramel,” which just refers to a caramel made with sugar and water, as opposed to one made with only sugar (a.k.a. a “dry caramel.”) Adding water to the mixture as it cooks means the sugar is less likely to burn or clump, which means even a pastry dummy like me can handle it. It’s the same method we use to make this silky-smooth caramel sauce, which I’d always been too scared to attempt—before now!A few key steps to success:1. Use a light-colored saucepan with a heavy bottom. The light color of the metal will help you see what’s actually happening to the sugar water (which, FYI, is clear) as it cooks and starts to brown. Being able to see what’s going on during the cooking process is critical. And you want a pan with a heavy bottom so your caramel will cook evenly and be less likely to burn in spots.Alex LauAlex Lau2. Swirl, don’t stir. Stirring the caramel with a spoon as it cooks can cause it to turn grainy. Feel free to stir the sugar initially to dissolve it in the water, but after that use a smooth swirling motion (swish and flick!) to keep things moving along until everything’s nice and golden and you’re ready to add your ginger.Alex Lau3. Don’t step away from the stove. Not to check your phone, not to pee, not for anything! The trickiest part of making caramel is waiting for it to turn an actual caramel color. For most of the cooking time, it’ll look like nothing’s happening. And then you’ll decide you want to step away for “just a second,” and I guarantee you will come back to a burnt, acrid mess. Remember: Caramel moves pretty fast. If you stop and look around once in a while, you’ll probably burn it.4. Slice the ginger as thinly as possible. Once you make your caramel, you’ll add a handful of ginger coins and cook them until they’re nice and soft and that intensely spicy raw ginger flavor is cooked out a bit. I made the mistake of not slicing the ginger thinly enough when I made this—they ended up a little too crunchy for my liking, but I definitely could have just cooked them for longer.Once you’ve beautifully caramelized your ginger, the rest of the soup is a cinch: garlic, scallions, and cilantro add even more flavor, a chile adds heat, and boneless skinless chicken thighs cook through in minutes. A healthy splash of soy sauce at the end rounds out the flavors. As for dessert: how about caramel?Get the recipe:Chicken Soup with Caramelized GingerA ginger-forward chicken tonic soup that will provide some much-needed relief when you’re not feeling too hot.View RecipeMore comfort food:Explore Bon AppétitSoupGingerChickenRead MorecookingThe Garlic Broth Recipe That Brought Me Back to HealthBy Chris MoroccocookingThis Noodle-y, Herb-Packed Miso Soup Is Filling Enough to Actually Be DinnerBy Sarah JampelcultureBanish That Pesky Cold with this Magical TonicBy Jill Baughman and Vincent CrossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-23", "author": ["Condé Nast", "Christina Chaey", "Vincent Cross"]}