{"id": "997b72a2fea7e8a90282dd865370e6de", "url": "https://www.bonappetit.com/story/in-praise-of-the-celebrity-profile", "year": 2018.0, "month": 11.0, "day": 5.0, "content": "Emergency Nut Milk and a Defense of the Celebrity Profile | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIn Praise of the Celebrity Profile and Emergency Nut MilkReading recommendations, recipe suggestions, and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroNovember 29, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she’s seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Love it or hate it......everyone knows the weekend after Thanksgiving is the time for deals. But you know what else it’s the time for? Unsubscribing from every marketing email that you’ve been absentmindedly deleting or ignoring for years.  (Note: If you’ve read this far, the Healthyish newsletter is NOT one of those emails.) Do you know how many hours of our lives we waste hitting that trash can button?! Neither do I, but it’s too many.I didn’t plan to wage war on my inbox, but from the time I finished my second slice of pecan pie through Cyber F-ing Monday, I painstakingly scrolled to the bottom of every promo email I received and clicked “unsubscribe,” “opt out,” or “remove me from this list.” I left feedback when required (“I NO LONGER WANT TO RECEIVE THESE EMAILS”) and moved on to the next.It was a days-long battle fought in silence and fueled by leftovers. When I woke up on Tuesday morning, I had only seven unread emails, all from actual, real people I knew. I’d beaten the internet… for now.Make This StatElizabeth CecilI discovered a new-to-me BA recipe last weekend and fell madly in love. It’s Andy Baraghani’s turkey congee from the 2016 Thanksgiving issue, and it’s the perfect way to eat leftovers without realizing that you’re eating leftovers, and it feels kinda healthyish too. The recipe is super simple, especially if you already have leftover turkey stock hanging out in the fridge. It doesn’t call for it, but I added a few cups of shredded turkey because I had plenty of that, and, instead of the shiitake mushroom topping, I sliced up the turkey skin and pan-fried it, then finished it off with soy sauce. If you still have leftover bird in your fridge, this is its grand finale.You know what else really works? This I-ran-out-of-nut-milk trick. I tried it this morning after discovering I was out of Oatly (what fresh horror!) using a couple tablespoons of cinnamon nut butter from Ground Up whirred in a blender with water, and my bowl of Weetabix (don’t @ me) was better for it.This Week on HealthyishEmily Fiffer and Heather Sperling of Botanica.\nPhoto by Ren FullerWe launched a new column! Emily Fiffer and Heather Sperling are the co-owners of Botanica, a restaurant, market, and all-around good-vibes spot in Los Angeles, and they’ll be writing regular dispatches from the Golden State. Their first column is about why they dropped their jobs in media and moved across the country to open a restaurant that “lavishes vegetables, fruits, and grains with the attention and respect they deserved.” (Uh, yes, I’m jealous). It’s all dreamy and delicious.. until the power goes out on New Years Eve.Reads of the WeekAllison P. Davis’s profile of Lena Dunham is remarkable for a lot of reasons, many of which you can read on the internet. I liked it for its subtlety, the artful way that Davis lays out Dunham’s own words and actions to indict her. There are no contrived scenes, no skydiving or mini-golfing, just conversation in living rooms and bedrooms and kitchens. The quiet makes it so that everything Davis turns your attention toward—mainly the total, all-encompassing narcissism of her subject—comes through loud and clear.Some people are saying that the world didn’t need to hear more about Lena Dunham, but I think that’s missing the point of what a celebrity profile is. Did I care much about R. Kelly or Gwyneth Paltrow or J.R. Smith? LOL, no. But I read the hell out of those pieces—I loved them, because they weren’t just about a person with a lot of money, fame, talent, or luck. They were about us. It’s a cliche, but the people we make famous are reflections of what we value and who we aspire to be. When a celebrity profile is done right, it shines that light right back on us so we’re forced to talk about why we put that person on a pedestal in the first place.On another note, If I had a husband and he came home every night and asked, “What’s for dinner?” I’d probably stop cooking too.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThese 6 Products Keep Me Healthy Through Every Stage of TravelingGallery6 SlidesBy Nancy Jo Iacoi Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-29", "author": ["Condé Nast", "Amanda Shapiro"]}