{"id": "998b0765f1f67ddbcdeefe4afbaeaef2", "url": "https://www.bonappetit.com/recipe/sweet-and-sour-dal-bhat", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Sweet-and-Sour Dal Bhat Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueSweet-and-Sour Dal BhatBy Vivek SurtiSeptember 17, 20193.9(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrint“In Gujarat, India, the traditional meal is dal bhat with lentils, rice, bread, and chaat,” says chef Vivek Surti of Tailor in Nashville, No. 7 on 2019’s Hot Ten list. “If you walked into my mother’s house, this is the dal bhat you’d eat. The dal is a little sweet with jaggery, a little spicy with green chiles, and a little sour with lime juice.” Together, they make for one intense interplay of aggressive flavors. To make it your own, experiment with the balance of those three elements—you might make it more sour, or very, very spicy depending on your palate and preferences.Ingredients8 servingsDal1plum tomato, coarsely chopped1cup toor dal (pigeon peas), rinsed, picked over5Tbsp. Diamond Crystal or 3 Tbsp. Morton kosher salt3serrano chiles, halved6oz. ginger, peeled, coarsely chopped (about ½ cup)1cup (lightly packed) grated jaggery6Tbsp. fresh lime juice2tsp. red chile powder, preferably Kashmiri1tsp. ground turmericRice and Assembly2cups basmati rice9Tbsp. vegetable oil, divided6curry leaves3dried Kashmiri, guajillo, or New Mexico chiles, seeds removed1Tbsp. brown mustard seeds1tsp. asafetida½tsp. fenugreekIngredient InfoJaggery, also called gur or palm sugar, can be found at Asian or Indian markets. Asafetida can be found at Indian markets. Both can be found online at foodsofnations.com.PreparationDalStep 1Bring tomato, toor dal, salt, and 8 cups water to a boil in a medium saucepan over medium-high heat, skimming foam from surface and stirring occasionally, 8–10 minutes. Reduce heat and simmer, stirring and skimming occasionally, until dal are very soft but not disintegrated, 45–60 minutes.Step 2Meanwhile, process chiles and ginger in a food processor to a coarse purée, about 1 minute. Transfer to a 2-cup measuring glass or a medium bowl; stir in jaggery, lime juice, chile powder, and turmeric. Set seasoning mixture aside.Step 3Once dal is done, mix in reserved seasoning mixture and simmer until flavors are melded, about 5 minutes. Blend dal with an immersion blender or in a blender until smooth; it should be about the consistency of heavy cream.Step 4Do Ahead: Dal can be made 3–4 hours ahead. Cover and keep warm.Rice and AssemblyStep 5While the dal is cooking, place rice in a medium bowl and cover with cold water. Swish around with your fingers to remove surface starches, then drain through a sieve or colander. Repeat process until water runs clear, about 4 or 5 changes of water.Step 6Heat 2 Tbsp. oil in a medium pot over medium. Add rice and stir to coat grains in oil. Add 4 cups water and bring to a boil over high; reduce heat to low, cover pot, and cook 15 minutes. Remove from heat.Step 7Just before serving, heat remaining 7 Tbsp. oil in a small skillet over medium-high. Add curry leaves, chiles, mustard seeds, asafetida, and fenugreek one at a time, pausing for a second between each addition and swirling pan. Cook until spices are toasted and curry leaves sizzle and pop, about 20 seconds. Spoon spices over dal; serve with rice.How would you rate Sweet-and-Sour Dal Bhat?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI loved the flavors in this recipe, but I’m not sure what I did wrong. My consistency was far too watery. It also came out a lot less red than the photo, so I’m wondering if I added more tomatoes it would turn out better. Was there a cream or yogurt added, like in the photo? Lena OLos Angeles, CA11/4/2021I'm crazy about this recipe, and have made it over and over since I first tried it. It is spicy, but not detrimentally so--you can increase the amount of lime or salt or decrease the number of whole chiles if you are concerned about the heat level. (You could sub jalapenos for serranos, too, since they are less spicy.) I also definitely serve it with lots of yogurt to cut through the spice. I use 3-4 tablespoons of diamond crystal salt instead of the 5 the recipe calls for. Also for the commenter upset about spice levels, I believe the seeds visible in the image are from the dried chiles in the tadka, not the serranos. \n\nI found this a striking dish, the flavor was one I could never have imagined producing in my own kitchen. It's one of my favorite BA recipes by a mile.AnonymousNYC1/27/2021Don’t waste your time and money. Honestly, are you kidding me? I’ve been a food editor, recipe developer and food stylist for over twenty years . . . I have never been so completely disappointed in a recipe. I was totally excited about the prospect of this flavor profile. I found a local Indian grocery. I bought every ingredient that I didn’t already have in my kitchen, although I admit that I used jalapeños instead of serranos  (thankfully!) AND I scraped every seed off of every hot pepper. This is an insanely hot dish. It’s not sweet and sour, it’s overwhelmingly hot. HOT HOT HOT. Not sure what sort of palate you are appealing to, but this is false advertising from the get go. Not only does this dish not look ANYTHING like the pic (which, ironically includes seeds - the hottest part of a pepper!) but it is so overwhelmingly hot that you can barely taste any of the other amazing ingredients. Not surprised that I am once again let down by a recipe from what I once thought of as a stellar food publication. You folks are all about pictures and nothing about the integrity of your recipes. I’ll never trust you again. Shame on you.ElleCheffeNYC8/18/2020The dal turned out to be way too thick for me. I had to slowly add boiling water (half cup) to thin it out. It was definitely salty; I used 3 tbsp kosher salt instead of 5 tbsp crystal. Also, the dal was orange and not red like the photo. The photo shows cream (or something similar) in the sauce, but I saw no mention of this in the recipe. Overall the flavors are interesting, but this was a lot of work for such a salty dish. AnonymousCincinnati 12/9/2019The flavors in this dish are great, although I found they kind of mellowed out more than I was expecting in the final dish. I think next time I will try draining out some of the water before blending so the spice mix isn't so diluted. Anonymous10/29/2019Wow! So easy yet so complex. Made the trip to a local Indian food store to make sure I had all the correct ingredients. I assume that this recipe should specify DRIED toor dal - that's what I used. If you use canned, it would be too salty and complete mush after an hour of cooking! The only change I made was to remove seeds and veins from 2 of the large serrano peppers (my 8 year old loves spicy, but I wasn't sure how hot the dried powdered pepper would be). It ended up being a touch spicy for him (he just had extra rice) and just right for my husband and I. Pretty simple to make, but tastes like you're sitting in an authentic Indian restaurant. There is a lot of ginger, but it mellows a bit with cooking. I finished this then let it sit on super low heat till serving about an hour later. Using an immersion blender didn't get it quite as smooth as I expected, but with the rice, it didn't matter. Will do again for sure! TXHuskerTexas10/20/2019ok i don't think i can edit that review but it was supposed to say runny not funnyAnonymousOakland, CA10/13/2019oh man this turned out so delicious. i think I had the heat a little high - the lentils were ready quickly and so not as much water had evaporated, leaving it pretty funny, but still absolutely delicious over rice with naan. when i make this again i'll probably do 2/3 cup jaggery and a couple more fresh chiles.AnonymousOakland, CA10/13/2019Delicious!  I made it as written and got the intense interplay of flavors described.  The large amount of salt (a) is needed because you also put in 8 cups of water- the result is a velvety broth and the whole broth needs to be seasoned; and (b) balances the chiles and jaggery.  Will make again.  Anonymous10/8/2019This is intense! It actually needs all that salt to balance out the sour and sweet. I was nervous when the dish tasted like bean-ey limeade, but once I added a little more salt and served it with the spiced oil assembly it was great. My family enjoyed it very much but I think I would tone down the sugar if I made it again.Sarah KrikorianOakland,CA10/2/2019I clicked the link because the mix of flavors (lime, ginger, salt, sugar) sounds very compelling, but one cup of sugar and FIVE TABLESPOONS SALT for one cup of lentils? This recipe is absolutely bonkers. I make dal and other lentil dishes fairly regularly and I find that 1 tsp fine sea salt per cup of lentils is usually just about perfect.\n\nHas anyone actually tried to make this as written?AnonymousMontreal9/20/2019Explore Bon AppétitDalIndianSouth AsianAsianPigeon PeaBeanVegetableTurmericHerbs & SpicesSerrano ChileChileCurry LeafRiceRice & GrainsMainSideDairy-FreeVeganVegetarianGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Vivek Surti"]}