{"id": "9994dce099b2f800e1bc2f7d8a6afdb7", "url": "https://www.bonappetit.com/story/actually-good-pina-colada-recipe", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "I’m Only Drinking Piña Coladas From Now On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Only Drinking Piña Coladas From Now OnAn actually good recipe for the much-maligned drink.By Carla Lalli MusicJune 6, 2019FacebookTwitterEmailPhoto By Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Just because there are lots of bad piña coladas out there doesn’t mean piña coladas in general are bad. Those kinds of overgeneralizations can really get in the way of life’s enjoyments. But I get it. Bad piña coladas are all bad in the same way: too sweet, too watery, not rummy enough. Proper piña coladas are perfect and amazing. They are joyful and inebriating, amusing and playful, summery and photogenic. And the right number of them that you should drink is one.Want this letter before it hits the website? Sign up for our newsletter!Our piña colada recipe fixes everything. It has the right pineapple-to-coconut ratio, which is to say that there is lots of frozen pineapple and not that much cream of coconut (half of a pineapple goes into four drinks, and only 6 ounces of sweetened coconut milk, plus 2 ounces unsweetened). We’re so serious about this drink tasting like an actual piña, we tell you to cut, then freeze an excellent pineapple yourself, and we dial up the fresh lime juice to play up the pineapple’s tartness and cut through the sweet stuff.But the real test of an expertly made piña colada is the texture. A disappointing one will be loose and crumbly, with visible ice chips, or watery, with long icy shards that melt instantly. But this blender-whipped concoction slow-motion cascades out of the pitcher as fluffy, dense, aerated slush.Photo by Alex LauThe only way to get that penguin-friendly consistency without a slushy machine is to blend, then freeze, then re-blend the partially frozen pineapple-rum-coconut-ice mixture. It might sound fussy, but it’s actually doing something. When you put the blended concoction back into the freezer, you encourage the ice crystals to link back up again, suspending the alcohol and sugar and fruit mixture in the process. Reblending whips some air into the drink and smooths out the crystals, but because the mixture is so icy-cold the second time around, it won’t warm up enough in the blender to get watery. That’s how you get that pillowy, smooth, creamy cocktail, which you can gild with a cherry, a cocktail umbrella, or one of those tiny, neon-colored plastic monkeys that hang off the side of the glass. I love those.Brad Leone, video host of It’s Alive and the author of this recipe, recommends an extra splash of rum poured right over the top. Since you’re only having the one, there’s really no harm in taking his advice.Get the recipe:BA's Best Piña ColadaFreezing fresh pineapple definitely makes the best impact flavor-wise in this piña colada recipe.View RecipeExplore Bon AppétitCarla NewsletterSummer DrinksRumPineappleRead MorerestaurantsWhen It’s Too Hot to Think, I Need a PainkillerBy Alex BeggsrestaurantsWe’re All Adults Here—Stop Expecting Plastic Straws in Your DrinkBy Elyse InamineLifestyleThis Is My Non-Alcoholic Drink of the SummerBy Christina ChaeyLifestyleWe'll Be Drinking Co-Fermented Wines All Summer LongBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-06", "author": ["Condé Nast", "Carla Lalli Music"]}