{"id": "99974c5ef08299041b0a308a80ecba46", "url": "https://www.bonappetit.com/story/quarantine-enchiladas", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "All Jimmy O. Yang Needs in Quarantine Is His YouTube Abuela and Carniceria 21 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureAll I Need in Quarantine Is My YouTube Abuela and Carniceria 21I’ve always loved enchiladas—but I never thought I could make them myself until Doña Ángela inspired me to check out my local Latin market.By Jimmy O. YangApril 8, 2020FacebookTwitterEmailPhoto by Jimmy O. Yang FacebookTwitterEmail“Hola, mi gente” is my new favorite greeting. It’s the intro from a series of YouTube videos, De Mi Rancho a Tu Cocina, that I haven’t been able to stop watching since it debuted last August. (Yeah, long before the quarantine. I’m an O.G. Rancho fan.) The star of the show is Doña Ángela, the gentle Mexican abuela I’ve never had. In it, she teaches 2.5 million viewers and counting how to make traditional Mexican food from her tree-filled ranch in Michoacán.In each video, Doña Ángela lays out fresh ingredients on a table in her rustic, open-air kitchen that actually looks more like a rocky ledge. “Poquito sal,” she says as she douses a fistful of salt into a beautifully saucy plate of pollito enchilado, presumably made from one of the chickens that was pecking around in her yard moments before. I learned the meaning of the word sabrosa (tasty) from religiously watching these videos. Abuela makes it look easy.I never grew up eating Mexican food, but it has since become one of my favorite cuisines of all time. I used to horf down two cheese enchiladas at Los Tacos in West Hollywood every week after my acting class, and back in those days, I could only afford to eat out once a week—so that was it. I’ve since expanded my horizons, but the enchiladas from Los Tacos still have a very special place in my heart, especially after 2 a.m. when I’ve had a healthy dose of alcohol.But when it came to making my own Mexican food, I just didn’t know where to start. There’s some kind of mental block that happens when it comes to cooking something new. Maybe I was scared that being a non-Mexican means that I could never properly make authentic Mexican cuisine. Or maybe I was just too lazy, knowing it’s so easy to just go down the street and find amazing tacos anywhere in Los Angeles. I’d never touched a tomatillo or even seen a piece of uncooked carne asada in person. But everybody is a virgin until they’re not. And now, stuck in my house for the foreseeable future, I had to step my game up. Luckily, I had Doña Ángela to help me.A couple days into the quarantine, I drove down to my local Trader Joe’s, hoping to score some fresh meat and veggies. But the Joe’s had a line out the door, like people were waiting for bottle service and a Kardashian appearance at the 1OAK on the Sunset Strip on a Saturday night. As a man of principle, I have always refused to stand in line for any club, and I was definitely not about to stand in line for a head of lettuce at Trader Joe’s. So, I started driving back home empty-handed, ready to eat ramen packets for the foreseeable future.Then, through the cracked window of my Jeep, I saw what seemed to be a mirage in these deserted quarantined streets. It was a sign I’d seen a thousand times but never been quite sure what it meant: Carniceria 21. Suddenly I heard my YouTube Abuela's voice in my head. Carne. It meant meat! So a carniceria was probably...some kind of a meat market or butcher shop? Wait, could this be the antidote to my future ramen marathon? Lo and behold, there was no line. No people wrestling for toilet paper. This was the answer! I pulled up to the empty parking lot, which in L.A. is a miracle in itself.Stepping into Carniceria 21 felt like stepping into Quarantine Shangri-La. The market was fully stocked, with only a few other patrons roaming the aisles. The butcher had a cornucopia of fresh and perfectly-marinated meats. I filled my basket with a pound of carne asada flap steak and two pounds of chicken thighs, and for the first time in my life, I even dared to ask the butcher for some queso fresco. I grabbed a stack of Guerrero tortillas and a handful of chile guajillo, one of Abuela’s favorite ingredients. I’d seen her use it in almost every dish, from her bright red enchilada sauce to her pig’s feet. I could do this too.As I was checking out, the cashier lady held up my bag of chiles with a quizzical look on her face. “Chile guajillo?” She seemed to want to make sure I didn’t buy these by mistake, since I must’ve been the first Asian brother to buy chile guajillo at Carniceria 21. Little did she know, I was a huge fan of De Mi Rancho a Tu Cocina. I nodded confidently, knowing that this simple question at the checkout line meant that I was for sure buying something legit. This Asian dude was about to be losing his Mexican culinary virginity tonight. Or in more subtle terms, popping his tomatillo.All stocked up and ready to make some enchiladas!\nPhoto by Jimmy O. YangBack at home in my shiny stainless steel indoor condo kitchen, which looks nothing like the one on De Mi Rancho, I made my first attempt at chicken enchiladas. I shredded my chicken thighs with two forks and blended my chile guajillo into a delicious, fiery enchilada sauce just like I had seen in the YouTube videos. I made it again the next night, improving the consistency of my sauce by adding chicken broth and deseeding the chiles. Then I, uh, made it again the next night. Okay, I ended up eating enchiladas five nights in a row. I was like a caveman who just discovered fire. I couldn’t believe I’d never tried this before. With the right ingredients, it was all so easy.So instead of feasting on ramen packets during this quarantine, I’m thriving. I’m learning a new cuisine, growing as a person, and growing rapidly in weight. I’ve since ventured to some veteran moves like pollo de caldo, carne asada tacos, and cheesy chile rellenos. All thanks to the beautiful local carniceria and the unlimited amount of great YouTube home cooking videos out there. Turns out Abuela was only the beginning; since then, I’ve been studying up on Adam Liaw’s diverse Asian dishes, Gennaro Contaldo’s enthusiastic Italian cooking, chef Wang Gang’s spicy Sichuan food and even Cowboy Kent Rollins’ latest outdoor cast-iron adventures. Your boy is ready to take on the entire culinary world.And whatever I need, there’s a local market where I can find it—the selections as vast as the channels of YouTube. Never again will I wait in line at the big box supermarkets during this quarantine. Instead, I’ll take an easy trip to the Chinese Ranch 99 markets, or the H Mart or Cal Mart in Koreatown for fresh seafood and Asian condiments. I’ll go to Mitsuwa or Nijiya for dashi and Japanese arabiki sausages, to Tehran Persian Market for a pinch of saffron and Sadaf sumac. And because most of these markets are family-owned, I will be happily supporting local businesses at the same time.Consider this my personal renaissance. I might just become the new quarantine Iron Chef.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-08", "author": ["Condé Nast", "Jimmy O. Yang"]}