{"id": "999baf2aad32d0ab190577478ff680e6", "url": "https://www.bonappetit.com/story/picky-eaters-secret-ketchup-sauce", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "No Picky Eater Wants to Eat Broccoli—Until You Add Ketchup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNo Picky Eater Wants to Eat Broccoli—Until You Add KetchupHow a throw-together pantry sauce became Deb Perelman’s secret weapon.By Deb PerelmanFebruary 19, 2019FacebookTwitterEmailThe sauce on these meatballs is a winner brushed on pork chops or chicken wings too.Photo by Alex Lau. Food styling by Susie Theodorou.FacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.Of all the things I expected to happen in the realm of food once I had kids—a sharp uptick in Cheerios, peanut butter and jelly sandwiches, chicken tenders, and macaroni and cheese—broccoli was nowhere on that list. I ate it growing up (defrosted, steamed) but not with any enthusiasm. When I began cooking on my own, I was far too interested in leafy greens, broccoli rabe, and cauliflower for ho-hum broccoli trees to ever take center stage in my kitchen.This changed when I got pregnant with my first child and my craving for iron-rich green vegetables—and especially broccoli—was constant. An attempt to recreate a cousin’s broccoli slaw—thinly sliced raw florets tossed with almonds, dried cranberries, and a shallot buttermilk ranch—led to my eating the entire giant bowl standing in the kitchen that day. This recurred many, many times over the course of my pregnancy. I joked that my son would be at least 25 percent broccoli by the time he was born, and sure enough, it was the vegetable he took to the most as a toddler. His younger sister is (thankfully) no different, and so I’ve gone from being a person who probably bought broccoli a single time in the decade before I had kids to buying it twice a week. I could get a Ph.D. in broccoli.I also make a whole lot more meatballs than I ever expected to as a parent—and not just the kind that swim in marinara sauce on top of spaghetti. Ground meat plus lots of seasonings has proven to be a useful formula in my weeknight cooking, and meatballs also happen to make great leftovers. So it was only a matter of time before I thought to combine our family’s favorite vegetable and protein in a single sheet pan dinner.Illustrations by Hisashi OkawaInspired by tsukune, the Japanese grilled chicken meatballs, I recently made a batch filled with scallions, ginger, garlic, a bit of panko, and toasted sesame oil and roasted them on a single sheet pan with broccoli florets and stems. I made a bright ginger-scallion relish for drizzling over and served it all with a side of brown rice for what I was sure would be a dinner home run. Instead, both children loudly expressed their displeasure and demanded ketchup to make it palatable.Ketchup?! I’m not someone who finds America’s favorite distantly vegetal condiment appalling. I rather like it on fries and burgers, and I don’t expect my kids to eat chicken tenders with Sriracha (yet). But broccoli and meatballs and rice with...ketchup? Under my roof? Do I have to?It turns out they were onto something. I remembered that tsukune are often served with tare, a thick and glossy soy-based sauce with teriyaki vibes. So the next time I made the meatballs and broccoli, I served them with a sweet-sour sauce I whisked together from ingredients I had lying around, such as Worcestershire sauce, soy, honey, and...(drumroll)...ketchup! This did the trick with the kids, but I was surprised to find myself won over too—the meatballs are totally better this way. It turns out this was an instance in which my kids’ sometimes ridiculous tastes were, for once, a stroke of deep culinary genius—but don’t tell them that.Get the recipe:Sheet-Pan Chicken Meatballs and Charred BroccoliThis weeknight dinner takes its cue from Japanese grilled chicken meatballs (tsukune), and the glossy, sweet-and-sour sauce that comes with it.View RecipeExplore Bon AppétitChickenBroccoliCooking For KidsWeeknightPicky Eaters’ ClubRead MorecookingThis Garlic Bread Is the Secret to Converting Bean HatersBy Deb PerelmancookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-19", "author": ["Condé Nast", "Deb Perelman"]}