{"id": "999bfeb1f09baee928a0a41db6405d66", "url": "https://www.bonappetit.com/story/margaret-cho-loves-kogi", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Roy Choi’s Korean Tacos Are Margaret Cho’s American Dream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureRoy Choi’s Korean Tacos Are My American DreamFor actor and comedian Margaret Cho, fusion is the finest form of flattery.By Margaret Cho, as told to Sasha LevineFebruary 13, 2020FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailBack in the ’70s my parents operated a little coffee shop in Japantown in San Francisco. It was attached to a bowling alley and arcade, and it’s where everybody went to get quarters for video games. That, and our bulgogi cheesesteak sandwiches. My parents started making them because they had the ingredients and they were going to make bulgogi anyway. And then it became the most popular item on the menu.That sandwich was my first experience with fusion, and I’ve been obsessed with the idea ever since. Sometimes it doesn’t work. But I love an attempt. Blending different culinary signifiers, whether that’s tortillas and kimchi or a burrito and Indian food, and putting them together in a way that turns them into something entirely new and exciting—that’s very American. It’s the literal melting pot!Kogi all set up at its West L.A. location.\nPhoto by Ren FullerThat’s what I thought about when I first tried the kalbi taco from Kogi, Roy Choi’s Korean taco truck in Los Angeles. It was the early days for food trucks using social media to tell fans where it was going to be in the city. It was this new world where you had to track it down, and it became this very prized thing that everybody was after. I never even considered it a possibility.Then I tried the taco, and it was perfect. So luscious and really homey, but also very fresh and light. There were so many things happening: The familiarity of the iconic L.A. taco, the Korean tradition of wrapping food, the falling-apart short rib that almost tastes like barbacoa, the complementing sweetness of the corn tortilla. It made so much sense, on so many levels. I became obsessed with Roy Choi and all of his different restaurants after that first bite.The short rib (aka kalbi) taco from Kogi.\nPhoto by Ren FullerNow you can find Korean tacos everywhere. The success of the trend is really significant. It charts the immigrant experience: You come, you settle, you try to figure it out. First you can’t get your own food everywhere. Then you can get it everywhere. It’s no longer so foreign to Americans. And that’s so great. Also, Koreans can be self-isolating, so it’s a big deal for us to really assimilate. The tacos demonstrate how those old feelings Koreans brought with them to Los Angeles in the 1960s are fading, and a new spirit is coming in. It took us a couple of generations, but here we are.Korean tacos are more than just food. They’re more than fusion. It’s about having the freedom to take your culture and the cultures you’re growing up around and blend them together. It’s really about coming home to America.Margaret Cho is a Grammy- and Emmy-nominated actor, comedian, and singer-songwriter who lives in Los Angeles.Want More Stories From Taco Nation? Right This Way...It’s Time We Give the Mexican Combo Platter the Credit It DeservesDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Cooking in the Midst of a Border Crisis Is About More Than SurvivalSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayWhy Are H-E-B’s Flour Tortillas So Dang Good?And much more!Explore Bon AppétitTaco NationLos AngelesCelebritiesFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Margaret Cho", "As Told To Sasha Levine"]}