{"id": "999e67a81dbfaa5c7046401508ea70a8", "url": "https://www.bonappetit.com/recipe/swiss-chard-tahini-dip", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Swiss Chard–Tahini Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueSwiss Chard–Tahini DipBy Maydan, Washington, D.C.August 14, 20184.4(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintIf you love hummus or baba ghanoush, this dairy-free dip will become a new favorite. Just make sure you have plenty of warm flatbread to scoop it all up. This recipe is from Maydan in Washington, DC, our No. 2 Best New Restaurant 2018.IngredientsMakes about 2½ cups2bunches green-stemmed Swiss chard (about 1½ lb.)⅔cup extra-virgin olive oil, divided, plus more5garlic cloves, finely chopped½cup tahini⅓cup fresh lemon juiceKosher saltToasted flatbread and lemon wedges (for serving)PreparationStep 1Remove ribs and stems from Swiss chard leaves and finely chop. Tear leaves into small pieces. Set both aside separately.Step 2Heat ⅓ cup oil in a large pot over medium-low. Cook reserved ribs and stems, stirring often and adding a splash of water if they start to brown, until tender, 5–7 minutes. Add garlic; cook, stirring, until fragrant, about 1 minute. Add reserved chard leaves by the handful, letting them wilt before adding more; cook, tossing, until all the leaves are wilted and tender, 10–12 minutes total. Let cool. Squeeze excess liquid from mixture into a measuring glass. (You should have about ½ cup liquid.)Step 3Place Swiss chard mixture and 1 Tbsp. cooking liquid in a food processor and add tahini, lemon juice, and ⅓ cup oil. Season with salt and process, adding more cooking liquid if needed, until dip is creamy and only speckles of chard remain. This could take up to 5 minutes. Season with more salt if needed.Step 4Transfer dip to a serving bowl and drizzle with more oil. Serve with flatbread and lemon wedges.Step 5Do Ahead: Dip can be made 3 days ahead. Cover and chill.How would you rate Swiss Chard–Tahini Dip?Leave a ReviewTell us what you thinkReviews (14)Back to TopTrianglePerfect on fresh bread and great match with champagne.cindilleParis, France3/24/2022Excellent and so easy. CindySeattle, WA7/22/2021Loved this dip! Did not find it to be *that* labor intensive, like other commenters, but that might just be me. I did also add extra lemon juice and a couple tablespoons of water, because the tahini flavor is definitely strong. Excellent with crunchy bell peppers and cucumbers.MelanieSt. Louis, MO6/1/2021This is a great recipe but needs some slight adjustments to make it perfect for my family. We had no issues with eh tahini flavor but it definitely needed more spiciness for us. We also swapped the chard for a mix of spinach and kale which turned out great. I think we will add some fresh jalapeños and garlic next time but we are definitely making this again!AnonymousWashington, DC1/3/2021Interesting dip, but the tahini is definitely overpowering. Somehow ended up with a bitter flavor. I might try to add in some feta to mellow it out. I'd use half the amount of tahini next time.karminomadaCuyahoga Falls, Ohio8/15/2020Amazing!! I was kinda scared it would have that green grassy taste, so I used a little less chard, but I am here to say: do not be afraid! Use all the chard! This dip is sooo good & doesn't taste green if ya know what I mean! If you think it's not flavorful enough, add more lemon/salt! I could see getting wacky and adding chickpeas, making it some sort of hummus crossover.. hmmjlamms27Wisconsin5/26/2020I only made a small amount as I had half a bag of spinach to get rid of - but can't wait to make in larger quantity! I think any greens will work. So for those saying it's too labor-intensive, use spinach or other soft green (or even herbs!) next time!AnonymousUK5/12/2020Absolutely delicious! I added just a dash of acv to the chard while I was cooking it and added a little raw garlic to the processor to add a little more bite and acidity. I will definitely make this again Chelse.ROakland CA 1/6/2020Really impressed and pleased with this recipe. Came together quickly on Sunday night and has made my Monday 1000x better. Matched with some Mary Brown's crackers and I'm a happy lady. Added an extra 1/4c of lemon as I needed a lot more acid, but that is dependent on the lemons you're using and the time of year. Saved my swiss chard from the bin on it's last day of use! Will try with other wilting greens that end up in my veggie drawer, I imagine it'd be great with any hearty green.Anonymous8/12/2019Lovely! Use more lemon than you think, otherwise it's too tahini heavy but I prefer things more acidic so it could just be me. The swiss chard isn't that time intensive, the whole thing took under 30 mins. Anonymous10/17/2018I loved it! Incredible creamy texture. Sure, it takes some time to soften the stems, but during that time I chopped garlic, squeezed lemon juice, and measured tahini. I didn't really squeeze that much liquid from greens ultimately, and it turned out great. Will make again and possibly add some chile. alexbeggsBA.com 9/30/2018I found the tahini taste too strong, I would have halved it with something else to make it a bit lighter. Also, the consistency was a bit too thick for a dip, but maybe this was just me not adding enough chard liquid.AnonymousOxford, UK9/25/2018Positives: healthy. Negatives: labor-intensive, only moderately flavorful.303249/12/2018Great! A little labor intensive with the chard...but it reads as more time-consuming than it actually is.  A nice change of pace from other tahini-based dips, and I felt better about myself bc of the greens. I ended up using quite a bit of the squeezed out liquid and it maintained a nice consistency. AnonymousHouston, TX8/30/2018Explore Bon AppétitDipMiddle EasternSwiss ChardLeafy GreensVegetableTahiniCondiments, Sauces & PastesLemonCitrusFruitFallQuickEasySnackDairy-FreeVeganVegetarianKetoHealthyishThanksgivingSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Maydan", "Washington"]}