{"id": "99ae42656ccba021cffd9af932a80e1a", "url": "https://www.bonappetit.com/story/best-baking-olive-oil", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "What Kind of Olive Oil Should You Use in an Olive Oil Cake? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Kind of Olive Oil Should You Use in an Olive Oil Cake?Think like Goldilocks.By Antara SinhaOctober 12, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.We love oil-based cakes. Love to bake them, love to eat them, love to share them. They’re the ticket to stress-free, reliably moist, and super tender desserts, and they usually can be made without having to cream butter and sugar together. (Such a hassle!) Often, they’re as simple to assemble as stirring together your wet and dry ingredients and popping into the oven.And when it comes to oil-based cakes, olive oil cakes will always have a special place in our hearts. They’ve got everything we love about this no-fuss style of cake with the added bonus of the fruity, grassy flavors that come from good quality extra-virgin olive oil. Typically, citrus such as orange zest or lemon zest is added to accentuate the fruitier notes of the oil used. They’re usually a little denser than your average birthday cake and have a tender crumb that will stay moist even after sitting on your countertop for a couple days, making them perfect for gifting. But all this talk of olive oil cake begs one very important question: What kind of olive oil should you use for baking, anyway?The short answer: nothing too pricey, nothing too cheap, but somewhere in the middle, Goldilocks-style. You definitely want an olive oil with “extra-virgin” on the label, but you don’t have to shell out for fancy-shmancy single-estate stuff. While we’re huge fans of complex, aromatic olive oils that boast peppery, herby nuances (we love the ones made by Brightland), it can get expensive when recipes call for 1½ to 2 cups of olive oil for one cake. Brightland Olive Oil Duo$74 at BrightlandOn the flip side, cheaper bulk supermarket brands are often very processed and can be too neutral and bland to lend any real flavor. If there are any unpleasant flavors or smells you’re not a fan of in the oil, baking it into a cake will only put those flaws front and center. Similar to cooking with wine, the general rule of thumb should be to cook with an olive oil you would already reach for as a finishing oil, whether to dunk bread in, drizzle over salads, or to top vanilla ice cream.Mina Stone, author of Lemon, Love & Olive Oil, recommends in her cookbook to take the extra time to find a favorite, reliable brand you enjoy cooking with—she’s partial to Greek-origin olive oils.Lemon, Love & Olive Oil$40 $36 at Amazon“Good Greek olive tastes like heavy cream and has a clean finish. It smells even and clear—without the rancid undertones that are common in blended and old olive oils,” she writes. “Middle Eastern and Greek grocery stores are a great place to buy olive oil; they typically have large tins of high-quality oil at a good price. If you are at your local grocery store, try to find extra-virgin olive oil that is from one particular region (not a blend).”Time to get baking:Super Lemony Olive Oil CakeWhen life gives you lemons, make Mina Stone's irresistibly moist and zesty olive oil cake. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-12", "author": ["Condé Nast", "Antara Sinha"]}