{"id": "99ba1b479c4d504f381849da4064ff73", "url": "https://www.bonappetit.com/story/frozen-greek-yogurt-blackout-pie", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "This Frozen Greek Yogurt Blackout Pie Is Here to Dethrone Ice Cream Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Frozen Greek Yogurt Blackout Pie Is Here to Dethrone Ice Cream CakeIt's got a smooth, chocolatey filling and a crazy-good chocolate graham cracker crust.By Amanda ShapiroOctober 2, 2018FacebookTwitterEmailPhoto by Chelsea Kyle,  Food Styling by Drew Aichele, Prop Styling by Beatrice ChastkaFacebookTwitterEmailCan we all just admit that ice cream cake is bad? I’ve stood firm on this position my whole life aside from a brief period in early adolescence when the only socially acceptable birthday cake was a Carvel ice cream variety. But, even then, I knew: No one actually enjoys eating frozen cake or frozen icing. (Note: My colleagues all vehemently disagree with me, but I've been waiting my whole life for this fight). You know what doesn’t suck? Frozen pie. And you know what’s dare-I-say better than an ice cream pie? This frozen Greek yogurt pie. Are you with me? Good.Back in August, I tasked senior food editor and very good sport Chris Morocco with making a frozen pie out of Greek yogurt. I don’t know why I did this; it was hot out and I was eating a lot of Greek yogurt at the time. He took my challenge, marinated on it until I was sure he forgot, then he whipped up the best healthyish dessert I’ve eaten since the Great Gluten-Free Carrot Cake of Spring 2018.Essentially this pie is made from full-fat Greek yogurt and melted chocolate in a chocolate-graham-cracker crust. It’s cold, creamy, sweet, and just tangy enough to remind you that those probiotics are working.When I first asked for this recipe, I didn’t realize how tricky it would be to get dairy to freeze smoothly, especially yogurt, because any water content in the dairy will cause it to get icy when chilled. This is why most froyo is made with tons of stabilizers and gums and stuff, but Morocco found a better solve: He put some extra fat in the yogurt in the form of olive oil (you won't taste it!), and he made a quick meringue—three egg whites whipped with a bit of sugar—which he folded into the yogurt mixture before popping it in the freezer. The oil keeps the pie creamy, and the meringue keeps it light. Together, they conquer all the frozen yogurt problems that can come your way. The final result is a pie that tastes totally decadent. The only hint of health is that yogurty tang, which you can adjust to your preference by brand (I find Fagé to be the mellowest, Chobani the most tang-forward, and Wallaby somewhere in the middle).The lightly sweetened yogurt that gets served on top might seem excessive (yogurt on yogurt, really?), but it delighted the people who ate it when I made it. In fact, I should’ve doubled the topping because everyone went in for more.And I can’t leave without telling you about that crust. I admit it that I was dubious about the graham crackers, which I generally think of as food for toddlers or vehicles for S’mores. But blended with oats, cocoa powder, and melted butter, they produced perfectly salty-sweet crust—one of the best I’ve eaten in a very long time.Sometimes dessert baking is stressful if you're worried about a whole cake or batch of brownies going stale. But this pie can hang out in the freezer for weeks as long as it’s well wrapped; just thaw your slice for ten minutes or so before eating. In short, this pie made me really happy. I’m going to make it a lot. It’s going to be my official house pie. No ice cream cakes allowed.I only have pies for you:Frozen Greek Yogurt Blackout PieThis no-bake pie is incredibly easy to make and will keep for over a week in the freezer.View RecipeExplore Bon AppétitHealthyishHealthy DessertsGreek YogurtPieFrozen DessertGraham CrackerOlive OilYogurtRead MoreLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-02", "author": ["Condé Nast", "Amanda Shapiro"]}