{"id": "99c6529e285b72cd3120b001f5f05ce7", "url": "https://www.bonappetit.com/story/same-mural-every-red-sauce-joint", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Art Critics Weigh in on That Same Mural You See in Every Red Sauce Joint | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsArt Critics Weigh in on That Same Mural You See in Every Red Sauce JointAs they say, “the worse the art in restaurants, the better the food.”By Sarah CasconeApril 16, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.Sparkling sky-blue body of water? Check. Rolling hillsides? Check. Rounded archways with marble columns? Check and check. This is Italy as viewed through rose-colored glasses, and it’s likely painted right on the wall at your favorite red sauce joint—including right here at Il Cortile in New York. Like the menu, authenticity isn’t the number-one concern with these murals—which somehow, no matter where they are in the country, all seem to recite the same visual language. They’re not meant to be museum-quality, but regardless, we asked a few particularly savvy art world insiders to explain the phenomenon—and weigh in on this very particular aesthetic.Ben Davis, national art critic, Artnet News“I think the kinds of murals in Italian restaurants represent ‘Italianness’ distilled to this really easily digestible, magical, nostalgia thing—which is how this landscape has been used since the 17th century at least. This art fits very well with the American version of Italian food. I mean, Italians find spaghetti and meatballs totally alien, so it’s fitting that it be eaten beneath murals that are very much American remixes of an idea of the Italian landscape.”Jerry Saltz, senior art critic, New York Magazine“Whatever type of restaurant I may go to—Italian, Korean, Japanese, Chinese, Ethiopian, French, Spanish, Indian—they all have some sort of pictures and paintings of the place being conjured. Taste involves memory, and memory involves the imagination—the ‘magic words,’ incantation of place, period, style, etc. And maybe it’s easier—and more politically correct—to render a landscape than the types of people from a given place?”At New York’s Il Cortile, the ideal countryside villa comes with a very extra garden.\nPhoto by Chelsie CraigXavier F. Salomon, chief curator, The Frick Collection, New York City“Both the actual landscape and the painted one are fundamental in Italian history and culture. The combination of Tuscany/wall paintings seems to be fixed in people’s minds, so any Italian restaurant is designed to look like a Medici palace or villa. I find these artworks, generally speaking, rather harmless. I always think of the Italian art historian Federico Zeri, who used to say ‘the worse the art in restaurants, the better the food.’ So I love restaurants with bad art!”Julia Wolkoff, art history editor, Artsy“The painters of lavish frescoes in Roman and Pompeiian villas delighted in constructing landscapes—fantastical gardens or futuristic cities—as pleasurable means of trompe l'oeil escapism. But as a patron at a red sauce restaurant, have you ever truly felt transported by these faux frescoes? That seems to be their purpose, yet I always remain keenly aware of chips in the dinnerware, dirt in the cracks of the floor tiles, or other gritty markers of dining in New York City. That said, would I feel comfortable eating at a red sauce restaurant that didn't have such decoration? Probably not!”Sarah Cascone is a senior writer at Artnet News.Explore Bon AppétitRed SauceItalian AmericanRestaurantsNew YorkRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Sarah Cascone"]}