{"id": "99ccaf26c7a5b30e29823b72f64f477b", "url": "https://www.bonappetit.com/story/how-to-knead", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "How to Knead Dough and Why It's Important When You're Making a Yeasted Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Knead Dough Like You're in ChargeAnd why kneading matters in the first place.By Sohla El-WayllyApril 13, 2020FacebookTwitterEmailPhoto by Michelle HeimermanFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.You’re going about your business, baking your way through BA’s Best Sandwich Bread, or Babkallah, or my new recipe for Cinnamon-Date Sticky Buns, and you get to the direction that instructs you to knead for an inexplicable amount of time, with no indicator of how to do it—as if you’ve kneaded a million times before. And then you remember that just last week, you made focaccia that required no kneading at all.So what’s the point? And do you really need to do it for 10 entire minutes? I’m answering all of your kneading questions below:What does kneading do?Before you understand kneading, you’ve gotta understand gluten. When you mix wheat flour and water together, the proteins in the flour combine to form a gluten network. This structure is what gives bread dough the strength and elasticity to capture all the bubbles and burbles produced by yeast in order to grow fluffy, chewy, and light when baked.This magic happens all on its own, and for some breads (like focaccia) all you need is enough water and time to develop a strong gluten network. But other doughs, like the one for the Cinnamon-Date Sticky Buns, need some help to get there—and that help comes in the form of kneading.The amount of time you’re asked to knead the dough depends on its hydration level and the characteristics of the final product. When you knead you’re not only developing the gluten, but you’re also lining up those gluten strands into an orderly structure that’s strong and tight. Well-kneaded swirl buns will have a smooth surface and tight crumb, while no-knead focaccia is bumpy, with a wildly irregular cross section.Okay, so how do I do it?Kneading dough is as simple as pushing the dough away from you with the heel of your palm, folding it over itself with your fingers, and pulling it back. This repeated push-pull cross-knits the protein strands, developing a strong gluten net.Some recipes may tell you to knead on a lightly floured surface, while others specify a surface with no flour at all. It’s important to read the directions carefully because recipes are specifically formulated for a certain method. The wet, sticky dough in the Cinnamon-Date Sticky Buns, for example, is kneaded on an un-floured surface for a light and fluffy bread with a tender and open crumb.And how do I know when I’m done?A dough might start out lumpy and wet, but as you knead, it will grow smooth, supple, and springy—that’s how you know you’ve fully developed your gluten network and can stop kneading. Under-kneaded dough won’t rise properly because it doesn’t have the strength and elasticity to capture the gases produced by yeast—it'll bake up dry, crumbly, and dense.Always follow the visual cues in each specific recipe: If the recipe asks you to knead your dough until it passes the windowpane test (you can stretch the dough to be so thin, without tearing, that you can see light through it), then take it that far. But if your recipe instructs you to knead just until smooth, you won’t make a better bread through continued kneading. For most recipes, it’s hard to over-knead your dough by hand, but you do risk overheating it, and that could prematurely kickstart proofing.Follow the recipe and don’t be afraid to push your dough around a bit—you’ve gotta get that gluten in line.Ready for some practice?Cinnamon-Date Sticky BunsThese fluffy buttermilk-laced buns are filled with a cinnamon-scented date purée to capture all that gooey sticky bun glory without being overly sweet.View RecipeExplore Bon AppétitBasically BakingDoughRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Sohla El-Waylly"]}