{"id": "99da5d8c5482268c8964c771adc5ea7a", "url": "https://www.bonappetit.com/recipe/grilled-pork-shoulder-with-butter-vinegar-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Grilled Pork Shoulder With Butter Vinegar Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueGrilled Pork Shoulder With Butter Vinegar SauceBy Carla Lalli MusicJune 2, 20204.0(11)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis pork shoulder makes a case for grilling big hunks of meat over medium heat (as opposed to a roaring inferno), where they can get nice and juicy while you kick back at your grill, lazily turning the roast while getting some much-needed outdoor time. Lower and slower means it will cook through to ideal internal temperature without getting blackened on the outside, and you won’t have flare ups to frantically deal with. Remember: If you’re using a charcoal grill, a bed of medium-hot coals will gradually lose heat. You’ll need to replenish it at some point, ideally from a chimney of charcoal that you get started when the meat first hits the grill. About halfway through, throw some new glowing coals on the pile to keep things going.Ingredients4–6 servings1Tbsp. fennel seeds2Tbsp. dried oregano2–2½-lb. boneless pork shoulder (Boston butt)Grapeseed or other neutral oil (for pork)1Tbsp. kosher salt, plus more3chiles de árbol, torn in half, seeds removed if desired½cup apple cider vinegar½cup (1 stick) unsalted butter2Tbsp. sugarSpecial EquipmentA spice mill or mortar  and pestlePreparationStep 1Toast fennel seeds in a dry small skillet over medium heat, tossing often, until golden brown and starting to pop, about 3 minutes. Transfer  to a spice mill or mortar and pestle and let cool; coarsely grind. Transfer to a small bowl and mix in oregano. Place pork on a wire rack set inside a rimmed baking sheet and rub with oil. Season all over with 1 Tbsp. salt, then rub with spice mixture, packing it on. Let sit at room temperature 2 hours or chill, uncovered, up to 2 days.Step 2Bring chiles, vinegar, butter, and sugar to  a simmer in a small saucepan over medium-high heat; cook, stirring occasionally, until sugar is dissolved and sauce is reduced by about a third, about 5 minutes. Season with salt; cover and keep warm over low heat until ready to use.Step 3Prepare a grill for medium heat. Drizzle  pork all over with oil, then grill, turning every  5 minutes or so, until extremely, gorgeously browned and crisp and an instant-read thermometer inserted into thickest part registers 120°, 35–45 minutes. Continue to grill, brushing with sauce and turning not quite every minute (you’re going to see flare-ups, but don’t worry), until pork is glazed and shiny and temperature on thermometer has risen to 130°, 5–10 minutes more. Transfer pork to a platter and  let rest 30 minutes; reserve remaining sauce.Step 4Transfer pork to a cutting board and pour any accumulated juices on platter into reserved sauce. Return sauce to a simmer. Slice pork against the grain ¼\" thick. Arrange on platter, spoon some sauce over, and season with salt. Serve remaining sauce alongside.How would you rate Grilled Pork Shoulder With Butter Vinegar Sauce?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI was really set back by only cooking the pork to 130,  I have long defied the USDA's 160 degree minimum, but  I am a little uncomfortable pushing it down to 130.  Is there any basis for believing this is safe? AnonymousElgin, IL7/2/2021My husband is awesome at charcoal grilling, so he couldn't wait to try it.  It was awesome!  The char and the flavors of the butter vinegar sauce were excellent!   we have made it twice this summer and will surely keep it in the repertoire!pineapplediva3085Virginia10/4/2020Loved everything -- including the temp -- except the sauce.  Just too much fat for us, though the flavor of the chiles was killer. afmorgan53Colorado Springs, Colorado 8/21/2020Quite tasty--the burnished/crusted outside is the best part.  Next time I'll butterfly out the shoulder a little to get more crust and avoid having the outside be charred in order to get the inside to 130--as it was I ended up halving the pork shoulder partway through the grilling since the crust was forming well on the outside but the interior was still only 70. Thankfully even the bits that I overcooked were still very tasty since the fattiness of pork shoulder gives you more margin for error. I served it with cilantro-lime rice and plan on turning the leftovers into taco filling!Anonymous8/10/2020Like the plan but ending at 130 is a non starter for me.     I plan on continuing cooking off direct heat with a probe thermometer till the roast hits 150 with expectation of carryover to 160.   I may do this on gas rather than charcoal or wood so that the sauce and pork Star rather than smoke yankeefan2Nj8/7/2020I haven't quite perfected cooking the pork all the way through, it's come out under both times. But the sauce is to die for. I would recommend mashed potatoes, even though it's kind of a summer dish. It's heavenly. AnonymousDetroit 8/5/2020Pork from today's livestock and meat packing plants no longer presents a risk of trichinosis.  You're fine with a medium rare shoulder.  BA would not suggest a temperature that was unsafe.oliveoilFerndale, WA7/10/2020Amazing. A good meat / grill thermometer will be key here. The pork came out tender and juicy. The sauce was a decadent final touch. This was a “splurge” quarantine meal and one of the best we’ve had in a long time. Can’t wait to share this with friends and family. Tiffany ScolnicAustin, TX7/6/2020Absolutely delicious! It is definitely a make it again and the sauce was perfect on\n carrots.AnonymousRichmond;VA6/21/2020I saw this in our Magazine and had to comment about the final internal temp. of 130 degrees,this is what I grill my beef at for med.-rare steak( except for burgers). Pork shoulder cooked to this temp. is going to be under cooked and not safe.Raw pork shoulder? No thanks I`ll pass.booknbluesWoodland,Ca.6/15/2020Explore Bon AppétitPork ShoulderPorkMeatPorcini MushroomMushroomVegetableOreganoHerbs & SpicesSummerMainGluten-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Carla Lalli Music"]}