{"id": "99db22d555a8078c3bbba65ac4010c77", "url": "https://www.bonappetit.com/story/honey-mamas-cacao-nectar-bars", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Honey Mamas Cacao-Nectar Bars Have Replaced All the Other Chocolate in My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHoney Mama's Cacao-Nectar Bars Have Replaced All the Other Chocolate in My LifeWe're in a monogamous relationship now.By Emma MannheimerNovember 12, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailOf all the things listed in The Sound of Music’s inspired jam \"My Favorite Things,\" the one that always hits home for me is brown-paper packages tied up with string. Perhaps my Virgo nature is to blame? Regardless, this compulsive fascination with wrapping is why I prickled with pleasure the first time a Honey Mama’s cacao bar appeared in a friend’s hand, its cheerful blue label affixed to the hand-wrapped brown packaging.Perforated like a Kit-Kat but with three uneven segments, the bar within was a harmonious six-way marriage between Dutch-processed cocoa, raw honey, unrefined coconut oil, coconut meat, Himalayan pink salt, and Oregon-grown peppermint. 100 percent nutrient-rich and 1000 percent sublime, my first bite made clear that Honey Mama’s and I would be monogamous for a long time. Goodbye forever, other lesser chocolate bars.“Obviously, it’s all about texture,” says Christy Goldsby, Honey Mama’s founder and CEO. “I think every single one of these ingredients is about texture.” Goldsby attributes the bars’ extraordinary consistency—a velvety, pliable feel—to the way honey and coconut oil are whipped together for the base. Dubbed “cacao-nectar bars” (without cocoa butter, it’s not technically chocolate), you could liken the refrigerated goodies to brownie dough, truffles, or fudge. They are marvels of mind-melting decadence with the ambrosial mouthfeel of classic chocolate frosting.A towering stack of Honey Mama's.\nPhoto by Chelsie CraigGoldsby, a former baker, began experimenting in the kitchen in 2011 after a friend’s foray into raw foods. She sought to combine her culinary background with a newfound interest in health and started experimenting with raw honey, which has powerful antibacterial and anti-inflammatory properties. In 2013, Honey Mama’s launched its paleo, gluten-free, raw bars in Dutch, Oregon Peppermint, Mayan Spice, and Peruvian Raw. Six years in, CocoNoNut, Lavender Red Rose, Nibs & Coffee, and Ginger Cardamom have joined the lineup. From its homebase in Portland, Oregon, Honey Mama’s keeps bees in business, burning through 3,000 pounds of regionally sourced, raw wildflower honey weekly.Honey Mama's flavors don't pull punches. The Lavender Red Rose flavor steers clear of soapy with hints of pine from the forested coastal farm where the lavender is harvested, while the herbal greenness of cardamom is the perfect undertone for warming ginger in the Ginger Cardamom. Some of the flavors are made with rich Dutch-processed cocoa, others with acidic Peruvian raw cocoa. Several flavors feature sprouted almonds bits, but I go weak at the knees for those with shredded coconut.Finally, these bars rule because they’re appropriate at any time of day. Throw some in a morning smoothie or on top of oatmeal. Heck, get savory with them at dinner! Influencing DJ duo SimiHaze even endorsed the bars as the perfect road trip snack, #notanad! Goldsby herself sees the bars as comfort food, and one young zealot on the brand’s Instagram proclaims that the treat “tastes like yoga.” To each their own Honey Mama.Buy It: Honey Mama’s Bars from $5.99All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishhoneyChocolateShoppingSnackTrendsRead MorecookingThese Gluten-Free Chocolate Waffles Satisfy the Kid in All of UsBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-12", "author": ["Condé Nast", "Emma Mannheimer"]}