{"id": "99deec4ffa0746c31896cd70c2add2e2", "url": "https://www.bonappetit.com/recipe/margherita-pizza-beans", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Margherita Pizza Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueMargherita Pizza BeansBy Ali Slagle September 12, 20214.5(44)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintYou may already know and love Deb Perelman’s infamous Pizza Beans, which have a jammy, brick-red sauce with a marinara pizza vibe. This recipe gives pizza beans the Margherita treatment, swapping a cooked-down sauce for fresh tomatoes cooked just enough to bring out their full flavor. You can use pristine specimens or damaged goods alike: blistering small tomatoes brings out their sweetness, while simmering large, grated tomatoes is an easy way to remove their tough skins and (flavorless) excess moisture. —Ali SlagleAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Skillet$84 At AmazonBox Grater$13 At AmazonMicroplane Grater$16 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 Servings1lb. large ripe tomatoes215-oz. cans white beans (such as cannellini or butter), rinsedKosher salt, freshly ground pepper3Tbsp. extra-virgin olive oil, plus more for drizzling2pints cherry or Sun Gold tomatoes (about 1¼ lb.)4garlic cloves, finely chopped¼cup torn basil leaves, stems reserved, plus more for serving6oz. fresh mozzarella, thinly sliced2Tbsp. finely grated Parmesan, plus more for servingToasted country-style bread (for serving)PreparationStep 1Heat broiler. Halve large tomatoes crosswise (through the equator). Starting with cut sides, grate tomatoes on the large holes of a box grater into a medium bowl; discard or compost skins. Add beans and season generously with salt and pepper.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Heat 3 Tbsp. oil in a large ovenproof skillet over medium-high. Add cherry tomatoes; cook, shaking pan occasionally, until browned in spots, about 3 minutes. Add garlic; cook, stirring, until fragrant, about 1 minute.Step 3Stir in grated tomato mixture and reserved basil stems. Cook, stirring occasionally, until mixture is thickened and flavorful, 10–15 minutes. Taste and season with salt and pepper.Step 4Remove basil stems from pan; stir in ¼ cup basil leaves. Shake skillet to evenly distribute beans. Top with mozzarella and 2 Tbsp. Parmesan. Broil until cheese is melted and browned in spots, about 3 minutes.Step 5Spoon tomato beans over toast as desired. Top with more basil leaves and Parmesan and drizzle with oil. Season generously with more pepper.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Margherita Pizza Beans?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleVery easy and delicious recipe. The hardest part is grating the tomatoes which doesn’t take long at all. Second time that so have made this recipe and it does taste like Margherita pizza.\nIt is a hit in my house.MamaWHouston 10/6/2021Easy, riffable, cheap. This time, I mixed the Parm with some lightly oiled panko and herbs and topped it with that. Next time, I think it would be worth making beans from dried for this, since they are the bulk of the dish. NytashaOAKLAND CA9/27/2021I've been wanting to try this for at least 2 years now and after watching these perfectly cut lil videos y'all put together and just got the boost I have been needing to go for it. I think the way these video/instructables are the best way to learn for anyone and I can speak for anyone, we go back like seats in a Cadillac. Marc PowellTroy, TX. but really 817 DFW 9/21/2021I have been doing a Mexican-style version of beans with cheese on bread and it’s a scrumptious and gooey delight. As a pizza lover (who isn’t?) who also enjoys beans, this simple recipe is definitely the next version I will add to my collection.AnonymousNYC 9/21/2021So well done with video as you go along. Looking forward to making this lovely dish Esther 9/21/2021Holy Moly these were tasty. So filling and satisfying. Kids and adults alike would love this dish, and I do like that you can riff on it to make it your own. This will be on the regular rotation, I think it would work equally well with canned tomatoes in the winter for a reminder of summer to come. SarahBoulder, CO9/15/2021Followed the recipe exactly with butter beans. Was so good. Will def make again and will try cannelli beans. RudreshMontclair, NJ9/12/2021had a bag of tomatoes from my in-laws garden and some leftover crusty bread and this was perfect.\ndidn’t grate the tomatoes; quartered the smaller ones and chopped the bigger boys then added some tomato sauce i had in the fridge.. i improvised a bit but it really did taste like pizza in the end and it was delicious!jferleecalifornia 8/19/2021So good! I didn’t grate the tomatoes, just smashed and removed skins after they cooked. Worked out fine. Anonymous8/18/2021Explore Bon AppétitToastItalian AmericanAmericanTomatoVegetableWhite BeanBeanMozzarellaCheeseBasilHerbs & SpicesSummerQuickEasyOne-Pot MealsSnackNut-FreeVegetarianSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Ali Slagle"]}