{"id": "99df0104223bbf62111e4bee6d14e6f7", "url": "https://www.bonappetit.com/story/sach-paneer", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Sach Paneer Is the Taste of Home I've Been Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSach Paneer Is the Taste of Home I’ve Been MissingThere’s no substitute for my mom’s cooking, but at least I’ve found the perfect paneerBy Rachel GurjarApril 20, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Moving to New York from India meant leaving behind a lot of things that I took for granted—pani puri and all forms of chaat, rickshaws, my mom’s cooking, and fresh paneer. Paneer is an unaged cheese that’s made from curdled buffalo’s or cow’s milk and acid. Instead of melting, it holds its shape when heated, and it’s a preferred source of protein for South Asians who are vegetarians (I am not, I just love cheese!). Since I moved to the States, I have tried at least a half dozen brands, searching for paneer with the creamy, cloud-like texture and subtle saltiness like the kind I remember from home. One was too rubbery, another completely flavorless. Nothing came close—until I tried Sach paneer.Sach paneer is made in small batches using only ethically and sustainably sourced ingredients, beginning with organic milk from pastured cows raised on family-owned farms across Northern California. The quality of the milk really counts because Sach’s original recipe has only three ingredients—milk, vinegar, and sea salt—and it lends a sweet, rich creaminess to the cheese. Other flavors include habanero, which has just the right amount of heat, and turmeric, which is earthy with peppery mustard notes.I use paneer in Indian dishes like paneer tikka masala, saag paneer, and butter paneer masala, but I often switch it up and incorporate it into non-Indian recipes as well. I use it in tacos—sprinkle taco seasoning on cubed paneer, pan-fry in oil until golden brown, and then tuck the cheese into corn tortillas and top with red onions, green chutney, and lime. Or use the same spiced cubes to make a wrap with avocados, refried beans, rice, and lettuce. I top my salads with crumbled paneer that’s been marinated in harissa for an extra kick. To make the perfect summer picnic sandwich, I season paneer with salt and pepper and pan-fry in oil until golden brown, then thinly slice and layer on toasted sourdough with spinach, red and green bell peppers, cucumbers, and spicy mayo. You can dress Sach paneer up as much as you want, but ultimately it’s so good that it’s perfect in even the simplest of preparations.Suffice to say, I am hooked. Sach Foods is rapidly expanding into supermarkets nationwide, but until I can find it at my local grocery, I’ll continue to have it shipped straight to my door. You can buy blocks of paneer individually or as a sampler pack, but the subscription option ensures I can have a taste of home whenever I want.Photo by Emma FishmanSach Paneer$8 at Sach Foods$8 at AmazonExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Rachel Gurjar"]}