{"id": "99fddc671a286319bba8c0d6374d3965", "url": "https://www.bonappetit.com/story/sean-brock-sobriety", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Sean Brock on How Sobriety Changed the Way He Cooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSean Brock on How Sobriety Changed the Way He CooksThe Husk chef also has a serious self-care routine.By Christine Muhlke and Sean BrockApril 3, 2018FacebookTwitterEmailPhoto by William CrooksFacebookTwitterEmailTo say that Husk and McCrady’s chef Sean Brock is a changed man is an understatement as extreme as his former partying habits. Now sober for over a year, he has replaced his vintage bourbon collection with a vintage car, bought with the proceeds of his Pappy sale, and gotten into self-improvement on every level. His #selfcare could fill the entire schedule at a wellness conference, and the changes in the way he eats at home are influencing the way he cooks at his award-winning restaurants from Charleston to Nashville and, now, Savannah, Georgia. At January's Cayman Cookout, we asked Brock about his morning routine, as well as, shall we say, his spiritual routine. His responses have been edited and condensed. – Christine Muhlke, BA editor at largeI wake up thinking about breakfast. My whole entire career, I never had breakfast—no way. In the industry, there's this codependent tendency to not take care of yourself, to take care of everybody else instead. But now I look forward to breakfast every morning. It’s always the same: lots of diced fruits and berries with macadamia milk and Purely Elizabeth grain-free granola and a banana. Every morning. Like, even when I travel—if I'm in Savannah or Greenville, or wherever it is, I've got a cooler with all my stuff. You just feel so much better when you eat that light. I wish I'd known that 20 years ago. And kombucha? I'm telling you. My guts feel different. It’s crazy.Lunch is a salad with some sort of protein about 80 percent of the time. I rarely eat staff meal, but I do sit down and eat with my salad with my team. Dinner is almost always meat and vegetables, no gluten, only heirloom grains and little to no dairy. Every day I eat a Grab the Gold (chocolate peanut butter flavor), made here in Nashville, when I need a snack. I buy three cases of them at a time and portion them out when I travel so I have at least one handy.  I usually eat at least one apple per day, a few when they are in season. Before bed I either have a piece of chocolate or some Jeni’s ice cream for the dopamine, Low doses…It's been a year now since I got sober, and when that happens and you’re a chef, your cooking changes. It becomes not just about deliciousness; it's how you feel: Your soul, your body, and your brain. It pushes you to find new ways to get depth into cooking, because the food needs to match the mind and soul: simple, sharp, and tidy. It’s the idea of having these little tricks that allow you to put less components on the plate and add more flavor. The tricks come from my ever-growing pantry. We call it the “pantry of wonder.” It’s full of powders and potions that stop you in your tracks when you taste them for the first time.I want people to eat my food and gain energy and happiness, not\nstumble out the door and fall asleep on the way home.The clarity that comes along with my self-care routine allows me to stand in the middle of the kitchen chaos and remain peaceful and calm. I don’t second-guess my cooking anymore or push myself as hard as I used to, just for the sake of torturing myself. Flavors and techniques just sort of fall out of the sky now that I have more courage and confidence. I know that If I do the best that I can and focus on making the next right decision, I’m doing my part, and that’s all I can ask of myself. It’s also become very difficult for me to cook heavy food—unless of course it’s fried chicken or cheeseburgers. I want people to eat my food and gain energy and happiness, not stumble out the door and fall asleep on the way home.As for my self-care routine, I meditate as soon as I wake up, then a few times throughout the day, based on how I feel. I'm very, very, very in touch with my nervous system,  because your nervous system controls your brain. That’s why, when we’re nervous and we go into “fight, flight, or freeze” mode, we lose all reasoning. All the speaking engagements and demos I used to do? I don't remember any of it. Because I wasn't grounded; I was on autopilot.This year, I started seeing a functional neurologist because there was one spot in my back that was bothering me, and I couldn't figure out what was going on. I went to her thinking I was getting my bones cracked. And she was like, \"Oh, no, we're gonna start with your guts.\" That's where the grain-free granola comes in, and no dairy. No sodas. It makes such a big difference. It's frickin' crazy. If I’m like, \"I need some pizza! I haven't had pizza in forever,\" I'll eat a couple pieces of pizza and I'll feel like crap the next day. I get a gluten hangover.I also get acupuncture, reiki, and intuitive energy work therapy once a week, and I do NST, which stands for neurostructural integration technique. It's like a combination of Reiki and massage, working with your nervous system and muscles through your connective tissue to unblock the energy that gets stuck. I see a Reiki master and mindful living coach in Nashville named Ramona Reid who’s like my self-care angel. I also have a counselor/holistic therapist that I do EMDR and somatic experiencing with three times per month, as well as CES, or cranial-electro stimulation, which uses a small pulsating device and electrodes to readjust the brain’s waves. You can basically kind of pick the brainwave you want to work on, so if you want to, like, meditate, if you want to have energy, if you want to sleep, if you want to be more creative… Zzzzt! I've been doing it every day for the whole year.Oh, and I always keep lavender oil in my bag to keep myself grounded when I feel my nervous system becoming dysregulated. It brings me back so fast, like smelling salts.I've become obsessed with playing guitar—practicing scales, hunting vintage guitar parts and learning music theory—I just can't stop. I usually go to bed at, like, 2:30. I wish I didn't, but that's just the way it is. Some habits just aren’t going to change.Explore Bon AppétitHealthyishSean BrockChefsRead MorerestaurantsFood Nearly Killed Me. Then Food Saved My Life.By Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-03", "author": ["Condé Nast", "Christine Muhlke", "Sean Brock"]}