{"id": "9a11a68ca758440068e886b040a50606", "url": "https://www.bonappetit.com/story/singapore-noodles", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "How to Make Singapore Noodles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSingapore Noodles Are Best Eaten Immediately (Which Presents No Issues)Comfort me with rice vermicelli.By Hetty McKinnonJuly 14, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Sarah JampelFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When I was a teenager, I visited Singapore with my mother and her extended family on one of those classic ill-conceived vacations where every sight-seeing activity was laced with bickering and dissent. Stressed by the family drama, I consoled myself in food and found solace in our hotel’s sprawling buffet breakfast. This is where I met and fell in love with Singapore noodles.While named after Singapore, this dish didn’t actually originate there. It is believed to have been created in Hong Kong and is a fixture on restaurant menus serving Cantonese cuisine. My mother, who makes Singapore noodles often, humbly brags that hers is “silkier” than what we would find at restaurants. Singapore noodles are heavily seasoned in curry powder, which can create a mouthfeel that is gritty or grainy. Her not-so-secret “secret” is to bloom the curry powder in the oil, thus amplifying its flavor and coaxing it into a smooth texture, prior to adding noodles to the pan.While Singapore noodles is a tremendously satisfying dish traditionally eaten for breakfast or lunch, it also makes a quick and fuss-free dinner at my house. I always have a packet of rice vermicelli in my pantry (I love Kong Moon brand), specifically for this purpose. The other basic tenets of Singapore noodles are curry powder (any variety works but I prefer S&B Oriental Curry powder), vegetables, and scrambled eggs (traditionally, this dish also features protein such as shrimp, chicken or char siu, which I omit). You can use any combination of vegetables, making this a great fridge clean-out dish. Carrots, cabbage, zucchini, cauliflower, snow peas, or basically anything that can be thinly sliced and cooked in 3 or 4 minutes are all suitable.To start, soak 14 oz. rice vermicelli for about 8–10 minutes in hot tap water. While those soak, prep the rest of the ingredients. When stir-frying, it’s important to have your mise ready to go before you start cooking so that everything can be added to the pan quickly. Slice 1 medium onion (you can also use red onion or shallots here) and place in a small bowl. Finely chop 1 clove of garlic and add this to a large bowl along with your prepped vegetables: Julienne 1 pepper (any color) and 1 peeled carrot, then thinly slice 1 small head of broccoli (stem and all, after peeling the outer part of the stalk). Finely chop 2 scallions and have these ready too. Now, beat 4 eggs with about 1 tablespoon or so of water (just to loosen it up) and season well with salt.Heat a wok or large skillet on high heat, and then drizzle with neutral oil (about 1 tablespoon should do) and then pour in the eggs. Working quickly, scramble the eggs until they are just set (you can leave it in large chunks, no need to break it up into small pieces right now) and then remove from the pan immediately and set aside.Place the same wok or skillet back on high heat. Add about 1–2 tablespoons neutral oil and then toss in the onion, stir for 2 minutes or so, until softened. Add the garlic, all the vegetables, and season with salt. Stir-fry for 3–4 minutes until everything is crisp-tender (soft, with a bit of a bite). Remove from the skillet.Drain the vermicelli. Drizzle about 3–4 tablespoons oil into the hot wok/skillet and add about 2 tablespoons of curry powder (curry powders vary in heat, so use more or less, depending upon your preferred spice level). Stir the powder in the oil for 30 seconds, until fragrant and a shade darker, and then add the vermicelli along with a few good pinches of salt. Toss well (I use long chopsticks or tongs) for 4–5 minutes, until the noodles are well coated in the curry powder; if it’s dry, don’t hesitate to drizzle with more oil. Add the vegetables and egg back into the pan and use your chopsticks or tongs to break up the egg slightly, leaving some larger pieces too. Taste and season with salt and pepper and toss again until everything is well mixed. Remove from the heat and top with the scallions.Eat this immediately. If you’re feeling particularly indulgent, you can top with a few splashes of Maggi seasoning sauce, and some crispy fried shallots or toasted sesame seeds.Hetty McKinnon is a cookbook author, food writer, and creator of Peddler Journal. Her newest book is Family: New Vegetarian Comfort Food to Nourish Every Day.Explore Bon AppétitIt's That SimpleRice NoodlesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-14", "author": ["Condé Nast", "Hetty Mckinnon"]}