{"id": "9a14c6561177cdf76bd03816d001ca3c", "url": "https://www.bonappetit.com/recipe/spicy-braised-tofu", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Spicy Braised Tofu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueSpicy Braised TofuBy Christina ChaeyAugust 18, 20204.6(92)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrint“I never think twice about stocking up on a few packages of firm tofu,” says Christina Chaey. “On the night when I don’t want to spend more than 20 minutes on dinner, I whip up this riff on dubu jorim, a popular Korean side dish, and call it dinner. I pan-fry thick tofu slices in a skillet until golden, then quickly braise them in a salty-sweet-spicy soy sauce mixture until they’re steeped with flavor, ready for a simple side of rice and sautéed greens.”Ingredients2 Servings114-oz. block firm or extra-firm tofu, drained3Tbsp. soy sauce3Tbsp. mirin (sweet Japanese rice wine)1tsp. toasted sesame oil¾tsp. gochugaru (coarse Korean red pepper powder) or other mild red pepper flakes1scallion2Tbsp. grapeseed or vegetable oil, divided, plus more for drizzlingKosher salt1small garlic clove, finely chopped1tsp. finely chopped peeled gingerToasted sesame seeds and cooked rice (for serving)PreparationStep 1Wrap tofu in a clean kitchen towel and place on a rimmed baking sheet. Weigh down with a heavy object (a couple of heavy cans works well) and let sit 10 minutes. Unwrap tofu and slice in half lengthwise, then cut crosswise into 6 sections to create 12 squares.Step 2Whisk soy sauce, mirin, sesame oil, gochugaru, and 3 Tbsp. water in a small bowl to combine; set sauce aside.Step 3Trim dark green top from scallion and thinly slice; set aside. Thinly slice remaining white and pale green parts of scallion. Heat 1 Tbsp. grapeseed oil in a nonstick skillet over medium-high. Carefully add tofu in a single layer and lightly season with salt. Cook, undisturbed, until golden brown, about 5 minutes; turn over and cook until golden brown on other side, about 5 minutes. Transfer tofu  to a plate; reserve skillet (no need to wipe out).Step 4Heat remaining 1 Tbsp. grapeseed oil in reserved skillet over medium. Cook scallion white and pale green parts, garlic, and ginger, stirring, until softened but not browned, about 1 minute.Step 5Return tofu to skillet. Pour in reserved sauce and bring to a simmer. Reduce heat to medium-low and cook, turning tofu once or twice and occasionally spooning sauce over, until sauce is reduced by about half, about 4 minutes.Step 6Transfer tofu to a large plate, spoon sauce over, and sprinkle with sesame seeds and reserved scallion top. Serve with rice alongside.How would you rate Spicy Braised Tofu?Leave a ReviewTell us what you thinkReviews (26)Back to TopTrianglewow are you all doing the same recipe I just did? It's fine- we ate it all, but it's pretty boring. I think the person who actually did gochujang instead of gochugaru maybe has it right. I have both, but followed the recipe and it's not spicy at all-- as a vague idea, this is fine, but much pumping up is required.KVLos Angeles2/7/2022I skimmed this recipe and misread gochugaru as gochujang which I ended up using instead since gochugaru is not a pantry staple in our home. The sauce was really yummy - heat was just right. Used firm tofu which I don't think needed to be fried (a little tough) and instead of bok choi (which is in the photo but strangely left out of the recipe) used gai lan. I'll definitely do it again with whatever greens I happen to have.KonahuanuiHonolulu1/12/2022i double the sauce, triple the garlic, and serve it with bok choy, cauliflower rice and a side of kimchi. i have it almost weekly and i always look forward to it.moonbeamsanta cruz, ca1/9/2022I followed recipe exactly except I didn't have any grape seed oil or tofu and I could not go to the grocery store because of covid.mSo I substituted with butter and ground beef.  Excellent recipe.Bob TrashVirginia1/3/2022Great recipe! I agree with Anne and others-- double the sauce! I would also add to fry the tofu on all sides.Anonymous8/9/2021I love this recipe and have made it many times. But in my version I double all the sauce ingredients but keep the water at 3 tbsp, so that the sauce becomes nice and thick. Also, more garlic. Always more garlic.AnneAmsterdam7/24/2021Really good, easy recipe! I added some thin sliced savoy cabbage to the garlic/ginger step and braised it with the tofu, added the right amount of veg and texture. Also added gochujang paste to the sauce (because I'm looking for ways to use it) and it was great! Erin APortland, OR7/14/2021I love the idea of this recipe, but here’s how I made it: 2 garlic cloves, pressed, 2 T. gochugaru, and Caiziyou as the cooking oil. Toasted sesame oil for drizzling, and a little Sichuan green peppercorn oil (I’m addicted to the numbness!). But next time I’m doubling the sauce (thanks, Hilo girl!) and also first steaming bok choy and then adding to the pan at the end to coat in the sauce. The tofu/sauce/rice combo is fantastic!Hollis RamseyVero Beach, FL6/24/2021Loved this! I quickly fried bok choy after frying the tofu. Doubled the sauce recipe, cause I like a lot of sauce, over rice, and added a smidge of honey. When braising the tofu  in the sauce, I added in the boy choy so it could get a sauce covering as well. Will go into my Meatless Monday rotation. And my meal looked just like the photo.Hilo GirlSan Francisco5/1/2021Seems like ti would benefit with another acid-  like a sweet citrus-clementine or orange.kjkvtVermont4/5/2021great, easy recipe! i thought it might be too salty, but it's very balanced. i'll definitely make this again.janetbrooklyn3/2/2021Hands down my new favorite tofu recipe. Simple to make and absolutely delicious. Even if you don’t care for tofu, you would very likely love this dish.RocksGirlPennsylvania 2/14/2021This dish was outstanding. Hands down the most flavorful tofu recipe I have come across yet. I used super firm tofu which needed very little draining and held up very well. I blanched  broccolini  and added it to the pan at the very end. You will definitely want to double this recipe so that you can enjoy the leftovers the next day.RocksGirlPennsylvania 1/13/2021This might be my favorite Tofu recipe.  I omit the red pepper because I prefer it without spice.  It makes a bit of a mess of my stove, but it's completely worth it.  I have to resist eating both of the two servings.MaggieDetroit, MI1/3/2021So delicious and very easy! Added some broccoli and yakisoba noodles as I added the sauce back in at the end and it was perfect! A great back pocket recipe for a busy night.KAHSLC, UT12/9/2020Explore Bon AppétitKoreanEast AsianAsianTofuOther IngredientsQuickEasyWeeknight MealsMainDairy-FreeVeganVegetarianHealthyishBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Christina Chaey"]}