{"id": "9a144c700700c4faa7f8e56e75464825", "url": "https://www.bonappetit.com/story/three-decades-pizza-sergios", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "My Three Decades of Pizza at Sergio’s in Connecticut | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Three Decades of Pizza at Sergio’s(But it was never really about the pizza.)By Amanda ShapiroApril 16, 2019FacebookTwitterEmailPhoto by Manny VargasFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.1992Something is wrong with my mother. We’re sitting in a brown leather booth at Sergio’s with my new stepdad. My soft-bodied doll named Dolly is on my lap. We’ve ordered a large pizza—half cheese, half sausage and peppers—and maybe we’ve gone to the salad bar for our iceberg lettuce and our pickled antipasti, or maybe we haven’t gotten there yet. In any case, we’re sitting together like a real family because that’s what we are now, but my mom’s face is filled with pain. She holds her stomach and tells us she can’t be here, she has to go lie down in the car. But when she tries to stand, she falls down.I remember the red-tinted hard plastic cup full of ice water, how the surface was pebbly under my hands.There’s a back room at Sergio’s, windowless and white, ideal for kids’ birthday parties, sports teams, and any other group that requires space and privacy but not ambiance or light. This is where I sit with Dolly and a nice woman with dirty blonde hair while my stepfather calls an ambulance, while the ambulance sits in the parking lot, spilling red light across the dining room like a disco ball gone rogue, while the EMTs put my mother on a stretcher and drive her away.Do they bring me my pizza? Do I eat it?Later at the hospital, my mom says, “I was a little bit pregnant, but I’m not any more,” and I feel sad that I won’t have a half-sibling but happy that she’s okay, though I won’t understand what happened for years after that.1998We’re sitting in that windowless back room even though we’re only six people—my parents and me and three of my best friends—and it’s good we’re back here because my friends are being extremely, piercingly loud, the way only 12-going-on-13-year-old girls can be. We’re here because it’s my birthday, but my friends don’t seem to care. They’re lost in a spiral of inside jokes, one leading to another to another, snorting birch beer from their noses, choking on mouthfuls of pepperoni pizza, laughing so hard that no sound comes out, tears streaming down their cheeks.We all just started seventh grade, but I’m going to the public middle school while my friends all transferred to the same private school. I can’t articulate it then, but some part of me knows that  our sleepovers, our 3 a.m. prank calls, our Pillsbury-cinnamon-roll mornings are over. My friends have already started their ascent into a cooler, cliquier, wealthier world, one in which birthdays definitely don’t involve parents. They’ll have sex sooner, they’ll drink and smoke weed, they’ll stop inviting me to their birthdays. Meanwhile I’ll muddle through the chaos of public school by studying harder, doing more, and never getting into trouble. In six years, they’ll go to Ivy League colleges, and I will not.I stuff myself with pizza and try to laugh along.Sergio's in Hamden, CT.\nPhoto by Manny Vargas2003My dad cannot understand why I want to go to Sergio’s. He’s taken the train up from New York City, where the Italian food rivals the old country herself, and I’m going to subject him to a suburban Connecticut red sauce joint? It’s as insulting as when I visit him in the city wearing my high school varsity jacket, the name of my hometown emblazoned across the back. “People will think you’re a tourist,” he says, but what he really means is that people will think he’s a tourist, and he can’t stomach that.Even the early-bird retirees aren’t ready for dinner, but my dad has a train to catch, so here we are in the late sunlight with a half plain and half pepperoni pizza between us and a birch beer for me in that reddish pebbly cup. While we eat, my dad tells me about his most recent harassments: the person bagging his groceries a few weeks ago had read his unpublished manuscript and wouldn’t stop staring at him. His landlord was trying to get him evicted, paid off by someone who was out to ruin his literary career. A waiter at the diner had ignored my dad persistently as a way of signaling that he, too, knew who my dad was. That’s one good thing about this godforsaken suburb, he tells me. He doesn’t get bothered here.Now that I’m 16, I’m old enough to know that my dad’s stories are just that: the threads of his rapidly unspooling mind. But I won’t understand until much later how his delusions affected me, how his unstable world perhaps permanently destabilized mine. And even now, after years and years, I won’t have figured out how to protect myself except with the blunt objects of distance and time.2009My parents don’t like my boyfriend, but they won’t admit it until two years later, when I finally break up with him and move to a different state. For now, though, at this first dinner, they sit across from us, glassy-eyed and half-smiling, while my boyfriend talks at length about mounting an experimental puppet show at an art space in Williamsburg and I nervously tear my straw wrapper (ice water; I’ve sworn off soda) into a dozen tiny pieces. Our table is too small for all our food: our salad bar salads, pasta primavera for my boyfriend who is vegan, eggplant parm for me, and a small pizza (half plain, half sausage and peppers) for my mom and stepdad to share.I realize in this moment that all the things I love about my boyfriend are the things my parents will hate: He’s 31 to my 22, he’s an actor/writer/poet/director who waits tables, he went to a new-agey college where he majored in something like transhumanist poetry, he is constantly touching me, and he makes very intense eye contact all the time. But because he’s the first person I’ve brought home since high school, and because they are polite to a fault, my parents let me figure out our gross incompatibility gradually and painfully and all on my own.I desperately want some of their pizza, but I’ve committed to being gluten-free or at least avoiding bread in lieu of heavily breaded eggplant, which I’ve decided doesn’t count. And this pretty much sums up my life from 22 to 24: a series of stubborn and unjustified choices that try to give order to chaos but which actually makes no sense.Takeout orders at Sergio's are picked up from the deli counter in the back, where you can grab a slice of cheesecake or a few pieces of biscotti for dessert.\nPhoto by Manny Vargas2018I couldn’t tell you who Sergio was, whether he even existed, or any of the other employees’ names. The truth is that we rarely ate there, but it was our Friday night take-out spot. We’d call and the same woman would answer, and we’d ask for a large pie—half cheese, half sausage and peppers—and a large salad, and no matter who was on the line, she’d know which family it was for. My stepdad would pick up our order on his way home from work after getting me from dance class or a yearbook meeting or whatever extracurricular I was into at the time. I’d hold the hot cardboard box on my lap while he drove as the smell of sweet tomato sauce and salty, fatty sausage and pooling, melty mozzarella filled the car.People in this town say you aren’t a local unless your grandparents were locals. My parents lived there for 27 years and never quite felt like they belonged. So when they decided to sell their house and move to a different town last fall, I was happy for them. I also knew that Sergio’s was the one place I wanted to order from before they left.In the decade since I’d sat there with my insufferable boyfriend, I moved away from and back to New York, disavowed the gluten-free thing, introduced my parents to two more boyfriends, and become a little like my father: snobby about pizza and most other parts of my city life. The pie from Sergio’s that we ordered that night was the same as always: sauce a little too sweet, crust with a mild amount of char, and what some might call too much cheese. It was a flawed pizza, but it was the one I knew best.Amanda Shapiro is the editor of Healthyish.Explore Bon AppétitRestaurantsRed SauceConnecticutItalian AmericanRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Amanda Shapiro"]}