{"id": "9a1504b2a17359c694fddf5f62229e72", "url": "https://www.bonappetit.com/story/spicy-tomato-chicken-stew", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "A Chicken Stew Recipe Is Here to Dominate Soup Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSpicy Tomato Chicken Stew Is Here to Dominate Soup SeasonMy cold-weather preparedness plan: Making this obe ata stew recipe from Egunsi Foods founder ‘Yemisi Awosan.By Aliza AbarbanelOctober 31, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Kat BoytsovaFacebookTwitterEmailForget the pumpkin patches and mulled wine—the return of soup weather is my favorite thing about fall. Once Daylight Savings torpedoes my evenings into darkness, I give up on the outside world and hunker down with a bowl of feel-better chicken and rice soup or kimchi tofu stew. But this year, there’s only one recipe on my radar: Obe Ata Stew with Chicken and Spinach—a spicy tomato-broth-based stew with tender sweet potatoes, wilted spinach, and plenty of crispy skinned chicken.The crux of this bright but rich recipe lies in the obe ata sauce, a fiery purée of sautéed tomatoes, bell peppers, habanero chiles, and onions. Infinitely versatile, it’s one of the mother sauces of Nigerian cooking, anchoring everything from seafood stews and meaty braises to much-beloved jollof rice. Though everyone has their own version of the sauce (some add ginger, others Maggi seasoning cubes), we fell hard for the one Nigerian-born New Yorker ‘Yemisi Awosan includes in her Egunsi Foodsline of vegan West African soups and stews. So when soup season approached, we asked her for a home-cook-able recipe we could make from scratch all winter long.Awosan developed this ultra-comforting chicken stew that borrows a page from her mother’s playbook, sautéing the obe ata ingredients in a bit of schmaltzy chicken fat for an extra layer of flavor. She starts by searing salted chicken legs in a large Dutch oven to get them brown and crisp, then cooks chopped bell peppers, beefsteak tomatoes, onions, and seeded habanero chiles in the rendered fat until they’re soft and golden brown.“Yoruba people speak in proverbs, and one of the most common sayings is ‘The soul that doesn't eat pepper (spice) is an ineffective soul,’” says Awosan with a laugh. “For them, having spice gives you a soul.” But if you’re sensitive to spice (and confident in your soul), she recommends pricking one of the habaneros with a fork and dropping it into the pot whole to gently infuse the sauce.The final step is to toss everything (minus that whole habanero, if you used it) into a blender with two cups of low-sodium chicken broth, then return the purée to the pot to simmer with sliced sweet potatoes and those seared chicken legs. In under an hour, you’ll be rewarded with a soul-nourishing, tangy-spicy tomato and chicken stew.We may be staring down the barrel of a long soup season, but let’s be real: Who needs to go outside when obe ata stew is sitting on the stove?It's soup season:Obe Ata Stew With Chicken and SpinachObe Ata is a Nigerian sauce that incorporates floral habanero chiles and bell peppers. This recipe uses obe ata as the base for a spicy, warming chicken and sweet potato stew. View RecipeExplore Bon AppétitHealthyishWest AfricanSoupStewRead Morecooking73 Healthy Soup Recipes That Make Any Day CozierGallery73 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-31", "author": ["Condé Nast", "Aliza Abarbanel"]}