{"id": "9a1704cb4da69147677693a857d9fcc0", "url": "https://www.bonappetit.com/story/date-night-pork-chop", "year": 2021.0, "month": 10.0, "day": 5.0, "content": "Weeknight Romance, Thy Name is Pork Chops | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWeeknight Romance, Thy Name is Pork ChopsOne plate, two forks.By Kendra VaculinOctober 29, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There is something undeniably romantic about a big piece of meat intended for two people to share. In my mind it’s the kind of thing you order at a very cool neighborhood restaurant, sitting at the bar with a glass of something festive and, crucially, your crush. Are the butterflies in your stomach from them or the majestic dish that just landed in front of you?The cut itself is half the appeal. Impressive and oversized, it’s usually got a big ol’ bone sticking out of it, which always feels like a party. And then there’s the whole eating-off-one-plate thing, which is cozy and flirty no matter how you slice it. Bumping elbows while reaching for your next bite, sharing a steak knife, laughing… Okay, so I’m writing date-night meat-centric fan fiction! The draw of two forks going for the same piece of chic restaurant rib eye is almost too much for my rom-com loving heart.It should not surprise you, then, to learn that the first recipe I made from Carla Lalli Music’s new book, called That Sounds So Good, was the salt-and-sugar pork rib chop. Carla takes this one-for-two meat idea and turns it weeknight-friendly. Instead of duking it out for a spot at the bar, you can follow Carla’s guidance and make a salty, sweet, meaty, very good plate of food for two in your kitchen, without sacrificing any of the luster. The biggest hurdle is sourcing a thick-cut pork chop; after that, everything comes together in one cast-iron pan for cleanup so easy it might feel like you went out after all.That Sounds So Good: A Cookbook$35 $31 at Amazon$32 at Bookshop.orgHere’s how you make it happen: First, to achieve perfect browning on your chop in mere minutes, you season it on all sides with a combination of salt and sugar. The sugar aids in caramelization, creating the ideal meat crust (so much better than it sounds) in a flash. Then when the chop is just cooked through, you move it to a plate and cook down sliced onion and bitter radicchio in the drippings. The vegetables pick up all that porky flavor and any crusty bits from the pan, the onions going floppy and the chicories wilting just slightly. Together, with a little drizzle of honey, they form a sweet and slightly bitter side.For the finishing touch, reach for a condiment straight from the fridge with a fancy air and punchy flavor: Dijon. Serve the sliced chop and cooked-down vegetables with a big dollop of mustard for dipping. That would feel like cheating at the neighborhood restaurant but is spot-on at home and adds to the “What, this old thing?” vibe of the entire dish.One pan! Sub-30 minutes! These are not usually the characteristics of date-night-worthy food! But this recipe somehow does it all, which means you can be extremely impressive and romantic without much effort on your end. Since it’s so easy, go the extra mile and light a candle. Who knows, maybe this time the butterflies will be for you.Be still, my heart:Salt-and-Sugar Pork Rib ChopsCarla Lalli Music's ingenious shortcut for perfectly browned pork chops is the weeknight dinner cheat code we all need.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-29", "author": ["Condé Nast", "Kendra Vaculin"]}