{"id": "9a1ba3730cf66c920e5e7807256969bc", "url": "https://www.bonappetit.com/story/einat-admony", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Einat Admony Is a Chef Who Loves Comedy—So She Became a Stand-Up Comedian | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI'm a Chef Who Loves Comedy—So I Became a Stand-Up ComedianEinat Admony helms two restaurants and a burgeoning fast-casual falafel empire, but she still finds time to kill it at the Comedy Cellar.By Einat AdmonySeptember 3, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEarlier this year, I moderated a panel on wellness in the food industry as part of a breakfast co-hosted by Future of Women and Healthyish. The breakfast was held at Kish Kash, a restaurant owned the chef Einat Admony, who also participated in the panel. I asked everyone, “What’s one thing you are doing for yourself right now?” Admony said she had just started taking comedy classes and was about to perform at her first show. A chef who moonlights as a stand-up comedian? I needed to know more. So I caught up with Einat Admondy to find out how the first show went and what she’s learned about herself in the process. Here’s what she told me. —Priya Krishna, contributing writer.Since I moved to New York, I’ve been going to Comedy Cellar regularly. Nonstop. I started knowing all the comedians and then, for years, I was dying to do a comedy class. Then, recently, I got to the point where I needed to do something for myself that did not have to do with cooking, my husband, or our kids. Just for me. It was a really hard time for me financially. I did not have time. Everything looked like it was going down, but I wanted to have some lift. So I said to myself, No boob jobs. I am going to do comedy.I have always been super funny. No, really! I was the clown of the class. I would give shows to my friends. I’ve always made jokes in the kitchen.  So, when I got to class, at first I was judging other people. There was a lawyer, a teacher, a public speaker trainer. I’m super competitive. I was thinking, “I’m going to be the funniest.” But we all became friends. We supported each other.There’s this adrenaline that I’ve never experienced before...and I’ve been working in kitchens where there’s a lot of adrenaline.We were taught how every situation, even tragic ones, could be turned into material. I started filling notebooks with jokes. I would come home, smoke a joint, watch television, and write in my notebook. My brain was just going nonstop. I have a lot of elements of my life where I can get jokes. I’m a mom, so I can have jokes about that. I am a chef, a wife, an immigrant. There are layers that I can work with.I have this joke about when I got honored by the Carnegie Foundation for being a successful immigrant. I was imagining how they do voting, and someone is yelling, “Do we have a Pulitzer Prize winner this year? Do we have activists? Do we have actors?” and then, “What about someone who makes a really great fucking falafel?” I also do a lot of jokes about being a parent. I start one bit by saying I have two kids that I am raising with my wonderful partner, Netflix.Our first show was at Comedy Cellar, and most of the staff of my restaurants came. I had five minutes to do my set. I almost shit my pants. I’m not joking. It was super stressful. I have never had stage fright. I can talk in front of hundreds of people, no problem. But this was different. I was scared I wasn’t going to be funny enough. Comedy requires thick skin. But it went really well! People laughed.There’s so much going on in my life right now. I have a new cookbook, Shuk, coming out in the fall. I’m about to go to Morocco. My son is going to have his bar mitzvah. But I want to keep doing comedy. There’s this adrenaline that I’ve never experienced before...and I’ve been working in kitchens where there’s a lot of adrenaline.Cooking and comedy have a lot in common. The process of writing a joke is similar to making a dish. There’s a thought that comes in, and there’s an evolution, and then there’s a final result. Both cooking and comedy give you a big thrill. In both fields you struggle for years and you make no money.Some of the people in my class are changing careers to do comedy. Someone, after the first show, even told me, “You can quit your day job.” But I don’t need to choose between comedy and cooking. I can do both. I am probably better at cooking than comedy. I mean, I better be.Explore Bon AppétitHealthyishNew York CityRestaurantsessayRead MoreLifestyleChristina Lecki On Leaving Reynard and What She's Doing NextBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-03", "author": ["Condé Nast", "Einat Admony"]}