{"id": "9a29ac631d1bcd3a437bc480f3f985c9", "url": "https://www.bonappetit.com/recipe/shrimp-and-no-stir-grits", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Shrimp and No-Stir Grits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShrimp and No-Stir GritsBy Claire SaffitzMay 8, 20184.9(13)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintThe hardest thing about this recipe? Deciding which time of day to eat it. Brunch, lunch, or dinner, we're never not excited about sweet, garlicky shrimp and cheesy grits. And thanks to our hands-off method for cooking grits, this recipe is quick and easy enough that we can throw it together whenever the craving strikes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Saucepan$60 At AmazonWhisk$10 At AmazonScissors$17.95 At AmazonCutting Board$10 At IKEABox Grater$13 At AmazonChef's Knife$34.53 At AmazonLarge Skillet$84 At AmazonWooden Spoon$6 At AmazonIngredients4 servings4Tbsp. unsalted butter, divided1tsp. kosher salt, plus more1cup white corn grits (not quick-cooking)1lb. large shrimp6oz. sharp white cheddar cheese6scallions2garlic cloves3oz. bacon (about 3 medium slices)1pint cherry tomatoes1lemonHot sauce (for serving)PreparationStep 1Preheat oven to 325°. Bring 4½ cups water to a simmer in a large saucepan over medium-high heat. Add 3 Tbsp. butter and 1 tsp. salt and whisk to melt butter.Step 2Slowly sprinkle 1 cup grits into saucepan, whisking constantly. As soon as water comes back to a boil, cover pot and transfer to oven. Set timer for 20 minutes.Step 3Do a little prep while the grits are cooking. First, using a pair of clean scissors, insert one blade into head-end of shrimp and snip along backside all the way to the tail to expose the vein. Remove vein and peel shrimp (freeze the shells and save for stock!).Step 4Grate 6 oz. cheese on the large holes of a box grater.Step 5Trim 6 scallions on both ends, then cut crosswise into 1\" pieces.Step 6Smash 2 garlic cloves, peel, and finely chop.Step 7Remove grits from oven (careful—handle will be hot!) and heat on stove over low. Uncover and whisk vigorously, scraping bottom, until mixture is smooth. Gradually add cheese, whisking constantly, until grits are smooth and creamy. Taste and season with more salt, then cover and keep warm over low heat while you prepare the shrimp.Step 8Heat remaining 1 Tbsp. butter in a large skillet over low heat. Stack 3 oz. bacon slices, cut crosswise into ½\" pieces, and add to skillet. Increase heat to medium-high and cook, stirring often with a wooden spoon, until fat is released and bacon is crisp around the edges, 5–8 minutes.Step 9Add scallions and garlic to skillet and cook, stirring often, until scallions are softened and white parts are translucent and lightly browned, about 4 minutes.Step 10Increase heat to high and add 1 pint tomatoes; season with salt. Cook, tossing occasionally, until tomatoes are starting to burst, about 2 minutes.Step 11Add shrimp; season with salt. Cook, tossing often, until they turn pink and the thickest part of the spine (where you snipped to remove the vein) is opaque, about 2 minutes.Step 12Remove skillet from heat and add 2 Tbsp. water. Cut 1 lemon into wedges and squeeze about 1 Tbsp. juice over shrimp. Press on back of tomatoes with a wooden spoon to release their juices and stir to combine.Step 13Whisk grits again to smooth out. Spoon into shallow bowls. Top with shrimp mixture, then drizzle with hot sauce. Serve with remaining lemon wedges alongside for squeezing over.How would you rate Shrimp and No-Stir Grits?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleDelicious!! I am a shrimp and grits connoisseur and this was definitely up there on the list! So glad I know how to make a version of this on my own. Im not a huge fan of hot sauce but it was even a nice kick at the end! Anonymous9/21/2020So good, so easyAnonymousLittle Rock, AR4/27/2020This is stupid easy and ridiculously delicious. My only issue is that the “4 servings” suggestion makes me feel bad that I ate it all myself. ToomanydogpostsNew York, NY5/26/2019My only complaint about this recipe is that we all loved it SO much that wasn't enough for seconds!! Making it again on the 17th and will double it and have leftovers.wagner_eRochester NY5/5/2019Love this dish! Will be making it over and over again. Best shrimp and grits recipe I've tried! The video instructions really makes it easy to follow. AnonymousValencia, CA5/20/2018Easy and quick recipe to follow and the flavors were great.AnonymousBrooklyn, NY5/16/2018Explore Bon AppétitSouthernAmericanGritsRice & GrainsShrimpShellfishSeafoodCheddarCheeseEasyWeeknight MealsMainGluten-FreeNut-FreeSautéKwanzaaLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-08", "author": ["Condé Nast", "Claire Saffitz"]}