{"id": "9a2d0dd7dbd405dfe47866f9f440a8e6", "url": "https://www.bonappetit.com/story/longoven-evolution", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "The Long and Winding Road to Richmond's Most Ambitious New Restaurant—in One Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Long and Winding Road to Richmond's Most Ambitious New Restaurant—in One DishThe story of Longoven, told through Chawanmushi.By Elyse InamineJanuary 3, 2019FacebookTwitterEmailPhoto by Fred + ElliottFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.Out of all the dishes a chef envisions, tests, and eventually serves, how does one become a restaurant’s signature? For Longoven’s Andrew Manning, Megan Fitzroy Phelan, and Patrick Phelan, the defining menu item is the thing they’ve never been able to stop fiddling with: a savory egg custard that they’ve topped with everything from uni to summer flowers. As the team journeyed from DIY pop-up stalwarts to the owners of a new brick-and-mortar location, a version of this dish has always anchored their constantly changing restaurant.Photo by Fred + ElliottNovember 2016: Jasmine Rice CustardTwo years into the Longoven bi-weekly pop-up, Manning wants to put a savory custard on the menu (he’s a chawanmushi fanatic). This month he finally does, mixing jasmine-rice-steeped milk with egg yolks, steaming it, then topping with crunchy cauliflower mushrooms, yuzu jelly, and Maine uni (Phelan’s a fanatic). After the chefs wrap their day jobs (butchering, catering, and teaching pastry), the three refine the dish through late-night phone calls. In the end, the uni custard scores with diners. That’s validation for the team, who are balancing their ambitious roving restaurant with regular work.Photo by Fred + ElliottAugust 2017: Corn CustardIt’s summer, and Manning sees blue crabs and corn everywhere, so he makes a corn custard covered with fat hunks of Chesapeake blue crab, a double dose of shiitake (jelly and mushrooms), seaweed-cured egg, and shiso. More late-night calls ensue as they finalize this month’s pop-up menu. It’s been a hectic ride: They’re six months into the renovation of Longoven’s future home.Photo by Fred + ElliottJune 2018: Asparagus CustardMore blue crab! Manning plays off the classic pairing of crab and asparagus with this summer-flower-crowned custard. This iteration earns a spot on Longoven’s debut menu in the new space, a familiar note among the chaos of opening. “Surreal” is the way the chefs describe the first night. Sometimes they forget they’re not a pop-up and don’t have to crank out 38 dishes at once. It’s not until they get back to their homes, late after service, that they realize they’re finally doing what they’ve been dreaming of the past four years.Explore Bon AppétitRestaurantsVirginiaDish DecodedRead MorerestaurantsDon’t Call Passerotto FusionBy Elyse InaminerestaurantsAfter Three Moves, A Cult Neapolitan Pizzeria Calls NYC HomeBy Anthony MangiericultureAlexandria Ocasio-Cortez Learned Her Most Important Lessons from RestaurantsBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-03", "author": ["Condé Nast", "Elyse Inamine"]}