{"id": "9a39dbffda8b63c26b8f3494161d6fd6", "url": "https://www.bonappetit.com/story/romaine-salad-homemade-ranch-saved-my-social-life", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "This Romaine Salad with Homemade Ranch Saved My Social Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Romaine Salad with Homemade Ranch Saved My Social LifeWhen the whole group text unexpectedly shows up for dinner, I know what I'm making.By Jesse SparksOctober 30, 2018FacebookTwitterEmailFacebookTwitterEmailIf your friends’ group chat is anything like mine, you’ve probably experienced that moment of panic as your plans to hang and make dinner for yourself and a friend or two balloons into cooking for the whole squad. This happened to me just this past week. The low-key hangout I really needed became dinner for six before I knew it. But, I didn’t have time to sweat it—I had a full-fledged kickback on my hands, and these people needed to eat.Luckily for me, I had a brand spankin’ new Basically recipe up my sleeve. This romaine salad—Every Night Salad with Yogurt Ranch, if we're being specific—uses super basic pantry staples to make something that looks and tastes like you spent all day shopping and cooking. So, with my internal countdown clock ticking (aka the swarm of “OMW!!!!” texts buzzing on my phone), I evaluated the contents of my fridge and dashed to the store to re-up on the couple of ingredients I needed to bring the whole thing together.Now, if you’re thinking that salad isn’t exactly the life of the party, I get it. Bunches of sad-looking mesclun mix and boxed croutons aren’t exactly my idea of fun either. But you know what does get me going? Crunchy, crispy mouthfuls of cold romaine! Bright flashes of tart lemon and yogurt! Comforting hits of salt and heat from crushed almonds and garlic! With so much flavor in such a simple package, I could serve my friends a satisfying salad and still have the bandwidth to, you know, hang out with them.While I was still waiting for company to arrive, I bumped some music, prepped my work space, and breathed easy knowing it would only take me about 20 minutes to throw the whole thing together (dance breaks included). I grated my garlic, juiced my lemon, chopped my herbs, and whisked, whisked, whisked it all together with rich, full-fat yogurt and a bit of store-bought mayo. Once the dressing was done, I slid on over to my leafy greens.The best salads are dressed twice.\nNow, here’s the key to making a salad really shine: Dress it not once, but twice. Yeah, you read that right. (Well, you probably did.) No matter how delicious your dressing is, you still need to make sure that every leaf of lettuce gets a good hit of acid, fat, and salt before anything else happens—forgetting this is why so many salads fall flat. Here, I tossed the romaine leaves with a squeeze of lemon juice, a drizzle of olive oil, and a big pinch of kosher salt to give the dressing a beautiful foundation to build on.Once my greens were in order, I went back to my dressing. I gave it a taste, and since my lemons were kind of big, the whole thing skewed a bit tart; to compensate, added another spoonful of mayo to the mix get the the fat-acid balance right. I dipped a leaf of pre-dressed lettuce in to make sure the whole package worked. Bingo: just salty enough, creamy enough, and tangy enough, with a good hit of garlicky heat. I was in business.When the doorbell rang, I whipped out a platter and carefully built my salad, layering lettuce, dressing, and crushed almonds to make sure that every bite was a winner. After throwing on a pair of pants, I was ready to play hostess with the mostest and field compliments all night because yes, this was a breeze. And yes, my friends can come back anytime. They’ll just have to give me a little more of a heads up next time.Get the recipe:Every Night Salad with Yogurt RanchThis crunchy romaine number, drizzled with a creamy, craveable yogurt-based homemade ranch dressing, is the kind of salad that goes with just about anything, from delivery pizza to pan-seared pork chops.View RecipeExplore Bon AppétitBasicallyRomaineSaladYogurtWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-30", "author": ["Condé Nast", "Jesse Sparks"]}