{"id": "9a602f10494fbc172a163fc4bae6b591", "url": "https://www.bonappetit.com/story/just-buy-it-giara-bottles", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "The Flip-Top Glass Bottles You Need for Batching (and Transporting) Killer Cocktails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Flip-Top Glass Bottles You Need for Batching (and Transporting) Killer Cocktails'Tis the season for cocktails on the go, and these bottles are here to banish all worries over leakage and spillage.By Jesse SparksJune 5, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailLet’s say you get invited to a party. Your friend asks you to bring drinks. So you roll up your sleeves, and mix up a beautifully batched cocktail that’ll win over any crowd. Now, you just have to worry about getting your creation to the party. That’s where these Bormioli Rocco Giara bottles come in.These simple flip-top bottles are our vessel of choice for getting drinks from point A to point B—you don't want to take your one nice pitcher out for a walk and risk dropping it or spilling your booze everywhere. Those tops seal things up real tight, meaning you can batch beverages ahead of time, toss them in your tote, and arrive at your destination with a whole bunch of drinks and a mercifully dry bag.Could you use some kind of stainless steel insulated water bottle? Suuuuure. But the Giara bottle's clear glass makes it easy to keep track of the bottles' contents, all while looking nice enough to display on the counter or the drinks table. They're inexpensive enough that if you do break them it's not a tragedy, and will last a hell of a lot longer than whatever plastic thing you were tempted to buy at the dollar store. Plus, they have so much more to offer than cocktail portability alone. They're great for storing whatever homemade beverages you like to make in quantity—gingerade, kombucha, lemonade, cold brew, etc.—and can be used for storing other liquids you buy in bulk like olive oil or vinegar. Just do yourself a favor and invest in a bottle brush for washing them out thoroughly in between uses—a clean Giara bottle is a versatile Giara bottle, if you catch out drift.So whether you’re mixing up the batch of cocktails that’ll get the party started or bringing a wholesome quart of lemonade to the park, do yourself a favor and pack a few of these bottles. You and your host will thank you.Buy It: Bormioli Rocco Giara Bottles, $20 for set of four on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Need some help batching those cocktails? We got you:How to Pre-Batch Old-Fashioneds—and Any Stirred Cocktail—for Maximum Party PortabilityThe pre-batched old-fashioned is your new party trick.View StoryExplore Bon AppétitShoppingBasicallyCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-05", "author": ["Condé Nast", "Jesse Sparks"]}