{"id": "9a6d542341de531931936873bd08e423", "url": "https://www.bonappetit.com/story/take-a-worry-free-vacation", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "I Took a (Nearly) Worry-Free Vacation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Took a (Nearly) Worry-Free VacationBreaking away is hard, but good.By Adam RapoportApril 30, 2019FacebookTwitterEmailCopyright 2019. All rights reserved.FacebookTwitterEmailHow about we start with the good part? My wife and I had just dropped off our son at sleepaway camp, up in Algonquin Park in Ontario. It was his first time away, and everyone told us how great it would be not just for him, but for us as well. It would be like we were dating again. Our only concerns being where to make dinner reservations and whether we wanted to sleep in or get up for that 8:30 a.m. yoga class.So we booked a trip to L.A. and a room at this neat little motel, the Native, right off the Pacific Coast Highway. It’s the kind of place where the tidy Scandi-by-Cali rooms are just enough. You walk up to the office for pour-your-own coffee and fancy mineral water in glass bottles. No TV, but plenty of WiFi and all the time in the day to read a book. Everything you need to forget you’re a parent.We rented a convertible and got all Californian. We ate way too much pasta at Felix and breakfast pizza at Jon & Vinny's (see below). We over-caffeinated at Destroyer (see above). We hiked to a craggy, cliff-framed beach that looked exactly like the one at the end of Planet of the Apes. And then, after a bit of basic internet research, we learned it was the beach at the end of Planet of the Apes.It was a long weekend that actually felt long. It was just what we needed.And then we got home.“Please come get me. I hate camp. All the kids are mean.”“Mom, please tell Grandpa to come pick me up on Wednesday.”“I really don’t like it here. Can I please come home?”A week’s worth of stamped, preaddressed, handwritten postcards had piled up in our mailbox. The editor in me awarded Marlon points for his directness, not a superfluous word to be found. But as a parent, man—crushing.We had dropped off our kid, hoping for a transformative experience for him. Over the next three weeks, we maintained a constant line to the camp director—an endless volley of “He’s hanging in there” and “Let’s see if he can make it to the end of this week.”Ultimately, he did make it, bruised but resilient. When we picked him up from the bus, he vowed that he was done with camp, that he would never go back.Over the months that followed, stories trickled out. About the four-day canoe trip. About how he ate—and liked—falafel. Soap baths in the lake. The girls’ bunks. The black market among campers for contraband candy bars.Hmm...didn’t sound that bad.Then one day last month, we overheard Marlon talking to a friend. “Oh, yeah. I’m definitely going back to camp this summer.”Wait, what?Turns out camp was transformative, just not how he, or we, expected. In the months after he got home, he processed all the downs, apparently deciding that the ups had won out.I can’t say how or why he decided the way he did. But I can say that as someone who spent many summers away, that’s kind of the point. It’s not for your parents to know or decide. That’s why you go to camp.This summer, while Marlon’s gone, Simone and I hope to travel without a care. We know that won’t likely happen. But that won’t stop us, or him, from going our way.Explore Bon AppétitAdam NewsletterRead MorerestaurantsGjusta Is My Quintessential, Never-Miss L.A. SpotBy Adam RapoportcookingMake Spaghetti With Ramps Right NowBy Adam RapoportcultureBon Appétit Used to Just Be a Magazine. Not Anymore.By Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-30", "author": ["Condé Nast", "Adam Rapoport"]}