{"id": "9a6fc45dc2f574825720492fb22b7e7d", "url": "https://www.bonappetit.com/story/homemade-oat-milk", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "How to Make Oat Milk at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Figured Out How to Make the Creamiest Oat Milk at HomeYes, you may call me the Queen of Alt Milk.By Kate RaphaelSeptember 24, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailWelcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed. Today: How to make oat milk.When I moved in with three women a year ago, I joked that we were the Queens of Alt Milk. Open our fridge on any day and you’d see at least four cartons of nondairy beverages, from classic soy to protein-packed cashew milk. It wasn’t long, however, until we all converged on the holy grail of milk alternatives: oat milk.My younger sister introduced me to the beverage, texting one afternoon: “Ok have you had oat milk,” immediately followed by, “It’s so good. It tastes like heavy cream.”I bought a carton the next day. Her evaluation was on the mark: Oat milk’s texture is creamy and luxurious, its flavor neutral, just barely sweet. I’m a self-identified culinary experimentalist with a taste for rich dairy products (smooth chocolate milk laced with heavy cream, dreamy ricotta swooped on tomato-topped toast, lavish layers of mascarpone blanketing coffee-soaked ladyfingers), but I’m also a vegetarian on the lookout to reduce my carbon footprint. I saw oat milk as a more sustainable choice—among the plant-based milks, it requires less land and water in production and creates minimal carbon emissions. It became my perfect dairy alternative—streamed into coffee, subbed while baking, drenching my morning oatmeal (oh, the absurdity of my breakfast oats luxuriating in a bath of their brethren).Once the pandemic began, I limited my grocery trips and made the kitchen my oat milk production zone. Commercial oat milk contains added thickeners and stabilizers, but I scoured the web and tinkered with my recipe to achieve creamy homemade oat milk sans sliminess.Oat milk starts with ice-cold water (any heat risks cooking the oats, ruining the texture). For 4 cups oat milk, combine 1 cup dry rolled oats (I used Bob’s Red Mill, but any rolled oats will work—don’t use instant or quick-cooking oats), 4 cups cold water, and a pinch of salt and blend for 20 seconds max. Don’t soak the oats beforehand or overblend them—that causes starch breakdown, upping the slime factor. I don’t have a high-speed blender, just an old Osterizer passed down from my mom. If you bought your blender after the ’80s, I would advise blending for less time, just 10–15 seconds.Next, strain through a clean T-shirt (a nut milk bag will allow too much sediment through) into your storage receptacle of choice. You can gently nudge the oat mixture through the cloth with the back of a spoon, but don’t push too hard or squeeze the leftover pulp, which contains the gluey starch compounds (although you can add the pulp to oatmeal or cookies if you wish).While I never found this basic recipe slimy, it wasn’t as creamy as I had hoped. So, in my quarantine-allotted free time, I dove into a whirlwind of blender-supported recipe research and Osterized my way through an array of creamy additions. The Alt Milk Queens of my apartment obligingly closed their eyes and tasted the results.First, I added 1 teaspoon canola oil (any neutral oil would work) to the blender with the oats and water. Everyone found this less grainy than the original recipe, but not yet velvety.Next, instead of the oil, I tried adding ¼ cup nuts (soaked overnight), blending them with 2 cups water for 30 seconds, then adding the remaining 2 cups water along with 1 cup dry oats and a pinch of salt. I blended the full mixture for 20 more seconds and strained.Here was the creaminess we’d been missing! I tested three separate nut combinations: ¼ cup macadamias, ¼ cup cashews, and a 50-50 combo. My patient oat milk—adoring roommates dutifully sipped from their testing glasses and tried each combination. In a blind test, the winner in both taste and texture was half cashews–half macadamia nuts—silky and rich, yet not nutty tasting. I suspect another nut or combination (Brazil, hazelnut, pecan, you name it!) would also work deliciously.Store your oat milk in the fridge for up to five days, and give it a vigorous shake before drinking or using it to cook or bake as some separation is inevitable (but sliminess doesn’t have to be). With a whirl of our blender, these Alt Milk Queens dub you Oat Milk Royalty. We recommend you sip from a chalice while wearing a crown.Kate Raphael is a writer based in Cambridge, Massachusetts. You can read more of her essays on food, running, and living through a pandemic here. Explore Bon AppétitIt's That SimpleRead MoreOvernight Oats with Banana, Maple Syrup, and TahinicultureI'll Never Run Out of Alt Milk Thanks to This ConcentrateBy Aliza AbarbanelcultureTrader Joe’s Oat Milk, and More New Winter Stuff, ReviewedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-24", "author": ["Condé Nast", "Kate Raphael"]}