{"id": "9a7730ba1acafe1cfd9301b8dac38158", "url": "https://www.bonappetit.com/story/udon-gyoza", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Udon Gyoza Are Crispy Pancakes Made From Chewy Udon Noodles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Crave Something Hearty and Homestyle, I Make Udon GyozaHands down the best dish I ate in Japan.By Jarrett MelendezDecember 1, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.In what feels like another lifetime, I was a bright-eyed student in a Tokyo suburb, living my absolute best life. Several months into the study abroad program, though, I started feeling homesick—not for anything in particular, just for something comforting. I was living alone in my own apartment, being as self-sufficient and responsible as any college student could be, clubbing on weekends and making the occasional bad choice, like drinking tequila and dancing until it hurt to move.One weekend, my friend Matt invited me over for pre-club dinner with his host parents, the Watanabes. I’d shared a few dinners with friends’ host parents at this point, but this was the first time I was asked to help cook. We were going to be making udon gyoza, and Mrs. Watanabe put me right to work slicing scallions. Mrs. Watanabe prepped everything else while Mr. Watanabe showed Matt how to peel apples while keeping the peel in one piece.Once we finished prep, Mrs. Watanabe sent us all to the dining room to snack on apples and drink beer while she finished up in the kitchen. A beer or two later, she came into the room with a platter of beautiful golden brown patties. As I told Mrs. Watanabe, they immediately became one of the best dishes I’d eaten since arriving in Japan. She laughed it off, saying they were nothing special, just a basic Japanese homestyle recipe she’d made hundreds of times.But more than how great they tasted, this low-effort, inexpensive meal encompassed what I’d been missing about home—people coming together to cook a meal, sharing stories, laughing. It didn’t matter that none of us were related because in that moment, we were a little family, right down to their parental advice to “never stop experiencing new things and challenging yourselves” and their wave goodbye, telling us to have fun and be careful.Thirteen years later, I’m still trying new things, but whenever I need something hearty and comforting, I find myself circling back to this recipe. Here’s how to make it:Thaw 1 pound frozen udon noodles, then chop them into roughly 1-inch pieces. Add the chopped noodles to a large bowl, along with 1 pound ground pork, 2 eggs, ¼ cup thinly sliced scallions, 1 Tbsp. soy sauce, and ¼ cup potato starch (I’ve found that cornstarch and all-purpose flour work too). I usually add 2 cloves garlic, grated, and about 1 Tbsp. freshly grated ginger, but feel free to adjust those amounts to your preference.Once all the ingredients are in the bowl, mix with your hands until well incorporated. Heat 1 Tbsp. vegetable oil in a large nonstick skillet over medium heat. Using a standard ice cream scoop or a ¼-cup measure, measure out balls of the udon gyoza mixture. Flatten each ball into a ½-inch thick patty in the palms of your hands, then place four to five patties in the hot skillet, taking care not to crowd the pan. Cover the skillet, and cook for 5 minutes, undisturbed, until deep golden brown. Flip the udon gyoza and cook, uncovered, for an additional 3 minutes, until cooked through. Serve with a dipping sauce made of equal parts soy sauce or ponzu and black vinegar, and as much rayu as you like.Though we ate them as a meal that night, the Watanabes said they’re good as a snack or appetizer, or even served cold the next day in a bento box. I can’t really speak to how they are leftovers, though. No matter how many of these I make, they never seem to make it through the night.Jarrett Melendez is a graphic novel writer and former cook living in Boston with his partner Stuart, and their collection of plush pigs.Explore Bon AppétitIt's That Simple UdonPorkJapaneseSoy SauceRead MorecookingMore Nori Nut Mix, PLEASEBy Sarah JampelcookingGyeran Bap is What’s For Lunch (or Breakfast or Dinner) When You Can’t Be BotheredBy Joy ChocookingKoshari Is the Cozy Pile of Carbs I Make to Clean Out the FridgeBy Sohla El-WayllycookingI Make This Spicy Korean Fish Stew When I Just Need to Sweat It OutBy Paul WangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Jarrett Melendez"]}