{"id": "9a7e21f3f2349305dfc228ce241215b3", "url": "https://www.bonappetit.com/story/line-hotel-dc-restaurants", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Why I'll Be Spending My Entire D.C. Vacation Inside the Line Hotel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhy I’ll Be Spending My Entire D.C. Vacation Inside the Line HotelGiant chicken yakitori, breakfast fries, and crêpe cake you can eat lying down—need I say more?By Hilary CadiganJune 7, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Here I am, snuggled up in a snow-white bed, surrounded by bamboo trays and teensy ketchup bottles and industrial-chic light fixtures and sweeping views of the Washington Monument, shoveling food into my face like a modern-day Marie Antoinette. I wear no pants. Pants are not my concern. In this moment, I am queen—unafraid of future beheadings, nor the hefty bill that awaits me at checkout, nor the PB&Js I’ll be subsisting on for the rest of the week. For I am a guest at the Line Hotel in D.C., and I have no intention of going anywhere.Yeah, I know, there are a lot of nice things to do in D.C. The museums are free and the bars are cool and there are lots of clean sidewalks for walking on. But have you ever spent an entire weekend inside your house? Imagine that, but better, because the Line is clean and stylish and not actually your house. Also, there is food everywhere. Like, really good food.Nothing like the smell of ember-roasted vegetables in the morning\nPhoto Courtesy of The Line DCYou can start your day with room service from Brothers and Sisters. Maybe poached eggs with pork belly and potatoes rosti. Maybe milk bread French toast with green apple compote and Chantilly cream. Do you need a side of breakfast fries? Of course you need a side of breakfast fries.Next comes brunch at A Rake’s Progress (brunch = lunch when you already ate breakfast; no judgies). Which means, it’s time for pants (though a sleek pair of sweats will do you just fine). What are we having? How about ember-roasted turnips with crispy grit cakes and house-made green goddess dressing? How about congee made from puffed grains and something amazing called fish pepper honey? Time for a nap? You betcha.Everyone needs a cake nightcap.\nPhoto by Melissa HomWake up and grab a cocktail at A Rake’s Bar (did I mention all this is happening inside a former church, which means you’ll be drinking under an insane avant-garde light fixture made from old organ pipes? It is!) before heading to Spoken English, where you’ll burn calories by eating your entire dinner standing up. Chef Mario Almeida specializes in things on skewers: maitake mushrooms, chicken hearts, melty Camembert with toast. But save room for the large-format chicken yakitori, which is an entire chicken broken down into eight courses cooked to order, from the crispy skin dipped in sambal sauce to a hollowed-out wing stuffed with chicken liver mousse and fried. Wash it all down with a bomb-ass selection of sake, then go back to your bed, take off those pants, and order up one of pastry chef Pichet Ong’s Earl Grey crêpe cakes. Yeah, you can eat it lying down. Yeah, you’re welcome.Go there: Line HotelExplore Bon AppétitHighly RecommendHotelsWashingtonRestaurantsRead MorecultureGuest House Is the Boutique Hotel I Wish I Actually Lived InBy Alex DelanyrestaurantsI Will Fight You for the King Crab Legs in J.J. Johnson’s AfropotBy Alex BeggsrestaurantsAn Adult-Sized Hangover Calls for the XL Breakfast Sandwich at Philly’s Hungry PigeonBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-07", "author": ["Condé Nast", "Hilary Cadigan"]}