{"id": "9a82093abd05d2778a8da2e1e12289ef", "url": "https://www.bonappetit.com/recipe/sheet-pan-gnocchi", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Sheet-Pan Gnocchi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueSheet-Pan GnocchiBy Sarah JampelMay 25, 20214.6(230)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintWhile the instructions on a package of shelf-stable gnocchi might tell you to boil them, the secret—which I learned from my friend (and brilliant recipe developer) Ali Slagle—is that these types of gnocchi are at their best when roasted or pan-fried. Direct heat from the oven (or pan), along with a good bit of olive oil, helps them crisp on the outside while remaining chewy and tender within. Roasting them alongside some cherry tomatoes, which burst to create a jammy sauce, means you’ve got dinner in 25 minutes—just add a heap of greens and lots of sharp cheese and you’re good to go. —Sarah JampelThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.Ingredients4 Servings½large red onion, cut into ½\"-thick wedges2large garlic cloves, unpeeled2pints cherry tomatoes117.6-oz. package shelf-stable or refrigerated potato gnocchi4Tbsp. extra-virgin olive oil, divided, plus more for drizzling1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided, plus moreFreshly ground black pepper1Tbsp. fresh lemon juice2cups baby arugula1cup basil leaves, large leaves torn2oz. Parmesan, shavedPreparationStep 1Place a rack in middle of oven; preheat to 425°. Toss onion, garlic, tomatoes, gnocchi, 3 Tbsp. oil, and 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt on a rimmed baking sheet to coat; season generously with pepper and toss again to combine.Step 2Roast, stirring once or twice, until gnocchi are golden and starting to crisp, most of the tomatoes have burst, and onion is golden, 25–30 minutes.Step 3Remove garlic from baking sheet, peel, and place in a small bowl. Mash with ¼ tsp. salt (garlic should be quite soft). Whisk in lemon juice and remaining 1 Tbsp. oil; season dressing with pepper and more salt if needed.Step 4Add arugula, basil, and Parmesan to baking sheet and drizzle dressing over; toss to combine. Divide among plates and drizzle with a little more oil.How would you rate Sheet-Pan Gnocchi?Leave a ReviewTell us what you thinkReviews (65)Back to TopTriangleSimple and delicious. Followed the advice of other reviewers by keeping the gnocchi on one side of the sheet and the vegetables on the other, and by doubling the dressing. Highly recommend!Jane A3/22/2022Amazing! I separated the gnocchi from the rest when roasting, and added 2tsp of chilli flakes and some minced black truffle to the (doubled) dressing. Amazing. Jamie PCalgary 3/11/2022This dish is delicious and so simple. I followed the advice of other reviews and roasted the gnocchi on a separate pan and doubled the dressing. I also added zucchini and used a combination of cherry tomatoes and wedges of a variety of larger tomatoes. Sometimes I will swap the basil out for dill and swap the parmesan for feta. It's always delicious. EmilieBrooklyn, NY1/21/2022This is so easy and delicious. I add Italian sausage to make it a little more filling. Love how the tomatoes form a sauce for it all once they burst. AnonymousFort Worth, TX1/2/2022I seperated the gnocchi from the tomatoes as well. Gnocchi got very crispy. Very easy, very delicious!! Dressing was lovely as wellWammie2211Belgium12/9/2021I made this using the suggestion to separate the gnocchi and the vegetables on the baking sheet. Literally just put the gnocchi on one side and everything else on the other, then poured oil and salt on each side separately. It was delicious! The gnocchi got crisp and the tomatoes and onions got soft and delicious.JoanNew York, NY11/8/2021I agree with many others: the gnocchis don’t crisp with all the tomato juices. The dish was still good but more like boiled gnocchi. I will try pan-frying the gnocchi while roasting the onions and tomatoes. StevePalo Alto9/19/2021Amazing! So easy!!! My family loves this, even my 3 small children, and it is incredibly easy to make. My new Friday go-to recipe. The hardest part is finding the roasted garlic cloves amongst the sheet of gnocchi 🙈MeghanAustin, TX9/17/2021I have served this recipe to vegetarians and meat-eaters alike! \nThe first time I made this wonderful dish it was delicious, however, I like my gnocchi crisp and golden so I pan-fried them separately in a bit of olive oil and a tiny bit of butter and added them back in just before serving, perfect!!  \n\nI have made this recipe numerous times as the main dish as well as a complementary side dish.\nAs my husband likes meat of some type with every meal, I have added slices of both hot and mild sausage Debra S.Born in the North but live in the South9/13/2021I'm not opposed to vague instructions, but I'm not sure how to interpret a \"wedge\" of onion- is this a thick slice, or like a quarter? Should the root still be on?Katie M.Philadelphia9/7/2021I agree with the comments that roasting the gnocchi separately (even on the same sheet pan), or pan frying, is a more foolproof method. \n\nBut to \"anonymous\" in Rome who is outraged at this treatment because it doesn't exist in Italy: do you only eat foods that are prepared exactly the way the Italians do? Is it illegal to do otherwise? Are there dire consequences if, say, you eat a meatball sub? Please advise ASAP.Linda RSF Bay Area9/3/2021To everyone that made this and the gnocchi wasn't crispy.\n\nNot sure if this was left out intentionally but I always turn the broiler on and let it sit under it for 5 minutes (or more, keep and eye on it) and that will reduce juices and give the gnocchi a nice golden crispy brown.Ryan K.California8/30/2021This is fine. But the reviews below are all true - no way will the gnocchi crisp up in an oven mixed with a bag of  tomatoes in 25 minutes! Just roast the tomatoes, onions and garlic as the recipe but pan-fry the gnocchi separately to get it crispy, then Combine at the end. Easy!Anonymous8/26/2021This was tasty, but my tomatoes produced way too much juice too soon. I’ll try again but roast the gnocchi and onions in one pan, and the tomatoes in another.Anonymous8/26/2021This really didn't work for me. My gnocchi didn't turn remotely golden or crisp at all, but my tomatoes were getting so burst the juices were starting to bake off and dry out. Wondering if my tomatoes were too ripe and burst too soon?  In addition the leftovers the next day were nearly inedible as the texture on the gnocchi became quite weird. AnonymousBerkeley, CA8/25/2021Explore Bon AppétitGnocchiCherry TomatoTomatoVegetableArugulaLeafy GreensBasilHerbs & SpicesParmesanCheeseSummerQuickEasySheet-Pan DinnersWeeknight MealsMainNut-FreeVegetarianHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Sarah Jampel"]}