{"id": "9a91b841593bd62559132dffb800285f", "url": "https://www.bonappetit.com/recipe/rustic-shrimp-toasts", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "Rustic Shrimp Toasts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRustic Shrimp ToastsBy Christian David ReynosoJanuary 18, 20214.4(38)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintThis version of shrimp toast is inspired by my time at Zuni Café, where I made late-night snacks using unsold shrimp and leftover bread that practically begged me to toss them with aioli and whatever else I could squirrel away. They’re equally great as an appetizer or as a main dish.Some practical stuff: Don’t skimp on the lemon here. Juice these babies up! The tart juice is necessary to cut all the richness. Watch these toasts carefully while they broil; they can go from perfectly cooked to too crisp in a snap. Also, try making your own aioli (garlic mayonnaise) here—it really makes a difference. But, store-bought, sugar-free garlic mayonnaise will work too.IngredientsMakes 81lb. large shrimp, peeled, deveined, rinsed, patted dry, halved lengthwise4scallions, cut into 1\" pieces3Tbsp. drained capers1tsp. crushed red pepper flakes½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt½cup plus 2 Tbsp. store-bought or homemade aioli4half-inch-thick slices country-style bread2Tbsp. extra-virgin olive oil⅓cup coarsely chopped parsley leaves2lemons, cut into wedgesPreparationStep 1Heat broiler (set to low if you have that option). Mix shrimp, scallions, capers, red pepper flakes, salt, and ½ cup aioli in a medium bowl to combine. Spread bread slices with remaining 2 Tbsp. aioli.Step 2Arrange shrimp, cut side down, in a snug, even layer on bread, all the way to the edges. Pack capers and scallions on, under, and between shrimp—wherever they will fit. Press shrimp mixture into the bread to ensure good contact. Place on a plate and chill at least 10 minutes and up to 30 minutes (this will help shrimp better adhere to bread).Step 3Heat 1 Tbsp. oil in a large ovenproof skillet over high. Cook 2 toasts, bread side down, 15 seconds, then transfer skillet to oven. Broil, watching toasts carefully, until golden and crisp in spots and shrimp turn pink and curl slightly, 5–7 minutes. (Broiler heat varies widely, so check on toasts every minute or so.) Transfer toasts to a cutting board. Repeat with remaining 1 Tbsp. oil and 2 toasts.Step 4Cut each toast in half and transfer to a platter. Sprinkle with parsley and serve with lemon wedges for squeezing over.How would you rate Rustic Shrimp Toasts?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI substituted pesto for the aioli.  Also par-baked the shrimp (after marinating) to get some of the moisture out.  Worked great!  BurnsSaint Augustine, FL7/13/2021This is my go-to for dinner party snacks these days. It's so flavorful, rich, and changed my mind about shrimp. Making aioli can be a little time-consuming, but once you have the technique you can go back again and again.AnonymousLos Angeles, CA6/3/2021The flavor was great, but the aioli made my toast very soggy. I think it would be better having shrimp cooked separately then put on toast.Brian LiWest Lafayette, IN4/16/2021Seems like most reviewers haven’t made the recipe, which is very good. I didn’t have—or feel like making—aioli, so used mayonnaise thinned with some lemon juice. It worked! You really need the capers and squeeze of lemon at the end to cut the richness. The crusts of my bread were black before the shrimp was completely cooked, so I think I’d skip the oil and pre-toast on the stovetop next time. And there will be a next time!Redpaintedtoes Seattle, WA2/13/2021I feel like you shouldn't have step one be \"heat up your broiler\" if step two involves refrigerating something for 15+ min.  LucySt Louis, MO1/27/2021This recipe was pretty easy but I made a lemon aioli which I think really brought it to life (1/2 a lemon zest and juice, garlic, chives or dill with 1/2 cup mayo). Dust with a little paprika on top for additional color. I also used frozen cooked shrimp and 3 - 4 minutes under the broiler was great.CookingwithSreeLos Angeles, CA1/26/2021Fabulous recipe. BUT recipe calls for 1 teaspoon crushed  red pepper flakes. Unless you have a masochistic streak, try a bit less. I used 1/4 teaspoon and it was perfect. Also, for a quick aioli without using raw eggs search “Cheaters Aioli”online. Fast and incredible flavor. This recipe is a winner and we will add it to our appetizer rotation when we begin having dinner parties again. JackieScottsdale, AZ1/26/2021I love mayo, and Aoli even more. I think i will attempt to make it. I had red pepper aoli made for me before it was to die for.but it looked like alot of work. I have all the ingredients for your recipe here i go!JennyTurner Or.1/23/2021The print button is on the left border but you have to scroll down into the main body for the box to show.TooLKnoxville, TN1/20/2021Where is the \"Print\" button for these recipes???\nPRungeBay Area CA1/20/2021That’s too bad you don’t like Mayo. Maybe try puréed white beans with olive oil? DittoPortland, OR1/20/2021To the reviewer below, how about hummus?  I DO love Aioli though and will be making this on the upcoming weekend.  I plan to add manchego because who broils without cheese?  I will post my after tasting review then.Beth from CARedondo Beach, CA1/20/2021I haven’t made this yet, but I would like to with a modification.  I truly dislike mayonnaise, sour cream, yogurt, or anything of the sort.  Can you recommend a replacement or can I just leave that element out completely?TravelerSouthern California 1/18/2021Explore Bon AppétitToastShrimpShellfishSeafoodEasyWeeknight MealsStarterSnackDairy-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-18", "author": ["Condé Nast", "Christian David Reynoso"]}