{"id": "9a978f4cf45aef14c93c164a339d8665", "url": "https://www.bonappetit.com/story/lauren-friel-alabama-abortion-ban", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Rebel Rebel Wine Bar Is Giving Away $25K Worth of Rosé to Support Women’s Reproductive Rights | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy My Bar Is Giving Away $25K Worth of Rosé to Support Women’s Reproductive RightsRebel Rebel owner Lauren Friel responds to the Alabama abortion ban.By Lauren FrielMay 21, 2019FacebookTwitterEmailPhoto by BUCK HARLAN SQUIBBFacebookTwitterEmailLauren Friel is the owner of Rebel Rebel, a feminist natural wine bar that opened in Somerville, Massachusetts, in 2018. With the recent passing of the Alabama abortion ban (House Bill 314), the bar’s mission as a place of community engagement comes into even sharper focus. Here, Friel describes her own reaction, and the action she and her community has taken, as a result.Most nights, Rebel Rebel is a warm and buzzy place. It’s lit by the glow of candles and neon. We play Gang Starr and Lizzo, and our small staff leans over the bar to chat with a loyal guest base of locals and industry friends. It feels intimate and familiar. It’s even been dubbed the “wine womb.”But when Alabama passed the strictest abortion ban in recent history last week, the mood at my small wine bar was decidedly different. When I saw Grace, my GM, the next day, she was visibly upset. Margot arrived a few minutes later with the same look of hopelessness on her face. The combination of rage and fear that passed through my own body was acute and physical. And though we skipped a lot of work that day to talk about how angry and scared we all were, we all agreed how important it was to keep fighting.Before it was anything more than an unfinished concrete box, I knew I wanted Rebel Rebel to be a feminist bar. To me, that means a lot of things, but first and foremost it means creating a space where my staff—currently, a team of nine incredible women—is supported. We do last call an hour earlier than our license allows, because I want them to get a good night’s sleep (I also don’t want them trying to get home when all the other bars are getting out; walking alone is scary enough without drunk folks around every corner). No one works more than four shifts on the bar (I come up with an additional admin shift if they need five days of work), and I pay for our full-time employees’ health insurance (they pick their plans, I foot the bill). I pay for job-related education and travel, and I try to make sure they have access to all of the people and information I have access to.We also have a zero tolerance policy for any kind of garbage behavior, especially from guests. We’re committed to being a safe space for women, queer people, trans people, disabled people, and people of color. Above all, we make conversations about mental health, queerness, financial stability, and women’s rights part of our daily communications, whether it’s through conversation, sharing of resources, or sharing in activism. We do all of this because we want to create a diverse community, and because it’s the right thing to do. It’s pretty simple.But none of it would have been possible for me without reproductive rights. Like a lot of women I know, I’ve had an abortion. I was lucky. I knew I was pregnant as soon as I missed my period, and I knew exactly what to do, because I worked the hotline at Planned Parenthood for years. During that time, I counseled hundreds of women on their options, their risks (there aren’t many), and their rights. Choosing abortion wasn’t a difficult decision. I wanted (and still want) kids, I just knew I wasn’t ready then. I had other dreams I wanted to chase first, and owning my own business was one of them. Having an abortion gave me a chance to build the kind of life I wanted.So, when the news dropped on Wednesday morning, I got a little loud. I threw a post up on Rebel Rebel’s Instagram page that said, in short, We’re not going to take this lying down. I decided we’d donate 100 percent of rosé sales (sales, not profits) to the Yellowhammer Fund, an abortion fund in Alabama that assists with the cost of the procedure, as well as travel and lodging expenses. In states where abortion access is already restrictive, abortion funds are crucial in bridging financial and physical gaps to care. I decided on rosé not because it’s pink and feminine-adjacent, but because people already want it this time of year; I figured it’d be the easiest way to get folks to give us their money.Since Wednesday, our 286-square-foot wine bar has raised over $17,000 for Yellowhammer. Most of that is in sales of $12 glasses of wine that was generously donated by our like-minded distributors. This past weekend, hundreds of people showed up to buy a glass and be with their community. We got hugs, high-fives, and cash donations to our Karma jar, a big glass Ball jar that sits on our back bar and is usually devoted to collecting funds for Planned Parenthood (we collected $1,000 in what was basically pocket change last year).So many people who came through our door thanked us for the opportunity to do something, and there are now more than 25 businesses in three states participating in what’s been dubbed #RoséForResistance thanks to the help of Isenberg Projects, a female-owned marketing firm donating its time to help amplify our initiative. Together, we’re looking at exceeding our new fundraising goal of $25,000.This week taught me that our industry has a real shot at making activism easier, because we can take the edge off. It can be hard for folks to get involved with activism. It can be overwhelming, both in knowing where to start and confronting the inequalities within our communities that necessitate activism to begin with. It’s difficult to think about how our neighbors are suffering, and how our privilege might contribute to or enable that suffering. So often, that sense of helplessness becomes inaction. We do nothing, because there’s too much to do.I believe that bars and restaurants can be the spoonful of sugar on top of all that difficult medicine. We’re social spaces devoted to pleasure. We’re also an industry that’s just beginning to acknowledge all of the work we still have left to do.We’ve been on our soap boxes, shouting about the need for more representation when the Best Of lists come out and it’s mostly white men on the magazine covers. We’ve demanded better access to capital so women can own their own restaurants. We’ve laid bare the truths about hospitality’s patriarchal culture that excludes women at best, and endangers them at worst. First it was #MeToo, now it’s #YouKnowMe—another hashtag for our humanity.But how often do we consider a woman’s reproductive rights when we preach about her place in this industry? Why aren’t we willing to admit that part of the reason women have trouble accessing capital is that investors consider a uterus a liability? Despite the fact that women make up more than half of our industry’s population, there are too few conversations devoted to the state of our rights over our own bodies. How can we claim to want a culture of gender equality if more than half of our population’s rights are currently under attack? How can I claim to run a feminist business if I don’t acknowledge that an all-female staff comes with body parts—and lives, and ambitions, and futures—that they’re told they have no agency over? If we want to get serious about women succeeding in this business, we need to start being honest about what it means if abortion care is restricted or banned altogether. Being well-rested with a savings account doesn’t mean much if you don’t have bodily autonomy.When we confronted our guests with an opportunity to engage with activist issues in an environment that’s community-oriented and friendly, it resulted in nearly 100 percent participation. We heard from folks who were learning about abortion funds for the first time. We helped guests understand how legislation works at the federal level. Most importantly, we met each other, and we committed to enact change together.People might say I’m brave to share my story, but I don’t want to be brave; I want to be boring. I want discussions about reproductive rights to be common and frequent, and I want our industry to lead them. Last week I was reminded that I have the power to engage, educate, and embolden. I claim to want diversity and equality, and now the pressure is on. What excuse do I have to continue to stay silent?Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Lauren Friel"]}