{"id": "9aa066e1bed68e63452ed8209db4c4fd", "url": "https://www.bonappetit.com/story/want-to-cook-swordfish", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "How to Cook Swordfish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSo You Want to Cook SwordfishIt’s meaty, versatile, and super forgiving. What are you waiting for?By Kendra VaculinJune 25, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailSwordfish—stay with me here—is like the perfect plain white T-shirt. A quiet and unassuming part of your rotation, it doesn’t demand any special treatment. It can be dressed up or down, equally suitable (with the right accessories) at a fancy dinner party or sweaty backyard barbecue. It goes with just about everything in your closet (er, pantry) and works at any time of year. Plus, on the days when you just can’t be bothered to spend more than 10 minutes getting your outfit (or dinner!) together, it can absolutely carry the team. As far as I can tell, the only difference is that swordfish looks a little better covered in sauce.Once you know what you’re looking for at the seafood counter, cooking swordfish at home is a flexible operation. Feel like grilling? Swordfish is the ideal choice, particularly if you’re sticking to seafood, because it’s sturdy enough to stand up to direct heat without sticking to the grate or falling apart. More of an indoorsy person? Take to the stove or oven instead, where your finished swordfish will be no less moist and ready for any topping or sauce. Read on to learn why swordfish can do it all and how to make sure you nail it every time, no matter what route you take.It’s a steak. (But also not a steak!)At the fish counter, you’ll find swordfish sold as steaks—thick pieces with a swirly muscle pattern that usually weigh between 6 oz.–1 lb. each. As the name suggests, these are hefty cuts that feel more like rib eyes than fish fillets, with a meaty, juicy texture to match. It’s this size and texture combination that gives swordfish steaks the ability to appeal to both beef lovers looking to switch up their protein game and pescatarians who want in on easy summertime grilling.When shopping for swordfish, thickness is important. Request pieces that are at least 1\" thick, as anything thinner could bend and break in half when you flip it. Also look for steaks that are pale cream in color with tinges of pink; a reddish streak or two is okay, but anything brown should be avoided.It’s a blank canvas.Swordfish is super mild in flavor, making it the perfect not-so-fishy fish to pair with just about any sauce, marinade, or topping. The texture helps too: Because it’s firmer and more substantial than most other fish, chunky salsas and heavy spreads work just as well as they would on chicken or pork. Soak your steak in a spicy harissa or soy-and-citrus marinade (for just about 15 minutes, to keep it from going mushy); drizzle it with an herby salsa verde or caper butter; pile on a heap of citrus, chunky olives, or tomatoes—you can take it in any flavor direction you like.It’s foolproof.The best part about cooking swordfish is that it’s almost shockingly unfussy. The sturdy steaks can be seared, roasted, broiled, or grilled in mere minutes, and because most recipes call for you to cook the fish all the way through, you don’t have to do any guesswork to figure out when it’s done. You can track the cooking progression by watching your steak turn opaque up the side; once it feels firm to the touch and flakes easily with a fork, you’re good to go. For a 1\"-thick steak, this means about 5–7 minutes per side over medium-high heat in a pan, on the grill, or under the broiler, or 7–10 minutes total (no flipping required) in a 450°F oven.No matter how you choose to cook your swordfish, don’t forget the oil. Rubbing the steaks on both sides with neutral oil before grilling ensures they won’t stick to the grate, and a drizzle of olive oil before roasting or broiling adds a little extra richness. For even coverage, pour a few tablespoons of either oil into a baking dish and then add the fish, turning to coat.Last but not least, it works on a stick.Fun twist! While whole steaks can serve one to two people each depending on their size, swordfish skewers are a great alternative for bigger groups and cook even more quickly. Just cut your fish into cubes—the solid texture helps it hold its shape and even take on those delightful grill marks during cooking—and thread them onto skewers, alone or with other ingredients. Summery vegetables like zucchini or peppers? Steak (like, actual steak) for a surf-and-turf-style kebab? Like everything else about swordfish, it’s an adventure you can choose yourself.Get the Recipe:Grilled Swordfish With TomatoesIf you’ve never grilled fish before, this recipe, featuring forgiving swordfish, is the best place to start.View RecipeExplore Bon AppétitBasicallytechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-25", "author": ["Condé Nast", "Kendra Vaculin"]}