{"id": "9aa73c842fd18d970e7012cee26a401e", "url": "https://www.bonappetit.com/story/anya-peters-kit-an-kin-pop-up-nyc", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Kit an’ Kin: The Caribbean Pop-Up Dinners That Brought a Whole Family Together | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Caribbean Pop-Up Dinners That Brought a Whole Family TogetherAnya Peters founded Kit an’ Kin, a Caribbean dinner series in New York City based on her family’s recipes.By Amiel StanekAugust 16, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThe pop-up used to be the resourceful chef’s restaurant—a means for young cooks to temporarily sidestep the hurdles and headaches associated with brick-and-mortar ownership and prove themselves to the public (and potential investors). But in 2018, pop-ups aren’t merely a precursor; they’re the format of choice for a generation of chefs whose ambitions could never be contained by four walls. From live-fire obsessed chef Danny Newberg, who dropped out of the NYC fine dining scene to host site-specific events under the name Joint Venture, to the work of the I-Collective, a far-flung community of Indigenous chefs and activists who collaborate on events highlighting issues of food sovereignty, sustainability, and native foodways, some of the most compelling meals we had this year were as ephemeral as they were delicious.Take chef Anya Peters. After graduating from the Culinary Institute of America, the 21-year-old felt far away from the Trinidadian and Jamaican home cooking that inspired her to pursue a career in food in the first place.“I was like, if I’m going to reconnect with my heritage, I gotta ask my O.G.s,” she recalls.The chef, Anya Peters\nPhoto by Emma FishmanSo Peters launched Kit an’ Kin, a mostly-monthly Caribbean dinner series that allowed her to not only honor her family’s culinary traditions, but to literally cook alongside the parents, siblings, and grandparents who made the Sunday suppers of her childhood so special. “I finally found who I want my teachers to be, and how I wanted to learn,” she says. “Anyone who has been to our events has eaten food cooked by my dad and been served by my mom.”The feasts, which feature island classics like coconut-laced rice and peas, fricassee chicken, and flaky patties stuffed with tender braised oxtail, are held at Cafe Erzulie in Brooklyn, on a backyard veranda that Peters and her father built to emulate her mother’s childhood home in Jamaica.“I’m the chef,” Peters says, “but really I’m a connector, a liaison, and a platform. I want each pop-up to hold space for a family member I’ve learned from.”Read more about the 25 restaurant trends we saw in 2018Explore Bon AppétitHot 10 2018The Hot 10Caribbean/Central AmericanRead MorerestaurantsFor Digby Stridiron, All Roads Lead Back to the Virgin IslandsBy Korsha WilsonsponsoredThese 5 Cocktails Will Make You Want To Escape to the Caribbean ASAPBy Princess Cruisescooking'It’s Puerto Rican Because I Made it'By Korsha WilsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Amiel Stanek"]}