{"id": "9ab1dbd336012ef7d38a3878af966fec", "url": "https://www.bonappetit.com/story/cutting-fresh-fruit-for-dessert", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "Cutting Fresh Fruit for Dessert Is How I Express Love | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIf I’m Cutting Fresh Fruit for Dessert, I Probably Love YouMaybe when it comes to dessert, we should just...try less.By Priya KrishnaJuly 29, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI don’t come from a family of bakers. My mom, an immigrant from India, didn’t know the first thing about buttercream varieties or stiff peaks when she arrived in Texas in 1980, and she was a health nut, anyway, so it didn’t really matter. Instead, our dinners at home always ended with fruit.Maybe this sounds lame to you. Like the families at Halloween who give out toothbrushes instead of candy. But I don’t care. I love the fruit!In India, my parents grew up eating chikoos, custard apples, fresh coconut, and dozens of types of mangoes. Here in the U.S., the fruit variety is much more limited. So year-round, my dad, our family’s designated grocery shopper, would visit the various Korean, Vietnamese, and Indian grocery stores in our Dallas suburbs in search of interesting varieties. In the winter, he’d buy pomegranates, and spend the afternoon carefully peeling them, ruining many white t-shirts in the process. He’d serve them to us in deep, stainless steel bowls, giving each our servings a quick scan to make sure there were no lingering pieces of pith. Spring brought star fruit, slice into thin, juicy pieces. My sister and I adored the shape, and the pucker-inducing flavor.Summer was mango season. He’d bring them home by the crate, and closely watch them ripen during the week. With a paring knife, he’d slice off the skin, cut a checkered pattern into each cheek, and then slide the cut pieces into a bowl, handing either my sister or me the seed so we could suck on the excess flesh. Occasionally he’d come home with a watermelon, which he’d break down into cubes and sprinkle with chaat masala, a perfect sweet and salty combination.When my parents entertained, they weren’t spending the day whipping egg whites or frosting cakes. My dad was slicing up some strawberries that my mom would lightly marinate in Cointreau, or peeling mangoes that would go atop a scoop of store-bought ice cream. Our guests went nuts.I’d like to think that cutting fruit was how my dad expressed his love to us. We didn’t have big heart-to-hearts. We didn’t attend father-daughter dances. But watching that guy painstakingly break down a pomegranate for our post-dinner enjoyment was all I needed to see.I’d like to think that cutting fruit was how my dad expressed his love to us.But then I left home for college and I mostly stopped buying fruit. What I did consume involved waxy apples and under-ripe bananas from the cafeteria. If I had berries, they were frozen and part of a smoothie. I was eating for fuel and efficiency. Plus, no local grocery store or dining hall was stocking the creamy mangoes and gloriously sour starfruit that I craved.When I was living in my first apartment in New York, fruit was an expense that fell by the wayside. On my 12 dollar an hour internship salary, the best I could do for dinner was scrambled eggs with spinach, or pasta with jarred tomato sauce. The only fruit I consumed were 19 cent bananas from Trader Joe’s.My parents would call me every week and ask: “What’s in your fridge right now?” When they’d hear my pitiful response, my mom would sigh and say, “Beta, you can afford to buy yourself some fresh fruit.”It helped when I moved next to a farmers’ market, where I could literally see what fruit was available from my window. I decided I would allow myself to splurge on a pound or so of one good-looking variety of fruit a week, whether it was a pack of candy-like strawberries, or ripe peaches, or a squishy, tart apricot. I found myself following a similar ritual to my dad. When dinner was wrapping up, I would take out the fruit, and cut it into bite-sized pieces. Sometimes I’d season it with chaat masala, or chili powder. Most times I’d just eat it on its own. But I’d always take the time to cut it, like my dad did. Cutting fruit forces you to take a little extra time to enjoy it. You appreciate it more.If I was going out of town and there was ripe fruit in the fridge, I’d cut it up and freeze it, so I could come back to it later. There are few better feelings than discovering strawberries in your freezer in September, even if they are slightly icy.And when I have friends over, unless my roommate decides to bake (which, to be honest, he does quite a bit), I know exactly what I’m serving my guests for dessert. I’m not a baker. I know my limits. I’m splurging on fruit, cutting it up on a board, maybe putting some chili powder in a small bowl for dipping, perhaps a hunk of cheese on a side. If I’m cutting you fruit, it means I adore you.As home cooks, we are often obsessed with this idea of dazzling our guests with fancy, mile-high sweets that took us all day to make. What I’ve learned from my parents is that maybe when it comes to dessert, we should just...try less. Maybe the best thing we can do for both ourselves and our guests is to take the simplest, most straightforward approach.Why not slice up some fruit and call it a day?Explore Bon AppétitHealthyishFruitHealthy DessertsessayRead MorecookingBerries and Cream: The Best Summer Dessert to Make NowBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-29", "author": ["Condé Nast", "Priya Krishna"]}