{"id": "9ab298cad0da65a0e890b712a1e31401", "url": "https://www.bonappetit.com/story/clean-with-your-drill", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "To Clean the Grimiest Sheet Pans, Break Out Your Power Drill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTo Clean the Grimiest Sheet Pans, Break Out Your Power DrillAttaching a brush head to a drill is my idea of a good time, HBU?By Maddy Sweitzer-LammeJanuary 19, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Does attaching a scrub brush to a drill and going to town on almost every surface of a house sound like something a person of sound mind would do? I’m asking because yes, I did this, and I realize it absolutely sounds like a bit much. But you know what? It worked.I was inspired by an internet video of kitchen hacks in which the host was doing a semiannual deep clean of her cooking equipment. She had a stiff brush attached to her drill, which she used to put some serious back into making her pots and pans shine. As the proud owner of a drill myself (praise me for my maturity and sensible adult purchases!), I was shocked and delighted. I wanted to do the same thing.I kind of assumed that these drill attachments would be difficult to come by or that I would need to rig it up myself with some craftiness, but it turns out they’re more common than I thought. I found a set of three brushes at my local hardware store and brought them home.All-Purpose Drill Scrub Brushes Kit$18 $10 at AmazonThe first pot I tried the drill on was my copper saucepan. Up until the drill brush came into my life, I had done an admittedly terrible job on the upkeep of this high-maintenance material. (In my defense, the pan was given to me, so I didn’t sign up for it.) I’m aware that all it takes to keep copper shining is a little Bar Keeper’s Friend and a few minutes of my time, but I simply had not given it even that. The combination of Bar Keeper’s Friend and my new drill scrubber, though, made extremely quick work of polishing the pot, and I’ve been enjoying its new gleam ever since.Photo by Ted \\+ Chelsea CavanaughBar Keepers Friend$8 at AmazonMy next project was to turn my attention to my low-key disgusting sheet pans. Although I know it doesn’t actually affect functionality, I hate when my pans get that blotchy look from burnt-on bits. Removing that type of splotchiness would typically require significant elbow grease, but this is exactly the type of thing that this drill attachment was made for—and my sheet pans have never been cleaner.Despite the rather unhinged intensity of cleaning with a drill, I have to say, it was absolutely worth it. Removing the physical intensity of certain cleaning jobs made me avoid them far less, and to be honest, I found the whole thing pretty amusing—the fact that it was so over-the-top made me laugh at myself, which made cleaning that much less a chore.Now that those pans are clean…1 / 30ChevronChevronSheet-Pan Chicken Meatballs and Charred BroccoliView RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-20", "author": ["Condé Nast", "Maddy Sweitzer-Lamme"]}