{"id": "9aba28e2af5fac77b116de5fc0cfd5a4", "url": "https://www.bonappetit.com/story/peckish-eggs", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Peckish Eggs Are Everything We Didn't Know We Wanted in a Snack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Hated Hard-Boiled Eggs With a Passion Until I Tried These Peckish SnacksThey're boiled to perfection, paired with fun toppings, and made for snacking on the go.By Ali FrancisJanuary 21, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt hurts for me to even remember, let alone publicly reveal, a period I call Life Before Eggs. But yes, there was a time when those little chicken embryos were just Not. My. Thing. I was particularly opposed to the chalky, crumbly yolks that my young tastebuds associated with garden soil, and I’d beg my good, protein-peddling Ma for “just the whites, pleeeeaase.”It wasn’t until recently, when I tried Peckish, that all that changed. These aren’t just any eggs! Peckish—a direct-to-consumer, hard-boiled egg company incubated by Jon Sebastiani’s Sonoma Brands—sells organic, free-range, and certified-humane eggs in very pretty packaging. These eggs are boiled to perfection (okay, so they’re definitely on the well-done side. But who wants UPS to handle your jammy yolks, anyway?). According to VP of Brand Lauren Egan, nerdy chefs closely monitor cooking temperatures from start to finish. The resulting eggs are “exactly how we love to make them at home—not too hard and not too soft,” she says.Just look at that savory sprinkle.\nPhoto by Chelsea Kyle“But wait a minute,” you’re thinking. “What about those yolks you always hated?” Inside each of their Peck Packs, along with two individually wrapped eggs, comes a container of sprinkles in one of five flavors: Everything (yep, like the bagel), Fried Rice, Rancheros, Salt & Pepitas, and Maple Waffles. You just dunk your egg, bite, and repeat. The toppings are all gluten and refined sugar free, paleo, keto, and Whole30, too. They’re made from things like organic quinoa crispies, roasted pepitas, and dehydrated veggies. And the only sweeteners you’ll ever see are coconut sugar and maple syrup.Aside from a quick snack, Peckish eggs and toppings are also easily incorporated into (sprinkled on) meals. Egan suggests adding the Fried Rice eggs to a quick ramen or the Everything flavor into a sandwich. “Rancheros on avocado toast is a crowd favorite,” she says.So sue me: I love hard-boiled eggs now.Back in Australia, we’d call this pivot a “Steve Bradbury.” It’s is a complex and culturally niche reference. But in this analogy, Peckish is Steve, triumphantly skating from underdog into the gold medal slot. Honestly, you just have to watch it.Buy it: Peckish eggs are available in multiple local retailers, and via their website.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishEggHard-Boiled EggsSnackHealthy SnacksShoppingRead Morerecipes54 Healthy Egg Recipes for Breakfast, Lunch, and DinnerGallery54 SlidesBy Nico AvalleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-21", "author": ["Condé Nast", "Ali Francis"]}