{"id": "9acef41e8d9339eb93eed4e2afb9645c", "url": "https://www.bonappetit.com/story/bradford-taylor-wine-philosophy", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "The Unordinary Wine Philosophy of Bradford Taylor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Unordinary Wine Philosophy of Bradford TaylorIf you’re way more into natural wine now than you were a few years ago, you might have the owner of Ordinaire in Oakland and Diversey Wine in Chicago to thank.By Marissa A. RossMay 17, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI stepped out of the cab and into a pile of slush, looking around the freezing-quiet block as the polar vortex settled in. I felt very alone: the only person on the street (Diversey Avenue) in an unfamiliar neighborhood (Logan Square) in a city (Chicago) far from home, looking for a wine shop I’d never visited, full of people I’d never met. Just as the gutter ice began melting into my boots, my eyes caught a glow in the window of my destination: Diversey Wine.As soon as I opened the door of the Chicago wine shop, I was bathed in warmth and welcoming. My spoiled Los Angeles bones were restored amid the white walls hugged by cozy Douglas Fir shelves lined with the friendly faces of bottles I’d loved, lusted after, or couldn’t wait to meet. It was Diversey’s Sunday tasting, and I found myself in conversations about cameras and cats in circles of strangers who didn’t feel like strangers at all. Bottles were popped and shared. I felt at home.This might all sound hyperbolic—perhaps the high of a good heater or the half dozen tastes of the Australian Lucy Margaux wines talking. But it’s not, and to understand why, you have to get to know Bradford Taylor. Technically, the disheveledly handsome 33-year-old is the wine shop’s owner, but truthfully, he’s a philosopher. Not in the aimless collegiate way that makes eyes roll or blows dinner parties full of hot Nietzschean air, but in true practice that is shaping modern American wine culture.“Wine is supposed to make you happy,” Taylor says, casually swirling his glass of Jean Ginglinger’s Pinot Gris around the back table of Diversey Wine the next day. We were alone aside from the hum of the heater, but Taylor radiates so much tranquility and openness, it would be impossible for the walls around him not to reverberate with the same energy. (And I’m saying that as someone who does not own any crystals.)Taylor never planned to open a wine shop, let alone three. After studying literature at Swarthmore College, he spent a year in Paris working at the famous Shakespeare and Company bookshop and hanging at classic wine bars like Le Verre Volé, where he began to drink natural wine the way most of us did—without realizing it. In 2012, Taylor was working on his doctoral dissertation on the concept of taste in modernist literature at UC Berkeley and living in Oakland when a visit from his father made him realize how ridiculous it was that every time he wanted to buy wine—the kind of wines he’d fallen in love with in France—he had to drive 30 minutes to Kermit Lynch’s shop. So, with a small loan from his father, he opened his own.Wines on tap at Ordinaire.\nErin KunkelOrdinaire was born in Oakland in 2013 and quickly became the West Coast’s capital of natural wine. As both a store and a bar, it was (and is) the antithesis of what most Americans have experienced when it comes to wine. Unlike the snobby and sterile shops that make you feel like you’re being watched and judged by a side-eyeing suit at a Chanel store, walking through the entrance of Ordinaire feels like stepping into the Cheers you never knew was there.Rather than treating Ordinaire as an isolated experience, Taylor used it as a template to spread natural wine across the country. In 2016, he and Josh Eubank (the importer for Percy Selections), Ordinaire alum Quinn Kimsey-White, and Matt Coelho of the Bay Area–based Woods Beer cofounded Brumaire, the wine-fair turned party in Oakland that brings together natural wine producers from around the world. Now in its fourth year, it sells out in days. In 2018, Taylor opened Diversey Wine in Chicago and became an investor in Los Angeles’ Psychic Wines, owned by Kimsey-White and chef Zach Jarrett. Taylor’s academic work focuses on how taste as a sense can be used to form alternative communities, and his projects are the physical evidence of his philosophies.No matter which of these sister shops you’re in, the selection of natural wines is expansive, and Taylor uniquely emphasizes offering as many releases from a single producer as possible to give customers an opportunity to explore the entirety of a winemaker’s work. In between these lineups, you’ll find those bottles you keep stocked in your fridge and rare releases that only someone like Taylor could be trusted with.The inventory, however, would be meaningless without the company it keeps. This is what has always struck me about Ordinaire: Whether I am sipping or shopping, I never feel like I’m being “sold” to. Talking with the staff feels like chatting with a new friend who can’t wait to share a cool find. They scan the shelves and excitedly pull bottles like someone would from a well-curated vinyl collection, eager to showcase an album I’ve never heard of but that’ll stay in my head forever. The seats are filled with regulars and locals, industry folks and winemakers, fans from far and wide. Ordinaire is a communal living room, as encouraging of intimate conversations over candlelight as it is house parties with mariachi bands. Everyone is there for the same reason: because it feels, and tastes, good.Books break up the selection of bottles at Diversey Wine in Chicago.\nPhoto by Alex Lau“Wine is supposed to fill you the same way food fills you,” Taylor says. “It gives you this deep sense of social community that is kind of rare. Bike shops have a similar thing. So do surf shops, coffee shops. It’s little spots where you go to find your people. It’s not a belief system, but a shared ideology.” And what is that ideology? “It’s not about getting natural wine in as many mouths as possible,” Taylor says, laughing. “It’s also really important to me that people can come in and get a wine for under $20.” And often those wines are not fully natty, bro. Taylor is against the use of commercial yeast but doesn’t shy away from good budget wines that use sulfur or filtration. “It’s about thinking of wine as a part of this economic system, and how do you get people into that economy? I remember living in New York, I drank $11 Portuguese wine. It was the only thing I could afford. But it’s how I eventually got into wine. I only got here because of people putting in hard work to find cheap wines that I could actually go and drink.”But there’s more to it than just value—a pretty good $15 Pinot Noir is not enough to create Taylor’s religious customer base. Any shop can host $10 tastings, but Taylor does it with lineups of Pierre Beauger bottles that would run you between $70 and $100 a pop. He’s known to buy highly allocated wines and, in Eubank’s words, “immediately run them by the glass for like eight bucks, or maybe just open them for free for some random guy who’s celebrating a win by the San Jose Sharks.” There was also a period where he was sabering “unlimited bottles of every type of Champagne to give away to anyone,” Jarrett recalls. Taylor takes what’s out of reach for consumers and puts it in their hands regardless of cost because to him the community it builds is priceless.On the surface, Taylor’s dedication to idealism over capitalism could seem irrational—one of those things your uncle scoffs at before telling you if you’re not a Republican when you’re old, you don’t have a brain. But Taylor has succeeded precisely because he isn’t choosing idealism over capitalism, but using one to facilitate the other. “It’s so important for small businesses to realize that what America values is accumulation of capital and entrepreneurship and to use that as a basis for reclaiming society through that back door,” Taylor says. “That’s how I think of Ordinaire. It’s a business, but just because that’s the only way to do it. It’s the only way to create this community.”A month after my Chicago trip, I was back in Oakland at Ordinaire, two nights before the fourth Brumaire festival. I was in the loft drinking magnums and joking with Eubank about his latest pet peeve of green wines—when grapes are picked early, or “green,” to increase acidity. The sea of people in the bar below hit high tide, the whole place swelling with excitement to kick off a weekend celebrating natural wine. It was the kind of moment you might expect the bar’s owner to be relishing in, maybe kicking back with a few good bottles. But Taylor was running around busing tables in track shorts. I finally caught him outside, knowing it would be the only moment I’d have with him all weekend. I don’t know what he poured me, but it didn’t matter—he was most excited to point out the smiling staff of Diversey waving at us from inside the window of Ordinaire. I realized then that it’s not business that created this community: It’s Bradford.Explore Bon AppétitWineSan FranciscoChicagoRead MorerestaurantsAll Chianti Is My Kind of ChiantiBy Marissa A. RosscultureIt’s Getting Harder to Tell the Difference Between Wine, Beer, and CiderBy Alex DelanycookingThis App Tracks All the Wine I Drink (Please Don’t Tell My Doctor)By Alex BeggscultureHow to Get the Most Out of Your Somm ExperienceBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Marissa A. Ross"]}