{"id": "9ada042c2fc821bb0b0534d25e57c57b", "url": "https://www.bonappetit.com/recipe/pernil-slow-roasted-pork", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Pernil (Slow-Roasted Pork) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPernil (Slow-Roasted Pork)By Rick MartinezDecember 9, 20194.6(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintNearly every family in Puerto Rico, the Dominican Republic, and Cuba has their own way of roasting pork for the holidays. This Puerto Rican version is almost always served with arroz con gandules (rice with pigeon peas), and the chicharrón (crispy skin) is heartily fought over. If you can’t find Sazón, you can use any other seasoning salt, preferably one with a Latin American flavor profile. And if on the off-chance you have any pork left over, use it to make the best sandwiches you’ve ever tasted.Ingredients8–10 servingsSoffritto2ripe plum tomatoes, cored, coarsely chopped (about 1½ cups)1medium onion, coarsely chopped (about 1 cup)2Cubanelle peppers, seeds removed, coarsely chopped (about 1 cup), or 1 medium green bell pepper, ribs and seeds removed, coarsely chopped1medium red bell pepper, ribs and seeds removed, coarsely chopped (about 1 cup)1large bunch cilantro, coarsely chopped (about 1 cup)1head of garlic, cloves separated, peeledPernil and Assembly1Tbsp. black peppercorns2heads of garlic, cloves separated, peeled21.4-oz. packets Sazón con Culantro y Achiote (such as Goya)½cup Diamond Crystal or ¼ cup plus 1½ tsp. Morton kosher salt2Tbsp. dried oregano2Tbsp. white wine vinegar2Tbsp. extra-virgin olive oil, plus more for brushing18–10-lb. skin-on, bone-in pork shoulderArroz con Gandules (for serving)Special EquipmentA spice mill or mortar and pestlePreparationSoffrittoStep 1Purée tomatoes, onion, Cubanelle peppers, bell pepper, cilantro, and garlic in a food processor until smooth. Scoop out ½ cup soffritto and set aside. Reserve remaining soffritto for another use (you can use it for the arroz con gandules).Step 2Do Ahead: Soffritto can be made 3 days ahead. Transfer to an airtight container, cover, and chill, or freeze up to 3 months.Pernil and AssemblyStep 3Finely grind peppercorns in spice mill or with mortar and pestle. Transfer to a food processor. Add garlic, Sazón, salt, oregano, vinegar, 2 Tbsp. oil, and reserved ½ cup soffritto and purée until smooth.Step 4Push a small paring knife (about 3½\" long) into pork through the skin, working the blade all the way in; twist knife to make a small hole in the meat. Repeat, making holes spaced about 1½\" apart on all sides of pork.Step 5Rub pork all over with adobo mixture, pushing into holes and covering any exposed meat and skin. Try to get as much adobo mixture into meat and not just on the surface, where it may burn when roasting. Be sure to use all of it! Wrap pork tightly and chill at least 3 hours and up to 3 days.Step 6Place a rack in lower third of oven; preheat to 300°. Line a large roasting pan with 2 layers of heavy-duty foil. Place a roasting rack on top. Set pork, skin side up, on rack. Scrape any adobo mixture off skin and thoroughly pat dry with paper towels. Liberally brush cleaned skin with oil. Transfer pan to oven and carefully pour 2 cups water into pan. Roast pork until an instant-read thermometer inserted into thickest part of shoulder registers 180°, meat is pulling away from bone, and skin is crisp, 5–6 hours.Step 7Let pork sit, uncovered, at room temperature at least 30 minutes and up to 5 hours.Step 8Before serving, preheat oven to 500° and reheat roast until skin crisps (don’t let it take on any more color), 5–10 minutes.Step 9Remove chicharrón (crispy skin) and cut or break into smaller pieces. Slice pork and transfer to a platter. Serve with chicharrón and arroz y gandules alongside.Pernil, right before the skin is crisped, next to the arroz con gandules.\nPhoto by Laura Murray, food styling by Yekaterina BoystovaHow would you rate Pernil (Slow-Roasted Pork)?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThe problem with the recipe is that  \"(2) 1.4-oz. packets Sazón\" sounds like you should add two boxes of the stuff. It should simply say \"(2) packets of Sazón\" (a 1.41oz box comes with 8 packets).Anonymous11/6/2021I agree with Oakland, CA.  Did you forget to cover it in the oven?\nNew JerseySea Girt, NJ10/19/2021Just FYI, MSG was never intended to cover up the flavor of meat \"that has started to turn\".  In fact, if you used it for that purpose you would be sorry.  MSG enhances whatever flavor is already in the food (read about \"umami\" which is the natural flavor effect MSG was designed to imitate).  So if the food tastes bad, it will taste worse with the addition of MSG...AnonymousPhiladelphia10/19/2021If you don't like MSG don't use it, if you don't like GOYA don't use their products. Chill out plz, its a great recipe and tastes amazing, as for me and my household .... we will trust in Rick Martinez because their food is great.SuckitupbuttercupColorado9/13/2021@Oceanside -\nIf you want to be apolitical, why mention politics at all in a recipe?\nDuh!LotusLand3/15/2021I know you are choosing to ignore the possible effect of MSG on some people but bear in mind, its original intention was to allow people to tolerate the taste of meat that had begun to turn. It fools the taste buds. If you need to do that then there must be something lacking in your recipe. Until fairly recently I had found no MSG in your recipes. Why the change? And, by the way, are you really totally oblivious to the Goya controversy? If you don't want to appear political why 'suggest' it at all?AnonymousOceanside CA12/6/2020WTH?  It's SOFRITO and what a confusingly written recipe. You must have a beginning recipe writer on your hands here. Oy. Tired of Stupid. USA 12/6/2020I'm so upset that you include MSG in your recipe. There is no reason to include spice packets with it. Please review your editorial policy towards publishing recipes with low quality artificial ingredients including MSG. I know it's controversial, but bon appetit should exist at a higher plane of quality and represent best practices in health, nutrition and ingredients. AnonymousWestport, CT3/9/2020Come on.  This is s a Cuban / Puerto Rican recipe, not Italian.  It's spelled sofrito, no \"soffritto.\"  Soffritto has onion, celery and carrots.  Nothing to do with Cuban sofrito.AnonymousNew York12/22/2019This recipe is the same way my grandmother does it minus the water and rack part. I'm curious about the covering the pernil in the oven part. Everyone does it, haven't met anyone who hasn't. Was this left out by mistake or is the water replacing the foil some how. I'm making this today so I don't expect anyone to respond lol. I am going to cover it though.... dun dun duuuuunOakland, CA12/21/2019This recipe sounds pretry legit but the sofrito is missing two key ingredients. Add 6 - 7 sweet chili peppers (capsicum chinense), seeded and finely chopped and 3- 4 culantro leaves (eryngium foetidum), coarsely chopped.\nAlso, before poking holes into the shoulder (something I don't do since the meat tends to \"bleed\" it's juices from these holes), you'll want to use a paring knife to completely separate the skin from the meat (trying to keep the skin as intact as possible).  Next, trim as much fat as possible from both the meat and skin.  This will help the skin become crispy instead of rubbery.  Then, you may poke holes into the meat (if you absolutely need to) and season both the meat and the skin.  Finally, place the skin over the meat (this will help keep moisture in if you went ahead poking holes into it).\nIf the skin hasn't achieved absolute crispiness by the time the meat is done cooking, you may remove it from the meat, place it in a cookie sheet and put it back in the oven for a few minutes until it is perfectly crispy and heavenly crackling.Alex IthierPonce, Puerto Rico12/15/2019I use just about the same recipe.  Got this while living in NJ. Those folks sure now their Pernil.   Only exception is I use about 12 garlic cloves and 3 packets of Sazon.  Hard to over salt a pork shoulder.prn19Tallahassee, Fl12/15/2019Explore Bon AppétitPuerto RicanCaribbeanCubanDominicanPork ShoulderPorkMeatMainDairy-FreeNut-FreeKetoRoastChristmasDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-09", "author": ["Condé Nast", "Rick Martinez"]}