{"id": "9ade01ee4852f555ec5cae9bc717a9bd", "url": "https://www.bonappetit.com/recipe/classic-french-toast", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "BA's Best French Toast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best French ToastBy Dawn PerryPhotography by Danny KimFebruary 25, 20223.9(234)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintWith an eggy soak enriched with both milk and heavy cream, this superlative French toast recipe winks at bread pudding. But it’s not just the ingredients that flirt with that other classic, there’s also something to the method. The bread in this recipe gets a long soak—about 10 minutes on each side—which delivers a remarkably custardy interior.If you don’t have cream on hand, you can substitute with extra whole milk (this is not the time for skim). Use Pullman, brioche, or challah—all tender, spongy breads that can stand up to the dairy drench—and slice the bread thickly to keep it from falling apart. There’s no need to dry out the slices, but if the loaf has been sitting on the counter for a day or two, all the better. Cooking the toast in a combination of butter and vegetable oil results in golden brown, lightly crisp edges and prevents things from getting too brown too quickly.Of course, there are lots of ways to make French toast, and no one said you had to stick with the classics. If you or your guests are dairy-free, consider these crispy French toast soldiers, which are made with orange juice instead of milk. When you’re entertaining a crowd for brunch—or hosting family for the holidays—French toast casserole is the way to go. It can be prepared almost entirely the night before; in the morning, simply brush it with butter and bake.Editor’s note: This recipe was originally published in December 2014.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron3-Qt. Baking Dish$17 At AmazonLarge Skillet$84 At AmazonFlexible Metal Spatula$9.99 At AmazonWire Rack$23 At BA MarketIngredients4  Servings6large eggs¾cup heavy cream¾cup whole milk¼cup sugarPinch of kosher salt6¾-inch-thick slices challah, brioche, or Pullman loaf2tablespoons unsalted butter, divided, plus more for serving2tablespoons vegetable oil, dividedPure maple syrup, jam, or powdered sugar (for serving)PreparationStep 1Preheat oven to 250°. Lightly beat eggs, cream, milk, sugar, and salt in a large shallow baking dish (a lasagna pan is perfect). Add bread, turn to coat, then press down gently on bread until you feel it start to soak up custard mixture—this is key for a luscious, not dry, texture. Let soak, 10 minutes.Step 2Flip bread and soak on second side, pressing down gently from time to time, until bread is saturated but not soggy, another 10 minutes or so.Step 3Heat 1 Tbsp. butter and 1 Tbsp. oil in a large skillet over medium heat. When foaming subsides, carefully lift 3 slices of bread from custard, letting excess drip back into dish, and cook in skillet until golden brown and center of toast springs back when pressed, about 2 minutes per side. Transfer toast to a wire rack set inside a rimmed baking sheet and keep warm in oven while you cook remaining slices of bread with 1 Tbsp. butter and remaining 1 Tbsp. oil.Step 4Serve French toast with butter, maple syrup, jam, and/or powdered sugar.How would you rate BA’s Best French Toast?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleEGGY BREAD CLEARLUCA GIANSTANFORD LE HOPE3/22/2022Best French toast ever! Perfectly cooked! I just added cinnamon to the mixture and served with sliced almonds and strawberries and it hit so hard. SimmySan Jose, CA3/6/2022If you cut the bread the night before and let it dry out overnight (or dry in a low oven for 30 minutes or so) it will both soak up more and hold together better\n\nShishkabobcanolieMerritt Island, FL3/6/2022I add orange zest which gives it a nice sparkle!  And vanilla, of course!\n\nClaudette MHamilton Ontario3/6/2022Sooo good! Added cinnamon, vanilla extract, and nutmeg. Can’t wait to remake for my boyfriend and I!Brittany Chicago, IL7/6/2021I made the recipe with a supermarket French baguette, but otherwise stuck to the recipe. If you don't use brioche and you soak the bread 10 minutes per side, good luck getting it out of the custard in one piece! Cutting it fairly thick will help.\n\nYou probably don't need to add more butter and oil to the pan between batches, either. RichSPKWorcester, MA 2/1/2021Such a good recipe! I added cinnamon into the egg & cream mixture because I can't imagine French toast without a little warm spicy goodness. Made with brioche but mine wasn't as thick as the recipe so beware of not letting it get too soggy. Otherwise this is such a great recipe!! AnonymousMinneapolis6/15/2020Just made this for breakfast! I cut this recipe in half and it was perfect. I used brioche bread from Trader Joe’s and added a dash of cinnamon to the custard. Topped with ripe strawberries and a dash of strawberries. Would 100% remake! AnonymousLos Angeles3/15/2020Sorry not a review... but a question. If I can edit this I will add my review afterwards... is that a typo or am I reading it incorrectly. Soak the bread for 10 mins per side???AnonymousNC11/19/2019Holy hell, this is amazing. More of a bread pudding texture than the french toast I'm used to, and it has OPENED MY EYES to what french toast was meant to be! I added a dash of vanilla to the custard and used homemade cinnamon milk bread for it, and all I have to say is: WOW. And so simple! It really is the kind of thing that can be thrown together in between the other steps of my morning routine. honeybeebutchMinneapolis8/31/2019Loved this recipe! Will definitely be using it one again.Atlanta,GA8/13/2019An absolute winner! I did a test run for mother's day a few days in advance, following the steps as written, and was more than happy with the results. The only thing that I did differently for mother's day was add cinnamon, vanilla, and a dash of almond extract to the custard. Since I was making a lot for mothers day (30 pieces), I fried three pieces at a time two hours before everyone arrived but did NOT put them into the 250 degree oven. Instead, I placed them onto cookie sheets to cool and cooked them in a 400 degree oven when everyone arrived until warm and the custard was set. I used homemade brioche bread made in loaf pans and cut each slice diagonally before dredging. AnonymousVoorhees NJ USA5/16/2019I fell in love 😍 AnonymousMiami3/27/2019Straightforward and delicious made with an old italian loaf.   The perfect basic recipe that can be dressed up on weekends.   Anonymous3/20/2019I like the recipe and the soaking technique. However, there are a few missing ingredients that make French toast, well, French toast: a teaspoon of vanilla extract and plenty of cinnamon! Perhaps there are regional differences in preferences.  I also add a dash of freshly grated nutmeg. Sometimes I add a dash of Penzey's Pie Spice in place of the cinnamon and nutmeg. I have not used heavy cream with the milk before; that is a nice adjustment I plan to make.wilron8628connecticut3/19/2019Explore Bon AppétitEasyNut-FreeVegetarianEasterBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-12-17", "author": ["Condé Nast", "Dawn Perry", "Danny Kim"]}