{"id": "9ae2769aea6060cffc4c0aec1da7702b", "url": "https://www.bonappetit.com/recipe/party-posole-rojo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Party Posole Rojo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueParty Posole RojoBy Anna StockwellMarch 20, 20184.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe last time we threw a dinner party with multiple courses and matching dinnerware was…well, we can’t remember. When we entertain, we want everyone to have fun—including the host. Enter posole, one of the tastiest, prettiest one-pot dishes on earth. Make ahead and all that’s left to do is ice some beers and set out all the toppings. This is no-stress party food for the win.Ingredients12 servings Posole1½lb. dried large white hominy, soaked overnight2large onions, peeled2bay leaves6black peppercorns3Tbsp. kosher salt, divided4lb. bone-in country-style pork ribs1Tbsp. ground cumin6garlic cloves, finely choppedChile Purée and Assembly2½oz. dried New Mexico chiles2½oz. ancho chiles1large onion, coarsely chopped6garlic cloves, crushed¼cup apple cider vinegar2tsp. light brown sugar1tsp. kosher salt, plus moreAvocado wedges, cilantro sprigs, thinly sliced cabbage, sliced jalapeños, sliced radishes, lime wedges, sour cream, tortilla chips, and hot sauce (for serving)PreparationPosoleStep 1Drain hominy and place in a large heavy pot; add onions, bay leaves, peppercorns, 2 Tbsp. salt, and 12 cups water. Cover and bring to a boil. Reduce heat to medium-low; simmer, still covered, stirring occasionally, until hominy starts to soften (some skins will split), about 1 hour.Step 2Sprinkle pork all over with cumin and remaining 1 Tbsp. salt. Add to pot along with garlic; pour in water to cover by 1\". Partially cover pot and cook, stirring occasionally and adding more water as needed to keep ingredients covered, until hominy is tender (some may unfurl like popped popcorn, and that’s okay) and pork is fall-apart tender, about 2½ hours.Chile Purée and AssemblyStep 3While the posole is cooking, make the chile purée. Wearing gloves if you have them, remove stems from chiles and shake out and discard most of the seeds (for more heat, keep more seeds). Transfer to a large bowl and add onion and garlic; pour in boiling water to cover. Let sit until chiles are softened, about 30 minutes.Step 4Drain chile mixture, reserving soaking liquid, and transfer chiles, onion, and garlic to a blender. Add vinegar, brown sugar, 1 tsp. salt, and 1 cup soaking liquid and blend until smooth.Step 5When posole is done, remove pork, onions, and bay leaves from pot (keep posole simmering). Transfer pork to a plate; discard onions and bay leaves. Let pork cool slightly, then pick meat from bones, discarding any cartilage and larger pieces of fat. Shred meat into bite-size pieces and return to pot; discard bones.Step 6Stir chile purée into posole and let simmer 30 minutes to allow flavors to meld. Taste and season with more salt.Step 7Divide posole among bowls. Serve with avocado, cilantro, cabbage, jalapeños, radishes, lime wedges, sour cream, tortilla chips, and hot sauce alongside for topping.Step 8Do Ahead: Posole can be made 4 days ahead. Let cool, then cover and chill.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Party Posole Rojo?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis is a no-fail recipe that my food-obsessed friends go crazy for!lifeofpieNYC6/5/2021This sounds amazing but for those of us that do not eat pork-- would beef ribs work??Stephanie2/21/2021Explore Bon AppétitPosoleSoupSoups and StewsMexicanLatin AmericanHominyRice & GrainsAncho ChileChileVegetablePork RibPorkMeatOne-Pot MealsMainNut-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Anna Stockwell"]}