{"id": "9ae463fcdeebc1ad790fdad3abb82e2d", "url": "https://www.bonappetit.com/story/january-horoscope-dumplings", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Your January Horoscope: Dumplings and Predictions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour January Horoscope: Dumplings and PredictionsRead your January horoscope to find out which dumpling pairs best with your Zodiac sign—then go eat tons of them, obviously.By Catherine UrbanJanuary 2, 2018FacebookTwitterEmailIllustrations by Kyle PlattsFacebookTwitterEmailWe've been seeing “New Year, New You” on every billboard and yet, what we really want is, New Year, More Dumplings. So January's food horoscopes are very celestial pairings of your Zodiac sign with...dumplings. Whether you stay inside on a cold Saturday and wrap hundreds of soup dumplings, or order in gyoza from the comfort of your warm couch, increasing your dumpling consumption this January will directly increase your happiness. That’s just basic economics.Illustration by Kyle PlattsAriesYou prefer to coast through life at your leisure, but you’ve recently been pushed out of your comfort zone in a big way. Whether it’s facing an unpleasant situation, or taking on more responsibility at work, it seems like you’re putting in a lot more effort these days. You might feel frustrated and want to rage-quit, but you’ve got a TON of determination on your side to stick it out. Your chill-out-remedy is some top-notch comfort food: a huge bowl of Chicken and Dumplings. These flour dumplings stay fluffy and soft thanks to schmaltz (chicken fat!) and are so irresistible, you’ll question what a serving size really means, anyway. Keeping asking those big questions in 2018, Aries.Illustration by Kyle PlattsTaurusYou‘re feeling a little burnt out after the holiday run-around, so the aim for this month is to simply go at your own pace. The most valuable thing right now is your attention. Tend to the odds and ends that have accumulated, and return your focus to that long-term project, or practice whatever it is you’ve been studying lately. Catch up on your backlog of podcasts one weekend and tackle a recipe project, like these xiaolongbao, Pork Soup Dumplings—a dish requiring your unrivaled patience, technical skill, and a clear schedule. Are we saying you should cancel those plans you regretted ever committing to and stay inside in your flannel pajamas, making hundreds of dumplings? Yes, yes we are.Illustration by Kyle PlattsGeminiRecently, it’s come to your attention that you need to redistribute how you spend your time. You prefer to keep things lighthearted and playful, but someone or something has been dampening the mood like cilantro you thought was parsley. Now it’s time to act. Whether you’re committing to a partner or a new interpretative dance class in the new year, ask yourself if your choice promises more satisfaction in the long run. We know how agonizing it is for you to choose one thing, Gemini—you love variety! But luckily, there are times when you CAN have it all. That’s why your dumpling need right now is pan-fried gyoza—soft and crispy at the same time, with plenty of filling options for someone who loves a little of everything.Illustration by Kyle PlattsCancerMaking others feel cared for comes easily to you, but this month, prioritize your own needs. You’ll have tons of energy, so you’ll probably be at the gym or yoga studio more often, and making plans to grab drinks with friends. Pretend it’s recess every day after work. If it sounds fun to you, then do it! The challenge this month will be saying “no” (isn’t it always?). But you know what sounds excellent right now? Staying home on Friday night to watch bad movies on Netflix, feasting on takeout’s finest fried appetizers: crab rangoon. Sometimes your own “needs” are a styrofoam container of crispy wontons filled with cream cheese, dipped in bright orange sweet and sour sauce.Illustration by Kyle PlattsLeoYou’re kicking off 2018 with some ambitious New Year’s resolutions, as you may have overdone it on the cookies last month. It’s in your competitive nature to go the extra mile, Leo, and the next thing you know, you’ve promised to swear off junk food and you signed yourself up for boot camp. But you always follow your heart, which guides you back to carbs. Go straight for the spicy Sichuan wontons in chili oil. These silky, flavor-packed little dumplings seem to have it all (like you). And you read somewhere that spicy foods supposedly help you eat less (sure okay), so you should probably have seconds.Illustration by Kyle PlattsVirgoYou’re feeling extra creative this month, Virgo, and inspired to switch up the vibe of your living space in 2018. You’ve got several Pinterest boards going (one for every room, obviously). But there’s only so much time in the day and cash in the bank, so your challenge will be to translate these visions into reality. Have patience, and don’t leave paint swatches all over the walls. Expand your craftiness to the kitchen and bake these Argentinian Beef Empanadas. The perfect snack for multitaskers, these handheld half-moons are sure to meet your standards of perfection—and maybe set the bar even higher.Illustration by Kyle PlattsLibraThis month, your focus is on minimizing clutter—in your home, in your schedule, and if possible, even in your career. Always eager to please, you’ve taken on too much and now you find yourself exhausted. Rebalance your scales by delegating the non-essentials and get some solid relaxation, even if that means setting a calendar alert for “nap time.” If you’ve felt like your creativity has been curbed, wait for new ideas to arrive that will invigorate your motivation to work. That said, Libra, you always amaze us with your cleverness, which is why you’ll love these Ricotta Dumplings with Asparagus—smooth, creamy bites with two kinds of cheese harmonizing with asparagus because you, of all people, know it’s all about the balance.Illustration by Kyle PlattsScorpioYou’re a powerhouse of physical energy this month, so find proper outlets and get moving! If you’ve been wanting to alter your image a bit, now is a good time to get that haircut you’ve been fantasizing about for over a year. You’ve either been too much of a workaholic or you’ve been giving too much of your time to someone or something lately. You’re prone to extremes, but this month it’s time to lighten up and break away from the things you’ve been taking too seriously. One thing sure to soften you up is a steamed pork bun, also known as char siu bao, also known as a magical fluffy cloud of heaven filled with shredded barbecue pork. Like you, it’s alluring and mysterious, hiding a bit of sweetness on the inside. (Don’t worry, your secret is safe with us.)Illustration by Kyle PlattsSagittariusGood news: you’re feeling extra motivated these days, and we can see that productivity is on your side this month (for a change!). But you’re always tempted by distant horizons. You have an innate sense of adventure and you grow weary when things become too familiar. So how do you know if you really should uproot yourself from your current flow? This month, it all comes down to being honest about what your needs are...and your needs right now might just be a craving for some samosas from you favorite Indian restaurant—fried pockets bursting at the seams with potatoes, spices, and veggies. Sometimes the best adventures are the ones closest to home.Illustration by Kyle PlattsCapricornYou’ve been doing a lot of behind the scenes work on yourself and now the world is ready to see the fresh-faced new you. It’s birthday season, so go ahead and treat yourself to something elaborate—whether a 7-course meal or a plane ticket or a cashmere bathrobe (or figure out how to combine all three and win at life). Being able to see your needs, desires, and capabilities will be crucial as you begin a larger cycle of self-exploration. Now it’s time to trust the process as you begin to branch out and try new things, and why not start with cooking a new recipe? We recommend these Kielbasa, Sauerkraut, and Potato Pierogies, paired perfectly with caramelized onions. Then branch out to these delicious and unexpected blueberry filled ones.Illustration by Kyle PlattsAquariusDon’t be surprised if your usual dynamism dulls a bit this month, but think of this time as a solid recharge. In fact, most of your energy is wrapped up in reevaluating your professional goals. 2018 should be a big year for growth in your career, so be open to big ideas, but don’t make any big decisions quite yet. For now, focus on your day-to-day habits and routine. You, out of anyone, know how to work smarter not harder. And you’ll need a hard-working snack to go with it, like shumai, flavor-condensed dumplings that can pack a lot of filling in a small package.Illustration by Kyle PlattsPiscesAfter taking some time away from your desk, you have a renewed enthusiasm at work, which has sent a ripple effect into just about every area of your life. Suddenly, you’re spearheading weekend plans, convincing a friend to join you for glass-blowing classes. The name of the game is expanding your network and learning a thing or two in the process. Keep an eye out for some surprise opportunities to earn some money (you are getting good at HQ), but be cautious that you may have to suddenly dish it out as well. This month you are exceptionally creative, so fry up some tasty mandu– versatile, Korean dumplings that you can fill with all sorts of delicious combinations, from pork and cabbage to kimchi and tofu. Just follow your trusty intuition (and the technique) and bring the extras to hungry coworkers or neighbors. Hint, hint.Catherine O’Neill is a writer and astrological consultant who can’t get enough samosas in her world. Read more on her website.Explore Bon AppétitFood HoroscopesDumplingsRead MorecultureYour December Horoscope: Holiday Cookie EditionGallery12 SlidesBy Catherine UrbanPork Soup DumplingsBA's Best Chicken and DumplingsRicotta Dumplings with Asparagus and Green GarlicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Catherine Urban"]}