{"id": "9ae628ed91439b4df37ef36aa078b981", "url": "https://www.bonappetit.com/story/romano-beans-alriiight", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "All About Romano Beans, the Queen of Snap Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRomanos Are the Queen of Snap Beans and I Want to Eat Them AllThese beans should have their own show and it should be called “Everybody Loves Romanos.”By Christina ChaeyMay 29, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiFacebookTwitterEmailI had never heard of Romano beans before working in a restaurant kitchen. We’d buy them in bulk from a local farm, then spend the entire summer trying to figure out what to do with them. I’d snack on these sweet and juicy flat beans raw all the time, taking pleasure in their loud and satisfying crunch. Over the season, I quickly learned how to cook them every way imaginable: grilled, blanched, pickled, blistered. I don’t cook in restaurants anymore, but in the thick of summer when all the colorful fresh beans start showing up at the farmers’ market, I’ll buy a bunch of these long green and yellow guys and figure out what to do with them later—it never takes long to turn them into something totally delicious.So crunchy! So juicy!\nRomano beans are an Italian flat bean in the same family as garden variety string beans, which also counts fancy French haricots verts and yellow wax beans as siblings. They’re broad and flat—as if someone accidentally sat on a giant string bean—with a juicy, sweet flavor and great crunch. They come in green, yellow, and purple, though the yellow and green kinds are more common. They’re usually around four to six inches long, and can get much larger at the peak of the season.You can find Romano beans at the farmers’ market or specialty markets during the summer, and once you get them home they’ll keep well in the refrigerator for up to a week (I usually just keep them in the same plastic bag I used to buy them). You can eat these snappy beans raw, but I think they taste best when they’re cooked, whether quickly blanched for crudités, charred on the grill and dressed with lemon juice and olive oil, or slow-braised in a tasty broth so they plump up and soak up all that flavor. You can use them in virtually any recipe that calls for snap beans or other similarly crunchy veg like sugar snap peas. Oh, what’s that, you need more ideas?! Look no further—these recipes will keep you rolling in Romanos until September:Mixed Beans with Peanuts, Ginger, and LimeView RecipeAll the beans! This salad will work with any mix of snap beans you can find.Crudités with Bacon XO SauceView RecipeBlanched beans are extra crunchy and perfect for dunking into dips.Snap Peas and Green Beans with Arugula-Mint PestoView RecipeToss quickly cooked crisp-tender beans in a dead-simple pesto made from almonds, mint, arugula, and Parm. And then try a spoonful of that pesto in a grain bowl or in a sandwich.Charred Snap Beans with Whole Lemon Dressing and MozzarellaView RecipeSome quick chopping turns a whole lemon (peel and all!) into a chunky, textured salad dressing. Genius. Another delicious saucy moment for your beautifully charred beans: this spicy tonnato.Get the recipe pictured up top:Romano Beans with Mustard Vinaigrette and WalnutsA bean salad fit for an elaborate Italian dinner party. Make it happen.View RecipeExplore Bon AppétitSummerFarmers MarketRead Morecooking11 Big Batch Recipes to Make with Your Farmers' Market HaulBy Alyse WhitneytechniquesCan’t. Stop. Putting. Tonnato. On. Everything.By Alex BeggscookingThis Is the Summer You Start Making Homemade Salad DressingBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Christina Chaey"]}