{"id": "9ae7affeca0924a52d84f97374ec7da3", "url": "https://www.bonappetit.com/story/martha-stewart-best-meals-of-all-time", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Martha Stewart's 5 Best Meals of All Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMartha Stewart’s 5 Best Meals of All TimeLike when Buddhist monks cooked her vegetarian lobster made of tofu. NBD.By Alyse WhitneyMarch 20, 2018FacebookTwitterEmailC Flanigan/Getty ImagesFacebookTwitterEmailRemembering the best food we ate in the past year is tough for most of us—imagine going through decades of restaurant memories. But Martha Stewart did it. She sorted through her mental notes of dining out from the ‘60s to now, and shared her five best meals of all time. During a rapidfire chat at The Sun Wine and Food Fest at Mohegan Sun in Connecticut earlier this year, Stewart recalled a decadent French meal of quenelles de brochet with stockbrokers in New York City and a half-a-mile-long buffet with butter sculptures in Morocco. So, maybe you can’t run out and eat these dishes right now. These are aspirational meals. You may not be able to get vegetarian “lobster”—more on that later—cooked by Buddhist monks in Shanghai, but you can drink Stewart’s favorite rosés and eat Chinese takeout while reading this story.1. La Grenouille in New York City“In the olden days of New York, sometime in the ‘70s, I remember going to La Grenouille with Saul Steinberg, who started Leasco Data Processing. He, my then-boss Andy Monness [at stockbroking firm Perlberg, Monness, Williams & Sidel], and a few other stockbroker-y types got very dressed up and ate the best food that night. I recall wearing very beautiful, sparkly pants, with a big, heavy gold belt that was sort of Moroccan, and a fabulous blouse. And the food was wonderful. Filet of sole meunière with brown butter and lemon, quenelles de brochet, and the floating island dessert of custard and meringue. And lots of Meursault white burgundy. It was classic French cuisine, and it was very special.”Tagines were just one part of the lavish buffet at Mamounia that Stewart loved.\nAlan Keohane2. Mamounia in Marrakech, Morocco“In the ‘80s probably, my husband and I stayed at the Mamounia in Marrakech. This was the old Mamounia, not the refurbished ones. The buffet went for seemed like half a mile, and they had sculptures in butter! Giant camels and other animals down the table. And then around them were different tajines—I prefer meat over fish, like lamb with prunes or onions—and pastillas like pigeon pie, and the most amazing couscous with vegetables cut in diamonds and patterns. Those designs were like the best jewelry in the world. This buffet was done in the old style and much more over-the-top than what you could expect today. There’s no way to find that now—it doesn’t exist.”The exterior of Paul Bouche in 1973, where Stewart had the best roast chicken of her life.\nMichel Artault/Getty Images3. Paul Bocuse in Lyon, France“I couldn’t believe my eyes at the dessert cart at Paul Bocuse, but the best part of the meal was the Poulet de bresse, the blue-skinned chicken. It was roasted so perfectly with tons of butter. It was prepared simply, but its unique flavor and succulent, crispy skin is unlike other chicken. Paul was also famous for poached chicken with a big piece of puff pastry on top. I met his whole family during that trip—they were all cooking in the kitchen, the whole gang. My then-husband, Andrew, and I went to a lot of beautiful restaurants during that trip, but this chicken stood out. It had a fantastic presentation, and the restaurant itself was so lavish.”Instagram contentThis content can also be viewed on the site it originates from.4. Jade Buddha Temple in Shanghai, China“Another meal that stands out is a restaurant I cannot find anymore! I went to it in Shanghai in 1982, and I’ve looked for it several times when I’ve gone went back to China. [Editor's note: the temple was moved in 2017, and all online reviews of the restaurant stop in 2016.] All the cooking was vegetarian made by buddhist monks in some secret way. The chefs cooked down in an underground kitchen with wood-burning stoves. They would climb long ladders to bring food to the dining room, and it was completely quiet and calm upstairs. It was all done in the old, old, old ancient tradition. My husband and I were special guests. We went the year after Nixon and his wife went, and we were treated to a similar kind of tour because my husband was a publisher and printing all his Abrams art books in China and in Japan at the time.It was just incredible artistry. The menu would say lobster and the tofu tasted and looked like lobster. Everything tasted like what the menu said, and it was all made out of soy or some sort of tofu. They had lamb, they had chicken, they had crab, they had river fish. The texture was almost identical.  I couldn’t find it when I went to China 20 years later, but I know I have it in my diary someplace. I need to look back and find out where it was.”The exterior of Lutèce, which was open from 1961–2004.\nNew York Daily News Archive / Getty Images5. Lutèce in New York City (closed in 2004)“When I got divorced, things changed. Meals were different—like, was it a sexy dinner?” When Lutèce was at its apex in New York, I went on a date with a boyfriend. It was probably 1989. We had the most fantastic dinner of duck, cherries, and homemade spätzle. Eberhard Müller, the guy who owns Satur Farms was the chef at Lutèce at that time, and he made perfectly-roasted, extraordinary duck. I don’t remember exactly who I was with, but I remember that duck.”Suddenly craving duck:Explore Bon AppétitRestaurants + TravelRestaurantsCelebritiesRead MorecultureCarla Hall's 5 Best Meals of All TimeBy Alyse WhitneycultureSteve Coogan's 5 Best Meals of All TimeBy Alyse WhitneycultureMartha Stewart Reveals Her Love of Late-Night Hot DogsBy Alyse WhitneycultureMartha Stewart’s 5 Favorite RosésBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Alyse Whitney"]}