{"id": "9af91a03106fc39d90cc305d4c15000e", "url": "https://www.bonappetit.com/story/festive-snickerdoodle-cookie-recipe", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "This Snickerdoodle Cookie Recipe Will Change Your Mind About Snickerdoodles  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNot All Snickerdoodles Are Created Equal, and These Sparkly, Cornflake-Dusted Party Cookies Are the BestThe boring old snickerdoodle gets a major upgrade thanks to toasty brown butter, toffee, a double dose of spice, and… edible glitter!By Hilary CadiganDecember 5, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiFacebookTwitterEmailIn the entire eight months we’ve lived together, my roommate, Nick, has never baked a single cookie. Neither have I. And yet, for some reason, on the morning of the Sunday potluck for which I’d been planning WEEKS in advance to dive into bakerdom by making a batch of these very special Snickerdoodle Party Cookies, Nick decides he’s making cookies too. Chocolate chip oatmeal ones, to be exact, because he is terrible.After failing to convince Nick (who for the record is the same roommate that dropped my perfect lemon-pepper chicken into the back of the grill last summer) to cook something—anything!—else, and making clear that I neither understand nor condone his behavior, I realize I have no choice. I must challenge him to a bake-off.If you’re going to challenge someone to a bake-off, Snickerdoodle Party Cookies are an excellent choice of weapon. Because let’s face it: No one gets that excited when you tell them you’re making Snickerdoodles. Peanut butter cookies? Hell yeah! Chocolate chip? Bring it on! Those puffy little sugar cookies with the Hershey’s Kiss in the middle? DROOLING. But Snickerdoodles? A big fat meh. Other than my brother, who puts honey in his Kraft macaroni and cheese and ate Gerber jarred bananas as his only fruit source up until seventh grade, no one’s favorite cookies are Snickerdoodles.“They are okay, I guess,” says my fiancé, Rob, whose favorite food is pizza and despite standing out in other ways could easily win an award for Most Mainstream Taste Buds. “But I think they’re misleading because they don’t have Snickers in them.” He makes a good point.When I tell Nick my entry into the bake-off will be Snickerdoodles, he gives a smug little smirk. “Good choice,” he says, pulling on his boots to go to the store for ingredients. “Good choice, indeed.”But here’s what Nick doesn’t know: These Snickerdoodle Party Cookies are no ordinary Snickerduds. In fact, comparing the two is like putting a horse-drawn cart up to Doc Brown’s Delorean. Snickerdoodles, in their saddest format, are basically sugar cookies dusted in cinnamon-sugar. Let’s just admit it; they suck. But Snickerdoodle Party Cookies? Dear reader, read on.There is cardamom. There are cornflakes! There are mashed up Skor bars!! There is EDIBLE GLITTER!!! Where we’re going, we don’t need roads.Of course, Nick knows none of this, so he returns from the grocery store with boring old oatmeal and boring old chocolate chips and hogs our kitchen (which is the size of a closet and therefore capable of hosting only one cookie-baking sesh at a time) for an hour. He plays it cool but I can tell he’s nervous by the amount of almond extract he adds. No amount will save him.I enter the kitchen just as Nick is removing his cookies from the oven. While they sit nearby on the cooling rack, trying to taunt us with their chocolatey smells, sous chef Rob and I start in on the Snicks. Step one is browning two entire sticks of butter in a saucepan, which gets me feeling confident again. It’s hard to compete with browned butter, especially an entire cup of it, and soon its nutty, toasty scent overpowers that of Nick’s pitiful cookies.Once the butter cools, I stir in brown sugar and white sugar and beat it all into a beautiful oozy blend, adding vanilla extract and two eggs one by one to turn it the texture and flavor of melted caramel. Next come the dry ingredients—flour, baking soda, salt, cardamom, cinnamon—and the crushed up Skor bars (well, actually I couldn’t find Skor bars so I subbed in Heath; any toffee/chocolate combo will do). The batter tastes amazing, all malt-y and lush like some kind of old-fashioned candy I can’t name and maybe have eaten only in dreams.After covering the bowl and letting the dough rest and thicken for five to ten minutes (don’t skip this step; the flour needs to hydrate for the perfect consistency), it’s time to form the cookies. Imperfect dough balls get rolled through a cornflake bath, dusted in a mixture of that recurring sugar-cardamom-cinnamon trifecta, then plopped onto a pair of baking sheets lined with parchment paper. Into the oven at 350° and boom! Sweet eau de cookie overtakes the house. Potluck attendees arrive and ask, “WHAT is in the oven?” I watch with joy as the blood slowly drains from Nick’s face.By this point I’ve already tasted Nick’s cookies—they’re fine; nice texture, plenty chocolatey, perhaps a touch too heavy on the almond extract but otherwise perfectly acceptable. Alright, fine, they’re pretty good. But then my sweet babies come out of the oven and it’s all over. I give them a shower of edible sparkly stars just to show off.They win in a landslide. Three different potluck guests independently proclaim them the best Snickerdoodles they’ve ever had. One even says I’ve changed her mind about Snickerdoodles. Roommate Mandy, who is Nick’s significant other, calls them “INCREDIBLE,” then sees Nick’s face and whispers, “I love how the cornflakes on the outside are extra toasty and the ones on the inside soaked up all the cookie flavor,” before scurrying out of the kitchen.“They are perfectly crispy on the outside, perfectly chewy on the inside, and have excellent flavor throughout,” says roommate Yolanda, our household’s toughest critic and therefore the sayer of all things final. “You are the star baker.”And that, folks, is how you win a bake-off. Tough cookies, Nick.Get the recipe:Snickerdoodle Party CookiesWe helped our snickerdoodles get party-ready by upping the spices and adding texture with toffee, cornflakes, and a sparkly finish.View RecipeYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools (and Skor bars!!!) for holiday cookies. More details here.Explore Bon Appétitholiday2018CookieHoliday CookiesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Hilary Cadigan"]}