{"id": "9afc205768ae9ee6e92ad02cacf6f6b7", "url": "https://www.bonappetit.com/story/instant-mashed-potato-tips", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "How to Make Instant Mashed Potatoes Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Instant Mashed Potatoes Waaayyyy BetterSay it with us: salt! fat! acid! heat!By Ali FrancisDecember 16, 2021FacebookTwitterEmailPhotograph by Emma Fishman.  Food Styling by Micah MortonFacebookTwitterEmailIn Cheap Tricks, we’ll help you make the most out of everyday supermarket staples. Next up: How to make instant mashed potatoes better—this instant!My latest haiku:Mashed potatoes,I love you so much it hurts.(But I have no time.)Every week I lug home a big ol’ bag of russet potatoes with the Very Good intentions of mashing them into creamy oblivion and covering a huge pile with a ladleful of stew and a dollop of sour cream. Rarely does that actually happen—do yooouuuu want to spend an hour at the end of your workday peeling and scrubbing spuds?—and what’s left is a sack of scary-looking sprouted potato children that I’m sure are plotting to poison me while I sleep.On busy nights, when I know mash from scratch isn’t realistic, I’ve been turning to instant mashed potatoes—also known as instant potato flakes or mashed potato flakes—instead. They’re lightning fast to make (seriously, the prep time is like five minutes); super affordable (2 oz., which is about three servings, costs around 72 cents); and, with a couple of nifty tricks, you’ll barely know they were born from a packet.When I called my whole-foods-only mother to alert her of this culinary update, I could hear the gears grinding in her head: What’s wrong with real potatoes?! I, like Ma, had always assumed those little baggies contained none of the actual vegetable they were masquerading as. (In our defense, that potato dust looks a heck-load similar to fish food.) But we were both wrong. As it turns out, I told her, instant potatoes are just potatoes that have been cooked, mashed, and then dehydrated—leaving you with crystallized, powdery flakes that you only need to rehydrate with hot liquid before serving. Seemingly convinced, Mom then asked: “Okay, but how do the potatoes taste?” My answer: That depends on what you do with them.Here’s how to make instant mashed potatoes taste really good:Idahoan’s classic mix was the best instant mash I tried. Still, my control batch, when prepared according to the directions on the packet—with hot water, salt, and margarine or butter—was lackluster. Gummy and a little bland, with a sort of musty, mothball flavor profile that just wouldn’t quit. But after experimenting with a solid rotation of mix-ins (cream cheese, chives, milk, chicken broth, garlic powder, miso, Parmesan, and more), I finally landed on two winning combos that’ll make any mashed tater shine.1. Beurre blanc instant mashed potatoesBright, creamy, aromatic, and flecked with wine-soaked shallots, this is the perfect side dish to a classic roast chicken. The game changers in this recipe are dry white wine and peppy lemon juice, which lend some much needed acidic brightness; a smattering of fresh herbs and shallots for added complexity; and butter, for, well, butteriness.Start by making the butter sauce: In a small saucepan or skillet, simmer ½ cup white wine (the cheap stuff is fine!) with 1 finely diced shallot or 1 Tbsp. dried onion flakes until only 2 Tbsp. of liquid remain. Add 6 Tbsp. chilled unsalted butter, stirring constantly until a glaze-like texture forms. Throw in 2 Tbsp. finely chopped tarragon or oregano and simmer for a few more minutes until the butter smells fragrant. Stir in the juice from ¼ lemon and remove the pan from the stove. At this point, the sauce should be glossy enough to coat a spoon but not hollandaise-level-thick.Then, prepare the potatoes: Bring 1¼ cups water to boil in a small saucepan. Once bubbling away, remove from heat, add 1 cup instant mashed potatoes (2 oz.), and gently fluff with a fork. Pour the beurre blanc over the potatoes and stir to combine. If you simply cannot stand chunks in your smooth mash, feel free to strain the shallots and herbs out of your butter before uniting with the cooked potatoes. Season to taste with salt and black pepper.2. Miso-garlic instant mashed potatoesInspired by these beauties from Brad Leone, this is the super savory side piece your weeknight steak is lookin’ for. The roasted garlic and yellow miso are the heavy hitters, bringing a burst of salty-umami to the otherwise kinda-bland spuds. And the cream takes the texture to new glossier heights.To start: Bring 3 cloves roasted and smashed garlic or 1 tsp. of the jarred stuff, 4 Tbsp. unsalted butter, 2 Tbsp. yellow miso, and ½ tsp. cracked pepper to a boil in a small pot. As soon as the water is bubbling, take it off the heat. Give the liquid a good whisk (to meld the butter, garlic, and miso) and add 2 oz. instant mashed potatoes. Fluff gently with a fork. Bring ¼ cup heavy whipping cream to a simmer in a saucepan, then pour it over the mashed potatoes. Stir to combine and season with salt (and more black pepper) to taste.Listen, real talk: At the end of the day, instant mashed potatoes are never going to be the same as their scratch-made siblings (less flavorful, curiously smooth). But as long as you expect them to be different, they can still be good. Use your leftover mashed potatoes to blanket a cozy shepherd’s pie. Mix them with Parmesan and breadcrumbs to make golden fried croquettes. Or cover a mound in crispy, crushed chips for the ultimate carbohydrates mash-up.Whatever you do, just don’t make eye contact with those sprouted creeps lurking in the dark recesses of your cupboard—they’re easily threatened.Explore Bon AppétitcookingCheap TricksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-16", "author": ["Condé Nast", "Ali Francis"]}