{"id": "9afd4847db3195d123ebd7ecd0b17d23", "url": "https://www.bonappetit.com/story/ramadan-room-for-improvement", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "I Tried to Perfect My Mother’s Pullao and Learned to Love My Flaws Instead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Tried to Perfect My Mother’s Pullao and Learned to Love My Flaws InsteadThis Ramadan, I learned what “room for improvement” really means.By Ahmed Ali AkbarMay 22, 2020FacebookTwitterEmailIllustration by Jordan AwanFacebookTwitterEmailRamadan is always around the corner, I like to say. With one month out of every twelve spent fasting, if it’s not happening right now, it will be here sooner than I think. Ideally, the month is a time for spiritual growth and re-focusing of priorities. But, practically, my productivity dips, I sleep through the day, and I eat until I get heartburn when I break fast; I’m not a perfect Muslim by any means. Still, every Ramadan, I form a niyyah, an intention to be better: to pray, commune with friends and family, attend community events, and lend my support to causes and people I care about.This year, stuck at my father’s home in Michigan due to COVID-19, the month loomed larger than ever. The mosques weren’t open, iftar dinners were cancelled, visiting family was a no go—my usual large, bustling community of Muslims shrank to just four people: my dad, wife, uncle, and myself. Any hopes I had for better behavior seemed stymied from the start.The thing is, Ramadan hasn’t been normal for me for years. My mother, the undisputed leader of the house, passed away in 2009. Ammi was a tornado in a shalwar kameez and white doctor’s coat. During the month, she worked full time, took us to the mosque daily, and hosted fabulous dinners with lavish spreads of kormas and kababs for a long table of aunts and uncles and cousins from around the world. In the decade since her passing, we’ve all more or less done Ramadan separately, our nuclear family spread out like an archipelago instead of the single coherent mass we once were. This year, quarantine became an unexpected excuse to try wearing my mother’s mantle.My unit of four had already been together for six weeks before the first day of Ramadan rolled around. As head chef, I’d already been pumping out easy classics like daal and tandoori chicken and the occasional bread experiment for days on end. But for the first iftar, I wanted to aim high and cook our family’s signature recipe: Pullao, a mix of rice and goat meat simmered in a broth flavored with onions, garlic, ginger, and a dozen aromatic spices. It’s a delicate, half-day dish and you only get one chance to nail the texture and tenderness. I had a whole plan: I would start the broth and meat early in the day and prepare the rice right before it was time to eat. But then that familiar fatigue set in, and I took a nap.It was a critical mistake. I woke up at exactly the moment fast broke. Shit. What would everyone eat?I could hear my dad moving around rapidly downstairs, fumbling around in the freezer looking for food to make up for my error. I ran into the kitchen, chopped up some tomatoes, salted them, and mixed with cucumbers, toasted pita, and scallions in an impromptu panzanella-kachumber mashup that has become a staple during quarantine.I felt guilty. An empty table on the first of Ramadan was unthinkable for someone like my mother. Still, there was food to eat, after all. There has, gratefully, always been food.I confessed my blunder on the Whatsapp thread me and all my cousins dedicated to the meals we cooked each day: a vegan mushroom Biryani in Ohio, a brilliant crimson aloo gosht in Boston, and leftovers turned into cheesy pasta in Texas. On Zoom calls we exchanged recipes and gossiped while we cooked. Miles and miles away from the usual support and caretaking of our parents, this was our first chance to define Ramadan for ourselves. The outcomes weren’t always as polished as the generations’ before us. Still, we recognized these new practices—and the small disappointments that came with them—as a valuable source of growth.The day after my nap disaster, I pulled up my cousins on Zoom and turned back to the pullao.I picked up speed in my prep, despite my typical low Ramadan afternoon energy. I called up my mother’s sister and made sure I had the cooking times right so that the rice would be perfectly fluffy at the same time the meat began falling off the bone. My wife took potatoes and onions on a swim through the pakoras dough I had prepped and fried them up, crisp, ochre, and craggy. My dad swung by the kitchen and began chopping up bananas, apples, and pear to mingle in a chaat of lemon and fruit juices. My uncle set the table and washed the dishes as they piled up. A cousin browned onions for a chicken karahi on the Zoom call, asking me for tips on how to keep the meat tender. We’d all become a strange, new unit—a different kind of togetherness that might be the new norm for some time.The sun set and the rice was done. It was maghrib, time to break. We made our niyyah, as we always do, before biting down on a gooey medjool date: “Oh God, I have fasted for you, believed in you, placed my trust in you, and broken my fast on your provision.” The pullao was a success. It wasn’t my mother’s by any means, but sure enough, it was my own—with all of the ways it could be better. Just like there always are.Ahmed Ali Akbar is a writer and the host of See Something Say Something, a critically acclaimed podcast that covers American Muslims.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-22", "author": ["Condé Nast", "Ahmed Ali Akbar"]}