{"id": "9b05ceb62f7052a5f4fbbe7872a73e98", "url": "https://www.bonappetit.com/story/kelis", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Singer Kelis on Selling Hot Sauce and Starting a Sustainable Farm in Colombia | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSinger Kelis on Selling Hot Sauce and Starting a Sustainable Farm in ColombiaWe talked to the singer-chef about food justice, essential reading, and the best roti in Penang.By Kristin BraswellJuly 2, 2019FacebookTwitterEmailPhotograph by Michael MoraFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Kelis, singer, organic farm owner, and hot sauce entrepreneur.Kelis told us years ago that her milkshake brought all the boys to the yard, but these days the singer-chef is hawking a spicy aji verde and pineapple saffron glaze. Her hot sauce brand Bounty & Full, founded in 2015, is driven by the belief that “everything is better smothered, dipped or poured.”“Food is revolutionary because it is the one and only international language,” she says. “It’s the most human thing you can partake in. We are the only species that cooks.”Kelis graduated from Le Cordon Bleu in 2008, but credits her mother for inspiring her love affair with food. “I remember going to Puerto Rico and my mom would take us to the beach where we’d find these little huts. They’d make alcapurrias, papas rellenas and more, all filled with seafood. I remember eating them till we were stuffed,” she recalls. Fittingly, her 2014 album Food included songs titled Friday Fish Fry and Jerk Ribs.Since her cooking-school days, Kelis has written a book called My Life on a Plate: Recipes From Around the World, hosted specials on the Cooking Channel, and served up everything from jerk ribs to turkey curry burgers on her YouTube channel, Bounty Tube.  This year, she became co-owner of Bounty Farms in Quindio, Colombia. The sustainable farm grows coffee, tomatoes, and other produce, and is expected to open to the public some time in 2021. “My goal with the farm is to regain control of how we eat and reconnect ourselves with the food we love,” she says.We talked to Kelis about the flavors she can’t get enough of, the best meal she’s ever had, and why making healthy food accessible to all is her life’s mission.My favorite flavor to dip things in is… hot sauce. Bounty & Full’s TheTruth hot sauce to be specific. Also aji…I’m obsessed! I think spice brings excitement, and aji is the perfect addition to a good piece of meat.The best meal I’ve ever had was… on the island of Penang in Malaysia.  Years ago when I went to Penang I came across this food cart—I wouldn’t say I stalked the owner but I ended up buying food from him every day while I was out there. He made a roti tisu that was sweet and crunchy and everything you wanted it to be with a super creamy spicy curry. He didn’t speak English or have any teeth but he knew I loved every single bite. There's also a place in a train station in Hong Kong that has some of the best buns and dim sum that I’ve ever had. If I’m not mistaken, I heard they got a Michelin star.I feel joy when... I am able to give my kids something new to try and see their reaction. My youngest, Shepherd, was determined to try my sparkling water. I knew he wouldn’t like it because of the bubbles, but seeing it take over his taste buds and reaction was priceless. My oldest, Knight, once told me he wasn’t a fan of oxtail because he “wasn’t a fan of the texture”. Seeing them react and understand new food is amazing.Three things always in my kitchen cabinet are… cookies, for my husband and boys specifically. They are literally cookie monsters. Lots of grains, oatmeal, rice, popcorn. And of course loads of coffee from Colombia.I’d like to cook for… good eaters, not picky eaters. Every time I cook it’s a full feast. It doesn’t matter who I’m cooking for as long as they are happy, hungry, and ready to eat. I love an eater and I love to see their reaction to eating my food.I just finished reading… Lost Tribes & Promised Lands by Ronald Sanders. Super interesting, very informative, definitely a page-turner. I’m a real history lover, and reading is one of my favorite things to do.Food justice is… healthy food for everyone. You shouldn’t have to pay more for something organic or fresh. Everything that goes into our body affects us. Everyone should be able to prepare and enjoy food that actually nourishes the body and keeps us healthy. I’d like to see more places do farm to table.I’m listening to… Bill Withers. I’m currently going through a silent period, but when I do listen to music, it’s definitely something classic like Bill Withers, Hector Lavoe, or Biggie.I’m inspired by… most the things around me. I’m kinda a sponge. I’m inspired by bravery and guts, human will, resistance, and seeing a strong woman accomplish things.A good day looks like… rain all day! I have nothing to do, I have a great book, wonderful things to eat and drink, and my phone is broken.Explore Bon AppétitPerson of InterestHealthyishHot SauceInterviewsRead MorecultureWhy Indie Rapper Junglepussy Wrote a Song About Trader Joe'sBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Kristin Braswell"]}