{"id": "9b088a6180e8fbc9b30e34de24219d5d", "url": "https://www.bonappetit.com/recipe/stovetop-mushroom-lasagna", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Skillet Mushroom Lasagna Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueStovetop Mushroom LasagnaBy Sarah JampelOctober 19, 20204.3(134)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintThis isn’t your classic beautifully layered lasagna—but it is a little more weeknight-friendly. Instead of boiling the noodles in one pot and making the sauce in another, you cook lasagna noodles directly in a mixture of milk, crème fraîche, water, and a little lemon zest, which thickens arounds the pasta as it bubbles away. (You can use sour cream in place of crème fraîche; to keep it from breaking, temper it with a little of the hot milk, then whisk in thoroughly.) The key to success is using a big enough pan—a large sauté pan or skillet with high sides or a Dutch oven that holds at least four quarts. We pop the lasagna in the broiler for a crispy top, but you can add the mozzarella in the last few minutes on the stove if you don’t want to turn the oven on.Ingredients4-6 servings5Tbsp. extra-virgin olive oil, divided12oz. mixed mushrooms (such as maitake, oyster, shiitake, and/or crimini), trimmed, torn into 1\" pieces1½tsp. tsp. kosher salt, plus more2Tbsp. thyme leaves1large shallot, finely chopped3garlic cloves, finely grated2Tbsp. all-purpose flour2¾cups whole milkFreshly ground black pepper1lemon⅓cup crème fraîche or thinned sour cream8oz. regular lasagna noodles, broken in half4oz. mozzarella, thinly slicedFinely grated Parmesan (for serving)PreparationStep 1Heat 3 Tbsp. oil in a large high-sided ovenproof skillet or small Dutch oven over medium-high. Add mushrooms and cook, undisturbed, until starting to brown, about 4 minutes. Season with salt and cook, tossing occasionally, until golden brown, 5–7 minutes. Transfer to a bowl; mix in thyme.Step 2Reduce heat to medium-low. Heat remaining 2 Tbsp. oil in skillet. Add shallot and garlic and cook, stirring, until starting to soften, about 1 minute. Sprinkle flour over and cook, stirring, until golden, about 1 minute.Step 3Add milk, pepper, 1½ tsp. salt, and 1¾ cups water, then finely grate zest of ¼ lemon into pan. Stir to dissolve flour, increase heat to medium, and cook until gently bubbling. Reduce heat to low, whisk in crème fraîche, and stir to combine. Add about one third of noodles, pushing down into sauce to submerge, followed by a third of  mushrooms. Repeat with half of remaining noodles and mushrooms. Top with another layer of noodles. Set remaining mushrooms aside. Cover with a lid or foil and cook 15 minutes. (If lasagna threatens to boil over, use very lowest heat and/or prop open the cover.) Uncover; cook, gently lifting and separating noodles occasionally with tongs or a spatula to let sauce flow around, until sauce is thickened and noodles are cooked through, 6–8 minutes. Mixture should be bubbling gently; adjust heat as necessary. Remove from heat.Step 4Heat broiler. Top lasagna with mozzarella and reserved mushrooms. Broil until cheese is bubbling and browned in spots, about 2 minutes. Finely grate more lemon zest over. Sprinkle with Parmesan; season with pepper. Let sit 5–10 minutes. Cut lemon into wedges and serve with lasagna.How would you rate Stovetop Mushroom Lasagna?Leave a ReviewTell us what you thinkReviews (48)Back to TopTriangleI made this tonight and yes it was on a weeknight. I followed the recipe, read the article on how to make it & used sour cream instead of creme fraiche(I tempered it with the hot milk sauce just as the article stated)I did add a bit more cheese on top only because I LOVE CHEESE!  I read the reviews and thought WOW! People can really be blunt when they’re typing a review. I’m not an accomplished cook-just like to try new things. Any new recipe is going to take time. I find it easier to have all of my ingredients pre measured & ready. I loved that I only used the one skillet to do everything. Noodles cooked perfectly-sauce thickened and the lemon zest made it have such a good flavor-I was hesitate when the recipe called for 2 tbsp of thyme leaves to add to those beautiful golden mushrooms-but it wasn’t too much at all. Letting it set for 10 minutes after broiling it was the longest part of the recipe( only because I couldn’t wait to taste it) it was delicious!!! I will definitely make this again…. even if it’s on a weeknight. Thanks for the recipe. It’s a keeper. Kelly Kevil, KY1/12/2022This Thanksgiving was my second year as a vegetarian. When I still ate meat, I often turned to BA for holiday recipes. So I was excited to find this wonderful vegetarian recipe, especially since most vegetarian alternatives do use diverse protein sources and only seek to mimic meat recipes.\n\nI followed the recipe exactly, with the exception of using 6 oz. of mozzarella and putting the lasagna under the broiler for about six minutes for proper browning and bubbling. This was so delicious and a great main course. My four-year-old daughter is a lifelong vegetarian and loved it! Even though we have some leftover, she has already asked me to make it again.\n\nTIP: Definitely serve with lemon wedges. I was a little skeptical at first, but it added an important dynamic to the flavors.MichaelFIndianapolis, IN, USA11/26/2021This worked really well.  I used mushrooms from the open air market - chanterelles, black trumpets of death (love that name) and criminis. I really think these flavorful mushrooms made the difference. I used sour cream and then later, added a little water, since it did seem to need it.  Was a big hit and not too much work.christine chang11/21/2021Bon Appetite for the win again! I followed the recipe steps as is, but I used 5-7 cloves of garlic, oat milk & thin downed sour cream. Oh I also used no boil lasagna noodles. I didn’t have the thickening issue other reviewers had. I used a round cast iron skillet & this will definitely be in our rotation. Erika RenataSan Antonio, TX8/4/2021I made this and pretty much followed the recipe with a few modifications. It was delicious. Some reviewers thought the recipe was a little bland, so I added more fresh herbs and about 2 ounces of  good blue cheese. This really enhanced the sauce. I also used some dried wild chanterelles, reconstituted with hot water which I added back to the sauce.\n\nI also think this recipe would work fine with other types of pasta, and it would be quicker and simpler - you just couldn't cut it into nice pie shaped wedges. Marko52South Range, WI5/26/2021Made this tonight without reading any other reviews first! Here are my thoughts: not special or spectacular in any way.It's edible, but not incredible. I'm an accomplished cook and this isn't too much work for a weeknight for me, BUT if I'm going to do this much on a weeknight, it needs to be more interesting and worth it. Personally, there are 100 better and easier creamy mushroom pasta dishes that don't take this much time. Also, as stated by many, WAY too much liquid is called for. If you want to try it, I would say cut the water in half. Pros: I cooked it in a cast iron pan (just like pictured) and nothing burned and the noodles were cooked perfectly. The amount of salt and herbs (I don't think it's too much thyme) were spot on. And the touch of lemon is great - in fact, I'd double that if you want to try it. It's just a little bland and again, not 'amazing' for the amount of work involved. Chef MomLos Angeles, CA3/3/2021Relatively easy to prepare.  Use fresh lasagna or pre-made as the box type even if expensive type takes much longer and not as good.  Getting an assortment of fresh mushrooms can be a challenge at times but his week it all came together except for the pasta.  Will know better the next ime.DonutsChicago area2/18/2021We found this rather disappointing following the recipe as written - in spite of premium ingredients, it tasted like cream of mushroom soup over noodles.  With just two of us, we were looking forward to a lot of uninspiring leftovers.  HOWEVER, by transforming it into an elevated tuna noodle casserole, it rocked!  The following night I stirred in two cans of tuna, put some crushed potato chips on top, and reheated it as a casserole.  In that formulation, it was 5-star.  Without the additions, I would sadly only give it 3. Hence the 4-star rating.  When I make it again, will cook as a conventional casserole.AnonymousVirginia Beach, VA1/21/2021This was delicious!! Very easy to make. I made it basically as per the recipe and it thickened beautifully. I did have some issues with noodles sticking to the bottom of my cast iron pan, but I was able to work my spatula underneath to loosen and did not have a \"burning\" issue. I did make one small addition that I often use for mushroom dishes. I always have dried porcini mushrooms on hand. I ground enough in a coffee grinder to yield about a scant tablespoon of mushroom powder that I stirred into the mushrooms as they were browning. The ground porcinis really add an extra punch of mushroom flavor to the sauce.pawDenver, Pa.12/29/2020I completely agree that this recipe is both amazingly delicious and totally not weeknight friendly. Glad I am retired as I have the time to make it and enjoy it!KristieTraverse City, MI12/17/2020My family and I found this recipe completely delicious. However, \"weeknight friendly\" was not my experience. This took just as long to make as a standard lasagna. Having said that, I will probably make it again because it's that good.LubuPhoenix, AZ 12/7/2020Hard pass. This recipe uses a lot of good ingredients, but the result was disappointing.  Despite using creme fraiche and whole milk the sauce stuck to the pan and broke and the lasagna noodles ripped as I stirred it. Your results are very much dependent upon the skillet you use and this recipe does not offer enough guidance as to the size which probably explains why many reviewers had issues with the sauce not thickening properly. The end result is not worth the effort. Also 2 Tablespoons of thyme is way too much! AmySan Francisco 12/6/2020This recipe is outstanding. Very filling and very satisfying. My 6 year old, who can’t even stand to look at a mushroom, ate every bite! Not in the weekly rotation due to the amount of steps and dishes but definitely worth the time to make about once a month. \n As other reviewers have stated, the sauce takes longer than 6 minutes to thicken. It was more like 15 minutes. Be sure that you take the time to separate the noodles to ensure that the sauce gets into all the nooks and crannies. I’ll definitely be making this again. My wife and I have already started to think of some substitutions and additions to compliment it. \nOne thing I would have liked to see (or maybe not) is the nutritional info. Ken MillerClearwater, Fl12/1/2020Amazing dinner!  I followed the recipe as written but added more garlic (because i love garlic) and used dried thyme (because I didn’t have fresh).  I made it in an iron skillet and had no problem with the pasta sticking to the bottom.  It did take a little longer for the sauce to thicken but I am sure that was due to the heat control.  This is definitely a keeper and I will make again.\nP CaseySilver Spring MD11/18/2020Absolutely delicious flavor. Definitely a once every now and then treat thanks to the huge amount of dairy in there, but I'll definitely be coming back to it. I decreased my rating to 4 stars because, like other people said, it needed way longer for the sauce to thicken. I wish I had read the comments before cooking, because I have a big soupy mess at the bottom of my pan. Still tastes great, but I'll need a second run at it with that modification before I would serve it to anyone else.RobRaleigh, NC11/17/2020Explore Bon AppétitPastaMushroomVegetableLasagnaPasta & NoodlesEasyOne-Pot MealsWeeknight MealsMainNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-19", "author": ["Condé Nast", "Sarah Jampel"]}