{"id": "9b0852a732adb5bdcae479f0891f2756", "url": "https://www.bonappetit.com/recipe/burnished-potato-nuggets", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Potato Nuggets Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueBurnished Potato NuggetsBy Chris MoroccoOctober 16, 20184.4(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintBehold, your new standard for roasted potatoes: puck-size oven fries with creamy insides and unimaginably crunchy exteriors that will make you swoon. The natural starches of the russets help turn the surfaces of the partially cooked potato orbs floury, and that scuffed-up exterior transforms into a crackling crust when it hits the hot fat. Seat yourself close to the serving bowl—these are going to go fast. Bonus: The fluffy insides are perfect for sopping up gravy.Ingredients8 servings 5lb. russet potatoes, peeled, cut into 2\" piecesKosher salt½cup extra-virgin olive oil¼cup vegetable oil8garlic cloves, lightly crushed2long sprigs rosemaryPreparationStep 1Preheat oven to 425°. Place potatoes in a large pot and pour in water to cover by 2\". Season water generously with salt and bring to a simmer over medium-high heat. Reduce heat and simmer gently until potatoes are tender on the outside but still very firm in the center, 8–10 minutes.Step 2Pour off all of the water in pot, holding potatoes back (make sure there's no liquid left!). Let potatoes sit, uncovered, for a few minutes to steam off any excess liquid they've absorbed. Toss potatoes just enough to rough up their outsides and give them a floury starchy coating (do not toss so vigorously that they fall apart); season with salt.Step 3Meanwhile, combine both oils in a large roasting pan and heat in oven 10 minutes.Step 4Carefully remove pan from oven; add potatoes, turning each one to coat and moisten exterior. Make sure they're in a single layer and leave a bit of space between them. Return pan to oven and roast potatoes, turning every 10 minutes, for 30 minutes (if they aren't browning after 15 minutes, increase oven temperature to 450°).Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Toss in garlic and rosemary and cook until potatoes are deep golden brown on most of their sides, 8–10 minutes. Using a slotted spoon, transfer potatoes to a platter and serve with roasted garlic and rosemary alongside.How would you rate Burnished Potato Nuggets?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleThis is just a rehashing of kenji’s recipe. Anonymous11/16/2021These are my family’s favorite way to eat potatoes. You can improvise with the spices if you’re short on fresh herbs (dried Rosemary, dried thyme, and garlic powder are fine - though along with the salt and pepper, I have to use more than I would have thought).\n\nOne word of warning, though - I shattered\nglass casserole dish last night, when I placed the heated vessel on top of a cold quartz countertop. I transitioned to a cold metal pan with oil - and the potatoes did not seem worse for wear for NOT being placed into hot oil. I will probably skip that step going forward. ZoeHouston, TX2/21/2021Very good--be generous with the salt and all will be well! Also, really make sure not to crowd the potatoes to make sure they crisp versus steaming. They were deliciously crisp on the outside and creamy on the inside.Anonymous9/23/2020This is such a fantastic recipe! I know my oven releases a lot of heat, so I had to bump it up to broil in order to get the crispiness I wanted. I will definitely be using this recipe for my leftover potatoes, and I can't wait to cook it again!cumin_enthusiastNashville, TN8/31/2020The only way I want to make potatoes from now on! The outside was crispier than I could have dreamedAlixandra ZarembyPhiladelphia4/23/2020Really, really good. Need to adhere to 2'' pieces to fit all the potatoes in one pan. Or split across a couple pans if you want a higher crust-to-fluff ratio.AnonymousSan Francisco4/9/2020I should have heeded the advice of the reviewer who recommended a larger roasting pan and a test run before making these for Christmas dinner.  They didn't brown - too crowded in pan - and didn't have much flavor.  I've used a similar recipe with Yukons boiled in salt and baking soda, then roasted with a garlic/rosemary infused oil on a very large baking sheet - delicious.  Guests expected better from me since I cooked the Crispy Smashed Potatoes and Mashed with Crispety Crunchies for Thanksgiving dinner - oh, well!  On to St. Patrick's Day!!!AnonymousNew London, PA12/27/2019These were good, but I had trouble getting a crispy skin and didn't see much browning despite having my oven at 500 when I finally took them out because dinner was waiting on the table. Next time I will use the biggest pan possible (probably a turkey roasting pan) so that the potatoes can have maximum personal space during roasting. I will also increase the amount of garlic and put it in earlier so that it browns as well. Overall, these were good and I'd make them again but I'd recommend giving it a test run - if you're making these for a holiday or bigger dinner you may be thrown off if they have to occupy the oven for longer than you expect. AnonymousNew Orleans12/26/2019I made these for Christmas and they were a hit! We do a traditional English Christmas with Roast Beef, Yorkshire pudding and tons of greens. Potatoes are never the same because we can’t figure out how to make them to complement the meal. These will now be our go to! Perfect in every way, shape, and form.eckramer84Chattanooga, TN12/26/2019I made these yesterday and they turned out perfect. The outside was just like the ones shownhere and the insides were perfect. The parboiling to start, the hot roaster pan, and the turning every ten minutes are the secrets  Checking progress halfway through so you can adjust your even temp if necessary is also a good tip. \nBeen wanting to know *for ages* how to make these.  Now I know.AnonymousAlberta12/14/2019As a Somerset man myself this is a pretty classic recipe. An extra tip would be 15 minutes before the end to give the potatoes a gentle crush to increase the surface area for added crispiness.ThomasAytonSomerset, United Kingdom11/13/2019Had to get the oven up to almost 500 before I started getting the browning I was looking for but worthwhile in the end. The main takeaway is to watch your potatoes and continually adjust your temperature as much as you need to, rather than be married to the number the recipe lists. \n\nGreat recipe in the end, but I do have to agree with the comment below and point out that not only does burnished mean shiny, it specifically means \"polished-to-a-shine\", which is, basically, the opposite of these potatoes, just sayin.harirai9/29/2019Um... whomever created the title for this:  “burnished” means shiny!  So, shiny potatoes?  Lol!AnonymousSF9/27/2019I've been making a version of this for years. \"Rosemary Roasted Potatoes\". Not too sure where I got it...may have been Martha Stewart. I peel and cube them. Microwave until about 2/3 done. Drain and dry in a colander. Toss and let sit-this roughens the surface. Toss with oil and salt. Spread on a baking sheet and roast in a 375 degree oven until just crispy outside. Season with freshly ground black pepper and finely chopped fresh rosemary. Finish in the oven. Putting the pepper and rosemary on at the beginning will burn both.nickoWinchester, CA7/19/2019This is how my family from England has been making Roast potatoes for over 80 years\nI am making them tonight for dinner as I am having family over\nThe crispier they are the more the family likes them They are deliciousVancouver Canada7/19/2019Explore Bon AppétitPotatoVegetableRusset PotatoFallEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Chris Morocco"]}