{"id": "9b0ceb3253f71742f3b3d3ca22c83984", "url": "https://www.bonappetit.com/recipe/cold-brew-chicory-coffee", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Cold-Brew Chicory Coffee Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueCold-Brew Chicory CoffeeBy Commander’s Palace, New Orleans, LAFebruary 9, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIf you like your cold brew black, skip the sweetened condensed milk. If you want it extra sweet, add both cans. We like it somewhere in between. This recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings8oz. chicory coffee blend (1½ cups)1–214-oz. cans sweetened condensed milk2tsp. vanilla extractPreparationStep 1Place coffee in a large bowl and add 8 cups cold water. Stir gently to make sure all of the grounds are moistened. Chill overnight.Step 2Line a sieve with a coffee filter and place over a pitcher. Strain coffee into pitcher (do not stir); discard solids. Stir in 1 can sweetened condensed milk and vanilla extract. If you like your coffee sweeter, add more milk.Step 3Do Ahead: Strained cold brew can be made 1 week ahead. Cover and chill. Add milk and vanilla just before serving.How would you rate Cold-Brew Chicory Coffee?Leave a ReviewTell us what you thinkExplore Bon AppétitCold DrinkDrinks AllCoffeeAlcohol & Other DrinksVanillaHerbs & SpicesDrinksGluten-FreeNut-FreeVegetarianNonalcoholicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}