{"id": "9b10ca69cf7378ae9052442a9f3f336d", "url": "https://www.bonappetit.com/story/agua-de-jamaica-hibiscus-tea", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Hibiscus Tea Is My Quarantine Apéritif | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAgua de Jamaica Is My Quarantine ApéritifWorth ordering a POUND of dried hibiscus for.By Alex BeggsMay 12, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I am a general lover of drinks, the entire category, but when given the opportunity to guzzle agua de jamaica—hibiscus tea—I will take it, with refills, until my mouth is stained pink and my bladder bursting. It makes me feel like I’m on vacation in Mexico City and everything is sunny and good enough in the world.The hibiscus flowers brew into a rich inky magenta tea that makes all other iced tea seem watery and weak. Hibiscus has a very tart (but not as tart as cranberry) and juicy flavor that gets rounded out with sugar and woken up with lime juice. You might know hibiscus tea as sorrel, carcadè, or many other names—there are versions of the tea found around the globe. I’m most familiar with the Mexican agua fresca, which my dad used to make during hot Houston, well, all-the-times.So I bought ONE GIANT POUND of dried hibiscus on Amazon to make it myself. In my isolated life, it’s become my negroni substitute when I’m trying to turn things down a notch (yippee). Dr. Google tells me hibiscus is positively PACKED with antioxidants, which makes me a health goddess. Come take a tour of my liver, it’s sparkling!This vintage, slightly extra Andy Baraghani recipe is my jumping off point for my agua de jamaica, but I omit a few ingredients (Thai chile, I’m not stocking those at the moment) and cut the sugar in half. I’ve also made the recipe in Gabriela Cámara’s My Mexico City cookbook, which is super straightforward and classic (good cookbook alert). The tea steeps for 30 minutes or so, then I strain it and store in the fridge labeled “HIBISCUS CONCENTRATE” so I remember to dilute it with equal parts water: tea. Andy’s addition of vanilla gives it a slight creamy note, and with seltzer, it reminds me of Big Red cream soda (Texans know). I’ve played with different citrus zests, cinnamon sticks, and a jalapeño if the mood feels spicy. Hard to go wrong.My one-pound bag of dried flowers barely has a dent in it, all these months later. (Time to make some rhubarb jam…) What a worthy investment! I have yet to accidentally tie-dye any white clothing, too. I really don’t see any downside here.Buy It: Frontier Co-op Hibiscus Flowers, $20 for one-pound bag on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingTeaRead MorecultureI Never Thought I Would Say This: I’m Into This Non-Alcoholic BeerBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-12", "author": ["Condé Nast", "Alex Beggs"]}