{"id": "9b1feab4e8af6ce6bab78c31b261b757", "url": "https://www.bonappetit.com/recipe/oven-polenta-with-roasted-mushrooms-and-thyme", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Polenta with Roasted Mushrooms and Thyme Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueOven Polenta with Roasted Mushrooms and ThymeBy Claire SaffitzSeptember 18, 20184.6(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Sue LiEmailPinterestPrintEmailPinterestPrintCall it cheating—we call this no-stir polenta 30 minutes you don’t need to spend standing at the stove. And if you’re feeling indulgent, top with a little heavy cream mixed with a finely grated small garlic clove.Ingredients4 servings 1½lb. mixed mushrooms (such as crimini, shiitake, oyster, and/or maitake), torn into 1\" pieces4sprigs thyme, plus leaves for serving6garlic cloves, smashedKosher salt, freshly ground pepper¼cup extra-virgin olive oil2Tbsp. unsalted butter1cup polenta4oz. Parmesan, finely grated, plus more for serving1Tbsp. red wine vinegarFlaky sea saltPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 325°. Combine mushrooms, thyme sprigs, and garlic on a large rimmed baking sheet. Season generously with kosher salt and pepper; drizzle with oil. Toss to coat mushrooms, then spread out in an even layer. (Make sure not to crowd the mushrooms on the baking sheet; otherwise, they’ll steam instead of getting crispy.) Transfer to upper rack in oven and let mushrooms roast while you prepare polenta.Step 2Bring 4½ cups water to a simmer in a large ovenproof saucepan over medium-high heat. Add butter and a generous pinch of kosher salt and whisk to melt butter. Gradually add polenta, whisking constantly. (Gradually incorporating the polenta into the water is key to preventing clumps.) Return mixture to a boil, immediately cover pot, and transfer to lower rack in oven. Bake polenta, shaking baking sheet with mushrooms occasionally, until polenta is tender, 25–30 minutes.Step 3Remove polenta from oven. Crank up oven temperature as high as it will go (but don’t broil). Continue to cook mushrooms until crisp around the edges, 5–10 minutes longer.Step 4Meanwhile, carefully uncover polenta and whisk vigorously, scraping bottom of pan, until polenta is smooth and thick. Gradually add 4 oz. Parmesan, whisking constantly until melted and incorporated; taste and season with more kosher salt and pepper. Cover and keep warm over low heat while mushrooms finish roasting.Step 5Remove mushrooms from oven; drizzle with vinegar. Toss to coat; let cool slightly.Step 6Divide polenta among bowls and top with mushrooms, thyme leaves, sea salt, and more Parmesan.Photo by Alex Lau, food styling by Sue LiHow would you rate Oven Polenta with Roasted Mushrooms and Thyme?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleJUST SO YUMMY! I followed directions exactly as written and this is just SO delicious!  I added, as suggested, a little cream and a sprinkle of cheese at the end and it brought this already great recipe over the top!  Thank you for this recipe! LindaJersey Shore, NJ11/15/2021SO tasty. I made it with rosemary, sage, and topped with a fried egg. I skipped the vinegar and cut the butter and cheese a bit in the polenta.SophieAnn Arbor10/17/2021This was AMAZING.  The recipe was easy to follow and the flavors  of the ingredients married together wonderfully.  Looking forward to making it againSiu9/11/2021I made this for the third course in a six course mushroom themed dinner! With 4 of the 6 guests identifying as vegetarian- this turned out to be the fan favorite! My only comment is that the the mushrooms cooked faster than the polenta (this could be my oven), but the recipe tells a different story.Haley Washington DC 9/8/2021Really tasty and easy to prepare. I’ll definitely make it again! The only deviation we made was that I just made polenta the normal way on the stove top because I didn’t have the right kind of lidded cookware to put in the oven.  Definitely don’t skimp on the mushrooms, it looks like a lot, but then cooks down into only 2, MAYBE 3, servings.  AnonymousSeattle4/24/2021Adapted this just a bit but it prolly didn’t need it too much. I treated this like a shrimp and grits adaptation. I made a cream sauce on side with a bit of thyme, pepper, parm, Kerry gold butter and cream. I had over salted the polenta (which was a perfect accident) so I left the cream sauce as is but it could use a pinch of salt. I also added a bit of parm to the polenta per recipe instruction. The mushrooms were perfect the way they were. Assembled as I would shrimp and grits-polenta, topped with mushrooms and drizzled cream sauce on top. This is a keeper in my book. MegC32Charlotte NC3/28/2021This is a keeper however the polenta required much more cooking than I planned. After time in the oven as directed it was not thick enough so 20 min on the stovetop did the trick. \nInstead of water I suggest chicken stock, once served mix in a splash of dry white wine , serve with fresh ciabatta =HEAVENMangeClayton MO9/29/2020The first pass on the recipe was good, but nothing special.  We replaced the red wine vinegar with a 40 year-old balsamic, and used Gorgonzola in place of the Parmesan.  As Porcini and Mugello mushrooms are in season for us, we used those, and found the dish vastly improved.AnonymousVenice, Italy9/23/2020Thiss was good, and the advice to watch closely affter upping the temperature is good advice--just caught it.  Some of the reviews are ridiculous \"I didn't have mushrooms or polenta, but used spahgetti and clams--turned out great!\"FredoUSA8/12/2020Is there a reason that no information in the polenta with roasted mushrooms recipe about quantity of polenta and form...coarse, etc.? Susan OdiseosBoulder, CO 6/5/2020Polenta is DELICIOUS but the upping the temp of the mushrooms at the end totally burnt them!!! BEWARE!mollyfmuellerNew Orleans5/26/2020Loved this! Didn't have mushrooms but I did have beets and greens. Loved how easy this was--would definitely make again. AnonymousMassachusetts5/19/2020Yes this was good. Actually it was really good. I think it might be foolproof, but not 100% sure. I didn't have polenta and I just made it with couscous. I imagine its extremely delicious with the polenta and I am definitely looking forward to trying that. With couscous it was super quick. I did add some veggie stock and shallots to the couscous as I was making it. Cranked the mushies up a bit more in the oven-- maybe 400. Everything fell into place. Much wow.gnatonthemoonKC5/3/2020This was so delicious! I will absolutely make this again :) AnonymousToronto4/16/2020So delicious!! I had to add a little more water than called for. Highly endorse the cream/garlic addition. Personally felt it needed a little parsley and red wine vinegar at serving to brighten things up— super good. Emma TowerPortland, ME4/9/2020Explore Bon AppétitRice and Grain BowlItalianEuropeanItalian AmericanAmericanMushroomVegetablePolentaRice & GrainsParmesanCheeseEasySideMainVegetarianDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}