{"id": "9b261ec2f61ab5fd66e5a80c21522934", "url": "https://www.bonappetit.com/recipe/spiced-snapper-with-cucumber-salad", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Spiced Snapper with Cucumber Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSpiced Snapper with Cucumber SaladBy Andy BaraghaniJanuary 9, 20184.8(6)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintRoasting fish fillets that have been oiled and seasoned is a fail-safe, hands-off technique with big flavor payoff. Baharat is a spice mixture typically made with paprika, black pepper, cinnamon, coriander, cumin, and cardamom. You can also use it to season steaks before grilling, or toss through root veg before roasting.Ingredients4 servings2garlic cloves, finely grated2teaspoons baharat or ras-el-hanout6tablespoons extra-virgin olive oil, plus more for drizzling46-ounce skin-on, boneless red snapper filletsKosher salt1lemon, halved3medium Persian cucumbers, peeled, sliced ¼ inch thick1medium shallot, thinly sliced into rings, rinsed, patted dry1cup cilantro with tender stemsPreparationStep 1Preheat oven to 425°. Mix garlic, baharat, and 6 Tbsp. oil in a small bowl. Place fish on a foil-lined rimmed baking sheet and pat dry. Rub both sides of fish with garlic-spice oil; season with salt. Turn skin side up and bake until fish is tender and cooked through and skin is beginning to brown, 8–10 minutes. Finely grate zest from a lemon half over each fillet as soon as you remove fish from the oven.Step 2Squeeze juice from a lemon half into a medium bowl. Add cucumbers, shallot, and cilantro, season with salt, and toss to combine.Step 3Slide fish onto a platter; top with cucumber salad and squeeze juice from remaining lemon half over. Drizzle with olive oil.How would you rate Spiced Snapper with Cucumber Salad?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWow we really enjoyed this meal! It all came together so beautifully. It is a light meal with red snapper we used ras el halout, with the added lemon zest at end wow great flavor. The cucumber shallot salad is a great pair with this dish I can’t imagine a better side dish. *we did cook our snapper longer by 5 minutes, we are used to salmon so thought it was still under done, do not cook longer the fish continued to cook and was dry by the time we finished eating. We will be making again! Thank you   Ellie PippaNew Albany, Ohio6/24/2021Cucumber salad is simple but delicious.  I loved using the ras-el-hanout on the fish.  It perfumed the fish but didn't take away from the flavor.  It might have been my cut of fish, but I've had better success using parchment paper and would probably use that method and then put the skin side up under the broiler for a minute or two.  Some parts of my fish turned out pretty tough.  Served with a koresh bademjan and basmati rice.  Rebecca QIndianapolis11/18/2020I made this with a seven spice blend instead of baharat since I couldn't find it in my international market and red that it could be used as a replacement for ras-el-hanout. The fish turned out okay, I'll have to try baharat next time to see if it knocks my socks off next time. Otherwise, it was just baked fish, nothing too special. The Persian cucumber salad was super delicious though. As someone who typically hates salad and cucumbers, I found this super refreshing and the portion size to be perfect. I can see myself making that as a side for a lot of dishes. AnonymousMilwaukee3/21/2020Explore Bon AppétitMiddle EasternSnapperFishSeafoodCucumberVegetableQuickEasySheet-Pan DinnersWeeknight MealsMainGluten-FreeDairy-FreeNut-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}