{"id": "9b276dc18c96b1e10440d3f93df97fb6", "url": "https://www.bonappetit.com/recipe/mushroom-steamed-eggs", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Silky Steamed Eggs With Mushrooms Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSilky Steamed Eggs With MushroomsBy Jessie YuChenJanuary 21, 20225.0(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susan Ottaviano EmailPinterestPrintEmailPinterestPrintThese silky, savory, and warming steamed eggs are a simple comfort food I grew up eating in Taiwan. There are many versions of the dish yielding different textures and flavors, but my recipe calls for just three ingredients: eggs, rehydrated dried shiitake mushrooms, and hon-dashi, or instant dashi powder. This recipe serves 4 as part of a larger meal, but you can easily make a snack-size portion using fewer eggs. I like to eat it with plain steamed rice and a stir-fried vegetable or as a side with congee.To make steamed eggs at home you’ll need a lidded pot that can fit a steaming rack or basket, or a Tatung steamer (a piece of equipment I can’t live without)—plus a heatproof bowl. I suggest serving your perfectly jiggly eggs topped with a touch of soy sauce, chili crisp, and scallions to brighten them up, but you can be creative and experiment with XO sauce, black vinegar, and sacha sauce as well. —Jessie YuChenAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronOXO Stainless Steel Good Grips Steamer with Extendable Handle$20 At AmazonHeat Resistant Gloves$20 At AmazonLarge Pot$55 At AmazonTatung Steamer$150 At AmazonWhisk$10 At AmazonMesh Sieve$13 At AmazonIngredients4 servings4dried whole shiitake mushrooms, rinsed to remove any grit4large eggs½tsp. instant dashi powder (we like Ajinomoto)Soy sauce, thinly sliced scallion, and chili crisp (for serving)PreparationStep 1Place mushrooms in a medium bowl and pour in 1½ cups hot water to cover. Let sit 30 minutes to rehydrate.Step 2Squeeze out rehydrated mushrooms over bowl to catch soaking liquid; thinly slice mushrooms.Step 3Add eggs and hon-dashi to bowl of mushroom soaking liquid and whisk to combine. Strain through a fine-mesh sieve into a heatproof serving bowl (you will steam and serve from this bowl) to remove bubbles. Using a spoon, skim off any remaining bubbles, then gently sprinkle mushrooms over egg mixture.Step 4Place a steaming rack or basket in a large pot with a lid (make sure your bowl will fit in the pot when covered with lid). Pour in water to come 2\" up sides of pot and bring to a simmer over medium heat. If using a Tatung steamer instead, add 1 cup water to steamer.Step 5Carefully place bowl with egg mixture into steamer and cover immediately, leaving lid slightly askew for steam to escape. Reduce heat to medium-low and steam, adjusting heat as needed to keep water at a gentle boil, until egg mixture is set and jiggly when shaken, 12–15 minutes. If using a Tatung steamer, place bowl with egg mixture in steamer and cover with lid, propping open with a folded paper towel. Press cook switch and wait until switch bounces back, about 15 minutes.Step 6Carefully remove bowl from steamer (use a hot dish clip or heatproof gloves). Top steamed eggs with soy sauce, scallion, and chili crisp as desired.How would you rate Silky Steamed Eggs With Mushrooms?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleSimply put, this one’s a keeper.Ivan NovoMiami, Florida.2/3/2022In my world, 4 eggs and 4 mushrooms over rice with sliced scallions is serving for 4.AnonymousNew Jersey1/25/2022Well it's not really required to eat it with rice or any other dish. As a child my grandfather would make this for me and my siblings for breakfast or snack during the weekdayAnonymous1/23/2022replying to the comment below, the recipe clearly states that you have it with rice and another side dish not just on its own Anonymous1/22/2022This looks delicious but in what world does 4 eggs and 4 mushrooms constitute 4 servingsAnonymousGermany1/22/2022Explore Bon AppétitDinner5 Ingredients or FewerQuickEasyWeeknightTaiwaneseEast AsianAsianMushroomVegetableEggSteamSnackSideDairy-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-21", "author": ["Condé Nast", "Jessie Yuchen"]}