{"id": "9b27362e35930d75b546f693fd8c9557", "url": "https://www.bonappetit.com/story/instant-pot-dal-formula", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "The Instant Pot Dal Formula That Makes Dinner In Minutes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Instant Pot Dal Formula That Makes Dinner In MinutesAll in one handy chart.By Priya KrishnaMarch 15, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailI’m pretty sure that if you checked my bloodstream right now, I’d be made up of 30 percent dal. This is thanks partly to my mother, who taught me how to make dal, but mostly to my Instant Pot, which has made dal making an almost daily occurrence in my life.Let me back up. Dal, or lentil soups, are the basis of home cooking for Indian vegetarians. Instead of a meat and two sides, my meals growing up consisted of dal, plus rice, sabzi (sautéed vegetables), and salad. Dal plays a similar role to meat—there are endless ways to prepare it, it’s filling, and it’s packed with protein. I’m no longer vegetarian, but my mom’s Rolodex of dal recipes are a lion’s share of my weeknight meals. Why? Because dal is unbelievably easy to cook, it clings to seasonings well, and it’ll keep in your freezer basically forever.There are at least a dozen kinds of lentil varieties in Indian cuisine, from the chubby, buttery kali masoor dal (my favorite) to the soupy, smooth pink masoor dal (my dad’s favorite) to the tiny baby food–like split moong dal (any small child or sick person’s favorite!). Growing up, we ate them all, with various combinations of seasonings and vegetables. We were equal opportunity dal eaters.My sister and I complained often about the monotony of eating dal every single day for dinner, so through the years my mom made some creative adaptations: She topped our chana dal with caramelized onions, added big chunks of cooked zucchini to the pink masoor dal for texture, and stewed in tomatoes to the kali masoor dal for an acidic tang.For a very long time, my mom’s go-to method of making dal was the pressure cooker. Indians have been using pressure cookers to make dal for ages. It transforms lentils into unctuous morsels, deeply integrates spices, and turns liquid to thick, velvety broth faster than it would take on stovetop. It’s also hot as heck in much of India, and pressure cookers don’t force you to stand over a hot stove all day. She sometimes used a slow-cooker as she could dump in the dal, spices, and water before she went to work and have a finished dal ready by the time she returned. Still, the spices and the dal never seemed to meld as seamlessly as in the pressure cooker.Enter the Instant Pot: my aunt bought one last year and quickly discovered that it was a breakthrough gadget for Indian cuisine. It essentially does the work of a pressure cooker but with none of the annoying/scary whistles and fewer parts to clean. She proceeded to buy one for all of our family members.I’ll never forget the first time I made kali masoor dal in the Instant Pot. I took a bite and literally started weeping. I had never had dal so smooth and with such a delightful chew. The depth, the sheer comfort—this little soup had it all.My mom has been slow to embrace the Instant Pot. Sometimes I think she derives an odd sense of pleasure in food that takes a little more time and finesse to prepare, where only she has the know-how to make it happen.As for me, I’m all in. Honestly, I’ll never make dal in anything else ever again.No matter what kind of dal you are making, the general formula is roughly the same: add 1 cup rinsed lentils, water (the amount depends on the type of lentil), turmeric, and salt to the Instant Pot, set to high (or in some cases, as you’ll see below, low) pressure, and cook for anywhere between six to 20 minutes with natural pressure release.Step 1: Always rinse your lentils.\nAlex LauSeparately, melt some ghee (or butter) in a pan and add a teaspoon of cumin seeds, dried chiles, red chili powder, and asafoetida (like Indian MSG)—you want to do this separately because it adds that nice jolt of richness and fat to the dal, similar to adding grated Parmesan over pasta or a drizzle of olive oil over soup. Spoon the fried spices (also known as the tadka) over the finished dal, and complete with a generous squeeze of lime juice and cilantro.Each dal turns out slightly different, and they’re all fantastic in their own way. The pink masoor dal (made with red lentils, I like the SWAD brand on Amazon for $12/pound) is the soupiest of the bunch, great for those who love the simple, elemental comfort of bone broth, and even better with a textural element like zucchini to balance out all that liquid. Kali masoor dal (made with black or brown lentils) is the perfect balance of soupiness and stewiness; the lentils turn pleasantly squishy, and adding tomatoes brings a much-needed tang to the lentils’ natural earthy flavor. These, to me, taste the richest of the bunch. Split moong dal (made with mung beans) is thick and porridge-like, the coziest solution for a sick day, and a hearty, easy-to-cook, easy-to-digest one-pot meal when accompanied by spinach.  And then there’s chana dal (made with chickpeas), which delivers casserole-like levels of heartiness. It’s hefty but mild-flavored enough to stand up to a pile of sweet caramelized onions, my mom’s genius discovery of a topping.This handy Instant Pot dal chart has everything you need to make perfect dal out of four of the most popular Indian lentil varieties.Use 1 cup of dal for each recipe. Click to enlarge.\nPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.Explore Bon AppétitIndianishInstant PotLentilIndianRead MorecookingThe Chai Formula That's Impossible to Mess UpBy Priya KrishnacultureThe Indian Snacks That I'll Have Over Doritos Any DayBy Priya KrishnacultureInside Patel Brothers, the Most Beloved Indian Grocery Store in AmericaBy Priya KrishnaPhotography by Dan GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Priya Krishna"]}