{"id": "9b282ceb41edc80fbd2c97bc283df508", "url": "https://www.bonappetit.com/story/all-my-friends-have-allergies", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "How to Throw a Dinner Party for Friends With Dietary Restrictions | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe “All-My-Friends-Have-Dietary Restrictions” Dinner Party StrategyMy best advice for accommodating everyone without making 10 separate meals. By Tyler KordJanuary 31, 2020FacebookTwitterEmailPhoto by Ted + Chelsea Cavanaugh, Food Styling by Susie Theodorou FacebookTwitterEmailCooking food (not to mention sharing it with others) can be confusing. So in Unprofessional Advice From a Professional Chef, we ask Tyler Kord (the professional chef) the hard-hitting questions.Q: I want to host my friends but they have so many allergies! No nuts. No gluten. Vegetarian. Sometimes vegetarian. What do I make?A: How fun! I realize that probably reads like sarcasm but I mean it! Imagine how boring Chopped would be if Ted Allen just said, “Okay, cook some food or whatever,” instead of saying something like, “Here are some VERY specific things to cook with, some of which aren’t really food, and also you don’t have very much time and Scott Conant may get super mad at you if you serve him raw onions” (actually, I’m pretty confident that is exactly what he says, and then the contestants have to make something out of beef jerky and Skittles and it is fun!).Having some guidelines and limiting your options can open your eyes to just how much you are capable of, and to me that is one of the funnest and most rewarding parts of cooking. Like looking in your cupboard and fridge and figuring out what you can make with ingredients you already have, or making something that is a little past its prime taste delicious, or cooking for people with restricted diets and, rather than just making edible food that doesn’t contain any objectionable ingredients, actually making something spectacular.And I want to take this moment to say to you, home cooks who feels put out to cook for your friends with food allergies and limiting preferences, and also to you, cooks and chefs who find it difficult to accommodate customers, that if these kinds of challenges are prohibitively difficult or frustrating, then maybe you actually just don’t like cooking all that much. Because great cooking in and of itself is about using natural ingredients that are inherently inconsistent, promoting their strengths, and creating something that transcends the original ingredients. That is not to say that you can’t buy the same can of tomatoes, the same box of spaghetti, and the same bottle of olive oil and consistently make something amazing by doing the exact same thing every time, but if that is the only thing you ever make, then you like cooking spaghetti with tomato sauce, but not necessarily cooking in general. And that is entirely okay! Really! I have worked with lots of professional career chefs who don’t seem to like cooking even a little bit and when faced with a customer with dietary restrictions will say things like, “Maybe they just shouldn’t go out to eat at all,” and that is not entirely okay. But we aren’t here to talk about the restaurant industry because we’re here to have fun! Right? Maybe?So to the home cook I would say that there is nothing wrong with having your friends over, finding a restaurant that can accommodate all of their needs, and ordering takeout. Nobody ever said that if you don’t cook for your friends and family you are somehow getting less out of life, or maybe they did but ignore them because they are pretentious and unliked, despite their fabulous dinner parties. I know that “don’t cook” is not the kind of advice you’ve come to expect from Bon Appétit but I think that gaining a better understanding of what motivates us and what makes us happy is useful anywhere, but especially in the kitchen. And I know plenty of people who don’t like to cook and they all seem much happier than me!Anyway, I’m sorry, I haven’t even tried to answer your question yet and instead just suggested that you don’t like cooking and I apologize if that was unhelpful. Maybe I was just projecting. But I’m okay, and I’m excited to help you make something awesome and if you do a good job maybe I will come to your party, and honestly, even if you do a bad job I will still probably come if there is alcohol and music or just alcohol.My advice is that you make one great thing, which can be super simple—like a pot of perfect rice or a whole roasted eggplant for each guest, split down the middle and drizzled with olive oil and salt after it’s cooked—or it can be something more complicated like this bean-y stew (minus the bread) and then make a bunch of accoutrements so your guests can pick and choose what works for them.Or make it a top-your-own congee party.\nSo, let’s say you pick rice: Do ½ cup per person, (this is too much, but you’re entertaining and rice is inexpensive and this will be fun, I promise!) of brown rice or jasmine rice or Uncle Ben’s rice that’s been dry-toasted like Israeli couscous before cooking to give it that mottled, uneven, toasty look. Cook it with water and salt and a splash of coconut oil on the stove—or just follow this recipe—and once it’s cooked, put it in a big, beautiful bowl and feel really good about it.And then cook a can of cranberry beans (with the liquid from the can!) with 4 cloves of chopped garlic, an entire bunch of chopped cilantro, stems and all, and some olive oil until it is hot and the garlic is cooked, so maybe 10 minutes or so, and put it in a bowl. Roast some broccoli florets with olive oil, salt, and cumin seeds at 400° F for 15 to 20 minutes or until they’re cooked and a little dark at the edges and put them in a different bowl. Cut some lemons and limes and put them in a bowl for squeezing. Put some plain, possibly strained (a.k.a. Greek), yogurt in a bowl; not everybody at the table can eat it but that is okay and they will not care! For that matter, throw a pound of oxtails, a chopped onion, and a dark beer in a pot, cover the pot, and put the pot in a 325° F oven for a few hours. It won’t generate a ton of meat, but it will give you some righteous sauce and just enough protein that the people who eat meat can have a little meaty accent.Make a quick vinaigrette, or whisk a splash of vinegar and some garlic salt (or kosher salt and some dried oregano or a few chopped mint leaves) into some coconut milk and put it in a bowl with a big spoon. Buy some fried shallots or onions and put them in a bowl. Grab every bottle of hot sauce that you own. Put everything on the table and let your guests eat family-style so that they can avoid the things they don’t want while you sit back and feel like a champion.And for dessert just give them some fruit or whatever. Honestly, I think your friend Mark is just vegan because he thinks it’s cool. Ugh, I hate trying to make dessert for people who can’t eat anything. Just kidding, did you see what I did there? Make this!Explore Bon AppétitUnprofessional Advice From A Professional ChefRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-31", "author": ["Condé Nast", "Tyler Kord"]}