{"id": "9b29529ab9a1fcaebd52c6d4cc89a05a", "url": "https://www.bonappetit.com/story/chinese-steamed-eggs", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Chinese Steamed Eggs Might Be For Babies But I'll Never Stop Making Them For Myself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSteamed Eggs Might Be For Actual Babies But I'll Never Stop Making Them For MyselfTastes like creamy, custardy nostalgia. By Cathy ErwayMarch 11, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I love the silky suppleness of chawanmushi, the Japanese savory egg custard. And I love the fluffy unevenness of the American diner-staple scrambled eggs. Somewhere in between these two planes lie one of the most delectable and practical egg dishes of all time: steamed eggs. (I could be biased, though, as it was one of the first solid foods I ate.)What are steamed eggs? As opposed to being an established dish of any specificity, steaming eggs is a homestyle Chinese method for cooking eggs. Here’s how to do it: Crack a few eggs are into a bowl, whisk them together with a generous splash of water (a must-have to ensure its soft, custardy set), a sprinkle of salt and finely ground white pepper (the go-to for light-colored foods, rather than black pepper). Then place it on a steamer rack inside a pot (or inside an electric rice cooker) with a shallow pool of water that’s been brought to a simmer, then cover the pot for five minutes or so, until the steam turns the eggs roughly the color and texture of softened butter. According to my mother, it’s a typical Chinese baby food, not something you’ll find in cookbooks and certainly not at Chinese restaurants.Karon Liu, a Chinese Canadian food writer at The Toronto Star, concurs. “Chinese parents usually make steamed eggs for babies when they switch over to solid food,” he says. His grandmother’s signature bowl of steamed eggs, which he enjoyed as a child, had seasoned ground pork mixed into the custard. “There’s no right or wrong way to do it, some add chopped salted duck eggs or thousand year eggs, others add pickled mustard greens.”Hsiao-Ching Chou, author of Chinese Soul Food, also remembers the dish fondly from early childhood. “I have distinct memories of being in the little apartment that we were in when I was four years old, looking up at my dad standing by the stove carefully lifting a pan with this egg in it out of the steamer,” just a wok with a lid. Her father would prepare a stir-fried tomato topping for the steamed eggs, so it was akin to a tomato-and-egg scramble, another popular Chinese homestyle dish. Chou is working on her second cookbook, on vegetarian Chinese cooking, that will include a steamed egg dish like her father made it.Aside from the requisite salt and white pepper, my mother usually added scallions when she made steamed eggs for me. But sometimes I just wanted pure, steamed egginess to spoon up like ice cream without any chocolate chips. (While air bubbles are considered a textural flaw in chawanmushi or flan, I found they made steamed eggs all the more crave-worthy, forming in lace-like patterns around the edges of the bowl.) Later on, when I was in between New York City apartments or if the gas wasn’t working in the one I was in, I would remember how to make a satisfying dinner by plugging in my rice cooker and placing a small bowl inside it with beaten eggs and water. I sometimes added chopped bits of this and that, like ham, peppers, and onion for a “Western” omelette-inspired steamed egg bowl. I never went so far as to add cheese to steamed eggs, but don’t see why you couldn’t.I sometimes wonder why a dish using this technique hasn’t been catapulted to fame somehow—why hasn’t steamed eggs spawned irresistible, eggy adaptations, stuffed with sophisticated treasures like dried scallops or trumpet mushrooms, and dabbled with adult-appropriate toppings, like chile oil and cilantro? Steamed eggs are better than a “blank canvas”—they’re a savory, creamy cushion for whatever your heart desires or leftovers allow.But maybe home cooks who know of this eggy flex are often too attached to the nostalgia of childhood versions. And then I remember how much I craved the straight-up custard, sans other stuff, as a kid.“You have to appreciate the nuance of the egg itself,” says Chou. “But at the same time you can have flavors that enhance that core flavor profile and texture.”If it’s your first encounter with the ethereally fluffy baby-food specialty, give it a try more or less on its own. A dab of chile oil and a smattering of fresh herbs like cilantro are a good starting point—and you may just want to stop there.Cathy Erway is a cookbook writer, podcast host, and blogger living in New York.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-11", "author": ["Condé Nast", "Cathy Erway"]}