{"id": "9b45ac8e9b63d1f307d705a6c285c23a", "url": "https://www.bonappetit.com/story/consider-bardwell-cheese", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "When I Don’t Want To Cook, This Cheese Is Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen I Don’t Want To Cook, This Cheese Is DinnerConsider Bardwell Farm’s Dorset Mini is pudding-like, rich, and just the right amount of funky.By Hannah HowardOctober 8, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Sometimes dinner is a cheese plate. I mean a “cheese plate” in the very loosest sense of the term, in that it is cheese on a plate. If I’m feeling ambitious I might include a few other supporting characters to round it out and make it seem more like a meal: olives, fresh veggies, something cracker-ish. But none of these are entirely necessary. The ideal cheese is the star of the show, able to stand alone and feel not just meal-worthy but joyfully meal-worthy. When I’m making an entire meal of cheese, I’m all about the satisfying, earthy heft of washed rind cheeses, and more specifically, Consider Bardwell’s new Dorset Mini.Washed rind cheeses are literally washed with brine (or sometimes wine, beer, or spirits) as they age, which fosters an environment hospitable to a variety of bacteria, often brevibacterium linens (b. linens). The b. linens give these cheeses their famous sticky, tangerine-colored rinds and their pungent aromas. One of the classic examples of this style, Epoisses de Bourgogne, is so potent that it’s reportedly banned on Parisian public transport.Consider Bardwell’s Dorset Mini is more nuanced, and I don’t think anyone would sniff it out on the subway. This semi-soft Jersey cow’s milk beauty is made in West Pawlet, Vermont, right on the border of New York State. It weighs in at 12 ounces, so it’s not exactly tiny (the mini refers to it being a scaled down version of the original Dorset); it makes an excellent meal for two. Its pretty orange exterior yields to a paste with a pudding-like, rich texture, and its flavor is savory, almost meaty, with tons of complexity. It has enough funk to intrigue, but it doesn’t hit you over the head with stinky-ness.Consider Bardwell is a longtime darling of the American artisan cheese world. In 2004, Angela Miller, a NYC literary agent and book editor for chefs like Jean-Georges Vongerichten, started the creamery along with her husband, Rust Glover, by reviving what had been a dairy co-op, founded in 1864 and shuttered during the depression. I was lucky enough to visit when I worked for Murray’s Cheese in 2015. I’ll never forget the green rolling hills—they nearly looked fake—and the kindness of the small staff. Their cheeses are made solely from fresh Jersey cow’s milk from a single herd just down the road, and the milk’s bright flavor shines through even in their bolder wheels like Dorset Mini.You can turn Dorset Mini into a meal with whatever’s in your fridge, but I recommend pairing it with apples and honey or ribbons of jamón and cornichons. For a special occasion, break out the Cava. You won’t miss the meal you didn’t cook.Photo by Emma FishmanConsider Bardwell Dorset Mini$28 at Consider Bardwell Farm$28 at Saxelby CheesemongerersExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-08", "author": ["Condé Nast", "Hannah Howard"]}