{"id": "9b46a18a7406e9ebb787953f025aec41", "url": "https://www.bonappetit.com/story/hangar-1-smoke-point-vodka", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Hangar 1’s Smoke Point Vodka Makes Use of Grapes Damaged in California Wildfires | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Vodka Is Made from Wildfire-Damaged GrapesWinemakers were set to toss their smoke-tainted grapes. Then Hangar 1 stepped in.By MacKenzie Chung FeganOctober 16, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.About a year ago my mom texted me a photo that looked like the end of the world. It was taken from her living room in San Francisco, and the morning sunlight should have been streaming through her east-facing windows. Instead, the room was suffused with a reddish glow so dim that I could barely make out her sofa and coffee table. Fires were raging to the south in Santa Cruz and to the north in wine country, and the smoke blanketing SF was a horrifying indication of the destruction just miles away.In 2020 over 4 million acres were claimed by fire in California. One of the largest incidents was the Glass Fire, which spread throughout Napa and Sonoma in late September and October. Weeks before the fire was contained, winemakers were already sounding a death knell for the season’s crop. Grapes become more susceptible to smoke taint the closer they get to harvest, and the Glass Fire hit right as Napa growers were bringing in their haul. Wine made with grapes that have been blanketed by smoke tastes—you guessed it—smoky. “Hints of ashtray” is not a descriptor anyone wants applied to their Chardonnay.But as Diddy fans know, there’s more that can be done with grapes than make wine. Unlike tequila or Scotch, vodka can be distilled from anything that has sugar content, including wheat, potatoes, and whey. Because vodka is a highly refined spirit, you likely can’t taste the difference between one made from corn and one made from beets—or even one made from smoke-tinged grapes.Hangar 1’s Smoke Point Vodka is made from just that. Located in Alameda, about 10 miles to the east of my mom’s house, Hangar 1 has a deep connection to California’s grape growers; its signature vodka is distilled from both grapes and grain. With vineyards hurting, they wanted to find a use for Napa’s adulterated crop. The resulting vodka, made from Merlot and Malbec grapes, has not a trace of smoke—which is not to say it’s lacking in character. Unlike most mass-produced vodkas that are made using neutral grain spirit, Smoke Point tastes like something. To me it’s reminiscent of Claire Saffitz’s honey-vanilla sablé cookies, ideal for martinis or even sipping straight.Smoke Point is a limited release, with only 4,800 bottles in existence. While I hope this is the first and last year Hangar 1 will need to step in and create demand for smoke-tainted grapes, that seems rather unlikely. With climate change creating ever more devastating fire seasons, there’s another reason to add a bottle of Smoke Point to your bar cart—all proceeds go to the California Fire Foundation.Hangar 1 Smoke Point Vodka$57 at Reserve BarExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-16", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}