{"id": "9b5d8e7209feafbad8cfba2bbd0933b7", "url": "https://www.bonappetit.com/story/how-to-make-kefir", "year": 2020.0, "month": 12.0, "day": 2.0, "content": "How To Make Kefir (And What I Do With It) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHomemade Kefir Is Tangy, Creamy, And Absolutely Worth ItThe probiotic-rich fermented drink is a key part of my wellness (and breakfast) routine.By Paloma Quevedo December 9, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery morning, while the kettle heats the water for my coffee and my two-year-old slurps her Cheerios, I feed and strain my kefir grains. The grains—small, squishy clumps that resemble cauliflower florets—bubble away in a large glass jar in a corner of my kitchen, fermenting milk into a tangy, slightly carbonated, and incredibly creamy drink.My partner's mother, Silvia, gave me kefir grains when my baby was born. Her family has been brewing their own kefir for years and she recommended it to improve the quality of my breast milk. At the time I was also getting monthly urinary tract infections and going days without a single bowel movement—basically a hormonal mess. Two years later I’ve continued to cultivate my grains and drink kefir daily because of the way it balances my gut flora, which in turn has played a major role in sustaining my overall physical and mental health.Kefir is powerful because it contains numerous beneficial bacteria like Bifidobacterium lactis that’s strong enough to survive your digestive tract and nourish the gut’s microbiome. These beneficial bacteria aid in digestive regularity and can also ward off the bad bacteria that cause UTIs. According to researchers at Johns Hopkins University’s School of Medicine, a huge portion of our immune system is located in the gut, where probiotics can potentially interact with the immune system in a number of ways, from influencing the creation of antibodies to signaling infection in other parts of the body.Surprisingly, healing my gut helped me heal emotionally too. In the past decade a lot of research has been done on the connection between the gut and the brain—now referred to as the “gut-brain axis.” In a 2017 study published by the Texas Tech University School of Medicine, researchers linked gut inflammation to anxiety and depression. Healthy volunteers with no previous depressive symptoms were given either probiotics or antidepressants for thirty days—the probiotics group showed reduced levels of cortisol (a stress hormone) and self-reported improved psychological effects to a similar degree as the participants who received Diazepam, a commonly used anti-anxiety medication. On a personal note, by drinking kefir every morning, I’ve experienced less intense ups and downs throughout the day.Eager to try making your own kefir? Here is everything you need to know to get started:You’ll Need:2 glass jars (at least 1 quart each)1 Plastic, nylon mesh, or stainless-steel strainer1 Plastic or wooden spoon2-3 cups fresh dairy milk (Just make sure the milk you choose is not ultra-pasteurized, because then it’s not a viable food source for kefir grains. If you’d like to try alt milk, read more about the process here.)At least 2 tablespoons of kefir grains. You can order them online, or if you find a kefir stand at a farmers market, some sellers will give you the grains for free.Step 1: Fermentation-Place 1 Tbsp kefir grains in a glass jar and fill with 1 cup fresh milk. The ratio of grains to milk should always be 1 tbsp to 1 cup, and can be increased if you’d like to make a bigger batch. Leave about an inch of room at the top to make room for carbonization and grain growth.-Cover jar with something breathable, like a tightly woven cloth or coffee filter, and secure with a rubber band. The kefir grains don't need oxygen to survive but there are bacteria strains within milk and kefir grains that thrive in oxygen-rich environments, so airflow is key.-Let the jar with the kefir grains and milk sit at room temperature for approximately 24 hours. If it’s hotter where you live, the fermentation process will probably be quicker, or slower if it's cold. You’ll know the kefir is done when the consistency has thickened, the milk tastes sour, and slight swirls of white and yellow start to appear in the mixture—this is the curds and whey just beginning to separate.Step 2: Strain your kefir-Pour the mixture through a strainer, catching the liquid in a bowl, and use a wooden spoon to push the grains against the strainer and catch all the excess liquid. You’ll be left with just the grains in the strainer, which will look less like yogurt and more like cottage cheese.-Pour the kefir from the bowl into another glass jar or bottle and cover with a lid. You can drink it immediately or keep it in the fridge for up to three weeks.Step 3: Feed your kefir grains again-Return the kefir grains from the strainer back into their jar and pour fresh milk over them again, then cover and repeat the whole process. Kefir grains will double in size every two weeks or so, so make sure to add more milk to maintain the 1:1 ratio. If you have too many grains, give some to a friend or mix them into a smoothie.Step 4: Eat or drink your kefir-Usually, the easiest thing to make myself for breakfast is a smoothie packed with greens, berries, and about a cup of kefir for a tangy kick. If I have extra time on Sundays, I meal prep overnight oats for the week, subbing the milk and yogurt with kefir. But if I’m short on time, I just use kefir as a substitute for yogurt in recipes like Rick Martinez’s caramelized plantain parfait.Kefir is sort of an acquired taste and newbies will probably shy away from drinking it straight. But by now, I’ve grown to love it. Sometimes I mix in a bit of honey and drink it slowly, enjoying each zingy sip.Buy it: Live Milk Kefir Grains, $4.50 Explore Bon AppétitHealthyishFermentationRead MoreLifestyleHow I Get My Smoothies So GoodBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-09", "author": ["Condé Nast", "Paloma Quevedo"]}