{"id": "9b6b7ac28ebca8202e35dd7b7589db54", "url": "https://www.bonappetit.com/story/turmeric-yogurt-dip", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "This Turmeric Yogurt Dip Is a Great Excuse to Load Up on Spring Produce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Turmeric Yogurt Dip For All Those Spring Vegetables You Just BoughtYour crudité plate just got a springtime refresh.By Seamus MullenMarch 29, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailI’m a huge advocate for eating foods that do right by our bodies. I was super sick for many years, struggling with chronic inflammation and fighting a so-called “incurable” autoimmune disease. I got so far down  the path of illness that the writing was on the wall: Change or die. So I changed. I changed my relationship with food, I changed how I approached cooking, and I applied the years of skills I had developed as a professional chef to making healthy food taste delicious.This turmeric yogurt dip is a perfect example of how I like to use nutrient-dense ingredients like ginger, turmeric, yogurt, and olive oil in a way that doesn’t punch you in the face with “healthy.” Make it in the morning before work, let the ingredients get to know each other in the fridge, and come home to a super flavorful dish. The delicate, warming flavor of turmeric contrasts with the cooling cucumber and creamy yogurt.I’m not one of those cooks who eats an amazing meal then tries as hard as I can to recreate it once I get home, but I love to find elements of a dish and reimagine them in new and different ways. I remember eating raw bok choi in Chiang Rai in the far north of Thailand—it was something so obvious that it seems silly I had never thought of it before. Nearly 16 years later, I’m still playing with new ways to integrate it into my cooking, like as a vessel for  this dip. It has the scoopable quality of celery with just enough crunch, plenty of water, and virtually none of the annoying stringiness. It’s one of the all time vegetable champs! Of course,  you could also serve this yogurt dip alongside grilled lamb, lamb burgers, or any vegetables from the market. It’s ridiculously easy and delicious, and it’s perfect for a spring refresh.It's dip season:Turmeric Yogurt DipVigorously squeezing the cucumbers to remove as much water as possible helps to concentrate their flavor and creates a thicker dip.View RecipeExplore Bon AppétitTurmericCrudite DipHealthyishYogurtDipRead MorecookingPoach Your Eggs in Chicken Stock—Just Trust UsBy Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Seamus Mullen"]}