{"id": "9b6c240a7306aa1e36aa6780ba15d454", "url": "https://www.bonappetit.com/story/yia-vang-fathers-recipe", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "I Spent My Life Assimilating, but My Father's Recipe Reminds Me of Who I Am | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Spent My Life Assimilating, but My Father's Recipe Reminds Me of Who I AmYia Vang reflects on how he ran away from his Hmong identity as a kid and what he learned when he returned to it as a chef.By Yia Vang, as told to Elyse InamineJune 14, 2021FacebookTwitterEmailPhoto by Lauren CutshallFacebookTwitterEmailI can’t do anything that red-blooded American fathers teach their kids. I don’t know how to swim. I can’t throw a perfect pitch. I didn't know how to ride a bike until I was in college. I remember I was shaking on that thing while my friends laughed at me because they thought I was joking around. My buddy was holding me steady, like I felt my father should have.What my dad did teach me was how to make Hmong sausage. Every two to three weeks, he’d wake us kids up at 6 a.m. and drive us to a farm in Lancaster, Pennsylvania. We grew up in that area. As a kid I was more comfortable breaking down a pig than shooting a free throw. We made Hmong sausage the old-school way. We took the meat, hundreds of pounds of pork belly and shoulder mix, and chopped it into small pieces with two knives. We set up five boards for chopping and we took shifts. I knew it was my turn when Dad said to me, “Go chop meat.”We aimed for a coarse grind not a fine one. This sausage isn’t bratwurst; the meat doesn’t emulsify in the fat. Then we mixed together lemongrass, ginger, fish sauce, Thai chiles, garlic, MSG, and salt. We grabbed a two-liter bottle of Coke and cut off the top so it’s like a funnel, put pork casing at the tip, and stuffed it by hand. We stuffed until the casing was filled, then we tied it off and kept going. Yia’s father, Nhia Vang, fries egg rolls in his backyard in Hugo, Minnesota.\nPhoto by Eliesa Johnson, courtesy Yia VangWhen you go to family gatherings or parties, there is a thing you do in Hmong culture. If you walk into a room with elders, they ask for your name and the name of your father. Anytime I said my dad’s name, the room stopped. The men would look at me. One time a man grabbed my arm and said, “Your dad is a really good man. He saved my life. Not many men would be here without him.” I was 10, so I was like, “Can I go play right now?”During the Vietnam war the U.S. government needed boots on the ground in Laos. So the CIA came to the Hmong people in Laos and made a deal: Win or lose, we promise you citizenship. A lot of men and their sons signed up, including my dad and his brothers. During the war he protected his men. He saved five lives. It ended up turning into a civil war, and when the Americans lost, they left the Hmong people behind. There was a huge genocide against Hmong people since they fought for the Americans. A lot of them crossed the Mekong river and ended up in Ban Vinai Holding Center, a refugee camp in Thailand.That’s how my parents met, back in 1977. Only recently did I learn the story behind their marriage: My mom told me she let my dad marry her because her girlfriends told her that he was a good man.At school in Pennsylvania we’d have these events and programs, and teachers would tell us to invite our parents. I was so embarrassed. I would tell my teacher they were busy. My mom did factory jobs—she worked for Sargento and Tyson—and my dad was a carpenter. I didn’t want anyone to know they didn’t speak English. There was so much shame and pain, and it caused me to run away from who I was. I wondered if I dressed like my white friends, if I knew their pop culture, then maybe I’d be like them. But when I was with them, there was something crying out in me, reminding me this isn’t home.I tell people that I ran so far from myself that I ran in a circle back to where I was. After college I never wanted to do the cooking thing but ended up in the Twin Cities and I started working at different restaurants. I told myself I would never cook at an Asian restaurant. So I learned how to make Tex-Mex, French food, Spanish tapas, Italian food, barbecue. But at these restaurants, family meal would always be Southeast Asian because the chefs and cooks would always go out to eat Southeast Asian food and talk about how great it is.Slowly, I began to fall in love with something I thought I’d never love again. It’s been a journey; the last eight years I’ve been trying to find my way back. Eventually I started Union Hmong Kitchen as a food truck, and now I’m working on Vinai, my first brick-and-mortar restaurant. It sounds really cheesy, like a Hallmark movie, but this is what I wanted all along.I ran so far from myself that I ran in a circle back to where I was.In 1983 my parents had a chance to leave the refugee camp. There wasn’t enough funding for the camp, and there were rumors of it closing. But my dad didn’t want to leave his army buddies behind. They finally did in 1988; at that point he had family so it was a different game.We came to the Twin Cities. If you know a little bit about Hmong history, you know it was really bad in the ‘80s and mid-’90s, especially in lower-income areas. There were a lot of Hmong gangs; some were on FBI watch lists. My uncles got involved, and it was really tough.My dad didn’t want to raise us like that, so we moved to Lancaster and lived with the Amish and the Mennonites. The worst thing we could do was hang out on a dairy farm. The real thug life, I tell people. Only now do I understand the depths of the sacrifices that my mom and dad made so I could have opportunities they could never dream of.The other day someone asked me if I could make my Hmong sausage vegan. I was on Instagram Live. A friend of mine hosts a little show and asked me to come on it and talk about Hmong food. A bunch of questions came through and one was from a young lady who said she loved Hmong sausage and asked if there was any way I could make it vegan. In that moment I realized I had two decisions. I could be like, “Yeah, we can totally do that!” Or I could say no because I have a reason behind that no.I have nothing against veganism, but what I learned in America is that the majority-white culture can be like, “Be yourself, but be yourself in a way that makes me feel comfortable.” That’s how I felt my whole life. In college I don’t think my friends meant it in a bad way, but they would tell me they didn’t see me as Hmong. But if I had acted traditionally Hmong, I wouldn’t have been there. They couldn’t see that I changed to meet them in the middle, and that’s why we were friends.The beauty of Hmong sausage is all about the technique. The ratio of pork belly to shoulder, the coarse grind. When you grill it you have to do it over low heat. The fat slowly melts and flavors the meat along with all the aromatics. They just sit together and what you get is this really rich, deep flavor. Then you eat it with sticky rice. It’s like an edible napkin.If you want to know Hmong food, you need to know our story. Our DNA is woven into the food we eat. But so often people don’t see that. When people look at us, especially Asians, they get a caricature. They don’t see our story. They don’t see our love and our loss. This is especially important given the recent anti-Asian rhetoric and violence. People need to know us not through their own preconceptions but through the food that’s close to our heart.Four-year-old Yia at Ban Vinai refugee camp. This photo was taken just before his family left for the States. \nPhoto courtesy Yia VangWhen I was a kid I thought my dad was such a dork and I didn’t want to be like him. Now I realize I’m just like him. I’m stubborn and hard-headed like he is. I’ll get into arguments that are so inconsequential because I want to be right. But I’m jovial and happy-go-lucky like him too. I listen to how my dad laughs, how he tells jokes, how he is sarcastic sometimes, and I’m like, “Holy crap, I get this from you.”He always puts people first, and I do the same. When tragedy hits family or friends, the first thing I do is ask, “How can I feed you?” I want to take care of the simplest things so they can focus on what they need to. With all this anti-AAPI stuff, we’ve gotten a few critics, if that’s what you want to call them, messaging or calling us at the food truck and telling us to stop being so loud. I told my team, “Here is my number and email. Forward all of that to me.” I feel very fatherly, in the sense that I want to jump in between this hate and our team. I’ll take it.If you want to know Hmong food, you need to know our story.And when it comes to food, my dad is becoming more like me. For him, cooking has always been about survival, but now he’s allowed to be creative. He lives in Hugo, just outside of St. Paul, and whenever I go home, he’ll be like, “Oh, I want to talk about how we grill.” At the same time I view him as a historical archive of different techniques and recipes, lost traditions, and myself as a recorder. Our restaurant gives him a platform.In the end I told the woman no during this Instagram Live. I said the reason why I won’t change the recipe for Hmong sausage is because this is what my dad showed me. This sausage is redemption for all those moments where I just didn’t understand what he was trying to do for me. I’m proud of it and of him. I’m not ashamed anymore. This shit is legacy.Explore Bon AppétitRestaurantsChefsFather's DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-14", "author": ["Condé Nast", "Yia Vang", "As Told To Elyse Inamine"]}