{"id": "9b8bcd10a079766a8fe18c3a0ee9d325", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/brus", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "BRUS Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenBRUSHydrate, sort of, with 33 constantly changing taps from this Nørrebro suds stopFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: to achieve beervana. At this stylish craft brewery and restaurant, you can drink more than 30 beers, tonics, and cocktails (the nonalcoholic ones are popular with nursing moms, of which there are plenty in the hood), with countless more bottles to explore.ORDER THE: beer that suits your mood. The taps change regularly! Attached, there’s a hyper-curated shop that’s open every day starting at noon, so grab a few bottles and some take-out food to bike back to your hotel.THE VIBE IS: industrial hipster, filled with craft beer bros in skinny jeans. In better weather the picnic tables fill up fast for weekend brunch.PRACTICAL STUFF: Open every day: Monday to Thursday from 3 p.m. to midnight; Friday and Saturday from noon to 3 a.m.; and Sunday from noon to midnight. Brewery tours and tastings happen the last Saturday of the month at 3 p.m.; reserve at brus@tapperietbrus.dk.—Christine MuhlkePhoto by Ditte IsagerPhoto by Ditte IsagerWE ALSO LOVEDuck and CoverA *Mad Men*-esque temple to mixology in Vesterbro.Himmeriget10 beer taps, lots of Fernet, and cocktails that’ll make everyone happy at this Frederiksberg barAncestraleIn Vesterbro, a cool little wine bar (and a relief to your wallet) Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}