{"id": "9b9ad9ab109e14c8bf976427411e409a", "url": "https://www.bonappetit.com/story/orange-wine-for-thanksgiving", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "The Ideal Thanksgiving Wine Is Versatile, Slightly Chilled, and Orange | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Ideal Thanksgiving Wine Is Versatile, Slightly Chilled, and OrangeFinding the perfect Thanksgiving pairing isn’t easy, but these bottles are up for the challenge.By Miguel de LeonOctober 23, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioFacebookTwitterEmailWelcome to The Pour, a monthly column about what we’re drinking right now.As the sommelier at Pinch Chinese in New York City, I get a lot of questions from friends and family about which wines to pair with Chinese food. But this time of year I field one specific crisis call: What should I drink on Thanksgiving?! Even among somms, Thanksgiving dinner is a notoriously difficult meal to pair because of all the sides. How do you find a wine that plays well with a green bean casserole, three types of stuffing (it’s a competition in my family), and creamy mashed potatoes?In the past I’ve leaned on tried-and-trues like Prosecco and Lambrusco, but this year I’m tying the meal together with a few bottles of orange. Also known as skin-contact wines, they’re made by fermenting white grapes with the skins on, like you’d normally do for a red wine. I recommend starting with a light-maceration option that’s spent only a few days fermenting with the skins—like steeping a bag of tea for an extra few minutes to extract more flavor and aroma. The result tastes like white wine with the volume turned up, but not as intense and barnyardy as some other orange varietals. And because of their floral aromatics, heightened acidity, and fruity flavor, these wines work well with just about anything on your table.So this Thanksgiving I’m pouring slightly chilled glasses of Domaine Glinavos’s Paleokerisio, with half the bubbles but twice the flavor of Prosecco; Oenops’s Rawditis, full of grilled lemon and apricot notes (perfect for Chardonnay-loving relatives); and Manolis Garalis’s Terra Ambera, which tastes like orange blossom and jasmine, a reminder of The Summer That Could Have Been. It’s a new tradition, like muting my uncle on Zoom, wishing I was in Santorini, and telling myself that there’s always next year.Buy them: Domaine Glinavos’s Paleokerisio, $15 at Leisir Wine Oenops’s Rawditis, $30 at Astor Wines & SpiritsManolis Garalis’s Terra Ambera, $22 at Astor Wines & SpiritsExplore Bon AppétitWineThanksgivingThe PourRead MoreLifestyleThe 5 Types of Wine to Bring to ThanksgivingBy Marissa A. RosscookingTuck Your Thanksgiving Leftovers into a Cozy Turkey Pot PieBy Alison RomanLifestyleThese Are My Favorite Healthyish Thanksgiving RecipesBy Amanda ShapirocultureYour Most Frequently Asked Thanksgiving Questions, AnsweredBy The Bon Appétit Test KitchenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-23", "author": ["Condé Nast", "Miguel De Leon"]}