{"id": "9ba94ac85603f80a7ff7f6fe256ca79f", "url": "https://www.bonappetit.com/story/crispy-chicken-thighs-harissa", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "These Crispy Chicken Thighs Are the Healthy Comfort Food You Deserve | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Crispy Chicken Thighs Are the Healthy Comfort Food You DeserveWinter sucks, but these harissa-spiced chicken thighs are amazing.By Aliza AbarbanelJanuary 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I am not a fan of winter. Lots of people don’t like the cold, but I really, really, really hate it. I blame growing up in Southern California—this did not prepare me for real winter, much less the frigid hellscape that is New York in January. When the air hurts your face, there’s only one way to cope: comfort food.To me, good winter comfort food is warm and filling. It has to taste at least a little indulgent, but it also has to feel good for the body, too. Yes, deep dish pizza is appealingly warm and gooey, but ending dinner in a cheese coma definitely won’t help fight the flu. Luckily, these crispy chicken thighs check all those boxes and are straight up delicious.Start by arranging a rack in the top-third of your oven. Don’t be like that guy on The Great British Bake Off—preheat your oven now, too. Seasoning with some good old salt and pepper, place your chicken thighs in a cold cast iron skillet skin-side down. Wedge tiny potatoes around the chicken like they’re cuddling. Aw. So cute!Now, heat the skillet over medium, occasionally shifting the potatoes but leaving the chicken in place so the skin gets nice and crispy. If you get antsy to flip before 14-16 minutes, grab a drink and chill out. Trust me, it’ll be worth it. When the chicken skin is brown and properly crispy and your kitchen smells like heaven, move the potatoes and chicken to a plate. You want to chicken to be skin side up now, so take a breath and flip them. Beautiful, right? Bet you're glad you were patient now!You should be left with a skillet full of chicken fat, so add in a good dollop of harissa. This recipe calls for mild harissa, but if you handle heat well and really want to combat the cold, go for spicy. You’ll be left with a super-fragrant pan of harissa schmaltz, aka liquid gold. Save it in a small bowl; it’ll come in handy later.Next, add a tablespoon more oil to that handy skillet, then add the leeks, garlic, and three-quarters of the finely sliced fennel. Throw on a lid and stir occasionally to soften everything up, then add the chicken (skin side up, remember?) and potatoes back to the skillet party. Put that whole thing in the oven to bake that chicken until cooked through.While everything is finishing in the oven, toss the leftover fennel with lemon juice and oil. Go ahead and add some lemon juice to the harissa schmaltz and stir it together to make the world’s greatest harissa dressing.By now the chicken is done baking, so carefully remove the hot skillet. (This is the point in the recipe where I burned my hand and had my cooking partner take over plating. I gave directions from the kitchen table while clutching a very cold beer—my makeshift icepack of choice.)Congratulations! All the cooking is done, and you just need to assemble. After all that work you did, it might as well look pretty. So: Put the crispy chicken and potatoes on a platter, being sure to scrape up some of the caramelized-leek-fennel mixture. (Full disclosure, you may head over to the stove to pack up the leftovers for lunch, blink, and find yourself eating the caramelized bits with a spoon. This happened to me, and I’m not ashamed to admit it). Top your plate with the raw fennel salad for some nice textural contrast and, if you didn’t accidentally throw them out already, throw on a couple fennel fronds for decorative flair. Drizzle a healthy pour of that harissa dressing on top, and we’re in business. Now that’s what I call comfort food.Get the recipe:One-Skillet Crispy Chicken Thighs with HarissaStarting the chicken skin side down in a cold skillet lets the fat render slowly and results in the crispiest skin imaginable. It also yields a pan of flavorful schmaltz, aka liquid gold.View RecipeExplore Bon AppétitHealthyishRead MoreshoppingCondiments Come and Go, But NY Shuk Harissa is ForeverBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-03", "author": ["Condé Nast", "Aliza Abarbanel"]}