{"id": "9bbe25cb9ca65fdd36e8e9fdb3268cae", "url": "https://www.bonappetit.com/recipe/little-red-fox-queso-with-tillamook", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Little Red Fox Queso with Tillamook Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDLittle Red Fox Queso with TillamookSponsored by TillamookFacebookPinterestTwitterEmailServes 6–8The cheese stands alone, but not for long. Chef Bobby of Little Red Fox uses Tillamook Sharp Cheddar for a queso that complements every dippable snack in sight.PrintIngredients½ lb. tomatillos, husks removed and rinsed (or 4 oz. jarred)1 Fresno chili (optional)½ cup white wine2 cups heavy cream1 ½ Tbsp. ground cumin½ Tbsp. garlic powder1 ¼ lbs Tillamook Sharp Cheddar, grated2 Tbsp. cornstarchRecipe PreparationHeat a medium cast iron skillet over moderate heat. Add tomatillos and chili (if using) and cook, turning until blackened in spots. Transfer to a cutting board, cool then roughly chop the tomatillos. Discard the seeds from the chili and finely chop. (You will probably only want to use half the chili.)Bring white wine to a boil in a medium saucepan over moderate heat. Whisk in ½ cup of the heavy cream, 1 tablespoon of the cumin, and the garlic powder. When the cream starts to simmer, whisk in 1 cup of grated Tillamook Sharp Chedder and the cornstarch until smooth and emulsified, whisking constantly, add in another ½ cup of heavy cream. Allow the sauce to thicken, then alternate with remaining additions of cheese and cream.After all the cream has been added, turn off heat. Add the remaining cumin, the chopped tomatillos, and chili to taste, mixing to marble the red and green colors throughout.Dig in! The sauce is best served warm: ladle it over pasta like macaroni or on top of chips, as a dip with vegetables, or as a condiment on your favorite sandwich.Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}