{"id": "9bc22748a49126039cea2b639dad0d32", "url": "https://www.bonappetit.com/recipe/hibiscus-cranberry-sauce", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Hibiscus Cranberry Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueHibiscus Cranberry SauceBy Tiffany-Anne ParkesOctober 20, 20204.5(16)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Sue Li, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintHibiscus is used in drinks throughout the African diaspora but most notably in Jamaica. Inspired by sorrel—a festive Caribbean punch—this sauce is sweet, tangy, earthy, and the perfect complement to the peppery profile of Jamaican jerk. Rum, allspice, and fresh ginger add a level of warmth and richness of flavor that is the signature of Caribbean cuisine. Serve with Jerk Turkey Sheperd’s Pie. IngredientsMakes 2½ cups4Tbsp. unsalted butter12\" piece ginger, peeled, halved3whole allspice11-lb. bag fresh or frozen cranberries1⅓cups (packed) light muscovado sugar or light brown sugar1Tbsp. plus 1½ tsp. hibiscus powderPinch of kosher salt2Tbsp. Jamaican rum, dividedPreparationStep 1Melt butter in a medium saucepan over medium-low heat. Add ginger and allspice and cook, stirring occasionally, until butter foams, then browns, 5–8 minutes. Mix in cranberries, muscovado sugar, and ½ cup water. Cover and cook, stirring occasionally, until cranberries burst, 10–12 minutes.Step 2Uncover cranberries; stir in hibiscus powder, salt, and 1 Tbsp. rum. Reduce heat to low; cook, stirring occasionally, until glossy and syrupy, 16–20 minutes. (Stir in about ¼ cup water if you like a thinner sauce.) Remove from heat and stir in remaining 1 Tbsp. rum. Let cool slightly.How would you rate Hibiscus Cranberry Sauce?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThe flavors here are excellent and will probably get an encore for Christmas, but the recipe is pretty off with regard to time and temperature.  Medium-low heat isn't going to make your butter foam and brown in 5-8 minutes, if it does so at all.  It sure as hell isn't going to burst cranberries in 10 minutes either.  You'll need to up the heat a fair bit if you don't want to spend all day fussing over a cranberry sauce.\n\nAlso, the recipe doesn't say anything about removing the whole allspice berries.  I hope that's an oversight, since leaving hard spices in a food with this color and consistency is a great way to hurt someone's tooth.DanCalifornia11/29/2020Best ever.. of course I can't leave anything alone so used less sugar, I had hibiscus dried pieces (I rehydrated with tiny bit of vermouth) which work better, less homogeneous sudden tart explosions which complement cranberries very well.  Also added thin slices of fresh horseradish (1cm x 2cm x 1mm).  couple drops of wasabi oil ... fantastic! Oh yeah, could't find any allspice so put in toasted fennel seedsniconelkoHonolulu11/28/2020Delicious and straightforward. I had some dried hibiscus, so I steeped it in a 1/4 cup of hot water and added that in and cooked the whole thing down until it was the consistency I wanted. I didnt have muscavado, so I did half and half dark brown sugar and white granulated sugar. The Plantation 5 year rum I used adds just a little something to make it interesting. The additional flavors from the hibiscus and rum are pretty subtle and overall this is not a recipe that should shock anyone unless they've only ever had cranberry sauce from a can. Anonymous11/25/2020This is definitely a winner and likely to go into my annual rotation. I made a half recipe for a smaller gathering, and it worked great. The butter and spices and rum flavors blended really well with the cranberry and hibiscus tang.  I discovered I had used up all my dried hibiscus, so I had to substitute ground herbal tea (Red Bone blend by Ivys Tea - hibiscus, cranberry, lemon, cayenne) that brought a bit of extra flavor for a satisfying sauce.AnonymousSacramento, CA11/23/2020Terrible. I have been a subscriber for 20+ years and this was one of the worst. I love cranberry sauce and while it sounded intriguing and I bought the hibiscus powder and muscavado sugar but I took one taste and threw it out.  MariangelaSan Francisco, CA11/22/2020Delicious! Easy to make and unique with the addition of hibiscus powder. RcmartoneHouston, Tx 11/21/2020Explore Bon AppétitSauceCranberryBerryFruitHibiscusHerbs & SpicesEasyQuickSideGluten-FreeNut-FreeVegetarianSimmerThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Tiffany-Anne Parkes"]}