{"id": "9bd10d76912add6f2865ebf4be061894", "url": "https://www.bonappetit.com/recipe/triple-threat-onion-galette", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Triple-Threat Onion Galette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTriple-Threat Onion GaletteBy Sohla El-WayllyApril 5, 20204.8(89)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan SpungenEmailPinterestPrintEmailPinterestPrintPies aren't just for dessert. The ninth recipe in the Basically Guide to Better Baking is a free-form tart that combines three alliums (scallions, garlic, and onion) for maximum flavor and crispy-jammy texture. And we'd happily eat it for breakfast, lunch, or dinner. The key to the flaky crust is to move fast! Rolling and folding the dough while the butter is still cold creates distinct layers of butter and flour that will steam apart during baking, making the crust light and flaky. Got questions? Head to our forum and we'll try to help.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWhisk$10 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketScaleMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonSpatula$12.99 At AmazonRolling Pin$13 At AmazonPastry Brush$9 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMedium Skillet$60 At AmazonPlate$55 At Bon Appétit MarketMicroplane$16 At AmazonCutting Board$10 At IKEAOffset Spatula$12 At AmazonIngredientsMakes one 12\"-diameter galette1½cups (188 g) all-purpose flour, plus more for dusting1Tbsp. sugar3tsp. Diamond Crystal or 1¾ tsp. Morton kosher salt16Tbsp. (2 sticks) chilled unsalted butter, divided1large onion8garlic cloves2oz. Parmesan12scallions2Tbsp. Dijon mustardFreshly ground black pepperPreparationStep 1First, make the crust. Whisk 1½ cups (188 g) all-purpose flour, 1 Tbsp. sugar, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a medium bowl to combine. Cut 12 Tbsp. (1½ sticks) chilled unsalted butter into ½” pieces, add to dry ingredients, and toss to coat and distribute. Using your hands and working quickly, rub and smash butter into flat irregular pieces (be careful not to overwork; you don’t want to soften the butter too much. Just make sure you smash each piece at least once. And if the butter is getting too warm, throw the bowl in the fridge or freezer and let chill for a bit before proceeding).Step 2Drizzle ⅓ cup cold water over and mix with a rubber spatula, smashing in butter, until dough mostly comes together—it will be dry and shaggy.Step 3Now you are going to fold the dough, which will give it distinct flaky layers when baked. Turn out onto a lightly floured surface. Working quickly and using a rolling pin and your hands, press dough together to form a mass. (The dough will seem like a crumbly dry mess at first but will come together as you fold and roll. Have faith and don’t give up.) Roll dough into a rough square about ½” thick. Fold in half into a rectangle, then once again to make a small square. Press down on the dough with rolling pin to make it hold together. Roll dough out once more to make a rough square about ½” thick. Repeat folding process again, taking your time to make it neat, as this will be your final fold.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Using rolling pin, gently flatten dough, rotating as needed, to make a 6”-diameter disk. Dust surface with more flour (go heavy; you don’t want the dough to stick) and roll disk into a 14”-diameter circle or oval about ⅛” thick. Brush off any excess flour with a pastry brush. Fold dough in half, then in half again to make a rough triangle (this just makes it easier to move). Transfer to a parchment-lined baking sheet and unfold (it’s okay if dough is a bit larger than the baking sheet). Chill while you make the filling.Step 5Place a rack in middle of oven; preheat to 375°. Peel and thinly slice 1 large onion, then 8 garlic cloves.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Heat 3 Tbsp. unsalted butter in a medium skillet over medium until foaming, about 1 minute. Reduce heat to medium-low; add onion, garlic, and 1 tsp. Diamond Crystal or ½ tsp. Morton salt, and stir to combine. Cover and cook, stirring occasionally, until onion is tender and just beginning to brown, 6–8 minutes. Uncover and continue to cook, stirring occasionally and adding a splash of water if onion begins to stick, until golden brown in spots, about 5 minutes more. Transfer onion mixture to a plate; reserve skillet.Step 7While the onion mixture is cooking, finely grate 2 oz. Parmesan (you should have about 2 cups). Trim 12 scallions, then thinly slice on a steep diagonal. This will yield striking oblique disks, but if you’re nervous about your knife skills, simply slice crosswise.Step 8Melt remaining 1 Tbsp. unsalted butter in reserved skillet (no need to wipe it out) over medium heat. Remove from heat and add scallions and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt. Toss scallions until coated in butter.Step 9Now you are ready to assemble your galette! Remove dough from refrigerator and, using a small offset spatula or spoon, spread 2 Tbsp. Dijon mustard in a thin layer over dough, leaving a 1½”–2” border around the edges. Scatter onion mixture over mustard and sprinkle with cheese; season with freshly ground black pepper.Step 10Cutting from edge of dough to the start of the mustard and filling, make slits in border of galette at 2”–3” intervals (the slits are optional but make for a more beautiful presentation). Fold flaps up and over filling, slightly overlapping. Scatter scallions over.Step 11Bake galette until crust is deep golden brown and scallions are lightly charred, 45–50 minutes. (Your crust isn’t properly baked until it’s the color of a well-worn penny. If your timer dings but the dough is pale, keep going.) Using parchment paper, slide galette onto a cutting board and cut into wedges.Step 12Do ahead: Dough can be made 3 days ahead; wrap 6”-diameter disk tightly and chill until ready to roll out. Onion mixture can be cooked 3 days ahead; transfer to an airtight container, then cover and chill. Galette can be assembled 1 hour ahead; chill.How would you rate Triple-Threat Onion Galette?Leave a ReviewTell us what you thinkReviews (60)Back to TopTriangleI was doing fine until I read \"16 Tbsp. (2 sticks) chilled unsalted butter\".  That equates to 226 grams of butter for those of us using a scale.abgogalCanada10/30/2021Hi,\nI hate mustard of any kind. Anyone think of a substitute? \nThanks.\nJBBJacquelineVTVermont 10/27/2021I used Maille Dijon mustard (best Dijon I’ve ever tasted!), parmigiana Reggiano, all butter Dufour puff pastry, combo shallots/yellow sweet onions with leek/scallion combo .....and the most wonderful & astonishing flavors! \n\nLove this inspiring recipe! SandraRochester, MN5/14/2021delicious recipe! baking time is definitely on the longer end, from start to finish this took me about 3h incl bake time. i'd recommend getting the onions going in the pan while making the dough if you're not making elements ahead of time. i added the scallions on part way through baking like another reviewer and they were cooked perfectly. annaliseLos Angeles, CA5/13/2021A bit of a project but soo soo good. The most flaky, shattery crust I’ve ever made. MJDallas, TX3/7/2021Unbelievable. So delicious. The parts of the onion that get trapped between the folds of the crust are like the most delicious hot pocket you'll ever eat. It is quiiite salty so be sparing. Paulina12/13/2020I've only baked twice before, but this looked delicious so I gave this a shot and wasn't disappointed. One of the best thing's I've tasted. Thank you Sohla! \n\nA few tips:\n- listen to the other reviews and cut down on the salt! I'd add HALF the salt the recipe recommends. \n- the dough folding and rolling (Steps 2&3) didn't go right for me given that I'm an amateur, but the end product tasted absolutely great anyway. \n- make this with plenty of time on hand if you're a beginner. My dough was getting too soft and the butter too melty and my dough needed to chill before rolling but I didn't have the time for it. Hence, messy folding. AnonymousBangalore, India. 11/25/2020omggg this is absolutely incredible, thank you sohla!!!Anonymous11/3/2020I've made this repeatedly with different combinations of onion, leeks, garlic, scallions, and shallots. You can't go wrong. The mustard really takes it up a notch.AnonymousLos Angeles10/12/2020Delicious and savory, plus holds up well as leftovers served cold or room temp. The tang from the dijon mustard helps balance the richness from all the butter and parmesan, and the crust is beautifully flaky--definitely follow the visual cues in the recipe to get it nice and brown, regardless of how long it ends up taking.Sarai Itagaki9/19/2020I have made this a few times during quarantine with different additions/toppings. A couple of tips that helped add more savoriness: \n1. Like other bakers, the salt amount is too much, definitely scale down/use sparingly. I only used celery salt on the onions while they were cooking and kosher in the dough.\n2. Add almond flour for a crunchier texture, my ratio was 1 C all purpose 1/2 C almond (rye also works). I also doubled the amount of folds with breaks in the freezer to really give it the extra flakiness. \n3. Use different cheeses, comte, mozzarella, I've used it all.\n4. Add the scallions with 10 mins left on the bake so they don't burn.\n5. Balsamic glaze goes so well on top!Anonymous9/4/2020So, I got store-bought puff pastry because it's really good here in Europe and making puff pastry from scratch is a lot of work. I also used 8 green onions (and it was still a lot, 12 seems like overkill). Next time I would also not use as much butter, maybe 2 tbsp for the onions/garlic instead of 3. My stove is electric so it took sooo long to do the onions, I would maybe just leave it on medium heat instead of medium-low. All in all it turned out super great and I look forward to making it again with my little tweaks.AnonymousBerlin8/28/2020This recipe is not short on effort but holy cow is it worth it. The melty onions and garlic with the Dijon and Parmesan then topped with green onions makes magic. I had never made a pastry dough before but it came together easily (having a bench scraper is super helpful to keep warm hands out of the mix). I served it as an appetizer to company and it was devoured. Definitely for the more experienced in the kitchen but such a success. LP_908/9/2020This recipe is phenomenal. If you are a allium fan, this is for you sis. The dough is gorgeously flakey and tender, and it is my new go-to dough recipe for all things baking. I think using this dough as a pie crust could be legendary. The galette is super flavorful and was a big hit in my house. I am making it again today.racheljhCalifornia7/17/2020I've made this several times and it came out really well. Two sticks of butter is a lot for one recipe and it comes out very rich, but this still tastes great. I folded the dough twice the amount of times recommended to get that puff pastry type of crust. If using regular salt, make sure to use less than recommended, as Kosher salt is much less salty. Overall this is a great recipe with a great umami taste, and vegetarian!nav02CHICAGO, IL6/5/2020Explore Bon AppétitGaletteDessertScallionOnionVegetableGarlicVegetarianBakingBreakfastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-05", "author": ["Condé Nast", "Sohla El-Waylly"]}