{"id": "9bd62395c1b1e9a8d635d4492686323e", "url": "https://www.bonappetit.com/recipe/zaatar-fish-and-chips", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Za’atar Fish and Chips Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueZa’atar Fish and ChipsBy Chris MoroccoDecember 26, 20194.3(42)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintOlives and superfast pickled onions balance out creamy-crispy potatoes and roast cod. This recipe is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings1small red onion, finely chopped4Tbsp. apple cider vinegar, dividedKosher salt1½lb. small Yukon Gold potatoes, halved or quartered lengthwise6Tbsp. extra-virgin olive oil, divided11¼-lb. skinless, boneless cod fillet, preferably in 1 piece1Tbsp. za’atar¾cup pitted Castelvetrano olives½cup coarsely chopped mintIngredient InfoZa’atar, a blend of sumac, dried herbs, and sesame seeds, can be found at Middle Eastern markets, specialty foods stores, and online.PreparationStep 1Place racks in upper and lower thirds of oven; preheat oven to 425°. Mix onion, 2 Tbsp. vinegar, and a big pinch of salt in a small bowl to combine; let sit at least 10 minutes and up to 1 hour. Drain off vinegar and discard.Step 2Meanwhile, toss potatoes and 3 Tbsp. oil on a large rimmed baking sheet; season with salt, then toss again. Arrange in a single layer. Roast on top rack, undisturbed, until browned and crisp underneath, 20–25 minutes. Turn potatoes over and reduce oven temperature to 325°. Place cod on a small rimmed baking sheet and drizzle with 1 Tbsp. oil. Season with salt and sprinkle with za’atar. Slide onto bottom rack in oven and roast until fish flakes easily with a fork and potatoes are browned all over, about 10 minutes.Step 3Stir olives, mint, remaining 2 Tbsp. vinegar, and remaining 2 Tbsp. oil into pickled onion. Serve cod and potatoes topped with olive mixture.How would you rate Za’atar Fish and Chips?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleBACHELOR (PARTY OF ONE)\n\nCHRISTCHURCH NEW ZEALAND\n Try Red Snapper...Cheers RESNY2/21/2021Greetings,\nJust curious why BA did not provide a recipe for the Za'atar?\nCheersRESNY2/21/2021Definitely needed more za'atar...I'd almost double it and add some red pepper flakes. I took heed of advice from some commenters below. 1. Don't lower the temp half way through. 2. Cook the fish for 14 minutes. 3. Add Pomegranate seeds to your tapenade! 4. I personally added paprika to the fries, so so so good!. Overall the fish somehow lacked flavor without adding much more than suggested seasoning but the fries...wowza. A must make.HalleSeattle, Washington2/19/2021The olive mix really makes this whole dish. Like others I had to cook the fish a bit longer and found it's flavor to be pretty bland. This may have something to do with the quality of my zataar. Next time I think I will add extra sumac and marinate the fish for 30 minutes ahead of baking. The suggestion below of adding golden raisins to the tapenade sounds delish as well! All in all, it was a very simple, quick, and tasty recipe.FawnSanta Fe, NM2/2/2021Great tasting dinner tonight. Have recommended this to my daughter. DGBFort Myers, FL1/23/2021Agree with not throwing out the vinegar just to re-add it.\n\nI added a good amount of pomegranate seeds to the olive mixture and it really brightened up the whole dish.  My girlfriend thought that was her favorite part.AnonymousUSA1/5/2021Why throw out the 2 Tbsp of vinegar used to marinate the onions, only to add 2 Tbsp back in? Does the vinegar get too onion-y?cheflo2Seattle6/12/2020What a great healthy way to eat fish and chips! As one other reviewer mentioned, it did take longer to cook, especially the fish. The recipe calls for one piece, but I think that it would cook more consistently with smaller loins. Dublin OH5/28/2020I followed the recipe exactly as written and I must say...WOW! If you are a fan of Middle-Eastern flavors, then this will surely please you. The za'atar gave a wonderful flavor to the fish, but eating a bite along with a bit of the creamy potato and the cool minty olive mixture together was a flavor explosion! I served the fish on top of a bed of raw baby spinach, which went really well with the dish. The heat of the fish wilted the spinach ever so slightly, which was perfect. Paired with a 2013 Ferrari-Carano Fumé Blanc, the meal was truly restaurant quality. I look forward to making this again!AnonymousThe Quiet Corner of CT4/27/2020Used sweet potatoes instead of Yukon gold. Other than that sub, went by the fecipe.  Will keep working on this recipe with various fish.(salmon comes to mind).\nWill add thinly sliced zucchin, cauliflower and/or broccoli florets to the quick pickled onions next time. Just to see.\n\nBachelor (party of one)Christchurch New Zealand3/5/2020I've made this several times now. The cook times listed seem to be a bit short for both the potatoes and the fish. I've been chucking cauliflower trees in with the potatoes which is delicious. The onion-olive topping is by far the highlight of this recipe. Annie CVirginia3/4/2020wasn’t a fan of the fish with that seasoning! the potatoes were yummy but nothing transcendent.nyc3/1/2020Made this past weekend and loved it!! I sliced the potatoes thinner to cook them faster. Absolutely loved the bright fresh flavors of the olives and mint. Definitely will be adding to my repertoire HannahWhite2020Atlanta2/26/2020Don't skip the olive-onion-mint topping! It's fantastic with the cod, and brightens up this dish immensely for the amount of effort it takes. I really love these kinds of recipes - simple short ingredients list, and a method you can get the jist of with a skim. Honestly can't fault this it's such a ridiculously easy and yummy dinner.WillowkatIreland1/15/2020Delicious! Loved the way the potatoes “souffléd” and the cod was perfectly cooked with the recipe method. Not sure if you’d call the olive/onion mixture a tapenade or a salsa, but a great complement to the potatoes and cod. Canada1/15/2020Explore Bon AppétitCodFishSeafoodPotatoVegetableOliveOther IngredientsZa'atarHerbs & SpicesYukon Gold PotatoWeeknight MealsMainDairy-FreeGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Chris Morocco"]}