{"id": "9be96fa0f5788e8fcf1cd81a9a2de29f", "url": "https://www.bonappetit.com/story/what-is-shelf-stable-milk", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "What is Shelf Stable Milk and How Do You Use It? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingShelf-Stable Milk Is the Answer to Those Infrequent Grocery TripsAn unopened box of milk can last on your shelf for months—but what's the deal?By Jesse SparksMay 4, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailSo, you’re scrambling through the aisles of your local supermarket. You’re dashing through the produce, hurdling over mid-tantrum toddlers, and dodging weird dudes standing in the middle of those already-tight aisles when you see them. Rows and rows of boxes claiming to be… milk? You do a quick double take, check the aisle, and confirm that you’re not in the refrigerated section. So what’s the deal with that boxed milk and why the heck isn’t it chilling out with the other stuff? Let’s get into it.What Is Shelf-Stable Milk?It might sound a little fifth-grade-science-project-y, but shelf-stable milk is just milk that has been pasteurized and packaged a liiittle differently than refrigerated milk in order to extend its shelf life. Shelf-stable, or aseptic, milks are common in other parts of the world but didn’t really start catching on stateside until the 90s, primarily because Americans tend to equate refrigeration with freshness.But there are plenty of reasons to get behind it. Many have noted that because of its durability, shelf-stable milk might be a more environmentally sustainable option. Not only can shelf-stable milk be transported without refrigeration (which, in turn, lowers costs for producers and consumers alike), but it also doesn’t rely as heavily on plastic packaging (the boxes are cardboard and aluminum-based, bound with polyethylene plastic). And, since the product won’t go bad as quickly, less is wasted: Whereas typical unopened dairy milk expires within a matter of weeks under refrigeration, the unopened shelf stable stuff lasts up to 6 months at room temp. Once you’ve opened the aseptic milk, however, treat it like normal milk—refrigerate it and try to use it up within one to two weeks.Non-dairy milks are also ultra-pasteurized and siphoned into aseptic packaging.\nTo make the milk in the refrigerated section of the store, dairy producers heat raw milk to around 160° F for about 15 seconds to kill any bacteria, then rapidly cool it before it can curdle. When you see refrigerated milk with the word “pasteurized” on the label, all it means is that the milk has gone through this bacteria-killing process, commonly referred to as high-temperature short-time (HTST) pasteurization.But there’s another way to pasteurize milk to ensure it can hang around much longer than its colder counterpart. Instead of stopping at the 160° mark, this alternate process requires heating raw milk to between 270–280° F for about two seconds before it’s quickly chilled. This hot and fast approach kills nearly all bacteria in milk and is referred to as UHT (ultra high temperature, or aseptic) pasteurization. It’s this one-two punch of bacteria-killing UHT pasteurization and aseptic packaging that makes shelf stable milk so long-lasting. (UHT is used commonly applied to organic refrigerated milk; since that milk is not specially packaged, however, it doesn’t have the same longevity. As for non-dairy milks, most are pasteurized and processed in the same way, meaning that shelf-stable products will last longer than refrigerated ones.)How Do I Use It?That depends on the product. Many shelf-stable milks instruct you to use them as you would “regular” milk, meaning you’re encouraged to pour it right into your morning cup of coffee or add a splash into your wet ingredients while baking. But that doesn’t mean they’re the same.Because shelf-stable milks have been heated to a higher temperature, they’ve lost some of the good bacteria and protein found in refrigerated milk. To compensate, many vendors will add vitamins (like vitamin D or A) or stabilizers. Aseptic milks also can occasionally take on a slightly sweeter, cooked taste and a slightly thicker texture as the amino acids break down and sugars in the milk caramelize. Be careful when using it in recipes that require that the dairy be cooked for additional time, like milk-braised pork or seafood chowder. While shelf-stable milk won’t outright ruin a dish, some people might notice differences in the flavor, which could come across as a subtle hint caramelization or burning. When working with shelf-stable milk, it’s best to keep this reaction in mind, read the label, and of course, correct by tasting as you go.So, What’s the Stuff in the Cans?UHT milk isn’t the same as evaporated or sweetened condensed milk. Where UHT milk can be exchanged  one-to-one with standard pasteurized milk, evaporated milk cannot be. It requires the addition of water to get the right amount of moisture. To create evaporated milk, producers simmer pasteurized milk until it’s reduced. This consistent heat lightly cooks the milk and draws out the moisture, creating a thicker creamier texture. Sweetened condensed milk follows the same reduction process, but adds a significant amount of sugar to the milk for a sweeter, more viscous final result.When Do I Use What?There’s a lot of milk out there, so it can be a little tricky to keep track of what to use when. Follow these general tips:If you’re looking for a simple sub for refrigerated milk, shelf-stable milk is the best choice. It’s easy and doesn’t require any dilution for drinking or any mental gymnastics for use in recipes.When subbing milk, keep fat content in mind. If a recipe calls for whole milk, two-percent will get you different results, whether it’s from a plastic jug or a box.Milk from the box tastes best when it's cold—chill it before using.Evaporated milks offers richness without excess moisture, like in  baked mac and cheese or cheese sauce. Use it to achieve creaminess while maintaining the consistency of your product.If you’re looking for richness and a spike in sweetness, go for sweetened condensed milk. It’s thick (thiccc) and caramel-y. Blend it into a frozen margarita pie, swirl it into this no-churn Thai tea ice cream, or simply add it to your next iced coffee.Evaporated milk gives this garlicky white sauce its richness.\nPeden + MunkWait, So What’s Milk Powder?Essentially, milk powder is just milk that has been dehydrated to the point where only the milk solids remain. These milk solids are then powdered and packaged. With the addition of water, the milk powder rehydrates into normal milk that you can use just as you would the standard stuff. Use it straight from the container in instances where you’re looking to add a rich, creamy flavor to a recipe without throwing off the ratio of wet to dry ingredients. Sneak it into baked goods, like milk bread, for increased tenderness.When you’re not sure about the next time you’ll be able to return to the grocery store, you can stock up on aseptic or canned milks, which will last in your pantry. While every product has its strengths and weaknesses, they’ll keep you stocked and satisfied until your next ingredient run.Now that you’ve got the basics done, put it to work:My Mom's 10-Minute Chai Requires a Kettle, a Tea Bag, and Just One SpiceIt's the best part of quarantining with my parents.View StoryExplore Bon AppétitBasicallyMilkDairyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-04", "author": ["Condé Nast", "Jesse Sparks"]}