{"id": "9bf15b4942eea66096a10acf37145aaf", "url": "https://www.bonappetit.com/recipe/classic-cookout-potato-salad", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Potato Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueClassic Cookout Potato SaladBy Ben BynumJune 2, 20204.7(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Mamadi Doumbouya, food styling by Pearl Jones, prop styling by Shannon MaldonadoEmailPinterestPrintEmailPinterestPrintBen Bynum, co-owner of Philadelphia restaurants Warmdaddy’s, Relish, South Jazz Kitchen, and Green Soul, gives potato salad a sweet-meets-zingy upgrade with red onion, bell peppers, and sweet relish. Oh, and don’t forget the double mustards: classic yellow for color and dijon for flavor.Ingredients8–12 servings10medium Yukon Gold potatoes (about 3 lb.)1cup plus 2 Tbsp. Diamond Crystal or ½ cup plus 2 Tbsp. Morton   kosher salt4large eggs1cup mayonnaise¼cup sweet relish3Tbsp. yellow mustard2Tbsp. Dijon mustard1medium red bell pepper, ribs and seeds removed, cut into ¼\" pieces½medium red onion, cut into ¼\" pieces2celery stalks, sliced ¼\" thickBarbecue Seasoning or paprika (for serving)PreparationStep 1Bring potatoes, 1 cup Diamond Crystal  or ½ cup plus 1 Tbsp. Morton kosher salt, and 3 quarts water to a simmer in  a medium pot over medium heat; cook until tender, 18–22 minutes.Step 2Meanwhile, using a slotted spoon, carefully lower eggs into a large saucepan of boiling water and cook, adjusting heat as needed to maintain a gentle boil, 10 minutes. Transfer eggs  to a bowl of ice water and let cool until just slightly warm, about 2 minutes.Step 3Remove eggs from ice water. Gently crack all over and peel; discard shells. Cut eggs in half lengthwise and scoop out yolks into a medium bowl. Coarsely chop egg whites; set aside. Mash yolks with a fork until smooth. Add mayonnaise, relish, both mustards, and remaining 2 Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt; mix well. Fold bell pepper, red onion, and celery into dressing.Step 4Drain potatoes; let cool 5 minutes. Peel with a paring knife; cut into ½\" pieces. Add to dressing and gently toss; fold in reserved egg whites. Cover and chill at least 1 hour and up to 3 days.Step 5Sprinkle with seasoning before serving.How would you rate Classic Cookout Potato Salad?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleLoved this as a baseline for a potato salad. Subbed minced spicy fridge pickles for the relish, used spicy brown mustard instead of the 2 mustards suggested, and relied on kohlrabi instead celery for the crunch. Really satisfied the classic potato salad craving I had, and didn't take a lot of time or effort. MadisonHolland, MI9/19/2021Didn't have high hopes for this recipe, not being a big fan of potato salad OR mustard, but was really craving something to take me back to my childhood summers.  So glad BA published this one because it was delicious!  The flavors were completely balanced and like everything wonderful about potato salad I remember as a child, only BETTER.  \n\nSwitching from russets to yukon gold potatoes made this salad so divine and luscious.  Subbed minced cornichon for the relish and it worked for me.  And it's so great to have a little leftover jar of the BBQ seasoning (tastes like BBQ chips) to sprinkle over roast veggies or deviled eggs. Yum! Going in my favorites file for sure.AnonymousLos Angeles, CA7/22/2020I have a sort of aversion to relish, so I left that out.  Potato salads for me are usually really good or really bad and I think this is the best one I have ever had!AnonymousRocky River, Ohio6/25/2020This is the potato salad of my youth and it's fantastic. We will be making this all summer. We didn't have celery and that crunch will be a great addition the next time we make it. AnonymousDenver, CO6/14/2020Two mustards are better than one. This is quintessential potato salad and I want to eat it for breakfast, lunch, and dinner. (I subbed white onions, but red would be better.) Will be making this recipe all summer. alexbeggsBon Appétit 6/7/2020This was really good! So full of flavour, well seasoned and great crunch from the veggies! I could only wait an hour before eating it, I suspect it will be amazing when I eat it tomorrow. FYI I did half this recipe and there was no issues,I just added a few tablespoons of mayo before serving so it was extra creamy . The only substitution I made was I had no relish and i'm trying to limit grocery store visits so I used pickles diced up and a few tablespoons of sugar, worked well and great crunch from the pickles. sarahroessnerHamilton, Ontario, Canada 6/7/2020Explore Bon AppétitSaladPotato SaladAmericanPotatoVegetableYukon Gold PotatoSummerEasySideNut-FreeVegetarianGluten-FreeDairy-FreeSimmerJuneteenthFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Ben Bynum"]}