{"id": "9bf3b3e67b261ee09c7fb43fd04813bf", "url": "https://www.bonappetit.com/recipe/glazed-leeks-with-pine-nut-salsa-verde", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Glazed Leeks With Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueGlazed Leeks With Pine Nut Salsa VerdeBy Andy BaraghaniOctober 15, 20193.8(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese humble leeks transform into the in-demand side that no one saw coming: They’re cooked until tender, doused in a chile-honey-vinegar sauce, and finished with a nutty, herby salsa verde. It’s ideal to serve the leeks warm, but they can also be made a few hours ahead and served at room temperature.Ingredients8 servingsKosher salt¼cup pine nuts6large leeks (about 2½ lb. total), dark green parts removed2red chiles (such as Holland or Fresno), halved lengthwise22\" strips orange peel¼cup honey¾cup plus 1 Tbsp. sherry vinegar or red wine vinegar½cup finely chopped parsley⅓cup extra-virgin olive oil2Tbsp. chopped drained capersFreshly ground black pepperPreparationStep 1Preheat oven to 350º and bring a large pot of salted water to a boil. Toast pine nuts on a rimmed baking sheet, tossing halfway through, until golden brown, 5–7 minutes. Let cool. Leave oven on.Step 2Trim root end of leeks (leave as intact as possible so they don’t break apart while cooking) and cook in boiling water until meltingly tender (a paring knife should go all the way through with no resistance), 15–20 minutes. Transfer to paper towels to drain; let cool.Step 3While leeks are cooking, cook chiles, orange peel, honey, ¾ cup vinegar, and a pinch of salt in a small saucepan over medium-high heat, stirring often, until reduced by one-third, about 5 minutes.Step 4Cut leeks in half lengthwise and transfer to a baking dish; season lightly with salt. Pour warm vinegar mixture over leeks. Bake, uncovered, until sauce is reduced to a glaze and leeks have slightly darkened, 25–30 minutes.Step 5Toss parsley, oil, capers, pine nuts, and remaining 1 Tbsp. vinegar in a small bowl; season with salt and pepper. Spoon pine nut salsa over leeks.How would you rate Glazed Leeks With Pine Nut Salsa Verde?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleWe made this recipe for Thanksgiving.   The leeks were oh so tender and the salsa topping was beautiful and full of flavor.    Just make it.  LoriEaston PA11/26/2021This recipe was pretty good. I find leeks cooked any other way than sliced and sautéed to be very tough to cut, not matter how long you cook them. But the flavours were good. I used sherry vinegar and it was quite strong, but overall balanced with the honey. Canada4/16/2020KEVINR obviously didn't make this recipe.  I steamed the leeks and they were slightly to tender after 20 minutes (I don't like to boil the nutrients out).  Perhaps my red wine vinegar was to acidic because I needed to double the honey.  I did feel an extra layer of flavor was missing so I added honey-ginger balsamic vinegar.  The capers I had were in vinegar, so their flavor was hard to find.  Perhaps dry-salted capers would pack a bigger punch.  4 stars as is, 4.5 with my modification.ChicknpizaLos Angeles11/22/2019When i saw this recipe I immediately added it to my Thanksgiving menu but when I read Kevinr’s review I decided to take it for a trial run before Thanksgiving.  They were great. Falling apart tender.  I made a small batch and omitted the pine nuts For my trial but will include them for the big day.  I think the crunch of the pine nuts will be a nice balance to the soft leeks.Eileen PoletickNew Jersey11/9/2019There is so much wrong with this recipe. First of all, whole cooked leeks absolutely will not cut up into bites, no matter which world-class food web site is promising that they will. But texture aside, the Fresno pepper makes for a VERY spicy glaze, and the sweetness of the honey doesn't balance the tartness of both capers AND vinegar. (Really, why do you need two acids here?) Oh but wait, there's more: pine nuts. This dish doesn't know what it wants to be. Edit, edit, edit.KevinRAtlanta10/30/2019Explore Bon AppétitLeekVegetablePine NutNutChileFresno ChileFallSideVegetarianGluten-FreeDairy-FreeHealthyishThanksgivingRosh HashanahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani"]}