{"id": "9c01f8b0424c3151d0f70735ea2a8e28", "url": "https://www.bonappetit.com/recipe/master-bread-dough", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Master Dough Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMaster Bread DoughBy Bryan FordOctober 11, 20204.2(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThe secret behind many great breads is something called a preferment, a portion of the dough that ferments separately from (and for more time than) the rest of the ingredients. A preferment increases the strength of your dough (improving its final crumb structure) and contributes to aroma and flavor. In baker Bryan Ford’s cookbook New World Sourdough, the preferment is a sourdough starter; in this recipe, however, his preferment is the lower-maintenance poolish—a mixture of flour, water, and active dry yeast that grows overnight. Mix the poolish with more flour, water, and yeast as well as a touch of olive oil, sugar, and salt, and you get a resilient, flavorful dough that can be used in a nearly infinite number of ways. Ford encourages all bakers, especially beginners, to use a scale, and this is an instance when you really do need one as the volume of 100 grams of poolish will vary based on how much it grows. The master dough can also be scaled up or down as desired. Use this dough to make Bryan's Simple Sandwich Loaf, Sesame Burger Buns, Pull-Apart Breadsticks, and Detroit-Style Pan Pizza.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronScaleMedium Bowl$17 At AmazonKitchenAid Classic Plus Series 4.5-Quart Tilt-Head Stand Mixer$260 At AmazonIngredientsMakes 720 g600g bread flour, divided25g whole wheat flour½tsp. active dry yeast, divided20g sugar15g kosher salt15g extra-virgin olive oil, plus more for bowlPreparationStep 1To make the poolish, mix 100 g bread flour, 25 g whole wheat flour, ¼ tsp. active dry yeast, and 125 g warm water in a medium bowl. Cover with a kitchen towel and let rest at room temperature 12 hours. (The poolish will double or triple in size, so make sure your bowl is large enough to handle the growth. The poolish should have large and small bubbles all across the surface when it is ready.)Your poolish might not be QUITE this bubbly—and that's okay, too!\nPhoto by Chelsie Craig, food styling by Pearl JonesStep 2To make the master dough, transfer 100 g poolish to the bowl of a stand mixer fitted with the dough hook and add 300 g water. Mix on low speed to break up (it won’t be fully combined). Add 20 g sugar, 15 g kosher salt, 15 g extra-virgin olive oil, remaining 500 g bread flour, and remaining ¼ tsp. active dry yeast. Mix on low speed until incorporated, about 1 minute. Increase speed to medium and mix until dough comes together and is smooth, about 2 minutes. Increase speed to high and mix until dough no longer sticks to the sides of the bowl, about 3 minutes. (If you don’t have a stand mixer, you can still make this dough using a little elbow grease. Mix with a sturdy wooden spoon in a large bowl, then knead, starting in bowl and turning out onto a lightly floured surface once dough has come together, until smooth, 6–8 minutes.)Step 3Coat a clean medium bowl with more extra-virgin olive oil, place dough in bowl, and turn to coat. Cover with a kitchen towel and let sit at room temperature 1 hour (dough will be slightly puffy).Step 4Cover with plastic wrap or a silicone lid and chill until dough doubles or triples in size (you should see a few wide bubbles on the surface), 8–10 hours.Step 5Once your dough has fully risen, proceed with making Bryan's recipes, like his Simple Sandwich Loaf.How would you rate Master Bread Dough?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThe dough appears to be an adequate receipe, however, Mr. Ford wastes 20% of the poolish. At District Roma Bakery, where I was the shop kid in the fifties, we didn't waste anything -- even the floor dust was used, it was tossed outside to feed the sparrows.Leon JesterSouth Central Virginia6/14/2021Beginner baker question:   In Step 2, the recipe calls for using the stand mixer in three stages.   Are people using the stand mixture for approximately six minutes (1+2+3) or three minutes total (each stage for 1 minute)?   From reading the recipe, I was anticipating six minutes.  However, it seemed like the outcome of each stage was reached after one minute.    And, if it is six minutes, can you really achieve the same kneading outcome in six-eight minutes of hand kneading?  Thanks!Marc5/2/2021I love this recipe!  It's so easy and so tasty.  We use it all the time now - pretty much only make the simple sandwich loaf with it but it's the best simple sandwich loaf. I wanted to leave some comments because I'm not a very experienced baker and I had a lot of questions in the beginning.  It's nearly impossible to mess this one up.  The poolish is easy to make and worth making - the added step (compared to a simple quick yeast bread) makes a real difference.  My current schedule with this recipe is:  Day 1:  around 7am, make the poolish and let it sit out, covered with a towel.  Around 7pm (ish), mix the bread dough and put it in the fridge overnight to rise, covered with plastic wrap.  Day 2:  sometime in the morning, take out the dough, shape it into a loaf pan (I find the 8 1/2\" works better than a 9\"), let it rise for about two hours (sometimes three, depending on temperature, etc.), and bake for 35 minutes.      Now, the poolish - makes more than 100g.  I have made this 75+ times - now I just split the poolish into two bowls and make two loafs of bread. (We always eat them both but the bread also freezes just fine. It's also nice to give one to a neighbor.)  I weigh the ingredients to make the poolish but I no longer weigh out 100g.  I just split it more or less in half and it makes no difference if it's exactly 100g.   I also missed the part about using 100g in the bread recipe the first time and used the whole poolish and it worked great and tasted great.  I have also made the poolish, not felt like making the bread later and just put the poolish in the fridge with plastic wrap and let is sit for 2 days. Then I let it warm up on the counter for an hour and used it as normal and it made no difference - worked great.   I have also taken poolish out of the fridge but then haven't wanted to go through the step of a long 8-10-12 hour fermentation/rise of the actual bread dough.  Poolish + your bread dough ingredients can be mixed up, let rise until double, fold into bread shape and do second rise in bread pan then bake as normal (without the 10 hour fridge step) - works just fine and tastes great!     Final observation, this is a rather wet dough, which makes a great bread, but is less friendly for hand-mixing.  So, for the questions about the mixer.  I have found that using the mixer with dough hook make this unbelievably easy and quick - like this formulation was made for the dough hook.  But I have been lazy with pulling out the mixer and mixed by hand - it works just fine (I like using a dough whisk more than a spoon on this one) but you have to be careful about how much flour you add to knead it. \n You want to add flour to make it easier to handle but it bakes and tastes better the wetter it remains in the initial steps.   The biggest key is to weigh the ingredients - that does matter. \n So - I have found this recipe is optimal if you follow all the steps and timing and take two days to make it.  But it really is nearly impossible to mess up and unbelievably forgiving if you make mistakes or deviations.  And even though it takes \"two days\" - it takes about 10-15min of your time total over those two days.  BrendaBethesda, MD3/24/2021Question, not review yet.  My first loaf is rising nicely in it's pan.  Can someone tell me now long the poolish can stay in the refrigerator.  I hate to waste it but can't make something else today.  I was hoping to do the breadsticks in another day or two.  Will it keep??  Thanks for any help.  I see one answer about keeping starter for a year, but don't know if this is poolish or sourdough starter.\n\nDianneNew York, NY1/17/2021To @Garrison: I now have a starter in a quart Mason jar that is a year old.  Late on the day before I'm ready to bake, I pull it out of the refrigerator, add 150 grams of flour and 150 grams of water to it, and leave it on the counter overnight.  The next day, I draw 300 grams out and put the jar with the leftover 150 grams of starter back in the 'frige.  (My original starter mix was a total of 450 grams.)  I have kept the leftover starter in the 'frige for as much as two weeks, no feeding, no discards.  Works great. HawksterAurora, IL1/15/2021Update from the presumed-dead dough!  After I left the comment yesterday morning, I left the dough on the counter all day bc why not?  It didn’t do much. After 10hrs, I wasn’t convinced anything was to be done, but it was New Year’s Eve and I didn’t feel like doing dishes (also I might have been tipsy) so I left it overnight to deal with in the morning. It was a New Year’s Miracle!  I woke up this morning and it’d risen something fierce!  So I proceeded with prepping it and it’s now doing it’s final proof in the loaf pan.  \n\nStill no idea what happened but I won’t be chilling it in the fridge again unless the flavor is so badass it’s worth the extra day it takes. :) LandfallHouston, TX1/1/2021A question and then a comment -- \n\nWhen it says 'chill the dough 8-10hrs', does it mean in the refrigerator?  That's what I assumed it meant, but when I peeped on the dough this morning, it hadn't risen at ALL.  Step 1 went off without a hitch and I triple-checked volumes of ingredients and instructions in Step 2 since I was making this for the first time, so I feel comfortable that everything (including yeast) made it in.   What do you think happened?\n\nGeneral comment about the poolish - I too had 115g of it left over, and read on a few other baking sites that you can use it at least up to a week (maybe more, but I didn't come across anyone who tried that).  Just bring it back to room temp before starting Step 2 of the recipe above.  I stuck it in the fridge last night alongside the bread dough, and used a container that was clearly too small b/c it bubbled out overnight.  :). Since the main dough didn't rise as I mentioned above, I'm using the leftover poolish to try again.LandfallHouston, TX12/31/2020This poolish and master dough led to a gorgeous white loaf that I sliced and used for toast and sandwiches.  I used the extra poolish to make a second loaf .  My family ate the first loaf so quickly, I’m glad I had the second. I reckon I’d cut quantities for the poolish in half if I only wanted one loaf. ViktoryaSan Francisco, CA12/16/2020Looks good. Now, if I use half of a batch, can the other half be frozen?BrianFort Worth, TX11/6/2020To Jeannie, I'm talking of the poolish to master dough, not the master dough for a pullman loaf or pizza crust. \n......\n\nUsing 100g of the poolish to make the master dough you'll have 150g of poolish left over.....\n\n100g Bread flour + 25g Whole Wheat  + 125g water = 250g of poolish (the 1/4 tsp yeast weight is minuscule)....\nUse 100g of 250g and 150g is leftover  \n\n\nAnonymousBurbank, CA. 11/5/2020The last poster asked about only seeing the 4th step, number 5 says just let the dough rise, and then make something....Simple Sandwich Bread, for instance.  Hope that helps!JeannieHernando Beach, FL11/5/2020To those who ask:  Can I make this without a mixer.\n\nStep 2 clearly states:\n(If you don’t have a stand mixer, you can still make this dough using a little elbow grease. Mix with a sturdy wooden spoon in a large bowl, then knead, starting in bowl and turning out onto a lightly floured surface once dough has come together, until smooth, 6–8 minutes.)\n\nPlease READ recipes.  \n\nMy question is:\nWhat do you do with the leftover poolish?  Is there enough to make another loaf? \n\nWeighing ingredients is by fair more accurate. \nMeasuring flours by cups can give different weighs depending on how it's measured.\n\nNo sift scooping or spooning\nSift then scooping or spooning\nSifting into the cup \n\nRose Levy Beranbaum of \"The Cake Bible\"  1989, introduced me to weighing. AnonymousBurbank, CA. 11/5/2020@Garrison, NY, I have yet to read any recipe worth its salt use anything but the metric system when it comes to baking bread. It requires preciseness and you can't get it with cups and teaspoons. Get yourself a scale, expand your thinking and stop being so grumpy!AnonymousToronto, Canada11/1/2020@anonymous from Canada: yes, you can hand-knead. It will longer at first, but once you find your technique it works nicely and quickly. I never use kitchen machines for baking bread, much more of a sensory experience to hand-knead.Austria10/31/2020@Garrison Little known fact: There is life outside of the United States... ;-).\n\n@Bryan Ford: Love the preferment -- but what to do with the left over poolish? Do you have any recommendation on how to store for later use, and how to \"revive\" when you make your next loaf? Can it be done similar to regular sourdough?Austria10/31/2020Explore Bon AppétitDoughBreadBread FlourFlourYeastOther IngredientsNut-FreeDairy-FreeVegetarianVeganBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-11", "author": ["Condé Nast", "Bryan Ford"]}