{"id": "9c06c9f340e5d9cc41910e6c3c877864", "url": "https://www.bonappetit.com/recipe/cbd-caramel-sauce", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "CBD Caramel Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueCBD Caramel SauceBy Andrea DrummerJanuary 8, 20191.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintServe this caramel over ice cream, stirred into yogurt, or drizzled over a brownie or slice of pound cake whenever you want the chill effect, without that \"herbal\" flavor. Use full-spectrum CBD oil (we like Ritual or Isodiol) for the best effect.IngredientsTwelve 2 Tbsp. servings (15 mg CBD each) 1cup sugar½cup heavy cream3Tbsp. unsalted butter, cut into pieces1tsp. vanilla extract½tsp. kosher salt180mg CBD oilPreparationStep 1Cook sugar in a medium saucepan over medium heat, without stirring, until it begins to melt and turn golden brown around the edges. Use a heatproof spatula to stir melted sugar into unmelted sugar and continue to cook, stirring occasionally, until all sugar is melted and caramel turns a deep amber color, about 5 minutes.Step 2Remove pan from heat and carefully add cream to caramel, stirring constantly (mixture will bubble vigorously and seize). Add butter and stir until melted, then stir in vanilla and salt. Let caramel cool slightly (about 5 minutes), then vigorously stir in CBD oil until mixture is emulsified. Transfer to an airtight container and let cool completely.Step 3Do Ahead: Caramel can be made 2 weeks ahead. Cover and chill. Reheat over low before using.How would you rate CBD Caramel Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitSauceCondimentDessertCannabisHerbs & SpicesGluten-FreeNut-FreeHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Andrea Drummer"]}