{"id": "9c13c4192e90464d938968344fe438f7", "url": "https://www.bonappetit.com/recipe/cod-with-scallion-sesame-butter", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Cod With Scallion-Sesame Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueCod With Scallion-Sesame ButterBy Chris MoroccoJuly 6, 20214.5(42)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis nod to scallion-ginger sauce uses both butter and olive oil, giving extra richness to lean whitefish. A dusting of cornstarch imparts that restaurant-style golden crisp.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonSilicone and Stainless-Steel Tongs – 2 Pack$17 $9 At AmazonStainless Steel Mixing Bowls, Set of 6$20 At AmazonVegetable Peeler$10 At AmazonMedium Saucepan$39 At AmazonIngredients4 Servings45–6-oz. cod or other flaky whitefish filletsKosher salt2Tbsp. cornstarch or all-purpose flour6Tbsp. extra-virgin olive oil, divided1bunch scallions, thinly sliced4Tbsp. unsalted butter1tsp. toasted sesame oil11” piece ginger, peeled, finely chopped2garlic cloves, thinly slicedPreparationStep 1Pat fish dry with paper towels; season with salt. Sprinkle one side with an even layer of cornstarch; brush off excess. Heat 2 Tbsp. olive oil in a large nonstick skillet over medium-high. Lay fish, cornstarch side down, in skillet and cook, shaking pan occasionally, until golden, crisp, and opaque around the edges, 6–8 minutes. Turn fish over and cook just until fillets are cooked through and flake easily with a fork, 1–2 minutes.Step 2Meanwhile, place scallions in a medium heatproof bowl. Combine butter, sesame oil, ginger, garlic, and remaining 4 Tbsp. olive oil in a medium saucepan over medium heat. Cook until butter begins to foam and garlic turns light golden, about 4 minutes. Pour over scallions, stirring to wilt. Let cool 1 minute, then season with salt.Step 3Serve fish with scallion-sesame butter spooned over.How would you rate Cod With Scallion-Sesame Butter?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleSo easy! So delicious! I served this with egg noodles and zucchini on the side. I finished it all with a touch of maldon sea salt. Jordan RChicago, IL3/2/2022This was a miss. We found it incredibly bland and flavorless. Eric B. 1/19/2022This is a very curious recipe in that it resembles in its flavors many of the components of Cantoneses style steamed fish. You choose to fry it and then essentially add the aromatics and other components afterwards . It seems to me there are distinct advantages to steaming the fish fillet with the aromatics and then adding a sauce to it afterwards . One is that the fish becomes infused with the flavors while steaming and  two you get a nice less greasy finish to it by adding soy sauce and sesame sauce and perhaps sesame for crunch while  forgoing much  olive oil or butter for a milder vegetable based oil and water. But many will appreciate the simplicity of frying . Randall Madison , Wi1/11/2022Tasty! Like other reviewers I thought the sauce was too greasy. The second time I made it, I doubled the sesame oil, ginger and garlic, omitted the olive oil completely and added a splash of rice wine vinegar. JosieChicago12/30/2021I agree with the comments to increase the non-fat ingredients in the sauce to avoid it being too greasy if making it on its own. I think this concern is eliminated if you put the fish over rice, angel hair pasta, or couscous (as someone else recommended). That way the starch can absorb some of the fat. I also added some very thinly sliced jalepenos to the scallions before pouring the sauce over them. Added a good kick if you're into that sort of thing. Unlike other comments, I thought the sesame flavor was present from the proportions in the recipe. If it isn't, get better sesame oil.ChrisAtlanta, GA11/9/2021I thought this was a great light flavored dish. The crisp on the fish was fantastic. I reduced the olive oil in the sauce due to the reviews and it turned out great. Nice summer entree.Rigletto’s DaughterWestchester, NY8/13/2021I also found the sauce bland and greasy. Couldn't taste the sesame flavor. Added juice of half a lemon and Aleppo pepper to cut grease and amp flavor.AnonymousElkhorn, WI8/11/2021This was great but I did make a couple of adjustments after reading the comments! I made this for 2, but since some commenters said the sauce lacked some flavor, for the sauce I the amounts of ginger, garlic, and scallions the same as in the recipe (ie I didn’t halve the amounts), and I used 4 tbsp of butter with none of the olive oil. Finally, I did cook the scallions in the butter for maybe 60-90 seconds just to get them nicely infused in that butter sauce. Faith BCalifornia 8/10/2021Not sure how to rate this. The fist was fantastic. It didn't really need the sauce, and my friend and I found the sauce pretty tasteless; too much scallion for the amount of butter and oil. Perhaps if I had made rice or couscous to go with the sauce, it would have been soaked up and have complemented the fish well. In any case, we loved the fish made this way, and we had a lovely dinner of fish, roasted zucchini, and tomatoes and cukes from my garden.Janet KBrookline, MA8/7/2021The scallion sesame butter was a bit too bland and oily. I added some mirin for umami since that's what I had on hand. Miso would work great too. MaggieMontreal8/6/2021Love the idea of the dish but can’t understand why “batter” only one side of the fish. The picture would seem to be of a piece of cod done in a light batter (a la English fish and chips) ? Darryl Hartley🇬🇧LeonardHilton Head island SC 8/3/2021Lovely recipe.  Easy to put together and tasty.  Tons of flavor.  We used chives instead of scallions.  Worked perfectly.  We paired it with garlic sautéed spinach.  Totally health and perfect weeknight meal. The extra sauce was great on the spinach! A bit of which miso might give the sauce a bit more umami and depth.  Overall loved it. Will make it again.Andrew EPalm Springs, CA7/29/2021We loved this dish! Unlike another reviewer, we thought there was tons of flavor, partly because we always use a very good extra-virgin olive oil—and we could taste the sesame oil even though it was only a teaspoon. Pairing the cod with couscous and fresh green beans soaked up some of the luscious butter scallion sauce and unified the plate.Russell HartmanLanghorne, PA7/27/2021I love Chris Morocco recipes.  This one was a fail for me. The scallion butter was bland and tasted mostly of oil(I even upped the amount of ginger as I didn’t want to waste the little bit that was left). There was no taste of sesame at all. (Which is sad because again I love Chris’s uses of miso and flavours that really bring dishes to life.) The fish was patted dry and I follow the detailed instructions (which is one of the things I love about Chris Morocco’s recipes) and it just fell apart and never turned that lovely shade of brown. JennyPittsburgh, Pa7/26/2021Using cornstarch provided a golden brown crispy crust on the cod!  The scallion sesame butter is so easy and delicious - perfect with a side of rice and any veggie!  Definitely a keeper recipe!!!  Joan CollinsHouston TX7/24/2021Explore Bon AppétitCodFishSeafoodScallionOnionVegetableQuickEasyWeeknight MealsMainGluten-FreeSearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Chris Morocco"]}