{"id": "9c17d9a7149dbe726af455eec67630ce", "url": "https://www.bonappetit.com/story/roasted-broccoli-recipe-guide-to-roasting-vegetables", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Roasted Broccoli Recipe Is Your New Guide to Roasting Veggies | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Crispy Roasted Broccoli Recipe Is Your New Guide to Roasting VeggiesSchool’s in session, no mushy broccoli allowed.By Jesse SparksSeptember 26, 2018FacebookTwitterEmailPhoto by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirFacebookTwitterEmailWhen I was little, I knew I didn’t actually hate broccoli—I just hated the stinky, pale-green, mushy steamed stuff I got served in the middle school cafeteria. Because even at a young age, I could tell that it wasn't the vegetable's fault. I knew broccoli deserved better. And now, in my adult life, I finally understand what that means: crispy roasted broccoli with plenty of luscious tahini sauce drizzled overtop.This roasted broccoli recipe couldn't be more simple to make or easier to love. It produces beautifully browned florets and coins of sweet, crisp stem, and should be your new go-to method for making the kind of weeknight veggie side that feels like a joy, rather than a chore, to make and eat. Here's how it goes down.Take a large head of broccoli—the kind that still has a nice long stalk, not just broccoli \"crowns\"—and cut it crosswise into coins, starting at the bottom working your way to the florets. (That's right: The stems are edible, and delicious!) Like you would in any sort of roasted vegetable situation, you’ll want to cut the chunks into uniform pieces so they all cook at around the same rate.That's right: You can eat the stems, don't throw 'em out!\nPhoto by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirThen you're going to spread the broccoli out on a rimmed sheet pan, making sure the pieces aren't too crowded—you want them to have plenty of space to breathe, otherwise they'll steam rather than roast. Pop those into a preheated 425°F oven—that's the kind of heat you need in order to get the outside of the broccoli crispy while the interior retains a bit of crunch—and before you know it those beautiful green hunks will transform into crackly, brown-tinged jewels ready for saucing. You’re not done yet, though.If you ever taste seemingly-simple sauces at restaurants and wonder how they pull it off, well, then this is the sauce for you. It reads kind of fancy, but all you're doing is whisking together lemon juice, salt, hot water, tahini, and olive oil until it's smooth and creamy. The end result is a beautiful emulsion that’s velvety and rich while also punchy enough to give that platter of crispy-crunchy broccoli just the right amount of zing. The best part? If you slipped up and made a little too much sauce, don’t worry! The sauce is perfect for topping other roasted veggies, pita pockets, and any type of grain bowl you find yourself cobbling together when you're too tired to cook. Toast some sesame seeds real quick, sprinkle those on top, and you're looking at a mini-masterclass in flashy toppings and finishes. Broccoli: redeemed.Right, about that roasted broccoli recipe:Crispy Roasted Broccoli with Tahini SauceHigh heat and the simplest sauce ever make for roasted veggies that feel like a dish, not an afterthought.View RecipeExplore Bon AppétitBasicallyBroccoliRoasted VegetablesTahiniSesame SeedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Jesse Sparks"]}