{"id": "9c265fc0441537a17651cd97bdad9d24", "url": "https://www.bonappetit.com/story/a-simple-trick-for-more-tender-scrambled-eggs", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "Make Creamy Scrambled Eggs With This One Simple Trick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Simple Trick for Creamier Scrambled EggsAdd salt—and soon.By Sarah JampelMay 4, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailIf I asked you, “When do you add salt to your scrambled eggs?” you might not even know the answer. Do you add it when you whisk the eggs, when they're in the pan, or when they're on the plate and your bread has sprung up from the toaster? Maybe it's so instinctual that you can't remember. Or maybe it's so random that it depends on the day!Whether you're set in your ways or living in the moment, salting early on (that is, as soon as you whisk the eggs together), can result in creamy scrambled eggs that are softer, lusher, and evenly seasoned.As J. Kenji López-Alt explains in his book The Food Lab, salt inhibits the proteins in the egg yolks from binding too tightly as they heat up, which results in a moister, more tender curd: “When eggs cook and coagulate,” he writes, \"the proteins in the yolks pull tighter and tighter together as they get hotter. When they get too tight, they begin to squeeze liquid out from the curds, resulting in eggs that weep in a most embarrassing manner.\" By reducing the attraction between proteins, salt reduces this risk. For super soft but not-watery eggs, López-Alt recommends salting quite early (as in, 15 minutes before you start to cook!) so that the crystals can dissolve in the mixture for the greatest effect and most even distribution. Ever the skeptic, I made two pans of scrambled eggs side by side. To one bowl, I added salt 15 minutes ahead of time; to the other, I whisked in the same amount just before I started cooking. While the eggs from both pans were nice and creamy—medium-low heat, a good nonstick pan, and plenty of fat will do that for you—I could still taste the difference. The eggs that had been pre-salted were eggier (thanks to the salt having time to dissolve and thoroughly season the eggs) and softer.From now on, I'll salt my eggs when I whisk them rather than haphazardly sprinkling Diamond Crystal over a hot pan. I don't know if I have it in me to wait 15 minutes (as in, I do not), but five seems like the perfect amount of time to get the coffee going. Scramble!BA's Best Soft Scrambled EggsView RecipeExplore Bon AppétitEggScrambled EggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-04", "author": ["Condé Nast", "Sarah Jampel"]}