{"id": "9c341c22ebf14200b62d5ccc5f2cb254", "url": "https://www.bonappetit.com/story/iced-horchata-latte", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "The Horchata Iced Latte Is Your Last Refreshing Iced Drink Before PSL Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Last Refreshing Iced Drink Before PSL SeasonYou could pay $7 at a café...or you could make it at home.By Sarah JampelSeptember 20, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Back in college, I had a sneaky coffee strategy. Every Saturday and Sunday, I’d get to my local coffee shop right when it opened (7:30 a.m.) and buy a small black coffee ($2). I’d camp out with an enormous book of Middle English poetry until the café closed and I had to migrate to the library (sad but true). And every five weeks, when my reward card had been punched ten times, I’d parade in and trade it for a dirty chai iced soy latte, size large ($7.50).Perhaps this was unethical. Perhaps I was just a student trying to watch my budget. Perhaps I can never tell you the name of this coffee shop because I’d never be allowed back.Now that ye olde days of incomprehensible poetry are behind me (I think), I’m less interested in buying fancy drinks and more interested in making something that tastes like it was carefully crafted by a barista but was actually made by yours truly right at home.Like this Iced Horchata Latte from Cofax in L.A., which checks all the boxes. It tastes luxurious and refreshing—like something I’d easily pay an arm and leg for after I’ve sweated through my dress on my morning commute—but I don’t need an espresso machine or a milk frother to make it. All that’s required is the forethought to soak a handful of ingredients I already have in the kitchen—oh, and a coffee grinder and a blender (that’s easy, though: my grinder is practically attached to my person since I love coffee, and my blender is a standby for smooth soups, creamy sauces, and occasional smoothies).Before I go to sleep, I grind up brown rice and coffee beans and soak them, along with half a cinnamon stick and some raw almonds, in plenty of water. The next morning, I blend it all up and pour it through a fine mesh strainer once or twice to get rid of any remaining grit.Thanks to the starchy rice and the fatty almonds, the final product is creamy, nutty, and rich. It’s milky but totally dairy-free, which makes “latte” a bit of a misnomer. This recipe differs from traditional horchata—a category of plant-based drinks ubiquitous throughout Mexico and Latin America, with lots of regional variations—in the addition of coffee beans. But considering I rely on caffeine to guarantee that I’m not a zombie before 10 a.m. and between 3 p.m. and 5 p.m., the coffee is critical.I’ll mix in simple syrup (equal parts sugar and water) since it distributes sweetness more evenly than adding straight sugar, then transfer my drink to an ice-filled mason jar and scamper out the door. Sometimes, if I’m feeling extra exhausted, I’ll mix the horchata with cold brew to make a “cochata.”One batch of horchata is enough to last me through the week (score!), and I can complete the whole process in the same number of minutes it usually takes the person in front of me at the coffee shop to finish their elaborate order.Get the recipe:Iced Horchata LatteView RecipeExplore Bon AppétitNever FailSummer DrinksCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-20", "author": ["Condé Nast", "Sarah Jampel"]}