{"id": "9c3f633930b0b8e28d18215ea67c99e3", "url": "https://www.bonappetit.com/story/celsious-laundromat", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "Celsious Laundromat Is the Eco-Friendly Laundromat Where You'll Want to Stay for Lunch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Eco-Friendly Laundromat Where You'll Want to Stay for LunchThe Williamsburg laundromat just launched a serious cafe menu.By Shanika HillocksApril 8, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIf there’s one thing that the eight-million-plus inhabitants of New York City share, it’s laundry. Birthed from this notion, and from their frustration with local laundromats and drop-off and app services, German-born sisters Corinna and Theresa Williams created Celsious, a new kind of laundromat. Nestled on North 7th street in Williamsburg, the “clean” laundromat uses biodegradable detergents, hosts regular community events, and, now, offers a full cafe menu in collaboration with Nourish Kitchen + Table.“We’re very diligent when it comes to sourcing ingredients and aim to be zero-waste in our operations,” Theresa explains. “When we decided to expand [our existing] café menu, we wanted to showcase these values in the food.” Leading this charge is nutritionist and chef Marissa Lippert, whom the duo met through Igna Lena, a mutual friend and fellow entrepreneur. “We immediately bonded with Marissa over shared NYC-business-owner trials and tribulations,” Corinna says.Sisters Theresa and Corinna Williams, who own Celsious laundromat and cafe\nPhoto by Emma FishmanOn a recent light-drenched afternoon, customers lingered in the cafe, even if they weren’t doing laundry. “Since the roll out, we have more customers hunkering down for hours-long work sessions or meetings, and it’s great to have sweet and savory offerings now to carry them through a full day,” Theresa says. Behind a subway tile-inspired counter is a menu inspired by the brick-and-mortar Nourish Kitchen + Table, which Lippert ran until last year, with plenty of custom additions, like the Wash & Wait cheese plate with Goatlet, Bandaged Bismark, and Naked Pruner cheeses sourced from Brooklyn’s own Crown Finish Caves.Lippert took a conscious approach to the menu, incorporating methods like fermentation, dehydration, and  whole-ingredient cooking. Watermelon radish-apple kimchi, fermented quince, and pear, cabbage and fennel krauts are added to baked goods and served on toasts and salads. Dehydrated fruits and vegetables get turned into the flours that go into the rotating pastry offerings. A carrot cake cinnamon bun is savory, sweet, and vibrantly colored thanks to the carrot flour that’s folded in. A savory baby babka bun made with kimchi puts an umami-packed spin on a New York classic. On a recent weekday, a tartine with labneh, fresh mint, harissa-brown butter, preserved Meyer lemon, mustard greens, and lamb kofte exploded with flavor and deterred a 2:30 p.m. slump.House-cultured yogurt with blood orange, hibiscus-vanilla reduction, toasted hazelnut and cacao nib.\nPhoto by Emma Fishman“My goal for the cafe is to continually evolve our food while we inform and feed customers in the most intentional way possible,” Lippert says. “For me, that comes through working closely with local farmers and purveyors, respecting the ingredients we feature, and passing that along to customers.”The daily laundry scene at Celsious\nPhoto by Emma FishmanThe beverage list aligns with the thoughtfulness and quality. Ronnybrook Creamline Milk is delivered in glass bottles, which are returned to maintain a zero-waste way of doing dairy. Almond milk is made in-house daily using raw organic almonds, serving as the base for the Coco Matcha, which features CAP Beauty’s organic ceremonial grade matcha. Leftover almond meal shows up later in the café’s Turmeric Power Balls. There’s also cold brew on tap along with rotating kombucha flavors from Vermont-based Aqua ViTea, apple cider vinegar from Westwind Orchard, the first organic orchard in New York State, and tea from Jil Larsen of Magic Mix.“There’s a connectivity between how we eat, what we wear, and how we feel,” Corinna says. “We hope that while you care for your clothing, you can care for your mind and body too.”The café and laundromat are currently open 7 a.m. to midnight, with the opening hour switching to 8 a.m. as of April 22.The perfect snack plate: Turmeric-rose tea egg,  housemade “everything spiced” focaccia, fenugreek labneh, smoked chili salsa macha with meyer lemon, and seasonal pickles\nPhoto by Emma FishmanExplore Bon AppétitHealthyishNew York CityTrendsBrooklynRead MoreLifestyleHow to Make and Drink the Perfect Cup of Yerba MateBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Shanika Hillocks"]}