{"id": "9c463d35f64704751a2ac4760f0d7818", "url": "https://www.bonappetit.com/story/japanese-vegetable-grater", "year": 2020.0, "month": 9.0, "day": 3.0, "content": "This Japanese Vegetable Grater Is My Quickest Route to Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Japanese Kitchen Tool Is My Quickest Route to DinnerMy beloved grater dispatches vegetables in seconds.By Kaki OkumuraSeptember 18, 2020FacebookTwitterEmailEmma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!When I first moved out of my parents' home and into my own apartment, it was easy to remember to buy a rice cooker and a chef's knife. But when I tried to make the Japanese dishes I grew up eating, I began to realize all the small but essential tools that were missing in my new kitchen: bamboo cooking chopsticks, a rice paddle, and, of course, a grater.Almost every Japanese household has a vegetable grater. This is because Japanese cooking often uses oroshi-mono, which directly translates to \"something grated.\" Raw grated ginger is often served on the side of grilled vegetables or tempura, and raw grated daikon commonly tops wafū burgers or fried fish. Both are also served as a side to soba noodles or udon noodles, as they are the perfect way to add spice and to freshen up something a bit salty or fatty: Daikon is high in vitamin C and helps metabolize fats, and ginger is anti-inflammatory, making heavier foods much less stressful on our stomachs.The best vegetable graters look a bit different from those used for cheese. They should lie flat, so you can grate perpendicular to the table with stability, and they should have a container on the bottom to capture the vegetable and easily transfer it to dishes.Raw grated vegetables add an additional layer of texture like a condiment or sauce would, allowing me to incorporate the fresh flavor of whole foods without the space and cleanup that a food processor requires, or time and skill of slicing and chopping with a knife. If I find that I have some extra daikon or nagaimo yam in my fridge, I just grate them and serve it on the side of whatever I'm cooking that night. If I have some carrots or tomatoes close to spoiling, I grate them and toss them into a stew or curry to add a natural sweetness and thickness. Although it doesn't take up counter space like a rice cooker or knife's block, this small and simple tool is one I can't imagine my kitchen without.Photo courtesy of OTSUMAMI TOKYONonslip Quick Radish Grater$9 at AmazonThe above grater is currently sold out, but this product is similar: Courtesy of HCHUANGHCHUANG Grater With Airtight Storage Container$12 at AmazonExplore Bon AppétitHealthyishHealthyish Loves ItShoppingVegetableJapaneseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-18", "author": ["Condé Nast", "Kaki Okumura"]}