{"id": "9c5f5fd842d60c7191f9f2e5973ff1b2", "url": "https://www.bonappetit.com/story/homemade-lox", "year": 2020.0, "month": 12.0, "day": 4.0, "content": "Quick-Cured Salmon Made at Home in Just One Hour | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Almost-Instant Lox Is Ready in One Hour (!)The fastest route to making salty, fatty, cured salmon at home. By Amy RosenDecember 28, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I can happily survive on nothing but toasted bagels and cream cheese for weeks on end, and there are some days when I want to add scoops of egg or tuna salad on top. And when I truly want to level up, there’s only one thing that will do, and that’s a slice or three of silky, salty, fatty cured salmon. Simply put, lox is an expression of wanting something more. Salmon aspirations.While Nordic countries can and should lay claim to gravlax, my personal experience comes from the Semitic side of the salmon (laks is the Yiddish word for “salmon”). For my new-immigrant great-grandparents, lox was the pricey, indulgent food they’d treat themselves to after a hard work week. Indulging in some Saturday dairy appetizing was their Jewish manifestation of “live a little!”Ready in an hour!\nPhoto by Emma Fishman, Food Styling by D'Mytrek BrownLox is salmon (if you really want to get particular, it’s the belly portion) that’s been cured, brined, or smoked, but never cooked. I had been making salt-cured salmon for years, which usually entailed a three-day work-back schedule, a half side of salmon, cups of salt, sugar, and fresh herbs, and several spot-checks along the way. Until one day I thought, What if I used less salmon and quick-cured it by slicing it before applying the cure, giving the salt more surface area to penetrate? So I gave it a shot, spreading some cure on a plate, laying the salmon slices over top, and topping them with the remaining cure and fresh dill. An hour later, it was ready to eat. And the rest is (almost) instant history.Here’s how to make it: In a small bowl mix together 2 Tbsp. Kosher salt and ¼ cup granulated sugar (or brown sugar). This is your cure. Set aside. Thinly slice an 8-ounce skin-on fresh salmon filet on the diagonal, about ¼-inch thick, cutting it off of the skin. Spread half of the cure on a dinner plate and lay salmon slices evenly over top, making sure they don’t overlap. Sprinkle the rest of the cure on top so that the salmon is completely covered, then top with a handful of fresh dill sprigs. Lay plastic wrap over top and press down firmly.Refrigerate for 1 hour, then rinse off cure and herbs in a colander and pat gravlax dry with paper towel. Sprinkle with a touch of fresh dill fronds and a drizzle of olive oil before serving.If only my great grandparents could see us now!You’ve made the lox. Now you need the schmear:Making Your Own Cream Cheese Is As Easy As Boil, Strain, WaitLearn to DIY and you'll never run out.View StoryAmy Rosen’s latest cookbook is ‘Kosher Style,’ which features her recipes for bagels and cream cheese (along with 100 other modern Jewish recipes).Explore Bon AppétitIt's That SimpleSalmonJewishRead Moreholiday issue 2020Add Leeks to Your Latkes. Never Look Back.By Zak the Baker, as told to Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-28", "author": ["Condé Nast", "Amy Rosen"]}