{"id": "9c6e4c13b20164572b06c8d8c5a1ab11", "url": "https://www.bonappetit.com/recipe/grilled-pork-shoulder-steaks-with-herb-salad", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Grilled Pork Shoulder Steaks With Herb Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueGrilled Pork Shoulder Steaks With Herb SaladBy Andy BaraghaniApril 14, 20205.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta Florczyk EmailPinterestPrintEmailPinterestPrintDon’t go for perfect grill marks here. Flip the steaks often so the fat renders evenly without overcooking the meat. And don’t sleep on that herb salad—it brings some freshness to the sticky-salty-sweet steaks.Ingredients8 servings4medium shallots, 2 chopped, 2 thinly sliced6garlic cloves⅓cup plus 3 Tbsp. fish sauce⅓cup plus 3 Tbsp. fresh lime juice3Tbsp. light brown sugar, divided8¾\"-thick pork shoulder steaks (3½–4 lb. total)2red or green Thai chiles, thinly sliced3cups Thai or sweet basil leaves, cilantro leaves with tender stems, and/or dillPreparationStep 1Blend chopped shallots, garlic, ⅓ cup fish sauce, ⅓ cup lime juice, and 2 Tbsp. brown sugar in a blender until smooth.Step 2Season steaks lightly with salt (the fish sauce will also season the steaks). Transfer to a large bowl or a 12x9\" baking dish. Pour marinade over and turn steaks with tongs to coat evenly. Let sit at room temperature 1 hour, or cover and chill up to 12 hours, turning once (halfway through if you can).Step 3Preheat a grill to high heat. Grill steaks, turning every minute or 2, until lightly charred and crisp and an instant-read thermometer inserted into the thickest part registers 140°, 7–9 minutes. Transfer steaks to a cutting board and let rest at least 5 minutes before thinly slicing.Step 4Meanwhile, mix chiles, remaining 3 Tbsp. fish sauce, remaining 3 Tbsp. lime juice, remaining 1 Tbsp. brown sugar, and 1 Tbsp. water in a large bowl to combine. Add sliced shallots and herbs and toss to coat; season lightly with salt.Step 5Arrange sliced meat on a platter and scatter herb salad over.How would you rate Grilled Pork Shoulder Steaks With Herb Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleSo Delicious! \n\nI made this along with the Tri Tip with Tiger Bite Sauce for a dinner party and people couldn’t stop eating either, but for me this became my new favorite. I only needed to marinate the pork a few hours max - and the sauce was delicious - I was worried I didn’t have enough herbs, but a little went a long way. 100% will make again. AnonymousMichigan 9/1/2020This dish was amazing! I added rice noodles which made the meal go a little further and it was spectacular. I also couldn't find Thai chilis so I drizzled sambal oelek on top. I'll be adding this meal to my regular dinner options. AnonymousMinneapolis, MN8/11/2020I know a dish is good when I keep thinking about it days after I cooked it. This is one of those dishes. The marinade, the fresh herb salad and (for me) a new take on pork shoulder and steak. Love. This. Dish!mufb87PA5/20/2020Quite possibly one of the best pork dishes I’ve ever made. The herb salad with the dressing was so good I’m gonna make a batch of the dressing for regular use! AnonymousChicago 5/10/2020This was delicious. I was low on fish sauce and used it all in the marinade. I left it out of the herb salad with no substitutions, and we didn’t miss it. AnonymousMaryland5/8/2020Explore Bon AppétitAsianPork ShoulderPorkMeatThai BasilBasilHerbs & SpicesLimeCitrusFruitSummerEasyMainGluten-FreeDairy-FreeNut-FreeGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Andy Baraghani"]}