{"id": "9c71cf07b801d317fce98a2ff69f4bc4", "url": "https://www.bonappetit.com/recipe/chicken-with-mushroom-puree-and-swiss-chard", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Chicken With Mushroom Purée and Swiss Chard Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueChicken With Mushroom Purée and Swiss ChardBy Shaun HergattSeptember 14, 20214.2(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChef Shaun Hergatt of NYC’s Vestry showcases simple, clean flavors in this dish. The chicken breasts have a crispy, golden skin and are served atop a silky mushroom purée leveled up with truffle oil for extra umami. Brussels sprouts or kale are good swaps for the Swiss chard.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Skillet$60 At AmazonInstant-Read Thermometer$35 At ThermoworksMesh Sieve$13 At AmazonCutting Board$10 At IKEALarge Nonstick Skillet$50 At AmazonIngredients2 Servingsmushroom purée4Tbsp. unsalted butter8oz. button mushrooms, halved2shallots, finely chopped3garlic cloves, finely chopped1sprig thyme1bay leaf2cups low-sodium chicken broth1cup heavy cream2Tbsp. crème fraîche2tsp. truffle oil (optional)Kosher salt, freshly ground pepperchicken and assembly2skin-on, bone-in chicken breastsKosher salt, freshly ground pepper3Tbsp. extra-virgin olive oil, divided1shallot, finely chopped1garlic clove1bay leaf2cups low-sodium chicken broth2Tbsp. unsalted butter1bunch Swiss chard, ends trimmed, leaves chopped into large piecesPreparationmushroom puréeStep 1Melt butter in a medium high-sided skillet over medium-high heat. Add mushrooms and cook, stirring occasionally, until browned and liquid is evaporated, 6–8 minutes. Add shallots, garlic, thyme, bay leaf, and broth, bring to a simmer, and cook until broth is reduced by half, 8–10 minutes. Add cream and simmer until reduced by half, 10–12 minutes. Discard thyme and bay leaf and transfer mixture to a blender. Add crème fraîche and truffle oil (if using) and purée until smooth. Season with salt and pepper; set aside.chicken and assemblyStep 2Preheat oven to 350°. Pat chicken dry; lightly season with salt and pepper. Heat 2 Tbsp. oil over medium-high in a medium nonstick skillet. Cook chicken, skin side down, until skin is slightly crisped, about 3 minutes. Transfer chicken to a rimmed baking sheet and turn skin side up. Bake until skin is golden brown and an instant-read thermometer inserted into the thickest part of breasts registers 160°, 23–25 minutes. Transfer to a cutting board and let rest 5 minutes; reserve skillet. Slice chicken; set aside.Step 3Combine shallot, garlic, bay leaf, broth, and butter in reserved skillet and bring to a simmer over medium-high heat and cook until reduced to about ½ cup, 14–16 minutes. Strain jus through a fine-mesh sieve into a small bowl; set aside.Step 4Heat remaining 1 Tbsp. oil in same skillet over medium. Add any Swiss chard pieces with ribs or stems, season with salt, and cook, stirring occasionally, 2 minutes. Add remaining Swiss chard and cook, stirring occasionally, until all of the chard is wilted and tender, about 2 minutes. Remove from heat.Step 5To serve, spoon reserved mushroom purée onto plates; top with Swiss chard and reserved chicken. Drizzle jus over.How would you rate Chicken With Mushroom Purée and Swiss Chard?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThis recipe is awful.  As noted by other reviewers, the proportions for the puree are all wrong and because of that, the color of the dish is so unappealing.  Readers should not need to read comments for such drastic modifications. This recipe is way too much work for such a disappointing outcome--looks NOTHING like the photo.  Deb SWashington DC3/5/2022This recipe is very flavourful all around! I will definitely be making this on the regular.\nThe purée was indeed how others described in the comments- grey in colour and thin (I used baby bella mushrooms). The simmering times were spot on, but next time i may cut back on the broth by half a cup and/or add more mushrooms. It was so delicious nevertheless!\nI skipped the stovetop brown and went straight for the oven with the chicken breasts; they got a bit dried out so next time i’ll do my normal 450 bake. The jus helped rehydrate the chicken- big thumbs up on taste.\nAnd the chard…I’ve never had chard in my life, let alone cooked it. It was really good! I let it get a bit crispy and it complimented very well.\nI served it over Liviva rice shaped shirataki and it completed the meal for me. Definitely recommend this! Jo SteinbargerSaint Paul, MN12/23/2021This is absolutely fabulous!! The mushroom purée is heavenly and could be put on anything! I used homemade chicken stock and used less stock than the recipe calls for based on comments. 10 out of 10 and I’ve made it several times.AnonymousSaint Louis 12/14/2021I loved the mushroom puree, but as others have mentioned the color is offputting and not as pictured. My husband wouldn’t touch it because of the color. Unfortunately this won’t be a new recipe in the rotation!KatieNC12/13/2021This recipe was delicious, I left out the creme fraiche and used Silk heavy cream for my lactose intolerant wife. I used button mushrooms but my puree was definitely a grey color and not the beautiful golden brown color pictured above. the taste was delicious though. My chicken was juicy with perfectly crisp skin. I will definitely be making this recipe again. Barbara Houston, TX12/6/2021The mushroom purée was absolutely delicious, but the color (even after a much longer reduction time than called for) was much lighter. Next time I would use cremini mushrooms. The dish seemed to be lacking acid, so I separated the stems and leaves on the chard and cooked the stems in an agrodolce and topped the dish with them. I think this could still use additional acid, so next time I will remove the chicken skin, fry, and toss with vinegar powder and salt. DevinDenver, CO10/31/2021I made this tonight- it did take some time to reduce. I looked at all the comments first- but decided to follow the recipe except I had 16 oz of mushrooms to add. The mushroom puree was heaven and the perfect consistency. The chicken breasts were juicy and flavorful. The swiss chard freshly picked from my garden was earthy and soft- paired really with the puree. I will definitely make this again.Karen OSalt Lake City10/17/2021This was AMAZING!  I literally wanted to lick my plate.  After reading some of the reviews I was a bit skeptical, but figured I'd test it myself.  I think the key is just to give yourself more time to reduce everything completely and trust that you know the texture/consistency that you are going for.  It's puree not soup.  If it looks like it's not reduced enough...keep going.  It probably took twice as long to reduce everything properly if not longer.  I did have a few more mushrooms than 8 oz so just went that and I didn't have crème fraiche (didn't miss it!).  Don't leave our the truffle oil.  Served with an Oregon Pinot... I think I'm having it again tonight. AnonymousPortland, OR10/17/2021This was one of the best things I’ve ever made!! Truly! I followed directions exactly and used homemade chicken broth and kale. Highly recommend. I had no issues with purée being too runny. I think you just have to really reduce it down. It made lots of purée and I cooked a third chicken breast. Fabulous! AnonymousMissouri10/11/2021Incredible flavors.  Way too much liquid to reduce.  Agree with halving the liquid (both broth and cream) in the mushrooms.  Great dish though! Will make again with modifications\nAimeeMinneapolis 10/4/2021The puree is more like a soup or thin gravy than a puree.  Double the mushrooms and use half the chicken broth.  And next time, I will use boneless breasts, since they are tough to cut coming out of the oven.Mountain GirlDenver CO9/29/2021The purée is way too soupy. Banzai JeffPortland, OR9/29/2021Explore Bon AppétitChickenPoultryMushroomVegetablechardRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Shaun Hergatt"]}