{"id": "9c9073d84d7ccdb776ef9e390384f759", "url": "https://www.bonappetit.com/recipe/cabbage-roll-casserole", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Cabbage Roll Casserole Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCabbage Roll CasseroleAll the flavors of Eastern European cabbage rolls, but without the rolling. By Asha LoupyFebruary 14, 20214.4(111)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis super-cozy bake from recipe developer Asha Loupy is inspired by classic Eastern European cabbage rolls but takes a leaf—or a layer, if you will—out of the lasagna handbook. Blanched cabbage leaves are stacked with spiced beef ragù and lemony herbed rice for a casserole that's chock-full of all the flavors of cabbage rolls, without the rolling. Asha has two tricks for the perfect cabbage roll casserole (no mushy rice or soggy bottoms here!). First, reduce the tomatoes until they reach a thick, almost paste-like consistency. This ensures that you'll get neat slices, without a runny, liquidy sauce. Second, parboil the rice (as you would for tahdig or biryani) and sprinkle it lightly between the layers. This gives the grains room to cook to fluffy perfection while baking.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron13x9\" Baking Dish$20 At AmazonLodge 7.5 Quart Enameled Cast Iron Dutch Oven$90 At Amazon8-Inch Chef's Knife$47 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketMicroplane$16 At AmazonMesh Sieve$13 At AmazonTongs$13 At AmazonCutting Board$10 At IKEAMeasuring Spoons$10 At Bon Appétit MarketLarge Bowl$18 At AmazonWooden Spoon$6 At AmazonMedium Bowl$17 At AmazonBox Grater$13 At AmazonHeavy-Duty Aluminum Foil$10 At TargetIngredients6–8 servings1large bunch dill3large garlic cloves1½lb. ground beef or plant-based meat3tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided½tsp. freshly ground black pepper3Tbsp. extra-virgin olive oil, divided, plus more for pan1large onion½tsp. crushed red pepper flakes¼tsp. ground cinnamon128-oz. can whole peeled tomatoes1large head of savoy or green cabbage1¼cups long-grain rice (such as basmati)1lemon8oz. crème fraîche8oz. low-moisture mozzarellaPreparationStep 1Heat oven to 400°. Start by prepping the beef filling. Coarsely chop 1 large bunch dill (you should get about ¾ cup), then crush and finely chop 3 large garlic cloves. Transfer a third of dill and a third of garlic to a large bowl. Add 1½ lb. ground beef or plant-based meat, 1½ tsp. Diamond Crystal or ¾ kosher salt, and ½ tsp. freshly ground black pepper and mix with your hands to incorporate. Set remaining dill and garlic aside separately.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Heat 1 Tbsp. extra-virgin olive oil in a large Dutch oven or other heavy pot over medium-high until shimmering. Add half of beef mixture, dropping into pot in small clumps. Cook, undisturbed, until deeply browned underneath, about 5 minutes (or about 3 minutes if using plant-based meat). Stir and continue to cook 1 minute (it’s okay if the meat is not fully cooked through, it’ll finish cooking in the sauce). Using a slotted spoon, transfer beef to a plate. Repeat with remaining beef mixture. Wipe out pot.Step 3While the meat is cooking, finely chop 1 large onion.Step 4Heat 2 Tbsp. extra-virgin olive oil in same pot over medium. Add onion and remaining 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt. Cook onion, stirring often with a wooden spoon, until softened and starting to turn golden, 6–8 minutes. Add ½ tsp. crushed red pepper flakes, ¼ tsp. ground cinnamon, and reserved garlic, and cook, stirring, 30 seconds.Step 5Return beef mixture to pot and add one 28-oz. can whole peeled tomatoes. Break up meat and tomatoes into smaller pieces with spoon. Add ½ cup water and bring to a simmer. Reduce heat to medium-low and cook, stirring occasionally, until most of the liquid is cooked off and mixture is just a little looser than tomato paste, 20–25 minutes.Step 6While the sauce is cooking, line a large rimmed baking sheet with kitchen towels and bring a medium pot of generously salted water to a boil. Using a paring knife, cut about 1\" deep circle around core of 1 large head of savoy or green cabbage. Remove core, then gently pull off 16–20 cabbage leaves, cutting away from core if needed. (Save any extra cabbage for another use.) Cut a small V in the bottom of each leaf, about ½\" big, to remove the thickest part of the fibrous stalk. Working in batches of 3–4 leaves at a time, cook cabbage until just pliable, 10–15 seconds. Transfer to prepared baking sheet with tongs. Pat leaves dry.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Return water to a boil, add rice, and cook, stirring occasionally, until barely al dente, about 5 minutes. Drain rice and rinse under cold running water to stop the cooking. Shake rice well to remove most of the water, then transfer to a medium bowl. Finely grate zest of 1 lemon on Microplane over rice and add reserved dill; mix well to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Rub bottom and sides of a 9x13\" baking dish with oil. Cover bottom of dish with a single layer of cabbage leaves, overlapping slightly. Set ½ cup sauce aside and spread half of remaining sauce over cabbage. Sprinkle half of rice mixture evenly over sauce. Top with another layer of cabbage leaves, then remaining half of sauce, and remaining rice. Top with a final layer of cabbage leaves.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Spread 8 oz. crème fraîche evenly over cabbage. Dollop reserved sauce on top. Grate 8 oz. low-moisture mozzarella on the large holes of a box grater and sprinkle over. Step 10Cover dish with foil and set on a large rimmed baking sheet. Bake 20 minutes. Uncover dish and increase oven temperature to 425°. Continue to bake until cheese is golden brown and bubbling, 18–20 minutes. Let cool 10 minutes before serving.Do ahead: Meat sauce can be made, rice can be parboiled, and cabbage leaves can be blanched 3 days ahead. Cover and chill separately. Assemble casserole just before baking.How would you rate Cabbage Roll Casserole?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleI made this dish last night after reading a number of the reviews, and found it to be quite tasty. Time consuming, yes, as I hadn't been able to complete any of the steps before hand. However, whether the finished product has anything to do with \"authentic\" cabbage rolls or not, the modest amount of cinnamon and red pepper flavored the meat very well (though I could hardly taste the dill and would use even more were I to make this again). My only \"beef\" (sorry about that) is with the cheese. For after mozzarella sets it is the devil to cut through for serving. I'd use almost anything but, but something that yields better to cutting--not so elastic. Even my struggles with peeling the leaves off the cabbage (I'd use the boil-the-whole-cabbage-first technique next time) didn't matter, as my pieced-together layers worked just fine. Interesting. For my taste, though, this recipe provided more of a jumping off point than something I'd make a part of my regular rotation.AnonymousReinbeck, IA3/10/2022This is a really tasty, hearty dinner! The prep did take a while, but I was able to spread it out over a couple of days, and once all the components were ready the assembly was really quick. I shredded the cabbage and let it go about 2 minutes in the boiling water, I felt like that would give me more even layers and make it easier to serve at the end. I omitted the dill because my husband doesn’t like it, but it would probably have been really nice in the dish. Did it taste like my mother-in-law’s Galumpkis? No. Was it a nice combination of similar ingredients? Absolutely! This was easy (if a bit time consuming), satisfying, a little different from our usual weeknight fare… we will be absolutely be making this again!AnnieCleveland, OH2/10/2022Okay, so I'm not Hungarian. And I've only had cabbage rolls a few times. I'm not an authority on the flavor profile. But I thought this casserole was easy to prepare, used accessible seasonings I already had at home, and tasted delicious! I used a plant-based ground protein as instructed in the recipe. I would absolutely make this again!\n\nNotes: Like someone mentioned in the comments, I might add a bit of nutmeg for extra depth next time! Unlike others in the comments, I did make this recipe as written before reviewing it.EmilyGlasgow, Scotland2/7/2022This looks like an interesting concept but I would use ground pork and left over rice and layer the cabbage on a bed of sauerkraut.  I like the relative ease of making it but I want the traditional flavors.  I have a couple of cabbages in the fridge to make sauerkraut with.  I may reserve half of one for this as an experiment.Walter MateraPortland-ish, OR2/7/2022Okay, I'm 100% Hungarian, vegetarian, AND my grandmother learned how to cook from her Hungarian MIL who didn't speak a word of English but was a test cook for Good Housekeeping — and I am also 100% not bothered by the lack of authenticity that has other folks upset. There is VERY little functional difference between crème fraîche and the sour cream we get in the proper European grocery here in CT (where we still have predominantly Polish and even Hungarian neighborhoods.) Live a little, people — expand your culinary horizons and don't be so precious about food and tradition. Part of the joy in cooking is exploration. I'm a fan of this recipe and do not mind the reference to the \"traditional\" in the headnote AT ALL!tofucatNew Haven, CT2/7/2022It is great but, if I made this and included the words, \"cabbage rolls.\" My Hungarian mother would roll over in her grave.  crème fraîche and cheese? Never.ML StonePlymouth, Michigan2/7/2022My family enjoyed it.  I used daiya cheese and sprinkled parsley and scallions on top.  We don't have to always be so strict with recipes.  Use your imagination.  That is was good cooking is all about.\nChandraHouston, TX2/7/2022Haven't tried the recipe as yet but my preliminary thoughts would be: rice and dairy just doesn't do it for me, the overhyped  risotto notwithstanding, with a nod to kheer and other puddings . Cabbage and meat in layers is what's interesting here. I'd substitute the rice with potatoes, mashed or otherwise, buttered and dilled. Some wine in the sauce. Cloves...anmole prasadindia2/7/2022I was at first intrigued by the idea of not having to roll each cabbage.  Everything in the recipe sounded great until I got to the end where it said to top with cream and cheese.  Yuck!  Cabbage, sauce and chopped meat is a fine combo.  Adding all that cheese is just gilding the lilly.  Echoing the other comments, nothing like traditional stuffed cabbage.LeenboNJ2/7/2022This is NOTHING like \"pracas\" or Eastern Euro cabbage rolls. There is no cheese in those. The cheese here is way too heavy IMHO. I'll stick to the classic way of making this dish. ShazzizNYC2/7/2022This recipe is really far removed from the Eastern European cabbage rolls I've made and eaten. Recipe is fine but not quite similar enough to warrant comparison. Anonymous2/5/2022.We found this absolutely disgusting. Still, I've loved many of the best of recipes on Bon Appetit so I'm not scared off but I really don't understand the love for this. susanbeaukingston, ontario2/5/2022First, this is delicious! It did take a considerable amount of time to prep and make. Next time I’ll probably cook the different components throughout the day. The lemon and dill with the hint of cinnamon really make this dish special. Anonymous10/12/2021Lots of work but well worth it. Don't skimp on the dill. And the creme fraiche added such a richness, I definitely recommend going out of your way and getting it, versus substituting with sour cream.AnonymousPhiladelphia7/5/2021Worst thing I ever put in my mouth!\nRidiculously time consuming to make.\nOur family loves cabbage rolls,  but they mutinied at dinner, refusing to eat it.\nWaste of time and money!Vicki CRedondo Beach,  CA3/20/2021Explore Bon AppétitCasseroleEastern EuropeanEuropeanGround BeefBeefMeatGreen CabbageCabbageLeafy GreensVegetableSavoy CabbageCanned TomatoTomatoRiceRice & GrainsMainGluten-FreeNut-FreeFryDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-14", "author": ["Condé Nast", "Asha Loupy"]}