{"id": "9c9cefbac809608acd8af4465c8812d8", "url": "https://www.bonappetit.com/story/cougar-gold-cheddar-cheese", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "I'm Here to Highly Recommend Canned Cougar Gold Cheese | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m Here to Highly Recommend Canned Cheese Seriously. It’s cheese in a can. And it’s great. By Jessica KellyJanuary 14, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There are a lot of things that come in a can. You can get a loaf of bread, a cheeseburger, a “whole chicken“ (if you can count it as such, because it comes out all butchered and congealed), rattlesnake, and more. There was even a company called GAME that created Christmas Tinner, which is a nine-course holiday meal in a can. Needless to say, that did not take off. One item I can safely say I never thought I’d find is canned cheddar cheese, but here we are. I found a canned cheddar cheese. It’s called Cougar Gold Cheddar Cheese. And it’s absolutely incredible. Turns out, I’m not the only one who thinks so. After going down a Cougar rabbit hole, I learned that this cheese is made at Washington State University Creamery and has quite the cult following. (I found out later that it is, in fact, not the only canned cheese out there with a die-hard base: I see you Amul!) The Gold Cheddar makes up the majority of their cheese sales, and happy buyers rave about the flavor and texture. So I bought myself a gigantic 30 oz. can—which is the baseline portion—and impatiently waited for its arrival.When it did show up—in a room temperature box; it’s shelf stable, of course!—I cracked that baby open the second I got my hands on it. Loyal fans say the cheese just gets better with age, but I just couldn’t wait. (Pop it in the fridge if you’re not going to immediately eat it. The chill helps the cheese maintain its shape and texture, while keeping the whey and curd from separating.) At first it looked a little dry and crumbly for my liking. I assumed it would taste very salty and maybe even slightly gritty, a far cry from the smooth, sharp, tangy cheddars I love. I thought wrong. Once I popped a piece in my mouth, it started to melt a bit, creating a creamy, silky texture, with a nice sharpness to it. It was one of the best cheddars I’d ever had. It even excelled melted in macaroni and cheese, coating all my spiral noodles in a tangy, decadent finish. And, yes, it’s from a can. A can! Both shocked and pleased, I am 100% a card-carrying member of the Cougar cult now. And I think you should be, too.Cougar Gold Cheddar Cheese$25 at Washington State University$45 at Compass WinesExplore Bon AppétitHighly RecommendShoppingCheddarRead MorecultureI Accept Amul Cheese Exactly As It Is: Canned, Processed, and PerfectBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-14", "author": ["Condé Nast", "Jessica Kelly"]}