{"id": "9c9d193225e27476f518044f8ae9d1dd", "url": "https://www.bonappetit.com/story/dinner-15-minutes-prosciutto", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "This Dinner Takes 15 Minutes to Make and Uses Lots of Prosciutto | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Dinner Takes 15 Minutes to Make and Uses Lots of ProsciuttoOne pan. Less than 10 ingredients. You got this.By Rachel KartenFebruary 27, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailThis recipe is so easy you could make it with your eyes closed. But, you know what? It’s VERY DANGEROUS to cook with your eyes closed. And people should really stop describing recipes this way. So, how about this: This recipe is so easy you could make it with your eyes open but, like, just-woke-up, sort-of-groggy open. You only use one pan. There’s less than 10 ingredients. And it comes together in only 15 minutes. Alright, let’s do this.One-Skillet Creamy Chickpeas with Eggs and ProsciuttoChickpeas in a spicy tomato-cream bath are what you need on a weeknight.View RecipeFirst, throw a sprig of rosemary and thinly-sliced garlic in hot oil. (Very cool way to make your kitchen smell like a Diptyque candle.) When the rosemary gets crisp (but not brown) remove it and set aside on a plate. Keep the garlic going for about two minutes. Next, add in the chickpeas, tomato paste, and paprika. Stir, stir, stir for one minute. Then add in one cup of heavy cream—record scratch freeze frame—yep, there’s a lot of cream going in here but if you don’t use all of it you will regret it. Okay, back to the recipe.Once you’ve got a simmering tomato jacuzzi going on, drop your eggs in, season with salt, and cover. Hot tip: if you don’t have a matching lid, use a baking sheet. Improv stresses me out... except when it’s in the kitchen. When the white parts of your eggs are set but the yolks are still runny (this took about three minutes for me), remove the pan from heat. You’re almost done.Now this is my favorite recipe instruction. “Drape prosciutto around eggs.” Wow. Will do. And if you’re like me, you’ll spend an inordinate amount of time trying to get really pretty ripples and folds (it’s called fashion sweetie, look it up!). Finally, crumble your crispy rosemary on top of everything and sprinkle with sea salt and pepper. Alright, you’re ready. Or are you? For a real standing-ovation finale, serve this with some flatbread. I bought naan and then warmed it up over a burner to get some extra char. You’re going to want this for Sopping Purposes later. And that’s it! Easy, right? Just please make it with your eyes open.Get the recipe: One-Skillet Creamy Chickpeas with Eggs and ProsciuttoExplore Bon AppétitProsciuttoEggDinnerWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-27", "author": ["Condé Nast", "Rachel Karten"]}