{"id": "9cb9d96dce710eaec535866b51367baa", "url": "https://www.bonappetit.com/story/cranberry-linzer-tart", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Make This Cranberry Linzer Tart and Get Lots of Compliments | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake This Cranberry Linzer Tart if You Want Lots of ComplimentsBonus: You get to cover your lattice mistakes in powdered sugar.By Rachel KartenNovember 15, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmail“The crust is sooooooo good!”“I like the way that the powdered sugar looks like a snowman sneezed on it.”“The cranberries are really tart and make you pucker. Which is nice because it’s not too sweet.”“You made this????’“TART FOR BREAKFAST!!!!!”These are all real things that my coworkers said to me (no cash incentive!) after I made Claire Saffitz’s new recipe for cranberry linzer tart. In all my years of baking, never have I received so many compliments. And I have to admit, the tart was awesome. The cranberry filling is just sweet enough. And the super-buttery, crumbly walnut crust is what a graham cracker aspires to be. But it wasn’t all rainbows and butter pats. This recipe is a bit of a project, and there are some key lessons I learned when making it. And because I’m the generous type, I’m going to share them with you.First, let’s talk filling. Making the tart-sweet cranberry inside is probably the easiest part of the recipe (and can be done three days ahead!). You simply bring cranberries (I used frozen), sugar, ginger, butter, and salt to a boil. And stir a TON. Like, I didn’t stop stirring because I was so afraid of scorching it. This paid off/counts as a good arm workout. Do it. You then add some lemon zest and store it all in the fridge until you’re ready to assemble le tart.The tart filling is surprisingly easy to make.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiNext, the dough. Like I mentioned earlier, the crust has a crumbly/graham cracker vibe, so don’t be alarmed if it doesn’t look like your typical pie dough. And, let me tell you, it’s packed with FaLl vIbEs. We’re talking toasted walnuts, cinnamon, cloves, and nutmeg. The best part? It’s a Pulse Crust. Is that a thing? Not sure. But essentially you dump all the ingredients into a food processor and pulse until a dough forms around the blade. Pretty genius. Just, uh, make sure your 14 TABLESPOONS of butter are nice and cold when you put them into the food processor. Mine were on the warmer side and instead of breaking up into “pea-sized pieces,” the butter just sort of melted. Noted for next time. Press half the dough into your tart pan, wrap the rest in plastic wrap and roll into a disk. Chill.Finally, the lattice. Look, I’ll be honest and share with you another thing that a coworker said to me: “You kind of messed up the lattice. That’s not a real lattice.” Critique courtesy of the one and only Adam Rapoport. But, here’s the thing that Adam forgot: Claire specifically says in the recipe that this is a “weave-what-you-will lattice,” calling out how delicate the dough is and that you won’t be able to over-under-over-under the whole thing. So when you’re rolling out your dough, keep this in mind. It might crack. It might get a little crumbly. It’s going to be okay. Next time I will probably chill my dough a liiiiittle longer, and also care a little less if it cracks in the process of latticing. Because guess what? You cover up all those mistakes with powdered sugar later on! Anyway, brush egg wash on your tart then pop it in the oven for around 45 minutes.Don’t get too hung up on the perfect lattice. You’re covering it with powdered sugar later.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiAnd the assembly. Here’s a fun trick that Carla Lalli Music taught me about getting the ring off the pan: Set the tart on a bowl that’s smaller than the pan, and then gently pull the ring down. You’ll be left with your tart balancing gracefully on the bowl. Genius! Oh, and if you find that it’s sticking to the ring after coming to room temp, pop it back in the oven for five minutes. This will help heat up the butter in the crust, making it so the ring slides right off. Once that’s done, dust your tart with powdered sugar, taking care to hide every single crack in your crust.Then, of course, you post your beautiful tart on Instagram. Oh yeah, there’s one more comment I left out. “She is PERFECT,” noted by none other than Claire herself.Get the recipe:Cranberry Linzer TartInside two layers of buttery, crumbly walnut crust hides a tart cranberry filling.View RecipeExplore Bon AppétitThanksgivingholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Rachel Karten"]}