{"id": "9cbb071492fcb433818d00c7806238e0", "url": "https://www.bonappetit.com/story/roasted-tomato-cashew-salsa-party-time", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "I Bring This Homemade Salsa to Every Party, Then Eat It Alone in a Corner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Bring This Salsa to Every Party, Then Eat It Alone in a CornerIt's 157% better than the jarred stuff, and it's always a party sensation—when I share.By Alex BeggsFebruary 2, 2018FacebookTwitterEmailLinda XiaoFacebookTwitterEmailWelcome to Never Fail, a semi-regular column where we wax poetic about the recipes that never, ever let us down. This week: the homemade salsa recipe that BA.com senior editor Alex Beggs couldn’t live without.There was a time for me when “homemade salsa” meant actually going to the trouble of transferring the contents of the Tostitos jar to a bowl. (Give me a break, my frontal lobe wasn’t fully developed!) Growing up, our family parties came with homework assignments: everyone had to bring a very specific thing. Store-bought bread, cheese, plastic-wrapped pies. But my eyes widened when the aunt (I have like 17 aunts) who was in charge of chips, showed up with a can of Fritos’ bean dip and a jar of rubbery queso.I’d dip chip after chip in what is essentially cold refried beans and a million preservatives, plus “cheese product,” and then (probably) single-handedly powered the hot tub. 🙄I’ve come a long way since then. I’ve learned how low-key easy it really is to make homemade refried beans if you have time and lard; I’ve nailed Velveeta-less queso. But my real party trick is this homemade salsa. It’s sensational. And no, I don’t really eat it in a corner alone; I share. And people go crazy for it.The salsa in question is a roasted tomato and cashew salsa from our carnitas party menu, and it’s packed with brilliance. It comes out a beautiful deep mahogany color from using REAL dried chiles. The little pieces of roasted cashew offset the heat and give it amazing texture. The tomatoes get roasted, which brings out the tomatoes’ true flavors, usually hidden in all of its watery seedy guts. This salsa is about concentrated flavor. It’s so far from the jarred stuff, which taste like mushy cold tomatoes and raw onion in comparison. So. Far.At first, this all sounds kinda high maintenance. Roasted? Who has the time? But you do, trust me. I’ve probably made this 10 times in the past year.I've made the carnitas that go with this salsa, too—they're PERFECT IN EVERY WAY.\nLinda XiaoFirst things first: Get over any qualms you have about dried chiles. If you've got a stash of pasilla chiles in your pantry, you can ignore this, but for the rest of you, these should be a staple in your kitchen like canned beans and weed-in-an-old-tea-tin are. Dried chiles last nearly forever, and also you will be making a lot of salsa from now on. You can find them in nearly every grocery store, and online, too.Guajillo chiles—great for this salsa.\nTom SchierlitzFor this recipe, brought to us by the wonderful Rick Martinez, you’ll need 6 dried cascabel chiles or 3 pasilla chiles (seeds removed, chillll), plus 2 morita chiles. Pasilla, these huge honkers, are easier to find for me, so I just go with those, but I’ve also used guajillo or ancho depending on what my pantry stash is like. Morita are small, squat, wrinkly little fellas, and can be tough to find, but I’ve used dried chipotle—per the Food Substitution Bible, they’re both smoky—in a pinch. TBH it’s hard to mess this up. I’m probably making this sound like a super spicy salsa, but it’s not a face melter—more of a subtle heat that keeps you coming back, not the kind that makes you sweat and do the rosary.All you do is throw the chiles on a cookie sheet and roast them for 5 minutes at 350°. It wakes them up and activates all the flavor oils or whatever. You throw some cashews on another cookie sheet and roast those until toasty golden, like 10 minutes. (DON’T LET THEM BURN. FOR THE LOVE OF GOD, DON’T LET THEM BURN.)After the nuts and chiles are out of the oven, it’s the tomatoes’ turn. Ramp up the oven to 450° and put 4 large, cored tomatoes on a rimmed baking sheet/casserole thing for 35-ish minutes, until their skin is browned. (Sometimes I do this step before the chiles and cashews so that they can cool a little before blend time.)BLEND TIME.First you blend only the tomatoes with garlic, lime, and salt. Then you add the chiles, stems removed, and blend a lil more. And finally, toss in the cashews—but only for like 5 pulses. You want tiny cashew bites in the salsa, not a smooth purée of flavor-blasted baby food. Taste, add some salt, and taste again. Then refrigerate it until party time. And get ready to be asked to make it again. And again. And again.Get the recipe:Roasted Tomato–Cashew SalsaView RecipeExplore Bon AppétitSalsaCashewSuper BowlPartyTomatoDipNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-02", "author": ["Condé Nast", "Alex Beggs"]}