{"id": "9cc43c2a341bd6b9f415bbd09d3f3d60", "url": "https://www.bonappetit.com/story/never-fail-sausage-and-cabbage-stir-fry", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "All Roads Lead to This Sausage and Cabbage Stir-Fry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll Roads Lead to This Sausage and Cabbage Stir-FryThe lightning-fast weeknight dinner that doubles as meal prep—and is another great excuse to stuff things into tortillas.By Alyse WhitneyOctober 26, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.When I wander around a grocery store after work, aimlessly trying to figure out a simple weeknight dinner, it feels like there’s a honing signal guiding me to ground meat.I know that doesn’t sound immediately appetizing—ground meat needs a rebranding!—but it’s a guaranteed quick-cooking, versatile purchase that can be formed into meatballs, smashed into crispy larb, or stir-fried with any vegetables (and/or noodles!) that I’m in the mood for.Lately, my go-to has been a one-skillet wonder of stir-fried sausage, cabbage, mushrooms, and chives, all stuffed into warm flour tortillas. It comes together in less than 30 minutes and reheats like a dream for meal prep. Win-win.The recipe calls for hot Italian sausage, but I’ve made this with mild sausage or a pound of ground pork to equally wonderful results. The clutch trick is grating garlic and ginger right into the meat mixture so it is flavored throughout before it gets all crisp in the pan. (It’s important to let it sit and sear for 6–8 minutes so it gets super brown instead of gray and sad!)Make sure ground meat is super crispy before you flip it over!\nPhoto by Alex LauOut goes the meat and in goes sliced shiitake mushrooms, which get crispy and tender in the residual pork fat, and a ton of cabbage. Six cups! I use two bags of the pre-shredded green cabbage from Trader Joe’s because I’m lazy, but Napa cabbage—the one called for in the recipe—has a sweeter, milder flavor, and is worth seeking out if you’re not lazy like me.ooo cranberries\nPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEqual parts soy sauce and unseasoned rice wine vinegar coat everything in the skillet and turn into a simple-yet-flavorful sauce. You are supposed to toss in half the cabbage to wilt and then put the rest in raw so it’s still crisp-tender, but I prefer it all to be tender and incorporated with the sauce, which sometimes means adding a little more soy and vinegar before finishing with chives, a drizzle of sesame oil, and sprinkle of sesame seeds for a mildly garlicky, nutty finish.Now is the best part: wrapping it all up! If you can find mu-shu wraps at your local Asian grocer, that’s ideal to make this like mu-shu pork, but if not, flour tortillas are a nice, pillowy wrapper for the tender, deeply flavorful, saucy meat and veg. Spread a warmed tortilla—I like Trader Joe’s handmade white tortillas, which are nice and chewy—with hoisin sauce and Sriracha to taste, nestle the meat mixture in, roll it like a taquito, and take a big ol’ bite.Eat this over a plate, because you’ll inevitably spill some of the mixture, and make a pot of rice if you’re making this for meal prep. And hey, you only have one skillet to wash, since everything happened in one pan, and you have plenty of time to lie horizontal on the couch for the rest of the night. You’re welcome.Get the Recipe:One-Skillet Hot Sausage and Cabbage Stir-Fry with ChivesSauté hot Italian sausage meat with ginger and garlic, mix with veg, and dinner’s a wrap!View RecipeExplore Bon AppétitBasicallyStir-FryPorkSausageCabbageOyster MushroomsMushroomSoy SauceRice VinegarNever FailRead MorecookingThese Crispy Meatballs Are My New Weeknight Secret WeaponBy Aliza AbarbanelcookingHow to Make Meatballs That Are Tender, Juicy, and Delicious Every TimeBy Alex DelanycookingLarb Is the I-Had-a-Bad-Day Weeknight Dinner You NeedBy Carey PoliscookingHow to Brown Meat So It's Actually, You Know, BrownBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-26", "author": ["Condé Nast", "Alyse Whitney"]}