{"id": "9ce97014ce495f0c1c26bf59b3b49928", "url": "https://www.bonappetit.com/story/tiffany-hall-empower-cocktails", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "How Tiffany Hall Turned Empower Cocktails Into a Less-Than-Risky Business | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Tiffany Hall Turned her Cocktail Company Into a Less-Than-Risky BusinessHall, both a lawyer and the founder of Empower Cocktails, explains why “don't quit your day job” is sometimes the best advice for entrepreneurs.By Tiffany Hall, as told to Jen MarshallFebruary 22, 2021FacebookTwitterEmailPhoto by Traivs RaineyFacebookTwitterEmailThis story is from 13 Ways to Launch the Food Business of Your Dreams, where women entrepreneurs share their experiences and best advice on turning a passion for food into a career.When I worked for a major alcohol brand back in 2013, I noticed that men overwhelmingly dominated the industry. From conglomerates to craft breweries, there’s often only one woman in the room. Or none! And yet women purchase and consume almost as much alcohol as men. So I knew I wanted to create a product for women, one that’s as easy to drink as wine. Just chill and serve. But here’s the thing: I did it without quitting my day job. I still work full-time as a corporate lawyer. Because there are financial realities to living in New York City. And even with a great product, it can take time to see a financial return. By 2015, Empower Cocktails’ first drink was on store shelves: a Cosmopolitan Martini made from sweet potato vodka, white cranberry, triple sec, and lime. As for the name, I always thought it would feel fantastic to walk into a bar and order “a glass of empower.” Six years later, I still feel the magic when I see the bottle on shelves.Tiffany’s Best AdvicePick a path that works for you. People stereotype successful entrepreneurs: put everything in, risk it all, don’t look back. But you don’t have to do it that way. I still work full-time as a corporate lawyer. I have a number of aspirations, and Empower Cocktails is one of them. My entrepreneur journey has been beneficial to my corporate journey and vice versa. I make better decisions in both places.Get specific about costs. How much money you need to get started varies wildly. Research to get specific numbers for your product. Lawyer fees, shipping costs, marketing. Someone to manufacture your product. You might have to buy bottle caps and labels. Or boxes. This gets costly fast. Know that production houses of all kinds have minimums. You can’t say “can you make just 10 bottles of something so I can test it out.”Your network is gold. Your own personal and professional network is your most valuable resource. These are people who will be helpful to you at no cost. Find out what and who they know.Don’t be afraid of feedback. You can’t create a product with mass appeal all on your own. If you’re doing it all by yourself and taking no one else’s feedback into account, that’s called a hobby.Savor and share your success. Channel all your good feelings back to your customers. Positive engagement matters, and it’s exciting for people to meet a female founder. Women sip my cosmos and ask who I work for. Their eyes light up when I say “myself.”Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-18", "author": ["Condé Nast", "Tiffany Hall", "As Told To Jen Marshall"]}