{"id": "9ceeeb7618cc18ccf95bf03d1cc9b670", "url": "https://www.bonappetit.com/story/tip-your-hairdresser", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "I Let My Husband Cut My Bangs, But I Still Tip My Hairdresser | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusI Let My Husband Cut My Bangs, But I Still Tip My HairdresserI miss my monthly ritual with Ming, but I'm keeping one part of it alive. By Elyse InamineMay 19, 2020FacebookTwitterEmailIllustration by Tess Smith-RobertsFacebookTwitterEmailFor years, my husband jokingly pleaded for a chance to cut my bangs, mainly to annoy me but also because he was “curious.” I just rolled my eyes. I would never let my husband near my bangs; I didn’t even dare to trim them on my own. The only person who is allowed to touch my bangs is Ming, my hairdresser. Ming has been cutting my hair at Tease in the East Village since I first came to New York City as a college student with thick, wavy, Okinawan hair. He looks like Jack Skellington: tall, elegantly gangly, and donning steampunk-lite attire (always black, always pointy-toed boots). He moves with grace and fluidity as he works, pulling out different scissors and combs, round brushes and hair dryers to sculpt my hair into the usual Zooey Deschanel-ish coif.Then, of course, came coronavirus. As the days grew long and untenable, so did my fringe, swaying hard to the left like I was the lead singer of an emo band. Late one night, I gave in. We spread out old newspapers on the floor, plopped a dining table chair in front of our full-length mirror, and grabbed a pair of office scissors. (I didn’t want to splurge on actual hair scissors because I’m cheap but also because I didn’t want to accept this was really happening.) I sat on the chair, waiting and watching, as my husband’s glee melted into stress. He realized that he was trespassing on holy ground: my perfect blunt bangs.I’ve been a bangs girl since before I could even make the decision to be one. Like other Asian moms, mine defaulted to giving my sister and me bangs and my brother bowl cuts. I flirted with bangs throughout college, letting them grow out and inevitably cutting them again, but a few years ago I embraced my bangs-girl identity.Ever since I recommitted to bangs in my adult years, Ming sternly told me not to trim them myself, to just come to him. I listened, squeezing in monthly 15-minute touch-ups on lazy Sunday afternoons or weekday evenings before dinner reservations. A sign by Tease’s entrance advertises trims for $15 a pop, but he never lets me pay for them. Still, I always do this weird dance once he’s finished, like how Asian parents fight over paying the bill at restaurants. I ask the bored-looking woman at the counter how much it cost, giving Ming a chance to rescind the offer. She slowly lifts her eyes from her phone, glances over at the computer, and mumbles that it’s taken care of. I act surprised with each transaction of unmerited kindness, then shout thanks to Ming. Before I head out, I linger at the door for a bit, smoothing out my fresh, silky bangs, and pull up Venmo on my phone to tip Ming five bucks.I stared at my husband through the mirror as he nervously began snipping at my bangs. He was terrified of chopping off too much—“YouTube says that is the most common mistake,” he told me after I told him to watch said tutorials. He trimmed a millimeter of hair. After meticulously evening out my bangs, he realized he wasn’t cutting enough hair to actually get it out of my eyes. So he went back and did it all over again. As he cut, he accidentally dug the dull side of the scissors into my eye lids, so my eyes puckered open, and blew away stray hairs on my face with his own breath, which was not cute. “Ming uses a blow dryer!” I scolded him. I didn’t realize I had been thinking about Ming the whole time, how he confidently sectioned off my bangs and went at it and banished away snippets of hair with the blow dryer on low so it didn’t burn me. I wondered how Ming was doing, and if Tease would reopen when this was all over. I had no way of knowing.Strangely enough, Ming is one of my longest relationships in New York, outlasting friendships forged through crazy media jobs or struck up at church. We never talk much. He’s not the chatty hairdresser type. I let him do his thing and he lets me do mine, which is a lot of reading, Redditing, and zoning out. Ming isn’t my friend, but he is my person, someone who cares for me in a very specific and seemingly unextraordinary way. Our unspoken bond rests on deep comfort, that we don’t feel the need to entertain each other with the impressive and productive bits of our lives, and an unshakeable loyalty. I’ll follow Ming as Tease inevitably moves every couple of years, and he’ll cut my bangs exactly the way I like it.A lot of us have these people: the dog walker who your pup actually likes, the manicurist who doesn’t judge the state of your cuticles, the hairdresser who asks so little but gives so much. Maybe you’re thinking about them, too. It’s hard to imagine what they’re going through. They might have spent hours on the phone just to finish their unemployment application, and are now waiting for those checks to actually come through. If they’re here on a visa, they may feel like they’re in limbo, wondering if they can stay or if they’ll be forced out; or if they’re undocumented, they may be scraping by on whatever they have saved, laying low without hope of any government aid. They may be wondering when their states or cities will officially reopen and, when then they do, if their job will still be there. They may be concerned if they’ll be left on their own to figure out new health protocols and to procure protective gear for themselves. They might feel forced to go back to work, feeling the full weight of the risk but even more the burden of providing for themselves or for their family during a crisis. They may feel at the mercy of their landlords, their bosses, their customers storming city halls to demand their service. They may feel frustrated—suddenly deemed essential to work in this pandemic, whether it’s in a grocery store or a nail salon, but not essential enough for there to be any safety net in place to care for them or their family if they fall ill. They might feel like they’re falling into the cracks already widened by COVID-19 and swallowed up by this broken system that can’t function without them. I thought Ming must be going through some of this.After I rubbed all the itchy, hairy shrapnel off my face, tossed the newspaper, and vacuumed random hairs, I realized I do have a way to talk to Ming. Venmo. I checked my bangs and sent a $5 tip to Ming. I told him that my husband now has to cut my bangs, and that I hoped he was doing okay. He responded immediately, saying he was fine and thanks, with three toothy smiley faces. I know it’s not much, but it felt nice to resume our extremely small small talk and fall back into that familiar little dance.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureThis Korean Cooking Facebook Group Makes Me Feel Less AloneBy Eric KimRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-19", "author": ["Condé Nast", "Elyse Inamine"]}