{"id": "9cf5fd37efad11594ba70bc1588a822a", "url": "https://www.bonappetit.com/story/alcohol-you-need-to-refrigerate", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "The Types of Alcohol That You Need to Refrigerate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Bar Cart Looks Cute, but These Bottles of Alcohol Should Be in the FridgeThat vermouth from 2017 has gotta go.By Alyse Whitney and Antara SinhaMarch 5, 2022FacebookTwitterEmailPhoto by Danny KimFacebookTwitterEmailIf you’re someone who appreciates a great homemade cocktail now and then (hey, we’re fans too), you’ve likely got a couple of bottles of booze in your freezer, a few on your bar cart, and are iffy on where to store the rest. Can alcohol go bad? What types of alcohol do you need to refrigerate? What’s the shelf life of that bottle of vermouth? We’re here to answer your questions and assuage your fears of alcohol spoilage with some professional advice.We chatted with Meaghan Montagano, beverage manager at NYC’s Nat’s on Bank, and John deBary, author of Drink What You Want, to find out how to store liquor, what alcohol you need to refrigerate—and ways to use it up more quickly. (Hint: It involves more drinking. A hardship.)Making a Manhattan? Listen up!\nPeden & MunkWhat types of alcohol do you not need to refrigerate?DeBary puts his alcohol into two categories: If it’s processed through timed fermentation—think vermouth, sherry, or other wine-based booze—an open bottle will likely benefit from being stored in the fridge (more on this below!). But if it’s distilled (think gin, vodka, and other base spirits that you would consider “hard liquor”), it’s already gone through a process that relies on big temperature fluctuations and likely okay stored at room temperature. These spirits have a super high alcohol content that will protect them from oxidation or from developing any funky flavors (especially if they’re unopened).But this is not permission to store them year-round on top of your radiator or on your windowsill in the sunlight. As a general rule of thumb, you’ll want to store your bottles of liquor—even the ones with the highest alcohol content—in a cool, dark place, like a designated liquor cabinet away from direct sunlight or drastic temperature fluctuations. You don’t need to go so far as to store base spirits in your freezer—but it’s a great option if you prefer to serve them chilled (and are running out of room on your bar cart).What types of alcohol do you need to refrigerate?If you’ve ever left a bottle of re-corked wine on the counter for over a week, you know the despair of musty-smelling, funky-tasting booze. While you likely won’t get sick from taking a few sips of an open bottle of wine that’s been on the counter for a week, it definitely won’t taste its best.“It’s not undrinkable, or like you’ve committed some huge crime against the gods of beverages,” deBary says. “It’s more about the level of freshness you want to work with.” If you’re investing in a top-shelf vermouth, for example, you want to make it last for as many cocktails as you can.So how do you know what deserves your precious fridge space? If you’re having trouble discerning between liquor that’s been distilled versus booze that’s been processed through timed fermentation, Montagano suggests a helpful blanket rule: If your booze is wine-based, or has under 15% alcohol, it’s worth keeping in the fridge. Here are some more specific guidelines for the common types of alcohol you may have on hand for sipping or spiking.VermouthThere should be an extra step when making a Manhattan: Once you’re done mixing up your drink, put the vermouth in the fridge. Oxygen hits the liquid immediately after the bottle is opened. Whether it’s dry vermouth (maybe you’re making a Fifty-Fifty Martini), sweet red vermouth (for negronis), or the in-between bianco (for a new twist on a negroni), it needs to go in the fridge—where it won’t last longer than a few months. (Montagano notes that the sweeter reds will last a little longer, but not much.)A great negroni deserves fresh vermouth.\nPhoto by Chelsie Craig“If you go to a dive bar and there’s Martini & Rossi on the bar, you know your negroni will be trash,” she adds. To know whether something has gone bad, be sure to taste a sip when you first open the bottle. It should be bright and complex. As it oxidizes, it will be flat and dull, and when it’s really bad, it could smell like a wet dog. This rule applies to any wine-based product.Sherry and PortOnce you open a bottle of Sherry or port, keep it cold. While they are fortified to a slightly higher alcohol content than vermouth, they’re still volatile and spoil more quickly than you might think. Some bottles—like Pedro Ximenez, a hearty, sweet dessert sherry—could go for a couple of months, while other, more delicate varieties, like Fino, could spoil after a week. Montagano’s suggestion? Shop in small bottles—like 375 ml—so that you won’t let any go to waste.Use up extra sherry with this tonic.\nChristopher TestaniMarsala and MadeiraIf you have a little Marsala or Madeira wine as an after-dinner drink, tuck it away in the fridge afterward. But If you’re planning on cooking with it (as in, you don’t require peak freshness for, say, chicken Marsala), you have a little wiggle room to let it sit for a month or two in the fridge. “The alcohol component is broken down and reduced, so as long as it isn't completely oxidized, cooking with it is probably fine,” Montagano explains. The flavor just won’t be as bright. (The same rule applies to that bottle of white wine sitting in the fridge for a few weeks—use it for clam sauce if it hasn’t turned!)Aperitifs Like Lillet, Cocchi Americano, and CampariBecause many aperitifs are wine-based or have more delicate herbal flavors, they all benefit from having a home in the fridge. French Lillet is a smoother floral, citrusy aperitif that you can drink on its own or in a Bond-approved Vesper martini. Lillet Rouge (red) will last the longest—up to a month refrigerated—while the Blanc and Rosé styles will only go for a few weeks in the fridge. Italian Cocchi Americano is Moscato-based aperitif wine that pairs well with club soda and orange. (Cocchi Rosa, the red-wine-based aperitif, will last longer than the white varietal.) And to preserve the flavor of fruity, botanical Campari, tuck it in the fridge if you don’t finish that open bottle within a couple of days.Cream LiqueurIt’s actually not necessary to keep this refrigerated, says deBary, because of the ways it’s processed and its alcohol content of 20%. “Given the combination of alcohol and sugar content, it’s pretty stable and it’s probably not going to oxidize.”Now that your fridge is full of aperitifs and fortified wines, don’t use them only for cocktails—try a glass on the rocks with a twist of citrus. Low-ABV drinks are ideal for day-drinking, and if you’d rather go big, punches or sangria are good places to use your alcohol when it’s just starting to turn. Oh, look, here’s an idea for all that sweet vermouth:Apple Cider and Rum PunchThink of this as a house punch that's a snap to make and relatively low in alcohol. Hard ciders can range from bone-dry to rather sweet, so take a sip and adjust the simple syrup if needed.View RecipeEditor’s note: This story has been updated by Antara Sinha since it was originally published in April 2017.Explore Bon AppétitAlcohol & Other DrinksLiquorRead MorecultureThe 4 Types of Gin and What They Even AreBy Alex BeggscultureSo, What Exactly Is Natural Wine?By Belle Cushing and Marissa A. RosscultureThese 7 Tips Will Improve Every Cocktail You MakeBy Andrew KnowltonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-26", "author": ["Condé Nast", "Alyse Whitney", "Antara Sinha", "Marissa A. Ross"]}