{"id": "9d0ea3ece8e3c35a4a34e7f9904ed0ef", "url": "https://www.bonappetit.com/story/coffee-bar-trend", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "How Coffee Shops Became the Best Places to Drink Wine, Beer, and Cocktails | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Hybrid Coffee Shop–Wine Bar Is My Favorite Place to Drink Right NowCome in the morning for the espresso. Stay all night for the biodynamic rosé.By Alex DelanyMarch 6, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailSome might say I spend too much time in coffee shops. And others might argue I spend too much time in bars. Whether or not they’re right, I’m happy to say that I’ll be cutting my time in half. Why? How? Not because I’ll be drinking fewer cortados or saisons, but because local beers, natural wines, and dialed-in cocktails are cropping up all over coffee shop menus. The espresso joints I already love are turning into my favorite places to grab a drink at night.It used to be that you’d spend about six minutes in a coffee shop. Enter. Order. Pay. Add your cream or sugar (or just leave it black!). And get the hell out. But that was when coffee shops were places that sold coffee and not much else. Now that you can grab a drink that’s as good as the specialty coffee you’re drinking, there’s not much reason to leave.And it makes sense that groovy alcoholic drinks are showing up on coffee shop menus. The commitment to quality booze mirrors the terroir-driven coffees sold at third-wave coffee joints, so it’s no surprise that those who put care into choosing organic Kenyan coffee are geeking out over biodynamic Riesling. But it’s also about the money. “Having high alcohol margins allows us to keep our coffee affordable and get customers in the door more than once a day,” says Andrew Trautman, one of the owners of Remedy House in Buffalo.And it works. On my last visit, I remember entering the shop, seeing the wall of amaro and liquor, tasting my cortado, and thinking, “Yeah, I’ll be back for a cocktail tonight.”Sure, I could go to a bar, but at Remedy House there’s no bouncer. No television. No shouting. Just a chill vibe and a fantastic drinks menu in a beautiful corner space. This is the new breed of coffee shop. Actually, let’s call them coffee bars. Here are a few that are nailing the dual identity across the country, and what to order once you get there.The snacks at Remedy House make it easy to stay all day.\nPhoto by Laura MurrayRemedy House - Buffalo, NYYeah, let’s start with Remedy house, because this place absolutely rules. The espresso drinks are exceptional, made with beans from a rotating list of roasters, and whether you want a cocktail or a glass of wine, beer, or amaro, you’ll get a good one here. The wine list features local natural winemakers like Liten Buffel, as well as bottles from places farther afield, including France and Slovenia. The beer list is constantly changing and filled with New York craft brewers. And the spritzes coming from behind the bar are always in-season, even with a couple feet of Buffalo snow.Plus, we love Methodical’s mugs.\nPhoto by Rinne AllenMethodical - Greenville, SCI was in Greenville before Methodical started serving wine, and it was still my favorite spot in town. The in-house roasted beans are bright and fruity, and the pastries from Bake Room are some of the best I’ve had anywhere. (Get the morning bun.) But as of late last year, they’ve started to serve a small list of killer natural wines from producers like Broc Cellars. Go in the early afternoon. Get a coffee. Bask in the natural light. Sip your pet-nat. And keep doing that until they kick you out.Like I said, A+ local espresso at W/N W/N.\nPhoto by Jason VarneyW/N W/N - Philadelphia, PAPhilly’s W/N W/N Coffee bar is a bit different than any of the other shops on this list. They open at 4 p.m., stay open until 2 am. and they have a Detroit-style pizza pop-up in the back of the bar. But they do serve A+ local espresso from roasters like Elixr, and their cocktail program is damn good. Grabbing a drink with house-made bitters or house-fermented tepache is always a good call, but I’m a sucker for their amaro list. Ask the bartender what’s poppin’, and grab a glass of the good stuff with a single ice cube.It’s pretty much always Tiki time at Either/Or.\nPhoto by David AlvaradoEither/Or - Portland, ORTiki Drinks and coffee? Maybe not a logical combo for most, but for the folks at Either/Or, it was a no brainer. The name might make you think that you have to opt for one or the other, but you can have your cake and drink it too. The bartenders have created a bunch of cocktails that involve coffee brewed at the shop, and once you get a taste for the crossover event of the century, you won’t be able to get it out of your mind.Intermezzo, the pride and joy of St. Petersburg, Florida.\nPhoto Courtesy of IntermezzoIntermezzo - St. Petersburg, FLYou know this coffee-bar phenomenon is real, because it’s made its way to Florida with Intermezzo, a bar and coffee shop serving Eastlick Coffee Roasters. Eastlick roasts a wide variety of beans, but its Brazilian and Kenyan beans shine especially brightly. The space has an oyster bar too, which means you should grab a martini (I shouldn’t even have to say with gin) and get busy with those bivalves.The tiny gem that is Abraço.\nAlex LauAbraço - New York, NYThis Manhattan coffee shop has been slinging espresso and pouring glasses of vermouth for over a decade. The bar section (of the menu and the space itself) is small and easy to miss, but with the recent expansion of savory dinner options, the wine and amari are becoming more trafficked. Regardless of when you show up, do not miss the baked goods. They’re all made in-house and range from vegetable frittatas to olive oil cake to Portugese olive cookies. Yeah that’s right, they’re bringing it on every possible level.A cortado from Figure 8 is also never a bad idea.\nPhoto by Jessica AttieFigure 8 - Austin, TXThis is the type of place that enables my afternoon drinking habit. Figure 8’s space is beautiful, whether you’re sitting inside next to some potted plants, or outside at a picnic table. I’ll say that it’s easier to make the transition from cold brew to cold beer on the patio though. A can of Live Oak pilsner or a large format bottle of a Jester King sour goes down real easy out there in the sun.Explore Bon AppétitCoffeeEspressoAlcohol & Other DrinksBarsBeerWineCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-05", "author": ["Condé Nast", "Alex Delany"]}