{"id": "9d1c4948503d9b68a4154510ec9364d2", "url": "https://www.bonappetit.com/recipe/lemony-yogurt-sauce", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Lemony Yogurt Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueLemony Yogurt SauceBy Anna StockwellJuly 10, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintGrating the garlic with a microplane instead of finely chopping reduces it to a pulp so it can dissolve into sauces like this one. Try this sauce with our dinner-served-cold recipes: salmon, lamb, chicken, or beef.IngredientsMakes about 2 cups6Tbsp. fresh lemon juice1garlic clove, finely grated1tsp. kosher salt1tsp. freshly ground black pepper2cups plain whole-milk Greek yogurtPreparationStep 1Whisk lemon juice, garlic, salt, and pepper into yogurt in a medium bowl to evenly distribute.Step 2Do Ahead: Sauce can be made 1 day ahead. Cover and chill.How would you rate Lemony Yogurt Sauce?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI've been making yogurt at home, so I'm enjoying experimenting with all different things to make with my yogurt. This is a real crowd pleaser and spruces up so many types of dishes. I made it in bulk (6 cups of yogurt), and it was really heavy on the lemon juice if I followed the recipe. I reduced to about 4.5 Tbsp per 2 cups and got a very lemony, delicious result.AnonymousDenver, CO7/16/2020Explore Bon AppétitSauceCondimentLemonCitrusFruitYogurtOther IngredientsQuickEasyGluten-FreeNut-FreeVegetarianKetoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}