{"id": "9d2e0100c611ea1fbc9c8b4bcdc6928a", "url": "https://www.bonappetit.com/story/maya-wilson-alaska-from-scratch-cocktail", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Love Is a Cold Cocktail in the Middle of Frigid Alaska | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLove Is a Cold Cocktail in the Middle of Frigid AlaskaWhat was supposed to be a relaxing weekend in the woods would turn out to be a minor disaster I'll never forget.By Maya WilsonFebruary 12, 2018FacebookTwitterEmailPhoto by Maya WilsonFacebookTwitterEmailLast Valentine’s Day, not long after I had started writing my cookbook, my wife and I left our small Alaska town for a weekend getaway in an even smaller Alaska town. We had rented a log cabin via AirBnb in the tiny historic mining village of Hope. Population 192. In the dead of winter, most of Hope is shuttered, with nary a restaurant or a gas station to be found, let alone a WiFi connection or a dependable phone signal. Valentine’s Day dinner reservations weren’t even an option. What was supposed to be a relaxing weekend in the woods—nix the heart-shaped chocolates and Hallmark poetry—would turn out to be a minor disaster we'll never forget.The two-hour drive to Hope would be just as scenic as the destination. Several inches of snow had fallen the night before, leaving the trees heavy and drooping. It was the kind of scene that makes you crave a steaming bowl of something that warms you to your bones, like chicken and dumplings or fragrant pho. As we wound our way through the tight switchbacks of Cooper Landing, the Kenai River came into view. We gasped. The river’s trademark glacier ice blue had transformed into a jewel-toned teal swirling with black onyx. I clamored for my Canon camera as I drove, knowing a pull-out was approaching around the next bend. I had to get this shot for the cookbook.Seeing no oncoming traffic, I veered in the direction of the pull-out on the opposite side of the road. As it came into full view, I realized too late that it hadn’t yet been cleared of snow. In fact, the snow was much deeper, because snow plows had gone by and created a massive berm. I barreled our Subaru Outback directly into the deep snow, hopelessly high-centering it. The wheels spun furiously. We were stuck.I pushed the car door open, meeting resistance from the snow. At least I could still get the shot. Camera in hand, I trudged over to the railing where the river meets the highway. I snapped a couple of photos before the perfect light faded while my wife sat in the passenger seat brooding over how stuck we were. We then proceeded to “shovel” ourselves out with the only thing we had—a puny ice scraper. The car’s thermostat read 23 degrees Fahrenheit. My wife lay on her stomach under the car in deep snow, tossing out expletives with every minuscule scoop.  Many would say this was the opposite of romantic, but her fierce determination makes me love her even more.One concerned couple spotted us and stopped briefly, took a look under the vehicle, and declared, “Yep. You’re stuck. Sorry we don’t have a shovel.” They offered to call someone for us when they were back in cell phone range and drove off. By the time we got the car out 45 minutes later, my wife was soaked, freezing, and unable to feel her fingers. But the photo of the river I took while we were stuck in the snow became the very first scenic photo in the book, fittingly, at the opening of the soups chapter.When we finally arrived at the cozy log cabin in Hope that night, long after dark and later than we had anticipated, there was only one thing we were craving: a drink. Not having much to work with, I improvised. I grabbed the single blood orange I had packed for breakfast the next morning. (It’s very difficult to find good citrus in Alaska during citrus season, so this blood orange was a treasure.) I sliced it open, it’s unmistakable perfume filling the cabin kitchen. I squeezed it into a copper mug filled with gin, lime, and a spicy ginger beer. The cocktail swirled with the garnet-colored juice. No cocktail had ever tasted better. A fire crackled in the wood stove and we clanked our mugs together over a game of cribbage, laughing at our supposedly romantic getaway—and that damn ice scraper. Upon returning home, I replicated this cocktail recipe and photographed it for the cookbook, affectionately naming it the Ginny Weasley. This drink will always remind me that some of the most delicious inspiration in life emerges from the messiest, most unexpected moments.Photo by Maya WilsonThe Ginny Weasleyfrom The Alaska from Scratch CookbookServes 14 ounces spicy ginger beer (our favorites are Cock n’ Bull or Goslings)1 ½ ounces London dry gin½ lime½ tablespoon blood orange juiceFill a copper mug with cubed ice. Pour the ginger beer over the ice, followed by the gin. Squeeze the lime half into the cocktail, dropping the squeezed lime shell into the mug when finished. Finish the drink with the blood orange juice. Stir well and serve promptly.Pre-order Alaska From Scratch for $17 on Amazon.\nLove might also be this soufflé:Explore Bon AppétitAlaskaValentines DayCocktailGinBlood OrangeRead Moreculture19 Last-Minute Edible Valentine's Day Gifts & TreatsGallery19 SlidesBy Bon Appétitrecipes73 Chocolate Desserts for Valentine's Day (or Any Day, Really)Gallery73 SlidesBy Joe Sevierculture37 Gin Cocktail & Drink Recipes That Go Beyond Gin & TonicsGallery37 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Maya Wilson"]}