{"id": "9d32d6f894fa0d08f02d8d328e089cf9", "url": "https://www.bonappetit.com/story/how-to-cut-onions-without-crying", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "How to Cut Onions Without Crying Like a Baby | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cut Onions Without Crying Like a BabyDon't cry over sliced onions.By Sarah JampelMay 17, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailBefore we get into how to cut onions without crying, let's discuss why onions make us cry in the first place. As onions grow they absorb sulfur from the soil and convert it to amino acids. When their cells are damaged (i.e., when the onion is sliced), those acids come into contact with enzymes that catalyze a series of reactions that eventually lead to the release of a volatile chemical compound called syn-propanethial-S-oxide that makes your eyes sting and water. (Sulfur absorption is also at the root of onions' distinct flavor and odor aroma—it's not all bad!) Okay, so that’s the science (lite), but what are the solutions? Well, there are two major strategies: You can stymy the release of the chemical compound, or you can protect your eyes. (Or, when you're really afflicted, you can do both.)To protect your eyes, simply cover them. An added benefit of my contact lenses is that they act as a barrier, preventing the chemical compound from coming in contact with the surface of my eyes. Goggles (like these RSVP Tearless Kitchen Onion Goggles) also work well, as would your COVID face shield. Sure, you’ll look dorky, but who’s watching?To fight the chemical itself, start by using a sharp knife. A dull knife smashes rather than slices, doing more damage to the onions’ cells and thereby releasing more of the tear-inducing compound.You can also try chilling your onions. It takes foresight, but chilling peeled, halved onions in the fridge or in a bowl of ice water for 30 minutes can lessen the chemical’s effect. As Kate Winslow and Guy Ambrosino explain in Onions Etcetera, both cold temperatures and water make syn-propanethial-S-oxide less volatile. For the same reason, some people suggest keeping a damp towel or bowl of water near your cutting board as you work. Once you've finished cutting, clean your hands well—Winslow and Ambrosino recommend rubbing your palms with half a cut lemon before washing with soap and water. That way, even if you cried during the prep process (and who among us hasn't cried while making dinner after a long day?), you can smile when you sit down to a bowl of French onion soup.No tears, no problems:Creamy Lemon Zucchini PastaWith the help of the large holes on a box grater, zucchini transforms into a pile of soft shreds. Cook it down with olive oil, onion, and garlic and it becomes a creamy, caramelized mush that’s great spread on toast (like in the recipe this one was inspired by, Jennie Cook’s Zucchini Butter), stirred into scrambled eggs, or turned into pasta sauce with the assistance of cream and lemon juice. You’ll be amazed by how many zucchini cook down into this one dish—a very good thing when you’re staring down a pile of this prolific summer star.View RecipeExplore Bon AppétitOnionKnife SkillsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-17", "author": ["Condé Nast", "Sarah Jampel"]}