{"id": "9d3e3b5713829236122c0c6f93105f73", "url": "https://www.bonappetit.com/story/basic-knife-skills-videos", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "Basic Knife Skills That Every Beginner Cook Should Master | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Your Own Safety, Please Learn These 18 Basic Knife SkillsTime to practice.By Team BasicallyMarch 27, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailWouldn't it be nice if all recipes came with video instructions so you wouldn't have to google \"how the heck do I dice an onion without losing my mind or finger\" every time you got to that line in the recipe? That's not going to happen, but we figured we'd wrangle some of the MVP clips from Basically recipes of yore and put them all in one place. That way, whether you're prepping an ingredient for a recipe from Healthyish or from your favorite cookbook, you'll know exactly how we at Basically like to slice it.With a chef's knife, a big cutting board, and enough practice, tackling any of these 18 ingredients will become second nature. And remember, no matter what you're cutting, tuck your fingertips under your knuckles and hold with a clawed hand to prevent injuries.1. Butternut squash:Everything will be easier if you separate the bulb from the neck first.2. Mushrooms:Okay, this is sort of a trick. We think you should tear these—and here's why.3. Onions into half moons:Keeping the root end intact ensures that your onion won't splay out on you.4. Onions into small pieces:You'll cut in three directions: first, parallel to the cutting board; second, perpendicular to the cutting board and down the onion's length, and third, across the onion from top to root.5. Shallots:Treat these like mini onions.6. Avocados:For your own well-being, please don't hold your avocado in your hand when you remove the pit. Seriously, don't do it.7. Carrots and cukes on the bias:Does cutting a carrot on the bias improve taste? No. But does it improve its lewk? Yes.8. Scallions crosswise:Start by trimming off the root end, then work your way towards the dark green parts.9. Broccoli and cauliflower:This dare-we-say revolutionary broccoli-cutting technique will give you delicate florets plus a stem that's primed for peeling and cutting into small pieces that you should definitely not throw away—broccoli stalks are delicious! More on this method here.10. Sugar snap peas:Before you slice them, remove that pesky string that will surely get stuck in your teeth. Do it with a paring knife (shown above)......or by trimming off the ends, then using your fingers.11. Kale:A two-part act, you'll first strip the leaves off the stems, then stack the leaves, roll them into fat cigars, and slice.12. Meat against the grain:Still not sure what you're looking for? Read more about it here.13. A cooked chicken:First come the wings......then the legs......and finally, the two breasts.A boiled chicken is much easier to break down than a raw or roasted one—it practically falls apart. Consider it good practice for the many roast chickens in your future?14. Butter into half-inch cubes:Cut the stick of butter into four long shafts, then cut down their lengths so you get neat cube-lets.15. AsparagusSnap off the woody ends (those are too tough to eat), then slice down the length.16. Eggplant, into cubesWith round vegetables, you want to first make a flat side that can lie flush against the cutting board, unwavering.17. Bell peppers and zucchiniOh that's how you avoid that seedy core!18. Cherry tomatoesLooks dorky but is very efficient.Put those knife skills to use:Chopped Dinner Salad with Crispy ChickpeasExactly what you want when dinner NEEDS to be salad, and salad NEEDS to be dinner.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-27", "author": ["Condé Nast", "Team Basically"]}