{"id": "9d535b63e2e033fc019824a0d4259f20", "url": "https://www.bonappetit.com/story/dutch-oven-lamb-tagine", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Tagine Recipes All Come Down to This Formula  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Lamb Tagine Is More Warming Than Your Fireplace AppSlightly sweet, deeply savory, and yep, you can make it in a Dutch oven.By Alex BeggsFebruary 6, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailYou might own a beautiful clay tagine. It might sit on a high cabinet, on display. You might see it, feel a pang of guilt, and wonder where the ladder is. Or maybe you don’t have one and are beginning to wonder why you’re reading this at all. Stay with me! We’ve got a simple tagine recipe that doesn’t even require a tagine! So grab out your Dutch oven, which, uh, might also require a ladder. It’s cold outside and we need something saucy and spiced to warm us from the inside. Andy Baraghani wants you to be happy, and full. This we can accomplish.In Andy’s recipe, our stars are rich and earthy lamb, pops of sweet golden raisins that plump up in the broth, and buttery toasted almonds. It’s slightly sweet and deeply savory. A tagine (the vessel itself) offers the added benefit of a subtle taste of the earth and showmanship: unveil the stew at the table and immediately fill the room with fragrant meat scents (sounds nice, right?). But a Dutch oven can get the job done too.First, you season the lamb with kosher salt and let it rest for at least an hour. Before browning it, make sure to pat the pieces of lamb shoulder dry. If you don’t, the salt will pull water out of the meat, into the pan, and the meat will steam instead of brown and caramelize. That’s the part Andy told me people tend to mess up when making stews. Now that you know, you’ll pat your lamb dry with some Bounty Select-A-Size paper towels and move on with your life.After the meat has browned on all sides, you’ll add the flavor makers: onion, ginger, garlic, bay leaves, almonds. Then tomato paste for umami. Then the warming spices: cinnamon, cumin, cardamom, turmeric, red pepper flakes. Finally: water. Six cups of water will transform into a silky, rich broth after around an hour of slow simmering.To serve, Andy tops it with red onion, mint, and a squeeze of lemon—“something fresh to bring it back to life,” he said. He’s also know to add a dollop of yogurt. On the side: couscous, rice, or steamed vegetables would all be great.Now you know the basics of the tagine formula: meat, fruit, nut, warming spices. You can customize it to your tastes, swapping beef for lamb or boneless skinless chicken thighs (adjust the cooking time based on the meat), apricots or prunes for golden raisins, pistachios for almonds.It’s a hearty, wintry dish that can easily feed (and impress, and comfort) a crowd. I only know about four people, but that’s enough too. Like I said, this recipe’s flexible.Get the recipe:Spiced Lamb TagineYou don’t need a tagine, a conical earthenware pot typically from Morocco, to make this warming, fragrant, tender lamb stew.View RecipeExplore Bon AppétitStewComfort FoodLambRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-06", "author": ["Condé Nast", "Alex Beggs"]}