{"id": "9d58a30dd3482c3696df9f904044e90f", "url": "https://www.bonappetit.com/story/burts-bees-lemon-butter-cuticle-cream", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Burt’s Bees Lemon Butter Cuticle Cream Is the Only Thing Saving My Hands Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis $5 Salve Is the Only Thing Saving My Hands Right NowEndless dishes got nothing on this cuticle cream.By Emma WartzmanFebruary 8, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I’ve been in a lifelong fight with my cuticles. Even when it’s not the dead of winter and cold and dry as hell, they’re always swollen and peeling—even bleeding. (Sorry, not the greatest visual for food publication, but there you have it). So now that it is the dead of winter and nearly a year into quarantine—my hands have never scrubbed this many dishes!—well, needless to say my cuticles have been desperate for some relief.Luckily, I found it in Burt’s Bees Lemon Butter Cuticle Cream, a $5 solution that belies the quality of its ingredients and how luxurious it feels to use.Made with almond oil, lemon oil, cocoa seed butter, vitamin E, and sunflower oil (plus a few other ingredients you definitely CAN pronounce), it moisturizes and softens the cuticles while also helping to strengthen brittle nails. (The two often go together, ya know.) And though it’s called a cream, it feels more like a salve. Just pop the top of the small disk-shape container, rub the surface to loosen it from solid form, spread a layer over the tips of your fingers, and enjoy the sensation as the stuff works its magic. Sure, it takes a few minutes to completely absorb into your skin, but it won’t leave your hands feeling greasy or oily after-the-fact. (And that lemon oil? Oh it’ll make your skin smell fresh—and not in a fake, cleaning product sort of way.)I’ve been using it on my cuticles regularly ever since I got my first tin—which, I should mention was a while ago; it truly lasts forever—and they’ve never felt, or looked, better. This salve takes my hand care to the next level, and, paired with the hand cream I still slather on day and night, means that this pesky part of my hands finally get the special attention that it needs. Now I know my cuticles will be able to handle whatever comes at me—even when winter (and bottomless dishwashing) ends.Burt’s Bees Lemon Butter Cuticle Cream$9 at AmazonExplore Bon AppétitHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-08", "author": ["Condé Nast", "Emma Wartzman"]}