{"id": "9d580b3e35f89f95cff1295b38b2762a", "url": "https://www.bonappetit.com/story/beat-heat-with-spicy-noodles", "year": 2019.0, "month": 6.0, "day": 3.0, "content": "When You Can’t Beat the Heat, Eat Spicy Kimchi Udon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen You Can’t Beat the Heat, Eat SpicyThere’s no cooling off with these hot noodles.By Carla Lalli MusicJune 20, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.There are lots of things I love about New York City, but heat and humidity are not among them. Unfortunately, we are entering into season of the damp. Take this week, for example. Humid and sort-of raining every day, with temperatures in the mid-70s. Perfect for being misted with water while one’s own body self-mists. Perfect for subway platforms that resemble—atmospherically—New Orleans in August. Perfect for what my sister calls “swamp ass.” (If you know, then you know.)For a curly-haired person like myself, this is the season of surrender. Even though it would be nice to not have a damp spot on the back of my T-shirt and incredibly frizzy hair, something about this weather makes me crave spicy food, ideally in the form of these kimchi noodles.Photo by Alex LauWant this letter before it hits the website? Sign up for our newsletter!First you put butter, cabbage kimchi, and gochujang in a pan, and I don’t know what it is about those crazy kids, but man-oh-man something about dairy richness and spicy pickled funkiness just really works. (When I was a line cook about a thousand years ago, we made a sauce with creme fraîchè and chopped kimchi, and the flavor of this sauce takes me right back there.) Then you add more kimchi juice and chicken stock, but truth be told I will almost always use water instead of stock, unless I have homemade on hand at home. Meanwhile, you’ve got udon boiling away (let’s be real, any wheat-based noodle is invited to this party, be it ramen or thick spaghetti). The noodles get into the sauce, more (!!) butter jumps in, and you top the whole thing with a raw egg yolk, some scallions, and a smattering of sesame seeds. The egg yolk should get tossed and broken into the sauce so it coats the noodles, tempering a little of the heat with its own richness.Hot and spicy food on a hot and “yoo-mid” day feels right to me. It will make you sweat, but you were already sweating! It will curl the hair on your head, which is already frizzed like Gilda Radner’s. You might need a cold dunk after, which is what you needed before, but at least your belly will be full. It’s going to be a steamy summer, guys. Let’s not fight the current any longer.Get the recipe:Kimchi Udon with ScallionsThe power trio of butter, kimchi, and gochujang produces an umami ballad so beautiful in this udon recipe, you’ll want to play it over and over again.View RecipeExplore Bon AppétitCarla Newsletter UdonSpicyKimchiRead MorecookingA Strawberry Dessert for People Who Can’t BakeBy Carla Lalli MusiccookingI’m Only Drinking Piña Coladas From Now OnBy Carla Lalli MusiccookingYou Can Keep Your Ramps, I’m Stampeding the Farmers’ Market for PotatoesBy Carla Lalli MusiccookingMy Broccoli Delight Recipe Won’t Be Censored Any LongerBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-20", "author": ["Condé Nast", "Carla Lalli Music"]}