{"id": "9d5b0d20fbf2c971628df64842a5b5f7", "url": "https://www.bonappetit.com/story/nourish-nyc", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Nourish NYC Founder Tania Maree Giordani Was Raised To Take Action | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusNourish NYC Founder Tania Maree Giordani Was Raised to Take ActionNow she supplies protestors with safety kits and wants to enable others to do the same.By Tania Maree GiordaniAugust 14, 2020FacebookTwitterEmailIllustration by Sarah DahirFacebookTwitterEmailThe nationwide protests in support of Black Lives Matter and against police brutality have seen a wave of grassroots community organizers taking to the streets to protect protestors, handing out PPE, supplies, water, and snacks that are vital for their safety and energy. We checked in with activist Tania Maree Giordani, who has supplied protestors with thousands of kits through her Instagram @nourishnyc, about how she got started and her plans to grow with the movement.I’ve always been deeply invested in activism. Growing up, I would joke that I didn’t need to read Pedagogy of the Oppressed, I was living it: I was raised within that framework of thought and actions, which centers around how students can question and dismantle systems of oppression and domination. (That didn’t stop me from poring over the book anyways!) I started attending workshops engaging with Paolo Freire’s pedagogy at the Chicago Freedom School when I was six years old with my mother and older sister, and in high school I helped create workshops with my comrades at Theatre of the Oppressed Chicago to educate my community about the 2013 Chicago Public School closings.These experiences and Freire’s pedagogy have always inspired me to stay dedicated to community work. During my second year of undergrad, in fall 2018, I helped plan a benefit concert for the American Indian Community House, and now I am a member of the colectiva that runs Mil Mundos bookstore in East Bushwick, which is devoted to amplifying Black, Latinx, and Indigenous voices.Because of how I was raised, I believe activism is a daily commitment. It’s the intention behind your actions. It’s thinking about who you’re giving your money and your time to. It’s following through on these intentions even, and especially, when it’s not convenient.I was on the ground at a protest on May 28. I hadn’t planned on being there, but it was happening at Union Square, right by where I was living at the time. A lot of people didn’t have masks, and my own was full of sweat after 45 minutes. I was sharing my water with people—I totally forgot that we are in the middle of a fucking pandemic. But people should protest. And people should be angry. So I was like, “What can we do to make this safer?” I couldn’t find any organizations or people who were already distributing PPE, water, and snacks at the time, so I figured I could raise some funds to distribute these items at the protests I was attending.On May 29 I decided to organize through Instagram and Twitter. I had originally used my Instagram for my business as a makeup artist to share my artwork and to promote my new skin-care line, but I changed the handle to be something people would know how to spell, something easily recognizable that could be shouted and immediately understood. That’s how “NourishNYC” was born: in my bed at 2 a.m.Instagram contentThis content can also be viewed on the site it originates from.I didn’t expect to raise more than $200 to $1000, but to date I’ve raised over $120,000 and am hoping to pursue the process of formally becoming a nonprofit. Initially, I stored material donations in my living room, but the team at Babycastles (an art collective in downtown Manhattan) generously donated their space to use as a depot. At the depot, which is now primarily managed by Omari Wyands, we store all of our supplies and create safety kits. We have various types of kits, but the majority that we send out include one surgical or reusable mask, a pair of gloves, a travel-size hand sanitizer, Band-Aids, and a snack all inside of a sandwich-size ziplock bag. In addition to our safety kits, snacks, and beverages, we distribute grants to protestors and organizers and have committed $20,000 to the relaunch of the Cloud Room, our initiative that encourages the practice of imagining a radically different future through funding mental and physical wellness services and educational and arts programming for primarily Black and Indigenous LGTBQ+ folks.This is a really poignant moment in my life. Two weeks before founding NourishNYC I reached out to my class dean, who I speak with regularly. I told her how hurtful it was that there’s no way for my college to be equitable because it wasn’t built for people who look like me. I told her that I didn’t know if I wanted to go back. I’ve realized that, at 22, I’m exactly who I want to be. I’m doing everything that I want to commit my life to.One of my high school educators often assigned “smile at the sun” for homework. It was my work then; it is my work now. And it is my work to share that warmth with others as well. —As told to Jesse Sparks and Sarah JampelSome other organizations to keep on your radar:Fuel The People, NYC & D.C.The John Walt Foundation, ChicagoThe Saint Supper Collective, NYC (I am the co-director of this organization)The Black Chef Movement, NYCExplore Bon AppétitHealthyishRead MoreLifestyleThe Herbal Mutual Aid Network Creates Free Tinctures for Black OrganizersBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-14", "author": ["Condé Nast", "Tania Maree Giordani"]}