{"id": "9d625762deb2ac53236b95a634452540", "url": "https://www.bonappetit.com/story/run-dont-walk-for-runner-beans", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Run, Don’t Walk, For Runner Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRun, Don’t Walk, For Runner BeansYou don’t need to know ‘em by name to know exactly what to do with ‘em.By Carla Lalli MusicAugust 15, 2019FacebookTwitterEmailPhoto by Carla Lalli MusicFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.August is the best month, and I’m not just saying that because it’s almost my birthday. The multicolored bounty I’ve encountered the past couple of weekends at my neighborhood farmers market has truly restored my faith in humanity. Everything is shooting out of the ground right now—berries, greens, tomatoes, eggplants, lettuces, melons, peaches, nectarines, plums, beans, greens, corn, cukes, and peppers, too. I hauled so much produce home on Saturday morning that I got a legit core and back workout on the three-block walk back to my house. Yes, August carries with it a tinge of despair (September lurks), but the earth’s gifts offer a more optimistic take.Want this letter before it hits the website? Sign up for our newsletter!Mmmmm, garlicky delicious runner beans.\nThis is the time of year to buy whatever looks good to you, even if you don’t know what to do with it. Purchase anything that appeals, even if you don’t know what it is! Case in point: I couldn’t help overhearing a couple the other morning who encountered a big bin of just-picked yellow runner beans, decided that they were wax beans, and bought them anyway! I was going to jump in and tell them what they really were, but since you can do anything to a runner bean that you would do with a wax bean, I held back. Runner beans, like green beans (a.k.a. string beans), haricot verts, wax beans, and sugar snap peas, are all in the snap bean family—you can snack on them raw, steam, boil, or sauté them, batter and fry them, or grill them. Satisfied with my own bean knowledge, I grabbed several handfuls of runner beans for myself, knowing I’d figure out something to do with them.I could sauté them with garlic and oil, I told myself, which would take about five minutes. I could stew them, Grandma style, a method that’s totally hands-off. Or I could slow-roast them in place of the green beans in this recipe, which would yield a lot of gorgeous harissa-and-cumin-infused oil, too. Then I remembered an incredibly simple but delicious dish I had recently at the Williamsburg, Brooklyn, restaurant Misi: grilled runner beans tossed with olive oil, salt, and lots of red wine vinegar (those beans pictured at the top). Served floppy but still crunchy and lashed with grill marks, this three-ingredient summer dish stole the (side) show. I have some basil growing on my deck, which I’ll probably throw in there, too. This time of year, if you’ve got it, flaunt it.Explore Bon AppétitCarla NewsletterRead MorecookingSmashed Green Beans Are the Best Green BeansBy Molly BazLifestyleThis Chicken and Beans Stir-Fry Redeems Boneless, Skinless Chicken BreastsBy Chris MoroccocookingBefore You Eat or Cook Snap Peas, You've Got to Do ThisBy Alex DelanycookingThis Cheesy, Crispy Broccoli Skillet Might Be Best Thing I’ve Ever MadeBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-15", "author": ["Condé Nast", "Carla Lalli Music"]}