{"id": "9d7100039bfc1ee86d1910e9e04e8186", "url": "https://www.bonappetit.com/story/this-chef-knows-the-secret-to-a-standout-cevichesmoky-recado-negro", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "This Chef Knows the Secret to a Standout Ceviche—Smoky Recado Negro | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThis Chef Knows the Secret to a Standout Ceviche—Smoky Recado NegroChef Daniela Soto-Innes keeps turning new flavors into can’t-miss dishes, and her trick to elevating culinary standouts is truly inspiring.By S.Pellegrino®July 10, 2018FacebookTwitterEmailHarry EelmanFacebookTwitterEmailAt New York City’s ATLA, the all-day restaurant inspired by the varied flavors and textures of Mexico, the vibe is elegant and relaxed. The dining room’s clean lines and neutral hues are interrupted only by pops of green from potted palm plants and romantically draped vines of ivy. It’s the kind of atmosphere that enhances the dining experience, a credit to the laidback style that its chef, Daniela Soto-Innes, wields both in and out of the kitchen. In a setting that’s at once serene and sensational, Soto-Innes’s sublime dishes pack a powerful punch. Whether it’s day or night, her pared-down approach leads to stunning results.“I like ingredients that are simple yet powerful,” says Daniela. She often meets with Hugo Vera, ATLA’s chef de cuisine, to workshop new dishes for the restaurant’s brunch and dinner menus inspired by produce they find at New York City markets. The two like to sit at the sleek counter in the dining room, drinking S.Pellegrino® and mulling over interesting ways to use fresh ingredients they’ve encountered. The results can be stunning: On a recent outing, Hugo came across an intensely aromatic chile. Back at ATLA, it sparked both chefs’ imagination—they blackened it to a deep char before grinding it into a fragrant spice blend called recado negro, which enrobes a sultry black ceviche, or aguachile as it’s known in Mexico.Harry EelmanBut it’s not just restaurant chefs like Daniela and Hugo who can elevate fresh and seasonal ingredients. With a few tips from the pros, anyone can heighten understated dishes into unforgettable and elegant experiences. Here are the secrets that make ATLA’s menu shine.1. It’s all about sourcing.  In delivering an experience that’s authentically Mexican, it comes down to ingredients. But there’s more to it than you think. At ATLA, Daniela and Hugo source from the best in the business, which—for fresh items like fish, meat, and produce—is often the farmers’ market around the corner. But to fully transport her diners’ palates south of the border, she looks beyond New York City. “The dry spices that we use [are] from Mexico,” she explains. Whether you’re whipping up Mexican or Moroccan at home, Daniela advises that home cooks seek out spice blends or dried ingredients from those places. Ingredients that lack moisture can last longer and travel farther, making them more accessible to home cooks.Harry Eelman2. Turn something familiar on its head. Don’t feel restricted by tradition—experiment with time-honored recipes in new ways. The best example? That recado negro ceviche. “Recado negro is typical of the Yucatan Peninsula,” explains Daniela. “It’s usually a dry rub where all the ingredients are burnt and used on whole animals.” But instead of taking the usual route with this recipe, the chefs took a chance and made it into a sauce draped over delicate slivers of raw scallops and fluke, topped off with fresh cucumber juice, citrus, and ginger. After they spooned it onto crunchy tostadas and took a bite, the two chefs knew they’d nailed it. “I can’t wait to put it on the menu,” she says. The bright flavors are especially enhanced when paired with S.Pellegrino®, which joins delicate bubbles and an exceptional mineral balance.3. Small tweaks can make a big difference. “I like to take common ingredients that might seem simple, but elevate them in a very unique way,” says Daniela. One of her favorite examples of a simple touch with huge impact is a dessert at her friend Jaime Young’s restaurant, Sunday in Brooklyn. There, he finishes a simple soft-serve ice cream with a sprinkle of sea salt. “It may seem like a small thing, but those details make it really, really special,” says Daniela. “I like how Chef Jaime takes time to consider those details.”Harry Eelman4. Take inspiration from your mama. There’s a reason your mom’s cooking is some of the best in the world. It’s comforting! When in doubt, turn to those flavors—and wait for everyone to catch the feels. Growing up, “I was around food all the time,” Daniela says. “I'm from Mexico City, so you have food stands everywhere you go. My grandma had a bakery, and my mom dreamed of being a chef. So food is everything for me.” Luckily for her, the cooking gene clearly runs in the family. “I cook with the flavors that I remember growing up with,” says Daniela, adding that nostalgia is a category of flavor unto itself: If something makes you smile, go with it!Harry Eelman5. Keep it flavor-forward. You know that old saying about putting together an outfit? Before leaving the house, look in the mirror and remove one accessory. The same principle plays out when elevating a high-end dish from good to mind-blowing. “We look for spice, acidity, tartness, and really deep, strong and clean flavors,” said Daniela. “That’s why some of our dishes, it’s just the sauce, or the sauce with one veggie.”The bottom line: Creativity in the kitchen doesn’t need to be complicated. Focus on the best ingredients and inspiring flavors—but, most importantly, add your own personal touch to enhance each dish and make it uniquely yours.Harry EelmanWant to learn more about creating more tasteful moments? Check out the complete S.Pellegrino® Taste Guide to see how in-the-know chefs on both coasts do it.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "S.Pellegrino"]}