{"id": "9d7edc21afd885f9424cc48609e78ea7", "url": "https://www.bonappetit.com/story/dominique-crenn-slayed-2018", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Dominique Crenn Slayed 2018 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDominique Crenn Slayed 2018One Michelin star at a time.By Alex BeggsDecember 28, 2018FacebookTwitterEmailPhoto by Kelsey McClellanFacebookTwitterEmailOn November 29, Dominique Crenn slayed the dragon with three heads. Well, it wasn’t that violent. Instead of a sword, there were tweezers. Menus in stanzas. Food that brought people to tears. Her years of hard work, her unique vision, were finally recognized when she earned her third Michelin star for her San Francisco restaurant Atelier Crenn the only way she knows how: being her damn self. The headline read, “DOMINIQUE CRENN IS THE FIRST AMERICAN WOMAN TO EARN 3 MICHELIN STARS.” And by slaying the three-starred dragon, it can now be officially normal for a female chef to stack Michelin stars like the rest of them.Instagram contentThis content can also be viewed on the site it originates from.When Crenn was awarded Best Female Chef by The World's 50 Best Restaurants in 2016, she denounced the sexist category as “stupid,” and later wrote an op-ed in the San Francisco Chronicle about the lack of gender diversity in restaurant kitchens. While all press around the Michelin award focused on the FEMALE news (she was the first woman in America, and one of only a few in the world, to win three stars), this award celebrated her food, and her vision. She was inundated with flowers and emails from young female cooks, pumped up by her win, by her example. Can’t this just be normal already?Crenn’s wine bar, Bar Crenn, grabbed a star as well—not a bad haul for the French-born chef whose first fine-dining gig was at Jeremiah Tower’s Stars. (Coincidence? I think so!) I spoke to Crenn a few weeks ago, right before she turned off her phone and spent the weekend in complete chill mode: spa, sauna, massage, facial, “hours of nothing,” and time at her farm in Sonoma. This year she was in a focused place, and perhaps the Michelin inspectors noticed, she said. A former inspector sent her a note of congratulations that spilled some beans: We’ve been following your career since 2006, she wrote. You’ve been on our radar for 12 years, and we’ve seen you grow, but we also saw you stay true to who you are.Crenn felt seen. They get it. I’m not budging. Her food is meticulous, inspired, and surreal. At Atelier Crenn, the menu is a long poem that comes to life on the plate. The meal unfolds, dishes that look like little birds’ nests and potted plants. If magical realism were a genre of food, it would apply here. But behind the scenes, the chefs at Crenn’s restaurants sing and dance in the kitchen all the time (follow along on IG). “I created my own world! People who know me closely know I’m very silly, I’m very goofy, I bring that to my space.” I asked her if any past kitchens she worked in broke into dance parties, which got a quick, Uh, no. “I left a company that was very dismissing,” she said.Her latest, Bar Crenn, was inspired by post-WWII Parisian cafés, places where people gathered to drink and talk about culture, politics, what the hell is going on in this crazy world. “It was a hard time in the story of the world,” she said, “but it was also a time when amazing art came out. We are also living in a time that is not easy.” Not a lot of restaurateurs plan new spots thinking about the context of the current time, their restaurant’s place in the world right now. Crenn’s head works differently. “People are very disconnected from each other, I wanted a place where people have a glass of wine, be loungy, and talk to each other.” And maybe, she hoped, that creative space would inspire something beyond the meal. “I didn’t know if people would get it,” she said, “but Michelin did, Esquire, USA Today…”Before 2018 ended with a three-star bang, she was already snagging best-of lists, a James Beard award, and the cover of San Francisco Magazine’s best chefs awards issue, in which she won restaurateur of the year. She was hosting a female chef centric dinner series with Resy, speaking out about #MeToo in the restaurant industry, working on a memoir, a documentary, and planning her next move. There’s got to be at least 25 other things I missed.Now she’s got her sights set beyond the Michelin man. Some big upcoming projects are sizzling, but unannounced as of yet. “It’s interesting to realize your purpose in life. Mine isn’t cooking,” she says. “Cooking is a platform. My purpose is trying to understand humanity and be a part of this moment in time, forging a better world for the next generation. It’s tricky right now—we’re in trouble. I’m trying to do everything I can for my community, for the next generation. You have to keep that brightness inside of you, and be engaged with others. If I didn’t have that, I’d die.”Explore Bon AppétitChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-28", "author": ["Condé Nast", "Alex Beggs"]}