{"id": "9d8a3d97d9c64597d991d417030e49d5", "url": "https://www.bonappetit.com/story/new-australian-wines", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "5 Bottles That Will Show You Why I’m Obsessed with Australian Wine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 Bottles That Will Show You Why I’m Obsessed with Australian WineYellowtail this is not.By Marissa A. RossJuly 23, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailMost of us know three Australian wines. Yellowtail, the 1.5-liter bottle of choice for house parties from college to retirement. You have Shiraaaz, everyone’s favorite for attempting an inevitably bad accent. And then Marlborough Sauvignon Blanc, the one we throw around to sound like we know something about wine, even though we don’t because it’s...from New Zealand. That’s all the Australian wine experience we’ve had because that’s most of what’s been available in the States. Until now.Australia is a New World wine country, meaning winemaking began there after the 15th century (versus Old World, which is basically all of Europe that has been making wine since the beginning of time, apparently. Old World wines are typically lighter in body, higher in acidity, and lower in alcohol.) New World wines are often categorized as ripe, fruity, and high in alcohol because that was the popular style when these regions started producing for a global market. But much like California over the past decade, natural wine producers in Australia right now are ignoring those preconceived notions, not to “redefine” themselves but to finally define their wines on their own terms.TBH, I’ve become kind of obsessed with them. It started because of their scarcity. For a while you could only get the occasional Australian bottle at my local natural wine shops. But when those shops started carving out real shelf space for new Australian producers, I went after it. I consumed them quicker than bottle service with a rapper’s entourage, and I have the credit card statements to prove it. The wines are so fun and so wild, that my thirst, and curiosity, has been insatiable.When Severine Perru—the powerhouse wine director behind the NYC, and soon to be L.A., natural wine bar/chapel The Ten Bells—came to town, I questioned her like I was a passionate (but like chill, and not violent) Stabler from SVU, investigating an Australian wine crime (or something). She had just returned from making wine in south Australia’s Basket Range region of Adelaide Hills this past spring, and I wanted to know everything. “In a certain way, [the winemakers] feel freer to do whatever they want, in regards to vinification and blends,” Perru said. Particularly in Adelaide Hills, she chalks this freedom up to the fact that there isn’t a regulated appellation there. Appellations are designated wine-growing regions that have certain laws regarding what wines can be made and how the wines can be made, like Champagne or Burgundy. “Australians are less subject to historically predefined styles of wines…yet, they have plenty of different grape varieties, and it gives them the opportunity to play a lot!”And play is the right word. New Australian producers are not afraid to work with everything from Sangiovese to Chenin Blanc, and mix it all up.  Sometimes they don’t even know what the hell they’re mixing up. No joke, I’ve had dozens of email exchanges with certain Australian producers, their importers, and distributors about wines, and no one will be able to agree on what certain wines even are. Because there aren’t any appellation rules—and because natural wine producers around the world generally ignore them anyway—no one cares how much of X and how much of Y is in the wine, or if it’s a quintessentially “jammy” red or a classically “grassy” white.What modern Australian winemakers care about, and what I care about, is that this region with incredible potential is now able to step outside the homogenized super-fruity, high-alcohol, clunky profile of “New World.” Instead of following silhouettes of kangaroos down the aisles of Target, these wines are carving their own paths through expression of terroir and experimentation with varieties, and that is what keeps wine exciting. Want to get really excited about Australian wines? Here are five I’ve fallen in love with.Photo by Marissa A. RossJauma Chenin Blanc Pétillant Naturel 2017$32; Domaine LAEverything about this bubbly from Jauma reminds me of the sun shining through a marine layer on a summer morning. It’s the color of diffused maize, and it smells like a fresh pressed juice of papaya, mango, aloe vera, and honeysuckle you paid too much for in Venice Beach, but damn, was it worth it. Bright with a gauzy texture, it tastes like lemon verbena, limeade, and an ocean breeze with a hint of yeasty cider. And at 11% alcohol, you don’t even have to feel bad about drinking the whole bottle at brunch.Photo by Marissa A. RossDormilona “Blanco” 2017$40; Wine Therapy\nThis blend of Sauvignon Blanc and Sémillon is a bit of a roller coaster. While it is an unassuming flax color, going in for a whiff will leave you blown away by intense herbal aromas of fennel fronds, wet grass, and caramelized shallots. Don’t be nervous because it smells savory, though—you’ll be surprised upon sipping that it has wonderful acidity, tasting like someone squeezed lemons over a suburban lawn with the classic oily texture of Sémillon. It’s bold and elegant, refreshing and fun, in all the right places. Would recommend this for anyone looking to drink dope wines with their white-wine-loving parent, or just by their damn selves.Photo by Marissa A. RossPatrick Sullivan Jumpin Juice “Half Full” Red 2017$27; Domaine LAThis isn’t the first time I’ve written about Patrick Sullivan, nor will it be the last. His bouncy and poppy wines were the first to turn my head and make me excited about Australia’s new wine scene, and the Jumpin Juice “Half Full” is no exception. A wild blend of Pinot Noir, Shiraz, and a splash of Gewürztraminer, this wine looks like you held a cherry Jolly Rancher to the sun. It smells like sun-ripened raspberries but not in the Bath & Body Works way, just in a real “Hey, these are raspberries that are ripe and delicious but still have a hint of tartness. And there are some juicy strawberries. Okay, fine, it is a little Bath & Body Works-ish, but it’s not oppressive like a junior high locker room, I swear!” Light and feisty on the palate, it tastes like unfiltered cranberry juice was hit with a splash of Dr Pepper and lavender.Photo by Marissa A. RossBasket Range Pinot Noir 2017$34; Domaine LAUgh. I have such a crush on this wine. I jump at the chance to be near it. Basket Range’s Pinot Noir is hazy ruby in color and smells like kumquats, cranberry, red roses, and the slightest whisper of watermelon were swept up in a dusty wind on the cover of a romantic novel. It tastes like cranberries and ruby red grapefruit making out at dusk next to a bunch of gardenia bushes. Look, I’m not saying that makes sense, I’m just saying that’s what it tastes like and that’s love, okay? Now where is Danielle Steel because boy, do I have a pitch for her…Photo by Marissa A. RossThe Other Right “Love Potion” Shiraz 2017$43; Domaine LAIt wouldn’t be a real Australian wine piece without some Shiraz (a.k.a. Syrah).  While many Shiraz wines can be overripe and a bit cloying, The Other Right does it, well, right. Garnet-toned, the Love Potion smells and tastes like red currants and strawberries buried in a wet cedar forest. It’s deep and soulful but still upbeat with twangy acidity and reminds me of a good guitar riff, like a Mac DeMarco song. P.S. I’m also obsessed with their “Bright Young Pink” pét-nat.Lucy MargauxIt’s not pictured because I couldn’t find any bottles, but be on the lookout for another one of my favorite Australian producers, Lucy Margaux. I’ve enjoyed many of their bottles (which have been many), but the “Wildman Blanc” Sauvignon Blanc really struck me. I described it earlier this year as “Peachy keen and cloudy on the eyes. The bouquet is very tropical and citric with hints of coconut suntan lotion, and same with the palate, but pithy and salty. It’s one of those wines that is so delicious it makes you forget alcohol is involved. Extremely juicy and pure, yet dry and textured, this is a must-drink wine.”Fingers crossed that these are the only wines at house parties for the rest of our lives.Read more: Making Wine With Yoda, Danilo MarcucciMarissa Ross is the author of Wine. All the Time. Pick it up on Amazon for $14 and read more of her wine columns for Bon Appétit here.Explore Bon AppétitWineAustralianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-23", "author": ["Condé Nast", "Marissa A. Ross"]}