{"id": "9d986b17f0b0c4fd828b87229a4506ba", "url": "https://www.bonappetit.com/story/replace-your-microplane", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Why You Should Replace Your Microplane Grater | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIf You Can’t Remember When You Got Your Microplane, It’s Time to Replace ItSave your fingers. Obliterate your ginger.By Sarah JampelFebruary 11, 2022FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There’s a lot to keep track of and account for in this life, so for a few tasks, I let myself off the hook and rely instead on a simple philosophy: If I can’t remember the last time I did it, there’s no time like the present. Examples: swapping in a new kitchen sponge, drinking a glass of water, taking a shower (JK—or am I?).So when I found myself frantically grating ginger into a pot of sizzling onions, making no headway against its hairy fibers, I thought: When’s the last time I replaced this Microplane? I took out my phone, ordered a new blade, and smiled, knowing that the most terrible kitchen task of all was about to get a whole lot less terrible after my shiny new tool arrived.If you, too, love your Microplane, you probably push it to its limits—grating ginger, yes, but also garlic, fresh chiles, chocolate bars, and hard cheese (so much cheese). I probably use my Microplane to zest a lemon or lime every single day. And just like the edge of a knife, the blade of a Microplane dulls over time. With enough use, it becomes a worn-down razor (note to self: replace my razor blade), scratching and scraping rather than shaving sharply and smoothly. Not only does that make your job harder (I repeat: grating ginger is terrible; grating ginger is more terrible with an old Microplane), it also makes your job a little riskier. With the nub of ginger—or the clove of garlic—getting caught on the blade rather than disintegrating into the void below, it’s more likely you’ll snag a finger or a knuckle. Ouch!So if you also can’t remember the last time you replaced your Microplane, consider this your call to action. Carpe diem, reader!Microplane Grater$16 at Amazon$15 at Bed Bath & BeyondI’ll wait.Microplane Grater$16 at Amazon$15 at Bed Bath & BeyondAnd now that’s taken care of, ask yourself: When’s the last time you cleaned your water bottle?You filthy animal:How to Clean Your Water Bottle—Because Yes, It's FilthyDrinking water is good for you! Drinking mildew and mold is probably not.View StoryExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-11", "author": ["Condé Nast", "Sarah Jampel"]}