{"id": "9d9fdf4a9168cb395b7485ee1c5e0051", "url": "https://www.bonappetit.com/story/29b-teahouse", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "29B Teahouse Is the One Place Where I'm a Regular in NYC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle29B Teahouse Is the One Place Where I'm a Regular in NYCAs a roving food journalist, I'm eating all over town...but I always come back to 29B.By Elyse InamineAugust 17, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmail“Here, you’re gonna need an ice pack.” From behind the counter at 29B Teahouse in New York City’s Lower East Side, Stefen Ramirez hands me a plastic bag with ice cubes, his usual serious expression cracking into a grin. On the way over, I slammed head first into a small metal box sticking out of a streetlight. Has no one else done the same thing on the southeast corner of Avenue B and Second Street?! Ramirez fills my Japanese ceramic mug with more oolong, an inky batch from a recent research trip to the Wuyi Mountains in China. I drink in deeply, feeling some feels that have been eluding me for the last few years: the come-as-you-are comfort of being a restaurant regular.It’s an unusual feeling. Reporting on the industry as a food journalist means existing in a feverish cycle of tracking restaurant openings (and closings), discovering chefs and tracking their moves, and chasing trends that burn out fast (what happened to froyo?) or seem to never die (if I see another uni pasta...). But 29B Teahouse is where I schedule long overdue dinners with friends, kill time, and return again and again.Stefen Ramirez preparing tea.\nChelsie CraigThe serene, Japanese-ceramics-filled bar is run by Ramirez, his wife and designer Shin Won-Yoon, and tea enthusiast (and tech consultant) Andreas Vagelatos. There’s always an excuse to swing by, whether it’s for a new tea Ramirez is obsessing over right now, the dreamy ochazuke that blows the kind I grew up with out of the water (sorry, Mom), or the overall chill and unpretentious vibes.Ramirez got his start in tea at Itoen on the Upper East Side nearly 15 years ago, and it's taken him from the famed Urasenke tea school in Kyoto to tea growers in Taiwan and back as a tea merchant. But, last October, he decided to open the kind of place he loved when he first started: a place to sit and actually enjoy tea.29B's infamous matcha beer.\nChelsie CraigThe stunning, bright green matcha beer first drew me to 29B Teahouse last December (which I spied on, ahem, Instagram). But after giving into the Insta hype (it’s actually very good), I knew I’d be back. That’s because it’s easy to a lot of time here. Hitting the drink menu alone could be a part-time job. I get lost in all of Ramirez’s teas, which constantly change, and I try to keep up with his tea inventions (beyond matcha beer, there’s sparkling tea and matcha pét-nat).There’s also a small but lovely food menu, with addictive, rosemary-flecked Marcona almonds, sashimi like fatty king salmon from Tasmania and soy-slicked ikura from Alaska, and that ochazuke. I constantly crave ochazuke, a humble Japanese soup, typically made with short-grain white rice with tea (or dashi) and sometimes fish. But Ramirez makes a much less humble version: He does a quick soy sauce marinade on any fish he has on hand and pickles some vegetables, usually radishes, then places them in a small bowl on top of sticky white rice with a dab of umeboshi. He finishes it with a pour of hojicha—and a gentle directive to mix everything together before diving in. That’s key. Because getting the super-savory fish, zingy pickles, sweet-sour ume, and smoky hojicha all in one bite will ruin you forever for ochazuke.And once I’m finally ready to leave, paying the bill up at the entrance of the restaurant, I’ll get stuck ogling all the wonderful teas on display (charcoal-roasted oolong?!) for another few minutes. This is why I always seem to return to 29B even when there are too many other restaurants I should be paying attention to right now. I swing by anytime—after a long, lox-filled breakfast at Russ & Daughters, late in the afternoon to catch up with an old friend over nutty silver needle tea from China, or in the evening for a few things to snack on. The only time I’ve ever been disappointed was when I came on Sunday night for dinner. 29B was closed and I’d been looking forward to it all week—not to mention I looked like an idiot to my friend who I forced to come with me from Flushing.But that’s the kind of place Ramirez built with 29B Teahouse: not just a shrine to all the wonderful teas in the world but a place where you can nearly crack your head open on the street, laugh it off (and also treat it), and call it a good night.Explore Bon AppétitNew YorkTeaCity GuidesHealthyishNew York CityJapaneseRead MoreshoppingThe Caffeine-Free Tea That Helps Me Focus More Than Coffee Ever CouldBy Claire MargineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-17", "author": ["Condé Nast", "Elyse Inamine"]}