{"id": "9d9f663d3493ca8e84ce03906eafbb9a", "url": "https://www.bonappetit.com/recipe/gluten-free-chocolate-and-buckwheat-waffles", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Gluten-Free Chocolate Buckwheat Waffles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueGluten-Free Chocolate Buckwheat WafflesBy Chris MoroccoJanuary 9, 20184.9(9)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIf you want to make these without buttermilk, substitute 2 cups alt-milk plus 2 Tbsp. distilled white vinegar.Ingredients8 servings Toppings¼cup mixed buckwheat groats, black or white sesame seeds, and/or flaxseeds2teaspoons plus 2 tablespoons pure maple syrupPinch of kosher salt1cup whole-milk ricottaWaffles and Assembly1cup buckwheat flour½cup Dutch-process unsweetened cocoa powder¼cup flaxseed meal1¼teaspoons kosher salt1teaspoon baking powder1teaspoon baking soda2large eggs, room temperature2cups buttermilk½cup virgin coconut oil, melted¼cup (packed) dark brown sugar2teaspoons vanilla extract2ounces bittersweet chocolate, coarsely choppedNonstick vegetable oil sprayPure maple syrup (for serving)PreparationToppingsStep 1Preheat oven to 300°. Toss buckwheat, 2 tsp. maple syrup, and salt on a rimmed baking sheet until evenly coated. Bake until dry to the touch and toasty smelling, 12–15 minutes. Stir to recoat and transfer to a sheet of parchment paper. Let crumble cool.Step 2Whisk ricotta and remaining 2 Tbsp. maple syrup in a small bowl until smooth.Waffles and AssemblyStep 3Heat a waffle iron on medium. Whisk buckwheat flour, cocoa powder, flaxseed meal, salt, baking powder, and baking soda in a large bowl to combine. Whisk eggs, buttermilk, coconut oil, brown sugar, and vanilla in a medium bowl until smooth. Add to dry ingredients and whisk until smooth; mix in chocolate.Step 4Lightly coat waffle iron with nonstick spray. Scoop batter onto waffle iron (it should cover the entire surface; amount needed will vary according to model) and cook waffles until you smell a blast of chocolaty aroma hit you and edges are slightly darkened, around 3 minutes per batch. Remove carefully from waffle iron. Without gluten, waffles will be extra tender.Step 5Serve waffles topped with whipped ricotta, crumble, and maple syrup.How would you rate Gluten-Free Chocolate Buckwheat Waffles?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangle I would appreciate suggestions for substitutions for the cocoa powder and chocolate chunks since I am allergic to those foods.JDDayton, OH9/29/2021Great recipe! My kids 5 and 7 loved it. They also freeze well. Robin KAshland, OR9/13/2021Enjoyed this recipe. Nice flavor, but I do find that it has a high degree of variability. Keep in mind that not all buckwheat flour and flax seed meal are created equal. If you have a less fine grind (especially if you grind your own buckwheat), you may need to add additional dry ingredients to reach the correct consistency. I recommend adding wet ingredients slowly as to avoid over-hydrating the batter. AnonymousAnchorage, Alaska9/25/2020Turned out very good, unlike most gluten free waffles I've tried these have a nice fluffy texture and the buckwheat flavour isn't overpowering. Will definetly make these again :) AnonymousCanada 7/27/2019Awesome recipe, just watched the video and made them. Easy, quick, and delicious! Made theme with some cashew milk and added vinegar to make it buttermilk. AndmarSofia, Bulgaria 9/27/2018Explore Bon AppétitWaffleChocolateOther IngredientsBuckwheatFlourButtermilkQuickEasyGluten-FreeVegetarianHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}