{"id": "9da536cf498b07c92753b7f66d6a2f01", "url": "https://www.bonappetit.com/story/schmidts-deodorant", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Schmidt's Deodorant Works Even on Extra Sweaty Pits Like Mine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSchmidt's Deodorant Works Even on Extra Sweaty Pits Like MineI've tested lots of natural deodorants that left me sweaty, stinky, and sad. But Schmidt's always comes through.By Catherine CivginOctober 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI sweat a lot. Not, like, an excessive amount but I will never be the person who goes into a heated yoga class and walks out looking the same as I did before (I’ve tried). Because of this, I have always been hesitant to give up my conventional, chemical-laden antiperspirant for something safer for my health. But after a friend sent me a horrifying article on the potential effects of antiperspirant deodorants, I decided that I had to make the switch, so I started my search for a natural alternative.I tested a lot of natural deodorants before finding the one. I tried a bestseller from Goop, sampled multiple recommendations from friends, and even tried the brand that Emma Watson swears by. While all of these products touted non-toxic ingredients and had great reviews, all of them also had issues. Some were unable to protect against odor, many didn’t absorb wetness and almost all had a texture so rough that it actually hurt to use. After testing and disliking six different brands, I was ready to give up. Then my aunt introduced me to Schmidt’s.Jaime Schmidt founded Schmidt’s out of her kitchen in Portland, OR in 2010. In search of a natural deodorant that she could use while pregnant, Schmidt decided to formulate her own. Despite having little experience making consumer goods, she began testing different formulas until she found the ideal one. The result? An aluminum-free, cruelty-free deodorant that was rid of parabens, phthalates and artificial fragrance. Oh, and this product actually worked.“Once I realized that my deodorant countered a common customer perception—that natural deodorants don’t work—I decided to go all in and strategize turning Schmidt’s into a legitimate business,” says Schmidt. Since its humble beginnings, Schmidt’s has grown massively. The company, which now sells soaps and toothpastes in addition to deodorant, has a loyal following. You can now find Schmidt’s in thousands of retailers, including Target, where I bought my first stick. Three months later, I haven’t looked back.The Coconut Pineapple scent is my jam.\nPhoto by Alex LauSchmidt’s is my stick of choice because, to start, it actually stays on throughout the day. With Schmidt's, I can apply in the morning, go to work, and not have to worry about my deodorant lasting through EOD. (Not having to reapply deodorant in the bathroom during a busy workday is a game-changer.) I also like Schmidt's because it’s easy to apply. Whereas other natural deodorant sticks were rough and caused underarm rashes, Schmidt's glides on smoothly.In addition to their Signature Stick Formula, Schmidt’s also sell a Sensitive Skin Formula that does not contain baking soda, and I've found that it applies even more smoothly than their original stick (I’m partial to the coconut pineapple scent). Schmidt's also sells glass deodorant jars for those who prefer not to use stick deodorants.For me, Schmidt’s is a clear winner. Non-toxic formula? Check. Effectiveness? Check. Inspiring founder? Check. While the process of finding Schmidt’s was by no means easy, I am glad that I saw it through and ultimately let go of my beloved antiperspirant for a healthier option. Now I can confidently swipe my deodorant on every morning without a guilty conscience or underarm rashes. And that is pretty big.Buy it: Schmidt’s Natural Deodorant, $8.99All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitNatural BeautyTrendsHealthyishRead MoreshoppingWe Wore Rosé Deodorant On a Hot Summer DayBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Catherine Civgin"]}