{"id": "9daa41e6d741816ad4d94d9d8c2d4080", "url": "https://www.bonappetit.com/story/never-fail-peanut-noodles-recipe", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "This Peanut Noodles Recipe Has Lived on My Bookmarks Bar for Two Whole Years | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Peanut Noodles Recipe Has Lived on My Bookmarks Bar for Two Whole YearsKnowing that garlicky peanut sauce is just a click away sparks great joy. This peanut noodles recipe is a keeper.By Alex PastronMay 17, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I’m the type of person who takes pleasure in organizing the junk drawer. I’m thrilled by the prospect of cleaning out the fridge, neatly re-stacking emptied Tupperware as I go. When it comes to my computer, there is no exception: Desktop folders are color coded, application icons get organized for maximum efficiency. But I have allowed myself one sentimental piece of clutter: a link to this peanut noodles recipe, long since memorized, on my bookmarks bar.In times of great stress, knowing that the garlicky peanut sauce is (more or less) just a click away brings me comfort. Sure, this sauce has six ingredients, but all six of them—peanut butter, soy sauce, vinegar, honey, garlic, and vegetable oil—are pantry staples, meaning they can be whisked together whenever a noodle craving hits, no trip to the grocery store necessary. It’s this recipe that has also taught me to keep packets of udon on hand, since I learned the hard way that the addictive sauce won’t adhere to slippery spaghetti the way it does to udon—and once you try it, you'll probably start stockpiling too.Now you’re saying to yourself, What about the shredded rotisserie chicken this recipe clearly calls for? Do you keep that in your pantry too??? I’M SO GLAD YOU ASKED. No, dear reader. As much as I would love to have a fully-cooked, golden brown whole chicken on hand, this is almost never the case. Sometimes I'll cook and shred some chicken just for this recipe; sometimes I throw in whatever leftover protein I have lying around, from seared tofu to cold sliced steak; sometimes I leave out the meat entirely, adding more veggies to make the thing feel substantial. Every iteration is good, and if you are lucky enough to have a pre-cooked bird on hand, all the better.This brilliant recipe also calls for thinly sliced celery hearts and leaves, mung bean sprouts, and a daikon cut into matchsticks. A nice, snappy vegetable component is essential for texture, but you can feel free to riff based on whatever veg you have around—sliced sugar snap peas are one of my favorite additions.Crisp, tender celery leaves lend a refreshing brightness to a bowl of rich, peanut-y noodles.\nPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsOh, and did I mention these noodles are served cold? Perfect for the coming warm weather! This was one of the things that attracted me to this recipe in the first place, scrolling through my Instagram feed on a summer afternoon, trying to distract myself from how hot and humid New York City can be. Cold noodles that don’t resemble pasta salad? Sign me up! You just have to make sure to treat those noodles right so they don't overcook or stick together. As soon as your udon has hit al dente, you drain them, rinse them under cold water, and then drain them again. Once the noodles are good to go, you simply toss everything together in the largest bowl you can find and sprinkle on some sesame seeds like they’re, well, sprinkles, which lend a subtle crunch and a double hit of nutty flavor.And while these are perfect for the summer months, I definitely don't file this recipe away when fall rolls around. As someone who has whisked, shredded, and rinsed udon approximately a gazillion times since this recipe was published two years ago, I’m here to tell you that even on the chilliest of nights, the creamy, garlicky, peanut buttery goodness of the sauce makes these noodles hearty enough for year-round twirling. So if there is one thing your pantry (or bookmarks bar) has room for, let is be this peanut noodles recipe. You will not regret it, I promise.Get the recipe:Udon with Chicken and Garlicky Peanut DressingThis colorful cold noodle salad is infinitely riffable and superbly delicious, thanks to a big-flavor dressing you’re gonna want to have on hand all the time.View RecipeExplore Bon AppétitBasically UdonNever FailPeanutPeanut ButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Alex Pastron"]}