{"id": "9dbcd5ee6eb6bb3b86fc8a599d063102", "url": "https://www.bonappetit.com/recipe/sweet-and-spicy-grilled-summer-squash", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "Sweet and Spicy Grilled Summer Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSweet and Spicy Grilled Summer SquashBy Andy BaraghaniJune 14, 20195.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe crosshatch pattern isn’t just for show (even though it does look cool)! It allows for the salt to fully penetrate the squash and also draws out some of the excess water so that the sweet, tangy glaze can be fully absorbed.Ingredients4 servings4medium summer squash or zucchini (about 1½ lb. total)Kosher salt⅓cup honey⅓cup unseasoned rice vinegar¼cup low-sodium soy sauce3Tbsp. hot chili paste (such as sambal oelek)2Tbsp. vegetable or sunflower oil, divided1lime, halved½small shallot, thinly sliced into rounds¼cup coarsely chopped cilantro leaves with tender stems1tsp. toasted sesame seedsPreparationStep 1Prepare a grill for medium-high heat. Cut each squash in half lengthwise, then score cut sides in a ¼\" crosshatch pattern with the tip of your knife. Toss squash and 1 tsp. salt in a colander; set over a bowl. Let sit 10 minutes, then pat dry with paper towels.Step 2Meanwhile, combine honey, vinegar, soy sauce, and chili paste in a small saucepan. Bring to a simmer over medium-high heat and cook, stirring occasionally, until reduced by half and slightly thickened (just shy of syrupy), 5–7 minutes. Remove from heat. Stir in 1 Tbsp. oil.Step 3Toss squash with remaining 1 Tbsp. oil in a large baking dish or plate. Turn squash cut side up, then brush with glaze.Step 4Grill squash cut side down until just beginning to char around the edges, about 3 minutes. Continue to grill, turning every minute or so and brushing squash with glaze on cut sides, until just tender and cut sides are lightly charred and shiny from the glaze, 6–8 minutes total. (Reserve any leftover glaze.) Transfer squash to a platter.Step 5Squeeze juice from 1 lime half into a medium bowl and add shallot and cilantro; season with salt and toss to combine.Step 6Drizzle squash with any leftover glaze. Top with herb salad and sprinkle with sesame seeds. Serve with remaining lime half alongside.How would you rate Sweet and Spicy Grilled Summer Squash?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleDid anyone have issues with the glaze burning on the BBQ grill bars?Karen CalanchiniSouth of Mt. Shasta6/28/2020This makes a beautiful presentation and is delicious.  However, it ruined my Nordic Ware gill plate which I used stovetop, as our  BBQ  grill was being used by hubby for numerous other food.  It came out beautifully, but the sauce burned so bad onto the grill pan, which is non-stick.  I kept the temp. down to medium, and turned zucchini as recipe suggesed and zucchini did not stick, but the sauce sure did.Karen CalanchiniSouth of Mt. Shasta6/28/2020Wow. This is such a delicious vegetable dish! Makes a great vegan meal over rice. The smell and flavor reminded me of unagi (Japanese grilled eel) which I love.\nI don’t own a grill so made this recipe in a pan and it turned out perfectly. The lime squeeze is crucial to making the dish pop.\nThe only two adjustments I made were substituting agave nectar for honey and spring onion for shallot.baptisteParis, France6/18/2020super simple and delicious! its worth while to really get the liquid out of the squash during the resting process, otherwise the squash will expel liquid during the grilling process (happened a little to me). niccsuxSingapore7/15/2019This is a ridiculously good recipe, super easy to make and great flavors.  We paired it with the Spicy coconut chicken thighs and it was a huge hit.  This is going into the regular rotationkentjmcguiGold Coast7/1/2019This is a great recipe! Scoring the squash is such a good idea and a technique I’ll likely use again, even if I don’t follow this exact recipe. The glaze was delicious and would be good on all kinds of things, not just squash. I’ll definitelty make this again. AnonymousCalifornia6/30/2019I wish I'd been grilling summer squash and zucchini all along! The salt/paper towel method means you get a much better (less watery) texture and the sauce is delicious. I'm definitely going to try eggplant like another commenter mentioned.Chicago6/30/2019Such a perfect recipe. I'll be making this all summer. I had extra glaze so I just painted it on everything I was grilling—fish, onions—it makes everything better. I skipped the very-Andy herb salad part but I'm sure it would feel more like a main dish, and look more beautiful. alexbeggsBon Appétit 6/24/2019I’ve a couple squash and eggplant from the garden I’m going to tryGuitarguy_1963Houston6/24/2019Explore Bon AppétitSummer SquashSquashVegetableZucchiniSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeVegetarianHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Andy Baraghani"]}