{"id": "9dbf437973342da8bd7c7e4acd56ad18", "url": "https://www.bonappetit.com/story/japanese-dried-persimmons-hoshigaki", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Japanese Dried Persimmons are Worth Every Massage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy I’m Hand-Massaging Persimmons Every Day (& Loving It)The slightly obsessive, slightly crazy project for wannabe-homesteaders and fruit fanatics.By Sarah JampelMarch 7, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEvery morning, I wake up and massage my persimmons.Two of them dangle right by the bed, connected by a string that’s hooked over a shelf in the window. That string is tied, on both ends, to screws that I jammed into the persimmons’ cores about two weeks ago.Every morning, I’m happy to see them there, and I told my boyfriend that if he did not love my persimmons, he did not love me—a statement I will stand by.“You needn’t be insane to practice the ancient Japanese art of hoshigaki—just reasonably obsessive,” wrote Kent Black for the Los Angeles Times in 2005.Luckily, I am both.Persimmons are typically harvested in the fall and dried into the winter.\nPhoto by Peden + MunkHoshigaki, which California-based chef and restaurateur Suzanne Goin has called “the Kobe beef of the fruit world”, are a labor- and time-intensive Japanese delicacy dating back hundreds of years. (The 2004 film Red Persimmons records the process.) Originally a method for preserving fruit for the winter, hoshigaki were brought to the Sierra foothills and San Joaquin Valley of California by Japanese immigrants during the nineteenth century. But after World War II and the Japanese internment, fruit production in that region dropped and many of the descendents did not continue the practice—which is, after all, not commercially viable—and that left only a few Japanese-American producers.Hachiya persimmons, which are cone-shaped, are too astringent to eat while they’re firm.\nTo make hoshigaki, you need Hachiya persimmons: the tannic, conical fruits that can’t be eaten raw until they’re near-rotting and pudding-soft. They’re peeled, air-dried, and individually hand-massaged, either every day or every few days, over three to five weeks. Ideally, this gentle fondling breaks down the hard pulp, smooths the outsides (where wrinkles can harbor moisture and mold), taps out internal air pockets, and encourages the natural sugars of the fruit to come to the surface in a crystalline bloom that one homesteader described as “white powder that looks like mold.” (Success!) When they’re finished, the hoshigaki are gently rolled with a pin to achieve even thickness and hammer out any last, mold-prone air bubbles. Finally, they are ready.Done correctly, a sliced hoshigaki should reveal a gelatinous, firm-yet-yielding cross-section with a concentrated, honeyed flavor and notes of cinnamon and gingerbread. The texture should be like that of a pâte de fruit. (If there was ever an appropriate time to use the words succulent and moist, now would be it.)This is the result that I wish for each time I give my persimmons a loving squeeze, carefully monitoring their girth and squish, marveling at how shriveled they’ve become. This is the goal that keeps from cutting them off their string and gobbling them up, in two easy bites, tonight.Where dried persimmon slices (spot them on the left of the plate) are a little leathery, hoshigaki are squishy, chewy, and plush.\nPhoto by Winnie AuHoshigaki-making is still alive and well in Japan, China, and Vietnam (which is where I first spotted them), and there has been a small but measurable revival in American-made hoshigaki in the last twenty years, too. In 2003, Joanne Neft, then director of Placer County California’s Agriculture Marketing Program and local foods advocate, noticed the number of persimmons going to waste and the scarcity of hoshigaki, one of her favorite treats. She convinced some of the region’s persimmon-growers and orchard owners, Japanese and otherwise, to preserve the disappearing art.These days, you can find hoshigaki at the Santa Monica Farmer’s Market or take a workshop to learn how to make them yourself. And chefs in the US have caught on, too. Before it closed, you could see hoshigaki hanging at San Francisco’s Bar Tartine, and in produce-whisperer Deborah Madison's 2012 book Seasonal Fruit Desserts: From Orchard, Farm, and Market, she pairs hoshigaki with fresh Fuyu persimmons, thinly shaved cheddar cheese, and toasted walnuts.If you look closely, you might find hoshigaki on the East Coast, too. Chef Greg Proechel of Ferris in New York is going to use his house-made dried persimmons in crudo, pairing their gummy-yet-syrupy texture with fish and meat. Frederico Ribeiro has a couple hanging in the back of his tiny tea shop Té Company, not sure yet how he’ll serve them. Judging from how long it takes hoshigaki to dry, he’s got a bit of time.You know what'd be good on this yogurt and fresh persimmon situation? Dried persimmons, that's what.\nPhoto by Michael Graydon and Nikole HerriottOf course, you can purchase hoshigaki. If you’re a less selfish wannabe-homesteader than I, you will not subject your roommate, your friends, or your pets to a dangling persimmon obstacle course. You will not ask them to massage them on the days you’ll be out of town. You will not have to carefully examine them for spots of mold (or, in my case, strands of cat hair). You will not have to wait quite as long to taste one.You could seek out the more common and less pricey gotgams or shibings, the Korean and Chinese dried persimmons that are neither air-suspended nor hand-massaged and are thus much less expensive.A packaged dried persimmon from Vietnam, where hoshigaki-making is alive and well.\nBut if it’s hoshigaki or bust, you can order a case from Otow Orchard or Penryn Orchard, both of which are in California, for about $45 a pound. Supply is limited due to seasonality, logistic constraints, and, at Otow, an aging workforce. Jeff Rieger of Penryn Orchard makes only 300 to 500 boxes per season, which means that if you're lucky enough to get a package, you need to savor them slowly.As for my two dried persimmons, I plan on eating a one-centimeter square per week and sharing with, approximately, no one. To give away this time-worn, loved and labored, amber-hued flavor nugget? Well, that would just be crazy.How One Dish Has Kept This Japanese Restaurant Around for 250 Years:Explore Bon AppétitDried FruitFruitPersimmonsJapanRead MorePersimmon BreadPersimmon Wedges with Toasted HazelnutscultureWe're Psyched When This Arugula Salad Takes Up Half Our Thanksgiving PlateBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Sarah Jampel"]}