{"id": "9dce7a4cd3bf96f44fa76463dca5d8a9", "url": "https://www.bonappetit.com/story/dont-like-zucchini-try-it-like-this", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Don't Like Zucchini? Try It Like This | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHaters, Be Gone: 3 Better Ways to Cook ZucchiniBecause it doesn't have to be squishy and under-seasoned. You deserve better.By Alex DelanySeptember 5, 2018FacebookTwitterEmailFacebookTwitterEmailZucchini—and, more generally, all soft summer squash—is one of the most unloved vegetables out there. And for good reason: Served up as a perfunctory, squishy, under-seasoned side at restaurants everywhere, we aren't given all that many reasons to like the stuff. But we would argue that the vegetable's withering reputation has a lot to do with operator error. When it's cooked poorly, it tastes bad. But that's not zucchini's fault! If you're a squash hater, there's a good chance that you just haven't had it prepared in a way that really made it sing. And we've got a few ideas for ways to cook it that are sure to convert.But before we get into those methods, we just want to provide one valuable piece of advice that applies in all cases. Summer squash needs to be seasoned heavily. It’s a porous vegetable that’s filled with water (not quite as much as a cucumber, but still quite a bit). That means that it wants a lot of kosher salt. Don’t be shy with seasoning. Okay, now that we've gotten that out of the way, here are three ways to prepare summer squash so it can live a glorious life on your plate all summer long.Jammy squash makes for great pasta sauce.\nThe Long CookWhen sautéed past the crisp-tender stage, zucchini can go mushy, which is a turn-off for a lot of people. But one of our favorite ways to enjoy summer squash is to really lean into that potential for \"softness\"—sounds better than \"mushiness,\" right?—by cooking it gently for an extended period of time with plenty of grassy olive oil, aromatics, and salt. This allows a lot of the water in the vegetable to cook out, concentrating its flavor and creating a jammy, silky, almost sauce-like texture. We like to simmer it until the squash has started to brown and really collapse, and then use that as the base for a simple summer pasta, a spread for toast, or a side for simply grilled fish or pork. However you serve it, hit it with some fresh herbs and a squeeze of lemon for contrast, and watch the haters fall in line.Charred on the outside, with a center that remains firm. That's the ticket.\nThe Tasteful CharDeveloping a serious char—for an appropriate dose of bitterness—on the outside of summer squash is a step in the right direction, adding complexity to what is otherwise a kind of \"meh\"-flavored vegetable. The secret is to figure out how to get plenty of color on the outside while keeping the interior al dente. To achieve that crucial balance, we get our grill or cast iron pan extremely hot before we cook our squash, and make sure to keep the pieces large—we keep baby ones whole and halve slightly larger ones—so that we can achieve effective caramelization before the inside is fully cooked. When those zucchini come off the heat, break them down into bite-sized pieces, hit them with a fresh-to-death vinaigrette, maybe a little salty cheese, and you'll forget all about all of the watery dishes of wan squash you've been subjected to over the years.It's time to give raw summer squash a chance.\nAlex LauThe Raw MoveWe’ve taken summer squash to its mushiest and most charred, so let’s turn around and go the other way. Let’s eat it raw. Raw zucchini’s texture is pleasantly crunchy, and when it's seasoned well it can be a real delight. Dicing zucchini and tossing it with herbs, spices, and vinegar creates a quick salsa for topping meats, seafood, tacos, tostadas, or just about anything else you’re feeling at the moment. Shaving zucchini into thin ribbons is another easy move for building a salad. Toss the raw zucchini in a simple vinaigrette with shaved radishes, carrots, or beets, and you’ve got a side dish that’s just as crunchy as it is refreshing. Give raw zucchini a chance. It deserves your time.It also works on a flatbread:Caramelized Zucchini FlatbreadThe most delicious solution to summer squash fatigue.View RecipeExplore Bon AppétitZucchiniSummer SquashBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-05", "author": ["Condé Nast", "Alex Delany"]}