{"id": "9dd034ea4f330a748ef9a6bff5353cd3", "url": "https://www.bonappetit.com/story/1971-kitchen-evolution", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "The 1971 Kitchen Was As Groovy As You'd Expect | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 1971 Kitchen Was As Groovy As You’d ExpectDouble ovens were all the rage, vinyl floors made for easy cleanup, and trash compactors were a status symbol.By Alex BeggsMarch 23, 2021FacebookTwitterEmailPhoto Courtesy Better Homes & Gardens / Meredith / William MarisFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.Oh, for a fridge with an ice maker! The 1971 kitchen was full of appliances that were slowly improving, one feature at a time. Don’t ask me why anyone would want a “portable” microwave, or, for that matter, to cook a pot roast in one. But there are many echoes from the 1971 kitchen that we see today—cooks wanted appliances to speed things up (microwave) or slow things down (meet something called the Crock-Pot). They were concerned with the environment, adding trash compactors and smooth-top electric stoves. And they loooved the color avocado. Well, maybe not everything’s the same.Tear Down That Wall1971: In the early ’70s, Americans were opening their kitchens into the living room, one half-wall at a time. Breakfast bars abounded! The kitchen was becoming a shared family and entertaining space, a place to pull up a stool and hang out.Photo Courtesy Cesar Rubio for Knock Architecture and DesignToday: No signs of going back. Just try to watch a home remodeling show without hearing the phrase “open concept.” Thanks, Joanna Gaines.This Is Garbage1971: Trash compactors, a buzzy new appliance in 1971, crammed a lot into a small space. Heathkit’s Minimizer could fit “an entire week’s trash for a family of four into a single, deodorized plastic-lined bag” for $379.95.Today: We’ve taken a lo-fi route: composting.Meet Your Mixmaster1971: The clutch move was to get your Sunbeam Mixmaster Mixer in a color-coordinated shade to match the rest of your kitchen (it came in Chrome, White, and—bet you’ll never guess—Harvest Gold or Avocado).Today: KitchenAid’s stand mixer comes in over 15 colors now, including color-of-the-year Honey, which reminds me of another color I saw in 1971 ads called rusty orange. It also comes in a cast iron black matte option that’ll outlive us all.Photo Courtesy iStock / Kevin RussPatterns Galore1971: Seeking shine without the burden of daily mopping and endless sweeping, Americans somehow thought tile print vinyl flooring, with its eye-crossing patterns and slight cushion underneath, was a sexy-cool-good idea. Until they learned that some manufacturers used asbestos.Photo Courtesy Popham DesignToday: Floors are boring, not-so-shiny neutrals now, made of things like laminate and “engineered wood.” It’s the backsplashes that get to have the fun, with tiles in funky designs and color schemes, as well as peel-and-stick adhesive tiles, which are popular among renters (although maybe not landlords).The Miraculous Microwave1971: For some reason in 1971, manufacturers thought people needed “portable” microwaves to, you know, take out on the patio. Hotpoint’s portable microwave could supposedly make an entire tuna casserole in 15 minutes, which might depend on your definitions of “make” and “casserole.”  Today: Microwave sales go up and down. A sassy salesperson at a Manhattan design center told me “you young people, nobody wants a microwave anymore!” I detected a hint of disappointment. Instead, some people are using their air fryers to reheat food. There’s also a rise in microwave-size “combination” ovens, like this new one from Dacor, which can microwave, cook with steam, or convection (circulating air)—a whole new category to get confused by, but I hear they make fantastic casseroles.Toast With the Most1971: Toasters were improving, inch by inch. The new four-slot Toastmaster had separate “his and hers” controls to solve a marriage spat I never knew existed. It featured extra-large vertical slots for your all-day toasting needs (the ad shows a toaster-size pizza going in at 6 p.m. ...worrisome).Today: Revolution’s touchscreen “smart toaster” makes toast so perfect you’d think they’re 3D printing it.Photo Courtesy Getty Images / H. Armstrong Roberts / Classicstock Double the Oven1971: In the “luxury class,” according to a survey in Ladies’ Home Journal, a kitchen would have two built-in ovens (a roast in one, a pie in the other). The “most-wanted” feature in an oven was self-cleaning, which was new technology coveted by the universal advertiser’s archetype: the housewife. (She hates cleaning! Free her from this tyranny!) “Smooth-top” electric ranges were “a snap to clean” and “a great spot for a party buffet” that appealed to both the environmentally conscious and lovers of tepid Swiss cheese pie.Photo Courtesy www.subzero-wolf.com Today: You can top a sleek Wolf built-in oven with the new combo steam-and-convection oven, which detects the weight of what’s inside to adjust cook time. The built-in oven connects to your Wi-Fi and comes with an app that lets you preheat from the couch. Progress!Iced Out1971: What a luxury it was to have a new Sears Coldspot fridge with a built-in ice maker in 1971 (“I won’t run out of ice in the middle of a party,” says a happy husband whose freezer is otherwise packed with peas in an ad), or Amana’s 5-Zone fridge with a temperature-controlled “butter conditioner.” You could also get your fridge in wood-paneling to match your counters.Today: The most popular fridge is a mammoth “French-door” style, with the freezer on the bottom. Recent models from LG make cubed, crushed, and Craft Ice™, perfectly spherical cocktail ice. To condition your butter, I dunno, just leave it on the counter. And while it doesn’t come in wood-paneling, True Residential’s line of luxury fridges does come in a range of bold colors to match your decor, including its newest shade, a moody blue-gray called Juniper.Photo Courtesy Smithsonian Institution / National Museum of American HistoryLife Comes at You Slow1971: Rival introduced the Crock-Pot in 1971. It came in eye-catching colors like avocado, of course, and “deluxe wood tone.” In The New Yorker, Janet Malcolm noted: “Everything you put in the Crock-Pot takes not minutes but forever to cook.”Photo Courtesy Instant-PotToday: The Instant Pot has usurped its place on our counters.Can Do1971: Westinghouse’s new Sesame electric can opener removed lids without shaving metal flecks into your soup, and it came in gold or avocado, of course.Today: In a plot twist, we’ve gone back to analog: hand-crank can openers like Oxo’s that take up a lot less space.Coffee Station1971: Automatic electric percolators like Mirro-Matic’s Cup-a-Minit (available in avocado green and harvest gold) were everywhere, but electric coffee grinders were new and marketed at the “increasing number of gourmets,” per the New York Times.Today: Imagine what these “gourmets” would say if they knew what coffee snobs of the future would be raving about: the Chemex, a manual, pour-over vessel invented back in 1941.Do-It-All Dishwashers1971: Dishwashers were improving, like KitchenAid’s latest model, which had a more powerful motor, a SaniCycle, and mediocre “air-drying” capabilities. Some came with “chopping block tops”—a built-in cutting board—for multitasking.Today: Dishwasher technology is now so advanced it’ll do your math homework while it dries the dishes in record speed, though you’ll pay for the luxury—see Thermador Sapphire’s StarDry for reference.Ambitious Blenders1971: Ronson’s Cook’n’Stir was a blender that did blender things, plus it had a heating component so you could blend and heat a soup all at once. It never quite took off. Ronson also made the Foodmatic, a big $295 “console” that was a blender, mixer, knife sharpener, juicer, meat grinder, shredder, slicer, and overall space-taker-upper.Today: Instant Pot reinvented the Cook’n’Stir in 2018 with its Ace blender, which makes watery ice cream and seems to have met a similar fate. Meanwhile, the German-made $1,500 Thermomix, which blends, weighs, stirs, and simmers, has stood the test of time since its 1960s debut and still has a cult following.Explore Bon AppétitDesignRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Alex Beggs"]}