{"id": "9ddb9bcbea7cc78c4512e2e8f4dacebb", "url": "https://www.bonappetit.com/story/liana-finck-food-pyramid", "year": 2020.0, "month": 2.0, "day": 4.0, "content": "Cartoonist Liana Finck Has Some Edits for the Food Pyramid | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCartoonist Liana Finck Has Some Edits for the Food PyramidThe USDA did not hire the incisive, witty illustrator to reimagine its nutritional guidelines, but we did.By Liana FinckFebruary 26, 2020FacebookTwitterEmailIllustrations by Liana FinckFacebookTwitterEmailCan Liana Finck read minds? Every time I see the latest cartoon she’s illustrated, I’m more convinced. A little sad, a little snarky, and very smart, they hit uncomfortably close to home for me and for the many others who follow her on Instagram, read her in the New Yorker, and buy her books. She puts to paper (and to the world) the sorts of thoughts that us timid folk can’t or won’t articulate. And no topic, including food, is spared.These alternative food pyramids, exploring all the idiosyncratic ways that we eat and the stories we tell ourselves about our consumption, are just one example of her incisive wit. They’re simultaneously more and less real than the USDA food guide pyramid some of us remember from school—as well as much funnier and, quite frankly, just as useful. Take a look for yourself. —Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-26", "author": ["Condé Nast", "Liana Finck"]}