{"id": "9de68780851d5fdb2ffb73f88023fdb2", "url": "https://www.bonappetit.com/recipe/roasted-salmon-salsa-verde", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Roasted Salmon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRoasted Salmon with Citrus Salsa VerdeBy Botanica Restaurant, LAApril 2, 20194.7(74)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintPaprika gives smoky, spicy balance to bright citrus and herb flavors. If your paprika has been hanging out in the back of the spice cabinet for longer than six months, though, it might be time to start fresh.Ingredients4 servings1shallot, very thinly sliced into ringsFinely grated zest from 1 orange, dividedFinely grated zest from 1 lemon, divided1Tbsp. plus ½ cup extra-virgin olive oil1lb. salmon fillet, preferably wildKosher salt½cup chopped cilantro½cup chopped parsley1small garlic clove, finely grated½tsp. smoked paprikaFresh juice from 1 orangeFresh juice from 1 lemonPreparationStep 1Preheat oven to 250°. Combine shallot, half of orange zest, half of lemon zest, and 1 Tbsp. oil in a small baking dish just large enough to fit salmon. Season salmon with salt and coat with zest mixture. Bake fish until fillet is just opaque in the center and flakes with a fork, 30–35 minutes.Step 2Meanwhile, mix cilantro, parsley, garlic, paprika, remaining zests, and ½ cup oil in a medium bowl. Stir in orange and lemon juice and season citrus salsa verde with salt just before spooning over fish.How would you rate Roasted Salmon with Citrus Salsa Verde?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangleI'm always looking for another way to fix salmon. As a Floridian, I'm jazzed about trying it with all the citrus.  Meanwhile, I HAD to check out the Karen - OMG, how funny.  I'm sure she is shading all the reviewers who make major changes then said it was really good or really bad hen they haven't even made anything close to the dish.  I'm right there with you Karen!  I also have to agree with Anonymous in MN.  Each year I get a little less enthusiastic about BA.  And yes, \"Snarky Sandy from Toronto\", I have cancelled my subscription.  Now I randomly pick up an issue on the newsstand if the cover looks intriguing, hoping it might have improved in my absence.   Still checking.  Remember when inside the back cover was a full page interview with someone notable about their cooking & eating habits? I always went to that page first.  When they boiled it down to \"Back of the Napkin\" I should have known their journalistic standards were slipping.  Alas, sadly, times have changed.  The once great ship has sailed ... away.  Thanks for those first 10-20 years BA.AJMerritt Island, FL2/7/2022I made this yesterday and it was quite delicious! \nI made a few little tweaks that I knew would work for our family taste buds.\n I added thinly slivered garlic to the shallots and lightly sauteed both in a pan before putting them on the salmon. I also drizzled a little bit of the citrus mixture about 10 minutes before I put the salmon in the oven (the citrus marinade and start cooking the salmon a bit). I didn't use as much oil as required by the recipe. My oven is a bit finicky so I baked it at 350 degrees and longer than the recipe stated and the salmon came out perfectly! And lastly, for the finishing, I drizzled sesame chili oil (Trader Joe's) instead of the olive oil for flavoring and a little kick. If I had chili olive oil I would've used that instead but sesame chili oil worked well.RolalaLos Angeles, CA12/11/2021Is Karen from 5/7/2021 ok? Should someone check on her?JeffSan Diego 12/10/2021Absolutely delicious! Salmon comes out perfectly medium rare. CatherineSan Francisco, CA9/30/2021I haven't even made this yet, I was scrolling reviews and Karen at 5/7/2021's review has me questioning life is they are not a troll. What in the actual F*. Anyways, I am sure this will be bomb.IanSan Jose, CA9/15/2021This was so easy and simply delightful! Had some limes so I added in lime juice and zest; loved the smokiness of the paprika.\nAnonymous from MN should just quit his subscription if he's so stuck in the 80s. Food has changed. Get used to it pal.Sandy from TorontoToronto8/26/2021Enjoyed this and it was easy to pull together. Such a great change of pace from our usual grilled salmon.   Not a cilantro fan, so I substituted fresh basil, that worked for my taste buds anyway.  The salsa seems to have versatility - as many other reviewers noted, you can add other flavorings per your taste.  Loved the way smoked paprika worked in the salsa!JimmyAshburn, VA6/4/2021Ya can't go wrong with slow-cooked salmon. I added a little honey and white vinegar to the salsa and it was heavenly!  The honey and vinegar rounded out the salsa... Also, no oranges but used a very sweet grapefruit. Perfection. Used the rest to add to my tequila cocktail! Also SUPER EASY! Might run the salsa through a mini Cuisinart next time? ShazzizNYC5/18/2021Not a favorite recipe. Didn't have salmon or citrus so I used canned anchovies and apple juice. Karen5/8/2021fish was good but did not care for the sauce. Maybe bc lemon and orange sizes and juiciness vary tremendously and what I ended up with did not work well flavor wise. A not again for us. Cécile4/17/2021I’ve made this recipe half a dozen times now and it does not disappoint! Never dry or bland it is a great staple recipe that comes out perfect again and again. AnonymousPortland, OR4/2/2021Very disappointing.  I don't like medium rare salmon, so cooked it for 15 minutes more than called for, but it was only okay.  Way too much sauce.  Try the Glazed Grilled Salmon from July, 1996, for a fabulous, no-fail recipe.   When I invite friends to dinner in the summer, their first question is, \"are we having 'the salmon'?\"  My mom gave me a subscription to Bon Appetit in the early 80's (yes, I am one of those awful \"boomers\"), and many of my favorite, go-to recipes are from the magazine, but I have been disappointed in it since Barbara Fairchild stepped down as editor.  The print has gotten smaller, and it seems to be geared to \"cooks\" who cannot lift their heads from their phones.  My favorite columns, \"Too Busy to Cook,\" and \"30-Minute Meals,\" are no more.  Okay, I am old, but I think the magazine is a shadow of its former self.  I can't remember the last time I found a \"keeper\" recipe.  AnonymousSt. Paul, MN11/15/2020Low and slow won the race for sure! This salmon I cooked for closer to 40 mins and I blended my salsa verde as well! My hubby loved it. AnonymousToronto9/8/2020Yes, this is a good recipe! 250 is the correct oven temp for beautifully-cooked salmon.Caroline BayHouston, TX8/15/2020really good and simple!Anonymous8/3/2020Explore Bon AppétitSalmonFishSeafoodParsleyHerbs & SpicesCilantroLemonCitrusFruitLimeWeeknight MealsMainNut-FreeGluten-FreeDairy-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-01", "author": ["Condé Nast", "Botanica Restaurant"]}