{"id": "9de8a2b198339cd60f91bce3aea83eb8", "url": "https://www.bonappetit.com/story/what-are-prebiotics", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "What Are Prebiotics and Do We Really Need to Take ANOTHER Supplement Every Day? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Are Prebiotics and Do We Really Need to Take ANOTHER Supplement Every Day?We asked a doctor for a gut check.By Aliza AbarbanelAugust 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWe're living in a time when grocery stores have \"fermentation aisles,\" our fridges are stocked with kombucha and small-batch sauerkraut, and it's somehow acceptable to drop the phrase \"gut health” in normal conversation. Yep, we're obsessed with probiotics, microorganisms that help rebalance the gut flora and support healthy gastrointestinal and immune functions. But more and more we're hearing about prebiotics, another thing we supposedly need to keep our guts—and just about everything else—up to par.Okay, but what are prebiotics?The difference between prebiotics and probiotics comes down to more than just a delinquent vowel. “Prebiotics are indigestible fibers that bypass your small intestine and head to your colon where they are fermented by the bacteria in your gut,” says Dr. Vincent Pedre, author of Happy Gut. Prebiotics occur naturally in foods like avocados, whole grains, and alliums like garlic and leeks, or you can buy prebiotic supplements. Look for capsules or powders that contain dietary fibers like inulin or FOS, which stimulate the growth of beneficial bacteria like Bifidobacteria.How do they make me healthier?“When prebiotics are fermented, they produce short-chain fatty acids like butyrate that help keep the colon healthy, maintain blood sugar balance, and even affect brain neuroplasticity,” says Dr. Pedre.  In other words, prebiotics are the fuel that probiotics use to regulate a well-functioning gut. As a dietary fiber, they help the microorganisms in our intestines grow, and they’re often taken to maximize a probiotic’s benefits.  You don't need to take a prebiotic for probiotics to work, but it can give the live bacteria a boost.Prebiotics can also help with common digestive issues like bloating and constipation, increase mineral bioavailability, and even promote satiety and weight loss. Some studies even posit that prebiotics can be beneficial for stress-related behaviors.  The benefits of prebiotics aren’t limited to humans—they’re also given to calves, poultry, and even farmed fish to increase growth and reduce the rate of respiratory and gut disease.Wooden Spoon's prebiotic powder uses herbs like burdock and elecampane.\nPhoto by Alex LauHow should I get my prebiotic fix?Prebiotics are filling up supplement shelves, but perhaps the best way to get them is through food like avocados, whole grains, and alliums. “If you're eating a wide variety of foods and spices, including scallions, leeks, and garlic, you should be able to get enough prebiotic foods in your diet,” says Dr. Pedre. “However, if you are sick with gut issues, then you will very likely need prebiotics to help rebuild your gut flora.” Prebiotic supplements range from capsules, which commonly include probiotics as well, to plant-based prebiotic powders.What are prebiotics doing in skincare?Our body’s microbiome is everywhere, so it’s no surprise that prebiotics are entering the world of skincare too. Cult French skincare line Orveda, whose vegan products harness the power of everything from kombucha to fermented marine enzymes, recently released a “prebiotic emulsion” fortified with Alpha-glucan Oligosaccharide. On the lower end of the price spectrum, La Roche-Posay offers a moisturizer containing “prebiotic thermal water.” These types of skincare products use prebiotics and probiotics to improve skin's surface protection, promoting smooth and heathy-looking skin.Is it possible to get too many prebiotics?Actually, yes. “This is one example where too much of a good thing may actually be too much,” says Dr. Pedre. “If you take too many prebiotics in the form of supplements (like resistant starch, for example), then you will very likely get bloated, gassy, and uncomfortable with abdominal pain. So, when incorporating prebiotics as a supplement, start low and go slow.” While prebiotics and probiotics are generally safe to consume, it’s best to speak with a medical professional, especially if you plan to take prebiotic supplements on their own.Let's get to the recipesIf you want to up your prebiotic consumption, perhaps the safest way to start is through eating more prebiotic foods. Luckily there are tons of options, including but not limited to avocado toast. Try hot-pink pearl onion pickles, blistered asparagus with peanut-coconut sprinkle, or an infinitely riffable batch of overnight oats, to support your body's microbiome in an effective (and undeniably delicious) way.Explore Bon AppétitHealthyishProbioticsTrendsRead MoreLifestyleWhat’s the Deal with Probiotics and Which Ones Should I Take?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Aliza Abarbanel"]}