{"id": "9e044dce843e7e3a240cf7edfe8e909b", "url": "https://www.bonappetit.com/recipe/barbaras-picnic-fried-chicken", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Barbara’s Picnic Fried Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueBarbara’s Picnic Fried ChickenBy Kwame AlexanderMay 25, 20214.4(59)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'Mytrek BrownEmailPinterestPrintEmailPinterestPrintUnlike many fried chicken recipes that use a combination of wet and dry coatings, this one, passed down from the author’s mother, Barbara Alexander, employs just generously spiced and seasoned flour. This allows for a thinner but still super-crispy coating. “My late mother’s fried chicken recipe was a link to my past—and to my daughter’s future. Frying chicken right can feel like riding a bike backward. Or writing a sonnet. It’s hard, sometimes elusive. But there is a form to guide you, and with practice you can find the flow.” Read more about this fried chicken recipe and it’s significance to Kwame here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDeep-Fry Thermometer$29 $16 At AmazonDutch Oven$80 At AmazonCast Iron Skillet$30 At AmazonWire Rack$23 At BA MarketIngredients4 Servings¾tsp. ground cumin¼tsp. smoked paprika5tsp. Diamond Crystal or 2½ tsp. Morton kosher salt, divided2¾tsp. garlic powder, divided2½tsp. freshly ground black pepper, divided13-lb. chicken, cut into 10 pieces (2 wings, 4 breasts, 2 thighs, and 2 drumsticks)2cups all-purpose flour1Tbsp. mild curry powder1tsp. paprikaVegetable oil (for frying; 4–5 cups)special equipmentA deep-fry thermometer; a brown paper bagPreparationStep 1Mix together cumin, smoked paprika, 3 tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, ¾ tsp. garlic powder, and ½ tsp. pepper in a small bowl.Step 2Arrange chicken on a rimmed baking sheet; sprinkle all over with spice mixture. Let sit at room temperature 30 minutes, or chill, uncovered, up to 12 hours.Step 3Combine flour, curry powder, paprika, and remaining 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt, 2 tsp. garlic powder, and 2 tsp. pepper in a medium paper bag. Close bag and shake well to combine. Add chicken to bag, close, and shake well to coat.Step 4Pour oil into a large cast-iron skillet or Dutch oven to come 1\" up sides; clip thermometer to sides of pan and heat oil over medium-high until thermometer registers 350°. Working in 2 batches and returning oil to 350° between batches, cook chicken pieces, turning halfway through, until deep golden brown, 10–15 minutes per batch (an instant-read thermometer inserted into each piece should register 160° for light meat and 165° for dark). Transfer fried chicken to a wire rack and let cool slightly before serving.How would you rate Barbara’s Picnic Fried Chicken?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleSlightly underseasoned to my taste (touch more salt and pepper), but everyone else loved it. Used peanut oil instead of vegetable oil.\n\nWould make again. MarcVineyard Haven, MA7/30/2021This was awful I nearly burned my house down. Have had much better.Brushjlsolon, oh7/16/2021I made this last night with some adaptations for a family gathering where half of us are gluten- and nightshade-free. I omitted the paprikas, used an AIP-friendly homemade curry blend, and swapped in cassava flour for the all-purpose. It was a total hit! The curry powder smelled strong in the dry flour mix but didn't read as curry in the final product, just a beautiful spice blend. I could have probably halved the flour coating as not a lot seemed to stick, but it still gave a nice crunch. (Also, cassava flour can be pricey and it pains me to waste it. We saved and froze the excess to use on another batch sometime.) I had the pieces uncovered in the fridge for about 6 hours before breading and frying, and next time may just do the 30-minute room temp method to see if that helps more coating stick. We also had a great bird: a pasture-raised smallish chicken from a local craft butcher who chopped it up for us. Really looking forward to making it again!MórNew York, NY7/12/2021What is this \"spoiled milk\" everyone is talking about??  Buttermilk is NOT spoiled milk, it's just the leftovers from making butter or simply milk with a little vinegar/lemon juice added to it. Spoiled would imply that it is past it's safe-to-consume-by date, which buttermilk is not. Ya'll have issues if you think sour cream or buttermilk is spoiled.Anonymous7/9/2021My wife has celiac.  Any ideas about replacing the flour with something gluten free?  Corn starch? Rice flour? A blend of flours? I hesitate to use a ready made blend as they usually have xantham gum which might be counter productive.  Thanks.MSFDetroit7/9/2021Yes! Someone finally posts a real SOUTHERN fried chicken recipe. No self respecting southerner would ever use spoiled milk to make chicken. This is how we do it, cut the chicken up, flour it, then fry it. Shame she threw the backs away, thats my fave piece.\nAce DavisFrom NC, live in Hawaii6/21/2021New Jerseyan here visiting family in Mississippi... I just read this article to my 83-year-old momma and she said, “Well, people can season it however they want to, but the real secret is finding itty-bitty chickens and cutting them up yourself.”  An itty-bitty chicken (2 1/2 lbs or so) are near ‘bout impossible to find, but we found two at the Winn-Dixie this weekend.  It remains the best chicken I’ve ever eaten...in momma’s words, “Tastes like the yards birds from my childhood.” By the way, she uses salt and black pepper only.JonChesterfield, NJ6/13/2021Pamme, you can strain the oil into a jar, refrigerate it and reuse it numerous times. When time to dispose of it just put the jar of old oil into the garbage for pickup.MickeySouthern California 6/12/2021Can anyone tell me how you dispose of the leftover oil? I am on a septic system and never want to fry because I don't know how to get rid of the oil.Pamme6/12/2021I made this last evening. It is unimaginably delicious. I followed the recipe exactly. This will now be a staple in our home. It makes a delicious sandwich as well, on a buttered, toasted bun and just a few sweet pickles. Heaven. AnonymousPark City, Utah 6/8/2021Thank you! This is the first time I’ve read a recipe for fried chicken that is like my mother’s. In her case it was just flour, salt, and pepper, but the key is definitely the brown bag!AnonymousPortland, OR6/8/2021Thank you for sharing your mother's fried chicken recipe. I feel the preciousness in your rendition and of comments left by those of us who were lucky enough to have mom's who made us fried chicken, recipes that became our favorite family recipe of all. Everyone in our family grew up relishing my mother's fried chicken, marveling at its simple perfection. To this day, we remember and long for it, as she left us in 2007. I loved being taught my mother's recipes and made a point to watch her make her fried chicken so I could at least try to mimic her method and maybe come close to hers (futile, as she had the magic touch). She used to tell me her mom's and grandma's fried chicken were much better than hers, which I cannot even imagine. \nMy mother was midwestern, born and raised in Chicago. Her recipe used only well-but simply seasoned flour, similar to this recipe, on chicken pieces that were rinsed and patted dry. No egg, no milk or buttermilk, etc. And the method matches this one - the chicken pieces were shaken in a medium paper bag. When I read that in this method, I decided I had to chime in on the reviews! I still do it this way to this day. And all she used to season the flour was salt and pepper, and instructed me to be sure to use PLENTY of each so the flour was really well seasoned. In a frying pan, with about 1/2 inch or so of a combination of oil and butter, letting it get really brown and crusty on each side before turning. Also, no poking the chicken while it's cooking - that releases the juices that would be missed while biting into it:) \nI would only add, I don't think we have to call this southern fried chicken, just fried chicken. For my brother's birthday, and my son's, to this day, I make them fried chicken, mother's way. They love nothing more. Thank you for sharing your recipe and i'll give it a try!JeanDel Mar, CA6/8/2021Im from New Orleans, never heard of fried chicken without the skin on it, or seasoned with cumin ,or curry powder either.AnonymousNew Orleans6/7/2021To Anonymous: Fellow Southerner here, NC. Far as I know, REAL Southerners, as you call them, come from any of a dozen or so heritages and traditions and mostly cook accordingly. Just like with 'cue or pimento cheese, I've seen more versions of Southern fried chicken than I can count. Sad to say, I don't make my grandmothers' (NC and TN) because I didn't pay enough attention back then. But I'd make Kwame's mother's any day, tho' probably without the thermometer.SusanNC6/5/2021Fried chicken ALWAYS has skin on. John Smith NYC6/3/2021Explore Bon AppétitFried ChickenSouthernAmericanChickenPoultryPaprikaHerbs & SpicesSummerMainDairy-FreeDeep-fryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Kwame Alexander"]}