{"id": "9e0ee9127a1b30fa975ab9c53a383bb3", "url": "https://www.bonappetit.com/recipe/pork-floss-and-seaweed-pull-apart-rolls", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Pork Floss and Seaweed Pull-Apart Rolls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork Floss and Seaweed Pull-Apart RollsBy Kristina ChoOctober 15, 20215.0(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThese pillowy, savory buns come from the tantalizing pages of Kristina Cho’s Mooncakes and Milk Bread: Sweet and Savory Recipes Inspired by Chinese Bakeries, a delicious homage to Chinese bakeries and their iconic confections. The buns get their ultrasoft pull-apart texture from tangzhong, a cooked paste of milk and flour incorporated into the dough that keeps the baked buns moist. They’re filled with pork floss (also known as pork sung), sweet and salty wisps of dried pork that resemble cotton candy and melt in the mouth. The combination of pork floss, mayo, and dried seaweed is popular in Chinese bakeries, and once you sink your teeth into one of these rich treats, you’ll know why.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonScale$25 At AmazonPork Floss$4 At Weee!Small Offset Spatula$6 At AmazonLarge Bowl$18 At AmazonSmall Saucepan$155 At AmazonIngredientsMakes 8Dough1cup milk, divided2Tbsp. plus 2⅔ cups (333 g) bread flour, divided, plus more for surface1tsp. active dry yeastA pinch plus ¼ cup (50 g) sugar1large egg½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt4Tbsp. unsalted butter, room temperature, cut into pieces1tsp. vegetable oilFilling and assemblyAll-purpose flour or bread flour (for surface)½cup mayonnaise, preferably Kewpie1cup pork floss¼cup thinly sliced scallions2Tbsp. furikakeNonstick vegetable oil spray1large egg1Tbsp. milk or heavy cream1tsp. toasted sesame seedsPreparationDoughStep 1Cook ¼ cup plus 3 Tbsp. milk and 2 Tbsp. bread flour in a small saucepan over low heat, whisking constantly, until thickened to a paste, 2–3 minutes. Transfer tangzhong to a small bowl and let sit until warm (it should resemble mashed potatoes), 5–10 minutes. Clean saucepan and reserve.Step 2Bring remaining ½ cup plus 1 Tbsp. milk to a gentle simmer in reserved saucepan over medium heat (watch carefully as milk tends to boil over). Pour milk into another small bowl and let cool until warm to the touch (about 110°). Stir in yeast and a pinch of sugar and let sit until foamy, 5–10 minutes.Step 3Combine egg, salt, remaining 2⅔ cups bread flour, and remaining ¼ cup sugar in the bowl of a stand mixer fitted with a dough hook. Add tangzhong and yeast mixture and mix on low speed until a shaggy dough forms. Add butter 1 piece at a time, mixing until fully incorporated after each addition before adding more. Increase speed to medium-high and continue to mix dough until tacky and slightly sticky, 8–10 minutes.Step 4Transfer dough to a lightly floured surface. Wet your hands to prevent dough from sticking, then pull and pinch ends of dough to form a smooth ball.Step 5Coat a large bowl with oil. Place dough in bowl and gently turn to coat. Arrange seam side down and cover bowl with plastic wrap. Let sit in a warm, draft-free spot until doubled in size, about 2 hours. (Alternatively, you can chill 8–12 hours).Filling and assemblyStep 6Roll out dough on a lightly floured surface to about an 18x10\" rectangle. Using a small offset spatula, spread mayonnaise over surface of dough, leaving a ½\" border around edges. Sprinkle 1 cup pork floss, then scallions and furikake evenly over mayonnaise. Roll up dough from a long side to form a tight log and pinch seams together to seal. Turn dough log seam side down and, using a sharp knife, trim 1\" off each end; discard. Slice log into 8 equal portions.Step 7Coat a 10\"-diameter cake pan with nonstick spray. Arrange rolls in pan, leaving a small gap between each roll. Cover pan with a damp kitchen towel and let sit in a warm, draft-free spot until buns are doubled in size, 1–1½ hours.Step 8Preheat oven to 350°. Whisk together egg and milk in a small bowl. Lightly brush tops of rolls with egg wash, then sprinkle sesame seeds evenly over.Step 9Bake rolls until golden brown, 25–28 minutes. Transfer pan to a wire rack and let rolls cool in pan until warm, or serve room temperature.Do ahead: Rolls can be baked 4 days ahead. Let cool completely; transfer to an airtight container and chill, or freeze up to 3 months. Reheat chilled buns in a 300° oven until soft and warmed through, about 5 minutes, or 30–45 seconds in a microwave. Frozen buns can be reheated on a baking sheet in a 350° oven 10–15 minutes.Taken from ‘Mooncakes and Milk Bread’ by Kristina Cho. Copyright 2021 by Kristina Cho. Used by permission of Harper Horizon, an imprint of HarperCollins Focus LLC.\n\nBuy it on Amazon.com or Bookshop.orgHow would you rate Pork Floss and Seaweed Pull-Apart Rolls?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleDelicious! Bread is one of the tastiest and I bake quite a bit.BIZEGIRLProvidence, RI2/6/2022Delicious and easy to make, will definitely make more. Though it would be better if flour weight is shown in the steps.Anonymous1/8/2022Strange and delicious! I don't own a stand mixer so made the dough the old fashioned way with great success (just a little extra kneading time). I was heavy handed with the mayo and pork floss which worked in my favor. I could have cut back or even omitted the furikake as its funk sort of took over the end result bun. Almost wished there was some sort of dipping sauce included... Would make again and will be on the lookout for other pork floss recipes (I have a whole 1lb jar now!)Izzy SiedmanPortland, ME1/2/2022These are really good and the directions are spot on, but I personally would cut the furikake in half. To me it over powered the rest of the flavors (maybe it's the brand I used). Still delicious though!Lou L.Harrisburg, PA12/19/2021Great recipe!  This is a modern version of Chinese pork floss buns you usually get from Chinese bakeries, with the addition of furikake and sesame.  I noticed the called amount of yeast is less than other milk bread dough recipe, which means the dough will need to proof longer.  That is fine as it gives more time for the bread dough to develop flavor.  In my warm and humid kitchen, the dough needed 2 hours of initial proofing, while typical milk bread usually takes only 1 hour.  Definitely will make again. AnonymousAustin, TX12/6/2021These were delicious!  I was curious about the pork floss so I ordered it, followed the recipe exactly and it was picture perfect.  The dough is soft and almost sweet, complimented by the salty and umami flavors of the filling.  Will definitely make it again.BDSCGreenville SC11/22/2021Solid recipe! Made these today, following the directions more or less to a T, and they came out very picturesque and flavorful. The furikake we have is extra pungently fishy and brought a nice basenote of funk to the sweetness of the role and the mayo. A heavy hand with the pork floss and mayo also paid off in flavor/dough texture. \n\nAs my partner and I leaned over the counter eating our warm rolls I did comment that I would have liked some added umami and salinity, maybe via pieces of hot dog. Or a bit of Chinese sausage. SamPortland, OR10/19/2021Details of making bread—>superb (for a non-baker). The final product was just like the picture.  What light fluffiness and intense flavour combo with kewpie, furikake and pork floss😛👍🏼👍🏼. My first time trying so 4 stars from little ol’ me…in little ol’ NZ🇳🇿AnonymousNelson, NZ10/17/2021Explore Bon AppétitBreadPorkMeatChineseEast AsianAsianRollsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-15", "author": ["Condé Nast", "Kristina Cho"]}