{"id": "9e1ce9096b54451e2434359d5af1f3b9", "url": "https://www.bonappetit.com/recipe/ratatouille-pasta", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Ratatouille Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRatatouille PastaBy Sarah JampelAugust 11, 20194.8(66)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolEmailPinterestPrintEmailPinterestPrintIf we were to round up an all-star team of summer's greatest produce, it'd look a little something like ratatouille: Eggplant and zucchini. Peppers and tomatoes. The gang's all here! By cooking them until they're caramelized and just starting to fall apart, you'll get a jammy sauce that's practically begging to be mixed into pasta and turned into a spectacular vegetarian dinner. Capers add a briny punch, Parmesan provides much-needed salt, and lemon juice brightens everything up. And if pasta's not in your cards, just stop before you boil the noodles and serve the ratatouille alongside salad or slow-roasted fish.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAColander$11 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonDutch Oven$80 At AmazonSpatula$12.99 At AmazonPlate$55 At Bon Appétit MarketLarge Pot$55 At AmazonWooden Spoon$6 At AmazonIngredients4–6 servings1large or 2 medium Italian eggplants (about 1½ lb.)Kosher salt1large or 2 small red bell peppers (about 9 oz.)1large zucchini (about 8 oz.)2medium onions1pint cherry tomatoes4garlic cloves1lemon1½oz. Parmesan½cup extra-virgin olive oil, divided, plus more for drizzling¼cup capers½tsp. crushed red pepper flakes, plus more for serving1lb. cavatappi1½cups basil leaves, torn if large, plus more for servingPreparationStep 1Cut 1 large or 2 medium Italian eggplants into ½\" pieces. Transfer to a colander set over a medium bowl and sprinkle with 2 tsp. salt. Let sit 30 minutes. Your eggplant might start to discolor and should start to release some brownish liquid that will fall into the bowl below. That’s good! It’s losing excess moisture that would prevent it from getting silky-soft.Step 2Meanwhile, cut 1 large or 2 small red bell peppers and 1 large zucchini into ½\" pieces. Transfer to a medium bowl. Peel 2 medium onions, cut through root end, then slice through root end into thin slivers. Transfer to bowl with bell peppers. Halve 1 pint cherry tomatoes (the fastest—but dorkiest—way to do this is to sandwich them between two quart container lids) and transfer to a small bowl. Smash 4 garlic cloves, then coarsely chop and add to bowl with tomatoes. Slice 1 lemon in half; set aside. Finely grate 1½ oz. Parmesan with a Microplane or the small holes of a box grater into another small bowl.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Your eggplant needs special treatment: Cooking it separately guarantees that you can make it tender and golden (rather than chewy and gray) without over-cooking it or causing the other veg to get soggy. When eggplant has been sitting 30 minutes (okay, 25 if you’re antsy), gently squeeze it to get rid of any more moisture (less moisture means more browning). No need to go crazy, though.Step 4Heat 2 Tbsp. extra-virgin olive oil in a large Dutch oven or heavy pot over high until shimmering. Once hot (test with one piece for starters!), add half of eggplant and stir to coat in oil. Cook, stirring every 3 minutes or so (you want to leave it undisturbed while also making sure lots of pieces get their time against the hot pan), until eggplant is golden, with some pieces starting to brown and char, 5–7 minutes. Reduce heat to medium if eggplant is browning too quickly. Using a slotted spoon or fish spatula, transfer to a plate. If any eggplant pieces stick, just scrape them up—no biggie. Heat 2 Tbsp. extra-virgin oil over high. Cook remaining eggplant using same process, 5–7 minutes. Transfer to plate with cooked eggplant.Step 5Scrape off any bits of eggplant from pot if needed (no need to wipe out). Heat ¼ cup extra-virgin olive oil over medium-high. Add ¼ cup capers and ½ tsp. red pepper flakes (don’t be alarmed if capers sputter and foam—it’s because they’re wet!). Cook, stirring, until bubbling subsides, 30–60 seconds.Step 6Add onion-pepper mixture, season with 1½ tsp. salt, and cook, stirring frequently, scraping bottom of pan, and reducing heat if vegetables are getting too brown, until vegetables are softened, slumped, and have started to take on lots of color, 12–15 minutes. Meanwhile, bring a large pot of generously salted water to a boil (this is for your pasta).Step 7Add tomato-garlic mixture to sauce, reduce heat to medium-low, and cook, stirring occasionally with a wooden spoon, until almost all tomatoes have burst and vegetables are starting to break down and deeply caramelize, about 10 minutes. Keep an eye on it and reduce heat if veg is getting too dark for your liking.Step 8Finish the sauce: Return eggplant to pot and cook until vegetables are tender but the vegetable pieces are still distinct (you don't want total mush), about 5 more minutes. Taste and season with salt.Step 9Add pasta to boiling water right after you add the eggplant, stirring occasionally, until al dente. Before draining, scoop out 1 cup pasta cooking liquid with a liquid measuring cup.Step 10Now the exciting part: Ratatouille and pasta join forces as one. Reduce heat over sauce to low. Add drained pasta and stir to coat in sauce. Add 1 cup Parmesan, pour ½ cup pasta cooking liquid over, then stir vigorously with a rubber spatula or wooden spoon until a creamy sauce forms with no clumps of cheese. Add more pasta cooking liquid as necessary if pasta starts to stiffen. Remove from heat. Squeeze juice from ½ lemon over, then stir in 1½ cups basil. Taste for salt and lemon juice.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 11Divide pasta among bowls. Top with cheese, basil, and red pepper flakes. Drizzle with oil. Don’t be sad if you can’t finish it all: It’s even better as cold leftovers.How would you rate Ratatouille Pasta ?Leave a ReviewTell us what you thinkReviews (31)Back to TopTriangleAbsolutely stellar.  My American husband had never tasted ratatouille and was very hesitant.  He LOVED it. As did I.  I followed the recipe every step of the way and only excluded the capers - even though some found those essential - neither of us like the taste of them. I picked the tomatoes, basil, onions, and garlic from our vegetable garden. \n Thank you for this recipe.Marion MacGillivrayGrass Valley, California8/7/2021Great recipe, amazing taste, the pasta has to be in half portion NoorLebanon8/2/2021This pasta dish was so delicious and pretty easy to make.  It was very creamy and flavorful and with all of the veggies, downright healthy-ish.Amanda C.7/22/2021This was an amazing dish! Loved the combination of flavors. It's now in my top pasta recipes. Prep and cook time does take a second (a little over an hour for me), but so worth it. Followed everything to a T and it turned out great. LizzieMonterey, CA5/12/2021This recipe was delicious! I added only 1/2 cup cheese and it still turned out really good. Would definitely make again!AnonymousCA1/21/2021Man, that was a great dish. Thanks for teaching me a new way of cooking eggplant. Easy to follow and the little videos were adorable. I think I might have to have seconds! Highly recommended. Bon Appétit! LisaVancouver, Canada1/3/2021Great flavor, easy to cook, and little cleanup. Will definitely make again and recommend to others! Followed recommendations to use half of the recommended pasta which was a perfect ratio. AnonymousFrederick, Maryland12/7/2020Yum!! This is not the first ratatouille recipe that I've tried, but it is the BEST. The capers make such a huge impact on the flavor. I used the full amount of vegetables and all other ingredients, but only half of the pasta because there are just two of us. I actually thought this ratio was perfect (maybe I like a lot of veggies). AnonymousHudson, oh10/1/2020Oohh..this is a good recipe! The flavors were excellent.  Even better as left overs! My only modifications were, Red Chili Flakes instead of Red pepper flakes, and I added too much water, and didn't have enough parmesan cheese, so I added about 1/4 c of half and half.lecknoxSF Bay Area9/17/2020The pasta is good. The writing and the breakout/organization of this recipe is some of the worst I've ever seen. Can Bon Appetit afford copyeditors or only telegenic white people?AnonymousRhode Island8/2/2020This may be my favorite recipe Bon Appetit has ever put out--so delicious! The cooking instructions for the eggplant are so proficient and easy. I love the taste of all of these fresh vegetables together, such a great texture. The basil and lemon there at the end are a great touch, don't skip it. heyguysitsmerobNorth Carolina6/2/2020This recipe absolutely SLAPS. It's so so so good and makes huge servings- I would say 6-8 servings unless everyone is super hungry. But it's almost even better the next day!paigepoeHouston, TX5/28/2020I have never cooked eggplant before and I was a bit nervous but the instructions were perfect! The end result was absolutely delicious - I've never been so proud of myself before lmao.AnonymousNew York USA5/20/2020This recipe was amazing! I added a bit of tomato puree for some extra flavour. AnonymousGermany4/7/2020Amazing dish! The pasta water and the parmesan transforms the jammy vegetables into a luscious sauce. The highlight were the zucchinis and the eggplant! Was a hit with the girlfriend will make again. AnonymousLos Angeles3/6/2020Explore Bon AppétitPastaItalianEuropeanEggplantVegetableBell PepperZucchiniSquashTomatoCavatappiPasta & NoodlesSummerEasyWeeknight MealsMainSideNut-FreeVegetarianSautéLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-11", "author": ["Condé Nast", "Sarah Jampel"]}