{"id": "9e2492c26e0154d57c20c62d3f8a0d74", "url": "https://www.bonappetit.com/recipe/oat-and-pecan-brittle-cookies", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Oat and Pecan Brittle Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOat and Pecan Brittle CookiesBy Claire SaffitzDecember 4, 20204.5(188)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThese oversized, undulating, oaty-butterscotchy-toasty cookies get their crispy-edges and chewy center from a few essential moves. It may feel cruel to have to wait, but the dough MUST rest overnight. “By chilling in the fridge, the dough ‘cures,’ and the sugar further dissolves, contributing to a chewier texture,” Claire explains. “The rest also allows the flour to fully hydrate and the fat to solidify, so you get the most pleasing spread and wrinkly surface during baking.” If you’d like to skip making the pecan brittle, substitute 8 oz. (227 g) toffee bits, such as Heath Bits o’ Brickle (often found in the baking aisle of the supermarket), instead. You should still toast the pecans and grind half into the flour mixture, then add the rest to the dough along with the toffee bits and remaining oats. This recipe was adapted from Claire Saffitz’s new cookbook, ‘Dessert Person, Recipes and Guidance for Baking with Confidence.’IngredientsMakes about 18Pecan brittle1¼cups (142 g) coarsely chopped pecans¾cup (150 g) granulated sugar4Tbsp. (½ stick) unsalted butter½tsp. baking soda½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltCookies1cup (2 sticks) unsalted butter, cut into 16 pieces, divided1⅓cups (173 g) all-purpose flour2tsp. Diamond Crystal or 1 tsp. Morton kosher salt1tsp. baking soda2cups (200 g) old-fashioned oats, divided¾cup (packed; 150 g) dark brown sugar½cup (100 g) granulated sugar2large eggs1Tbsp. vanilla extractPreparationPecan brittleStep 1Place a rack in middle of oven; preheat to 350°. Toast pecans on a small rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool.Step 2Line another small rimmed baking sheet with a Silpat baking mat. Cook granulated sugar, butter, and 2 Tbsp. water in a small saucepan over medium-low heat, stirring gently with a heatproof rubber spatula, until sugar is dissolved. Increase heat to medium and bring syrup to a rapid simmer. Cook, without stirring, swirling pan often, until syrup turns a deep amber color, 8–10 minutes. Immediately remove saucepan from heat and stir in pecans. Once pecans are well coated, add baking soda and salt and stir to incorporate (mixture will foam and sputter as baking soda aerates caramel). Working quickly (it will harden fast), scrape mixture onto prepared baking sheet and spread into a thin layer. Let cool completely, 5–10 minutes. Chop into pea-size pieces; set aside.CookiesStep 3Place half of butter (½ cup) in the bowl of a stand mixer. Bring remaining butter to a boil in a small saucepan over medium-low heat, stirring often with a heatproof rubber spatula. Cook, scraping bottom and sides of pan constantly, until butter sputters, foams, and, eventually, you see browned bits floating on the surface, 5–7 minutes. Pour brown butter over butter in stand mixer bowl, making sure to scrape in all the browned bits. Let sit until butter begins to resolidify, about 30 minutes.Step 4Pulse flour, salt, and baking soda in a food processor to combine. Add half of reserved pecan brittle and 1 cup oats; process in long pulses until oats and brittle are finely ground.Step 5Add brown sugar and granulated sugar to butter and beat with paddle attachment on medium speed until light and smooth but not fluffy, about 2 minutes. Scrape down sides of bowl and add eggs and vanilla. Beat until very light and satiny, about 1 minute. Scrape down sides of bowl and add flour mixture; beat on low speed until no dry spots remain and you have a soft, evenly mixed dough. Add remaining half of brittle and remaining 1 cup oats; mix on low speed just to distribute. Fold batter several times with a spatula to ensure everything is evenly mixed.Step 6Using a 2-oz. scoop or ¼-cup measuring cup, scoop level portions of dough to make 18 cookies. Place on a parchment-lined baking sheet, spacing as close together as possible (you’ll space them out before baking). Cover tightly with plastic wrap and chill at least 12 hours and up to 2 days. (If you’re pressed for time, a couple hours will do; cookies just won’t be as chewy.)Step 7When ready to bake, place racks in upper and lower thirds of oven; preheat to 350°. Line 2 large rimmed baking sheets with parchment paper. Arrange 6 cookies on each prepared baking sheet, spacing at least 3\" apart.Step 8Bake cookies, rotating baking sheets top to bottom and front to back after 12 minutes, until dark golden brown around the edges, 16–20 minutes. Let cookies cool 5 minutes on baking sheets, then transfer cookies to a wire rack with a spatula and let cool completely.Step 9Carefully move a rack to middle of oven. Arrange remaining dough on one of the baking sheets (it’s okay if it’s still warm). Bake as before (this batch might go a bit faster).Do ahead: Dough can be formed 2 months ahead; chill dough balls at least 2 hours before transferring to freezer. Once frozen solid, store in resealable plastic freezer bags and keep frozen. No need to thaw before baking, but you may need to add a minute or two to the baking time. Cookies can be baked 5 days ahead; store airtight at room temperature.Reprinted from Dessert Person. Copyright © 2020 by Claire Saffitz. Photographs copyright © 2020 by Alex Lau. Published by Clarkson Potter/Publishers, an imprint of Random House, a division of Penguin Random House.\n\nBuy from Amazon or Bookshop.How would you rate Oat and Pecan Brittle Cookies?Leave a ReviewTell us what you thinkReviews (56)Back to TopTriangleI just made the brittle; the cookie is unappealing :). The brittle is delicious and simple to make.Justin Other MikeSan Francisco12/4/2021I initally thought wow lots of steps, but went for it anyway.  The extra steps that take time.  I simply make the brittle, then later make the dough and form cookies, stick them in fridge and next morning when I get up, turn on oven  and when ready pop them in. My family and neighbours think these are The Best!!! I have included them in Christmas pkgs far away - they travel well and are loved by many.Sheila C. Ontario, Canada10/18/2021First time the cookies came out great. The best cookies I ever made!  Today, they are fat and didn’t spread out like a baby’s face. Any idea why?DadoGA5/28/2021These cookies are far from bad but I feel like they're missing something. With how long they took to make, I probably won't be making them again. That being said, the recipe was easy to follow and everything worked out for me. Anonymous4/7/2021I contemplated making these for weeks and finally dove in during a winter storm kind of day. These were acceptable, not terrific to die for cookies. I had no troubles following the recipe closely and everything turned out as described by the author. The cookies were great warm right out of the oven but when they cooled off they were too soft and flexible, almost floppy. I was looking for crunch from the brittle but got a sense of a lump of sugar in my mouth instead. They were a good deal of work to make . They would have to be fabulous to make again and they weren’t unfortunately.AnonymousColorado3/18/2021Parchment cookie sheet liners are a must, since some of the candy can melt into little pools on the edges of the cookies. Ping-pong ball sized cookies work better than smaller sizes, i.e. six cookies per standard sheet rather than 9-12 which I tried at first. The recipe isn't kidding about the long chill time. I got much much better results after I forgot about the dough in fridge for a day compared with the first batch baked after 10 hours in the fridge. I still had craters of melted candy and a few pools of it at the cookie edge but it's still pliable a few seconds out of the oven so you can just reshape then. This recipe is definitely a keeper. If I can do it, anyone can.joao da silva3/4/2021These are worth the effort. A little time consuming, but the extra dishes aren't too bad. If you're having trouble with the toffee try doubling the water to start, swirl the pan often, and use a wet pastry brush to wipe down the sides of the pan after each swirl. The extra water takes longer to cook out and take on the right color, but I always gets a successful caramel or toffee using that method. I made smaller cookies with a 1.5 oz scoop and they were done at around 11 minutes, check your cookies early because they get dark very quick. I will definitely be making these again!AnonymousMinnesota2/28/2021I have two batches of sugar-coated pecans and no brittle. Like another reviewer, no sputter when the baking soda and salt were added. Both batches seemed fine—no burnt bits, nice color—but then no results. With the second batch’s syrup looking the same as the first, I checked the temperature. It was 260 F, but an internet search recommended about 300 F for toffee. I could have cranked the heat up and hoped for no burning even though 10 minutes had gone by, but decided instead to give up on this recipe and use the batches in pecan ice cream.AnonymousSacramento, CA2/28/2021Like every recipe in Dessert Person, these cookies are absolutely delicious and are definitely worth the few extras steps. The cookie dough is arguably even more yummy than the baked cookies so I'm making this recipe again today just to have frozen dough to eat :) AnonymousSan Francisco, CA2/20/2021So many steps, but so worth it! The only thing I changed was I scooped 1oz dough balls instead of 2oz. I ended up making 36 cookies instead of 18. They were still a good sized cookie and oh so delicious. Yes, not a quick and easy cookie, but definitely worth it once and a while! Plus, super easy to freeze the dough, so make a double or triple batch and freeze the extra. It was my first time making brittle as well, and this method worked very well. Thank you Claire. EmilyEdmonton, AB, Canada2/16/2021I am having the WORST time making the brittle.  Tried 3 times.  The first time burnt the caramel.  The second time ended up with browned sugar covered pecans. The third time a little better, was able to pour out most of the brittle, but had a ton of crystallized sugar in about 75% of the brittle.  So frustrating, because I really wanted to make these.  I don’t consider myself a beginner baker (I make pain au chocolat weekly.). But this brittle is driving me insane.KelleyLas Vegas2/16/2021I failed at the brittle twice. Neither time did it bubble when I added the salt/baking soda. I quit. JoelMichigan2/13/2021I keep browned butter in my fridge at all times so this was not too labor intensive for me. Also, if you read the book you will see that she says that this is a longer recipe. To me, nothing good comes quickly so I do not mind the extra steps. If you want to do something right, then you should take the time to do so. If you want something quick, go to the store and pick out cookies. The brittle worked swimmingly for me on my first try. Be sure to read the directions carefully. Weigh everything out, don't cut corners by baking with measuring cups. These cookies are amazing and I will be making these at least once a week moving forward. AnonymousAtlanta, GA, USA1/29/2021A really delicious cookie with just the right texture and a lot of depth of flavor. However, it's a whole lot of work. Not too bad if you separate it out over a few days, but still a lot for a few cookies. I'd make them again, but only for special occasions. Another note: I made mine gluten- and dairy-free, using King Arthur Gluten-Free All-Purpose Flour and Earth Balance Unsalted Buttery Sticks. The brittle made with Earth Balance wasn't great by itself, but you couldn't taste a difference in the final product.Tori HookFranklin, TN1/16/2021I have now attempted to make the brittle twice and both times were terrible failures. I will try again with a better brittle recipe then attempt the rest of this recipe. Very frustrated and annoyed at all the pecans I've wasted during this process. AnonymousBay Saint Louis, MS1/16/2021Explore Bon AppétitCookieDessertOatRice & GrainsPecanNutSnackBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-04", "author": ["Condé Nast", "Claire Saffitz"]}