{"id": "9e277af00bb962d0483d45214199e4a0", "url": "https://www.bonappetit.com/recipe/miso-almond-butter-cookies", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Miso-Almond Butter Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMiso-Almond Butter CookiesBy Chris MoroccoDecember 10, 20184.6(62)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintDid we lose you with the miso? Don't go! It adds savory richness that amps up the nutty almond butter and brown butter flavor...but don't just take our word for it.IngredientsMakes about 161¼cups whole wheat flour½tsp. baking soda10Tbsp. unsalted butter1cup (packed) dark brown sugar1large egg⅓cup smooth almond butter¼cup miso1tsp. vanilla extract1cup bittersweet chocolate chips or wafers (*see note)Flaky sea saltPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Whisk flour and baking soda in a medium bowl.Step 2Melt butter in a small saucepan over medium heat, swirling occasionally, until it foams, then browns, 5–6 minutes. Transfer to a medium bowl and let cool 5 minutes. Add brown sugar and stir until well combined, about 1 minute. Add egg and continue to stir until mixture is smooth, about 1 minute longer. Add almond butter, miso, and vanilla and stir until well combined. Mix in dry ingredients, scraping down sides of bowl as needed, until combined. *If you aren’t feeling the chocolate dip (instructions below), now is the time to stir in ½ cup chocolate chips. Let dough rest 10 minutes.Step 3Scoop 2-tablespoonfuls of dough and roll into a ball (you should have 16 balls). Arrange on 2 parchment-lined baking sheets, spacing 2\" apart. Make a crosshatch pattern with a fork across tops of dough (if fork sticks to dough, dip into water before continuing). Bake cookies, rotating sheets halfway through, until lightly browned and firm around the edges, 12–14 minutes. Let cool.Step 4Melt chocolate in a microwave in 20-second blasts, stirring in between, until completely smooth. Dip 1 side of each cookie into chocolate and return to baking sheets. Let sit at room temperature until chocolate hardens, about 2 hours. Sprinkle with sea salt.Step 5Do Ahead: Cookies can be made 2 days ahead. Store in an airtight container at room temperature.How would you rate Miso-Almond Butter Cookies?Leave a ReviewTell us what you thinkReviews (50)Back to TopTriangleMade these vegan with Miyoko's butter and a flax egg. I was worried they'd be too salty because the Miyoko's butter was salted but they were great. I just mixed the chocolate chips into the batter because I'm lazy. Also these were 100x better after having the dough sit in the fridge for a few days. The texture was better and the flavors POPPED. Fridge helps the maillard reaction. I made 6 where I only let the dough rest for 10 min (per the recipe) and the flavors were muted compared to the overnight refrigerated dough. Refrigerate if you can!AnonymousMinneapolis, MN2/5/2021Made no subs and they came out amazing! Only bummer is that they were a bit too salty and the crosshatch pattern I made on them disappeared once I baked them. I used almond butter that was made from roasted salted almonds, next time I will use almond butter made from plain roasted almonds. Wasn't sure what kind of miso to get, I used malted rice miso and like they way it tasted. Baked for 12 min and they came out soft and chewy. I ended up drizzling the dark chocolate on top and sprinkled the flaky sea salt on them and they looked beautiful. Will definitely make these again!AnonymousRancho Cucamonga, CA1/1/2021Delicious and surprising! I used coconut oil in place of the butter and ground flax seed in place of the egg. They are perfectly delish! \nSarahBend, Oregon12/15/2020This is a four-star recipe. It is my go to for a satisfying savory salty sweet chewy cookie. Just be careful when you’re baking them and do not overbake. Thank you Chris these got us through corona quarantineAnonymousUpstate ny8/14/2020made exactly as directed, and they were perfect!Anonymous7/20/2020These have become my go-to cookie recipe. I was a big fan of the Brown Butter and Toffee Chocolate Chip Cookies from BA, but I must say these the depth of flavor in this recipe is far superior. Don't get fancy with your substitutes or omissions, these are amazing as is. Chris Morocco, thank you, you are a genius for this one.zachzolla436066/29/2020Giving 5 stars for the flavour of the dough before I baked it which was incredible - perfect blend of salty & nutty.\nThe only subs I made were: doing a 50/50 mix of strong wholewheat and all purpose flour, and using 3 tsp of baking powder rather than soda. This seems to have been a bad decision! My cookies ended up quite cakey and lost a bit of flavour. Still nice, but not the lovely chewy versions others seem to have managed.AnonymousLondon, UK6/21/2020I love these cookies! I have made them multiple times with both white miso and red and they worked well. I didn't find them too salty like some of the reviewers. I also usually use peanut butter because I think peanuts have a stronger flavor that balances the miso better (sorry Chris!). I'm always too lazy to dip them in chocolate and just add the chips directly to the batter - delicious still! I don't have issues with spreading because I always refrigerate my dough before baking - it results in a better, chewier texture IMO. AnonymousAsheville, NC6/16/2020So so so good! I used AP flour instead of whole wheat because that's what I had (added two-ish tablespoons extra because the dough seemed too wet) and peanut butter instead of almond butter. I also actually prefer these without the chocolate so left that out entirely. Sprinkled with flaky salt before they went in the oven.  AnonymousWisconsin6/11/2020These are so easy to make and tasted great! I used crunchy peanut butter (no added oil/salt) and white miso. I chilled the dough for ~20 minutes in the fridge before scooping; I wasn't sure whether to press down the cookies - I ended up using the back of a fork to flatten slightly. I'm glad I did because they spread into nice circles like in the photo although the cross hatching was lost a little. kathyxAuckland, New Zealand6/7/2020These were delicious! \nI used white miso and almond butter with no added oils/sugar. You need to be very careful when it comes to the kind of miso you are using. Japanese brands at times have dashi stock (which can include kombu and anchovies) mixed into the miso which can make it taste strong and fishy. I personally recommend white miso for this recipe- anything darker will make this cookie very salty. \nI could definitely smell the miso while it was baking and was worried that it would overpower the cookie. However, it added a nice caramelized flavor and it blended well with the almond butter. Browning the butter is a must, as is the chocolate dip. I forgot to rest the dough in the fridge as directed but they still turned out beautifully. Will be making this again! Anonymous6/1/2020These are good but maybe would benefit from a stronger nut flavor..maybe freezing or chilling overnight would allow flavors to develop more? Used  the technique of beating the butter sugar and egg until the mixture changed color somewhat (3min or so) to avoid spreading. They were done after 12min without spread. Not sure these are interesting enough to make again. There is something missing (maybe something textural, like chopped nuts?). Or maybe not enough miso? Anonymous5/27/2020Just want to mention to those of us who do not have whole wheat flour: I substituted 3/4c of oatflour (that I ground up in my blender) with 1/2c APF. \nIt turned out great- I had no issues with spreading, but crosshatching did not show. \nOther things I did:\nUsed parchment instead of silpat (friction eliminates spread)\nUsed darker miso (what i had on hand)\nI also converted to metric measurements, not cups. My almond butter was from a jar, not fresh ground..hope this helps someone.AnonymousParis5/27/2020I enjoyed the flavor but I didn't get enough spreading as I would like. I'll definitely make this again. Next time, I'll probably just bake it right away without letting it rest first.AnonymousVancouver, Canada5/27/2020Also spread horribly for me.. I followed the instructions and ingredients exactly, so was disappointed it didn't turn out well. I do love the taste, so want to give it a try again. Just not sure what to change?AnonymousSan Diego, CA5/26/2020Explore Bon AppétitCookieDessertMisoCondiments, Sauces & PastesChocolateOther IngredientsSnackHealthyishBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-10", "author": ["Condé Nast", "Chris Morocco"]}