{"id": "9e32a0a3f8fabf0c4a2e5da0799bd7f3", "url": "https://www.bonappetit.com/story/women-who-love-weed", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Can the Cannabis Culture and Weed Industry Finally Free Itself From Stoner-Bros? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCan the Weed Industry Finally Free Itself From Stoner-Bro Culture?Women are forging a new kind of weed culture, but the cannabis industry is changing too.By Aliza AbarbanelApril 29, 2019FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailThis story is part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Check out their spring issue, and click here to read more about how to make cannabis delicious.Mainstream cannabis culture has long been defined by stoner-bro comedies like Pineapple Express and graphic tees plastered with Bart Simpson hitting a blunt. Today you can still find Baked Bros™ gummies at the dispensary, see billboards with bikini-clad models above the slogan ‘Nice Grass,” and pass questionable rasta gear on every beach boardwalk. But as recreational marijuana becomes legal in more and more states (currently ten plus Washington D.C., with more on the horizon), a different—and decidedly feminine—aesthetic is beginning to take hold.“So many cannabis brands felt extremely masculine, in the sense that if there was a woman in an image, she was being hypersexualized by the male gaze to sell products,” says Maya Shaw, the creator of Shaw, a cannabis lifestyle shop based in New York. “It didn’t feel like women and LGBT+ people had a space where we felt celebrated and seen as a respected consumer.”Shaw is part of a wave of woman-led online shops like Yew Yew and Tetra selling accessories for a new era of cannabis consumption. Think modern ceramic pipes shaped like macaroni noodles and seashells—which look eons away from the standard-issue glass pipes sold at bodegas and on boardwalks—crafted by women and non-binary artisans.“My first glass bowl looked like a penis,” Shaw says, laughing. “There’s nothing wrong with a bodega bong or pipe, but how can these feminine shapes and curvatures be celebrated instead?”This aesthetic shift is chronicled in the pages of indie publications like Broccoli and Gossamer, amid articles on treating PMS with weed, psychedelic floral art, and other dispatches from the new frontier of cannabis culture.It’s clear that women who like weed are more visible than ever, which has created an unprecedented time of opportunity for collaboration and community building. “I love to witness the surge of knowledge-based conversation at events and women and marginalized communities coming together,” says cannabis entrepreneur Mennlay Golokeh Aggrey, who is speaking at Broccoli’s In Bloom festival later this month.But as cannabis becomes a venture-capital darling, it’s coming up against the same gender inequalities found in tech and beyond.“I think there really is a great opportunity for women right now, but I think the chips are stacked against them, and the stakes are higher from a financial perspective,” says Kristi Knoblich Palmer, the co-founder of Kiva Confections. “Everybody in the California industry is raising money right now, and I think there’s a hint of the old boys’ club when you start dealing with private equity or investment groups.”And even when investment comes, strings can be attached. Kieryn Wang, a digital marketer in Seattle, got her start working at the female-focused cannabis brand Van der Pop in late 2015. It was an exciting time in a burgeoning industry—Wang recalls educating consumers about CBD years before the acronym was a part of our mainstream vocabulary—but when the brand was sold to a publicly traded company, things felt different. “We were actually bought out by a male-owned company that put men in management positions,” she says. “That’s kind of why I left, because men were telling women how to run a women-focused brand, which happens a lot.”While VC funding remains the shortcut to mainstream success, the femme cannabis community is building their own networks. Despite Instagram’s nebulous community guidelines around cannabis, many brands use the platform to connect entrepreneurs with consumers and even raise funds for criminal justice reform. Offline, panels and networking events allow women who like weed to share knowledge, network, and hold space. Handmade ceramic pipes may never become the new bodega mainstay, but the women defining modern cannabis culture refuse to get lost in the haze of the green rush.Explore Bon AppétitHealthyishCannabisWomen in CannabisessayRead MoreLifestyle4 Classic Cannabis Cookbooks We Can’t Believe ExistGallery4 SlidesBy Anja CharbonneauRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Aliza Abarbanel"]}