{"id": "9e54d583956576b30e577dd6bdc4f6d1", "url": "https://www.bonappetit.com/story/september-horoscope-sad-desk-lunch", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Your September Horoscope: Which Sad Desk Lunch Is Your Fate? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour September Horoscope: Which Sad Desk Lunch Is Your Fate?What’s in store? A weird lunch, from the looks of it.By Catherine UrbanSeptember 4, 2018FacebookTwitterEmailIllustration by Jay Daniel WrightFacebookTwitterEmailWhether you’re going back to school or work after summer vacation, or you’re just a working adult who never takes time off, September is here and you can’t fight it. That’s why our horoscope theme this month is Sad Desk Lunches! But it’s not so sad, we promise. These are the last-minute, forgot-to-pack-a-lunch, didn’t-have-time-to-meal-prep, don’t-feel-like-spending-money weird lunches we sometimes settle for. And sometimes...they’re awesome. Like the vending machine medley! The office snacks scavenger hunt! See what’s in store for you this month, and what you’ll be eating, maybe even while reading this.Illustration by Jay Daniel WrightAriesSome recent changes in the workplace have positioned you to have more confidence, and your unique tell-it-like-it-is charm will help you form new allies. People always appreciate someone like you to keep things lively (and hilarious) even as they grind away at their cubicles. You live life moment to moment, and when hunger strikes, you need something ASAP (no one ever said you were the best planner). On a busy day with no options left, your sad desk lunch is a vending machine medley: a can of Mountain Dew, Cheez-Its, and a pack of Flipz. Like you, this lunch is random, off the wall, and sure to keep you buzzing til the end of the day and/or sugar crash. But hey, that’s how you roll.Illustration by Jay Daniel WrightTaurusYou are a go-getter—when you want to be. You’ll be feeling feisty and incredibly driven this month; be determined to do what it takes to meet your personal or career goal. Once you gather momentum, keep it consistent. Whether you’re aiming to read a book every week or do 20 pushups per day or answer emails before the next moon cycle, bribing yourself with treats always keeps you interested. On a workday you forget to pack your lunch, reward yourself with that ancient frozen mac and cheese dinner stashed in the back of the office freezer. You can’t quite make out the expiration date but maybe there are a couple of “9’s”??? With all the necessary preservatives, it’s as resilient and dependable as you are.Illustration by Jay Daniel WrightGeminiIf it hasn’t already hit you, you could be on the verge of a breakthrough this month. Until it strikes, set the mood by reserving plenty of downtime. You are rarely ever lazy, so take advantage of this lull in energy. Kick your feet up, catch up on that stack of magazines, order pizza, and watch movies. Oops, suddenly it’s Monday. In your haste to get to work, grab the remaining three hard-boiled eggs in the fridge to make up your sad desk lunch. Like you, eggs are super versatile, but today you’ve gotta be tough. And no, the hot sauce in the fridge at work will not make things much better, but you’ll be able to weave a good story about it.Illustration by Jay Daniel WrightCancerLoyalty is important for you this month, so find your tribe and sit close. Rolling with the right people will remind you how strong you actually are. We always envy your ability to save money, but this month you’ll be feeling more celebratory, finding plenty of excuses to go BIG on the weekends. Treat that posse of friends to a pitcher of margaritas this month; show them you appreciate them. (We may or may not have some Cancer friends, so what?!) When the work week restarts and you realize you forgot to pack your usual assortment of snacks, make lunch magic happen by scavenging the vast array of random office snacks: a slice of cheese Danish and coffee here, followed by a smattering of hummus and veggies there, mixed in with some possibly stale cookies from a meeting last week. You know how to turn nothing into something like a pro, Cancer.Illustration by Jay Daniel WrightLeoYou are in the early stages of a personal growth (whether physical, emotional, in a relationship, or at work) that may lead you in an entirely new direction in life. In the build up, be mindful of the smaller moments in the day and see where you can make changes there, too. Maybe saving some spare change, eating healthier, overhauling your closet, that kind of thing. It all culminates in your sad desk lunch of microwaved salmon. Like you, it has its way of making its presence known. Though you can’t tell which is worse, everyone giving you the stink eye, or the actual stench. Fully commit to the salmon, Leo, and don’t let the peer pressure get to you.Illustration by Jay Daniel WrightVirgoAdmittedly, life has gotten much more dramatic than you’d prefer. And not naming names or anything, but a certain friend or family member may be to blame. Take a deep breath and focus on more important matters, like where you want to throw your upcoming birthday dinner—some place delicious, but laid back and casual-feeling (maybe one of these spots?). Until then, your sad desk lunch of Rx bars and someone else’s yogurt will tide you over with an excess of protein. Did that yogurt have someone’s name on it in Sharpie? Oh well. You’re already thinking about what’s for dinner, and who’ll be treating you to it.Illustration by Jay Daniel WrightLibraTrue, you’re known for being relationship-oriented. Also true? It ain’t always easy. Especially when it comes to getting along with those you live with (this includes cats and dust bunnies you address by name). This month, you’re trying to rekindle some much needed peace in your own home. Take initiative (call your mom) and scrub those sticky spots in the fridge until they sparkle. Spruce up the living room and plan more meals. Well, you’ll try anyway. Your sad desk lunch turns out to be a mason jar of plain quinoa, a banana, and a jam jar filled with pickles. For now, this feels wholesome, but we know you’ve set your eyes on Happy Hour nachos. Because as you know, Libra, it’s all about balance.Illustration by Jay Daniel WrightScorpioNo one would ever call you an open book, secretive Scorpio, but this month you may find that you’re more willing to let people in and trust. Relationships can get an upgrade this month when you give your usual tether some slack. Try different adventures with your partner (hello, cabrewing) to coax you out of your shell and share some of your theories about life. When you return to work, you might feel judged when your coworkers’ eyes meet your sad desk lunch, but you’ll swear up and down that you’re happy to eat your microwaved dried-out spaghetti from three nights ago. It’s as resilient as you are, and like you, tough as nails. Just throw it out and buy a sandwich, Scorpio.Illustration by Jay Daniel WrightSagittariusYou normally require plenty of space in your schedule to allow for spontaneous ideas (aka getting sidetracked from boring stuff). But this month, you feel a superhuman ability to focus. You’ll be taking on more tasks and actually following through with them. You’ll be reminded that you can get A LOT done when you want it enough, so focus, Sag, focus. You’ll be so focused, in fact, that your sad desk lunch is a stash of strawberry Soylent. Like you, it’s a little bit of everything in one package. It’s also a tad “out there,” but you’ll try anything once.Illustration by Jay Daniel WrightCapricornAfter what felt like a slow summer, you’ll find a return to a (newer) normal this month. Feeling rejuvenated and reenergized, you’ll be ready to jumpstart some of those goals you’ve been stewing on. Restart your Bumble app (heeyyy) and plan that trip to Greece you’ve always wanted to take. How did we know? We just know. Dedication to your endeavors is second nature, which is why you’ll commit and eat your sad, soggy salad for lunch. Not all leftovers are worth saving, but you’re a loyal one. Squishy and flat, the soggy salad downplays its strengths (like you sometimes do) but you own it. It’s still good, you swear!Illustration by Jay Daniel WrightAquariusA chapter in life comes to a close this month (goodbye, beloved futon). You’re okay with change so long as you can predict the results. It’s time to upgrade your life, which means dropping some cash to invest in yourself long-term. Since buying a new sofa is like a really big deal for you (commitment), take the time (online shopping at work is one of your fortes) to carefully calculate all of your options. Don’t second-guess yourself when it comes time to sign on the dotted line. Is this about more than a couch? Maybe. Let your decision-making brain go to the big stuff, which is why your sad desk lunch is half-eaten leftover fried rice. It’s cold and kind of dry, but still satisfying enough to make your coworkers jealous.Illustration by Jay Daniel WrightPiscesYou tend to disguise yourself from the world in one way or another, sensitive Pisces. But this month you have extra armor of invincibility. Conversations and communication in general are going to be goldmines this month, so make the time to meet and talk to as many people as you can. Who knows what could come of it? A new job? A free weekend at someone’s beach house? A cookie? Your sad desk lunch is a package of Lunchables that caught your eye in the grocery store, where you always buy more than what’s on your list. Your creative side will enjoy stacking the cheese, floppy ham, and crackers and then washing it down with a Capri Sun. It might not be as satisfying as it used to, but you’ll still own it, a grown adult eating a Lunchable.Everyone might need this: 100 Ideas for What the Heck to Pack for LunchCatherine Urban is a professional astrologer and and expert at eating plain quinoa for lunch. Check out more of her work here.Explore Bon AppétitFood HoroscopesSnackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast", "Catherine Urban"]}