{"id": "9e5773de37d82b20e2a561c5aa045e50", "url": "https://www.bonappetit.com/story/junes-bags", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "We're Taking These Mesh Bags EVERYWHERE This Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWe're Taking These Mesh Bags EVERYWHERE This SummerSorry, totes. We're going mesh this year.By Aliza AbarbanelJuly 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn the summer, New York vibrates with potential. With a good pair of sneakers and a water bottle, we can walk for miles and stumble into hectic street fairs, sprawling farmers’ markets, the random, surprisingly excellent stoop sale. Our biggest problem—besides the occasional garbage smell—is carrying all the odds and ends we pick up along the way. Because who wants to haul around an extra tote in the sweltering heat? Enter Junes hold-everything mesh bags, which are breathable, strong, and fold into a small square about as large as a deck of cards. Throw one in your work purse or jean pocket, and you'll be prepared for peak-season peaches,  flea-market gems, and whatever else catches your eye.Junes mesh drawstring bag makes it easy to go plastic-free at the farmers' market.\nPhoto by Alex LauIn addition to being super functional, Junes bags are also fun to look at. The classic is a roomy, throw-it-all-in-there tote with a built-in side pocket for stashing some cash. Planning a picnic? Junes bottle pocket has built-in pockets for two bottles (Pet-nat?, Orangina? Pick your poison), that even the load and minimize awkward clanking. The mesh drawstring carry-alls can be used to stow anything from onions to phone chargers, but we like them best as an individual produce bag for anything with soft skin (stone fruit, berries, tomatoes). All the bags are hand-washable—or wash them on the delicate cycle and hang them to dry.We also love that Junes is partnered with Centra Santa Catalina, an independent women’s sewing cooperative in Juárez, Mexico that creates half their stocklist. A percentage of each bag goes to the Global Fund for Women, a nonprofit organization working to prevent femicide and violence against women.With a Junes bag or two in your purse, you'll never be the person who forgets her bags at the grocery store. You can finally get rid of that pile of plastic ones that've been collecting dust in a dank kitchen corner. And when you take a stroll and stumble across the most perfect peak-season tomatoes you've ever seen, you'll have just the thing to put them in.Buy Junes bags, starting at $20Explore Bon AppétitHealthyishShoppingRead MoreLifestyle7 Products For a Cool, Calm, and Delicious SummerGallery7 SlidesBy Liza MyersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-03", "author": ["Condé Nast", "Aliza Abarbanel"]}