{"id": "9e63bb6fd804fcce6bec5bafeff46806", "url": "https://www.bonappetit.com/story/malfatti", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "Malfatti Is the Homemade Pasta for People With No Pasta-Making Skills | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMalfatti Is the Homemade Pasta for People With No Pasta-Making SkillsThese little pillows of cheesy goodness are meant to be misshapen.By Marianna CeriniJanuary 27, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, malfatti.I envy people who can make all sorts of pasta by hand. Being Italian, I’ve always felt I should know how to pull sticky dough into shape as if it were the most natural thing in the world. Sadly, I never quite mastered that effortlessness: Whenever I’ve attempted fettuccine, gnocchi, or pici (the last two are usually considered simple enough even for beginner cooks), my kitchen has ended up covered in flour, my work surface a complete mess, and, worst of all, the pasta thick and chewy.That was, at least, until I came across malfatti: spinach and cheese dumplings somewhere between gnocchi and ravioli—like a ravioli’s inside.Literally translated to “badly made,” this pasta is the most elemental of any homemade pastas out there—something so easy to rustle up that even the most inept of pasta-makers (me) can nail it in no time. The name says it all: Malfatti don’t have to be pretty, precisely cut, well-proportioned, or neatly folded. Quite the opposite. They’re meant to be irregular, misshapen, and malformed—and they demand nothing but a handful of ingredients you’re bound to already have. Any time I want to pretend I am really good at pasta-making or I’m feeding more than just myself for dinner, malfatti are on the menu.Their simplicity stems from their origins, of course: Malfatti are part of the cucina povera repertoire—the humble yet remarkably resourceful “cooking of the poor” that comprises so much of Italian cuisine. Their birthplace is either Lombardy or Tuscany, depending on who you ask (in the latter, you’ll find them under the name of gnudi, which means “naked” in the local dialect—a hint at the fact they don’t come wrapped in dough), although as is the case with many Italian recipes, there are different iterations in other regions too. Different families are also likely to have their own versions: Some replace spinach with chicory, Swiss chard, or whatever green leafy vegetables they have on hand. Others tinker with the sauce they serve them with—the “official” one being butter, Parmesan, and sage—or play with the shape, which can be anything from round to oblong to slightly tapered. Regardless, malfatti ends up pillowy, with a melt-in-your mouth texture that’ll have you coming back for seconds.Here's how to make spinach malfatti:To make enough for four people—or two hungry ones—cook 20 oz. fresh or frozen spinach in a large pot of boiling salted water just until wilted, 1–2 minutes (make it 8–10 if using frozen). Drain, let cool, then squeeze out any excess water, and chop them coarsely with a knife or a blender (skip the cutting if your frozen spinach came prechopped). The squeezing is really the only must when making malfatti: If the spinach retains too much water, chances are you’ll have trouble working the dough later. So give them a powerful squeeze!In a pan, melt 1½ Tbsp. butter, add 1 smashed garlic clove, and then add the spinach. Sauté the greens gently for 5 minutes, turning them occasionally—this helps bump up their flavor and staves off additional moisture. Remove from the heat, discard the garlic, and set aside to let cool.Take a large bowl, and dump in 8 oz. fresh ricotta, 2 lightly beaten eggs, 3 oz. finely grated Parmesan, and reserved spinach. Add a pinch of nutmeg and a generous amount of salt and pepper and use a spatula to combine all the ingredients. Lastly, tip in 6 oz. all-purpose flour (about 1⅓ cups).  It’s important to always add the flour last—you’re after a silky, soft texture here, and adding the flour last prevents the dough from getting too dry. Now mix everything with your hands until you form a malleable dough ball (don’t worry if it’s still pretty sticky), about 3 minutes.Once that’s done, start shaping your malfatti. Flour a work surface, then take pieces of dough and roll them into an oblong shape (think gnocchi, but a bit bigger and longer). Roll each malfatti into the flour as needed to prevent sticking, then place on a lightly floured baking sheet. You’ll get somewhere between 20–30 pieces. (You can also take the gnocchi approach: Divide the dough into four big pieces, roll each into a long log, and cut into nuggets.) Congratulations, you’ve just accomplished homemade pasta.To cook the malfatti, bring a pot of salted water to a boil and drop them in. Once they rise to the surface (4–5 minutes), remove them from the pot with a slotted spoon or skimmer and transfer them into a saucepan where you’ll have your sauce going.As I mentioned, the classic recipe calls for butter, Parmesan, and sage, so stir together some butter (half a stick, or to your liking), 2 oz. finely grated Parmesan, and a handful of sage in a pan, then gently toss the malfatti into the mixture, adding a little cooking water at a time, until you’ve reach your preferred creamy consistency. Or treat this as a basic template and fancy up your pasta with whatever sauce you want: cherry tomato and basil? Why not. Peas and herbs? Don’t mind if I do.Like all the best Italian food, malfatti are open to improvisation and deliver the highest level of comfort—not to mention smugness. If that’s not enough of a good reason to make them for dinner tonight, think about the fact you can keep them in the fridge for up to two days or even freeze the uncooked dumplings (as long as they’re in an airtight container) for a homemade meal at the ready. They might not be the prettiest, but they’re sure ingenious.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-27", "author": ["Condé Nast", "Marianna Cerini"]}