{"id": "9e6575eea838b50305ea032c193d46b3", "url": "https://www.bonappetit.com/story/fast-casual-restaurant-recipes", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Fast Casual Restaurants' Recipes: Make the Food That You Just Spent Your Whole Lunch Break Waiting in Line For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make the Bowl Food That You Just Spent Your Whole Lunch Break Waiting in Line ForA better burger, a matcha-dressed salad, and a harissa-roasted veg bowl.By Priya KrishnaJanuary 17, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the Healthyish 22, the people changing the way we think about wellness. Meet them all here.If you've bought a grain bowl anytime in the past few years, you know that fast-casual restaurants across the country are thinking about their sourcing in all kinds of innovative ways, and we're all eating better as a result. We tapped three fast-casual chefs and restaurant owners for their recipes that are as good for the planet as they are for your lunch.Farm Burger's Sunnyside Burger with Salsa VerdeWhen Jason Mann was a rancher, he noticed that most of the buyers for grass-fed beef were fine-dining restaurants looking for specific cuts, inevitably leaving farmers with lesser-known cuts that they couldn't sell. Mann found the solution to this dilemma in the humble burger. Farm Burger—which launched in 2010 and now has 12 locations—sources local grass-fed whole cattle that are broken down in-house. Here, burgers (like the ever popular Sunny Side) are ground from a \"whole carcass blend\" that includes anything from chuck to flank to sirloin. Offal goes into specials, and fat is rendered to create tallow butter that the burgers are cooked in. Jamie Ager, a fourth-generation farmer at Hickory Nut Gap Farm in North Carolina which sells to Farm Burger, calls the restaurant's approach \"a more holistic way of looking at the market.\"Sunny Side Burger with Salsa VerdeWhat’s better than a griddled burger with the crispiest exterior? One that comes sandwiched between a vibrant tomatillo salsa and topped with a runny fried egg.View RecipeHomegrown's Grilled Chicken with Quinoa and Matcha DressingAfter working at Per Se and Gramercy Tavern, Michaela Skloven wanted to bring that same sourcing-obsessed mentality to the fast-casual space. When she became the executive chef at Homegrown, a sandwich shop that launched in Seattle in 2009 and now has eight locations, she started a half-acre organic farm to grow produce—like the cucumbers and cherry tomatoes that go into this chicken and avocado bowl. Homegrown staff are invited to spend time working on the farm so they can see first-hand where the food comes from. \"The more respect they have for the food, the less likely people are to do something like throw away a tomato,\" Skloven says. \"That's how we change the whole food landscape.\"Grilled Chicken and Quinoa with Matcha DressingThe dressing on this grain bowl is like green goddess 2.0, with matcha adding an earthy undertone to the whole thing.View RecipeCava's Black Lentil and Harissa-Roasted Veggie BowlHearty, nutrient-heavy, and endlessly versatile, lentils were a staple for Dimitri Moshovitis, who grew up in Greece. So back in 2006, when he cofounded Cava (which now has 74 locations across the East Coast, California, and Texas), Moshovitis saw them as an obvious base for the Mediterranean spot's bowl-centric menu. He came across black beluga lentils from Timeless Natural Food, a company based in rural Montana, and was impressed by the varietal's rich flavor. But he was more excited to learn that these lentils are enriching the nutrient density of large swaths of land in Montana, a state whose agriculture has historically been dominated by cereal grains that can deplete the soil. Win-win.Black Lentil and Harissa-Roasted Veggie BowlThis filling, endlessly riffable bowl is perfect with roasted sweet potatoes, but any hardy vegetable you have on hand would be just as delicious.View RecipeExplore Bon AppétitThe Healthyish 22HealthyishRead MoreLifestyleBask in the Psychedelic Glory of Restaurant Designer Elise McMahonBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Priya Krishna"]}