{"id": "9e9ee0b185178e11e38b9879e7829d9b", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/anda-gyoza", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Anda Gyoza Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoAnda GyozaA vegetable-forward respite from tempura and sushi.FacebookPinterestTwitterEmailKee Byung-keunGO HERE: to be restored. The vegetable-rich, spice-laden food at Anda Gyoza can alleviate some of the weight of trying to eat all of Tokyo. The four house-made flavors of gyoza, with ingredient combinations that are both expected and surprising, are the centerpiece to any meal here. There’s a large menu of small dishes to round out the meal, and the alcohol selection, one of the city’s most interesting, presents both curiosities and challenges.ORDER THE: gyoza, of course. You’ll also want to try the ragē nikomi, a dish of stewed vegetables and pork that's one of the most flavorful vegetable preparations in the city, as well as the mapo tofu, a light but still intensely spiced reimagining of the Sichuan mainstay. The yasai rui, a dish of plain boiled vegetables, might seem like something to skip over, but after adding your own seasonings at the table, you’ll understand why it’s one of the most special items on the menu. When you’re ready to finish up, order a filling bowl of ramen to carry you through the night.THE VIBE IS: Taiwan in the rainy season. The walls have been left worn in places and a single tiny radio sends out a steady roll of old tunes and warm voices. No matter what time of year it is, it always feels like you’re waiting for a typhoon to pass by outside.PRACTICAL STUFF: Open from Wednesday to Monday from 11:30 a.m. to 11 p.m. Closed on Tuesdays. The entire menu is available in English and limited English is spoken by the staff. Reservations are available for parties of three or four. Groups larger than four will find it difficult to eat here as there is only a single small table and a counter. Peak dinner times can have long wait times, so plan your visit accordingly. The nearest subway station is Yoyogi-uehara.By Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}