{"id": "9ea2c3c6cd1b8759e64e3657a809a5b4", "url": "https://www.bonappetit.com/story/bizarre-history-buca-di-beppo", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Bizarre History of Buca di Beppo, America’s Most Postmodern Red Sauce Chain | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Bizarre History of Buca di Beppo, America’s Most Postmodern Red Sauce ChainHow a Lutheran from central Illinois created a genre-defining Italian-American restaurant.By Priya KrishnaApril 16, 2019FacebookTwitterEmailPhoto by Cole WilsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.There was no Little Italy near the small suburb of Dallas where I grew up. Instead, there was Buca di Beppo.Among my classmates, Buca di Beppo was the go-to destination for birthday parties. The atmosphere was always raucous, the platters of food were so massive that they demanded sharing, and ogling at the sundry black-and-white photos of Italian wrestlers and spaghetti-eating contests that crowded the walls was as much a part of the experience as the actual dining.It was here that I first listened to the croonings of Dean Martin, his music playing on an endless loop in the dining room. And where I learned what the pope looks like, thanks to the “Pope Room,” where a large bust of His Holiness sits at the center of the table. And where I had my first taste of chicken Parmigiana, served on a giant platter and laced with a golden-brown layer of mozzarella and the most glorious tomato sauce: thick, fruity, with a whisper of garlic. At that time I had never visited any of the restaurants in Italian-American enclaves like Federal Hill in Providence or the North End in Boston. This was the best red sauce I had ever had.But unlike the checked-tablecloth joints opened by immigrants of Sicily or Naples, Buca di Beppo was not founded by an Italian. It had no roots in Italy and no connection to the Italian-American immigrant experience. Yes, a place showcasing enough pope paraphernalia to border on evangelistic was founded by a Lutheran from central Illinois who told me that the best Italian restaurant in his hometown growing up was a Pizza Hut.Buca di Beppo was born out of founder Phil Roberts’ desire to not just re-create those bygone red sauce joints, but to present the most exaggerated version of them.\nPhoto by Cole WilsonIn 1993, Phil Roberts was an outgoing Minneapolis restaurateur with a successful steakhouse and a sleek, bistro-style Northern Italian restaurant. But he was obsessed with the red sauce joints he frequented when he’d visit his sons in college in the Northeast. “The way they displayed wealth was in the food they served,” he explained. “They kept the Christmas lights on all year-round. They hung up velvet paintings of Mount Vesuvius.” But he noticed that as the owners were aging, and Italian-Americans became more assimilated into mainstream American culture, these red sauce spots were closing—and there were certainly none like them in Minneapolis.Roberts saw an opportunity not just to re-create those bygone red sauce joints, but to present the most exaggerated, over-the-top version of them, to create an environment where people could feel totally comfortable—as he describes it, “a sleeves-up restaurant where you don’t have to tie your sweater around your neck and blow air kisses throughout the dining room. I wanted a restaurant people could look down on.”He wanted the decor to be tacky, the portions to be enormous, the atmosphere to be boisterous. He figured it didn’t matter that he wasn’t Italian in the slightest. There were also almost no red sauce joints in Minneapolis at the time, so diners wouldn’t have anything to compare it to. This was a restaurant, he says, “that was intentionally in bad taste, but good-natured bad taste.” The kind of place where the average diner could feel superior, and not feel bad about being puzzled over a wine list, or not knowing what kind of fork is used for a salad.And so, in 1993 in a tiny basement in Minneapolis, Buca Little Italy (soon to become Buca di Beppo—loosely translating to “my buddy’s basement”) was born.The dining experience was designed to be tacky and boisterous—the kind of place where the average diner could feel superior.\nPhoto by Cole WilsonIn the beginning Buca was never supposed to be a chain. Roberts and partners Don Hays and Peter Mihajlov already owned a few restaurants. “It was just something we knew we could have fun with,” Roberts says of his original idea for Buca.Although the restaurant was built on kitsch, Roberts knew the food had to be the real deal. So he hired Vittorio Renda, a fast-talking, self-assured cook from Milan, to put together a menu. Renda, in turn, brought all his family recipes—meatballs, chicken cacciatore, tiramisù—and plated them with over-the-top flair. The meatballs were the size of baseballs. Gooey mozzarella flowed over the garlic bread like lava.Steven Roberts, Phil’s son, a reserved Yale-educated architect, designed the building and the interiors. He would visit flea markets in Pittsburgh and Indianapolis to find old black-and-white photographs of Italian families to cover the walls. He picked up religious souvenirs from Vatican City. “We had this one ceiling painted with cherubs, but they were a little too well endowed,” he recalls, chuckling.The first location of Buca di Beppo was cramped and hard to find. But it was an immediate hit.“On a Saturday night in February we might have 100 people standing outside in 10-degrees-above-zero weather waiting to get in,” Phil Roberts says. After two years he decided to expand. By 1996 there were a dozen locations, all earning between 3 and 5 million dollars in annual revenue.There were other Italian chains coming up around the same time. Olive Garden, founded in 1982, sought to bring sunny, villa-soaked Tuscany to suburban towns; and Macaroni Grill, started in 1988, centered on Mediterranean culture. But Buca was unique in that it wasn’t trying to transport people to Italy, or bring any sense of authenticity. It wholeheartedly embraced the Italian-American stereotypes those other chains sought to distance themselves from, and it didn’t mind being the butt of the joke.At Buca there might be a shrine of St. Francis, the patron saint of animals, surrounded with photographs of butcher shops. “I knew that I had succeeded when a woman was on her way to her table and she spotted this plaster Roman statue and gave her husband an elbow and said, ‘I would never have that piece of crap in my house,’” Roberts says.Buca di Beppo is famous for its thick and fruity tomato sauce, which appears in many dishes.\nPhoto by Cole WilsonBy the late ’90s, Buca di Beppo was becoming a household name. Jay Leno spotlighted its cheesy postcards (they read: “Italian dinners and sanitary bathrooms”) on The Tonight Show. Shaquille O’Neal and Jenny McCarthy were regulars.“It shaped the perceptions of red sauce in Middle America,” especially in places where there weren’t huge pockets of Italian immigrants, says Tim Alevizos, a Minneapolis-based consultant who oversaw Buca’s branding. “As the original red sauce joints were dying off, Buca was the introduction to that type of Italian” and many people’s first tastes of frutti di mare and eggplant parm. “I don’t know if they were keyed into whether Buca was authentic or not, but they didn’t have a lot to compare it to. Plus, it was fun and the food was tasty.”And unlike the Olive Gardens and the Macaroni Grills, Buca managed to feel like a storied, independent neighborhood restaurant. For me, the sheer number and idiosyncrasy of the pictures and paraphernalia on the walls at my local Buca made it impossible to imagine that this existed anywhere else.But as often happens with growth, Buca slowly began to shift away from Roberts’ original vision. In 1996 he hired a CEO, Joseph Micatrotto, an Italian-American from Cleveland, to help the company expand and eventually go public. Micatrotto wanted to de-emphasize the kitsch and infuse his Italian immigrant family’s story into Buca’s branding.“The idea was to bring legitimacy,” Micatrotto says, his voice booming into the phone. “Phil’s edginess and tongue-in-cheek stuff, I enjoyed that. But the difference is that I lived that. He didn’t.”He reframed the name of the restaurant to be a reference to his grandfather, Giuseppe—“Beppo,” he says, is slang for the name—and rebranded the concept as “Southern Italian immigrant cuisine.”Micatrotto “started mandating that the decor team stop with the photos of nuns watching Wheel of Fortune,” Alevizos recalls. “Before every store opening he’d do a walk-through and point out, ‘That has to go. That goes. That definitely goes.’ And it was always a contest to see what they could get past him.”Micatrotto cowrote a cookbook with Renda, Into the Sauce, in which Micatrotto recast the Buca menu as a compendium of his family’s recipes.  “He was taking all this credit in the cookbook,” Renda says, “but why are you bringing in your grandfather? He had nothing to do with Buca.”Corners were being cut in food preparation. “Instead of starting with your San Marzano tomatoes and chopping them up, you were getting a package of marinara sauce and dumping it into a steam kettle,” Roberts says with a sigh. The quality was slipping; the customers were noticing. And 9/11. And the Atkins Diet. And, and, and. Things were not looking good for Buca.Both Roberts and Renda left the company in 2003, around the time that Buca’s investors determined that to boost revenue, the restaurant needed to open for lunch. Roberts felt strongly that this was incongruent with the Buca experience, “a meal of indulgence, where you had a couple bottles of wine and overate and listened to ‘That’s Amore’ by Dean Martin too many times.” (Roberts and Renda still live in Minneapolis; Roberts runs a few restaurants, and Renda does restaurant consulting.)But the biggest blow came in 2006, when Micatrotto and two other company executives were sentenced to jail for allegedly inflating income for Buca and stealing money for the purchase and renovation of an Italian villa. (Micatrotto now lives in Las Vegas and is mostly retired.)The restaurant was swiftly delisted from Nasdaq and nearly went out of business.When Planet Hollywood purchased Buca de Beppo in 2008, its founder Robert Earl was eager to restore the restaurant to its tacky glory days.\nPhoto by Cole WilsonMiraculously, in 2008, Buca was purchased by Planet Hollywood, whose founder, Robert Earl, was eager to restore the restaurant to its tacky glory days of walls covered inch-to-inch with photographs and servers wearing ties decorated with exploding tomatoes.The chain is now a private company and profitable again, with 77 restaurants in 24 states (there’s a high concentration in California), Earl proudly told me over the phone. The top-grossing location is Honolulu—the kind of place where red sauce is just about as novel as it gets.And in keeping with Buca tradition, Earl is not Italian. Nor is the current corporate culinary director, Omar Arubula, a Mexican-American guy from Valencia, California, who like me, grew up with Buca di Beppo as his initiation into red sauce—and as one of his favorite restaurants.That’s why, when Arubula took over the kitchen in 2008, his first order of business wasn’t adding a bunch of new Italian dishes to the menu.It was reteaching the cooks how to make that marinara I fell in love with all those years ago—a sauce perfect to me, to him, and to thousands of diners all across the country.Priya Krishna is a contributing writing at Bon Appétit and the author of the cookbook Indian-ish.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Priya Krishna"]}