{"id": "9eb044d5abe79fba37f6505c940c5add", "url": "https://www.bonappetit.com/story/guide-to-wine-faults-and-flaws", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "A Beginner’s Guide to Wine Faults and Flaws | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Beginner’s Guide to Wine Faults and FlawsSome flaws are a good thing. Here's how to know.By Marissa A. RossJanuary 16, 2018FacebookTwitterEmailFacebookTwitterEmailFlaws in wine are a lot like flaws in people. Sometimes they can be small differences that make a wine distinctive and exciting, and other times they can be so overpowering you want to storm out of a restaurant yelling about how you don’t know what you ever saw in that wine to begin with (!). Unlike flaws in humans, though, we don’t usually have to deal with wine flaws every day, which makes them harder to spot. Here’s how to recognize some of the most common wine flaws and understand how they’re affecting your wines, for better or for worse.Flaws vs. FaultsIt may seem like I’m splitting hairs here, but wine flaws and wine faults are two different things. A wine flaw is considered a minor flavor or characteristic that isn’t “normal” for a wine, but doesn’t bust in and crush the rest of the wine’s flavor profile. Some people find flaws make a wine more unique and delicious, others find it distracting or downright not good.It’s important to understand and be able to recognize flaws in wine because these flaws are often mistaken as a flavor of a specific varietal or the wine’s terroir (that fancy French word for the environment where a wine is produced including the soil, climate, and surrounding vegetation). There was a good six months of my life I thought that all wines from the Loire tasted like barnyard. It turns out, I was just drinking wines that had a lot of Brettanomyces, a yeast that has nothing to do with the Loire. Too much of a flaw, like Brett, can cover up all the other flavor characteristics of a wine—the grape, the terroir, the winemaker’s techniques. When a flaw becomes so pervasive that it is all you taste, that flaw is now considered a fault.When it comes to picking out flaws and/or faults, all you have to do is taste wine. This is a little different than drinking it, because if you’re slugging back glasses, you may miss some things—both good and bad! Always take a moment to be present with your wine. Get your nose in there and give it a good whiff, and take a couple concentrated sips without scrolling through your feed.Now let’s talk about those flaws.BrettanomycesSymptoms: Generally, smells and tastes like a barnyard—manure, stables, sweaty saddles, gamey meats, and also sometimes Band-Aids.Brettanomyces is a type of yeast and is mostly known around town as “Brett.” Yeast is everywhere. Seriously, it’s naturally all over the place—in the air, on the grapes, in barrels, in the winery itself—meaning Brett can get into a wine at any point while making it. Too much Brett can make a wine taste like it was poured off the backside of a horse, but many people find small amounts of Brett in wine (and even beer) a positive thing that can enhance dark, brambly fruit flavors and also elevate floral notes, like jasmine.MouseSymptoms: Wine will have a finish that leaves your mouth feeling like a dirty mouse cage. It’s not exactly a taste, but more of an odor sitting in your mouth that you can taste. Like an “air” of something, but that something is, no joke, a urine-soaked sawdust cage full of mice [shivers]. It can also have notes of old cured meats, or the breath of my thirteen-year-old Pomeranian whose teeth are starting to rot out.If you didn’t glean it from the descriptors above, mouse is pretty gross. Most common in natural wines made without added sulfites, mouse is particularly pesty for a couple reasons. First, what causes mouse to begin with is still constantly debated—some say it’s from lactic acid, some say it’s from Brett, some think it’s from the wine sitting too long with the lees (dead yeast cells that settle after fermentation). Second, mouse is very rarely detectable by smell because its compounds only become perceivable when the pH of the wine changes, like when it mixes with your saliva and suddenly your whole mouth tastes like the time your class pet died over the weekend.Some people say that mouse is something that can subside with bottle aging, although once you open a wine and find out it’s mousy, that’s not very helpful. Mouse often becomes more apparent the longer the bottle is open, so don’t be surprised if something that tasted great when you first opened it, tastes like wet hamster bedding after an hour (or tragically, sometimes in 20 minutes). If a wine tastes mousy, you should stop drinking it because that horrible finish sticks around for a while and you don’t want it ruining the taste of your dinner, or worse, your next wine.Read more about what \"oxidized\" means here.\nPhoto by Marissa A. RossOxidation/OxidativeSymptoms: Both white and red wines will have a brownish tint to it. White wines will take on nutty aromas and flavors, and red wines will start to smell and taste like vinegar.Oxidation is when wine is unintentionally exposed to air, either during the winemaking process or in bottle through a bad closure. If you’ve ever had a bottle of wine open for a week, then you know what too much air can do to a wine: it turns brown and is stripped of all its flavors. Oxidized white wines start to turn into some sort of horrible sherry, and red wines turn into the bottom layer of an old vinaigrette that has separated and been left out in the sun.But oxygen can also be used to enhance a wine’s flavor profile, and we call these wines “oxidative.” Take white wines from Jura, France, for example. The region is renowned and revered for their aged Chardonnays and Savagnins that strategically use oxygen during winemaking to create rich notes of baked apples and salted caramel.Want to read more on oxidation? Check out this piece on how it’s the new oak.Reduction/ReducedSymptoms: Smells like burnt matches, rotten eggs, old cabbage, that time you visited Old Faithful in Yellowstone with your fam (AKA sulfur).Reduction is the exact opposite of oxidative, so instead of wines purposefully being exposed to air, they are intentionally kept from being exposed to air to preserve the fruit’s aromas throughout the aging process. Winemakers typically use sulfur and inert gases to ward off oxygen, and when done in balanced doses, they can add a light, flinty, lit match notes to an otherwise fruity bouquet.But like all living things, wines need to breathe a bit. If a wine doesn’t get enough air, volatile sulfur compounds begin to form and the wine becomes “reduced,” smelling and tasting of burnt rubber, Easter Eggs that were never found in your house from two years ago, and asparagus you-know-what.TCA (Cork Taint)Symptoms: Wine will smell like musty newspapers, humid attics, wet dogs, or cardboard, and the wine’s flavors will be muted and dull. Think of the word “moist” and how it makes you feel, and that’s pretty much a corked wine: damp and gross.Wine people can always find something to argue about, unless we’re talking TCA, the easy way to say 2,4,6-Trichloroanisole. This chemical compound is caused by phenols and/or fungi interacting with natural cork, and it straight up ruins wine and has no upside. TCA is universally bad, and while there are varying degrees of cork taint, it is inarguably considered a wine fault. No one has ever once been like, “I like my wine to taste like a soggy cardboard box I found on the curb.”The tricky thing with cork taint is that while everyone has heard of it, advancements in winemaking have made it less common. And while that is awesome, because no one wants wet dog wine, it also means that consumers have less exposure to it and have a harder time picking it out. Remember that TCA is most common in natural corks, and to trust your senses. If you think something smells like a basement, no matter the cork or closure, you're probably right.Volatile Acidity (VA)Symptoms: Vinegar vibes, ranging from balsamic to $4 red wine vinegar.Volatile acidity, often abbreviated to VA, is probably Brett’s best friend. They are both beloved and scorned, and also like Brett, VA is caused by various yeasts and bacteria that can jump into the wine at any stage of winemaking. These yeasts and bacteria create acetic acid, the same acid that makes vinegar, well, vinegar. Too much VA in a wine and it tastes like you’re drinking a component of your salad dressing. But small amounts of VA can add subtle sweet and tangy balsamic qualities that bring complexity to red fruit notes, like raspberry, cherry, and strawberry.So, Your Wine is Flawed. Now What? Never Drink That Wine Again?A flawed or faulty wine from a winemaker does not mean that all of their wines are, or will forever be, flawed. All winemakers—young, old, new, extremely experienced—can be susceptible to flaws in their wines. While you should always take note of wines you do not like, that doesn’t mean you should write them off altogether. Instead, you can use your hot new wine vocab words to better express what you do or don’t like about wines, so that you can spend your money and time drinking more wines you love.Photo by Alexandra GavilletOh, You’re at a Restaurant Right Now?If you think you’re detecting a flaw that is veering into faultdom, ask your dining crew their thoughts. If you still think the wine is flawed or faulty, dude, send it back! Simply tell your server that you feel the wine is experiencing a certain flaw and isn’t to your liking. As long as you’re not a jerk about it—hey, the fault isn’t theirs!—they will take it back no problem. I know it feels weird, but I promise it does not feel worse than paying $75 for a bottle of mouse juice you can’t stand to drink.Read more: How Long Does Wine Actually Last After It's Opened?Explore Bon AppétitWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Marissa A. Ross"]}