{"id": "9eb70157b5080e28894a2f18f8383836", "url": "https://www.bonappetit.com/recipe/lentil-kielbassoulet", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Lentil Kielbassoulet Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueLentil KielbassouletBy Molly BazFebruary 11, 20204.1(32)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintAll the satisfaction of a hearty, rich, bean-based cassoulet with none of the painstaking hours of assembly and cooking. Lentils, which do not require presoaking, sub in for beans, which means the whole thing comes together in a single pot. Be sure to seek out black beluga or French green lentils; they taste great and hold their shape.Ingredients8 servings½cup plus 3 Tbsp. extra-virgin olive oil, divided1lb. wild mushrooms (such as maitake or oyster), torn into 2\" pieces2½tsp. kosher salt, divided1lb. kielbasa sausage, cut 1\" thick on a diagonal1large fennel bulb, fronds finely chopped, bulb finely chopped1large onion, finely chopped2medium carrots, peeled, finely chopped2celery stalks, finely chopped11garlic cloves, 8 thinly sliced, 3 left whole1Tbsp. thyme leaves1¼tsp. hot smoked Spanish paprika½tsp. crushed red pepper flakes3Tbsp. double-concentrated tomato paste2cups black beluga or French green lentils1baguette, torn into 2\" piecesPreparationStep 1Preheat oven to 350°. Heat ¼ cup oil in a large Dutch oven over medium-high until smoking. Add mushrooms and cook, undisturbed, until golden brown underneath, about 5 minutes. Turn mushrooms over and cook, undisturbed, until browned on the other side, about 5 minutes. Season mushrooms with ½ tsp. salt; transfer to a plate.Step 2Add 3 Tbsp. oil to same pot and add sausage, arranging in a single layer. Reduce heat to medium and cook, undisturbed, until browned underneath, about 3 minutes. Turn sausage over and cook on second side until browned, about 3 minutes. Add chopped fennel bulb, onion, carrots, celery, sliced garlic, and 1 tsp. salt and cook, stirring often until vegetables are softened but have not taken on any color, 10–12 minutes. Add thyme, paprika, and red pepper flakes and cook, stirring, 1 minute. Add tomato paste and cook, stirring occasionally, until paste darkens in color and begins to stick to the bottom of pot, about 1 minute.Step 3Stir mushrooms, lentils, and 1 tsp. salt into sausage mixture and add 8 cups water. Increase heat to medium-high and bring to a boil. Reduce heat to low, cover pot, leaving lid slightly askew, and continue to cook, stirring a few times, until most of the liquid has been absorbed and stew is thick and lentils are barely al dente, 25–30 minutes.Step 4Meanwhile, pulse bread in a food processor until coarse crumbs form (the largest ones should be about ½\"). Transfer breadcrumbs to a large rimmed baking sheet and arrange in an even layer. Drizzle with remaining ¼ cup oil and toss to evenly coat. Bake until deep golden brown, 25–30 minutes. Remove from oven and finely grate remaining 3 garlic cloves over breadcrumbs; toss to incorporate. Add fennel fronds (you want to have about ½ cup) and toss again to combine.Step 5Scatter half of breadcrumbs evenly over stew. Transfer pot to oven and cook stew, uncovered, until some of the breadcrumbs have cooked into the stew and stew is bubbling around the edges, 13–15 minutes.Step 6Scatter remaining breadcrumbs over stew and cook until stew is very thick, 10–15 minutes.Step 7Do Ahead: Kielbassoulet can be made 3 days ahead. Let cool; cover and chill. Reheat, uncovered, in a 350° oven.How would you rate Lentil Kielbassoulet?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI had to search for black beluga lentils, and I wasn't impressed by any heightened flavor; they were black, but just lentil-tasting, no caviar cachet to them.  I did leave out the fennel--don't like it--and made a few adjustments to the spices, but otherwise stayed close to the recipe.  Much more bland than I expected. If I make this again I will leave out the mushrooms ($12 that only shows up as texture, not taste) and use a spicy chorizo and the broth that other reviewers suggest instead of kielbasa and water.  \nFrankly, the attempt to equate this recipe with cassoulet is a complete fraud. There's no comparison! The Bon Appetit cassoulet recipe takes a couple of days and some close attention, but it's a whole universe of flavor and even culture. Vive La France!\nIf you want something quicker that's still flavorful and has a connection to a national cuisine, check out bigos, the Polish hunter stew.  Delicious, and hard to mess up.Pablo in MKEMilwaukee11/15/2021Flavorless and boringJSChicago, IL7/20/2021This was WAAAY better than I expected. The paprika gives it a nice BBQ type flavor. \n\nI did a vegan, gluten free version using vegan Italian sausage and rice crumbs (instead of the baguette) and it was insanely good. I gave this to my 12 year old picky daughter who hates lentils, and she couldn’t get enough. \n\nI made a second batch and used extra paprika at the end and it was even better. Very creative and different recipe that rocks!!Stuart Los Angeles, CA5/30/2021My husband and I absolutely love this recipe! We cooked it with Kielbasa the first time and then switched to Chorizo, and we haven’t made it with Kielbasa since. We call it Chorizolet and it is a staple on our dinner menu in the winter. Bonus: it makes 8 servings, so we can freeze half of it for later. Love love love this, thank you Molly for a unique, hearty and delicious meal we will be cooking for years to come!SamFort Collins, CO2/1/2021This was delicious! We made the recipe as-is with no substitutions and were very happy with how it turned out. I was concerned that the 8 cups of water would be too liquid-y and would create a flavorless cassoulet, but boy was I wrong. The breadcrumb topping absorbs any remaining broth, and the kielbasa flavor packs a punch and is cooked long enough to impart that flavor to the rest of the dish. I'd recommend sticking with kielbasa with your meat choice for this reason.  The fennel wasn't very noticeable, so I'd say it's optional if you can't find it. \n\nI will make some minor changes the next time I make this. I'll cut the kielbasa into smaller bite-sized pieces, I'll also either save half of the breadcrumbs, or double the breadcrumbs so we can have crunchy bread bits for the leftovers. A keeper recipe overall!AnonymousMI1/24/2021Hello, Has anyone been to Clifton's Cafeteria, downtown Los Angeles? They made Outstanding Bean Cassoulet with ham hocks! They offered extra crunchy breadcrumbs. \nI made this recipe for a pot luck. It was very good, just not outstanding. As I was in Pa. at the time I used really good, garlicky homemade kielbassa There was about 1 serving left.\nNext time I will make this recipe I will use par cooked white beans                                              \nI did make 2 changes, replaced 2 cups water with 2 cups homemade veggie stock and, added 2 bay leaves. \nThanks for this recipe, it brought back happy memories of time spent in Los Angeles with family, when it was clean and safe. Please do not go looking for Cliftons as it closed, turning into some weird club. Very sad!!raf\nPlease keep Safe and Happy. Do everything you can to enjoy your Holidaze!!\nBerta AnneFallbrook,Ca.12/21/2020This was great! Made with double the amount Italian turkey sausage and half the olive oil. Wish I would have let the sausage get crispy before adding the veg, but the flavors were awesome. SarahPennsylvania12/5/2020This was so good! I couldn’t get fennel, so I skipped it, but I didn’t miss it. I used some chicken broth instead of water and it was great. Will definitely be making it again!Jess MOlympia, WA11/15/2020This smelled amazing while cooking but was really disappointing. I would not make it again. If you want to try it, add a bouquet garni, and use vegetable or chicken stock for flavor. It had little flavor as written and the only thing I did differently was that I used turkey kielbasa. Christine HutkinBuckingham, PA10/20/2020Despite a few missteps, this turned out delicious. Anonymous9/24/2020Oh my YUM. I made some substitutions. No mushrooms, bread crumbs, or fennel. I used chicken fig and feta sausage instead of kielbasa. I stuck with water instead of broth and pulled it out of the oven when it was still a tad brothy. I just wish I would’ve chopped up the sausage more and had some nice, crusty bread on the side. This was delicious and perfect for fall - and made my house smell AMAZING!rachlowDetroit9/21/2020We love this recipe so much that we've made it twice in 3 months, despite the 3+ hours of work it is to make. Not only is it delicious, it also produces so many leftovers that it's truly worth the effort. Thank you for introducing us to the maitake mushroom, which is the first mushroom my husband has actually liked. We agree with other reviewers that it would be worth keeping some of the bread crumb topping aside so you can have crunchy bits on your leftovers.AnonymousSan Francisco7/9/2020Pretty good dish, but I would make some adjustments. First, I would leave out the mushrooms. They are really expensive but dont really feel like they fit into or add anything to the dish. Second, make extra breadcrumbs. They really complete the dish and its nice to have some fresh with leftovers. Also I used 2 cups of beer as a replacement for one cup of water which was really good. Will definitely make again.Frauline_TurnipWisconsin6/28/2020Made this for my dad for Father's Day. I've never had a cassoulet so nothing to compare it to, but I like how this turned out. \n\nI cut the recipe in half, and sauteed the mushrooms with half butter, half oil. I deglazed the pot with red wine a few times, and used red lentils instead of green. They were really starchy but I personally enjoyed how thick it came out. Also did two cups veggie broth and two cups water. The veggie broth left me without a need for added salt. I did keep the Spanish paprika measurement the same though. As a whole this came out wonderfully. dalex27Pittsburgh, PA6/22/2020This turned out wonderfully for me. I didn't have a full two cups of lentils on hand so of neccessity I used only 1.25 cups and about 4-5 cups mix of chicken broth and water. Very high quality kielbasa is helpful. We get ours from Walden Meats, a meat share home-delivered available in New England. Cooking the tomato paste long enough to mellow is also key. joandalton452051Massachusetts3/18/2020Explore Bon AppétitStewSoups and StewsFrenchEuropeanMaitake MushroomMushroomVegetableOyster MushroomKielbasaSausageMeatFrench LentilLentilBlack LentilFallWinterOne-Pot MealsMainDairy-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Molly Baz"]}