{"id": "9ebb6609135cfaaa485020040eb3d9d6", "url": "https://www.bonappetit.com/story/molly-baz-cooking-rules", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Over-Salt Your Cookies—and More Essential Cooking Rules From Molly Baz | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOver-Salt Your Cookies—and More Essential Cooking Rules From Molly BazOur senior food editor has a real soft spot for Diamond Crystal.By Molly BazSeptember 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis month, we're doing a mini series on our podcast. Each of the Bon Appétit Test Kitchen editors will be sharing their top 10 cooking rules: the techniques they swear by, the ingredients they can’t live without, and the mindsets that keep them going. This week: the senior food editor who loves salt just as much as she loves Tuna (her pup!), Molly Baz.1. Three words: mise en placeGetting your sh*t together before you start cooking is the ultimate way to set yourself up for smooth sailing. One of the main reasons that home cooks struggle in the kitchen is lack of organization—not knowing when to start prepping, when to start cooking, what they can be doing in the downtime. Learning to get all of that stuff out of the way before you dive allows you to actually think about what you're doing. It’s important to clear your head.2. Resist the urge to constantly stir/fiddle/peek at your foodIf you’re going for browning, undisturbed contact with the pan is imperative.  Whether it’s sausage, Brussels sprouts, or a pork chop, give it time to sit over the heat.3. Desserts need salt just as much as savory food doesI’m not talking about salty-sweet desserts, those that lean into salt as their flavor profile. It’s just that in order for a dessert to really taste like itself, there has to be at least a small amount of salt in there.4. Good kitchen feng shui is essential to enjoying cooking.I spend a lot of time in my kitchen thinking about where everything should be so that it’s optimized for graceful cooking, which makes it that much more enjoyable and not so choppy. Even if you can’t completely re-construct your kitchen, you can think about what drawers you’re putting things in, what you’re most likely to reach for when you’re at the stove vs. at the counter. Set yourself up that way. If your flow isn’t right, you’ll never want to cook.Buy these guys in bulk.\n5. Kitchen towels are the best pot holdersI hate the wonky mitts. I don’t know who invented them, but they’re just unnecessary. Kitchen towels that are folded properly (and not damp!) are the perfect insulator, that then also double as a surface cleaner.6. Cook a recipe more than onceEven as I cook through my own recipes over and over again, they get better and better. If you come back to a recipe, you’ll feel a certain level of comfort with it already so you’ll be able to pay attention to things you weren’t able to pay attention to before.7. When following recipes, cook to the indicator, not to the time frameEverybody’s kitchen is different. Everybody’s stove is different. Everybody’s oven is different. We do a lot of testing in the Test Kitchen to provide time frames for everything you're doing in a recipe, so we’ll say “caramelize the onions for 25-30 minutes.” But the fact of the matter is, there’s no way for us to predict exactly what’s happening in your kitchen. So after that instruction there will be a comma and then it will say something like “or until deeply golden brown and starting to turn black at the edges.” That's the real indicator that you need to pay attention to in a recipe. The time doesn’t matter as much.A little green goes a long way on Molly’s beef and bacon stew.\n8. You eat with your eyesAlways think about how your dish is going to look on your plate. The more beautiful it is, the more delicious it is going to taste. I’m not saying you need to be busting out tweezers and little squeeze bottles, but just be mindful of your plating. Think about what dish you’re serving something on and how much negative space there is. Are you putting a nice fresh tumble of herbs on top because you made a beef stew? That kind of thing excites your palate.9. An oven thermometer is one of the most essential kitchen toolsEven if you set your oven to 325°, there’s a good chance it’s running at 375° or even 275°, which can make or break a recipe. It’s important to know what the hot spots of your oven are, too. So get a thermometer and get to know your oven.10. Salt is the number one reason your food doesn’t taste as good at home as it does in a restaurantI think that most home cooks are scared of over-seasoning. Actually, it’s important to over-season your food (at least once) to understand where that threshold is. It’s often possible that you follow a recipe, and there are so many elements, but you walk away feeling like it doesn’t taste as good as it should. It’s likely that you just need to add a little bit of salt.Listen to the full discussion on the BA Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitTest KitchenRead MorecookingThis Spicy Cashew Dressing Is Scientifically Proven* to Make You Eat More SaladBy Aliza AbarbanelcultureAdmit It: You Love MuffinsBy Alex BeggscookingThis Grilled Chicken Sandwich Is Definitely Not BoringBy Adam RapoportcookingThe Most Opinionated Editors Came Together to Make BA’s Best Matzo Ball SoupBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-18", "author": ["Condé Nast", "Molly Baz"]}