{"id": "9ebbb06ee53769688e1284cfc2f57244", "url": "https://www.bonappetit.com/story/rent-week-lentil-soup-recipe", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "A Lentil Soup Recipe to Improve Your Home Decor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Lentil Soup Recipe to Improve Your Home DecorLentil soup is a Rent Week classic, especially when it's cold outside...and you have to buy a credenza.By Alex DelanyNovember 1, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ve been saying credenza a lot more than I usually do. To be fair, I never say credenza, so saying it four or five times in a month is a lot for me. But I guess that’s what happens when you’re in the market for furniture to put in your new apartment—you end up saying credenza.You also end up making a lot of soup, because credenzas are expensive. Furniture in general is expensive. And I’ve decided that I’m at the point in my life where I should try to start investing in furniture that comes from somewhere other than a giant blue warehouse adorned with a large, yellow, Swedish acronym that stands for Ingvar Kamprad Elmtaryd Agunnaryd. So that’s why my roommate Greg and I just dropped a solid chunk of change on something that resembles a credenza. (I’m still not totally sure if it’s a credenza, TBH.) And I bought a nice dresser. And a modular storage system for my vinyl. And a bunch of shelves. Which is, again, why I’ve been making lentil, cabbage, and bacon soup.Soup is the ultimate Rent Week meal when it comes to the chillier months of the year. You can make it out of just about anything. You can freeze it and save it for Future You. And yes, it’s affordable, once you know what you’re doing. Soup is the Leonardo da Vinci of winter meals. It can do it all. Did that renaissance-era metaphor hook you? Are you committed and ready to make some soup? Great. Throw on this Credenza Tunage playlist (not an actual credenza, but completely free of charge) and get your chef’s knife and cutting board ready to go.Hey, look! It's all that stuff you chopped!\nPhoto by Chelsie CraigI’m not going to lead you on here: This process isn’t effortless. It starts with a lot of chopping, but you can totally handle it. Peel and finely chop 1 large yellow onion and 6-8 oz. of cremini mushrooms (the super cheap ones). Slice 5 carrots into thin coins, and finely chop the carrot stems and leaves. Smash, peel, and roughly chop 5 cloves of garlic. Slice 4 slices of thick-cut bacon into half-inch strips.And finally, cut ½ of a head of green cabbage into six wedges. Then cut those wedges in half across the middle. OK. All the chopping is finished. Were you timing yourself? No? Good. Neither was anyone else. You can chop at your own pace. No pressure at all.Throw a Dutch oven over medium heat, and spread the bacon you sliced across the bottom. We’re starting with the bacon so the fat can render and give us something to cook the rest of our vegetables and aromatics in. Once the bacon becomes brown and crispy on one side, give the whole thing a stir and wait until the other side browns. This should take about five minutes and smell really good. (If you have some type of fatty, salty, porky thing other than bacon—think sausage, ham, pancetta—you can totally use that instead.)Once the bacon is crispy and there’s a nice coating of fat on the bottom of your Dutch oven, dump the onion, garlic, mushrooms, and carrots in. Season with a couple pinches of kosher salt and red pepper flakes, and then add about 3 Tbsp. of red miso to the pot. Stir the vegetables so they get coated in the fat, salt, and miso evenly.The miso here is key, since it’s a quick replacement for the deep umami you’d get from adding stock to your broth. Oh yeah, I forgot to mention, we’re not using stock in this soup.Soup, or as the internet would call it, sööp.\nPhoto by Chelsie CraigWhoever said that you need stock to make flavorful soup was a liar. The same goes for whoever said that you need to spend hours watching your broth simmer for it to taste like anything. You can make soup with a rich, wildly flavorful broth in less than an hour. And you can make it from tap water. Yes, the stuff that comes out of the faucet on your kitchen sink.(Also, I’ve been calling tap water Faucet Juice lately, and while that really doesn’t have any impact on this recipe, I do think it’s funny and wanted you to know. Faucet Juice. Ha.)After the vegetables have been sweating with the miso for about ten minutes, there should be a bit of liquid that has collected at the bottom of the pot. That’s the base of our broth flavor. Now, we need more liquid. Add 6 cups of water to the pot, along with the chopped carrot stems and leaves. Add a few more pinches of kosher salt, since the water will dilute the flavor we’ve already created. Bring the pot to a boil and lower your face into the steam. Oh, hell yeah. It’s starting to smell like soup.Once the pot comes to a boil, add 1 cup of black lentils and the chopped cabbage. Black lentils are my favorite of all the lentils, because they keep their shape and have a firm outer skin, but French lentils will work here too. Turn the heat down to a simmer, and let the whole thing bubble gently for about 25-30 minutes with the lid on. Read a book, clean your fridge, or do some sit-ups in the meantime.Nice job with the sit-ups! That looked tiring. It’s time to check on the lentils, which should be tender but not split. This isn’t one of those pureed lentils soups. This is a wholesome lentil soup...meaning the lentils are whole. Some of the thinner cabbage leaves should be close to translucent, while the thicker ones might still be a little firm and toothy. That’s great! We want a little variety in texture. It keeps things interesting.A dollop of plain Greek yogurt brings the whole thing home.\nPhoto by Chelsie CraigNow, there’s one last thing you should address before serving. You need to make sure that there’s enough broth and that it’s seasoned properly. If you’re looking a little low on broth, go ahead and add a little more water, but remember that it needs to be seasoned. And you check for seasoning by tasting it. If it tastes under-seasoned, regardless of if you’ve added new water or not, add a little more salt.And then you grab bowls. Or a single bowl, if it’s just you. Or maybe still multiple bowls? If you like to go around and switch chairs and pretend to be other people? Whatever. It’s your soup. Do what you want, but make sure to top each bowl with a little bit of olive oil, a dollop of Greek yogurt, and some black pepper.To be clear, you don’t have to buy a credenza to make this soup. I just realized I might be pigeon-holing this as a credenza-adjacent soup. If you don’t have a credenza, or if you do, this soup will taste great and warm you right up. After two bowls, you’ll be full enough to fall asleep on your brand new couch and dream about having enough money to buy tasteful mid-century side tables and a few Eames chair (the ones with the ottoman). And maybe if you eat this soup for 433 straight meals, that dream can become your reality. Maybe.Not in the mood for soup? Fine. Rice noodles work too.These Rent Week Rice Noodles with Crispy Pork Make Me Feel AliveMy checking account is looking bleak, but my bowl of spicy rice noodles is not.View StoryExplore Bon AppétitBasicallyRent WeekSoupLentilMushroomCarrotMisoOnionGarlicCabbageBaconRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-01", "author": ["Condé Nast", "Alex Delany"]}