{"id": "9ee283bc95ae4bd58c8ccc231dce9aaf", "url": "https://www.bonappetit.com/story/cantaloupe-jelly-for-claire", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "This Week at BA: A Claire Party, Drinking Vinegars, and a Fancy Restaurant Toilet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Week at BA: A Claire Party, Drinking Vinegars, and a Fancy Restaurant ToiletSenior editor Alex Beggs shares a throwback recipe and some Claire news in her weekly newsletter.By Alex BeggsAugust 21, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior editor Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Claire foreverThe week started with a downpour of rain and a plastic bag full of t-shirts. We surprised Claire Saffitz with a potluck of her own recipes, made by the BA staff, and shirts that read “half-sour,” because, well, this is hard news to share, but she’s leaving us. To do great things! (You might still see her around. 😉) I made the cantaloupe-prosecco jelly above (mine looked nothing like Claire’s), art assistant Annalee Soskin made Claire’s Christmas gummies (hard!), editorial assistant Emma Wartzman made her peanut butter blondies, associate editor Christina Chaey made this sausage stir-fry (disappeared the fastest), visuals assistant Emma Fishman made the new ricotta panna cotta, and there were SO MANY MORE. I asked Claire what she would have made for herself on this occasion and she said: morning buns, sourdough, or BA’s best buttermilk biscuits. Sense a theme?❤️ WE LOVE YOU CLAIRE!!! ❤️Drink the vinegarSweet, sour, unpalatable vinegar! For Healthyish, I spent too much time tasting “drinking vinegars,” a new category of $4 drinks at a health store near you. Not quite kombucha—mostly water with a tablespoon of apple cider vinegar—these drinks can be close to delicious, while others tasted like Stevia-soaked sadness. Learn more about WHY this is such a thing, and which drinks, if any, you should try yourself, right over here. Just don’t guzzle more than one a day; I found out the hard way.Want this letter before it hits the website? Sign up for our newsletter!Overheard in the BA officeA hushed whisper: “Someone’s microwaving calamari.”Photo by Alex LauHot Hot 10Did you catch our big news of the week? The Hot 10 list dropped, aka the Best New Restaurants in America! I want to go to Oklahoma City! I thought the photos by Alex Lau were phenomenal, and had a special place in my heart for this bathroom shot inside the super stylish Freedman’s in LA. I’m picturing a line of people behind Lau, tapping their feet and doing a little dance, as he snapped the perfect portrait of that GOLD TOILET FLUSH LEVER.WhyWas Shia LaBeouf eating a steak with his bare hands this week? Dunno, but I am glad all of the gossip sites reported on it, because now I have something to think about when I’m doing the dishes.Ramen heist!“Nearly $100,000 worth of Ramen Noodles was stolen in Georgia, according to police,” tweeted FOX 5 DC. To which the world replied: HOW MUCH? And @alliz71 won the reply game:Unnecessary food feud of the weekSomeone picked up a mini yellow watermelon at the farmers’ market this week and as we popped the triangular slices into our mouths, I asked Brad: “What’s better, yellow or red watermelon?” In unison we replied: “red.” Everyone got along this week. It was for Claire.Chelsie CraigMust-readThis rosé exposé!A correctionOops. In my last note, I confidently wrote that Cary Grant starred in It Happened One Night. It was Clark Gable, dummy! I got my swashbuckling, pomade-slicked stars crossed. I apologize for this egregious error. That said, I also baked a galette on wax paper; my flaws contain multitudes. I’d like to send my regrets to: Grace, Chris, Debra, Jayne, Kathrynn, Ann, Porter, Maureen, Barbara, Kate, Lynn, Nancy, and Shelley, who felt the whole thing was “Really dumb trivia. Boring!!!” Sorry, Shelley!To make up for itHere’s a very, very good recipe.Explore Bon AppétitBeggs NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-20", "author": ["Condé Nast", "Alex Beggs"]}