{"id": "9ee4fec968d8df63f8c254a2ac3d1a51", "url": "https://www.bonappetit.com/recipe/morning-glory-baked-oatmeal", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Morning Glory Baked Oatmeal Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMorning Glory Baked OatmealBy Sara ForteSeptember 17, 20214.4(189)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl Jones, Prop Styling by Anne EastmanEmailPinterestPrintEmailPinterestPrintWarm and cozy, this big-batch baked oatmeal takes inspiration from those beloved hippie muffins known as morning glory. It’s loaded with grated carrot and apple, two kinds of oats (rolled and steel-cut) for an extra fiber punch, and sweetened with fresh orange juice, raisins, and a touch of maple syrup instead of refined sugar. Make it at the start of the week, keep it in the fridge, and reheat portions as needed with a splash of milk for a wholesome breakfast that’s faster than toast. To make it vegan, skip the egg (which just adds structure) and swap the butter and milk for any non-dairy alternative you like. For a handheld, portable version, add another egg and give the baked oats a day to rest; they’ll firm up for a more sliceable texture.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBox Grater$13 At Amazon8x8\" Baking Dish$15.99 At AmazonVegetable Peeler$10 At AmazonWhisk$10 At AmazonIngredients6–8 servings3Tbsp. melted unsalted butter, plus more room temperature for pan1large eggZest of 1 orange½cup fresh orange juice2cups milk⅓cup pure maple syrup1tsp. vanilla extract1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. ground cinnamon½tsp. ground ginger2cups old-fashioned oats½cup steel-cut oats1cup grated apple (about 1 medium)1cup grated carrot (about 1 large)½cup golden or other raisins1tsp. baking powder½cup chopped pecans, plus more for servingHeavy cream or milkPreparationStep 1Place a rack in middle of oven; preheat to 375°. Butter an 8x8\" ovenproof baking dish. Whisk egg, orange zest, orange juice, milk, maple syrup, melted butter, vanilla, salt, cinnamon, and ginger in a large bowl to combine. Add old-fashioned oats, steel-cut oats, apple, carrot, raisins, baking powder, and ½ cup pecans and stir again to combine. Scrape into prepared baking dish and sprinkle more pecans on top.Step 2Bake oatmeal until top is golden brown and has puffed up a bit, about 40 minutes. Let sit 5 minutes.Step 3Serve warm with a drizzle of cream on top.Do ahead: Oatmeal can be baked 5 days ahead. Cover and chill. Reheat with a splash of milk before serving.How would you rate Morning Glory Baked Oatmeal?Leave a ReviewTell us what you thinkReviews (52)Back to TopTriangleOverall very nice, though next time I will remove the maple syrup entirely (raisins, carrots, and apples are naturally sweet!), and replace the butter with oil. I want this to be a healthy breakfast, and it’s almost, but not quite there!Jen3/12/2022Wow! What a wonderfully flexible and delectable recipe. I had to make do with some substitutions. I didn’t have quite enough baking powder so added baking soda to make up for it. I added a little whipping cream to low fat milk. I didn’t have enough apple so I added1/4 c.  lemon purée made from simmered meyer lemon shells and sugar and vanilla from another bon appetit recipe for what to do with remainders after juicing. (Since I have a tree there are a LOT of lemons to squeeze and freeze.) Other substitutions included sprouted walnuts and chopped dates. For fun, I added frozen shredded coconut and cardamom.\nI suspect that you can do almost about anything with this if you are careful with solids and liquids. \nI baked it in large muffin cups and in 6”x4”x2” and 6”x6”x 3” glass storage containers. Cooking times did not need to be adjusted but I watched it carefully and don’t have super hot oven. I’m going to freeze the muffins and the small container.\nIt is time consuming to prepare but ability to freeze it will pay off.Long reward for time spentGainesville, Florida2/6/2022I always try to follow a recipe exactly the first time and I’m glad I did for this one. Easy to put together and very tasty. That said I will probably make a few changes next time. It wasn’t quite as sweet as I like but adding artificial sweetener or brown sugar when serving solves that. I would also increase nuts and raisins to 1 cup each. Don’t leave out orange peel as it adds a very subtle flavor note. Helene TozierLas Vegas2/1/2022Success! \nWhat a SUPER recipe! Other baked oatmeal recipes I’ve tried have been bland and uninteresting. This one, with its carrots, apple, maple syrup…easy-bake in the oven—my favorite new breakfast dish this year. I used all rolled oats and will be decreasing the maple syrup next time—overall, I like a less sweet oatmeal. DEFINITELY a WINNER!!AnonymousCA1/31/2022This was an utter fail.  The final product tasted like....nothing.  I had smelled the citrus and fruits all through the prep and some of the baking, only to have it come out with literally zero taste.  That in itself was disappointing, and would have merited probably 2-3 stars because I can top it with some fresh peanut butter and solve the taste problem.  What I was also not prepared for, and which knocks this down to one star, was that my 8x8 pan overflowed in the oven, resulting in a burnt concrete-like substance on my oven floor which I now have the fun task of cleaning out.  Anonymous1/31/2022Easy, delicious and nutritious., tasty and healthy.I used coconut milk instead cow milk. I have sweet teeth and put a little more maple. Next time I will with different spices.5 ⭐️AnonymousAtlanta, GA1/31/2022Morning Glory Baked Oatmeal is a delicious way to begin the morning! I put together all of the dry ingredients the day before. This made the prep time in the morning go a lot faster. The oatmeal was tasty and very filling. Loved it!Kah4evaMassapequa, New York1/25/2022This is a well-conceived recipe, and we are really enjoying it, as a break from our normal yogurt-centric breakfasts.  Excellent flavor and texture, and we liked that it is not too sweet, as written.  In an 8x8 pan, it bakes up fairly thick, and we found cutting it into 8 pieces provided a portion which was hefty and satisfying.  I don’t use milk alternatives often, but the thickness of unsweetened almond milk worked well, both in the recipe, and for morning reheating.  I added about 1/2 cup of coconut to the mix, which added great flavor and texture.  Also, I subbed WheyLow gold for the maple syrup, since my husband is diabetic.  A dash of maple extract preserved the wintry flavors of the oatmeal.  I love the convenience of making something on Sunday which will last us most of our work week!  This will definitely go into our breakfast  rotation.HighnoteThe Garden State1/24/2022I too am wondering about the option of making these as muffins…\nMunkFortuna, CA1/24/2022\nSo excited to find this new breakfast (or snack!) treat.  It has great flavors, lots of options to improvise, and it's healthy!\n\nCathy Kansas City1/23/2022I used fresh blueberries - YUM!AnonymousPhoenix1/21/2022The flavors in this are fantastic, and I've decided I like it even better as a porridge-style oatmeal. I omit the egg and baking powder, add an additional 3½ cups water, stir together all the ingredients except the pecans and cook in my rice cooker on the porridge setting. While the oatmeal cooks, I toast the chopped pecans to sprinkle over each serving. I think shredded coconut would be a great topping addition.JuliePortland, Oregon1/21/2022I read the reviews/tips first…. So I added an extra egg, some fine coconut, a dash of cardamom and 2 TBS maraschino juice to make the scant amount of oj …. I think it’s delicious! I plan to portion it out and freeze. Wondering… has anyone just made it in big muffin cups??Nanasara2 1/18/2022Just amazing! I threw in all kinds of nuts and died friut, chia seeds, hemp seeds, goji berries, coconut flakes! Tastes like Christmas!ShireenWindsor, ON1/18/2022Oh my goodness!  What a treat for starting a day.  Loved it just as is but will try suggestions from other reviewers as time goes by for variety.  My husband and I are both 90 years old and really like having oatmeal in the morning.  Thank you for a lovely riff on Morning Glory Cake.DrDiSan Ramon, CA1/17/2022Explore Bon AppétitOatmealBreakfastMake AheadMeal PrepAppleFruitCarrotVegetableBakeVegetarianHealthyishVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-17", "author": ["Condé Nast", "Sara Forte"]}