{"id": "9eebf0bf93613418d55000cd0caef211", "url": "https://www.bonappetit.com/story/fruit-stickers", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Fruit Stickers Are Better Art Than Anything Andy Warhol Ever Did | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureFruit Stickers Are Better Art Than Anything Andy Warhol Ever DidStop throwing away these tiny, sticky pieces of modern art.By Alex DelanyFebruary 27, 2018FacebookTwitterEmailFacebookTwitterEmailGo to the closest trash can. Examine the exterior and the crusty walls inside. Search the folds of shiny, black garbage bag hanging over the edge. Somewhere in there hangs a fruit sticker, ripped off of an apple or banana and smacked on its ugly new home. To most, these stickers are a nuisance, an inconveniently placed speed bump. But if you take the time to look at them, they’re something else entirely. Art. Design. Typography. Personality. Fruit stickers hold them all, and it wasn’t until we discovered @Fruit_stickers that we became so acutely aware of this under-appreciated art form.@Fruit_stickers is an Instagram account run by British graphic designer Kelly Angood,  who collects fruit stickers from around the world, peels them off of their respective fruits, scans them, and posts them on Instagram. She’s posted over 700 so far. It’s a collection of brilliant illustrations and graphic design. And above all, it’s really fun. Fruit Stickers is my favorite Instagram account right now, and that’s coming from someone who spends way too much time on Instagram.“Collecting fruit stickers was never intentional,” says Angood, who currently designs, manufactures, and distributes DIY analogue pinhole cameras (Yes, another niche interest). “For years I just stuck them inside pages in notebooks. Maybe it was because I liked the designs, maybe it felt like a little reward system for eating fruit. I wasn’t doing it consciously.” She collects them on trips abroad or at her local market, and others she receives as donations, including a collection of stickers from the 1960s - 1980s she received last year from an American woman.We asked Angood to share her 24 favorite fruit stickers, and her thoughts on what makes them more likely to be hanging in a design museum than inside a trashcan:“I love these Linda stickers. They always involve a woman in a banana, and I like to think of them as The Little Mermaid...but fruit.”“This is a great color combination with great graphics. Both very ‘90s. Something about it reminds me of the titles to Saved By The Bell. Saved by The Bell Pepper? Too far?”“There are some really beautiful stickers out there—great typography, amazing colors, unusual shapes. But to be honest, I love it when the growers decide to anthropomorphize some citrus fruit or a banana. These are amazing.”“I believe this is actually a pineapple tag, rather than a sticker, but let’s not split hairs. This is from the ‘90s, and one of its key messages is ‘Jet-fresh.’ I find it difficult to see that phrasing happening in 2018, when we have such an emphasis on reducing food miles and sourcing locally.”“For me, this one is all about the mid-century style orange. You could easily see that element repeated on some wallpaper in your grandma’s house.”“This is a melon sticker from Spain. Why the bird? We may never know.”“Gothic lettering? Check. Tiny image of Rembrandt? Check. Complete and logical relationship to it being on an orange? Umm.”\"This is obviously from Florida, and the heart shape is just cute.”“I also like it when small companies steal a really well known brand and use it as their sticker, as though the brand’s reputation can somehow translate into something as simple as an apple. Example A: this fake Rolex sticker.”“I love stickers from Southern Europe, and this Spanish clementine is no exception. The type and color combination are simply fun.”“I like to image that the person that designed this is a superhero in his or her spare time. Or at least goes to Comicon regularly.”“The leaf shape is very popular in Spain, where this sticker came from. Let’s assume the grower is a massive Batman fan.”“The negative space in this design is great. It feels as though you’re looking into a science diagram of a snake swallowing the banana whole. Complimentary colors are on point, and I give bonus points for a pun-based name.”“These are Space Jam stickers. That should be about all you need to know.”“I feel as though the general message of this sticker is that bananas are great fuel to keep you going when you’re active. That’s all well and good, but also...IT’S A BANANA PLAYING BASKETBALL. HELLO!”“This was donated to me, and I have no idea of its context at all, other than it’s brilliant and fairly old. But imagine the design meeting.”“This space sticker is part of a series. I have no idea why space and fruit seems like a good match, but I like to imagine fruits as planets.”“The Dole ‘Bananimals’ are maybe some of my favorite fruit stickers ever. I mean, seriously, an octopus made of bananas? A bear with banana extremities? What’s not to enjoy about that? They even made plush toys in the ‘90s. (Yep, I have an eBay alert for them.)”“Orange smiles! This is some next level anthropomorphizing. Never mind a character, let’s just make the fruit alive. Some say it’s fun. For others, it’s the stuff of nightmares.”Need an excuse to buy some fruit? Here ya' go:1 / 39ChevronChevronHoneydew, Jicama, and Mango SaladView RecipeExplore Bon AppétitFruitInstagramRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-27", "author": ["Condé Nast", "Alex Delany"]}