{"id": "9ef91ad6235960c3e28b3be44fd59952", "url": "https://www.bonappetit.com/recipe/charred-and-raw-corn-with-chile-and-cheese", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Charred and Raw Corn Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCharred and Raw Corn SaladBy Alison RomanAugust 1, 20184.0(103)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintAll the things that you love about elote (Mexican grilled corn), now in a convenient tossed-together form, perfect for using up fresh produce from the farmers’ market. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings4Tbsp. extra-virgin olive oil, divided6ears of corn, husked, kernels cut from cobs1small shallot, cut into rings1red chile (such as Fresno or red jalapeño), sliced into rings5Tbsp. fresh lime juiceKosher salt3Tbsp. whole-milk Greek yogurt1oz. finely grated Parmesan (about 3 Tbsp.), plus more for serving½cup cilantro leaves with tender stems, coarsely chopped, dividedPreparationStep 1Heat 1 Tbsp. oil in a medium skillet, preferably cast iron, over medium-high. Add one-third of corn kernels and cook, undisturbed, until lightly charred underneath, 1–2 minutes. Toss and continue to cook, tossing occasionally, until lightly charred all over, 2–3 minutes longer.Step 2Meanwhile, mix shallot, chile, lime juice, and remaining 3 Tbsp. oil in a medium bowl; season with salt. Let sit at least 5 minutes or up to 1 hour to let shallot soften slightly. Add charred corn, remaining corn kernels, yogurt, 1 oz. Parmesan, and half of cilantro; season with salt. Toss to combine.Step 3Top corn salad with more Parmesan and remaining cilantro just before serving.How would you rate Charred and Raw Corn Salad?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleComing back to this recipe for the 4th of July tomorrow. I’ve made this multiple times and it’s always a crowd favorite. Easy enough to make for a low key week day and exciting enough to be a star at the potluck AnonymousChicago 7/3/2020This recipe was good, but I really want to char all of the corn next time.  To get a even better elote-like dish I would also add a little chili powder to the mix,GrcisgoneGreenville, WI6/19/2020The original recipe was perfect!! Why change the recipe? Why not just make a new page? Ugh BA!Anonymous7/13/2019I also made the earlier version of BA's charred and raw corn salad many times, but with cojita instead of yogurt and parmesan.  I often don't have cojita on hand so just omit it, and it is fantastic. In that version, the shallot and raw corn are marinated in the vinaigrette while you grill the corn. I think it would also be great with all charred corn, but the raw corn adds a wonderful texture and marinating it briefly really deepens the flavour.  AnonymousToronto5/26/2019I wonder if you can't char all the corn. I love charred corn and the lime and cilantro would taste so great.\nAnonymousRockland County, NY8/18/2018Has the recipe been changed? I made it last summer and was revisiting it, but it didn't call for yogurt and it had cotija cheese in place of parmesan.AnonymousChicago7/31/2018Fantastic summer salad! I have fixed this many times now four large family grill outs and Mexican fiestas. It is always the first thing to go and people rave over it. I like to also add red and orange bell pepper and parboiled zucchini and it turns into a chunky vegetable salad worthy of a meal!AnonymousColorado3/8/2018Explore Bon AppétitSaladMexicanLatin AmericanCornVegetableFresno ChileChileCilantroHerbs & SpicesSummerEasySideGluten-FreeNut-FreeVegetarianHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2014-06-19", "author": ["Condé Nast", "Alison Roman"]}