{"id": "9ef9a445ec479d25a80ad1806a3b81bf", "url": "https://www.bonappetit.com/story/julia-paul-child-valentines-auction", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Let These Julia Child Valentines Be a Small Joy In Your Crazy Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLet These Julia Child Valentines Be a Small Joy In Your Crazy WeekBid on these postcards and Valentines from Paul and Julia Child and go on pretending you’ve been friends with them all along.By Alex BeggsApril 26, 2018FacebookTwitterEmailPhotos in collage courtesy of The Written Word AutographsFacebookTwitterEmailIf you’ve already obsessed over these candid photographs of Julia Child, visited her kitchen at the Smithsonian, and tried to recreate every recipe in Mastering the Art of French Cooking—well, this upcoming auction is for you.A collection of letters from Julia and Paul Child, including a hilarious Valentine of the two in a voluminous bubble bath, are on the auction block May 19 at 11 a.m. (take an “early lunch”). The trove was found in the home of Hadley and Paul Mowrer in Chocorua, New Hampshire, who were good friends of the Childs, when the Mowrer’s house was sold in 2012. (Absolutely random detail: Hadley was Ernest Hemingway’s first wife. How about that!) “The items were given to a local woman because she was a fan of Julia Child,” said a spokesman for The Written Word Autographs, who is hosting the auction, “and that woman has consigned the pieces to The Written Word Autographs for this auction.”Let’s take a look at what Julia Child souvenirs could be yours:Courtesy of The Written Word AutographsA photograph of Julia and Paul Child, and a handwritten poem to their friendsWith this photographic evidence, you can pretend your life’s history included a delightful correspondence with your dear friends Paul and Julia. Remember that time they came to visit you in New Hampshire? And then they sent this adorable poem about a trivet for you to magnetize to the fridge for ALL TIME. (In actuality, this was a thank you note to Paul and Hadley Mowrer, who apparently gave the Childs a gift of a lovely little wooden trivet. Please note the awesome handwriting. Julia’s? We can only guess. Though probably not.)The bidding starts at $400Courtesy of The Written Word AutographsA groovy ValentineYou have to admire the Childs’ dedication to these wacky Valentines, year after year. They loved love! They loved each other! We could all use more of that. In this Valentine, please note the tall and leggy and naked cartoon versions of Julia and Paul.The bidding starts at $1,800Courtesy of The Written Word AutographsThe bubble bath Valentine, wowThis one is really special. I’m...not sure what else to say. The caption on the back was written by the Childs’ cat, Minette, and reads: “Dearest friends – I didn’t care to get into this picture, so I pushed the button. Ever yours – Minette” Meanwhile, my love for the Childs only grows.The bidding starts at $1,500Courtesy of The Written Word AutographsPostcardsOne note from P+J Child reads: “If we don’t get word out of that wasteful Pastland pretty soon, you know what you can expect in the way of naked splendor.” What I glean from this is, the Childs are waiting for the Mowers to write them, but then threaten some naked pics if they don’t? Unclear, but nudity appears to be involved and I’m endlessly intrigued.Another note mentions my favorite character, Minette, again as P&J write: “Dearest Hadley…Sounds as though you were loving NH and very happy, with birds and everything…Minettee says to keep feeding the birds so they will be fat for her arrival.”The bidding starts at $1,000 and $850, respectivelyYou can see more postcards and the full auction over here. Hold on to your apron strings, though, the bidding doesn’t begin until May 19.Don’t miss this: Rare Photos of Julia Child, Like You’ve Never Seen Her BeforeExplore Bon AppétitJulia ChildTrends + NewsRead MorecultureJulia Child, Like You've Never Seen Her BeforeBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Alex Beggs"]}