{"id": "9efa5f8897e9ba94f18bd3017fc6572d", "url": "https://www.bonappetit.com/recipe/scallion-pancakes-with-chili-ginger-dipping-sauce", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Scallion Pancakes With Chili-Ginger Dipping Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueScallion Pancakes With Chili-Ginger Dipping SauceBy Andy BaraghaniMarch 17, 20204.5(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThese pancakes, which take inspiration from Korean pajeon, get their light texture from a batter made with club soda, similar to tempura batter. Pressing hard on them when frying makes them crisp, as does the inclusion of cornstarch. The scallions are left in big pieces so they get charred on the edges of the pancake while remaining soft and tender inside.IngredientsMakes 4 PancakesSauce1½\" piece ginger, peeled,  thinly sliced2Tbsp. low-sodium soy sauce2Tbsp. unseasoned rice vinegar1tsp. chili oil1tsp. sugarPancakes and Assembly1cup all-purpose flour¼cup cornstarch1tsp. kosher salt1tsp. sugar1cup chilled club soda2tsp. low-sodium soy sauce1tsp. toasted sesame oil10scallions, thinly sliced on  a diagonal (about 2 cups)4Tbsp. vegetable oilPreparationSauceStep 1Whisk ginger, soy sauce, vinegar, chili oil, and sugar in a small bowl until sugar is dissolved. Set sauce aside.pancakes and AssemblyStep 2Whisk flour, cornstarch, salt, and sugar in a large bowl. Whisk club soda, soy sauce, and sesame oil in a medium bowl to combine, then pour into dry ingredients and whisk until smooth (be careful not to overmix; it’s okay if there are a few small lumps). Fold in scallions.Step 3Heat 1 Tbsp. oil in a medium nonstick skillet over medium-high. Pour ¼ cup batter into skillet. Cook, moving pan around on the burner for even cooking, until bottom of pancake is set and golden, about 2 minutes. Flip and cook, pressing down on pancake to create direct contact with pan, until other side is golden, about 1 minute. Continue cooking, turning often to keep scallions from burning, until golden brown and crisp and cooked through, about 5 minutes longer. Transfer pancake to a wire rack. Repeat process with remaining batter and remaining 3 Tbsp. oil 3 more times to make a total of 4 pancakes.Step 4Cut each pancake into wedges if desired and serve with reserved sauce on the side for dipping.How would you rate Scallion Pancakes With Chili-Ginger Dipping Sauce?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleReally liked this recipe. The batter was very thick so I thinned out with some ginger soda that I had already subbed. I shld hv pressed down more on the pancakes as they said or thinned a bit more for my taste. For the sauce, I used pickled ginger. Much easier and nice flavor. It added a little brightness. \nEveryone loved them. Will go into a regular rotation. \nThanks for something different with my asian salmon:)Vintage babeChicago9/16/2021I really like this recipe!! The sauce is amazing!Love itttttEffie W2/20/2021Anyone know math??? You can’t make 4 one-quarter cup pancakes with 4+ cups of  batter. What should it really say?  These were gummy and less flavorable than I imagined they’d be, and lots more than 4 pancakes. HensleyHomeSacramento1/11/2021These were a huge hit! I agree with the comments that say this amount of dough makes more than four pancakes. I found that turning the heat slightly lower allowed me to achieve the desired crispyness, so if you have some time on your hands that's a good strategyAnonymousCalifornia 6/10/2020these were kinda weird and gummy for me? didn't really get crispy like I expected?? any suggestions? lol toronto5/15/2020What the heck! These are so good! I'm having a really hard time not eating every single one as soon as they come out of the pan.EseeksMaine5/12/2020This yielded 4 larger pancakes. I stacked  them and then cut each pancake in fourths. The sauce is a bit on the tangier side from the vinegar, I used the leftover dipping sauce to pair with Sohla's dumplings :DAnonymousSan Francisco5/10/2020I made the Scallion Pancakes w/ginger-chili sauce and it was so good that I registered today so I could saye \"o m g ! \".....amazing! ....it will be my \"go to\" side dish with any protein and definitely an easy Asian vegetable dish to go with my Trader's Joe frozen orange chicken entree! ...lolJodi McTulsa, OK5/7/2020Delicious and using the sauce again and againAnonymousLA5/2/2020these were remarkably easy to make and delicious. (oops! i accidentally made one before i folded in the scallions  but it kinda tasted good too!). but the next morning, with a fried egg on top -- OMG good!Anonymoustallahassee4/24/2020I was super excited to make these, as I love scallion pancakes. After looking through this recipe, I've realized that I didn't actually make this one! Bon Appetit has THREE different scallion pancake recipes! When I search on the BA website, I only find this one, but I started from Google. \nI looked up 'bon appetit scallion pancakes' from google, and the first result isn't this one. \nI'll be trying out this recipe soon to see how it compares to the recipe from 2016 (haven't tried the 2017 recipe). AnonymousCharlotte, NC4/20/2020These did not work at all for us. We used gluten free all purpose flour and I don’t know if that was the mistake for us, but we followed the rest of the recipe as written and the texture was terrible. Like slightly melted cheese in the middle. Not fluffy as described in the magazine. My fiancé ate them but I couldn’t choke them down.angmar2805Minneapolis4/18/2020Great recipe, Andy! Really delicious and will 100% make this again. Agreed with reviewers below that the batter seems to make more than 4 pancakes if you stick to the 1/4 cup measurement. I made them a little bigger, so it took a while for them to get fully cooked through. Again, as everyone says below, make sure to flatten the pancakes. The dipping sauce is also key – so good!lesliech4/15/2020I didn't use enough oil so mine didn't crisp up as nicely as was pictured, but they were still tasty. I used chili-garlic paste instead of chili oil, and added another teaspoon of sugar to the sauce as I felt that it helped to balance the flavour better.AnonymousToronto4/6/2020Very good! I also did not have club soda, so I used a lime sparkling water (Waterloo). worked great. I agree that it is important to use enough oil and to try to flatten them out a bit. Mine were a bit too thick, but the were still good. They good on their own, but the dipping sauce is a great addition, very good!jey9731Frisco, Tx4/3/2020Explore Bon AppétitPancakeKoreanEast AsianAsianScallionOnionVegetableEasyStarterSideDairy-FreeVegetarianVeganLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Andy Baraghani"]}