{"id": "9efe3078bd1e8de91eabd10a988d4596", "url": "https://www.bonappetit.com/story/peanut-butter-noodles-lunch", "year": 2021.0, "month": 2.0, "day": 3.0, "content": "When Lunch Feels Too Hard, Make Peanut Butter Noodles | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Lunch Feels Too Hard, Make Peanut Butter Noodles Hearty, delicious, and satisfying, these throw-together noodles won’t feel like you’ve given up—even if you already have.By Hetty McKinnonFebruary 17, 2021FacebookTwitterEmailPhoto by Laura Murray, food styling by Susie TheodorouFacebookTwitterEmailI’ve lost track of the number of meals I’ve cooked (and cleaned!) this past year of quarantine, though 1,095 (that’s 365 multiplied by 3 for all you keeping score at home) is probably close. Even as a recipe developer and cookbook author who’s no stranger to working from home, lunch in particular presents a conundrum—I never actually even cooked it before quarantine. It’s hard enough to peel myself away from the computer to whip something up in the middle of the day, but coordinating with my family’s five different lunch breaks (and preferences) only adds to the trickiness. There have been wins (that time I made dumplings and teamed it with marinara sauce), there have been losses (even sourdough discard pancakes get boring when you have eaten it 10 days in a row), and there have been lots and lots of Peanut Butter Noodles.Leaning on the power of a few pantry staples, this dish has a depth of flavor and dimension that belies what a fast, easy, flexible, and mindless (and therefore brilliant) solution it is when time and energy are low and lunch-time hunger pangs are high. Though this recipe calls for a mix of peanut butter, rice vinegar, maple syrup, garlic, soy sauce, plus dried noodles, you can think of it more as a formula: A nutty, full-bodied base thinned out with a mix of something acidic to cut through the richness, something sweet for balance, and something salty for a jolt of umami. That means whether you are Team Smooth or Camp Crunchy, any variety of peanut butter is fine. Don’t dig peanuts? Sub for another type of nut or seed butter, or use tahini. If your syrup is low, try honey or sugar. My pantry is always well stocked with Asian noodles—instant ramen, wheat, udon, rice vermicelli, thick rice noodles, soba, somen, egg noodles—and any of these will work great, but so will pasta noodles like spaghetti, linguine, or fettuccine.And while it really is all about the creamy, pourable sauce, a few veggies help to round out the dish and add even more range. Cucumber gives a pleasing fresh crunch, which is why I call for it here, but so would shredded carrots or cabbage. Or, if you have leftover roasted vegetables in the fridge, you could throw those in and ramp up the nutrition factor.Best of all, because it’s just as good cold, you can even make everything in the morning before you sit down to work, and let it hang out on the counter until you, or anyone else in the house, gets hungry. (Both the sauce and noodles are happy at room temperature—just loosen the drained noodles under water before eating.) Present everything, including any accoutrements to dress it up—scallions, sesame oil, chilli oil, sesame seeds, and peanuts—in its own vessel, and let everyone assemble their own bowl. Who knows, maybe it’ll even inspire them to clean up their own dishes while they're at it.Get the Recipe:Peanut Butter Noodles With CucumbersHetty McKinnon’s creamy, crunchy, salty-sweet peanut noodles with cucumbers are busting up our what’s-for-lunch blues.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-17", "author": ["Condé Nast", "Hetty Mckinnon"]}