{"id": "9f26b40f16a17ea85744c0c61db3bef3", "url": "https://www.bonappetit.com/story/antoni-porowski-restaurant-village-den", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Antoni Porowski Is “Nervous as Hell” for You to Try His New Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAntoni Porowski Is “Nervous as Hell” for You to Try His New RestaurantThe Queer Eye star on what to expect from his healthy fast-casual menu—and how often you’ll really see him behind the counter.By Alyse WhitneySeptember 28, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAntoni Porowski isn’t trying to reinvent the wheel with his new healthy fast-casual restaurant Village Den, but he wants to be the one steering the car. His first step in creating the menu ahead of the all-day restaurant’s opening next week in New York City’s West Village was to accept an ingredient he has a complicated relationship with. Porowski initially fought to keep avocados off the menu entirely because of the reputation he got on Queer Eye for his “obsession” with using them in every dish. Eventually, he caved, putting avocado on a citrus salad and a tartine topped with pickled beets for a crunchy, colorful nod to his Polish heritage. “I hate the word ‘brand,’ but I have to have a conversation with myself and figure out why it’s important to me,” he explained of his recipe choices. “I can’t just have something made up and handed to me. I have to have pride in it, or I won’t serve it.”Although most of the menu was created by Porowski (who, full disclosure, I've known prior to this interview; we also taught a cheese class together at Murray's), the restaurant is a joint venture between him and friends-turned-business partners Lisle Richards and Eric Marx of The Metric restaurant group. They met in 2012, and then started keeping each other in check with a workout club two years ago, taking classes at Barry’s Bootcamp, Tone House, and SoulCycle... and then immediately finding food that wouldn’t undo all of the work they just did. They usually ended up at The Wayfarer, one of Richards and Marx’s restaurants in Midtown Manhattan, for grilled salmon and vegetables to refuel. The routine inspired them to collaborate for what Porowski describes as a “health and wellness concept that was still delicious and flavorful, but not super precious or not too much of one thing.” As soon as the original Village Den, a neighborhood standby diner for 36 years, closed in March 2018, the trio started workshopping ideas to respect the heritage of the space while modernizing it. Ultimately they kept the name and the original awning while revamping the menu.Porowski described the Sicilian C-bomb salad as “kind of a crunchy, sweet, salty, spicy, everything salad.”\nPhoto by Emma FishmanHe and the team spent three weeks testing recipes with Wayfarer chef Chris Shea, who helped “trim down my 35-ingredient ideas down to the seven most integral.” Healthier meals inspired by TV dinners are the core of the restaurant, with a counter of mix and match options like macadamia nut-crusted mahi-mahi, turkey meatloaf, garlic-roasted broccolini, spaghetti squash (seasoned with Montreal steak spice and maple syrup, inspired by a childhood favorite dish), and a healthy twist on his Polish mother’s famous cabbage rolls filled with ground chicken and cauliflower rice.There will also be fully assembled bowls (like citrus-poached salmon with smashed peas, purple potatoes, roasted broccolini, and kale crisps); salads (like the Sicilian C-bomb, a vitamin C-heavy dish with citrus, fennel, spinach, pomegranate, avocado, pistachio, and Tajin); breakfast items (like overnight oats and a chicken Scotch egg); and coffee and smoothies. The entire all-day menu is “accidentally gluten-free,” including scallion-almond pancakes with Green Goddess dip inspired by his sister Karolina, who has multiple sclerosis and introduced him to the functional medicine side of alternative flours. “Whether people are keto, vegan, vegetarian, paleo, gluten-free, pescatarian, or have whatever dietary needs, I want them to be able to find something here.”Who is this restaurant really for, though? Porowski is aware that the people checking it out initially will likely be fans of Queer Eye, but he hopes that will change over time. “I want longevity. I don’t listen to music that I won’t like in a month. I fell in love with The Strokes when I was 20 and I’m 34 now and still listen to them religiously. I want the restaurant to have [that same kind of] staying power.” If all goes well, he has dreams of expanding throughout New York, with an “evolved version that is a little different, but still keeps the mainstays we’re known for.”Porowski surrounded by plants that he will “make sure are always watered” at Village Den.\nPhoto by Emma FishmanFans of the show trying to catch a glimpse at Porowski behind the counter will have to wait. Currently he is filming the third season of Queer Eye in Kansas City, Missouri, but he’s been back and forth to check in on the restaurant’s progress. The entire process of opening a restaurant has taught him that he can’t do everything himself. “It’s hard not to want to be involved in every single part of the thing, because I feel incredibly vulnerable putting my food out there,” he admitted. “I still think it’s weird that people are interested in what I like and what I represent.”For now, he’s learning to let go. “It makes me nervous as hell to be away, because it has to be good. My biggest nightmare is that something doesn’t have enough salt. If it doesn't, who are people going to come back to? Me. I can’t be physically there every day ... but I can set recipes and flavors up. That’s all I can do: make it something I believe in, and hope others believe in it, too.”Explore Bon AppétitCelebritiesRestaurantsRead Moreculture‘Queer Eye’ Star Antoni Porowski’s 9 Tips for Dinner Party GreatnessBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Alyse Whitney"]}