{"id": "9f2843ce04b976fc6a6e3b36c866e02a", "url": "https://www.bonappetit.com/story/pastiglie-leone-italian-candy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Pastiglie Leone: Because Even Italy's Checkout Aisle Candy Is Beautiful | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePastiglie Leone: The Checkout Aisle Candies That Are Prettier Than the RestThey come in a beautiful, vintage-looking tin, but it’s what’s inside that counts. (Inside = candy.)By Jesse DartJune 20, 2018FacebookTwitterEmailChelsie CraigFacebookTwitterEmailThe grocery store checkout aisles in Italy are just as candy-lined and tempting as American ones. And recently, I picked up some strange candies, packaged in beautiful, ornate tins, a design from another century. I thought why not? (the line was long) and threw them in the cart. They were Pastiglie Leone, a light purple candy that looks like dehydrated pencil erasers and tastes of violets, yes, the flower. I popped them open only to realize that I hate the flavor of flowers. They reminded me of the perfumes on my grandmother’s dressing table. I tossed the candy and kept the old-fashioned box they come in to store paper clips on my desk.What I didn’t know is that these little candies have a long history, a loyal following, and a broad range of flavors that I had yet to explore.Like a lot of Italian food companies, Pastiglie Leone hasn’t changed much since its inception. Luigi Leone started it 160 years ago in Alba, in northwest Italy. They were popular with the royal family of the House of Savoy—specifically the violet flavor. This was one reason the production was moved from Alba to Turin, near the royal court and parliament. Keep your friends close, and candy supply even closer.Pastiglie Leone aren’t overly sugary, they’re flavored with potent essential oils, and have the texture of a balled up Altoid, sturdy yet dissolvable. As they lose freshness, they begin to resemble space rocks. They come in a wide range of flavors (40 and counting!), but all are classic, never gimmicky. Try panettone (like the cake), anice, bergamot, or a package called “mixed digestives” a root-beer-scented tin that includes a few different bitter, digestive flavors like gentian root and a nose-burning cinnamon.Italians take digestion seriously, so it’s not surprising that the candies’ supposed digestive properties are also an important selling point. It might seem like a strange source of relief, but many of the same bitter plants and roots that go into Amari are also in Pastiglie Leone, like ginger, arquebus, licorice, anise, rhubarb, lemon and sage, chamomile, and mint. The bitterness of the digestive flavors can linger in your mouth for a while, but it’s balanced by the hint of sugar.Chelsie CraigThe mint flavor hooked me first. It doesn’t leave a bad, un-natural toothpaste flavor in your mouth. It also seemed to settle my stomach like a Pepto-Bismol, but without the chalky pink grossness. Maybe that’s an old wives’ tale, or maybe I talked myself into it. Either way, it’s also a good way to get rid of stale coffee breath.If you’re not into bitter flavors, try the strawberry, blueberry, raspberry, lemon, mandarin, orange, or red currant. Violet and carnation are the two florals, both of which have their own fans. Other flavors include cinnamon, vanilla, and green tea—all relatively gentle yet satisfying. The balsamic candies are soothing with a strong herbal characteristic similar to a cough drop (and nothing like balsamic vinegar.) Recently, they’ve expanded the line with flavors like Spritz and Martini Rosso, but the secret to their success will always be in the bitter, digestive flavors they are known for.And those tins. Even if you’re coming here just for those, the vintage-looking hinged-lid tins, I can’t judge. The company will also personalize them for your wedding or event. They’re a popular gift to bring back from a trip to Italy, and you can refill them with mints, pills or whatever you want. Especially, as you’ll realize, the candies tend to go stale quickly. They also come in small boxes (often the ones sold on Amazon), but you can find the tins in specialty grocers and at Eataly.I credit our local gelateria for changing my mind about the violet flavor. I tried their bright and verdant violet gelato, and I was convinced it was a taste I could learn to like. And I have. The floral notes, after the strong first hit on your tongue, turn to a subtle sweetness. The next time I was in the grocery store I bought a new tin of Pastiglie Leone and also, a box of licorice from Calabria in a black and orange tin. Perfect, I thought, for thumbtacks.Buy it: Pastiglie Leone 4-Pack Multipack on Amazon for $19, or for $3/box at Eataly.When you really love a candy...All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingCandyItalyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Jesse Dart"]}