{"id": "9f2c78f3d5a811829c14339514750269", "url": "https://www.bonappetit.com/story/soaking-dried-beans-overnight-necessary", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Is Soaking Dried Beans Overnight Really Necessary? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIs Soaking Dried Beans Overnight Really Necessary?That's a long time to wait if you need your bean fix now. But you've got options.By Alex DelanyOctober 17, 2018FacebookTwitterEmailPhoto by Gentl & HyersFacebookTwitterEmailIf you’ve been reading Basically for a minute, you’ll know we’re big fans of cooking with dried beans. And if you haven’t, well, we are. The flavor and texture that properly cooked dried beans bring to the table make the canned stuff feel like child's play. The skins are in tact and firm, and when you bite into them, the insides are smooth and flavorful. But dried beans are a little bit more of a commitment to make, seeing as they’re...dried. A lot of recipes will tell you that soaking beans overnight is non-negotiable, but is that really the case? Do you really need to wait that long to eat marvelous, tasty beans?The short answer to this question is no. You don’t have to soak your dried beans overnight. We’ll get to what you can do instead in a second, but first, a note about why we soak beans. Soaking beans in the refrigerator overnight will reduce the time they have to cook drastically. And the texture of the beans will also be it their best, with fewer split-open and burst ones. But like we said, you don’t have to commit this hard. If you’re the impatient, bean-hungry type, you can cook your beans from dry without any soaking at all.Here's the thing: Beans that have not been soaked ahead of time will always take longer to cook, but they will, indeed, cook. But timing aside, sometimes we actually like to cook beans straight from dry, as is the case with this easy black bean soup recipe. The reason we like to cook beans from dry when making certain soups is that the liquid that they're cooked in becomes a delicious broth, negating the need for any boxed stock to give it body and depth. If you start by building flavor in the bottom of a large stock pot by sweating aromatics and chopped vegetables, you can add spices, water, and finally beans to build a satisfying broth over time.A pot of dried bean soup is an untraditional canvas for toppings.\nAnd by \"over time,\" we mean at least a couple of hours. (As you can guess, bigger beans will take longer to cook than smaller beans.) Cooking your beans from dry means you’ll need to simmer those beans gently, patiently, stirring them every 30 minutes or so to make sure they’re cooking evenly and releasing flavor and starchy beaniness into liquid they're simmering in. (Sometimes it can take even longer, especially if your beans are old.)When your beans are tender (but still maintain their shape), it’s time to really season them. Adding salt to the cooking liquid (the broth, if you’ve made a soup) and letting the beans sit for at least a half hour is the best way to make sure your beans are properly seasoned. The beans will absorb the salt via the liquid and the humble, earthy flavor of the beans will be a hell of a lot more noticeable. And you should go for more than just a pinch. Beans can take a lot of salt. Don’t be shy.So it really all comes down to where you want to spend your time. If you have a couple of hours to kill, go ahead and make a pot of bean soup with the dried fellas. If you don’t need soup until tomorrow, let them hang out in a bowl of water overnight—they'll be tender in about half the time, which sometimes is the priority. But either way, make a big batch. Beans and bean-y soups last at least a week in the fridge, and they also freeze beautifully, meaning you can have cooked beans ready to go in minutes rather than hours. It doesn’t matter what your calendar looks like. Everyone has time for that.Here's that bean soup you ordered:Basically Black Bean SoupFew ingredients have such a stellar deliciousness-to-affordability ratio, and the best part about starting a soup with dried beans is that they create their own incredibly savory broth as they cook.View RecipeExplore Bon AppétitBlack BeansBasicallytechniqueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-17", "author": ["Condé Nast", "Alex Delany"]}