{"id": "9f31f9ae39899f3292426b63e14a4419", "url": "https://www.bonappetit.com/story/what-to-know-about-tipping-hack-video", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "What You Should Know About That “Tipping Hack” Video | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat You Should Know About That “Tipping Hack” VideoThe bottom line? If you don’t have money to equitably compensate the people working to create an enjoyable dining experience, you don’t have money to go out.By Jesse SparksApril 10, 2019FacebookTwitterEmailPhoto by Priscilla Du PreezFacebookTwitterEmailOn Monday, CNBC shared a video with a supposedly simple hack that could save people money when dining out. Interesting, right? Well, the “trick” recommends calculating the tip by doubling the tax the restaurant charged (which would amount to 17.75 percent in New York City), rather than give the standard 20 percent on the total bill. While the general premise of budgeting your expenses is well-intentioned, the video misses the mark by encouraging people to save a couple dollars by skimping on what the meal—and the labor that went into it—is really worth. We spoke with Ashtin Berry, co-founder of equity-minded service and hospitality collective Radical XChange, and Kia Damon, chef at Lalito restaurant in New York City, to get their thoughts on how to tip like a decent human being.1. Tipping isn’t optionalOne thing the video demonstrates is that, apparently, there are still a lot of people who don’t understand the importance of tipping—for both the individual service professional and for the team operating the restaurant. While that three percent discrepancy might save you a few dollars on every meal, this “hack” ignores the idea that your dollar greatly impacts the people bringing and making your food. The difference is practically exponential. Think about it this way: If everyone in a 100-seat restaurant adopted this method on an $100 bill, each individual would get to walk out with $2.25 more in their pocket, but the server would have $225 less to take home.“I would love to have a space where tipping isn’t even a thing because we’re paying people what they need to make,” says Damon. But that just isn’t the reality for a lot of restaurant workers. “When I was in the kitchen, I had a set wage. If you [work in the front of house], you get tips. Your hourly wage might be lower than what you’d make in the kitchen, but your tips make up for that.”2. Consistency is keyThe tax you pay changes depending on where you’re eating, but 20 percent knows no state bounds. If you’re just relying on doubling the tax, that could mean you’d be leaving as little as 10 percent in some states. That’s a major loss for someone whose income is dependent on a steady stream of tips.“I will always tip 20 to 30 percent because even that is still so much less than what the true cost of all of this labor is,” says Berry. “Most Americans go out to eat at least two to three times a week on average. If they were expected to pay the full price for the work that servers put in to run these restaurants, they couldn’t afford their meals. Tipping is a way to support service workers.”3. It’s not about moral high groundThere’s a moment in the video when interviewees jokingly suggest that the “tip” we should be offering to service professionals are the suggestions  to “get a better job, go to school, and get an education.” And while they may have been kidding (why they think that’s funny, we’re not exactly sure), it does highlight a common problem: People forget that service industry professionals come from a variety of backgrounds. Some actually do go to schools or invest in other training to specialize in hospitality; others choose restaurants because there’s a low barrier to entry, and a real opportunity to work your way up. Whatever their reasoning is, their motivations (or what people assume their motivations are) shouldn’t negatively impact the way you compensate them for their labor.“For you to decide that you have the moral high ground to look down on what other people do with their lives is a reflection of you,” says Damon. “Trying to shortchange servers is gross. This is their money, this is their livelihood. The whole thing is an exchange of goods and time; you’re paying for a service. That’s the most basic thing.”4. The end of your meal isn’t the time to worry about saving moneySure, we’ve all experienced a bit of sticker shock when we’ve received a bill, but that doesn’t mean that it’s time to penny pinch to offset your spending. Instead, consider whether you can actually afford dinner—gratuity included—before entering a restaurant. If your savings goals can’t accommodate that meal, that’s when you consider other alternatives.“Tipping poorly communicates that you don’t value the people who make your food,” Berry says. “Even before it gets to the restaurant, there are so many people involved. It’s a whole ecosystem. Someone had to pick the food and butcher the meat to get to the chef. What you’re saying is that you don’t value those people. If that’s the case, that’s fine, but you should stay home.”Explore Bon AppétitTippingRestaurantsEtiquettePop CultureRead MorecultureHospitality Activist Ashtin Berry Enjoys Caviar Potato Chips, Radical Self-Awareness, and a Good Twerk SessionBy Shanika HillocksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-10", "author": ["Condé Nast", "Jesse Sparks"]}