{"id": "9f3fb49e2a6a431c67766d6249b226ae", "url": "https://www.bonappetit.com/story/vacation-photos", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "I Thought Taking Pictures on Vacation Was a Waste of Time Until I Saw This Photo of Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Thought Taking Pictures on Vacation Was a Waste of Time Until I Saw This Photo of MeThis impulse to take my own pictures is not unrelated to the impulse to write: to insist that things be remembered not just beautifully, but particularly as I saw them and wanted them seen.By Zan RomanoffNovember 6, 2019FacebookTwitterEmailFacebookTwitterEmailThis piece is part of This Is Why We Travel, a hyper-specific travel guide from Healthyish and Women Who Travel.In Mexico, everyone was being photographed. Girls arranged their skirts and posed coyly in the garden of Frida Kahlo’s famous blue house; teenage boys threw up double peace signs in front of the massive Palacio de Bellas Artes, mugging for each other and the camera. I was a tourist among tourists, and we were all trying to make sure we got the most out of our vacations, to keep a record of the sights and the sunsets and our outfits, to capture the way our faces had looked in the light.I never like the way I look in pictures that other people take of me. This is not their fault; my face just doesn’t photograph well. Something to do with my cheeks and my chin, I think. Or maybe that’s what I look like, and I don’t like my own face?Either way, I freeze up in front of the camera, so in order to evade the discomfort, I try to avoid it as much as I can. I’d rather forget a moment entirely than look back at a time when I was happy and find myself thinking: You couldn’t have taken a break from enjoying yourself to sit up just a little straighter?This stance has the added bonus of seeming, in some lights, to possess a moral dimension. It’s not just that I’m vain, I think; it’s that I am living in the moment. I am having my experiences and not trying to collect them like other people do.On this particular trip—four days in Mexico City and three in Oaxaca with Condé Nast Traveler's Women Who Travel—I had a lot of time to think about taking and being in pictures, and how I felt about them and why. I had been sent to Mexico to accompany people who were on vacation, but I was not precisely one of them; I was there as a journalist with a somewhat vague assignment: to try to find something interesting to write about. I was continually conscious of the ways that I was parsing the trip into parts and examining it for angles. From the first, I was not there just to be there. I was there to work.But also, a professional photographer was traveling with us, a woman named Alina whose job it was to use her nice camera and considerable talent and skill to capture our best angles: our smiles, and our huitlacoche quesadillas, and the impossible quality of spacious quiet in Luis Barragan’s Casa Pedregal.This is the truth of my reluctance to let other people photograph me: I don’t like being reminded how little control I have over the way other people look at me, and what they see when they do.Women Who Travel sends photographers along on all of their trips: The idea is that they will solve the problem of vacation pictures by taking them for you, so you don’t have to take yourself out of the moment. All I had to do was sit back, relax, and let Alina capture me, and I could have it both ways: an enviable Instagram feed, and a week away that involved looking at landscapes directly, instead of on my phone’s screen.And yet still, despite all of this, I found myself, phone in hand, snapping away.I took bad pictures of the interiors of churches and the smoke from a wood-fired oven. Because I don’t trust even the pros to make me look presentable, I took mirror selfies before I left my hotel room. At one point, I stood next to Alina on the street while we both aimed cameras at the same double rainbow, and I laughed with the other women on the trip about how sad my cell phone images would look next to her beautifully composed and edited shots—and took them anyway.This impulse to take my own pictures is not unrelated to the impulse to write: to insist that things be remembered not just beautifully, but particularly as I saw them and wanted them seen.Susan Sontag wrote the original critique of tourist-y photo-taking in her 1977 essay collection On Photography: “Photographs,” she wrote, “help people take possession of space in which they are insecure.”“Most tourists feel compelled to put the camera between themselves and whatever is remarkable that they encounter,” she continues. “Unsure of other responses, they take a picture. This gives shape to experience: stop, take a photograph, and move on.” Taking pictures gives us something to do, Sontag argues: it allows us to organize all of this free and untethered time, instead of having to swim through the undifferentiated experience of it.Sontag sounds authoritative, and it’s easy to agree with her: It’s easy to scoff at herds shuffling through tourist attractions, holding their phones up to capture the same angle of the same image. It’s easy to not want to be like that.It is harder to actually do.This is the truth of my reluctance to let other people photograph me: I don’t like being reminded how little control I have over the way other people look at me, and what they see when they do.On my last day with the group, we went out to Hierve el Agua, a set of rock formations and mineral pools located about an hour and a half from downtown Oaxaca. The last thirty minutes were a painstaking drive over rutted, single-lane roads; we wound up and up, past agave fields and houses where women in aprons offered hot breakfasts to tourists like us.At the top, the view was spectacular. Hierve el Agua is comprised of mineral-rich water that bubbles up from the ground to form natural pools; where it rushes over the side of the mountains, the water has dried and the minerals calcified into what look like rock waterfalls, a spectacular cascade of stone descending into the lush green of the valley below.By that point, my camera shyness had become something of a running joke in the group; while other women would happily volunteer to pose for photos in picturesque doorways and against colorful murals, I always had to be cajoled into anything other than the most standard group shots.But as it turned out, I was also the only one who’d brought a bathing suit that day, and the only person who was willing to slide into the pool’s water—not frigid, but certainly not warm—and let it touch first my feet, and then my calves, my thighs, the skin over my lungs and heart.As I dipped in, Alina circled the rim of the pool, first with a film camera, then a digital. I didn’t ask her not to. The rest of the women rolled up their jeans and stayed in the shallows. We called back and forth, jokes about the ultimate online dating profile photo, about how I was going to go home and become unbearable, captioning all of my Instagram posts about #gratitude for #nature.By my own calculus, it should have seemed like this was “taking me out of the moment:” like I was sacrificing some piece of authenticity to the experience of being captured. Worse still, I was already thinking about how I was planning to share that capture.But I was also, at the same time, doing something vulnerable. I sat still and let someone else take over; I trusted that what she saw would be generous, if not exactly as I imagined it. That it would be fine, whatever it was. I could have the photograph and also the experience; one would not erase or negate the other. Sontag is right that the automatic impulse to take camera in hand should be questioned––but that doesn’t mean that wanting a record of yourself or your life is necessarily suspect or wrong. Sometimes, surrendering to someone else’s lens, and a desire you want to call shameful, is more important than insisting on some “authentic” lived experience.As it turns out, I am grateful for the images. They show the white of my thighs, the round of my stomach. They show me willing to take off my clothes on a mountaintop, to touch cold water and let it touch me. They show me thirty-two and certainly not fearless, but trying very, very hard to be less afraid. They show me. And they let me show myself to others in more and less flattering lights.I did not find myself in Mexico; I did not kick my social media habit or rearrange the inside of my brain so that it would stop wanting to take pictures, to leave a moment with something I could hold onto, and something I could share. None of those things are the kinds of things you can do in a week.Sitting at the lip of the pool, the sun shining white through thin, gauzy clouds, I was in the moment as much as anyone ever is: I was aware of the world, and of myself, and of myself being seen. I made a decision. I looked at the camera and smiled. Eventually Alina wandered off to take pictures of the other women I was traveling with. I stayed in the water, letting the seconds slip by unrecorded. Both things, I think, were good, and good for me.Explore Bon AppétitTravelHealthyishGo Here NowessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Zan Romanoff"]}