{"id": "9f4464d8338251443ef41e89ce6da243", "url": "https://www.bonappetit.com/story/how-to-use-miso", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "How to Use Miso Paste for Stuff That Isn't Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Ways to Use Miso That Don't Involve SoupThere's more to miso than soup. A tub of the good stuff can upgrade most weeknight dinners instantly.By Alex DelanyMarch 27, 2018FacebookTwitterEmailFacebookTwitterEmailNo one puts miso in a corner. Well, that’s not true. A lot of people do. But they shouldn’t, because they probably don't know how to use miso paste. You can’t just label miso as a soup ingredient and call it a day. Miso has so much more to offer, and it deserves all the love it can get.If you’re not familiar with miso (or often pass the plastic tubs in your grocery store’s refrigerator thinking, “Eh, maybe next time”) let us give you a quick miso breakdown.Miso is a fermented mixture of soy beans (usually, but other grains and beans are used too) and koji (a totally safe type of mold that grows on rice). It packs an amazing amount of umami, plenty of salt, and just enough funk to keep things interesting. There are tons of varieties of miso out there, but if you're cruising your average grocery store, you're most likely to find two varieties: Sweet white miso, which is lighter in color and flavor, and red miso, which is fermented for a longer time to make it saltier, earthier, and more intense in color and flavor. If you want a more in-depth miso breakdown, we've got you right over here. Whatever kind of miso you're working with, here’s how to get the most out of that fermented flavor bomb:Green Beans and Cucumbers with Miso DressingCrushing and smashing green beans and cucumbers sounds crazy, but it creates nooks and crannies to soak up as much umami-rich miso sauce as possible. And this is a dressing you'll want a lot of.View RecipeSalad DressingsMiso doesn’t need to be cooked. It’s ready to go as soon as you pop the lid to that tub, which means you could stir it into that quick dressing you just whipped up. You can dress a simple green salad or some roasted vegetables with a miso dressing, and whether you’re leaning toward the creamy side or the acidic side, it’s an easy way to make everything a little more interesting.Miso- and Mayo-Marinated Short Ribs with Spicy SauceBuild big flavor quickly with condiments that are already in your fridge.View RecipeGlazes and MarinadesMiso’s greatest strength is lending deep umami flavor to vegetarian dishes, but it makes meat even tastier too. A miso-glaze or marinade does for chicken wings or a pork chop what tomato sauce does for sausage and meatballs—it adds an extra layer of savoriness. Just make sure to dilute your miso with vinegar, water, butter, or some kind of sauce. You don’t want to go spreading your whole roasted chicken with clumpy miso straight from the jar.Roasted Sweet Potatoes with Miso-Tahini SauceThat three-ingredient sauce can go on anything. Double batch = necessary.View RecipeCreamy Schmeary StuffMiso and mayo. Miso and ranch. Miso and cream cheese. Miso and tahini. It’s all great, especially when it ends up schmeared on the bottom of a platter, or spread on a sandwich. A little miso mayo turns that turkey and cheese from 0 to 100 real quick. Real quick. Whole squad on that miso-mayo shit.Garage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyKale, mushrooms, onions, and a beautifully bold sauce make instant ramen noodles something to be excited about.View StoryStir-Fry Flavor EnhancerStir-fried vegetables and noodles like to get involved with a little sauce, and miso is a great addition to whatever liquid you’re adding to the pan. We love it stirred into a mixture of rice vinegar, soy sauce, and mirin. The sweet, salty, acidic, funky flavors all meld beautifully when hit with high heat for a short amount of time. Oh, a little fish sauce never hurt either.Ramen Noodles with Miso PestoThis cilantro-miso pesto is bright and delicious on springy ramen noodles.View RecipeThe Pesto MoveThe greatest lie the devil ever told was that miso is only good in Japanese dishes. It’s just not true. Miso transforms a bright, herb-heavy pesto into something a little earthier. Flavor-wise, it’s like comparing a fresh tomato to a roasted one. The roasted tomato has a more developed, complex flavor. Same goes for that miso pesto you’re going to make.Green Miso Soup With SobaNutty, buckwheat-based soba noodles add some heft to the classic miso broth.View RecipeAnd That One Thing We Said We Were Going to IgnoreRemember when we said we weren’t going to talk about soup? Well...we lied. Because miso soup rules. Sorry. Want to know how to make that? We've got a whole thing about easy miso soup right here. That said, miso is killer in all kinds of soups. Chili. Beef stew. Chicken noodle soup. Minestrone. If it's soup, a spoonful (or two!) of miso paste is never not going to add salt and depth. We like to add it towards the end, when we're seasoning to taste.More miso, more noodles, no problems:Cold Miso-Sesame NoodlesThe ultimate dinner-to-desk lunch dish.View RecipeExplore Bon AppétitBasicallyMisoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Alex Delany"]}