{"id": "9f56828e75af29b95cee2ffa3659ebc5", "url": "https://www.bonappetit.com/story/kid-food-feud", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "My 3-ingredient Lifesaver Is Called Minimalist Chile Crisp | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy 3-ingredient Lifesaver Is Called Minimalist Chile CrispI snuck it out of an Andy Baraghani recipe. Thanks, Andy!By Alex BeggsMay 2, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Something to cookIn a kitchen without my usual spice brigade, I’ve adapted to my biological need for chile crisp with what I call Minimalist Chile Crisp. I stole it from this steak recipe by Andy Baraghani. Three ingredients: Fry sliced or chopped garlic in whatever oil over low-ish heat until it’s browned and crispy, pour it all into a little bowl where a tablespoon of red chile flakes is waiting. This condiment has saved a boring batch of lentils, all my scrambled eggs, and maybe even my marriage. Just kidding, I’m not married. But I bet it WOULD!Spice things up: Steak Short Ribs with Crispy Garlic and Chile OilWant this letter before it hits the website? Sign up for our newsletter!Photo by Laura MurrayFood media gainsA literary magazine centered around Taco Bell but not officially authorized by the chain came to my attention this week. As a lover of the literary and nacho arts, I am tempted to submit my own poem to Taco Bell Quarterly:There once was a girl from Houston.Who couldn’t hold her Taco Bell toots in.She leaned over quick,And cried out with an “ick!”Then realized her Zoom was unmuted.Illustration by GraphicaArtis/Getty ImagesThe big bagEver notice how coffee beans just run out? Especially in a household full of PEOPLE? My out-laws have found an impressive solution to this recurring problem, which is to buy the motherload FIVE-POUND bag of beans from Intelligentsia. Free shipping and everything. It’s a little over a month’s supply. I felt the need to share this insider tip with you.P.S.: Here are more places to order great coffee online.More insider tipsIf you saw chef Ashleigh Shanti making strawberry compote to go with her lacy-delicious cornmeal pancakes from our May issue on Instagram this week, you may have thought to yourself: WOW THAT ROBE LOOKS COZY, WONDER WHERE IT’S FROM. Just me? Well all is revealed (thanks, Ashleigh): it’s Reigning Champ. Merely looking at it makes me want to take a nap in a patch of sunlight. BRB.Get the recipe: Lacy Cornmeal Pancakes With Strawberry CompoteI’ll…Just leave this handy quiz here.Unnecessary food meme of the weekUnnecessary food feud of the weekKID EDITION. For staffers at home with their own kiddos or siblings, I wanted to hear about the fights over Cheddar Bunnies and whatnot. One of Julia Kramer’s sons has eaten “nothing but rice, tortillas (cold from the fridge and not warmed up), and cheese sticks for 6 weeks.” Chris Cristiano confessed that his brother “tried to ripen an avocado by putting it in the oven.” Awww, how old is your brother? I asked. “38.” Meryl Rothstein’s sweet daughter is going through a highly specific phase in which no food she’s given should be cut into kid-sized pieces. “No cut!” the tiny queen demands. Adam Rapoport sent me a list of 28 feuds he’s had with his offspring, such as, “He likes more jelly than peanut butter on his PB&J—that is a total amateur move.” Then Chris Morocco, whose two children have made a few cameos in recent BA videos, let it out:“They want to eat applesauce on my bed. They compete to see whose banana has brown mushy spots BECAUSE THEY LIKE THE BROWN MUSHY SPOTS ON BANANAS! They will only eat orange cheddar, never white, even though they taste exactly the same. They refer to the orange cheddar as ‘blue cheese’ because Cabot’s version comes in a blue wrapper. They spat out the grilled cheese I made on camera because it had ‘too much flavor.’” Good luck out there, Chris!Explore Bon AppétitBeggs NewsletterRead MorecultureTrader Joe’s Latest Snacks, Reviewed in These Strange, Strange TimesBy Alex BeggscookingYou Might Have Everything in Your Pantry to Make Tahini Brownies This WeekendBy Alex BeggscultureI Used Up Random Rice and Made BA’s Best RisottoBy Alex BeggscookingThis Cocktail Is Called the Rattlesnake, and That’s Reason Enough to Make ItBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-02", "author": ["Condé Nast", "Alex Beggs"]}