{"id": "9f6697fac52912a282c94fc939fa90a4", "url": "https://www.bonappetit.com/story/kimchi-tofu-soup-saves-me", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "This Kimchi Tofu Soup Saves Me When My Sinuses Go On the Attack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Kimchi Tofu Soup Saves Me When My Sinuses Go On the AttackIt's just me, my flannel pajamas, and a bowl of this soup.By Aliza AbarbanelMay 11, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Everyone has their own patented sick day coping mechanism. Some people drink endless cups of tea. Others rely on the proven cures of The Princess Bride. I used to rely on a lukewarm combination of both, but now I know the real cure: this spicy tofu and kimchi stew. Made from a pared down lineup of my favorite pantry staples, it’s a potent mood booster and sinus-clearer.Like most recipes, this one starts out by sautéeing some aromatics until they’re delicious and soft. Grab garlic, ginger, and scallions (aka the holy trinity of flavor), then add four cups of chicken broth to get your soup going. If you want to make this recipe vegan, just sub in vegetable broth instead. Next, whisk in three tablespoons each of soy sauce and gochujang to really start building layers of flavor. About that gochujang. It’s not mandatory—I made this soup several times with plain miso paste before gochujang entered my life—but it really puts the umami flavor over the top. If your fridge is also lacking in fiery fermented pastes, consider this recipe your formal invitation to join the gochujang party. You will be rewarded with a deep red, flavorful sweet-spicy broth.Once you have a small daikon radish peeled and cut into reasonably thin pieces, add it to the broth and gently simmer until tender, about 15-20 minutes. Then add the stars of this recipe: tofu and kimchi. Cut a block of silken firm tofu into quarters, then drop one quarter straight in and simmer until warmed through. Ladle a healthy amount of soup into your bowl, then finish with chopped scallions for good measure. Grab a comfy seat, queue up The Princess Bride, and slurp away. (You’re already wearing those flannel P.J.s, right?)While I normally think of soup as strict snow day fare (gazpacho, we can talk later), this recipe is brothy enough to carry you through a nasty little spring flu without weighing you down. And, not to get too Healthyish about this, but the act of making soup can also be healing. Steam is great for the lungs, and stirring can be surprisingly meditative. When the smell of soup and warmth of the stove fills your kitchen, it’s impossible to not feel a little bit more peaceful, even if your best friend has been a box of tissues recently.And, considering this is sick day soup, don’t be afraid to get creative if the nearest store with daikon radishes is too far to manage. Sub in thinly sliced carrots, or add cooked soba noodles to bulk it up. In a fitting twist, my boyfriend came down with something while I was writing this very article. Ever the soup opportunist, I whipped up a batch between paragraphs, adding in a big clump of enoki mushrooms shortly before serving. It was cozy, restorative, and packed with enough kimchi to accomplish what Sudafed could not.Explore Bon AppétitBasicallyKimchiTofuSoupNever FailRead MorecookingThis Italian Salad Recipe Makes Me Feel Like an Extra on ‘The Sopranos’By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-11", "author": ["Condé Nast", "Aliza Abarbanel"]}