{"id": "9f72cb91dcf276a6e7d46ee69d40023d", "url": "https://www.bonappetit.com/recipe/orange-fish-in-parchment", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Orange Fish in Parchment Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueOrange Fish in ParchmentBy Priya KrishnaMarch 19, 20194.2(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintBecause the fish, which is flavored with garlic, chile, ginger, and turmeric, is sealed in a pouch before it's baked, it stays extra moist and flavorful with no risk of drying out. If you don’t have parchment, foil works just as well. Feel free to try this method on other types of fish, like salmon, halibut, or cod.Recipe adapted with permission from Indian-ish by Priya Krishna with Ritu Krishna (Houghton Mifflin Harcourt). Copyright © 2019. Ingredients4 servings5garlic cloves, finely grated1small Indian green chile or serrano chile, finely chopped13\" piece ginger, peeled, finely grated1Tbsp. extra-virgin olive oil½tsp. ground turmeric48-oz. fillets sea bass (1\"–1½\" thick)Kosher saltPeel of 1 small clementine, finely choppedCooked white rice and lime wedges (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 450°. Mix garlic, chile, ginger, oil, and turmeric in a small bowl to make a paste. Place fish on a paper towel and pat dry. Season all over with salt. Using half of the paste, coat 1 side of each fillet. Place a 2-foot sheet of parchment paper on work surface. Arrange fillets, paste side down, on half of parchment; coat top sides with remaining paste, making sure to evenly cover the entire surface. Top fillets with finely chopped clementine peel and fold other half of parchment up and over fish. Fold each open side over three times to seal parchment and make a pouch. Chill 30 minutes.Step 2Transfer pouch to a rimmed baking sheet and bake 10–12 minutes. Turn off oven and let fish sit in oven 1 minute longer—the pouch should have puffed up at this point. Remove from oven, let pouch cool 1 minute, then open (be careful of the hot steam inside!).Step 3Transfer fillets to plates and spoon juices from pouch over. Serve with rice and lime wedges for squeezing over.How would you rate Orange Fish in Parchment?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWe loved this fish.Made it with sea bass and, since I only had chipotle chile, I added a small piece.  And the fish was the most moist I ever made!  Next time, I have to get the ginger way more fine.  Thank you for a new addition to my repertoir!AnonymousCosta Rica8/14/2020Very good flavor from the gingery floral (from the turmeric) garlicky spicy paste.  Laid a slice of orange on each piece in the foil packet and it worked out nicely. Used fresh turmeric which they have at many groceries now. All that said, I liked it more than my wife, who thought it was a bit “too much. “EssieDeeCt7/18/2019My wife, 2 year old son and I loved this dish. I made two pouches, one with the chiles and one without. Both were great. AnonymousSan Francisco California 4/14/2019I was really disappointed by this recipe.  I loved the technique- the fish cooked in parchment paper was perfect.  The spices and orange peel were bitter.  We had to throw out expensive Sea Bass. I won’t be making it again.MsjohnstonColumbus, IN4/14/2019I was not a fan of this dish. The flavors were a little too obscure (and none were cooked down to mingle the flavors). Feel like I wasted a good piece of fish, unfortunately. I’d move on to a different less ginger/turmeric/orange rind fish recipe.AnonymousAustin4/9/2019This dish was absolutely spectacular.  We had a beautiful piece of Sea Bass from our local fish market, Dirk's, and used all of the paste on 2 nice filets.  Definitely one that will be in our fish repertoire from now on.  Thanks BA!AnonymousChicago3/30/2019Super easy, so quick, and delicious! I used cod, my pieces were only about 1/2 inch thick, cooked at 200C for 10 mins and was perfect. I didn’t have chillis so used about 1/2 tsp chilli flakes and worked great. Also only used 3 garlic cloves. Will definitely be trying again with other types of fish :) AnonymousBristol, UK3/27/2019Explore Bon AppétitIndianSouth AsianAsianBassFishSeafoodMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Priya Krishna"]}