{"id": "9f789011a809fcabcee315a0b115c9c0", "url": "https://www.bonappetit.com/story/bar-bete-brooklyn", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "Bar Bete Brooklyn Serves Great Food and Drinks, But Have You Listened to the Playlist? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsYes, the Food and Drinks at Bar Bête Are Great, But...the Playlist!Turns out the restaurant’s sommelier is also the restaurant’s DJ. By Cristina MartinezMarch 3, 2020FacebookTwitterEmailPhoto by Marko Macpherson FacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The second I sit down at a restaurant, I’m sizing it up. Does the room feel buzzy without being chaotic? Is the lighting warm and flattering? Was any thought put into the silverware and stemware? But as a professional musician, the most important test is the playlist.When I walked into Bar Bête in Brooklyn for dinner with BA friends recently, I was struck by its style. The table was chic but not fussy. The wine list was smart and concise. The French-ish menu was modern without being pretentious. But it was the music that stopped me in my tracks. Are they playing The Black Angels? Bold! Butthole Surfers? Bush Tetras? Shut up!! Several times during dinner I had to stop myself from singing along. It got harder to resist after a few glasses of the very good wine from the smart wine list put together by Nick Ferrante, Bar Bête’s sommelier. I asked him who was responsible for the playlist and he shot me a wary look, as if I might complain. Turns out the sommelier is also the DJ.A musician himself, Ferrante selected songs that had “energy and sounded good loud” to create seven different eight-hour playlists, one for each night of the week. Every playlist, dubbed Dinner-I through Dinner-VII, is meticulously crafted to include little to no repeats. On the night I was there, Dinner-VII went from one hip shakin’ hit to another as we ate a mushroom brioche laced with black truffle and an airy rolled omelette stuffed with peekytoe crab and seaweed butter. Even the inevitable bathroom break had me dancing by myself to The Cramps! Line be damned. I’ll be back to work my way through the rest of Bar Bête’s menu—and Dinner-I-VI.Go there: Bar BêteRock out to Bar Bête’s Dinner-I playlist:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitHighly RecommendRestaurantsBrooklynRead MorecultureThese Are Our Favorite Cooking SongsBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-03", "author": ["Condé Nast", "Cristina Martinez"]}