{"id": "9f80da7a89f5f3781c1015dd7df5bf69", "url": "https://www.bonappetit.com/story/twrl-milk-tea", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Twrl: This Canned Milk Tea Tastes Like My Childhood Summers in Taiwan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingNew Year’s Resolution: Drink More Milk Tea (Specifically This Milk Tea)Finally, an end to your nai cha drought.By Darice ChangJanuary 6, 2022FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.If there’s one thing I remember about my childhood summers in Taiwan, it’s the giant cups of boba milk tea—beautiful beige columns of creamy liquid loaded with chewy tapioca and a shot of sweetness that got me through the island’s subtropical humidity. My uncle, who was usually the one to accompany me on my daily trips to buy a cup, would joke about my milk tea addiction—one that has since become a global phenomenon. While as a child I could only experience the drink on those summer trips from Minnesota to Taiwan, decades later I was delighted to find cans of Twrl Milk Tea online, conveniently packaged for a taste of childhood whenever the fancy strikes.Twrl is a vegan-friendly take on the iconic beverage, featuring tea leaves sourced from family farms, pea protein milk, and less sugar than many milk teas on the market. The drink comes in three flavors: an original black tea and two green teas, hojicha and jasmine. While the black tea is classic and the jasmine has a nice, mildly astringent aroma tempered by the creamy milk, my favorite is hojicha because of the bold flavors of the roasted Japanese tea leaves.I usually layer the milk tea with ice before topping it off with cold brew for a twist on yuanyang coffee milk tea, inspired by the proliferation of Cantonese restaurants popping up in Taipei. It can also be enjoyed on its own—cofounder Pauline Ang recommends sticking it in the freezer for 45 minutes first so that it’s ice-cold and almost slushy-like. Cofounder Olivia Chen prefers hers warm and frothed or heated up in a steamer, specifically the Tatung—or used as an ingredient in baked goods (like this adorable boba cake). And, if you have the tenacity, you can even make your own boba to mix into the tea.TikTok contentThis content can also be viewed on the site it originates from.Twrl was founded in 2019 by Ang and Chen, a design director and a marketing strategist who have been friends for over 20 years. Ang was born in Hong Kong, where British-style hot tea with milk and sugar was a coveted treat, and then raised in Hawaii. Chen, like me, is Taiwanese American and was born in the Midwest and raised in California, where the food of the motherland was hard to come by at the time. In the days before Amazon Prime, visiting relatives would schlep pineapple cakes, nougats, and bubble tea from overseas, while Chen made DIY versions in the stretches of bubble tea drought in between. That inspired Twrl. “[It’s] a [conscientiously] made version of the quintessential Asian milk tea that we grew up drinking and loving,” Chen says.Photograph by Isa ZapataTWRL Milk Tea$22 at Amazon (6-pack)$20 at TWRL (6-Pack)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-06", "author": ["Condé Nast", "Darice Chang"]}