{"id": "9f8a7922ef1ff0fd4f04593e2e3e8341", "url": "https://www.bonappetit.com/story/just-buy-it-citrus-squeezer", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "This Citrus Squeezer Costs $16 and Is the Best I've EVER Used | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Perks of Being a Citrus Squeezer (or Owning One, At Least)Because every other citrus juicing contraption pales in comparison to this $16 citrus squeezer.By Amanda ShapiroAugust 22, 2018FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.As the saying goes, there’s only one way to squeeze a lemon. Okay, no one says that, but stay with me. There’s only one way to squeeze a lemon, and it’s with a citrus squeezer. There aren’t a lot of single-use tools we recommend around here because they’re generally a waste of precious kitchen space (though ask me about my apple corer later). But when we do, it’s because we think it’s something worth carving out a spot for. And this $16 citrus squeezer is not only worth it, it’s essential.But first, I have to tell you what a citrus squeezer is not. It’s not a handheld juicer, those cups with the domed, ridged lids that you use to murder—I mean press—the juice from a citrus half. Those work fine for oranges and grapefruits, I guess, but the downward force can compel lemons and limes to slide right off, causing blunt-force trauma to your arms and wrists. It’s not a reamer, either—that wooden, dart-shaped tool that looks kind of elegant but turns into an actual weapon if your citrus is even a little too hard, plus it does nothing at all to keep those unwanted seeds out of your measuring cup of juice. And it’s definitely not the old-fashioned squeeze-it-with-your-hands technique, which is good for stress relief, but does nothing to keep seeds out of your drink, and if you’re making margaritas or lemon bars or something else that calls for a ton of citrus juicing is likely to cause carpal tunnel. The citrus squeezer is, gratefully, none of those things.Easy citrus juicing = margaritas for everyone!\nPhoto by Alex Lau, Food Styling by Judy ManciniIt just works. You put a citrus half in the citrus squeezer. You squeeze the handles together, citrus juice runs out of the bottom, and the seeds stay in the squeezer. Pitch the spent half and repeat. Remember learning about simple machines? A citrus squeezer is a lever. (In fact, it’s a Double Class 1 lever, but I won’t make you go there.) The point is that it works because physics, the way that scissors scissor and pliers ply. Squeezers squeeze every time, and they do so with minimal effort on your part. BUT—and this is a big but—you have to use them right.Have I sold you on this thing yet? Yes? Good. Now I have to confess something to you. I took this assignment to write about why citrus squeezers are essential kitchen tools, but I have an ulterior motive, which is to beg you in the name of all that is right and just to turn your piece of citrus so the cut side is facing the holes. I know, I know: It’s tempting to nestle your halved lemon or lime in there with the skin side down so it’s all cozy like the citrus and the squeezer are spooning. You can do that, but when you’re crying because you have acid in your eyes and all over your clothes, don’t tell me it’s the squeezer’s fault. (If you're the citrus squeezing expert who is thinking to yourself, Who would EVER do that, rest assured that I have watched that scenario play out at least a dozen times. Trust.)Put the cut side down toward the holes because that’s where the juice comes out, and where those pesky seeds get trapped. Feel me? I promise it will work every time. For your margaritas. For your frozen margarita pies. For your lemon bars and lemonade and all the lemon tarts that ever have been and ever will be. So go ahead, get rid of all those other contraptions and give your hands a rest: This guy’s your main squeeze.OXO Good Grips Citrus Squeezer$16 at AmazonAnd then make some lemonade, because you're worth it:The Lemoniest Lemonade Recipe Tastes Like Liquid SunshineIt takes one extra step and a few—okay, more than a few—extra hours, but it is WORTH IT.View StoryAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingCitrusLemonLimeToolsBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-22", "author": ["Condé Nast", "Amanda Shapiro"]}