{"id": "9f8a2a1fc1adffc1223f209ce916d7d4", "url": "https://www.bonappetit.com/story/quinoa-loaf-arcade-bakery", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "I Love Arcade Bakery’s Quinoa Loaf So Much I Had to Put a Monthly Limit On It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Love This Loaf So Much I Had to Put a Self-Imposed Monthly Limit On ItArcade Bakery’s quinoa loaf is one of the best breads in New York City. Seek it out!By Alex BeggsJune 11, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When you pull open the door of 220 Church Street, a nondescript office building in lower Manhattan, you blast the sidewalk with the scent of freshly baked bread. There are worse smells in this city.The not-so-secret Arcade Bakery inside sells some of the city’s best carb products: ham and cheese sandwiches, and ham and cheese croissants. (Okay, plus a fantastic mushroom sandwich, chocolate croissant, and seeded baguette.) And according to me, they sell the city’s actual best bread: the Quinoa Loaf. I’ve lived here for 13 years! I can say that!There’s a tangy, present taste of sourdough. Thick, nutty crust. Airy, bouncy crumb studded with quinoa and flaxseeds. It’s deep and complex, it’s substantial but not dense or dry, and I’m pretty sure you can even call it healthy. It’s wholesome without being preachy. There aren’t bullshit dried fruits no one asked for in there. And it doesn’t need much, some olive oil and salt. A thick layer of butter. It can go savory with mayo and sardines, some avocado if you’re one of those, or it can go sweet, with labneh and jam.Compared to other breads it is interesting. But not in the “it’s...interesting” way that means too weird to enjoy. It brings something to the conversation. If bread could talk, this bread would tell you about the time it saved a humpback whale while captaining a ship in Alaska, complete with whale songs. It might even comment on the latest Jane Mayer article in The New Yorker. What I’m saying is that some bread is good, well-made and flavorful, but it’s a little boring. Quinoa Loaf would never talk about the weather.I’ve learned to call ahead to reserve a loaf. During the week, they only made five each day. (I KNOW. But economics, man. Sometimes demand doesn’t meet supply and there’s no room for waste in this tiny place.) It’s a $7 loaf—that’s a luxury loaf! So I’ve restricted myself to one QL a month. It tastes better this way. And when I walk out of the office building triumphant, I hold the door for a few extra seconds to let the bread perfume escape. This city needs all the help it can get.Go there: Arcade BakeryExplore Bon AppétitHighly RecommendNew YorkBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-07", "author": ["Condé Nast", "Alex Beggs"]}