{"id": "9f8cb7676bb3ccd55abe506fac5444e5", "url": "https://www.bonappetit.com/story/butter-roasted-tomato-sauce-never-fail", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "This Roasted Tomato Sauce Makes Me Feel Like Strega Nona | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Butter-Roasted Tomato Sauce Makes Me Feel Like Strega NonaYou don’t need to stand over the stove to create rich, comforting red sauce.By Aliza AbarbanelAugust 9, 2019FacebookTwitterEmailChelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Apologies to any sauce purists, but you don’t need to station yourself by the stove for hours to create layers of umami-rich tomato-y goodness. And you don’t need to drop your life savings at the farmers’ market either. (Well, you could.) But Claire Saffitz’s recipe for bucatini with butter-roasted tomato sauce enlists pantry-staple canned tomatoes, roasting them in the oven with anchovies, red pepper flakes, eight garlic cloves, and half a stick of butter to create caramelization and deep tomato flavor. It’s low-maintenance but ultra-comforting, and therefore the only red sauce recipe for me.Like many basic tomato sauces, this recipe begins with canned tomatoes. While it might seem easier to use crushed tomatoes, we prefer to buy whole peeled tomatoes and crush ‘em ourselves because they often have less additives and break down beautifully into a sauce. I crush in two stages: First a gentle squishing between my fingers before going in the oven, then again after roasting (using a fork) to incorporate the tomatoes with garlic and anchovies.While the sauce is roasting, I get some salted water boiling and secure my preferred pasta. I love bucatini because those long noodles have small holes to soak up as much sauce as possible, but I’ve used spaghetti and rigatoni before too. Before draining, I save ½ cup of starchy pasta water to thicken the sauce.Once the garlic is very soft, the tomatoes are jammy, and my kitchen smells delicious, I remove the sauce from the oven and mash with a fork until it looks like coarse applesauce. Then I pour the sauce into the pot with my drained pasta, add pasta water, and toss with tongs until every strand is coated. I like to top with a bit of torn basil because I’m extremely proud of my little windowsill herb garden, but a good amount of Parm and red pepper flakes will do just fine on their own.While I’m sure this recipe would go over great at a dinner party, you don’t need any kind of special occasion to make bucatini with butter-roasted red sauce. In fact, I prefer to make this on quiet weeknights when watching Fleabag is the only thing on my to-do list. After all, who would want to go outside when the whole apartment is filled with the smell of buttery, garlicky tomatoes?Get the recipe:Bucatini with Butter-Roasted Tomato SauceBecause you need more butter-roasted things in your life.View RecipeExplore Bon AppétitBasicallyNever FailPastaRed SauceCanned TomatoesRead MorecookingNo-Cook Puttanesca Is Here To Save Your Very Sweaty SummerBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-09", "author": ["Condé Nast", "Aliza Abarbanel"]}