{"id": "9f97fcddfa0965e7e8f32749d743c47c", "url": "https://www.bonappetit.com/story/why-masa-is-everywhere", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "Here's Why You're Seeing More Masa on Restaurant Menus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHere's Why You're Seeing More Masa on Restaurant MenusNixtamalized corn is getting its due across the U.S., thanks to newly available heirloom maíz from Mexico and a mighty little grinder called a Molinito.By Leslie BrennerSeptember 29, 2021FacebookTwitterEmailPhoto by Emmanuel GalvanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I’m sitting on the sidewalk patio of a café in Brooklyn, trying to decide which to dive into first: tetelas, tlacoyo, or tlayudita? Tlayudita wins. The oversize corn-tortilla-ish disk, made from rose-colored heirloom corn and smeared with refried black beans, delivers a chewy crunch and serious depth of flavor. Its toppings of stretchy Oaxaca-style cheese called quesillo, mezcal-sautéed hen-of-the-woods mushrooms, white onion, salsa macha, and cilantro make it even more delicious.But it’s the superlative masa, the corn dough, of the tlayudita that led me to this convivial Bed-Stuy spot from owners Matt Diaz and Carlos Macías, For All Things Good. And masa is all over the menu: folded into triangular tetelas enclosing epazote-scented black beans; patted into thick, roundish memelas cradling mole amarillo and queso fresco; coaxed into eye-shaped, pinto-filled tlacoyos topped with avocado and salsa macha. Made of blue, yellow, or pinky-red maíz grown on small farms in Mexico, nixtamalized—or simmered in an alkaline solution of water and culinary lime—and ground onsite, the masa at For All Things Good is fragrant and earthy, like nothing you’ve ever tasted.Masienda's Molinito machine in action.\nCourtesy of Masienda/Photo by Noah ForbesFor All Things Good is not the only food business going all in on masa. There’s a small but growing group of chefs and fledgling restaurateurs across the U.S. who share a collective obsession with the ancient dough: Tatemó in Houston; Alebrije in Nashville; Masazul in Las Vegas; Mal Pan in Charlotte; El Xolo in Seattle; and Bolita in Oakland, California, to name a few, plus new heirloom masa projects popping up (and yes, many are pop-ups) faster than I can track them. We’re in the midst of a masa movement, and it’s due to two things: the availability of landrace heirloom maíz from Mexico and a gadget called the Molinito. (Landrace crops are those adapted to specific places and growing conditions over time, typically on small farms.) Their powers combined are poised to change America’s relationship with masa—and with Mexican cooking as a whole.Until recently, only industrially farmed GMO corn was available to chefs and others wanting to make nixtamal. And only deep-pocketed restaurateurs with large kitchens had the means and space to afford and accommodate a molino, the $6,000 to $10,000 mill outfitted with volcanic stones needed to grind it. (Their footprints range from about 2 feet by 3 feet to 3 feet by 5 feet.) Most of the handmade tortillas we’ve all been eating in taquerías have been made from mass-market brands of masa harina, the instant just-add-water tortilla flour made from that same commodity corn.Heirloom corn from Masienda.\nCourtesy of Masienda/Photo by Noah ForbesNow, thanks to two forward-looking purveyors—Masienda in Los Angeles and Tamoa in Mexico City—landrace heirloom corns are available to American restaurants. Masienda founder Jorge Gaviria kickstarted the stateside part of the heirloom masa movement seven years ago. He had become fascinated with the wider heirloom seed movement in 2013 when he apprenticed with chef Dan Barber at Blue Hill at Stone Barns. There Gaviria learned of some 3 million farmers in Mexico, a number of whom had been collaborating with seed breeders to preserve traditional maíz varieties that are much more flavorful and colorful than commodity corn. Unlike commodity corn, landrace maíz supports biodiversity and health, as it is non-GMO and genetically diverse. Its production also bolsters community and Mexican Indigenous culture, as many of the small farms are owned and maintained by Indigenous families, for whom the culture of maíz has been of paramount importance since it was domesticated by the Meso-Americans some 10,000 years ago.Yet it became clear to Gaviria that these small farms lacked a meaningful market for their landrace maíz. And so he began to purchase their surplus corn. “Everything I was learning at Blue Hill, this was the apotheosis of it,” he explains. “I thought, this doesn’t make any sense; this is the best corn in the world. I can make a market for this. These people deserve more attention. I want to close that gap.” When he found out that Enrique Olvera, one of Mexico’s most famous chefs, was about to open Cosme in New York City in 2014, Gaviria proposed supplying him with heirloom maíz. Olvera took him up on the offer and Masienda was born.Over the next few years, Gaviria began supplying maíz to chefs Carlos Salgado (Taco María in Costa Mesa, California), Rick Bayless (Frontera Grill and Topolobampo in Chicago), Gabriela Cámara (Contramar in Mexico City and Cala in San Francisco), Sean Brock (Minero in Charleston), Steve Santana (Taquiza in Miami), and others. Since then Masienda has become more than just a supplier; it has become a cult purveyor and savvy source of information—which is by design. Without the proper tools and a unifying source of information, Gaviria says, “people don’t feel empowered to take this process on themselves.” Through the Masienda website, masa enthusiasts can purchase not just maíz but also hand mills, comals, and tortilla presses, as well as masa harina made from the same Mexican landrace maíz Masienda purchases. Videos and recipes on the site teach everything from making nixtamal to seasoning a comal to cooking a tortilla with the perfect puff, and a Masienda cookbook is in the works, Gaviria says, scheduled to be published by Chronicle Books in spring 2022.From top to bottom: The Tetela Trio, Breakfast Tlayudita, Black Bean Avocado Tlayudita, and  Memela de Mole with queso fresco from For All Things Good.\nPhoto by Matt DiazFor Olivia Lopez, an up-and-coming Dallas chef who recently launched Molino Olōyō, inspiration also came from Mexico. Two and a half years ago, during an extended visit to her native Colima (on the west coast south of Puerto Vallarta), Lopez became fascinated with heirloom maíz. For two months she tried to get an appointment with the head of a landrace maíz seed bank in Jalisco, and when she finally met him and tasted corn from many of the bank’s 200 or so community members—families growing maíz in Tlaxcala, Chihuahua, Oaxaca, and Colima—she was blown away. Once she understood that small family farms and their way of life in these and other areas were being threatened because the market for the corn was so undeveloped, Lopez knew cooking with and educating people about landrace maíz and masa had to be her life’s work.She eventually left her position as chef de cuisine at prominent Dallas restaurant Billy Can Can to pursue her dream. She’s now selling tortillas, buñuelos, tamales, chips and salsas at Coppell Farmers Market, as well as doing pop-up dinners and dinner parties, with plans to open her masa-focused café and tasting-menu spot next year. For all these projects she uses exclusively landrace heirloom corn, which she has been sourcing through Masienda, and she’s about to begin purchasing some corn and beans through Tamoa.“Corn is the most important part of the Mexican diet,” Lopez says, “yet all these communities were close to disappearing because no one was consuming [what they grow].”In early 2020 Masienda solved a huge problem for smaller players interested in masa, who didn’t have the budget or space for a molino. The company announced it had developed a new type of mini-molino known as the Molinito. Its comparatively affordable $1,850 price tag and small footprint (26.5 by 14.5 inches) are allowing chefs and enthusiasts of limited means to launch modest businesses born from their heirloom masa obsessions.“The Molinito was a result of a lot of years of us scratching our heads,” Gaviria says. “We could not sell [maíz] to a restaurant and help cultivate this connection if people don’t have the means to process it. Prior to [developing the] Molinito, we’d have to tell people, ‘You have to spend $10,000 on a molino, you’ll wait six months to get it, and there won’t be support for it.”The Molinito announcement was life-changing for Bolita owner Emmanuel Galvan. He grew up helping his mom make tortillas, rolling balls of dough (called “bolitas”) made from masa harina, which his mom pressed into tortillas, but he fell in love with masa after swooning over a tlacoyo in Mexico City five years ago.Grinding stones like this one are essential for producing masa.\nCourtesy of Masienda/Photo by Noah Forbes“I was at a little stand eating a blue-corn tlacoyo on a corn crate,” he says, “and it was the most intense masa experience I’d ever had. I didn’t know how impactful it would be—the casualness of this really pristine ingredient—and [the experience of eating that masa] was shared with tourists and people who had been coming to the stand for who knows how long.” Not a chef, he had studied social anthropology at the New School in New York City. His only previous experiences of masa freshly ground from nixtamalized corn had been in fine dining restaurants. But that Mexico City blue-corn tlacoyo moment “democratized masa” for Galvan, who purchased a home gadget called a Nixtamatic in Mexico and began making masa five pounds at a time.“When Masienda announced they were releasing the Molinito, I was like, I need to get this. I can sell to friends and make tortillas and give them away.”Today Galvan sells his masa, tortillas, and tlacoyos at CUESA Mission Community Market in San Francisco, as well as on a pre-order basis out of the Alice Collective in Oakland.“My obsession with masa is beyond masa and different varieties of maíz,” Galvan says. “It’s a reclamation of my cultural identity or lack thereof. I’m relearning a little bit about my culture through masa, learning about all these people who had made nixtamal for hundreds and hundreds of years. It’s three ingredients: water and maíz and cal [calcium hydroxide]. It’s such a beautiful process to see the kernel go from a dry corn to this soft, mushy, wonderful thing.”Gaviria says Masienda has sold \"several hundred\" Molinitos in the 20 months they've been on offer, and he hopes many more masa-focused businesses are on the way.Courtesy of Masienda/Photo by Noah ForbesMolinito$1,850 at MasiendaTelling the story of masa is hugely important for chef Emmanuel Chavez and his partner Megan Maul, who launched Tatemó in Houston back in 2019. Initially, they conceived Tatemó as a fine dining restaurant and were about to sign a lease downtown when the pandemic hit. They pivoted, and Chavez started focusing on making nixtamal, grinding it—using a comically modest hand-mill at first—and doing pop-up dinners. A customer gifted a package of Tatemó tortillas to the vendor manager at Urban Harvest Farmers Market, which led to an invitation to sell their tortillas, masa, masa pancakes, chilaquiles, and quesadillas there.Out of a borrowed space in the Montrose district, they’ve also been wowing diners at their Saturday night tasting menus featuring extraordinary treats like a tiny puffed infladita filled with pico de gallo and topped with uni, serrano chile, and avocado crema; a chorizo-and-potato-filled sope crowned with a perfect disc of avocado; and an elegant little barbacoa taco dressed with avocado and cilantro. Education is part of the experience. Maul begins each tasting by showing diners the varieties of corn that’ll be featured in each course, and identifying their regions. Their molino and its grinding stones are on display, along with a metate, the traditional flat grinding stone used for thousands of years in Mesoamerica. “We are able to incorporate these into the storytelling during the experience,” she says, “and give the diners a visual for how maíz gets from the farmers to their table.”“Educating people is probably the most important thing,” Chavez says, “along with normalizing the price of tortillas.” There’s so much involved, he points out: “the actual selection of the seed to planting maíz and harvesting it, processing it into nixtamal, grinding it into masa, and making tortillas.”Bolita’s Galvan shares that concern. “It’s this racist notion that tortillas should be cheaper [than what they’re spending for] a sourdough loaf a few stands away,” he says, referring to the farmers market where he sells. “We have to reframe the way we price a good tortilla.” His go for $13 a dozen; Tatemó sells theirs for $9 a dozen, and Molino Olōyō for $10 a dozen.Once you understand all that, the $7 price tag for a dozen Matt Diaz and Carlos Macías charge in Brooklyn at For All Things Good seems like a serious bargain. Sitting at a shady table outside the corner spot, Diaz explains that their fans are much more interested in the made-to-order masa-forward dishes coming out of their postage-stamp-size kitchen.Especially those tlayuditas. And you know what? They don’t need to be tricked out with chef-y flourishes to be amazing: As much as I love the one with the mezcal-sautéed hen of the woods mushrooms, another topped simply with slices of ripe avocado, salsa macha, cilantro, and fried shallots—letting the extraordinary earthy flavor of the yellow heirloom masa shine through—is even better.Explore Bon AppétitRestaurantsMexicanMasaCornRead MorecultureFrom Lattes to Lamps, America’s Coming Up MushroomsBy Ali FrancisLifestyleWe're Calling It: Sage Green Is the Kitchen Color of 2021By Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-29", "author": ["Condé Nast", "Leslie Brenner"]}