{"id": "9f9aa40f0733832d582d1072d01c6e19", "url": "https://www.bonappetit.com/recipe/herby-napa-cabbage-salad", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Herby Napa Cabbage Salad with Lime Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHerby Napa Cabbage Salad with LimeBy Amiel StanekJanuary 18, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintThis salad holds up well in the fridge (hold the dressing), but loses its alluring crispness soon after it gets tossed with the lime juice and vinegar. Tossing it should be the last thing you do before sitting down at the table. See more of the $50 dinner party menu here.Ingredients10 servings1medium head of Napa cabbage (about 2½ pounds)1bunch cilantro1bunch dill2limes¼cup distilled white vinegarKosher salt, freshly ground pepper½cup vegetable oilPreparationStep 1Quarter cabbage lengthwise, then slice each quarter crosswise into 1\" pieces (you should have about 10 cups). Transfer to a large bowl. Trim off bottom 3\" of cilantro and pluck out any bad-looking stems; transfer to bowl with cabbage. Pick tender sprigs from dill and add to bowl; discard tough stems. (You should end up with about 3 cups picked herbs total.) Toss cabbage, cilantro, and dill to combine.Step 2Finely grate lime zest into a liquid measuring cup. Halve limes and squeeze juice over, then add vinegar; season with salt and pepper.Step 3Toss salad with lime-vinegar mixture, then add oil and toss again. Season with salt, if needed, and serve immediately.How would you rate Herby Napa Cabbage Salad with Lime?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI wasn't sure what to expect with this salad, but it's really good. It tastes like a tequila shot (salty, bracing, limey), but herby and crunchy and good for you. The note in the $50 dinner party collection says that you can change up the herbs, but don't until you've tried it once, because the cilantro and dill really work great together in my opinion. Will absolutely be making this salad again. AbbyRAlabama12/2/2018Explore Bon AppétitSaladNapa CabbageCabbageLeafy GreensVegetableLimeCitrusFruitCilantroHerbs & SpicesDillQuickEasySideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Amiel Stanek"]}