{"id": "9fa7f05c31940805628d3f6e1914894b", "url": "https://www.bonappetit.com/story/bone-broth-diet", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "This Bone Broth Diet Got Weird | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Went on a Bone Broth Diet and Stuff Got WeirdFor one week, my biggest question was chicken or beef? Or chicken?By Kara CutruzzulaMarch 15, 2018FacebookTwitterEmailPhoto by Peden + MunkFacebookTwitterEmailLike most people living in a metropolitan area, I am tired. My right hip aches because I’m a 31-year-old geriatric. My scalp is dry—but, some consolation, not as dry as my face. My energy is zapped after one exhausting subway ride, and eating dinner after 9 p.m. comes with obligatory dessert: a bottle of Tums.I'd heard good things about bone broth. I'd heard it can restore your body to its pre-pubescent stage when you could eat Hot Cheetos and pizza for lunch every day and see no ill effects. The broth is supposedly an immune system booster, and its gelatin “heals and seals” the gut and does wonders for your hair, nails, and joints. So, last month, I spent a week on a bone broth cleanse with the hopes of emerging as uncorrupted as a newborn and with a newfound appreciation for drinking boiled animal parts.Since bone broth “fasts” have gotten increasingly trendy, there are multiple purveyors offering cleanse packages—necessary, since I wasn't going to make a week's worth of broth on my stovetop—but I needed one that provided variety, a clear set of boundaries, and allowed me to eat actual food. Otherwise, as someone who loves snacks more than she loves some distant relatives, I could see myself drinking one mug and moving on.The Osso Good Company sells \"ridiculously good\" and \"sippable\" broths by the bag online, from beef to spicy pork to bison. I chose their seven-day cleanse option. The \"rules\" are as follows: Drink two 20-oz pouches of bone broth every day, and eat pastured or organic proteins, healthy fats, and organic fruits and vegetables. The avoid-eating list encompasses my personal holy trinity: dairy, grains, and added sugars.But hey, I like a challenge. What follows is my true account of this murky, salty, unexpectedly dark ride.Day 1Two greasy cellophane baggies on my kitchen counter tell the story of last night’s “normal” meal: chicken and cheese empanadas, followed by a buffalo chip cookie (my mom’s recipe, made with corn flakes).The cleanse comes with 14 broths: six chicken, six beef, and two Chinese herb-infused versions (called Recovery, Immuni-Qi or Revive the Gut). It recommends one of the herby versions on the first and last day of the cleanse, alternating the others as your heart and gut desire.I grab a Revive the Gut. \"Grass fed beef (beef knuckle, femur, and shank) pasture raised chicken (chicken feet and backs), organic veggies (carrots, celery, shiitake mushrooms, thyme, parsley, bay leaves), organic apple cider vinegar and love.\" Plus, eight Chinese herbs provided by Urban Herbs. I defrost the package under hot water and simmer it on the stove. It looks warm and soothing. It smells like the field behind my Grandma’s ranch—the one where the chickens lived.I pour the contents into a giant mug and settle down with coffee as a chaser. The first sip cuts the deepest. Bracing and rich, it screams: MEAT. It’s 9 a.m. My body doesn’t understand: Where are the carbs? The sugar? The scrambled eggs? My brain asks, Why, Kara? Yet the taste is pleasant, like the less-salty dregs of chicken noodle soup.After noon, I realize the only food I have that falls under the cleanse guidelines are three eggs and frozen Brussels sprouts. Hello, weird lunch.Later, I try to chug a chicken broth before scooting out the door for dinner at a German beer garden, where I eat a kale salad with chicken. Foreshadowing: the word of the week will be chicken.Day 2Breakfast is beef broth and coffee, separate but equal. There’s no other word for this broth than meaty. It takes a few sips to give in to the taste, and then it’s actually very nourishing, like being hugged from the inside out. Or maybe the broth is already going to my head.Lunch is more eggs and half an avocado, and I go to town on coconut strips. Let’s rechristen healthy fats as “sanity-saving real food.”Because I’m apparently an idiot, I made dinner plans this week, so I go to a falafel place known for its amazing pita. I smell the pita, I touch the pita, I don’t eat the pita. I order a chicken plate with salad and baba ghanoush. Don’t ask if this chicken is pasture-raised. I’m 100% sure it isn’t.I neglected to drink my broth before dinner, and so must resentfully simmer my not-a-meal around 11 p.m. to drink before bed. I sleep well.Day 3My face looks the same. My energy level is waning. My body misses carbs, so I give it more avocado. Osso Good recommends a Soup’r Food Smoothie, so I lightly simmer chicken broth, and throw it inside the blender. The brown liquid and chunks of green avocado floating like emerald icebergs makes my esophagus clench. But I am fearless. I sip the seafoam beverage and…hey, it’s actually pretty good! The avocado neutralized the broth and it’s warm and satisfying.I attend an event where Acme Smoked Fish attempts to make the world’s largest bagel-and-lox sandwich. I adore bagels and lox. When the time comes to cut the 213-pound monster, I heap my plate with a pile of smoked fish. I am a savage.Lunch: Eggs, scallions, mushrooms, peppers, avocado, and lots of mango.For dinner, I make a giant New York strip steak. My first ever. I don’t often cook elaborate meals, and I almost never make red meat, preferring instead to go on burger crawls around the city. But my body loves this steak. This steak is nirvana. This steak is life. And this sweet potato? Like eating a fistful of jelly beans. Guess this is what happens when you tone down the sugar.Another 11 p.m. broth feeding. I opt for the Bulletproof Broth recipe, adding a tablespoon of butter and frothing it up into a creamy, emulsified late-night snack. Dense and slightly decadent, it's actually less a snack that another heavy meal.I drink my beefy latte and aimlessly click from one dumb YouTube video to another until my mug is empty. God, what is my life?Day 4God does not answer, but some divine being gifts me a breakfast of leftover steak and eggs. I blend my broth with half an avocado and a hit of hot sauce. I still have to close my eyes when I make this mixture. But I think about how easily I’ve adapted this weird routine. If I can drink bone broth twice a day, every day, what else can I do? What else can I achieve?By the way, my poop is great. Typically my gut health is, I’d say, above average. (Always a great opening line when meeting new people.) But, on the broth diet, I haven’t had any stomach aches, and feel the opposite of bloated—I feel lean.While out at drinks with friends, the first words out of my obnoxious mouth are, “I’m on a bone broth diet!” so my friend asks the waiter if they happen to serve bone broth. The waiter: “What?” My friend: “Bone broth.” The puzzled waiter: “No, I’m sorry, we don’t have…that.”For dinner, I have a beef burger with guacamole in a collard green wrap. I asked my friend if she thinks I could eat a “sprouted bun.” No, she says.I get home at 11 p.m. and remember I have to drink another 20 ounces, but I can’t stomach another simmer, so I reach for a mango smoothie recipe made of partially frozen chicken bone broth and mango. The mango nearly doubles the serving size, so I drink an entire blenderful of cool broth while watching the Olympics.I think of the athletes, these young people who work so hard to achieve their dreams. I think about how silly this is—whining about drinking broth in an attempt to make myself healthier. Of course I can do this. I can do anything.Day 5My Olympics high turns into an Olympic-sized broth hangover, although I think of the actual hangover I would have had if I wasn't on the cleanse, and realize my mental clarity is actually kinda sharp at the moment. Huh.I eat more vegetables, eggs, steak for breakfast, and put off the broth until lunch, then put it off after that. The defrost, simmer, and chug drill is wearing thin. After coming home from the theater, I eat spoonfuls of almond butter and squeeze some lemon into my ninth serving of chicken broth. Game-changer! The acidity cuts the flavor, and it tastes like an entirely new meal. I eat a four-minute egg and a sweet potato. I miss chewing.A few hours later, I drink the beef broth.I can’t wait to burn this mug.Day 6Body check: I am very tired. Somehow I thought the 50 or so grams of protein from this broth would give me energy, then I remember: energy comes from carbs.So much almond butter. I make that sweet Italian sausage that’s been sitting my freezer since summer, and some beef broth, warmed. The taste is much more tolerable now—it’s just repetitive. I snack on more coconut pieces and some fruit, which tastes sweeter than a cream puff at a county fair.Day 7Breakfast is chicken broth with a million squeezes of lemon. I’ve turned into a very cranky carnivore. For dinner, I meet my friend at a diner and dream of pancakes. Instead I order the Popeye Salad, a bowl heaping with spinach, olives, artichoke hearts, and grilled chicken. Again, I am nourished by healthy food. Again, I am sad.I go home and simmer my final bone broth—another Revive the Gut—and say a fond farewell to brown liquids.The bottom lineI have mixed emotions. Overall, I'd consider this experiment a success: I got a glimpse of my willpower, ate more avocados than I thought possible, and my intestines were the happiest they’ve ever been. I can now cook red meat with ease. But the cleanse was hardly the quick fix to everything that bothered me. My hip still aches; my scalp is still dry. The problem, of course, was with my expectations. It’s easy to treat cleanses as correctives to ingrained behaviors, but maybe it's better to consider them as pause buttons—a chance to look at your life as it is now and how it could be.Seeing how quickly I adapted to the rules of the bone broth cleanse—no pita, hold the blue cheese, burn that dessert menu—also made me recognize the food ruts I had fallen into, like reaching for sugar as a pick-me-up, carbs as a meal-filler, and not experimenting beyond my elementary cooking skills. I'm breaking up with broth for awhile, but I have a feeling I'll reach for it again—if not for a full-time commitment, then at least for the occasional slow-simmering fling.Explore Bon AppétitHealthyishBrothChicken BrothTrendsRead MoreLifestyleThe 5 Best Bone Broths You Can Buy Off the ShelfGallery5 SlidesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-14", "author": ["Condé Nast", "Kara Cutruzzula"]}