{"id": "9fa8b3066b2fefaa03f734fbe3b8c40b", "url": "https://www.bonappetit.com/story/what-is-collagen", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "What Is Collagen, the \"Beauty Food\" You're Seeing in Everything? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is Collagen, the \"Beauty Food\" You're Seeing in Everything?We turn to collagen supplements for healthier skin, nails, and hair. But what is collagen, and is it right for you?By Aliza AbarbanelFebruary 23, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.Collagen is inside you, right now. Even if you've never taken it before and are like, \"What is collagen?!\" just know that the naturally occurring structural protein is already in your bones, skin, and teeth. But, these days, it can also be found in countless medicine cabinets and supplement stashes. The promise of collagen supplements is simple: longer nails, shinier hair, healthier joints. And, really, the appeal is undeniable.  But what, exactly, make up those little powder packets? And, more importantly, how can you make them taste good?Okay, what is it?Collagen is a connective tissue compound, and the most abundant protein in mammals. It helps make up our bones, muscles, teeth, and skin—and collagen supplements aim to strengthen these exact body parts. The substantial presence of collagen in animals means that collagen supplements are frequently made from bovine hides and fish scales. Vegan options are rare, but they do exist.Why we love it:Stronger nails. Glowing skin. Rapunzel-level hair. Collagen purportedly accomplishes these things and more, hence its status as an ingestible beauty supplement. It’s important to note that, like many dietary supplements, many collagen products are not FDA-approved. Still, several studies have shown collagen does have beneficial effects on our bodies.“If you eat clean, organic, animal-based protein several times a week, you’re probably getting enough collagen,” holistic nutritionist Kelly LeVeque told Healthyish. “But if your diet is more plant-based or you’re on the road and quality protein isn’t available, collagen powders and drinks can help fill in the gap.” As with any supplement, be sure to carefully examine product labels and consult with your doctor. Start off by consuming 20 grams of collagen a day, and repeat daily for best results.Vital Proteins is one of the many collagen products on the market.\nPhoto by Ted CavanaughWhat to look for:Collagen supplements are widely available in health food stores, Whole Foods, and online. Powdered collagen is probably the most common form. Vital Proteins’ collagen peptides have won over several Healthyish staffers because it has a clean taste and mixes easily. (If you're buying powdered collagen, be sure to store it somewhere cool, dry, and dark.) If powder isn't your vibe, there are collagen-spiked protein bars, drinks, and candy chews. And if you’d prefer to go old school, there’s always bone broth.How to use it:Most collagen products advertise themselves as odorless and tasteless, but some products have a lingering fishy smell. The best course of action? Add powdered supplements to already delicious liquids that will overpower any, ahem, organic musk. (In other words, keep away from the tap water.)  Tea or coffee work just fine, but we love adding collagen to a nightly cup of moon milk, blending it into a blueberry-chia smoothie, or using it to bolster a maple-ginger cider switchel. The powder can also mix into relatively loose solids like oatmeal and yogurt, making it a painless—and potentially beautifying—addition to your morning routine.Blend up a collagen smoothieThe Greenest SmoothieView RecipeMake a collagen cocktailRosy Gin-Kombucha CocktailNew to kombucha? This cocktail is perfect for a test drive, because you’ll get a taste of “original” (unflavored) kombucha.View RecipeOr add collagen to your overnight oatsOvernight Oats with Cashews, Seeds, and TurmericThis sizzled seed and cashew mixture is delicious sprinkled over dip and soups, so you might want to make extra.View RecipeExplore Bon AppétitHealthyishRead MorecookingWhat Is Miso, the Secret Weapon in Every Healthyish Pantry?By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-23", "author": ["Condé Nast", "Aliza Abarbanel"]}