{"id": "9fb662229c8b5ebe4d675eea67edea43", "url": "https://www.bonappetit.com/story/snow-cone-feud", "year": 2019.0, "month": 6.0, "day": 5.0, "content": "There’s a Snow Cone in the Weekend Forecast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s a Snow Cone in the Weekend ForecastThe best things we ate at the Fancy Food Show this week, a Red Lobster recap, and more.By Alex BeggsJune 29, 2019FacebookTwitterEmailClockwise From Top Left Photos By: Kelsey Wilson; Chelsie Craig; Aubrie Pick; David Alvarado; Chelsie Craig (2)FacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Where the free samples floweth“We get our freak on in kitchen!” said a decidedly un-freaky lady handing me a spoonful of carrot pesto. Here I was again, at the Fancy Food Show, a gigantic trade expo where grocery shops go to grocery shop. And where I go to scope out new snacks. The pesto I was tasting was from Freak Flag Foods, and I really can’t emphasize enough here, they were very normal (the people and the pesto). (Yes! I was disappointed!)Among the thousands of booths of too many honeys, 14 types of coconut yogurt, and “new” takes on popcorn, I had some special moments. Like when one of the keto ice cream bros handed me a taste of the coffee flavor and the act of scooping made his biceps bulge and quiver in ways I’d never seen before. He looked deeply into my eyes and said, “it’s made with three plant-based sweeteners.” A samplin’ man, mistaking me for a brand rep, asked if my mushroom jerky would be sellable to the kosher market. I heard a butter broker broker a deal for butter!My favorite snacks included Pasha Delights tahini gelato. Owl’s Brew’s Boozy Tea, —yes, like Twisted Tea—is something I would like to drink in a flamingo floatie. Brins lemon saffron jam (and chili jam). And I’m strangely drawn to MudLrk’s shitake chips (bbq flavor), which reminded me of a bunch of little Toads in Super Mario Bros.The friendlist folks I met were in town from Minnesota promoting Terroir Chocolates (try the salty nibber). It was their first time in New York City. Their review? “We’re havin’ a hoot!”Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex Lau, Food Styling by Susie TheodorouFire up the grillAs they say, for Andy Baraghani’s glazed zucchini. I made them last weekend and will continue to make them all summer. They’re like the vegetarian version of our awesome sambal chicken skewers: sweet-and-spicy glaze gets cooked down and brushed over the veg while grilling. (But this one’s easier.) The cross-thatched cut on the squash soaks up the glaze. I didn’t even do the very-Andy herb salad on top, but I’m sure it plays against the heat nicely.Get the recipe: Sweet and Spicy Grilled Summer SquashReporting from CrabfestA tall, tan man with flowing white hair glided over to my table at Red Lobster’s Crabfest event this week. “Do you work at Red Lobster?” a RL employee asked him politely. But no, this Poseiden in a pale blue Hawaiian shirt was Captain Wild Bill from Discovery’s Deadliest Catch. He was going to show us how to make fettuccine with crab, scallops, lobster, and a tomato-alfredo sauce. Next to me, an Instagram star took a selfie in her plastic crab bib and told us about her journey from being a school teacher in the Bronx to a full-time jet-setting influencer. “I loved it,” she professed, “but this is so much more fulfilling.”Read itAlex Delany wrote about Anthony Bourdain’s influence on the way he eats-while-traveling in honor of #BourdainDay this week: “There was real reward in his unbridled curiosity for places more honest than famed.”Thanks for the icePoor Jesse Sparks was late to cookbook club—this month’s pick was Yasmin Khan’s Zaitoun—at Carla Lalli Music’s house last weekend because he aimed to make little spinach and feta parcels and ...things didn’t turn out in the dough dept. “I tried the windowpane test...over and over, it wasn’t happening,” he sighed. He brought ice for our wine instead. Thanks, Jesse! (Sorry, Yasmin!) I was also late, making fried onions for my mujadarra, but it was worth it. Julia Kramer stole the show with her pan-baked lamb kibbeh, and Alex Pastron ended things on a sweet note with a custardy fig and almond tart (above). And then we got to take home tahini chocolate chip cookies, made by Carla. To make any of these fantastic recipes, though, you’ll need to buy the cookbook!Unnecessary food meme of the weekUnnecessary food feud of the weekIt’s been around 94 degrees in my hometown of Houston, and that’s snow cone weather. We had a snow cone shack in my neighborhood that made a wedding cake flavor, doused in condensed milk. That’ll do it for me. But not my colleagues, who feel that snow cones can melt in hell (where they would melt very quickly according to my sources). “It’s not a good eating experience,” said measured Meryl Rothstein, “you suck the syrup out and you’re left with ice!” “You might as well drink straight syrup,” added Sarah Jampel, who prefers sno-balls, the New Orleans version made with finely shaved ice (more syrup-absorbent) in flavors like ambrosia. “No one has eaten a snow cone and not had sticky hands after,” complained Alex Delany. “That paper cup is BULLSHIT!” On the other, non-sticky hand, “it’s nostalgic for me,” said pro-snow Emily Schultz. Hilary Cadigan nodded along, “I’m never going to argue with their right to exist.” Elyse Inamine and Jesse Sparks teamed up in favor of Hawaiian shave ice, or “any Asian ice, because they all have milk products in them, which makes them soooo good,” said Elyse, who proceeded to list a few off the top of her head: “kakigōri, the Japanese kind that’s like a mound; bingsoo, the Korean kind with lots of beans and stuff; bao bing, Taiwanese shave ice...”Explore Bon AppétitBeggs NewsletterRead MorecultureWhat the BA Staff Is Cooking on Memorial DayBy Alex BeggscookingAjo Blanco Is the Sauce You Didn’t Know You Were MissingBy Emma WartzmancultureIs It Ever Okay...To Take Over the Grilling at Someone Else’s Party?By Alex BeggscultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-29", "author": ["Condé Nast", "Alex Beggs"]}