{"id": "9fd694d324306e1ad831e381cc310e02", "url": "https://www.bonappetit.com/recipe/gorditas-con-camarones", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Gorditas con Camarones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueGorditas con CamaronesBy Rick MartinezAugust 18, 20204.9(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Rick MartinezEmailPinterestPrintEmailPinterestPrintRick Martinez spent his quarantine in Mazatlán, Mexico, while researching his upcoming cookbook on regional Mexican food. The town is in the state of Sinaloa, where gorditas are thicker corn patties with a ridge around the edges to hold all the toppings. “My recipe for a gordita that is split open and filled is more common outside of the area,” says Rick, “but the filling, made with shrimp, reflects the amazing seafood that is abundant in this coastal city.”Ingredients4 Servings1⅓cups instant corn masa flour (such as Maseca)5Tbsp. lard, melted, or vegetable oil, divided2½tsp. Diamond Crystal or 1½ tsp. Morton kosher salt, divided, plus more4guajillo or dried New Mexico chiles, stems and seeds removed2morita chiles, stems removed, or 2 canned chipotle chiles in adobo1tsp. ground coriander or cumin1½lb. medium shrimp, peeled, deveined4garlic cloves, thinly sliced2sprigs thyme1Tbsp. apple cider vinegar1tsp. agave syrup or honey3Tbsp. unsalted butter, cut into piecesSliced onion, sliced avocado, cilantro leaves with tender stems, and lime wedges (for serving)PreparationStep 1Stir masa, 1 Tbsp. lard, 1 tsp. Diamond Crystal or ½ tsp. Morton salt, and 1 cup water in a medium bowl until a soft and slightly sticky dough forms. If dry, mix in another 1 Tbsp. water. Cover and let sit at least 30 minutes and up to 3 hours.Step 2Meanwhile, bring guajillo chiles, morita chiles, coriander, and 1½ cups water to a boil in a small saucepan. Cover, remove from heat, and let sit, stirring occasionally, 30 minutes to allow chiles to soften. Transfer to a blender and purée until smooth; set aside.Step 3Place rack in lowest position in oven; preheat to 500°. Brush a rimmed baking sheet with 2 Tbsp. lard. Divide dough into 4 pieces and form into balls. Set on work surface and cover with a damp kitchen towel. Place 1 ball between 2 sheets of parchment or wax paper. Using a small skillet or saucepan, gently press ball into a 5\"-diameter disk. Carefully peel away parchment; place on prepared baking sheet. Repeat with remaining balls.Step 4Bake gorditas until outer edges are lightly golden, 10–12 minutes. Turn over and bake until golden brown and crisp, 10–12 minutes. Transfer to plates and let cool 10 minutes. Insert a paring knife into side of gordita and, using a slow sawing motion, cut open along one side (keep other side intact).Step 5Heat remaining 2 Tbsp. lard in a large skillet over high. Cook shrimp until lightly browned and just cooked through, about 1 minute per side. Transfer to a medium bowl. Reduce heat to medium and cook garlic in same skillet, tossing often, until beginning to brown, about 1 minute. Add thyme sprigs, vinegar, agave, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and reserved chile purée. Cook, stirring occasionally, until brick red and the consistency of a thick sauce, 6–8 minutes. Add shrimp and any juices and cook 1 minute. Remove from heat; add butter and stir constantly until melted and sauce is glossy. Season with more salt if needed. Remove and discard thyme.Step 6Fill gorditas with shrimp mixture, onion, avocado, and cilantro. Serve with lime wedges for squeezing over.How would you rate Gorditas con Camarones?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI followed this to the letter.  The Gorditas were hard and tasteless even though I brushed the rimmed baking sheet with bacon fat.  We served tostada style as there was no way they were going to cut open and make a pocket to stuff with the shrimp.  They were so hard even too hard to cut through and eat.  I cooked as long as the recipe called for.  Obviously too long. Sauce was average- made a ton much more than needed.  I'd try making them again but definitely a different recipe and method.MofroChicago8/18/2021Give us more Rick!!!! I am on a rick craze but I’m running out of recipes pls send help. This one was really good btwAnonymousSan Francisco10/15/2020This was amazing! I am so looking forward to Rick's book. There isn't anything I would change about this recipe. I also made the gorditas too thin (I was too focused on the 5\" diameter). It was possible to cut them open but the crispiness made them a bit brittle and difficult to stuff. We had the leftovers with eggs for breakfast the next day - so tasty!AnonymousVancouver, Canada10/8/2020I over baked the gorditas and ended up using them more like a thick chip, but it still worked  with the shrimp, which was absolutely delicious!AnonymousSeattle, WA9/13/2020Made this last night for a friend and we both loved it. Instead of pressing the gorditas(my colombian mom calls them arepas) I just formed them in my hands. The puree sauce is to die for, I would highly recommend making that sauce in larger batches for other dishes you want. Make sure to slice those onions thin or they are kind of clunky.StevenJacksonville, FL8/25/2020Explore Bon AppétitMexicanLatin AmericanShrimpShellfishSeafoodMasaRice & GrainsMainNut-FreeGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Rick Martinez"]}