{"id": "9fdd9994e274b5748321905ffba5e146", "url": "https://www.bonappetit.com/story/wu-tang-clan-rza-veganism", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Wu-Tang Clan's RZA on Meat and Masculinity | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWu-Tang Clan's RZA on Meat and MasculinityThe iconic rapper and producer shares his journey to becoming vegan and how he’s spreading the plant-based gospel through Violife’s Plant Grants.By Chala Tyson TshitunduAugust 4, 2021FacebookTwitterEmailPhoto by Kyle ChristyFacebookTwitterEmail“Wu-Tang Clan Ain't Nuthing Ta F’ Wit,” and Wu-Tang founding member RZA isn’t messing around when it comes to veganism either. The legendary rapper and producer, who weaned himself off meat in the mid-90s after biting into a chicken bone, has been one of hip-hop’s most vocal advocates of veganism for years now. He’s done video campaigns for PETA, started his own cruelty-free clothing line, and is now partnering with vegan cheese brand Violife to help launch Plant Grants, its latest initiative to expand access to plant-based cuisine within Black communities.Through hip-hop, Black culture has had an indelible impact on the American zeitgeist, from the hyper-popularity of streetwear to the prolific use of African American Vernacular English (AAVE) as slang. Now it’s influencing how we approach eating meat. African Americans are the fastest-growing demographic of vegans in the country, and hip-hop acts like Wu-Tang Clan (80 percent of whom are vegan) and KRS-One have long been leading the movement. Recently, I had the honor of chatting with RZA about Black culture and its tie to veganism, his dedication to plant-based living, and the importance of separating meat from masculinity.What has your journey to a plant-based life looked like?I started in 1995, when I stopped eating red meat. I kept eating my turkey burgers and my chicken nuggets, but then in 1996—I think we were recording the GZA's album—after that album, I had to stop eating poultry. I still couldn't resist fried fish, but after my last fish fry in '98, I let go of that, and then it took me up to the year 2000 to let go of that New York pizza. It was a gradual thing, and you don't have to do it all at once.How have you seen Blackness come into the larger conversation of veganism over the years?It definitely seems that our Black population, especially here in America, is embracing and becoming more educated about the plant-based diet and seeking it out. Some of the people in my family that live down South actually do two days of veganism a week, and then they go back. But they're starting, and I think it's important.I had a cousin who was a steak-head. Steak and Coca Cola. He stood out with me about a month ago and I cooked [vegan food] for him. A couple of weeks later, he called me, and he was cutting down on [the steak]. He was like, I'm realizing that it was slugging me down and I thought I was getting energy. I said, Yeah, because your body is trying to [digest] and get rid of that stuff. We're learning.How has over two decades of veganism impacted you and your family?I feel so healthy, and I look at my own family as an example. I've got a son who’s 15 years old and has never had a piece of meat in his life. He’s six feet tall right now, got his little six-pack coming in, and got a great jump shot. It’s a myth that you need red meat to get nutrients in your body. His vision is above average, hearing is above average, and no ailments.All my children have lived this lifestyle and are very healthy, strong, smart, intelligent, talented kids. I go to my Wu-Tang brothers and see the same thing. You go to GZA's family, you'll see it. You go to Masta Killa's family, you'll see it. Mathematics brought his daughters to one of the shows, and they were just glowing. And they’ve never had meat.Tell me about Plant Grants.I hooked up with [vegan cheese brand] Violife because we have a similar philosophy about eating plant-based foods: making them more accessible, affordable, and sustainable for everybody. There are three things that are important to this program. First, of course, is funding. Violife is giving out five Plant Grants, $20,000 apiece, to Black-owned restaurants.Second, it's about mentorship and knowing how to incorporate plant-based ingredients into recipes. That's where our [partnering] chefs—Lemel Durrah of Compton Vegan and Laricia Chandler Baker of Can't Believe It’s Not Meat—come in because vegan restaurants around the country are getting better and better and people are really taking their time [to make good food].Third, it's about information. People are becoming more conscious of how they eat and of the effects their diets have on problems like high blood pressure and diabetes. A plant-based diet has been actually proven to reduce these factors in our community, and getting this information into the hands of Black chefs and restaurants will just only expand it.What do you envision when you dream of a plant-based future, especially in Black communities?To quote my son, the dream is that we are all “happy and healthy.” When I ask my son how he’s doing, he says, “happy and healthy, Dad.\" That's all we can ask for. That's my dream, that we all are happy and healthy, and that starts with our body and our minds.Life grows through the food we eat to sustain our bodies, so a plant-based life and balanced diet will only improve our bodies. Plant Grants supports my vision by making a plant-based diet readily and easily available. This grant for Black-owned restaurants, some of which are the heart of their communities, gives them a chance to have an economic infusion, to have chefs [share] mentorship and information, and turn their best dishes into something that's more healthy without compromising the taste.How have you seen attitudes around veganism culturally shift among men, specifically Black men?At one point people thought veganism was preppy, but it's shifted and I think hip-hop has helped. You see some of the hip-hop heroes being conscious of their diet and sharing it in their lyrics and in their lifestyles because there’s truth to it. There's a truth to it, that on this planet that's full of plants, you could flourish and be nourished from that plant.There was a point in life where meat was a sacrifice. If your only way to survive is to sacrifice this animal to get you back to a place where you can start farming again, that's an understandable sacrifice. But today we actually breed animals and kill them more for pleasure versus necessity. I think that consciousness is growing and Black men are saying to themselves, Yo, I don't need it. I feel better. I think we are getting away from it being stereotypically uncool to be healthy.Take our Plant Grants chef Lemel Durrah of Compton Vegan, for example. When you think of Compton, you think about Eazy-E and all the gangsterism, but in the midst of that community, there’s a restaurant that's flourishing where people can go and start changing their diet. They're not far from Roscoe's House of Chicken ‘n’ Waffles or whatever, but there's a choice now, and I think that's only going to grow.How do you think we can start changing the cultural view of meat as crucial to masculinity and therefore crucial to survival?A few bits of wisdom: A man is known to be strong, as they say, and that man eats steak for strength. Steak comes from a cow and the male cow, a bull, is a very strong animal that can grow up to around 1,500 pounds and move tons. All the cow eats is grass. All the muscles he has, all the steak, every part of him that we're consuming, is all built from plants. This is the animal we are consuming for strength, but what does that animal consume for strength? Plants.You're dealing with organic, animated life—from a fly to a chicken to a fish, these things are striving to live. In all reality there's nothing that needs to die for a man to live. Everything is provided. I'm here as a living example of over 20 years of not putting dead animals in my body. There's no flaw in not eating meat. I don't have a flaw from it, and I've got children with no flaws from it. When I was young, I wasn't conscious of just how much death that we cause just to try to have a life. We delude ourselves into thinking that the only means of survival is for something else to die.Explore Bon AppétitCultureInterviewsVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-04", "author": ["Condé Nast", "Chala Tyson Tshitundu"]}