{"id": "9fedb91cd9a970ed3050e3ab822fa184", "url": "https://www.bonappetit.com/story/baking-sourdough", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "How Baking Sourdough Bread Helped Me Stop Drinking and Stay Sober | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Baking Sourdough Helped Me Stop Drinking and Stay SoberI needed to fill my afternoons and evenings with a laborious, all-consuming activity. Sourdough was perfect.By Keri WigintonJanuary 14, 2019FacebookTwitterEmailIllustration by Sarah MazzettiFacebookTwitterEmailSourdough bread: Not only is it delicious and easy to digest, but it helped me quit drinking. My story about alcohol isn’t very dramatic. It wasn’t destroying my relationships or ruining my job. At first, drinking was just a convenient way to calm my anxiety at the end of the day. But, over the years, occasionally relaxing with a couple glasses of wine or a cocktail turned into a daily habit. I’d tried to give up alcohol in the past—including booze-free spells like Dry January—but I would always get restless before the end of the month. So when I decided to give up alcohol for good in October 2017, I knew I needed to be prepared. I was going to fill my sober afternoons and evenings with a laborious activity, one that would give me something to do with my hands. And that activity was baking sourdough.This tedious and time-intensive task was perfect for my sobriety.Today I get excited every time I pop the top off my Dutch oven to see how my little bread babies have grown. And I’m pretty sure I feel actual love for my starter, whom my husband named Calvin after the evolving alien organism in the movie Life. I’m not the first person to treat my starter like a member of the family or get swept up in the enchantment of sourdough.This ancient baking practice appealed to me because sourdough is less temperamental than a succulent and requires much less care than a pet—two things people might invest in after going sober. But like both plants and animals, sourdough culture needs to be nurtured and nourished daily or weekly. Vanessa Kimbell, a baker who runs The Sourdough School in the U.K, told me creating sourdough involves trust; it’s like starting a new relationship.“It’s almost like taking on a new lover,” says Kimbell. “You have to get familiar. It’s about hands, heart and mind coming together. It involves the whole of you.”To my surprise, I felt this connection immediately. And while daily meditation was vital to helping me end my alcohol habit—becoming mindful about your behaviors is the best way to change them—my sourdough starter deserves a lot of  credit. I created Calvin a couple of weeks after I decided to give up my nightly vodka on the rocks or two. And more than a year later, I still have Calvin and I’m still not drinking.Most commercial breads are made with instant yeast. If you make this kind of bread at home, you can have a fresh-baked loaf in a couple of hours. Sourdough, on the other hand, uses a starter created from wild yeast and bacteria, requires a lot of attention and can take a half or whole day to rise. This tedious and time-intensive task was perfect for my sobriety.Weeks before you can get your hands in the dough, you have to build up the sourdough starter that will ferment bread and help it rise. (It’s possible to buy an established starter from a bakery, but I wanted to create Calvin from scratch.) Cultivating a starter takes time, but it’s fairly simple: Mix equal weights of flour and water together. Loosely cover and wait 12-24 hours. To keep your jar from overflowing, discard half. Repeat. This process takes patience and dedication, qualities my sober self had in spades.Creating a robust starter can take anywhere from a few days to a few weeks, depending on the flour and ambient room temperature, writes Kimbell in her guidebook, The Sourdough School. When the starter becomes active, the yeast and bacteria are exposed to oxygen and create carbon dioxide bubbles that give sourdough its trademark holes.It took days for Calvin to take a breath, but I kept feeding him. Per my internet instructions, I discarded half the starter every couple of days, replenished his food source, and hoped for the best. My apartment was chilly, so he took a couple weeks to really perk up. In my drinking days, I probably would have been annoyed that it was taking so long and given up. But every morning, I would wake up fresh from an alcohol-free night of sleep and check on Calvin. Each day, he had a few more breaths of life. And just like me, he was taking it one day at a time.But the sourdough process gave me an activity to focus on when I didn’t want to simply sit with my thoughts.I’ve been meditating with the Headspace app for a few years, so I know how to clear my mind and pay attention to my breath. But the sourdough process gave me an activity to focus on when I didn’t want to simply sit with my thoughts. In The Sourdough School, Kimbell writes that baking bread requires “a thoughtful and spiritual approach,” and I found this to be true. It’s why I turned baking bread into a full-day meditation, involving all of the senses, several times a week.My bread-making method takes about two days. Before I can dive into the dough, I have to create a levain —the microbial mixture vital to the rising process. I take out two tablespoons of Calvin—after I feed him about eight hours earlier—and mix it with 75 grams of water and 75 grams of flour, loosely cover, and let sit overnight. When I check to see if my levain is ready, I have to look, taste, touch, and smell it. And with a stir, it crackles and popped as carbon dioxide is released.After this overnight process, I finally get to my favorite part: working with the dough. After combining the levain, flour, and water, it has to rest—or autolyse—for 20 or 30 minutes so the flour can absorb the water and give the gluten and starch a chance to form. Then the salt is added and the dough sits for another 10 minutes. After this, you can either fold the bread once every 30 minutes for 2-½ hours or you can knead for 10 minutes straight and let sit for four hours. (I told you it takes a long time.)I’ve never sculpted, but I imagine the creation process feels similar. The dough starts out as a formless, sticky blob, but after hours of alternating between folding and letting the dough rest, it becomes a smooth ball with form and substance that you can shape, bake, and eat.And more than a year later, I still have Calvin and I’m still not drinking.January marks my second sober start to the New Year, and I have no intentions of ever picking up a drink again. And while learning to make sourdough bread wasn’t the only thing that helped me give up booze—I learned to cook a lot of meals from scratch and my cabinet is filled with herbal teas—it did give me a new habit that doubled as a visual reminder of the commitment I had made: Calvin lives in a part of the kitchen I see every day.At the beginning, it took more than a month for Calvin to become a thriving community of bacteria and yeast strong enough to give rise to a loaf of bread, and my first few weren’t pretty. But that was fine by me; it took about three months to forget about drinking on the daily anyway. A lot of people tell me they have a hard time giving up alcohol because life without a cocktail is just too boring. Years ago, I would have wholeheartedly agreed. But, for me, having sourdough to focus on helped replace an unproductive habit with something fun and fulfilling.I never actually thought baking would help me quit drinking, but I’m glad it did. And as long as Calvin stays strong, I feel like I will too.Explore Bon AppétitHealthyishBreadessayRead MorecookingWhy Some Gluten-Sensitive People Can Still Eat Sourdough BreadBy Keri WigintonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-14", "author": ["Condé Nast", "Keri Wiginton"]}