{"id": "9ff6222bdf507fd390dd2b598bd0cf18", "url": "https://www.bonappetit.com/recipe/pancit-canton", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Pancit Canton Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssuePancit CantonBy Melissa MirandaFebruary 9, 20214.7(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintPancit is by nature a quick and easy noodle dish, and this version from Melissa Miranda, chef-owner of Seattle’s Musang, varies depending on whatever she has in the fridge. “This is a kind of a ‘refrigerator pancit,’” says Miranda. “The staples are always carrots, celery, and then whatever vegetables you want to use. We’ve been so conditioned that it has to be cabbage, it has to be carrots, it has to be this, that. But if you have yellow squash, why don’t you throw it in there? If you have peas, why not throw it in there?” Mushroom broth, made from dried mushroom powder, is nearly instant, yet better than virtually every other vegetable-based broth out there.Ingredients4 Servings2tsp. mushroom powder or 2 cups low-sodium vegetable broth2Tbsp. vegetable oil1medium onion, thinly sliced5garlic cloves, finely chopped3celery stalks, thinly sliced2medium carrots, peeled, cut into matchsticksKosher salt, freshly ground pepper½small head of green cabbage, thinly sliced7button mushrooms1cup snow peas1Tbsp. Knorr liquid seasoning1Tbsp. oyster sauce1Tbsp. soy sauce (preferably Silver Swan)1lb. fresh wheat noodles (such as pancit canton, yakisoba, or miki noodles)Fish sauce (preferably Squid brand; for seasoning)1small bunch scallions, thinly sliced1lemon, cut into wedgesPreparationStep 1If using mushroom powder, stir powder into 2 cups warm water in a small bowl to dissolve. Set mushroom stock aside.Step 2Heat oil in a wok or large skillet over medium-high. Cook onion and garlic, stirring often, until translucent and light golden, about 4 minutes. Add celery and carrots and cook, stirring, 1 minute; season with salt and pepper. Add cabbage, mushrooms, and snow peas; cook, stirring occasionally, until crisp-tender, about 3 minutes.Step 3Add liquid seasoning, oyster sauce, soy sauce, and reserved mushroom stock (or vegetable broth). Bring to a simmer, add noodles, and cook until liquid is absorbed and noodles are al dente, 8–10 minutes. Season with fish sauce and more salt and pepper if needed.Step 4Divide pancit among bowls; top with scallions. Serve with lemon wedges for squeezing over.How would you rate Pancit Canton?Leave a ReviewTell us what you thinkExplore Bon AppétitFilipinoSoutheast AsianAsianNoodlePasta & NoodlesButton MushroomMushroomVegetableGreen CabbageCabbageLeafy GreensEasyQuickWeeknight MealsMainNut-FreeDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}