{"id": "a01aeee1a246b1fc6e7698a8e4475d91", "url": "https://www.bonappetit.com/story/to-the-stanger-who-helped-us", "year": 2022.0, "month": 3.0, "day": 4.0, "content": "If I Couldn't Save My Daughter's Life, Who Was I? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIf I Couldn’t Save My Daughter's Life, Who Was I?When she started choking at my husband’s restaurant, I found myself questioning everything.By Aria Beth SlossMarch 22, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is an excerpt from the anthology, Letter to a Stranger: Essays to the Ones Who Haunt Us, published March 22, 2022. Here author Aria Beth Sloss writes a harrowing thank-you to a quick-thinking diner at Blue Hill at Stone Barns, where her husband is chef and co-owner.My daughter was 18 months old that day. Her first food was fish skin, blackened and reeking of the sea—augury foreshadowing her fearlessness, her love of swimming, her appetites.Her father is a chef. We’d been at his restaurant since morning. Our daughters played in the old grain silo, filched cookies from the pastry kitchen, drew a dozen inscrutable pictures. After lunch my younger daughter went quiet. I sent the four-year-old out into the November afternoon to pick carrots in the greenhouse and took the little one, my baby, to sit by the windows opposite the bakery. It smelled like bread, sunshine, cold.Was this when you sat down? Three o’clock, three-thirty, a late lunch, the sun already plunging into the hills. The restaurant whitelinened and hushed, miles from anything. A doctor on her Sunday afternoon out, just recompense for all those days spent saving people’s lives. My father is a doctor. He loves creature comforts—a good meal, a warm bath, a nice crème brûlée. I have always envied him the brute physicality of his work, concrete in all the ways mine is not. Sometimes I wonder what I’ve done with my life, choosing to traffic in a thousand shades of gray.Imagine: We sat no more than a hundred feet from you, a single wall between us. My daughter made a solid weight in my lap. At our checkups I feign indifference to her stats and then furiously text my husband when the nurse leaves the room: 99th percentile!! She’s a beast!! The beast has astonishing eyes—clear, thrilling blue; they peered up at me as I sang under my breath, rocking her. Her eyelids drooped, closed. I smoothed her curls and my palm passed over her forehead: burning.Listen, I am not one of those hysterical mothers. I was raised to treat anything less than cancer or gunshot with aspirin, fluids, rest. I understand the body wants to heal. I held my daughter. I sang. And then what?She made a noise; her body stiffened. I felt a stab of worry, a blade sliding under my ribs. To this day, I couldn’t say. Something shifted. She made a noise; her body stiffened. I felt a stab of worry, a blade sliding under my ribs. I caught the eye of a passing server: “Sorry,” I said—sorry, sorry, why are we always sorry, we women? Why the shame at taking pride in a healthy child? Why the endless excoriation of my choices?—“Would you mind asking my husband to come out here?” The doors to the kitchen swung open and shut. Once I watched my father put my older brother, screaming, in a tub of cold water to lower his fever—106, I remember. A hard cure, but it worked. I felt my daughter’s strong legs under my hands—the muscled calves, the feet that had once, from inside me, kicked and kicked.The doors swung open; my husband walked toward us, wiping a hand against his apron. It’s possible he’d just plated your next course, arranged a few spinach leaves just so. His job, too, is physical, demanding. I am surrounded by men doing important work.“Something’s wrong,” I said. “I can feel it, something’s—” Against my chest, my daughter’s body convulsed. My husband took her as her head jerked forward and back: she threw up. Oh, the relief! For one bright second, everything shimmered back to normal. Just a puking kid! That second flared, disappeared, leaving a little contrail of okayness. She went stiff again in my husband’s arms and I heard her breath stop. “What’s wrong?” I asked, my voice spiraling up. “What’s happening?” Later, we would be told she’d had a febrile seizure, a usually benign phenomenon, which—coupled with a virus—had caused her to aspirate her own vomit. In the moment, all I knew was that she stopped breathing. Her face paled to a horrible white, then worse, passed into blue.Do you have nightmares about your work? My father does: patients accusing him of misdiagnoses, sawed-off limbs, lawsuits. Since I became a mother, my nightmares have swelled with silent accusations: our house is being burglarized, my children have been kidnapped, our car hurtles toward a tree. I reach for my phone to dial 911 but my fingers jam the keys, my help! sticks in my throat. In every nightmare, I come up short. Catastrophe blows in and I crumple. I fail to keep us safe.As my daughter turned blue and life began to leave her—a cliche, I know, but there’s no better phrase to describe how I watched what makes my daughter her drain from her body: her ferocity, her humor, her tyrannical enthusiasms—I dialed 911. I kept punching the numbers with my finger, but the call wouldn’t go through. The price of “bucolic” is no cell towers for miles, trees on all sides. I hurled the phone across the room. I heard a terrible noise, an unearthly howl, and understood it came from me. The only other time I have been an animal the way I was an animal that afternoon was when both my daughters were born.My husband began the Heimlich. We didn’t know she was choking; it’s possible he guessed. I think it was just that something had to be done and so, being him, he did it. I was on my knees as I watched my daughter’s face darken, dusky purple now, awful, otherworldly. Behind and around the three of us, a blackness crept up. It was thick and oily and I saw how easily we would all three slip in. My other daughter, too. A four-year-old girl, out picking carrots, who would come back inside to find everything changed.That must have been when someone went to find you. Maybe the manager, the server, whomever it was, ran into that elegant room and yelled, A child is dying! I cannot imagine it any other way. People cutting into wide ribbons of pasta, spooning delicate broth into their mouths. My daughter could not breathe. Something had to have signaled that it was the end of the world.And then: my husband squeezed, she coughed. Something dislodged. She opened her mouth and a shard of half-digested fruit dropped onto the floor. She made a sharp sound, a cry. I fell sideways; someone caught me.That was when you arrived.I saw how swiftly you moved: You knelt beside my daughter, still in my husband’s arms, and began pounding her small back. You didn’t ask permission. You raised your hand and drove the flat of your palm against my daughter’s back again and again, the way the video I had once watched, years ago, had shown. The way I’d been certain I would never forget.“She’s okay now,” someone said, maybe my husband. No; he was crying, too. Someone else. “She’s going to be okay.” I remember your face in that moment. I looked up through my tears and saw you: dark hair, small earrings, a swipe of color across your lips. A doctor but also just a woman out to lunch. Possibly a mother, too. I sagged on the floor. You held my gaze: “Are you okay?” You watched me even as you took my daughter’s pulse; it was your job to measure life’s visible contours, to make sure all the important points matched up. It was not your job to make sure I was okay.The ambulance arrived. EMTs swept through. I stood, still shaking. I stayed a long time with one foot in that blackness, what I’d glimpsed beyond the edge. I did not reach for her—that has stuck with me. That when the worst was over and I understood my daughter would live I didn’t lift her from my husband’s chest and hold her warm body against mine. For weeks, I would look at my children and feel nothing. It seemed possible, given my failure, that I could not be a mother anymore. I had not done my job.Someone showed you back to your table. You finished your lunch: A day’s work. When I thought of you, after, I thought of how your competence had shamed me. But it is your kindness I think of now, years later. Your question; your hand on my shoulder as you stood, brushing off your knees. You were accustomed to the world cracking open, the proximity of the divide: life, death. But you saw how that moment blew my small universe to pieces, how it stunned me—for a little while—into wondering who I was. What it meant to be me: a mother, a writer. I had to remember. I never got to thank you: a doctor, but also a human. Thank you.Aria Beth Sloss is the author of ‘Autobiography of Us,’ a novel. Her short stories have appeared in several publications, including Glimmer Train, Ploughshares, One Story, and Best American Short Stories 2015. She lives in New York City.For more stories like this:Letter to a Stranger: Essays to the Ones Who Haunt Us$18 at Amazon$20 $18 at BookshopRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-22", "author": ["Condé Nast", "Aria Beth Sloss"]}