{"id": "a02b6f71fadb074f2a10b81dcc505907", "url": "https://www.bonappetit.com/story/tteokbokki-is-my-ultimate-treat-yo-self-meal", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "This Tteokbokki Recipe Is My Ultimate Treat-Yo-Self Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTteokbokki is For Card-Carrying Members of the Chewy Food Fan ClubIt's more comforting than watching anime while wearing stretchy pants.By Elyse InamineMay 28, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kat BoytsovaFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Ever since the world turned upside down, I’ve been doubling down on comfort. I’m only human! I wear the same big baggy dress every other day, I only wear pants with elastic waistbands (that may have already been the case pre-COVID-19), and I spend most of my time sprawled on my couch or my bed. I’m watching not one but four animes right now, which is like the TV equivalent of hoarding toilet paper. And I’m eating only the chewiest, squishiest food, food as familiar and comforting as the softest pillow on my bed and with the same spring-loaded bounce. That means I’m eating a lot of Catherine Yoo's tteokbokki, a highlight reel of my favorite texture.In one dish, there are slippery rice cakes, bouncy fish cakes, and jiggly boiled egg, and they come lathered in a thick, sticky gochujang- and gochugaru-fortified sauce that’s spicy and sweet enough to keep me coming back for seconds and thirds. It’s the ultimate treat when elastic waistbands and never-ending anime aren’t enough.The tteokbokki starts with a stock made of dried anchovies, onions, dasima (dried kelp, also known as kombu), and smashed garlic. (I like to double this part of the recipe since this stock is the base of a lot of Korean soups like kimchi jjigae that I’m inhaling right now, nevermind the season.) Once everything has simmered together, you strain out the solids and plop some fish cakes into the broth so that they warm through and soak in all that deeply fishy flavor. Then you make a vibrant red sauce with the trinity of Korean cooking: gochujang with its honeyed spice, soy sauce, and throat-tickling-hot gochugaru.Instagram contentThis content can also be viewed on the site it originates from.Next is the best part, IMHO: the rice cakes. Crisp them up in a hot skillet, throw in more sliced onions and garlic cloves, and cook until they’re flimsy but not browned and everything smells good. Pour the sauce into the skillet, along with a couple cups of the stock and all of the fish balls. Let it bubble and thicken and listen closely—it’s like ASMR but with no screens. Soothing!After a few minutes, slip in some halved bok choy and chopped scallions, cooking them down so they’re somewhat wilted but still crunchy. Slide the tteokbokki onto a platter and finish with half-moons of boiled eggs (I know it says hard-boiled here, but I always do soft-boiled because I can’t with hard-boiled), toasted sesame seeds, and more scallions.Then my husband and I just eat directly from the platter, no plates needed. I like to eat in increasing order of chewiness first the egg, then the rice cake, and finally the fish ball, and then do it all over again.What can I say? I’m an expert on comfort.Get the recipe:Tteokbokki (Spicy Korean Rice Cakes)It’s impossible to resist this supremely satisfying Korean snack combining chewy, stick-to-your-ribs rice cakes and spicy-sweet gochujang sauce.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "Elyse Inamine"]}