{"id": "a02b850d4aa3b1e7ca5bcc38c3ccf3a9", "url": "https://www.bonappetit.com/story/gina-esposito", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "Gina Esposito of Nu Swim Reveals How She Squashes Her Anxiety and Gets to Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Nu Swim's Gina Esposito Squashes Her Anxiety and Gets to SleepShe takes her bra off as soon as she gets home...obviously.By Kyle BeecheyAugust 15, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Going to Bed with..., we talk to the people we're crushing on about how they wind down before going to sleep.Gina Esposito was born to swim. Growing up in Rockville Centre New York to a beach worshipping mother and grandfather, the ocean became her happy place early on. Her love for the water led her to competitive swimming and lifeguarding as a teenager. While living in San Francisco and working in corporate fashion, she found a gap in the swimsuit market: There were one-piece speedos for laps and string bikinis for lounging but not much in between that was flattering, functional, and reasonably priced.In 2015, she launched Nu Swim with four models. From the beginning, Esposito has been committed to sourcing sustainable materials, using local factories, and employing an all-female staff. It’s clear from the cuts of the swimsuits and the models who wear them that Nu Swim aims to be inclusive of all body sizes as well.Nu Swim is Gina and Gina is Nu Swim, and it can be challenging to turn her entrepreneurial brain off at night. The only surefire way to put her sleep is “walking all day in the sun or swimming all day in the sea.” But when the beach isn’t an option, her calming routine starts from the moment she leaves her studio. “I try to do things in a slow, relaxed way when I get home so it winds me down,” she says. Here’s what else gets Esposito to sleep.The most beautiful tea leaves of all time.\nPhoto by Emma FishmanWalking off “Business Gina”My relaxation starts on my walk home from work. I try to do a little grocery shopping. I love walking around grocery stores and just thinking about each product and what I might do with it. It totally gets my brain relaxed. My gym is on the way home. I try to go two to three days a week, it helps a lot with getting relaxed. Then I usually go home and take a long, warm shower before I do anything else.I try to eat healthy nourishing food for dinner and a cup or two of decaf anti-inflammatory tea. I love Leaves & Flowers Turmeric Wellness tea or a classic chamomile. I also take a probiotic before bed. If I don’t have any, I’ll eat a scoop of my favorite, Seven Stars Farms yogurt.An air purifier that doubles as white noiseI haven’t been a good sleeper the last few years, it either has to do with street sounds or owning a business and not being able to turn my brain off, especially in times of high stress or deadlines. Our apartment currently faces a very noisy street, so it definitely has not made my sleeping life better, but we have an air purifier that we blast each night that helps a lot.No tears, no tangles.\nPhoto by Emma FishmanMinimal beauty and a special brushAt night, I make sure to wash my face with a soft-ish cotton or bamboo cloth and put a good retinol cream on my problem’ areas—parenthesis lines that develop a rash in warmer climates due to yeast!—along with a nighttime face mask cream. I also use Everyday Oil only on my forehead and eyes. I try to put a tiny bit inside my nostrils because the smell is soothing and relaxes me.My hair is long, thick, and wavy. I brush it with my favorite Yves Durif Vented Brush. I try to sleep on a silk pillow, but I hate the way 100-percent silk pillows look, so I have a 50-percent-silk, 50-percent-cotton mashroo pillow I made from this beautiful fabric from India. I also always put my hair in a low braid with a low impact cotton or silk scrunchie.Birks + socks = the coziest combo around.\nPhoto by Emma FishmanCrucial loungewearI always take my bra off as soon as I get home and put my ultimate comfort outfit on. I am obsessed with leggings and a mens XXL t-shirts—always 100 percent cotton for comfort and breathability. I love my friend’s brand  Pansy for leggings. I also love comfortable socks. My favorite are this linen and cotton pair I got from New Zealand. If it’s really chilly indoors, I have this huge, super cozy Lauren Manoogian Alpaca Sweater Coat that kind of doubles as a blanket.Nightly entertainmentI either like to read the New Yorker before bed or watch a show I’ve seen a million times. I am an only child and grew up feeling lonely sometimes, so the comfort of voices is something that makes me feel good, and if it’s a show I have seen 5,000 times, I don’t necessarily need to watch it, I can just listen. The Office is on heavy rotation.Top shelf, but make it top of the sink.\nPhoto by Emma FishmanThe final wind downI usually sleep on my side but I fall asleep on my back. If I lie on my back, the thoughts in my head turn slowly into dreams. Thinking about one specific subject usually helps too. Once I’m ready to switch to my side position, I make sure a pillow is ready for under my knee. I’ve taken a few restorative yoga classes and try to implement what I’ve learned into my sleeping routine, but it isn’t usually successful for the entire night. I’m constantly needing to switch sides.Explore Bon AppétitHealthyishGoing to Bed withprofileRead MoreLifestyleFolasade Adeoso Goes to Bed With Indica and an Easy Homemade Linen SprayBy  Siraad DirsheRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-15", "author": ["Condé Nast", "Kyle Beechey"]}