{"id": "a032e713ebb830dca0593433449bb471", "url": "https://www.bonappetit.com/story/ode-to-combo-platter", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "It’s Time We Give the Mexican Combo Platter the Credit It Deserves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureIt’s Time We Give the Mexican Combo Platter the Credit It DeservesA plate of tacos, rice, beans, and maybe an enchilada or two remains a ubiquitous part of Mexican American restaurant culture. But it’s seldom celebrated.By Patricia EscárcegaFebruary 13, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere was a time in my life when the only thing I wanted for my birthday was dinner at La Familia, a moodily lit Mexican restaurant in West Phoenix with wobbly tables, big leather booths, rancheras on the jukebox, and my favorite restaurant dish in the city: the Number 11.The Number 11 was an oval-shaped platter covered with my favorite foods: fluffy tomato-tinged sopita de arroz; pinto beans softened into a creamy mash; and a cheesy chile relleno cosseted in a flash-fried egg white batter. The plate was gilded with a tuft of iceberg lettuce and roughly chopped tomatoes and served with a homemade flour tortilla so big it could be folded into thirds like a dinner napkin.A server in oven mitts would carefully slide it all onto the table with the cautionary chant heard to this day in old-school Mexican restaurants across America: “Careful! Hot plate!”The Number 11 was hearty and flagrantly rich, a spectacle of fleshy, smoky chile and molten white cheese. The rice and beans were crucial to the experience, offering succor from the chile’s needling spice, but also fortifying and delicious on their own. Eating it filled me with a warm buzzy pleasure.A server at La Luz del Dia in Los Angeles holding a classic combo platter.\nPhoto by Alex LauMy family didn’t have the means for regular sit-down restaurant dinners, so a visit to La Familia was a rare treat. Of course, this only compounded my desire for the Number 11.Around my 15th birthday, I became a vegetarian, a development that gradually steered me away from restaurants and toward the home kitchen. Then one day, as a college student  visiting the old neighborhood, I went to look for La Familia and found a billiards hall in the gritty strip mall suite where the restaurant once lived.But the memories of La Familia’s tall laminated menus and scorching-hot platters had already dug a permanent niche in my heart. And my appreciation for the Number 11—and the Mexican combo plate format in general—has never waned.Though it remains a ubiquitous part of Mexican American restaurant culture, the humble combo plate is seldom celebrated. More often, it’s dismissed by food writers as cheap, formulaic, old-fashioned, or “inauthentic.”Its most famous detractor is cookbook author and Mexican food authority Diana Kennedy, a vociferous critic of north-of-the-border Mexican American cuisine. In her book, The Art of Mexican Cooking, Kennedy dismisses the combo plate as “an overly large platter of mixed messes, smothered with a shrill tomato sauce, sour cream, and grated yellow cheese preceded by a dish of mouth-searing sauce and greasy deep-fried chips.”Yet for all its lack of pretense, the combo plate is a complicated cultural artifact. Its roots are in Tex-Mex cooking, a regional cuisine that itself has been the object of scorn and confusion over the years, mostly, again, over questions of its “authenticity.” Until recently, Tex-Mex cooking was often derided as a bastardized or “Americanized” form of Mexican cooking, and not a style in its own right.The No. 3, with one taco, one tamale, rice and beans, in process at La Luz del Dia.\nPhoto by Alex LauBack at the turn of the century, the combo plate was popularized by Otis Farnsworth, an enterprising Midwesterner who was taken to a Mexican-owned restaurant on San Antonio’s west side while in town on business. Intrigued by the long lines of Anglos lining up for enchiladas and sopa de arroz,  he got the idea to open his own Mexican restaurant.The Original Mexican Restaurant, as he named it, opened in 1900 near the present-day RiverWalk in San Antonio. One of the restaurant’s hallmarks was  “the Regular Supper,” a platter that allowed customers to combine different dishes—enchiladas, tamales, beans, rice—on one plate. The person credited with adding numbers to the plates is Miguel Martinez, a Mexican immigrant and entrepreneur who rebranded his Dallas restaurant, Martinez Cafe, as El Fenix in 1922—the year he started serving Mexican food in the form of combo plates. Adding numbers made it easier for non-Spanish speakers to order food.From the beginning, then, the combo plate was a way to make Mexican cooking more accessible to Anglo diners. The format has never been a good reflection of the way most Mexicans and Mexican Americans eat in the home. As comedian George Lopez quipped in an early comedy special, Mexican children don’t go to abuelita’s house and order a combination platter.But the combo plate is more than a marketing tool or culinary relic. It’s a tangible symbol of Mexican and American ingredients and flavors merging on the plate, and a driver of cultural cross-pollination. In the American Southwest in the early 1900s, local indigenous, Mexican, and Spanish ingredients and culinary traditions often came together in new ways. “Chili gravy,” for instance, the cumin-inflected enchilada sauce that’s become a hallmark of Tex-Mex combo platters, was borne out of a need to make Mexican chile-based sauces more palatable to Anglo diners.The rise of the combo plate is also closely tied to the history of some of our country’s oldest and most influential Tex-Mex, Sonoran-Arizonan, and Cal-Mex restaurants. At groundbreaking businesses like L.A.’s El Torito, Tucson’s El Charro Cafe, and Caro’s Restaurant in Texas’s Rio Grande Valley, the format was instrumental in popularizing dishes like fajitas, carne seca, and the puffy taco—foods that once seemed foreign to many Americans.Warm tortillas, highly important.\nPhoto by Alex LauHistorically, the combo plate has been an important driver for small businesses. Ron Salisbury, owner of El Cholo, one of the oldest family-owned Mexican restaurants in Los Angeles, remembers how combo plates helped his grandparents’ restaurant bounce back after losing most of its lunch clientele to a newer restaurant called El Vaquero. “The original El Cholo on Western did as all the Mexican restaurants in early Los Angeles, and sold everything a la carte,” Salisbury said. “El Vaquero had created combination plates. The next week we created our own and all of the business returned.”And for families like mine, dining on a scraped-together budget, a well-executed combo plate can be an essay in plenitude, variety, good value, and pleasure. As a kid, I clambered into one of La Familia’s big squeaky booths on my birthday and reveled in the Number 11’s cheesy opulence with a level of enthusiasm that remains unmatched to this day.As an adult, I appreciate the combo plate as an emblem of my bicultural heritage, but also as a diminishing species in the modern restaurant ecosystem. Older Mexican American restaurants, national keepers of the combo plate, are a naturally shrinking segment. So I say let’s celebrate the format for as long as we have it.Some of my favorite places to find a combo plate in Los Angeles these days include La Luz del Dia on historic Olvera Street (my go-to is the No. 3: one taco, one tamale, and a hearty pool of rice and beans); El Sombrero in El Monte; and Zacatecas Restaurant in Hawthorne. La Barca, a long-running Mexican restaurant near the University of Southern California campus, is home to a doozy of a combo plate called La Grandota (“The Big One”).Everything you need for a proper combo platter, right there at La Luz del Dia.\nPhoto by Alex LauAs Mexican cooking continues to rise in popularity around the world, I hope that Mexican American regional permutations, past and present, are more widely recognized and celebrated. Just as Mexican cuisine encompasses myriad distinct regional styles, so too does Mexican American cooking, and embracing that richness means embracing the combo plate.It’s a mistake to discount the foodways that have gotten us to where we are today. I hope a new generation of chefs take inspiration from the combo plate’s fascinating history of innovation, regionality, and cross-cultural exchange to move boldly into the future of Mexican cooking everywhere. And whatever the future brings, I hope it's as delicious as the number 11.Patricia Escárcega is a writer and restaurant critic at the Los Angeles Times.Want More Stories From Taco Nation? Right This Way...Sorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayWhy Are H-E-B’s Flour Tortillas So Dang Good?In Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoAnd so much more!Explore Bon AppétitTaco NationMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Patricia Escárcega"]}