{"id": "a03ce516035da174e1959a86e2c7b812", "url": "https://www.bonappetit.com/story/grate-your-tofu", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Grated Tofu - How to Grate Firm and Extra-Firm Tofu on a Box Grater for Fast, Flavorful Tofu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Lightning-Fast, No-Planning-Ahead Tofu, Grate ItBox grater to the rescue.By Chris MoroccoFebruary 11, 2021FacebookTwitterEmailPhoto by Laura Murray, food styling by Susie TheodorouFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.You never forget your first tofu scramble. I was in college, and it was my first meal at the student-run co-op where I would be eating for the year. It was steamy kale and mashed tofu dripping with Bragg’s Liquid Aminos, served directly from the bathtub-size wok it was cooked in. It was soggy, salty, and vaguely nutritive. That tofu deserved better, and I decided on the spot to become a cook at the co-op so I would never have to eat anything like that again.Tofu is now one of my favorite things to eat—I love crispy tofu and revel in the texture of silken. And when I’m short on time (especially when lunch comes around), I turn to the box grater method: I squeeze out the excess water from a block of firm or extra-firm tofu (using my hands, like I’m the Hulk or something!) and shred the whole thing on the large holes of a box grater. This breaks the tofu down into coarse shreds that, once cooked, take on the texture of ground meat and easily soak up flavor. I have used this trick in veggie burgers, cooking the tofu before incorporating it into the mix in order to rid it of moisture and give it heft and bounce to mimic ground meat. I also use this approach for dumpling fillings, using raw squeezed tofu combined with chopped scallion, ginger, and garlic.My Soy and Scallion Tofu Bowl employs this technique for lightning-fast, zero-prep tofu that doesn’t skimp on flavor. It’s inspired by chef Tadashi Ono’s version of Soboro Beef, where he takes extra care to break the meat apart into the smallest possible pieces, allowing each to become fully suffused with soy, sake, and mirin. Here, I use the box grater to the same end.I then cook the shredded tofu in oil infused with garlic, sesame seeds, and chile flakes until it’s the texture of ground meat—micro-crumbles that firm and crisp, with tons of surface area for absorbing seasoning. Once the moisture from the tofu has cooked out and the garlic, sesame, and chile have deepened in flavor, in goes an assortment of pantry staples: soy sauce, butter, scallions, and a touch of mirin or maple syrup. The result, in astonishingly little time, is a versatile rice bowl topper or even taco filling, with flavor clinging to every nubbin. I wish I had figured this out back in school, but I guess there are some things they just don’t teach you in college.Get the recipe:Soy and Scallion Tofu BowlGrate your tofu on a box-grater (it works!) and the rest of this satisfying lunch bowl is only minutes away.View RecipeGet the tool:Box Grater$13 at AmazonExplore Bon AppétitTofuLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-11", "author": ["Condé Nast", "Chris Morocco"]}