{"id": "a057527ec6ae10583e8542e27a3a9f02", "url": "https://www.bonappetit.com/recipe/chef-michael-scelfos-roasted-apple-and-tillamook-cheddar-hand-pies", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Chef Michael Scelfo’s Roasted Apple & Tillamook Cheddar Hand Pies Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDChef Michael Scelfo’s Roasted Apple & Tillamook Cheddar Hand PiesSponsored by TillamookFacebookPinterestTwitterEmailMakes 18 hand piesTillamook Sharp Cheddar adds a tangy twist to these sweet-and-savory hand pies from chef and restaurateur Michael Scelfo of Longfellow.PrintIngredientsDough2½  cups All-purpose flour½ tsp. salt1 cup (2 sticks)  Tillamook Sweet Cream Unsalted Butter, chilled and cut into small pieces½ cup sour cream½  cup ice cold water1 Tbsp. lemon juiceFilling2 crisp apples (Gala or Honeycrisp would be ideal), peeled, cored and finely diced¼ cup sugar¼ tsp. cinnamon⅓  cup (1 oz.) finely diced Tillamook Sharp Cheddar1 tsp. fresh thyme1 tsp. honey1 egg1 tsp. waterRecipe PreparationIn a large bowl, whisk together the flour and salt. Cut the Tillamook Sweet Cream Unsalted Butter into the flour mixture until it resembles coarse meal. Whisk together the sour cream, lemon juice and water in a small bowl and add to the flour gently tossing and stirring with a fork until the flour is well moistened and has come together into a lumpy moist dough. Divide into two disks and wrap each with plastic wrap. Refrigerate 1 hour or overnight.Line two baking sheets with parchment paper. On a lightly floured work surface, roll out one disk to ⅛-inch thickness. Using a 4-inch round biscuit cutter, cut out 9 rounds transferring to a baking sheet cut. Repeat with the remaining dough. Refrigerate the rounds at least 30 minutes.Meanwhile, in a small non-stick saucepan, stir together the apples, sugar, cinnamon and a pinch of salt. Cook over low heat, stirring frequently, until the apples are glossy and tender, and the liquid is thick and syrupy, about 10 minutes. Transfer to a bowl to cool completely. Stir in the Tillamook Sharp Cheddar, thyme and honey. Just prior to filling the pies, drain any accumulated liquid from the apple-cheddar filling.Whisk together the egg and water. Working with 1 sheet of rounds at a time, spoon 1 Tbsp. filling onto the center of each round. Lightly brush around edge with eggwash, then fold round in half over the filling, pressing edge to seal. Decoratively reinforce the edge pressing with the tines of a fork. If the dough gets too warm to work with, chill rounds before continuing.  Repeat with remaining rounds. Brush the tops lightly with egg wash and chill the assembled hand pies 30 minutes.Preheat oven to 375°F with oven racks in upper and lower thirds of oven. Bake, rotating midway through baking, until hand pies are golden, about 15 to 20 minutes. Cool on racks slightly before serving.Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}