{"id": "a0764b180dee8155b751391632a81029", "url": "https://www.bonappetit.com/story/recipe-subscription-announcement", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "The Future of Bon Appétit Looks Bright—and Very Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Future of Bon Appétit Looks Bright—and Very DeliciousJoin us for unlimited access to recipes on BA and Epicurious.By Dawn DavisFebruary 1, 2022FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailDear Reader,Before we joined Bon Appétit and Epicurious as recipe developers, editors, photographers, writers, and designers, we were home cooks and bakers searching for inspiration. And while the internet is full of recipes, only a handful of publications, including ours, are backed up by kitchens where recipes are tested, tried by not one but several trained chefs and professional cooks, and tweaked until they’re ready to be shared with the world.Today we’re introducing a paid recipe subscription on both Bon Appétit and Epicurious. Moving to a subscription model will help us sustain our business and hard-working staff in a fast-changing industry—and allow us to keep bringing you recipes that live up to our own and our community’s exacting standards. Your support gives us the opportunity to deliver not just recipes but trusted advice on cooking methods, reporting on industry leaders, and soup-to-nuts (pun intended!) primers on our favorite ingredients.Here’s how it works: After viewing three recipes you’ll be prompted to create a paid account. Subscribers will have unlimited access to our ever-expanding Bon Appétit and Epicurious recipe databases, plus the vast archive of Gourmet recipes that live on Epicurious. (We’re at 50,000 recipes and counting!) All users will continue to have unlimited access to articles, videos, and newsletters. More details can be found on our subscription page and FAQ page.For almost seven decades we have sought to help readers become confident, creative cooks who are engaged in and excited by food. That’s as true for us now as it was in 1956, when our magazine first landed on shelves. The world has changed a lot since then, but people are still discovering the joys of cooking, and it feels like we're only just getting started. Thanks to your support, the future looks brighter than ever—filled with delicious meals and thoughtful stories that help us all make sense of our ever-evolving food world.With gratitude,Dawn Davis and the editors of Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-01", "author": ["Condé Nast", "Dawn Davis"]}