{"id": "a089c133a0111b26a840d403c3cc35ea", "url": "https://www.bonappetit.com/story/crispy-rice-frittata", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Crispy Rice Frittata | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Crispy Rice Frittata Is Where Leftover Rice Goes To HeavenA very good excuse for always making a little extra rice. By Emma WartzmanOctober 11, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina Boytsova FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we make with our eyes closed.Everyone will tell you that the way to use up leftover rice is to make fried rice. The best version of the latter requires the former, as the cooked grains are drier and therefore more amenable to high heat, flavor absorption, and the ever-coveted crispiness.But what happens when you’ve made fried rice three too many times in the past month? Or when you don’t have quite enough left over to constitute a full meal? Might I suggest the crispy rice frittata, a dish I put together when I was in one such scenario. I was inspired by just how much we love crispy rice around BA but constrained by the fact that it was a pantry dinner kind of night. In the end, though, it turned out so well that it became a staple in my kitchen, even an excuse to make extra rice.This crispy rice frittata is riffable, a perfect vehicle for using up not just your leftover rice, but whatever other odds and ends you have in your fridge. Greens like kale or spinach, a small block of lingering cheese, some roasted vegetables from a few nights ago, and that half a sausage you felt too guilty to throw out are all fair game. (Of course, certain ingredients will need to be cooked first. Don’t add in anything raw that you wouldn’t want to actually eat in its raw state: We’re thinking bacon, mushrooms, white onion). But when it comes down to it, the only nonnegotiables are olive oil, salt, eggs, and rice.For the sake of a recipe(ish), here’s a streamlined version, to be followed exactly or used as a guide:Start by preheating your oven to 300°.Whisk together 6 eggs, along with a generous pinch of kosher salt. Beat until the whites and yolks are fully incorporated and the mixture looks a bit frothy. This ensures that your frittata will be nice and fluffy. Grate ¼ cup parmesan cheese using a microplane and mix that into your eggs. Set aside.Next, heat 2 Tbsp. olive oil in a medium nonstick skillet over medium heat. While you’re waiting for the oil to get hot, slice 1 bunch scallions into bite-size pieces, discarding the hairy ends and the tippy-tops. Drop the pieces in the skillet, spread them out evenly, and then let them sit undisturbed for about 5 minutes. You’re not going to get a char on these like you would if they were in a piping-hot cast iron, but that’s okay. You just want them to get tender and take on a bit of color. Once they’re at that point, it’s time to add in the rice.What dreams are made of! \nPhoto by Chelsie Craig, Food Styling by Pearl JonesKeep the heat at medium. You’ll still have some olive oil in your pan, but you want to add a bit more, so that it lightly but completely coats the bottom. This is the key to crisping up your rice. As the great Carla Lalli Music puts it, fat is not just flavor—it’s also the cooking medium, a.k.a. the stuff that carries the heat to the rice and gets it crackling and golden-brown.Pour 2 cups leftover white rice into the skillet and spread it out evenly, compacting a little with a spoon or spatula. The layer should be about ½-inch thick, covering the bottom of the pan. It can be thinner than this if that’s what you’ve got, but don’t go much thicker, as the rice won’t get truly crisp. Give that a nice sprinkling of kosher salt and let it cook undisturbed for about 10 minutes.Once you see that the rice is getting color underneath (if you’re unsure, peek by lifting up an edge with a spatula), pour your egg mixture over the top.Turn the heat off and transfer your skillet to the oven. Yes, we’re putting a nonstick skillet in the oven, and yes, it will be fine. We’re at low heat and it only takes about 15 minutes to set the eggs. The oven is important here because the rice creates a barrier that insulates the eggs from the heat of the stovetop and of the pan. You need the gentle, surrounding heat of the oven to allow the eggs to cook evenly, while also ensuring that the layer of rice stays crispy and doesn’t burn.While the frittata is baking, pick the leaves from some tender herbs. You can use whatever you like, which for me is a combination of cilantro, parsley, and basil. (Also, a few stems never hurt anyone!) All in all, you want somewhere in the ¼–½ cup ballpark for big bites of freshness.When the frittata is done—check after 15 minutes or so—pull it out and let it sit for a few minutes before transferring it to a cutting board. It should slide right out. Top it with the herbs and a sprinkle of flaky sea salt, then cut it into wedges.The bottom of the frittata will be a perfect layer of crispy rice, and the top will be light and fluffy, each bite studded with caramelized scallions and parm, with bright, fresh herbs to finish. If you ask me, it’s the ideal one-skillet, use-it-up dinner—and you don’t even need toast.You do, however, need hot sauce:How to Choose the Right Hot Sauce for the JobVinegary hot sauce? Fermented? Garlicky? Ultra-spicy? There's a right answer.View StoryExplore Bon AppétitRiceIt's That SimpleFrittataRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-11", "author": ["Condé Nast", "Emma Wartzman"]}