{"id": "a095bd4c0d4b85a235021fdbd3d11320", "url": "https://www.bonappetit.com/recipe/umami-gravy", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Umami Gravy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueUmami GravyBy Andy BaraghaniOctober 16, 20184.9(22)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWe made it our business to create an excellent gravy with store-bought broth—no ham hocks, chicken parts, or hours-long simmering involved. Since that went so well, we decided it should also be finished on turkey-prep day (a.k.a. the Tuesday before Thanksgiving). No last-minute gravy panic!IngredientsMakes about 3 cups1Tbsp. (or more) vegetable oil1turkey neck (reserved from Dry-Rubbed Roast Turkey), patted dry1cup chopped shiitake mushrooms1medium onion, finely choppedA small handful of rosemary sprigs, thyme sprigs, and/or bay leaves½cup dry white wine6cups (or more) low-sodium chicken broth or turkey stock3Tbsp. unsalted butter¼cup Wondra or all-purpose flour1tsp. soy sauceKosher salt, freshly ground pepperPreparationStep 1Heat oil in a large saucepan over medium-high. Cook turkey neck until golden brown all over, about 3 minutes per side. Transfer to a plate.Step 2Add mushrooms to the same saucepan and cook over medium-high, stirring occasionally, until browned all over, about 5 minutes. If pan is starting to look dry, add another teaspoonful or two of oil. Add onion and cook, stirring occasionally, until brown around the edges and softened, 6–8 minutes. Add herbs and cook, stirring constantly, until fragrant, about 1 minute. Pour in wine and use a wooden spoon to scrape up any browned bits stuck to the bottom of the pan. Bring to a boil and cook until wine is almost completely evaporated, about 5 minutes.Step 3Return turkey neck to pan and add broth; bring to a boil. Reduce heat and simmer, stirring occasionally, until liquid is reduced by a third, 25–30 minutes. Strain fortified broth through a fine-mesh sieve into a large heatproof measuring glass or small bowl; discard solids. (You should have 4 cups. If needed, add more broth or water to get you there.) Keep warm while you make the roux.Step 4Heat butter in a medium saucepan over medium.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 5Once butter is melted, whisk in flour and cook, whisking constantly, until roux is golden brown and looks smooth and shiny, about 3 minutes.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Whisking constantly, ladle fortified broth into roux, pouring in gradually and incorporating after each addition before adding more. Simmer, whisking often, until gravy is reduced to about 3 cups (it should be thick enough to coat a spoon), 12–15 minutes.ChevronChevronStep 7Stir in soy sauce for that last umami hit. Taste and season with salt (if needed) and pepper.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 8Do Ahead: Gravy can be made 2 days ahead. Let cool; cover and chill. Reheat over low, stirring occasionally, until warmed through.How would you rate Umami Gravy?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI have made this recipe on the day before for the past 2 Thanksgivings and have had no problems whatsoever in reheating. Of course, I only use Wondra - never all purpose flour, and I add whatever drippings are in the pan.Marjie11/24/2021This was the star of our Thanksgiving meal!  We'll be making it every year.  LindseyRichmond, VA11/28/2020I do something very similar  (almost the same) with just a few hacks, which I'd like to share to simplify your recipe: I take dried shiitake mushrooms (or any dried mushrooms) and I run them through a spice or coffee grinder until they are pulverized into a powder. Then I add the powdered mushrooms to the roux after the flour mixture has toasted and toast them a little bit to cook the oils out of them right before you add the liquid. It makes a very strong umami flavor. Then add your soy sauce and I also add a T of sherry or brandy to get even more jazzy flavor.DiDi LBoulder, CO11/23/2020Really deep \"meaty\" flavor.  Along with the turkey neck, I also brown some turkey or chicken gizzards or hearts (whatever is available) and add to the broth to create even more flavor. This year I'm considering adding a teaspoon or two of Marmite to further up the umami.Laura DChicago11/18/2020Wondering about adding some white miso to bump up the umami complexity.LKSugarmanSan Francisco11/13/2020Made this yesterday, and it was incredible. Definitely make the stock the day before or in the morning, and then you can prepare the gravy right before serving it. Anonymous11/29/2019I made this last year and it is my favorite of all my dishes! It is so flavorful, I can't wait to make it again! It took me longer than the stated times to cook down, so to be on the safe side, I am making a day ahead. Someone else commented here, about it not reheating as nicely, so we shall see about pre-making it!Anonymous11/25/2019This was a hit! Cooked 2 turkeys, one fried and one roasted, so having everything done at once was a concern. A great make ahead gravy was perfect for both birds, no sweat to heat up. Besides that it was delicious. All the vegetal flavors rounded out over the slow reduction, nice punch from the wine and soy, silky texture that was in no way heavy.MadDogBitesRochester, Ny11/25/2018This really is an excellent recipe. Made it exactly as written and likely will make it many years to come. I may leave the mushrooms I next time, or, maybe I won't fix something thats not broke. LaMaLeMichigan11/25/2018I'm giving this recipe a try, since this year I'm making just a turkey breast and don't think I'll have enough pan drippings to make my usual gravy.  Based on @SidneyAnderson's comment about texture changes when reheating, I'm going to make the fortified broth on Wednesday, and finish the gravy the day of.  Fingers crossed!laladoSeattle WA11/21/2018Hands down the best gravy I have ever tasted!! I didn't have a turkey neck so I used some chicken bouillon  - works very well. I'm currently trying not to eat it all spoonful-by-spoonful. MAKE THIS. Brooklyn 11/21/2018WOW!! This is great (just finished for Thursday and had an itty-bitty taste). For many years, I have been searching for an easy make-ahead recipe and think this might be the one. I really imagine it will be met with rave reviews. That said, it doesn't make a ton so be prepared with another option if you are having a large gathering/big gravy eaters.  Also, do taste as it suggests above--it ended up needing a teeny sprinkle of s&p. Anonymous11/21/2018Made this gravy alongside the dry brined turkey recipe from the same issue and followed the brilliant suggestion to get it done on turkey prep-day. It was flavorful and rich, making it a good companion to all the carbs on my plate. One question I have is about the texture after reheating the gravy - I let it come up to temperature on low on the stove but it never found it’s way back to its OG silky texture, and was a little more globby than I would have preferred. Any tips on how to restore its day-of texture when reheating? sidneyandersonMinnesota11/18/2018Explore Bon AppétitSauceGravyAmericanTurkeyPoultryShiitake MushroomMushroomVegetableRosemaryHerbs & SpicesSideNut-FreeSimmerSautéThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Andy Baraghani"]}