{"id": "a09ac74d051565dce07e8d1798dbad5f", "url": "https://www.bonappetit.com/story/george-michael-cookies", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "I Put My Faith in George Michael, But Cookies Were My Ticket to Freedom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Put My Faith in George Michael, But Cookies Were My Ticket to FreedomParked in front of a doll-size oven at my father’s trailer park in Reno, I learned to visualize the life I wanted.By Monti Carlo September 13, 2021FacebookTwitterEmailIllustration by Mark WangFacebookTwitterEmailI was 12 years old when my twin brother and I started living with our estranged father at a trailer park in Reno, Nevada. We’d met him just once before, when my mother drove us cross-country to give it another go with her first husband. After three grueling days on the road (where we lived off of pork rinds, Snickers bars, and Pepsi), she stepped out of her Buick to find the woman my father had left her for waving hello from his apartment’s balcony.We didn’t stay for long.Things were different this time around. It was just my brother and I; the new girlfriend was gone. And my father now lived in a shabby single-wide on the outskirts of the city with his two mutts. He said he’d moved because he wanted to be closer to “nature,” but I was sure it had more to do with my mother throwing punches at his lady friend and the fact that firefighters had to stop his apartment from burning to the ground.If you didn’t count the two dogs, I was the only female in our humble abode. Therefore, according to our Puerto Rican bible, I was responsible for the bulk of the cooking.My father’s kitchen consisted of a refrigerator so small I could dust the top without getting on my tippy-toes. The sink was the size of a salad bowl and sat next to a tiny drying rack, where he kept his mismatched plastic plates and the empty Imperial margarine tubs he used for leftovers. The stove was two coiled burners and an oven big enough for one personal-size pizza.I had a limited skill set for kitchen work, so home-cooked meals consisted of eggs every which way: soft-boiled with toast, scrambled with hot dogs and tucked into a tortilla, and mixed into steaming cups of instant ramen where they transformed into pale yellow ribbons.All my father ever asked of us was to allow him to drink a jug of Carlo Rossi Burgundy in peace after he came home from his FedEx delivery gig. Afterward, he would deliver his two favorite mantras on repeat: “The prophecies of Nostradamus are real” and “Visualize the life you want.”I didn't care much about Nostradamus, but I did visualize the life I wanted multiple times a day. As a tween, this consisted of daydreaming about my first kiss with the pop singer George Michael, whom I sensed with my whole heart I would marry. I had no money, but I knew I had to buy his latest solo album, Faith, to get him to walk down the aisle. How could I pop the question without it? I imagined George eyeing the Debbie Gibson and Michael Jackson cassette tapes that made up the entirety of my music collection, his perfect lips pouting and then parting as he burst into song:“Oh, when that love comes down without devotion, well, it takes a strong man, baby, but I’m showin’ you the door. Because you shoulda bought Faith, Faith, Faith.”If I didn’t get that album, my whole life would be derailed, I explained to my father with my hand outstretched for cash. He gave me a boozy smile. “Mija, money doesn’t grow on trees. Figure out what people want and sell it.”The kids in the trailer park wanted all sorts of things, but nothing captured their attention quite like sweets. A bag of candy could cause a ruckus at the playground, and a brownie or a cookie made beggars out of everyone present. So when I found a recipe for peanut butter cookies in an old newspaper, I knew it could be a moneymaker. It used only three ingredients, and luckily my father had them all in stock: peanut butter, sugar, and eggs.I whipped up that first batch of dough with the kind of care reserved for disarming a bomb, pouring three quarters of a cup of sugar into a plastic measuring cup like grains of sand into an hourglass. I cracked an egg into a large metal bowl and spent several infuriating minutes fishing bits of shell out of it. Then I added the sugar, mixed it with a fork, and frowned at the results: a viscous blob that looked like grainy pudding. Scooping out a cupful of Skippy proved the most challenging task. By the time I finished transferring it into the bowl, I looked like I was wearing peanut butter mittens.Undeterred, I licked my fingers clean, grabbed the bowl, sat on the floor, and mixed up the mess with the fork. Miraculously, the gritty egg jam transformed into a caramel-colored dough. I remember feeling like I had just witnessed a top-secret magic trick.Next I shaped a single cookie and placed it on the only sheet pan my father owned. It was toaster-oven-size and looked like it had been in a street fight with a blowtorch. The oven’s knob had most of the numbers rubbed off; after a minute of pondering where 350 degrees should be, I placed the notch about an inch away from broil and gently slid my concoction into the oven, staring at it through the greasy window as it baked. It only took a few minutes for the syrupy aroma of peanut butter cookies to fill the whole trailer.Success.I spent three hours making a dozen cookies, determined to show my future husband how much I loved him. While they baked, I imagined handing one to George as we listened to his album. His chocolaty brown eyes would widen when he took his first bite. A single tear would roll down his cheek as he discovered the ring I had hidden inside. “Yes,” he’d whisper, and I’d sigh, hoping he didn’t want us to live in London.When the cookies cooled, I put them in two brown paper lunch bags and headed to the playground at the center of the trailer park. I charged a quarter each and sold out in minutes. I was in business! It took me just two weeks to save up the $10 I needed to buy the cassette that would surely lead me toward wedded bliss.Of course, George dashed my dreams a few years later when he casually revealed in an interview that he was gay. Heartbroken, I listened to his hit single “Freedom” with fresh ears, unable to wrap my mind around having to find someone new to spend my life with. (Though at least now I wouldn’t have to feel so guilty about the feelings I was developing for Johnny Depp.)As for my dad, I've seen him just a handful of times since the three months my brother and I spent with him in that trailer. My mother flew us back to her home in Houston shortly after he told her he couldn’t pay child support while we lived with him. But he did manage to pass on some decent advice: If you want something, go out and get it. Even if that something is an internationally acclaimed rock star who’s just not that into you.I thought I had lost out when my father and George Michael fell out of my life. It took me until my mid-30s to realize that my true love had been there with me all along, silently waiting for acknowledgement.In the kitchen, I lose track of time. I get goose bumps when I fall for a new dish. Creating something from nothing still feels like magic to me. Cooking has given me a career, a purpose, and a family of fellow chefs who are as head over heels for the art form as I am.With the exception of adding a little brown sugar to the party, I still use the same recipe for peanut butter cookies. And I can’t help but smile every time I make a batch. Mixing the dough reminds me of the moment I first fell in love—with cooking. My father and George Michael don’t know what they’ve missed.Explore Bon AppétitCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-13", "author": ["Condé Nast", "Monti Carlo"]}