{"id": "a0a3f899e24c9d0e95be19f9a8a0af88", "url": "https://www.bonappetit.com/story/anchovies-are-the-secret-ingredient", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Cooking With Anchovies - How to Make So Many Recipes Better By Adding Anchovies  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking95% of the Time, Anchovies are the Secret IngredientGuess the cat's out of the bag.By Sarah JampelNovember 19, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl Jones FacebookTwitterEmailWhen Sohla El-Waylly was brainstorming ways to make her Fideos with Chicken Thighs and Kale generally better—and specifically, meatier, richer, and more complex—it didn't take her more than three minutes to land on anchovies. The little oil-cured fish (in this case, there are four of them) dissolve into the mixture of onion, garlic, and tomato paste, providing the salty, savory backbone that the dish had previously been missing. And once you start to look carefully, you'll notice just how many recipes the food editors at BA are sneaking anchovies into.Not the type of eater who's going to fan out anchovies over a piece of garlic-rubbed toast and call it dinner? Not a problem! I promise that you won't know they're there—until they're not, that is. When you're cooking anchovies, they don't taste fishy. Recipes often call for cooking anchovies until they \"melt,\" i.e. disappear into the fat: They imbue the finished product with a jolt of umami—a why's-this-so-good-deliciousness—that doesn't taste at all \"like the sea.\"As a somewhat-lapsed vegetarian (fish, sometimes), the revelation that anchovies could improve so many sauces and dressings without making them taste fish-funky led to my dietary demise. (It's also the reason I'll never dare taste pancetta, lest I risk opening another wormhole!) Once I saw how anchovies took tomato sauce from sweet and acidic to bold and balanced (in this Butternut Squash Parmesan and Butter-Roasted Tomato Sauce, for example), I was, ahem, hooked.Sizzle an anchovy in oil before wilting down a big pile of greens (bonus points if you add beans) or add a couple to the pot after you've sautéed the vegetables for a fridge-clean-out soup, or fry a few with garlic and walnuts and use that as a base for a spicy red pesto.Now that you know the secret, experiment! Anchovies pair well with broccoli, hardy greens like kale and chard, briny things like olives and capers, and lots and lots of Parmesan. If you're an anchovy amateur, start with fewer than the recipe suggests. I’m pretty sure you’ll work your way up.Get the recipe:Fideos With Chicken Thighs and KaleWith a crispy, toasted top hiding saucy, tomato-y noodles, this one-skillet broken spaghetti dish is anything but one-note.View RecipeExplore Bon AppétitAnchovyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Sarah Jampel"]}