{"id": "a0c2dcb8ac7254829a613e04ce1476f4", "url": "https://www.bonappetit.com/story/okanagan-valley", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "If You Like Wine and Beautiful Views, You Should Probably Go to the Okanagan Valley | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIf You Like Wine and Beautiful Views, You Should Probably Go to the Okanagan ValleyWith 185 wineries and a crystal clear lake smack dab in the middle of the place, it’s easy to see why the Okanagan is a destination worth seeking out.By Emily SchultzNovember 7, 2019FacebookTwitterEmailJulian CousinsFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.If you ask me how I find cool new restaurants or the latest bottle of wine you should be drinking, I’d be lying if I didn’t say Instagram. While some people spend their time on beauty tutorials or dog videos, I’ll go down a deep rabbit hole of restaurants, wine shops, and boutiques until I’m practically booking a trip to a new city 15 clicks past the explore page.That’s exactly how I found myself on a flight to Kelowna, British Columbia, my Instagram-curated home base for exploring the little-known (in the U.S., anyways) wine region of the Okanagan Valley. After 30 minutes of double tapping and scrolling through people and places in Vancouver, I landed on Juice Bar—a natural wine bar that also serves pizza and feels like the kind of place every BA editor would spend their weekends. I whizzed past natural wines I drink in Brooklyn all the time but paused when I started seeing unfamiliar ones—longneck Rieslings with amber-hued wines labeled “Scout”; cloudy bubbles in a mysterious bottle; red-orange vermouth that was far from Spanish—it was all from the Okanagan. Add in a google image search promising lush mountains and sunsets that look like a van Gogh painting over sparkling turquoise lakes, and I was ready to pack up my wine-tasting notebook and hit the road.Grapevines for days in the Okanagan Valley.\nPhoto by Julian CousinsSettling into seat 2E for my 45-minute flight from Seattle, I attempted to crack open a book. But my neighbor in 2F had other plans. A BC native, he was thrilled to hear it was going to be my first time there and pointed my attention outside the window the entire flight as we cascaded over those mountaintops, and wispy clouds revealed blue-green bodies of water for miles–er, kilometers—below us.If it hadn’t all been so beautiful, and if he hadn’t been so genuinely excited, it may have been annoying. But I quickly found out that this was the BC way. Locals are incredibly proud of the natural beauty, the bounty of juicy peaches and cherries that’ll stain your fingers deep red, and wineries as far as the eye can see.The lakes in the Okanagan Valley moderate temperatures, meaning nights in the summer are cool and winters are less harsh than other regions of Canada. The snow that does fall acts as an insulate to the vines in the winter, preventing lots of winter damage. During the growing season, when the days are warm and the nights are cool, the vines undergo photosynthesis during the sunnier hours of the day, producing sugar that affects how much alcohol and body the resulting wine has. At night, when it’s cooler, that rapid photosynthesis doesn’t happen. This natural temperature control is what allows the Okanagan to produce its characteristic high-acid wines.Grapes ready to be crushed.\nPHOTO BY JULIAN COUSINSBecause the terroir shifts so drastically from town to town in the Okanagan, getting to visit feels like taking a trip to Bordeaux, the Finger Lakes, Tuscany, and even Georgia (the country) all at once. With 185 licensed grape wineries spread out over four [FC] distinct microclimates, all producing their own interesting wines, I had to narrow down my must-see list somehow. So I decided to visit only places making natural wines, which appeal to both my taste buds and my sensibilities. To me, natural wines are some of the most exciting bottles being made in the world right now. While the Okanagan is traditionally known for conventional winemaking, I met producers who are making a conscious effort to undo the ways of conventional winemaking’s past. You can see, feel, and taste the passion they have for this process, whether it’s in a tannic skin-contact white that grips your tongue or a light-bodied red that feels like the winemaker is tossing a ripe berry right into your mouth.No TSA lines? Blasting Stevie Nicks on the rental-car radio as you drive past crystal clear lakes? An incredibly dynamic range of grapes and natural wines to taste my way through? This trip certainly lived up to my expectations and then some. As I discovered during my visit, the reason I had never come across any Okanagan wines in Juice Bar–type spots in New York is because it’s difficult to export them to the U.S., and each Okanagan producer makes only a small amount that mostly gets distributed to Vancouver and Calgary—in order to taste them, you have to go to the source. If that fact (plus all the Okanagan pics on my Instagram feed) has you ready to book a trip yourself, here are the five wineries you need on your itinerary.5 Must-Visit Natural Wineries in British Columbia’s Okanagan ValleyJay Drysdale and Wendy Rose specialize in sparkling wine at Bella.\nPhoto by Julian CousinsBellaWhen I was scheduling my visits to wineries, basically everyone’s first question was, “You’re going to Bella, right?” After hearing co-owners and married couple Jay Drysdale and Wendy Rose’s story, I’m so glad I did. For sparkling-wine-heads, this is your place. And even if you only drink bubbles during a celebration, being at Bella feels like you’re inside the mind of a scientist, where the control group is a cluster of deep purple Gamay grapes and the experimental group is to decide which method of sparkling winemaking to use.They practice three different styles of sparkling winemaking, including the méthode ancestrale or pétillant-naturel (a.k.a. pét-nat), in which a semi-sparkling wine is bottled before the first fermentation is complete, resulting in lighter bubbles; méthode traditionelle, the two-step bottle fermentation process traditionally used to make Champagne; and trad-nat, a term Jay and Wendy made up to show that you can make beautiful and electric traditional method sparkling wine but without adding anything to the actual wine.When you line up their portfolio, it looks like cotton-candy rainbow-bright pinks and raspberry reds and soft yellows. Make sure to try the Vineyard Series sparkling rosé, which showcases the high-acid grapes of the Okanagan and tastes like a Paloma by the pool accompanied by a fresh tomato salad. Or there’s the Gamay trad-nat, which looks like a lip stain Glossier is about to launch and tastes like the grown-up version of Capri Sun. (You know that feeling of victory when you’d successfully poke the flimsy straw into the silver pack and take a refreshing sip after playing on the playground all day? Like that, but 21+.) Book a private tasting on Thursday or Friday, or drive up the Naramata Bench on Saturday or Sunday when their tasting room is open, to learn about sparkling wine from two people who have dedicated their lives to the bubbles.4320 Gulch Rd., Naramata, British Columbia V0H 1N1; appointment-only after August.Tantalus is a LEED-certified vineyard.\nPHOTO BY JULIAN COUSINSTantalusTake a drive about 20 minutes east from downtown Kelowna and you’ll find yourself on a gravel driveway leading into Tantalus Vineyards. It’s actually purposefully left unpaved to keep the temperatures surrounding the tasting room and cellar cooler. That’s because Tantalus is a LEED-certified vineyard that puts as much emphasis on reducing its energy emissions, carbon footprint, and wastewater as it does on making delicious wines (with a wastewater management plant for the entire winery and tasting room to prove it).For the people who drink natural wine because of the environmental impact, come nerd out with David Paterson, the general manager. He’ll point out the wastewater management plant when you stroll through the vineyard, which is open for tours every day from May to October. You’ll walk through the 72-acre vineyard that has Riesling planted from 1978, but you’ll also see the new grapes that Stephanie Mosley and Paterson planted when they took over the vineyards in 2005, like Chardonnay, Pinot Meunier, Pinot Noir, and Syrah. Taste through all of their wines, but make sure you buy a bottle of the old-vine Riesling to bring home with you for later. It’s peachy and tart and has a mouthfeel that glides across your tongue—kind of like eating gummy peach rings in your favorite silk robe.1670 DeHart Rd., Kelowna, British Columbia V1W 4N6; open daily, 10 a.m.-6 p.m. from May to October. Otherwise, seasonal hours apply.Echo BayAs soon as you get to Echo Bay, you’ll feel a sense of familial warmth that radiates off the property—like you’ve been to Echo Bay a million times before. Then you’ll see a dog or two, a flock of chickens, and winemaker Kelsey Rufiange probably waving you down with a bottle in one hand and two glasses in the other. Kelsey’s grandfather bought the property in the 1960s as a family vacation home, and seven years ago the Rufianges turned it into a vineyard, planting Merlot, Cabernet Franc, Cabernet Sauvignon, Malbec, Carménère, Petit Verdot, and Sangiovese vines. Because Echo Bay is at the southernmost point of Skaha Lake, temperatures are much hotter than, say, at Tantalus Vineyards, which is why they can plant these Bordeaux-style grapes. (Like I said before, traveling around Lake Okanagan is like traveling to 10 different terroirs in one day.) As in Bordeaux, the soil here is sandy/silty loam and temperatures can get up to 90 degrees Fahrenheit during the summer.As you taste through these spicy, mouth-coating reds, ask Kelsey about her side project, Else Wines, which are 100 percent natural and 100 percent sourced from the Else Wines are zero-addition wines that are sourced from growers around Okanagan. Her first vintage went to market this past year, a Pinot Gris–Riesling pét-nat. It’s so alive thanks to high acid, but brings you right back down to earth with notes of coconut and peach pits. She also has a skin-contact Muscat that’s like finishing a whole box of Mike & Ike’s in an air-conditioned movie theater (which you can find by the glass at Micro, a tapas joint in downtown Kelowna, if you can’t make it to the vineyard). Kelsey’s wines prove that the Okanagan is a place to watch, and while Bordeaux styles still reign supreme in this area of the valley, there are people that aren’t afraid to take risks and try something new.224 Eastside Rd., Okanagan Falls, British Columbia V0H 1R5; call for a private appointment, +1 250-490-6228. InstagramThe grapes for the wines at TH Wines come from the southern part of the valley.\nPHOTO BY JULIAN COUSINSTH WinesOn the west side of the lake, you’ll find Summerland, which is the town that Tyler Harlton makes his wine in. He’ll probably tell you it’s actually “Carstentown.” (That’s because he makes his wine in a garage surrounded by a woodworking shop and a newly opened brewery, all owned by his landlord Carsten.) Harlton sources his sustainably grown grapes from South Okanagan, which is at the very bottom of the Okanagan Valley. It’s hot during the day and cool at night, which produces the iconic high-acid grapes known to BC. Come by the winery to hang out with Tyler, who will casually give you a homemade peach Viognier ice pop, an assortment of cheese and crackers, and a tour of the facility.Just like their maker, Tyler’s wines feel effortlessly chill, from the slightly effervescent Riesling to a Pinot Noir which on the nose, is a ripe blackberry. And if it’s been released by the time you make it out there, snag a bottle of his new Malbec. I’m not normally a fan of the variety, but everything I thought I knew about Malbec, the weighty grape that normally dries my mouth out faster than a peanut butter sandwich, was turned upside down when I tried Tyler’s take on it. The rush of fresh raspberries up front is lifted by a bit of volatile acidity, and the whole peppercorn notes at the end remind you that, yeah, this is still a Malbec. And when you talk to every other person in the Okanagan making thoughtful wines, you won’t be surprised to hear that they’ve worked with or for Tyler in some capacity. He has a strong commitment to British Columbia, and just because he’s not rooted in a vineyard doesn’t mean this doesn’t come through in everything he does.#1-9576 Cedar Avenue, Summerland, British Columbia, V0H 1Z2; open daily, 11 a.m.–5 p.m. from Easter to mid-October.Bottles from Keenan's side project that he makes at Sage Hills Vineyard.\nPhoto by Julian CousinsSage HillsTen minutes from TH Wines is Sage Hills, an eight-acre vineyard run by Keenan Thrussell and Zoë Jacoe. The Sage Hills story is similar to Else Wines, in that Keenan’s father bought the vineyard later in life, but had been farming organically since day one. As you sip their skin-contact Pinot Gris and look through the sage brush surrounding the vineyard, you’ll get a view of the entire property. The tasting room is open every day, but also schedule some time with vineyard manager Keenan and vineyard assistant Zoë, both of whom are so passionate about the farming they do.While Keenan manages the vineyard and makes all of the wines, he started sourcing grapes from other vineyards for his own side project that’s 100 percent natural, and he released his first vintage last year. He uses the facilities at Sage Hills to press, ferment, and age this side project, simply called Keenan, which if you’re lucky, you can taste while you’re there too. (Just ask, he’s very nice!) He has a skin-contact Sauvignon Blanc that’s like peeling open a fresh tangerine, and it made me scour the internet for adjectives similar to thrilling. (I settled on rip-roaring and bracing due to the volatile acidity that makes your mouth water for more.) Finding 100 percent organic fruit isn’t an easy task, and Keenan has become a springboard for other winemakers in the area to bounce ideas off of. In a wine region with a lot of overlap, Keenan is pushing the limits on what Canadian wine can and should be. It’s working.18555 Matsu Dr., Summerland, British Columbia; open daily, 11 a.m.–5 p.m. from April 1 to December 1.We'll take one of each homemade loaf from Sprout.\nPhoto by Julian CousinsYou’re going to need to sleep and eat while you’re there too, right?Keeping your home base on the trip in Kelowna means you get to experience all of the produce and wine in the Okanagan from the best chefs there. I’d suggest renting an Airbnb in downtown Kelowna, mostly so you can start your mornings at Sprout - Bread and Coffee every day. This bright, airy café makes its own bread, so get one of the toasts and an Americano while admiring the floral arrangements and doing what people are supposed to do on vacation—relaxing.You’ll also be a 10-minute drive to Frankie, We Salute You!, a new vegetarian restaurant with not-trying-too-hard interior design and lots of local ingredients on the menu. Lucky for you that includes local vermouth, as Frankie’s carries Shawn Dalton’s new vermouth project, Marrow Vermouth. He’s currently making the 18 percent ABV fortified wine in the Similkameen Valley, two hours south of Kelowna, at Scout Vineyard. And if you want to do something other than drink wine all day, we’re probably not friends, but I’d suggest taking a dip in Lake Okanagan. You can get in the water right there in downtown Kelowna, and if that’s not your style, there are boat tours as well. If you’re heading to the Okanagan in the winter, you’re probably going to ski, in which case you should head to Big White. I’ll leave that to you, as I’m much more of a summer girl and will probably be too busy planning my next vacation I stumbled on via Instagram anyways.Want more on Canada? Right this way!Explore Bon AppétitCanadaWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Emily Schultz"]}