{"id": "a0c8e654a0feeb61aca2c0ebb069a66f", "url": "https://www.bonappetit.com/story/how-to-chill-wine-science", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "The Best Way to Chill Wine, According to Science | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Way to Chill Wine, According to ScienceWe asked two physicists—what's the best method for chilling wine?By Mari UyeharaMarch 15, 2019FacebookTwitterEmailStephen LewisFacebookTwitterEmailIf you poke around certain corners of the Internet, you’ll find all sorts of tricks for speeding up the wine-chilling process. One theory prescribes wrapping a bottle of wine in a wet towel before popping it in the freezer. Another postulates that bottles will chill more quickly stored horizontally than vertically—because “thermodynamics.” As someone who has neither a wine cellar nor a wine refrigerator, but drinks an inordinate amount of wine, these seem like useful bits of information...if true. To find out if these methods were actual scientific strategies for enthusiastic drinkers with poor planning skills or total cocktail party bullshit, I tracked down two patient physicists: Barnard College’s Tim Halpin-Healy and Greg Blonder, a professor of design and product engineering at Boston University. And I also checked in with Belinda Chang, an award-winning sommelier and former director of wine at Maple & Ash in Chicago.Danny KimWrapping the Bottle in a Wet Dish TowelA bottle of room temperature (70°F) wine will take about 30 minutes to cool to 50°F in a -15°F freezer. The thinking behind wrapping it in a wet towel is that cooling may be sped up by water evaporation, like how sweating helps us humans cool down. Blonder, who explores cooking science questions for his blog Genuine Ideas, actually tested the method a few years ago. As it turns out, wrapping a bottle with a wet towel only works in ideal circumstances, like in a commercial blast freezer with brisk circulating air. In a home freezer—stuffed with three kinds of ice cream, half-filled ice trays, and a bunch of other mysterious foil-wrapped things—the wet towel wrapped around a bottle of wine will actually insulate it because the air is stagnant. Meaning that the towel-wrapped bottle will take even longer to cool than that regular ol’ dry bottle of wine in the freezer.Science Says: Skip this one.Chilling a Bottle of Wine Horizontally Instead of Vertically“It’s a challenging problem for senior college-level physics,” said Halpin-Healy about the theory that you can chill a bottle on its side more quickly than one standing up. He dug up a single theoretical engineering paper—surprisingly not many scientists have devoted themselves to the age-old conundrum of “shit, we forgot to chill the wine”—that ran an experiment with cooling wine bottles at different orientations and calculated that a horizontal bottle would chill 50% faster than a vertical one.However, those results depend on a number of factors, including a controlled environment aka not your home kitchen. Halpin-Healy explained the underlying science, including the wine bottle’s aspect ratio and something called the Rayleigh Number, to me. Bottom line is that “horizontal wins out over vertical,” but it may not make a huge difference in the real world. Plus, most freezers can only fit horizontal bottles anyway. “Best to use a supercomputer to do the calculation and enjoy a fine Burgundy while it's chewing on the numbers,” said Halpin-Healy. Fair enough.Science says: It can’t hurt.Adding Frozen Objects to a Glass of WineOne of the recommendations floating around the Web is keeping frozen grapes or special wine chilling cubes in your freezer for dropping into a glass of warm wine without dilution. This technically works, according to Blonder and, you know, anyone who’s used an ice cube. But practically speaking, it requires more forethought and investment than, say, popping a bottle of wine in the refrigerator at the get-go (the cubes takes about 2-3 hours to chill in the freezer, longer than it takes to chill a bottle). Not to mention the fact that you have to navigate either frozen grapes or clunky metal cubes each time you take a sip. Has anyone chipped a tooth on a wine-chilling cube? We have not studied this scientifically.Science Says: This works, but seems slightly ridiculous.Submerging the Wine in Ice WaterThe recommendation that both Halpin-Healy and Blonder put forth also happens to be the one that sommeliers use at restaurants: sticking a bottle of wine in ice water. Water is a more efficient thermal conductor than air, at about 25 times the rate.Danny KimThere is one thing to keep in mind with this method. “People, somms included, always forget to immerse bottles fully,” Chang writes, noting that most champagne sinks and ice buckets are too short and small. “So it’s almost frozen on the bottom and warm on the top. The first glass poured is warm.”She recommends filling a container about two-thirds with ice, then adding some water (leaving room at the top), and tossing in a handful of Kosher salt, which lowers the water’s freezing point (science), on top. You can swaddle the bottle in plastic wrap to protect the label—another sommelier trick. Still, Blonder says you’ll probably need half of a one-pound box of kosher salt to drop the temperature from the 30s to the 10s, so he recommends skipping the salt and just using ice water in a lobster pot. The key either way is lots of ice. Without salt, it should still take only about 15 minutes.Science Says: This is the fastest method for cooling a bottle of wine quickly, but also a bit of a rigmarole.Removing the Wine from the BottleOne of the reasons that it takes a room-temperature bottle of wine so long to cool down is the actual bottle. “Glass is a terrible thermoconductor,” said Blonder, noting that the bottle can be about 40% of the weight. “It takes a lot to cool down.” One way around that is to pour the actual wine in a Ziploc bag, seal it, and drop that bag into cold ice water—a single glass in a Ziploc bag will take about 2 minutes to reach 50°F.Another is to pour the wine into wine glasses, cover them with plastic wrap to protect them from takeout odors, and pop them in the refrigerator. The wine glasses are much thinner and smaller than a bottle and will chill more quickly, about 30 minutes—as opposed to about 90 minutes for a whole bottle in a refrigerator at about 34°F. This all depends, of course, on the temperature of the wine to begin with (an 80°F bottle will take an additional 30 minutes more than a 70°F) and whether you open the door to get cheese or whatever else. The advantage with the refrigerator is that you’re bringing the wine closer to its desired temperature. When you’re using ice water or a freezer for bottles, you’re playing with extreme temperatures, over-chilling the exterior so that it will continue to chill the warm interior once you take it out of the freezer. (It’s similar to the carryover effect with a rib roast, which continues to cook once it’s removed from the oven.)Science Says: This method is about as fast as or faster than putting a bottle of wine in the freezer.TL;DRSo, what should you do with your room-temperature bottle of wine? It all depends on your circumstances. If you’re desperate for a drink and are home alone watching Netflix in your underwear, you can chill a single glass of wine in a sealed plastic bag in 2 minutes by immersing it in ice water. If you’re desperate to serve guests and have a lot of ice to spare, submerge your bottle in a large container of ice water—emphasis on the ice—for 10-15 minutes. If you can hold out for 20-30 minutes, you can either put the bottle in the freezer or pour a few glasses, cover them, and put them in the refrigerator.As anyone who has forgotten a bottle in the freezer knows, you can chill a bottle down too much. And you don’t need to be a scientist to figure out that a timer is a smart move in those circumstances. It’s not just the danger of exploding bottles either, the flavors and aromas will be muted at lower temperatures. While many Americans like whites and sparkling wines in the 40s and reds slightly warmer, Chang says, “I like my first taste of everything to be cellar temp, 55°F. That reveals the most about the wine.” One last way to speed up your wine chilling process—don’t aim to drink it so damn cold. You want to taste it, after all.Or go all out and turn that frozen wine into frosé:Explore Bon AppétitTechnologyCooking TipsBasicallyWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-23", "author": ["Condé Nast", "Mari Uyehara"]}