{"id": "a0c9a7a025d564a92a6b94705a8e0b26", "url": "https://www.bonappetit.com/story/broccolini-cheesesteak", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "This Vegetarian Cheesesteak Is Green, Gooey, and Just The Right Amount of Indulgent | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Broccolini Cheesesteak Is the Sandwich You NEED Right NowPhilly chef Mike Solomonov made a vegetarian cheesesteak that we can all get behind.By Mike SolomonovJanuary 30, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Kat Boytsova, Prop Styling by Emily EisenFacebookTwitterEmailIn Philadelphia, cheesesteaks are practically a religion. That’s why chef Mike Solomonov, who owns a number of beloved restaurants in Philadelphia, including Zahav and Dizengoff, used it as a starting point for this vegetarian cheesesteak. His version is a gooey, indulgent sandwich made almost entirely of vegetables (no fake meat allowed!). You can find it at his homestyle luncheonette, Rooster Soup Co., and, now, you can make a just-slightly-tweaked version at home. Here, Solomonov tells us all about what inspired him to create a healthyish version of his city's favorite comfort food.I don’t remember how the broccolini cheesesteak came about, exactly, but we are a pretty vegetable-forward company (with the exception of Federal Donuts). And while vegetables are important to us, we are also aware that we need to satisfy people. At Rooster Soup Co., we wanted to come up with a sandwich that wouldn’t be so high-brow as to alienate our customers, but still embodied that vegetable mentality. In Philadelphia, cheesesteaks are always at the top of the sandwich echelon. We would never try to make a Philly cheesesteak—trying to compete with that sandwich is not a smart thing to do. Also—and I’m going to get kicked out of Philly for saying this—I don’t like most of the cheesesteaks I’ve tried here! So the broccolini cheesesteak is our way of paying homage in the form of a delicious, healthier sandwich.For the broccolini, the main component, we want it to really feel indulgent. So we don’t just blanch or griddle it, we braise it with onions, garlic, spices, wine, and tomato paste so it gets this super meaty texture and flavor to it. For people making this at home, I still recommend braising the veggies, but roasting is an option, too. Then there’s the sharp provolone. We use it because the sandwich needs that little bit of sharpness, and provolone is nostalgic and delicious and not too refined. Also, melting sharp provolone on top of anything is always the right move. I love the romesco that goes into it because it’s a little peppery, a little spicy and a little creamy. Plus, I’m terrified of mayonnaise, so I think the romesco is a way better condiment. We serve the sandwich on a small hoagie roll from Ba Le Bakery. Their rolls are light, which you need them to be to adhere to the filling. I think using any fancier bread is a step in the wrong direction.The sandwich has the gooeyness and greasiness that you would expect in a cheesesteak. It’s green, but not so green as to be like health food. When you eat it, you get the same sort of joy that you get when you eat a good cheesesteak. You get that wet, French dip effect on the roll, then the heady onions. Every bite is stimulating and nostalgic.It’s an everyday sandwich, something you can eat more than once a week and not feel like a piece of shit afterward, in the style of something that people from Philly know and love. It’s been on the menu for nine months, and I’m still eating it a few times a week.– As told to Priya KrishnaMake a broccolini cheesesteak already:Broccolini CheesesteaksA healthyish take on the classic Philly cheesesteak, these party-ready sandwiches are packed with roasted broccolini, a tangy romesco sauce, and of course, lots of cheese. View RecipeExplore Bon AppétitHealthyishBroccoliniSandwichSuper BowlVegetarianVegetablePhiladelphiaRead Morerecipes55 Comforting Vegetarian Recipes That Are Getting Us Through WinterGallery55 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Mike Solomonov"]}