{"id": "a0dfdbd0401cf83ff2030ee8efeced1d", "url": "https://www.bonappetit.com/story/jenny-feldt-restaurant-diary-2", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "I Can Do More For My Community as a Brand Ambassador Than as a Bartender | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Can Do More For My Community as a Brand Ambassador Than as a BartenderIn her second Restaurant Diary entry, Jenny Feldt explains how she’s harnessing the reach and resources she has at Grey Goose to support restaurant and bar industry workers.By Jenny Feldt, as told to Elsie YangMarch 17, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: farmer Kristyn Leach, wine educator Kyla Peal, line cook Peter Steckler, and bartender turned brand ambassador Jenny Feldt. Here Feldt explains how restaurants and bars are struggling right now and how she’s able to support them as a brand ambassador. Read her first diary entry here.For the most part I’ve been extremely fortunate in my role as a brand ambassador for Grey Goose. After working as a beverage consultant in D.C., I came back to Atlanta in January to resume my role (I had been furloughed earlier in the pandemic). As a brand ambassador I’m responsible for sharing the story behind Grey Goose with bartenders and vodka enthusiasts, as well as supporting them through different types of educational programming. Basically, that means I am an expert on everything Grey Goose, from production to marketing to cocktails, and the vodka category as a whole.The pandemic has moved most of what I do to virtual platforms, but sometimes I’m asked to host certain programs onsite at restaurants and bars. During a global pandemic, as you can imagine, this can be challenging. Some businesses might not be taking safety precautions, like enforcing social distancing and mask wearing. So I’ve been relying on my own safety guidelines. I try to call ahead everywhere I go to understand what precautions are being taken, and I get tested every Monday even if I’m not feeling sick. Grey Goose also offers daily check-ins to ensure the safety of everyone on our team.As the weather has gotten warmer here in Atlanta, I’ve definitely seen businesses start to pick up. Atlanta just hosted the NBA All-Star Game, which brought a lot of out-of-towners into the city. A number of nightclubs and bars held events to full capacity (Editor’s note: The state currently allows up to 50 people or a 35 percent indoor capacity at clubs and bars). I think it's really hard for some struggling businesses to turn down customers at this time, but this puts hospitality workers who are exposed to this uptick in business at risk. I think it’s crucial that these workers be able to access the COVID vaccine, and I’m certainly hoping to get it as soon as I’m eligible. Georgia hasn’t announced when restaurant industry workers can expect to be vaccinated, but hopefully that’s just around the corner.Photo by Jose PereiroThe dining scene in D.C.hasn’t at all reached the same level as Atlanta—it’s like night and day. When I was in town a couple weeks ago, I was able to stop by Prost, where I used to work, and a few other restaurants. Even though I was thrilled to see the dining rooms open again and the team doing well, there is definitely not the same level of comfort for dining inside as I’ve seen in Atlanta. That means that restaurants in D.C. really are depending on the full functionality of their outdoor dining spaces, as well as continuing to push to-go sales.I have so much respect for hospitality workers—especially bar owners—at this time. My family at Prost and a multitude of friends throughout the country are giving it all they've got right now. Now that I’m working for Grey Goose again, I have the opportunity to support different bars and restaurants as they try to survive in this unpredictable time. I think that my current role allows me the ability to help the industry on a broader scale. As a beverage consultant, at times, I could be very restricted by the four walls of any particular restaurant or scenario. Though I was lucky at Prost to have a lot of flexibility, that’s not always the case.My team and I have created a number of different programs and trainings to help industry workers get back on their feet. We’re holding informational sessions on how to gain access to financial support; we bring in financial advisors to share budgeting advice or have live drop-in sessions for folks to get their finance-related questions answered. Historically, in the restaurant industry it hasn’t been easy or straightforward to gain access to this kind of information. Throw in a global pandemic, and a lot of people were and have continued to be left in the dark on how or where to get their next paycheck. Our team has worked hard to create a roadmap in order to bridge the gap and make the craziness of the pandemic a little more manageable for people working in the restaurant industry. Anything that can help employees get back on their feet and businesses keep their doors open is really the main objective. To that end we have also compiled and distributed resources on a range of topics for bartenders to read on their own. As a team we are constantly trying to remain as up to date on COVID-related support as possible, so industry workers can always come to us with questions.Other initiatives have targeted creating outlets for mental health and overall wellness, with activities such as virtual yoga classes, outdoor meditation classes, virtual paint-and-sips, as well partnering with a local community garden to donate plots of land for bartenders to grow their own product. So far folks who are able to attend these different sessions are excited to learn new things. In some ways doing everything virtually has actually allowed for more flexibility and access to information.We are all dealing with trauma in a multitude of different ways, and it is not only important but necessary to find a good outlet and support system. I hope to continue to create these opportunities for the hospitality community however I can, whether that involves an in-depth vodka class, a financial bootcamp, or just a virtual check-in with a martini in hand.Explore Bon AppétitRestaurant DiariesFirst PersonRestaurantsBarsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-17", "author": ["Condé Nast", "Jenny Feldt", "As Told To Elsie Yang"]}