{"id": "a0eb50b5d12ff626e2847d3c41249e69", "url": "https://www.bonappetit.com/recipe/cold-shrimp-in-dill-cream-sauce", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Cold Shrimp in Dill Cream Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueCold Shrimp in Dill Cream SauceBy Ned BaldwinMay 25, 20214.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis is a fantastic make-ahead recipe, ideal for a picnic or tomorrow’s lazy lunch. The key to perfect shrimp is steeping them in hot water, rather than boiling them, which ensures that they’re tender and juicy every time. And while this dill-cream sauce—inspired by my mom’s Seattle Junior League cookbook—is a sure winner, these sprightly shrimp will shine no matter how you want to dress them up. —Ned Baldwin, Houseman, NYC This recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$13 At AmazonVegetable Peeler$10 At AmazonLarge Pot$55 At AmazonSlotted Spoon$13 $10 At AmazonLarge Bowl$18 At AmazonIngredients4 Servings1lemon, zest removed with a vegetable peeler, halved, divided1cup white wine vinegar or unseasoned rice vinegar3Tbsp. sugar3Tbsp. Diamond Crystal or 1 Tbsp. plus 1½ tsp. Morton kosher salt, plus more1¼lb. jumbo shrimp, peeled, deveined2celery stalks, chopped¾cup heavy cream3Tbsp. finely chopped dill, plus more for serving1head of Boston, Bibb, or Little Gem lettuce, leaves separatedPreparationStep 1Combine lemon zest, vinegar, sugar, 3 Tbsp. Diamond Crystal or 1 Tbsp. plus 1½ tsp. Morton kosher salt, and 6 cups water in a large pot; squeeze in juice from a lemon half. Bring to a rolling boil. Remove pot from heat and add shrimp. Let sit until opaque throughout (slice a shrimp in half to check), about 3 minutes.Step 2Using a slotted spoon, transfer shrimp to a plate (leave lemon zest behind in pot and discard). Chill in freezer until cool, about 10 minutes.Step 3Combine shrimp, celery, cream, and 3 Tbsp. dill in a large bowl; squeeze in juice from remaining lemon half and toss to combine. Season with salt.Step 4Arrange lettuce on a platter and spoon shrimp mixture over; top with more dill.How would you rate Cold Shrimp in Dill Cream Sauce?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleSarah:  In case you haven't been told by now - what the recipe calls for is 3 Tb Diamond Crystal SALT or 1 Tb plus 1 1/2 tsp Morton Kosher salt.  Carol YBoise, ID11/2/2021Fresh and fast! The first time, I followed the recipe exactly. It was fabulous and both of our guests asked for the recipe.  The second time, I thawed frozen shrimp, and really, I will do that in the future when not making this for guests.  Combining the simple dressing. ingredients the days before really helped blend the flavors.Home CookSt. Paul, MN8/7/2021I thought this was simple and delicious. Since there are so few ingredients, don’t skip on quality. We threw in some halved cherry tomatoes and a little extra lemon juice. Perfect for nights you don’t feel like cooking, and thawed raw frozen shrimp worked great.SarahTakoma Park, MD7/8/2021I agree that this was meh. We added a sprinkling of Tobacco sauce which improved it. However,this was really fast and easy. Big plus. Would love to hear how others improved on the recipe as written. Marilyn 6/26/2021@Donna G. and anyone else who finds the wording confusing - the lemon itself is what is being halved and divided (after the zest is removed from the whole thing), not the zest.AnonymousPhiladelphia6/22/2021what is table spoon of diamond crystal?\nDO you use fresh shrimps or frozen ?\nMine always turn out rubbery\nhavent tried recipe yet wait your answersSArah TrustNew Zealand6/21/2021Remarkably tasty, remarkably easy AnonymousPalm Harbor, FL6/20/2021Its a good way to cook shrimp.and the fresh dill is excellent in the cream.sauceGillianToronto Canada6/20/2021the recipe never mentions what to do with the other half of the lemon zest. I think I'll sliver it and add it to the cream sauce.Donna GNew York6/6/2021Good technique, I use to cook shelled, deveined shrimp 1-1/2 minutes.\n\nAlthough recipes calls for deveined shrimps as should always be, the photo attached, shrimps are undeveined. 😜Gina RamosNORTHERN VA6/6/2021This looked and sounded like the bomb and yet we found it lacking something.  Maybe some things.  So, you can't go wrong with all these ingredients; I mean, just look!  The boil for the shrimp did impart a nice tang to them.  But on the plate we realized the dill alone couldn't elevate this much above a \"meh.\"  So what does it need?  I'd say some degree of onion.  Maybe some wee tomatoes.  Some kind of acidity--you pick your source.  Your favorite vinegar in the cream sauce?  Anyway we thought it was bland although you can't not like a bunch of creamy shrimp.  If we make it again it'll include a significant amount of je ne sais quoi.  PaulTexas6/5/2021perfect summer lunch.  Best recipe for cooking shrimpAnonymousArlington, VA6/4/2021Delicious just as written. I’m going to use this technique for “boiling” shrimp from now on.  Barbara SFt Lauderdale, Fl6/2/2021can I use greek yogurt instead of the heavy cream?\nChelsea MomNYC NY6/2/2021Can I use fresh frozen shrimp with this recipe ? Thaw overnight and throw in boiling water for a few minutes ? BevLondon Ontario 5/31/2021Explore Bon AppétitShrimpShellfishSeafoodDillHerbs & SpicesLettuceLeafy GreensVegetableSummerQuickEasyWeeknight MealsMainGluten-FreeNut-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-21", "author": ["Condé Nast", "Ned Baldwin"]}