{"id": "a0faf2fdb04fb621764f8befe6f7cc67", "url": "https://www.bonappetit.com/story/how-to-grill-chicken-breasts", "year": 2021.0, "month": 7.0, "day": 5.0, "content": "How to Ensure Grilled Chicken Breasts Stay Moist | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Ensure Grilled Chicken Breasts Stay MoistSay no to stringy, dry white meat.By Antara SinhaJuly 30, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailIf grilling is already intimidating for you, working with an unforgiving, ultra-lean piece of meat like chicken breast can feel like an amplifier for any grilling-related anxiety. Quick-cooking—and quick to dry out on the grates—chicken breast is notorious for turning tough and stringy if you’re not careful. The good news: A couple of simple preventative measures taken along your grilled chicken journey can ensure juicy, succulent white meat every time. Follow our lead and pretty soon a humble chicken breast dish—like, say, this Grilled Chicken Breast with Tadka-ish Sauce— will be the star of your next summer cookout. Here’s what you need to know.Choose your cut wiselyWhile fattier chicken thighs can handle going skinless, when it comes to grilling chicken breasts, it’s skin-on, bone-in all the way. Not only is crispy, rendered skin delicious, it protects lean, delicate meat from drying out—especially in an open-fire cooking situation. And the bone underneath insulates the meat from the flames, allowing for more even distribution of heat. If you have access to a butcher, ask for skin-on, bone-in breasts, and if you’re looking at a supermarket selection, skin-on boneless is the next-best compromise, and most likely easier to track down.Watch the temperatureYou’ll want to account for carryover cooking, which is when food continues to cook even after it’s been removed from the heat source. While 165° is the internal temperature you want for chicken, remember that it’ll continue to cook as it’s resting—which means if you’re getting that reading while the meat is still on the grill it’s actually overcooked. Use an instant-read thermometer and pull your chicken off the grill at around 160°, then temp it again after it’s rested for a couple minutes and you’ll see the internal temperature climb to a safe 165°, saving yourself from tough, overcooked chicken.Speaking of resting...Don’t skip this step. Slicing into your chicken right off the grill means you’re likely to end up with most of the juices pooling on your cutting board. It can be tempting to dive in immediately, but waiting just five to 10 minutes to allow the juices to reabsorb into the meat makes an enormous difference. And when it comes time to serve, be sure to slice against the grain, which helps prevent stringiness.Sauces are your friendIf all else fails, a saucy dressing is a foolproof, speedy way to quickly add juiciness to your chicken after it’s finished cooking. Whether it’s a tadka-ish sauce with nigella seeds, zingy ginger-scallion-lemongrass sauce, funky-sweet fish sauce caramel, or a simple, tangy, garlicky Italian dressing, sauces and toppings will add layers of flavor and moisture to a cut of meat that is otherwise something of a blank canvas. If you cook your chicken breasts perfectly, these embellishments will make them truly memorable. If you don’t, well, a good sauce erases all sins.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-30", "author": ["Condé Nast", "Antara Sinha"]}