{"id": "a109907e86e42d8efe3ee668dd5b0929", "url": "https://www.bonappetit.com/story/astrological-dinner-parties", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "How to Throw the Perfect Dinner Party for Your Astrological Sign | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Throw the Perfect Dinner Party for Your Astrological SignCheese board? Sumptuous stew? It’s written in the stars, baby.By Lindsey PerkinsDecember 17, 2021FacebookTwitterEmailIllustration by Arsh RaziuddinFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you’re into astrology, you probably know which signs you’re most compatible with and whomst are your enemies. But do you know how to throw the best dinner party for your zodiac season? With guidance from veteran astrologer Caitlin Adams, who works with clients around the globe, that’s just what you’ll learn below. Whether you want to host a dreamy Pisces hang, throw a drama-laden Leo extravaganza, or go big on a Gemini get-together (and then change your mind the night of), use this guide to nail the vibe. From the menu written in your stars to the perfect playlist pairing, read on for the ideal dinner party blueprint for your sign.Aries, March 21 - April 19Vibes: Alright, Aries, we know you’re not the mellow type. Which is why your ideal dinner party is filled with scarlet, carmine, and crimson—all inspired by your ruling planet, Mars, and your, um, assertive personality. Create a visually striking monochrome scene with fiery red lighting; bountiful arrangements of roses, poppies, or dahlias; balloons (double points for helium); sunset-hued artworks; and these cognac-colored placemats. A natural project manager, you won’t have trouble coaxing your guests to arrive decked out in red, will you?Uashmama Essential Placemats$48 at Food52Menu: Bring the heat like it’s a board meeting, you ambitious ram you. Peppers, garlic, and radishes are all ruled by Aries, so let’s ease into the meal with a sweet and spicy antipasto salad before turning up the heat with these habanero-marinated pork chops. For dessert, keep things tingly with some spicy orange chocolate bark. And relieve any sweaty guests throughout dinner with a cooling Vinho Verde or a pale lager.Party starter: “With Aries, we need to think about self-expression, adventure, and impulse,” says Adams. Weave these themes into the evening with a good old round of truth or dare. You’re up first, Aries.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Taurus, April 20 - May 20Vibes: According to Adams, “pleasure, luxury, and generosity” are what you Venus-ruled bulls are all about. So tonight we’re creating a feel-good, bucolic atmosphere that appeals to all five of your well-nourished senses. Project an orange-hued sunset onto your wall for a warm, flattering glow. Choose sumptuous dishes that fill the room with rich, soothing smells. Play gentle music that envelopes guests in the here and now. And don’t forget to fill the table with colors and textures: sturdy flatware, funky glasses, and satisfying-to-the-touch napkins.Ripple Glass$25 at Coming Soon New YorkMenu: Channel your focused nature into pulling together a menu that’s crunchy, chewy, and creamy all at the same time. Start things off with a sweet-salty charred broccoli and fig salad. Follow it up with this miso and pancetta pasta that goes big on the umami notes. And finish the night with a decadent, red wine-glazed dark chocolate cake. Speaking of wine, we already know your bougie ass probably has a full-blown wine cellar. But if anyone can pull off dessert wine, it’s Taurans. Venus would be so proud.Party starter: Put guests’ olfactory senses to the test with a game of Guess That Spice. Choose a handful of spices from the kitchen and transfer them to little bowls. Have diners take a big sniff and ask them to, yup, guess that spice. (Winner gets the biggest slice of cake.)Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Gemini, May 21 - June 20Vibes: You’re constantly on the move, Gem, so it may come as a shock to everyone that you’ve sat still long enough to plan a dinner party. Damn the haters by showcasing your sunny side. Fill the room with big yellow flowers, candy jars brimming with Lemonheads, and turmeric-hued plateware. We know that a good gossip sesh is a forte of yours, Gemini, so drum up excitement via word of mouth and plan for a crowd.Fable Bamboo Dinnerware$148 at Food52Menu: We get it; you want it all. And the best way to have it all is by going in on a DIY buffet—filled with lots of portable appetizers, because who knows what room you’ll feel like hanging out in? Or if you even still like olives? Snacky foods, like chips and dips, spiced nuts, antipasto platters, cheesy hand pies, spinach tarts, and chocolate chunk cookies will keep the mood exciting. So would a big old bowl (or three) of punch. Party starter: Always the social butterfly, Adams explains, you’d love for a party to have 1,000 different things going on—so go wild. Have an area set up for charades, play telephone around the table, whip out your karaoke machine, and have at least one room at the ready for a dance party.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Cancer, June 21 - July 22Vibes: If you moon-ruled crustaceans could be locked in an embrace all day, you would be. Which is why your perfect dinner party should also feel like a hug: inviting, cozy, and intimate. Because home is your happy place, that’s what we’re channeling here. Leave one of your favorite shows (it’s okay, we all know it’s Gilmore Girls) streaming on the TV in the room next door. Set the table with Grandma’s china and Mom’s fancy linen placemats. And, as Adams suggests, serve everything family style (may we recommend these gorgeous platters by Jono Pandolfi?) so guests can help themselves.ServingwareShop Now at Jono Pandolfi USAMenu: Cancer rules the stomach, which means there’s nothing you crabs crave more than a comforting, home-cooked meal. That doesn’t mean you need to be sweating over the stove all day or go totally traditional either (you do walk sideways, after all). Seamlessly weaving between sea and shore, night and day, breakfast for dinner is an iconic Cancerian choice. Get the conversation buzzing with a rich, coffee-based cocktail before serving up a hearty chickpea frittata and a golden tower of hash browns. The only logical choice for dessert? Pancakes! Pancakes! Pancakes!Party starter: We know you’re all about emotional depth and self-reflection, but that doesn’t mean your guests are. Ease them into the real talk with a couple of rounds of Would You Rather?Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Leo, July 23 - August 22Vibes: Adams has three words when it comes to you celestial lions: royalty, drama, and performance. Is it any surprise Leo governs the color gold? Time to roll out the carpet and dazzle your guests—raaawwrrr! Create a bit of a scene by draping velvet curtains over the entranceway to your kitchen or dining room—which will also be the perfect spot to snap a Polaroid as each guest walks in. Hang a glittering disco ball over your table in homage to your cosmic ruler, the sun. And bust out these very extra cocktail coupes to keep the vibe regal.Rialto Coupe Glasses$60 at Coming Soon New YorkMenu: Leo rules citrus fruits, and seeing as tonight is really about YOU, sneak them into every course. Start things off with this charred kale salad studded with juicy hunks of orange and grapefruit. For the main, bring out this show-stopping, slow-cooked burnt orange and coriander pork and a stunning Sweet Potato Tian. For dessert, take a bow before serving this attention-seeking lemon meringue pie with scoops of vanilla ice cream. Throughout the meal, may your coupe runneth over with French 75s—a fancy cocktail featuring champagne, lemon, and gin.Party starter: Prior to the party, my Lion Kween, have each guest come up with a royal nickname. Allow them to shine (momentarily) by announcing their arrival as they sashay through the velvet drapes. You generous ruler, you!Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Virgo, August 23 - September 22Vibes: Bonjour, Virgo! With Paris being a city you rule, and “intellectually intimate, one-on-one conversations” being the vibe you crave, according to Adams, we’re taking this party to France. Draw inspiration from Gertrude Stein’s salon at 27 Rue de Fleurus for your gathering. Invite a small guest list that you think would generate stimulating conversation. Cluster chairs—or chic velvet floor pillows—in tight, cozy circles. Light candles to fill the space with warm, flickering light and the scent of French tulips. And, whatever you do, detailed-oriented Virgo, don’t stress. All will be parfait.Lush Velvet Pillow$43 at West ElmMenu: Virgo rules the digestive system, which makes you earth goddesses hyper-aware of ingredient quality. So shop wisely, Adams heeds. Start the evening with a spot of fromage, in the form of one of these five exceptional cheese boards, and a few bottles of Pét-Nat—Champagne’s cool kid sister. Opt for individual-sized leek and potato galettes for the main, paired with a simple, vinegary salad. Bring out the madeleines and a full French press as the gathering starts to wind down.Party starter: We know you Mercury-ruled Virgos are old pros at deep talks, but take a break from the serious stuff and get your guests involved in a couple of quintessential parlor games.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Libra, September 23 - October 22Vibes: Librans are “very poetic, very romantic,” Adams says. Yet, represented by a set of scales as the only inanimate object in the zodiac, you aesthetic creatures are also about balance and harmony. Which means we’re going for an environment that’s naturally beautiful, but not over the top. Think: rose-colored string lights, lush green ferns, a lace tablecloth, and tapered candles—like a chic greenhouse.Ombre Taper Candle Set$12 at Urban OutfittersMenu: To start, marry style and substance with this fig, cheese, and nut salad, and a crystal bowl filled with pretty pink pomegranate punch. For the main, serve these sweet-savory guava drumsticks and a bright collard and plantain salad. Venus, the planet which rules Libra, also rules sugar. So when it comes to dessert, throw balance out the window and go big. Wow your guests with individual caramelized honey brûlées AND these gorgeous pavlovas with fresh berries.Party starter: What can we say, Libra, you love love. To kick things off, have everyone describe their first crush, how they met their partner, or what romantic comedy is their favorite.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Scorpio, October 23 - November 21Vibes: “You can go full goth,” Adams says. When it comes to the ideal dinner party for you celestial scorpions, lean “deep, transformative, and dark.” Share the theme with your guests ahead of time and ask them to come in their best moody look. Set the vibe by covering your windows with deep red cellophane. Drape your tables in black (or dark gray) linens. Light the room with a copious amount of candles. And present each course on ornate serving trays, like you’re Romeo and the year is 1595.Linen Tablecloth$60 at EtsyMenu: Scorpio is all about transformation, so choose a main ingredient and see just how far you can go with it. Make beets the star of the show, as their deep, blood-red hue is ruled by Scorpio. Serve this maroon-colored grilled beet baba ghanoush to start. Follow up with tender—hey, you can be that, sometimes—hanger steak and fiery charred beets. And finish things off with a rich, chocolate-y beet cake. As for drinks: wormwood, an ingredient in Absinthe, will turn this dinner into a party. Serve up a big batch of this sparkling cocktail but beware that, like the Scorpion's tail, you never can know when it might strike.Party starter: Intense and intuitive, Scorpios love to swing soulful. Consider bringing in a professional tarot card reader or clairvoyant who can offer each guest a personal reading.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Sagittarius, November 22 - December 21Vibes: According to Adams, Sagittarians are all about abundance, curiosity, and intellect. Embrace this thirst for knowledge by heading to your local thrift store for encyclopedias and classic tomes to incorporate into your tablescape as trivets and pedestals. Fashion oversized placemats from the pages of vintage atlases to spark a sense of wanderlust. Serve dishes on this globe-like lazy Susan. And keep those road trip tunes streaming all night long, baby.Ambrosia Lazy Susan$300 at Coming Soon New YorkMenu: Ruled by Jupiter, you sharp-witted archers are the go-big-or-go-home types—and tell me you find it hard to commit without telling me you find it hard to commit. Satisfy your sense of adventure and need for variety by filling your table with as “many things as possible,” says Adams. “You could even have a dish from every country!” First things: pick out a nice Bordeaux or Rioja to complement this worldly meal. Then, serve a bunch of starters: Persian Kuku Sibzamini, an Italian Antipasto platter, and this Thai-inspired Cashew Nam Prik dip with crudités. For the main, take your tastebuds to Nigeria via this comforting chicken and spinach stew. And to bring things home, serve piles of crispy churros with Mexican hot chocolate.Party starter: Okay Sag, time to show off a little bit, you lovable know-it-all. Dust off your trusty deck of Trivial Pursuit cards and get the party started with a round or two. (Geography questions obviously count double at this ’round-the-world party.)Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Capricorn, December 22 - January 19Vibes: Ruled by Saturn, Capricorns are serious, structured, and ambitious. Adams suggests creating an environment that feels carefully built—your own little dinner empire. Encompass your get-shit-done energy by serving distinct plated courses throughout the night, assigning seats in advance, and asking guests to come in formal attire. In terms of decor, keep it simple and refined with classy placemats and elevated flatware. Also: consider featuring some erotic art around the room, you frisky animal. “Capricorns are very horny, very sexual people,” Adams explains.Sabre Bistrot Flatware$248 at Food52Menu: Represented by a sea goat, a mythological creature with the body of a goat and tail of a fish, you sturdy Caps were built to climb (literally and figuratively). This last earth sign of the zodiac rules the bones, joints, and knees, so go heavy on the grounding vegetables, says Adams. Start the evening with a smoky chickpea and ham soup before bringing out this colorful winter squash number. Offer spicy Moscow mules with fresh ginger through the evening, and finish the night on an earthy note with this carrot loaf cake.Party Starter: Capricorn rules the 10th House, which is the house of career and public roles—and boy do y’all love to talk work. Go around the table and ask each guest to share what their dream job was when they were a child. Let me guess, sea goat: rocket scientist? Nobel Prize winner?Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Aquarius, January 20 - February 18thVibes: We bet no one has ever accused you of being basic, Aquarius. When planning your one-of-a-kind dinner party, follow in the footsteps of Salvador Dali, the master of eccentricity who often served dishes inside satin slippers. While you don’t have to take things that far (Dali was a bit, um, extra), you can set the scene with show-stopping table decor: lava lamps in your signature electric blue, colorful dinnerware, and some leggy sculptural candles. And if you want to wear some satin slippers in Dali’s honor, you totally can.Feast Dinnerware by Yotam Ottolenghi$87 at Food52Menu: Aquarius is firmly rooted in winter (in the northern hemisphere). So, to nourish your guests and your innovative spirit, think about serving creative takes on beloved comfort foods. Dig into this creamy french onion dip for starters, then follow it up with a peppy potato gratin served alongside salt-and-sugar pork. This Charmed and Dangerous cocktail, a twist on the classic Sazerac, is basically you in a drink, Aquarius. And keep Saturn satisfied by steering away from anything too sweet for dessert. Charred plums with cheese should be just right.Party Starter: “Aquarians DGAF!” Adams says, and what better way to lean into this attitude than with everyone's favorite, slightly offbeat game, Cards Against Humanity? Pick up extra decks, like this Pride Pack or 90s Nostalgia Pack, if you’ve played enough times that old cards have lost their luster.Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Pisces, February 19 - March 20Theme: Ruled by Neptune, the celestial planet that governs creativity, Pisces tend to be spiritual, ethereal, and sensual, Adams says. Any dinner party you water babes throw should be suitably dreamy, and a little magical. Set the mood with blue string lights, drape billowing tulle from the ceiling, hang a chandelier of iridescent paillettes, scatter mirrors across the table and on the walls to reflect light around the room, and serve everything on deep blue dinnerware to really nail that under-the-sea vibe.Casafina Dinnerware$172 at Food52Menu: Often represented by two fish swimming in opposite directions (what’s real, my Pisces pal? And what’s a fantasy?), for you, there’s no doubt that seafood should be the star of the show. Start with this smoked salmon dip before jumping into a brothy seafood chowder. An Aqua Pearl cocktail will no doubt have guests feeling their fantasy—and don’t ya know, blue drinks are having a moment right now? Finally, sub blueberries for strawberries in this tangy cream cheese cake to keep the blue streak strong.Party starter: Everyone loves talking about their dreams. But for you, trippy little fish, that’s of the sleeping kind. Go around the table and have everyone share the strangest dream they’ve ever had. (Just try not to psychoanalyze everyone, mmmkay Pisces?)Your perfect playlist:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitFood HoroscopesEntertaining + StyleDinner PartiesRead MorecultureThe New Rules of Dinner PartiesGallery14 SlidesBy The Bon Appétit Staff & ContributorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-17", "author": ["Condé Nast", "Lindsey Perkins"]}