{"id": "a112afb9b02c2417e627d385a1cb1aa8", "url": "https://www.bonappetit.com/story/chicken-khao-soi", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "This Khao Soi is My Go-To Sick Day Soup | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Never Too Sick to Make This Khao SoiThe best part of a sick day is this deliciously complex chicken noodle soup.By Elyse InamineDecember 6, 2019FacebookTwitterEmailPhoto by Ditte IsagerFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Whenever I come down with the flu (or, you know, a cold), I go through a Benjamin Button-level transformation and devolve into a whiny baby. As soon as I feel a slight tingle in my throat, I complain loudly to my husband until he brings me hot tea. Once the feverish chills set in, I wrap myself in every blanket I own and demand massages. I slink over to my couch and plop there for hours, letting the full effects of my illness settle in. At this point, I’m sneezing and coughing as often as I’m blinking, achy everywhere and somehow snotty in my nose but bone-dry in my throat (aren’t they connected somehow?). But here, in my woozy, weak state, I remember the remedy for my suffering is within my reach: this incredibly simple yet satisfying khao soi.I’ve been making this khao soi since before I started working at BA, and it’s become just as regular in my sick day cooking rotation as the stupid-easy garlic broth. That’s because this recipe gives me everything I need when I’m sick. I can prep all the khao soi paste ingredients—chop the shallots and cilantro; peel the ginger; measure the coriander, curry powder, and turmeric—then take a well-timed nap while the dried chiles soak and before everything gets whirred into a paste.As I cook the paste in my Dutch oven, the spice flushes out my congestion and, after I pour in the coconut milk and the chile paste and drop in the chicken thighs, I can take another nap while it cooks. Feeling slightly more refreshed and alive, I’m strong enough to shred the cooked chicken, boil the egg noodles, and chop the red onions, bean sprouts, lime wedges, and whatever else I want for topping my soup. Once the noodles are done, I slide the shredded chicken back into the broth, drizzle in some fish sauce, and sprinkle some palm sugar like I’m some sort of self-sufficient adult.Sitting on my couch, with a big bowl of khao soi brimming with chewy noodles and fall-apart-tender dark meat, the Benjamin Button effect fades. The rich coconutty broth is like lotion to my raw throat. The combination of ginger, chiles, and red onions provides just enough heat to calm down what remains of my sinuses. The complex flavors—fresh limes, vibrant turmeric, cleansing cilantro—prove how chicken noodle soup really does do something for the soul (did you read those books too?). As I slurp and slurp and slurp, I feel like a whole, functioning adult again and, thankfully for my husband, no longer in need of hot tea or on-demand massages.Get the recipe:Chicken Khao SoiA simple curry paste gives this northern Thai–inspired soup surprising depth of flavor.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-22", "author": ["Condé Nast", "Elyse Inamine"]}