{"id": "a11a68c67411bbebd4e74a65a58ae398", "url": "https://www.bonappetit.com/story/bas-best-risotto-recipe", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "Here’s What Makes BA’s Best Risotto Recipe So Damn Perfect | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHere’s What Makes BA’s Best Risotto Recipe So Damn PerfectThe fail-proof gold standard has arrived.By Alex DelanyMarch 29, 2019FacebookTwitterEmailPhoto by TED + CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFacebookTwitterEmailAccording to food director Carla Lalli Music, making risotto is cheaper than going to therapy. The other advantage? With risotto, you get to work through your feelings for 45 minutes, and then eat them too.Carla loves this classic Italian dish for that reason, but also because when it’s executed perfectly, it’s one of the creamiest, richest, most texturally pleasing dishes you can serve. But the truth is, so often, it’s just not.So Carla set out to give us BA’s Best Risotto: the fail-proof, gold standard recipe that gets risotto down to its very essence. Something you can serve in all its simple, naked glory. Something that doesn’t need to hide behind additional ingredients, but can make a great canvas for them (more on that later). It’s creamy, it’s Parmy, it’s satisfying, and it’s definitely more al dente than you’re likely used to having it. How did she get it there though? Allow me to break it down for you.You could say that not rinsing your rice is an essential step. And it is. You could say that finely chopping the onions is important. You wouldn’t be wrong. You could say that timing is crucial, and that you should serve your risotto as soon as it’s finished, hot and straight from the pot. That’s all true too. But if you really get down to it, there are really only three (3) key factors to creating the tastiest risotto.First, choose the right rice. Our favorite risotto rice is carnaroli, referred to by the Italians as “the king of rice.” It belongs to the family of short-grain Japanese rice, and the grains are plump, firm, and very starchy. That starch is what creates risotto’s creamy texture—mmmm. If you can’t find carnaroli, Arborio or sushi rice will do. They’re part of the family, and got some similar characteristics.Second, toast it. For toothsome risotto, you cannot skip this step. Before your rice comes into contact with any water, you cook the outer hull with your fine chopped onions and warmed olive oil. The hull will harden up as a result, ensuring that the grains cook evenly all the way through (otherwise, the outside will cook faster than the inside). It should take about five minutes to firm up the rice, but it’s important to use your senses too: The grains will take on a slightly translucent color and they’ll start to make a clattering noise against the sides of Dutch oven—like tiny icicles hitting a window, hard and glassy. Carla warns that if you don’t put in the five minutes to properly coat your rice, you’ll have grains with a mushy exterior and gritty interior that stick to your molars as you chew. No one wants that.Third, use water, not stock. Many risotto recipes will list stock as the cooking liquid, but Carla decided against it for this recipe. That’s because stock varies in flavor, seasoning, consistency, and quality. She prefers using 10 cups of plain old water brought to a gentle simmer with with 1 tablespoon of salt—a trick she picked from chef Naomi Pomeroy. It’s important that the water isn’t room temperature but it also shouldn’t be boiling when you add it to the pot. You’re aiming to match the rice’s temperature, since any sudden change will shock the grain and affect its texture.The rest is just stirring—the therapy part. So get your glass of water or wine or beer. Put on your playlist or podcast. Get your comfy shoes on. Definitely go to the bathroom. And then settle in. Because once you start cooking, you will not have a moment to step away from the oven. This is an involved process. It’s work, but it’s also cathartic. Truly great risotto requires your absolute attention. And Carla guarantees it’s worth it. And so can we.Oh, one last thing: Remember when we mentioned “additional ingredients”? Carla also developed a few seasonal toppings that you can add to your perfect Parmigiano. Consider it your new way of keeping track of time.Spring: Minty Snap PeasWelcome some bright, light sweetness to shoulder season. Snap peas provide a crisp contrast to the creamy risotto, while mint brings the flavor to an even greener, more refreshing place.Summer: Garlicky Cherry TomatoesFresh cherry tomatoes cooked in garlic and chile flakes balance the risotto’s richness with a sweet and spicy burst of flavor.Fall: Pan-Roasted ShroomsSome say fall smells like damp leaves, and others say it tastes like umami. Either way, it definitely smells like mushrooms. We liked them crisped and tossed with some red wine vinegar for an added tang.Winter: Lemon and ChiveThe winter pick-me-up you want during root vegetable season. Here, you’re stirring lemon juice right into the risotto, and then topping it with zest, chives, olive oil, salt, and pepper.Get the recipeBA’s Best RisottoRisotto is like a clingy baby. And if you give it all of your patient attention, it will turn into a puddle of love.View RecipeExplore Bon AppétitRecipeRisottoWeekendRiceItalianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-29", "author": ["Condé Nast", "Alex Delany"]}