{"id": "a1281cbd35f2b4db1cd7bd7bccac863a", "url": "https://www.bonappetit.com/story/april-horoscopes-pizza", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Your April Horoscope, Now with 100% More Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour April Horoscope, Now with 100% More PizzaNothing—nothing!—explains who you are better than which pizza topping you order.By Catherine UrbanApril 1, 2018FacebookTwitterEmailIllustrations by Tim LahanFacebookTwitterEmailWe could talk about the weather getting nicer, flowers blooming, bees buzzing dangerously close to your shins—all that scenic spring stuff. But we know you’re here for something that transcends seasons: pizza. And your imminent future via this pizza horoscope. Which toppings represent who you really are, inside? Are you a stuffed crust over-achiever? A classic pepperoni pie who never strays from the status quo? A bold, salty anchovy lover? Let us deliver that pizza-scope right to your door, in 30 minutes or less. Without further ado...Illustration by Tim LahanAriesHappy Birthday Aries! We love your natural spitfire charm, but this month you have an extra competitive (okay, argumentative) edge. While we won’t be the ones to ask you to tone it down, someone else might. That said, your birthday month is your time to shine, so save your fire for where it really counts, like beating the top score on the stair climber. It may take all of your self-control not to tell someone off at work—or that guy at the gym who didn’t wipe off the machine, or that lady who gave unsolicited feedback on your hair cut. But do what you gotta do to stay contained, like ordering an extra large Buffalo chicken pizza. Get your fix of fire from spicy Buffalo sauce, and crack open a pilsner to remind yourself that cooling down is optional. You’ve got this.Illustration by Tim LahanTaurusYou might feel like your life is in limbo right now—or that place packages go when UPS leaves a note and you never see it again. Use this month as an opportunity to catch up on your chill: eat, sprawl out, and relax. You’re good at that. You might also be chipping away at a behind-the-scenes project (whether it’s your master’s degree or your Netflix queue, we’ll never know). So in the spirit of spring break, use this time to rejuvenate, reflect, and move at your preferred slower pace. Have Siri order you a stuffed crust pizza right to your door—the one mediocre fast-food indulgence you’ve loved since you were 12. Imagine your joy when you wake up on the couch next to the half-eaten pizza. Finish it off for breakfast before crawling into your actual bed, justified that laziness has its perks.Illustration by Tim LahanGeminiYou’ve been quite the deep thinker lately (not surprising tbh). But now spring is here and it’s time to get out of the house and debate with others instead of with yourself. This month, you’ll be able to reestablish connections with people you’ve lost touch with, or that book club you ducked out of, or that running buddy you ghosted. Really, all you have to do is show up, and your natural charisma will take care of the rest. Invite your friends to your favorite red sauce joint for a legit Neapolitan pizza experience—divine mozzarella and marinara encircled with an expertly charred crust. It’s the most talked about pizza for the most talkative person we know.Illustration by Tim LahanCancerYou might have to put in a little extra effort to appease someone at home or at work,  even if that means going back and redoing something you’ve put time into. Frustrated, you might convince yourself you don’t need anybody, but we both know you’re wrong about that. While you hate confrontation, you’re always happy to clear the air and put it behind; and if you can do so, it’ll be smooth sailing for you this month. So when you find yourself caught up in a fantasy about quitting and moving to that houseboat on the bay, make your escape somewhere closer and grab a slice. AKA a thin-crust, New York slice of plain cheese pizza. Comfort on a paper plate—that’s soaked with grease. You’re doing it right if the slice is as big as your face, and make sure to fold it according to your heart’s desire. You don’t have control over everything in life, but you do with this slice.Illustration by Tim LahanLeoYou need a change of pace. You’re either too overwhelmed or too bored. Overworked? Score some last-minute airlines tickets to revisit your happy place in NOLA—somewhere you can let loose. Bored? Dust off your guitar and recall all of those songs you used to play with your high school band and wow your drunk friends at parties. Wherever you are, it’s all about brightening up your life—that’s right, order the ham and pineapple pizza. Is it even actually Hawaiian? Probably not, but you’re good at embellishing, so go with it. When was the last time you went to Hawaii, anyway? Just an idea...Illustration by Tim LahanVirgoYou’re in for some introspection this month, Virgo. As you look back on how far you’ve come and how much you’ve accomplished, pat yourself on the back. You don’t do that enough. While you usually mull things over to the point of exhaustion, this month you have just enough impatience that helps you to get right to the point: You need a self-driving car. But you aren’t that patient, and your pockets are burning now, so go on an Etsy binge or take yourself out to dinner. Order a bottle of table red, and an entire sausage and pepper pizza—a little spice, and a lot nice. You’re particular about what you like, and that’s what we appreciate about you.Illustration by Tim LahanLibraAll you want to do is have some downtime for yourself, however, duty calls. You can be a people pleaser to a fault, Libra, and you can’t stand disappointing others so you always follow through on promises. But this month, you may need to rebel against yourself and play hooky a couple times. Cancel plans! Skip the birthday party that starts at 10 p.m.! You won’t be lying when you say that you have some stuff to take care of around the house, because that stuff is a deep-dish pizza, loaded with ALL the veggies. You deserve a pizza sturdy enough to support your hopes, dreams, and cheese needs. Who could be mad about that? Let the haters be, and you do you this time.Illustration by Tim LahanScorpioYou obviously have good ideas because your level of perceptiveness is far more superior than everyone else’s (duh). But when it comes to being heard at work this month, you feel like your ideas are being overlooked for some irrational reason. Is everyone ignoring you because you microwaved fish last week? (Maybe.) So what do you do?? Assert yourself again, Scorpio. And again. And after that, there’s one solution that’ll bring you back in everyone’s favor: order a large pepperoni pizza to the office. Then dramatically drizzle honey all over it. Now you’ve got everyone’s attention and you can show them the ingenuity you’d been trying to convey all along—honey and pepperoni were meant to be together. Unexpected ideas can be beautiful!Illustration by Tim LahanSagittariusYou’re feeling a little untethered lately, which at least offers you the freedom you crave. But a part of you wonders if you should be showing more love to your savings account than your local bartenders. You’re in the midst of a year-long project, so tuck that thought in the back of your mind as you allow your creative process to unfold. Your energy is best spent this month following your bliss, so answer your heart’s calling for a whole white pizza—an exquisite pairing of garlic and ricotta that’s out of this effing world. But we both know you can’t resist opening the fridge to see what else to put on top—pickled jalapenos? Black olives? Salt-dried anchovies? You tell us, oh curious one.Illustration by Tim LahanCapricornYou might be clashing horns with someone right now, and it’s sooo annoying hearing the same argument being rehashed. Why can’t everyone share your precise view of the actual world?? That said, work is going really well. Challenging? Sure. You’re being pushed out of your comfort zone, but you’re always up for an opportunity to gain more experience. So when your company sends you on a business trip to Denver—or if you finally go on that goat yoga retreat to Costa Rica—you’ll be pleasantly surprised to um, see things in a new way. But because you are so inherently wise, you better get yourself a Grandma pie. A dense and crispy crust? How does it get any better than this? Oh we know: An all-expense paid vacation.Illustration by Tim LahanAquariusYou’re feeling rad as ever this month, having mounted some sort of peak in your life.  Just got married? Snagged that promotion? Found a $20 on the sidewalk?! Celebrate yourself for once! From your elevated vantage point, you wonder what you’ll do with your life now. Curious to gather some fresh inspiration, take some deserved time off and head to the nearest beach town. There, you can fulfill one of your other life goals: having a margarita in one hand while eating a Margherita pizza with the other. You need a delicate pizza topped with fresh basil to match your fresh ideas. For someone who can be as eccentric as you, sometimes the simplest choice is the most satisfying.Illustration by Tim LahanPiscesWide-eyed and full of energy, you are on top of your game this month. Normally you’re really good at daydreaming, but you’ve got some extra motivation sharpening your focus—and that extra pep in your step is getting you noticed. You might be presented with an opportunity to take on more responsibility, but do you want it? That depends on how much it pays. Not everybody can handle making the cotton candy and shaping the balloon animals. You’ve been saving up for a big purchase but hold off until the end of the month if you can. In the meantime, treat yourself to anchovy pizza. Not because your sign is a fish, that would be too...obvious. But because you are an unpredictable, intuitive human who knows that anchovies add the punch of salty umami that cheesy pizza requires. And while the rest of us are wondering who actually does that to a pizza, we are not surprised that it’s you, dear Pisces.Catherine O’Neill is an astrologer and writer who loves pizza bianca, Neapolitan style. Check out more of her work here.Explore Bon AppétitFood HoroscopesPizzaRead MorecultureMarch Horoscope Time: What's Your Egg Sign?By Catherine UrbancultureRead Your February Doughnut Horoscopes and Then Make Them Come TrueBy Catherine Urbanculture8 Styles of Regional Pizza to Know, Love, and CherishBy Arthur BovinocultureA Long Answer to a Simple Question: How Do You Eat a Slice of Pizza?By Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-01", "author": ["Condé Nast", "Catherine Urban"]}