{"id": "a1282847a3bc2733c4528bb668693663", "url": "https://www.bonappetit.com/story/stainless-steel-spider-kitchen-tool", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "A Spider Is an Extremely Useful Cooking Tool, Not a Creepy Bug | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Spider Is an Extremely Useful Cooking Tool, Not a Creepy BugThe spider is the secret weapon of pasta, dumpling, and egg lovers everywhere. It's like a colander, but on a stick!By Alex DelanyFebruary 21, 2018FacebookTwitterEmailFacebookTwitterEmailFor the most part, I don’t like having spiders in my kitchen. Or anywhere, really. When it comes to spiders, I’d rather just...not. (If you have any friends that are spiders, please, just don’t mention this to them.) I will make an exception for one spider, though: my beloved wood-handled, stainless steel spider.No, not a piece of stainless steel that is shaped like an eight-legged creature. I’m talking about the kitchen tool, the one that looks like a mini flattened colander with a long handle. (It’s called a spider because the woven metal netting resembles a spider’s web.) Much less creepy than an actual spider.Pot-to-pan pasta perfection.\nSomeone gave me my first spider—I didn’t go out looking for one. But what a gift it was, because it's since become one of the most reached-for tools in my kitchen. The perforated bowl is perfect for transporting pasta from pot to pan (while reserving the pasta water), lifting items like dumplings or thinly-sliced potatoes (read: chips) out of sizzling oil, and picking blanched vegetables like carrots or green beans out of boiling water.A spider in action.\nYes, yes. Those are all great applications, but in my opinion, a spider is actually best used when when making eggs. Hard-boiled, soft-boiled, and jammy eggs. Any egg that goes in boiling water benefits from being carried in a spider. The spider makes it easy to lower multiple eggs gently into a pot, and removing them three at a time is no problem either. Eggs love spiders, and spiders love eggs—it's the perfect boiled egg tool.These eggs were carried, lovingly, by a spider.\nPhoto by Chelsie CraigThe best part? You don't need a fancy or expensive one to reap all of those benefits. The Joyce Chen spider that I have is cheap and pretty perfect, IMO. The wooden handle is comfortable and lightweight. The bowl of the spider is about 5” wide, the perfect size for scooping up everything from dumplings to orecchiette to eggs. And you know what? I actually think it's pretty cute. It’s sure to liven up the handmade ceramic crock (or large mug, if you’re less of an adult, like me) you keep all of your spoons and ladles in.Look, this is an easy upgrade. It costs less than ten bucks, and will help you overcome any fears you may have of boiling water or splattering oil. You need a spider in your kitchen. But one you bought and put there on purpose—not one that crawled in through the window. Gross.Buy It: Joyce Chen Stainless Steel Spider on Amazon for $8.58And once you have that spider, make some rigatoni:Rigatoni with Sausage, Beans, and GreensOur favorite and best method of making pasta—the same one the pros use in restaurants—is one in which the pasta finishes cooking in a glossy sauce made by emulsifying cheese into the pasta cooking liquid. It’s so easy and good it might change your life (or if not your entire life, then definitely your weeknight pasta game).View RecipeExplore Bon AppétitBasicallyToolsBA RecommendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "Alex Delany"]}