{"id": "a14b9a9b45c92064b6c9ad52a58f166d", "url": "https://www.bonappetit.com/story/tiny-potatoes", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Anything Big Potatoes Can Do, Tiny Potatoes Can Do Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAnything Big Potatoes Can Do, Tiny Potatoes Can Do BetterWho ever said “small potatoes” is a bad thing anyway?By Kendra VaculinNovember 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowellFacebookTwitterEmailI’ve always found the proportions of baked potatoes to be out of whack. Even after going really hard on the bacon bits, shredded cheese, and scallions, I’m inevitably left with a weird amount of leftover plain potato: a boring, sad, superfluous three percent, destined for the compost.The solution to this problem is not to get a smaller russet potato. It’s to get the smallest potatoes you can find. Reframing your potato-related cooking around tiny potatoes rather than big ones—or even big ones cut into small pieces!—will turn all of your favorite tuber dishes into snackable, one-bite, just-enough-potato delights.Also called new potatoes, baby potatoes, C-size potatoes, or creamers, tiny potatoes are some of the cutest things in the produce department. They max out at 1½ inches in diameter (though many are much smaller) and are often sold in netted bags of all one hue or a medley. My personal favorite is the beige, red, and purple assortment, though admittedly this is mostly for aesthetics. Tiny potatoes aren’t just adorable: They also cook quickly and evenly with little to zero knife work on your end—you can dump them straight onto a sheet pan to roast or into a pot of water to boil. And because you’ve got a smaller flesh-to-skin ratio, you get the whole spectrum of potato textures and flavors in every bite.Small potatoes are smashing (…get it?).\nHow should you use your bag of tiny potatoes? In any dish that would benefit from being bite-size in nature. Standing in for chips as the base for sheet pan nachos, for example, or turned into a heap of crispy smashed potatoes. As the titular ingredient in a potato salad with minimal spud prep (keep ‘em all whole!), or scattered under a roast chicken to catch the schmaltzy bits. I’ve used them in aloo gobi, where the whole potatoes are no bigger than my largest cauliflower florets, and as a simple side under a shower of black pepper and parm. The size makes everything feel more fun, like party food even when it’s for a regular weeknight dinner. For that reason, whenever I can go tiny, I will. (Of course, I stick with full-sized potatoes for peeling, mashing, slicing, or shredding.)With the flavors of potato pierogi in mind, I recently developed a recipe we’re calling Tiny Potatoes with Sour Cream and Onions which makes use of these special, shrunken spuds. Tossed in a garlic powder, sumac, and salt, they’re roasted alongside red onion rounds (use small red onions for maximum cuteness) until they have a flavorful, crisp, wrinkled-skin exterior and creamy, tender middle. Then they’re piled onto a swoosh of sour cream and covered with herbs like dill and chives—less than ten ingredients total to make a side you won’t be able to stop eating. It’s a perfect example of a “stab-and-drag” dish, a categorization I learned from the State Bird Provisions cookbook that refers to foods you must spear with your fork and drag through a sauce before eating. With each drag, you’ll pick up creaminess, freshness, a little bright sumac, and a roasty onion bite, all with a tiny potato to hold everything together. I recommend it as your first foray into baby potato cooking if you’ve never tried the tiny ones before.You can, of course, treat them as you would a full-size russet for teensy mini loaded baked potatoes. Everything, toppings and all, fits in one bite: no uneaten three percent here.Tiny Potatoes with Sour Cream and OnionsThese extra creamy (and extra cute) tiny potatoes are reminiscent of sour cream-slathered potato pierogi, which is a very good thing.View RecipeExplore Bon AppétitcookingPotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-08", "author": ["Condé Nast", "Kendra Vaculin"]}