{"id": "a1664e9cbe752f859626781f710d3009", "url": "https://www.bonappetit.com/story/rhubarb-custard-cake-recipe", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "A Rhubarb Custard Cake Somewhere Between Pudding and Heaven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rhubarb Custard Cake Somewhere Between Pudding and HeavenAnd you don’t need any fancy equipment.By Emily SchultzMarch 26, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt’s that time of year again, when 70% of my Instagram feed is taken over by moodily-lit galettes laden with pink celery. And guess what? I LOVE IT. It means spring is here, there’s more day time for naturally-lit photos, and more stuff at the farmers market than cold potatoes.Let’s rewind to the pink celery though. Okay, so it’s rhubarb. And instead of a galette, this spring we’re making this ridiculously easy rhubarb custard cake recipe by Claire Saffitz.Photo by Alex LauWhat...even is rhubarb though? I’m explaining this because when I baked the cake this weekend, my friends asked me what rhubarb was—not everyone in the world knows, and who am I to judge?  Rhubarb is in the rhizome family, along with things like turmeric and lotus root, FYI. It’s a stem that grows underground and shoots roots off of it, and tastes like a sweet tart that has had all of its coloring sucked off.  When it’s raw, it has the texture of celery, and when cooked it’s a floppier version of that. But let’s move onto the cooking portion of the show, shall we?Straight up: I don’t have a fancy Kitchen-Aid mixer, and mixing by hand is HARD WORK. This recipe doesn’t call for any equipment like that, so you can turn your black-and-white TV on while making this cake and reminiscence about the old days.First, we’re whisking together some baking soda, kosher salt, and flour. Set that powdery bowl aside, and dump 2 eggs plus 1 egg yolk into another bowl. It’s important to really whisk the eggs into an airy, frothy state because that will hold up the rhubarb later on (I didn’t whisk mine enthusiastically enough and the rhubarb sank a little). Then, add 1 ½ cups of sugar into the eggs, and whisk those until they’re well incorporated. Melt some butter and whisk that in, as well as sour cream while you’re here. The combination of the extra yolk and sour cream is going to create a dreamy custard texture.At this point you might realize you bought too much sour cream and decide to make this creamy kimchi dip once the cake is done. But pull yourself out of the rabbit hole of Bon Appétit Dip slideshows and add dark rum to that cake batter to give it a mysterious warm depth of flavor (go with it). Whenever I’m cooking with a liquor I don’t already have at home, I’ll usually just buy the teeny nips at the checkout of the liquor store, because they’re cute and I won’t be left with half a bottle of alcohol in the back of my freezer. (Although if you wanted to make a rum punch just because, I wouldn’t hate you for it.) Zest some lemon skin into the wet batter to brighten things up, and mix to combine. Next, we’ll add the dry ingredients to the wet until it’s all smooth.Photo by Alex LauYour sunshiny lemon pudding batter goes into a WELL BUTTERED AND FLOURED SPRINGFORM PAN. It’s an important step because the cake is custardy and delicate when it comes out of the oven, so you have to be gentle with it! If the edges stick to the pan while you’re trying to release it, it’ll fall apart and cause immense sadness as it reminds you of everything else broken in the world right now. But, uh, that won’t happen if you remember to butter the hell out of the pan.Instagram contentThis content can also be viewed on the site it originates from.Once your batter has settled into its temporary springform home, it’s rhubarb time! This is where we get creative, AKA pull up a photo Claire posted and try to recreate her rhubarb design exactly. Sprinkle a little bit more sugar on there, and pop it in the oven for about 40-45 minutes. During this waiting game, I made Andy Baraghani’s lamb meatballs in my attempt to pretend I’m a person who meal preps, and watched the episode of Jersey Shore when Vinny and Pauly go to Staten Island.Once the edges of the cake are golden brown, take it out of the oven and let it cool in the springform pan for about 10 minutes. Slide a knife around the the edge to loosen it up a bit, and once 10 minutes have passed you can release your masterpiece!Eat it with freshly whipped-whipped cream, a bit of greek yogurt, or exactly how it came out of the oven–and teach everyone about your new friend, rhubarb.Get the recipe:Rhubarb Custard CakeThis custardy cake requires no mixer and comes together in minutes. Seriously, it’s easy!View RecipeExplore Bon AppétitRhubarbCakeSpringEasterCustardRead MorecookingA Strawberry-Rhubarb Pie Recipe, with Special Guest Star: VodkaBy Alex BeggsStrawberry-Rhubarb Galette with Buckwheat CrustRhubarb-Almond CakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-26", "author": ["Condé Nast", "Emily Schultz"]}