{"id": "a16794433b9c747bcebc05fd9bb1d391", "url": "https://www.bonappetit.com/story/curate-asheville-tortilla-espanola", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "The Tortilla Española at Cúrate Restaurant in Asheville, North Carolina, Is Like a Savory Molten Lava Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Tortilla Española Is Like a Savory Molten Lava CakeAnd who doesn’t like that? By Elyse InamineDecember 12, 2019FacebookTwitterEmailPhoto by Evan SungFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve got, not a hot take, but a room-temp take. Frittata, quiche, tortilla española: I could live without them. They’re just not my thing. Eggy cakes. They’re bland, somehow never salted enough. They’re damp, an adjective that doesn’t have any positive connotations (see: every creepy basement description, gym shorts). They’re spongy, the wet blanket of food textures. I don’t hate these eggy cakes. If you gave me $100 (or even $10), I’d eat one! I just prefer not to.But a few months ago, when I was at Cúrate in Asheville, I had to. My two dining companions added a plain-sounding tortilla española to our already very long order, and I couldn’t say no. I was about to tell my friends to go ahead and just split it between them when the hockey-puck-shaped dish hit our table. But then one of them cut into it, and a river of gold flowed out from the center. “AN EGG YOLK?!” we all squealed. I couldn’t—and didn’t—let my friends split it.The tortilla was unlike any other I’d ever had, and debunked every thing I disliked about dishes like this. It was flavorful, with a good amount of salt, sweetness, and slight smoke. It was perfectly browned and crisp on the outside, and gooey on the inside—like a savory molten lava cake, with  a rich and creamy and yolky center. There was nothing damp, spongy, or moist about it.Katie Button, the chef and owner of Cúrate, also felt lukewarm about tortilla española when she lived in Spain as a stagiare at El Bulli. So she culled techniques from family and friends to perfect the dish for her restaurant before she opened it eight years ago. That includes adding homemade potato chips to the mix for a firm, almost crisp consistency—a tip from her friend (and chef of Somni in L.A.) Aitor Zabala—and letting the ingredients sit together overnight, so the potatoes and onions can absorb the egg for a less liquidy, more chunky result. Each tortilla is cooked to order in one of those gimmicky one-egg frying pans (“The key to everything!” Button says). It's about three minutes on each side until the center feels slightly squishy—like rare steak, just as her Spanish mother-in-law taught her.The result is a tortilla española that's made this lukewarm editor into a tortilla española fanatic. Guess that's my new take.Go there: CúrateExplore Bon AppétitHighly RecommendRestaurantsSpanishAsheville, NCRead MorerestaurantsI Didn’t Know Collard Greens Could Taste Like This Until I Went to Buxton HallBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-12", "author": ["Condé Nast", "Elyse Inamine"]}