{"id": "a181b66366876de9274f516116664d53", "url": "https://www.bonappetit.com/recipe/salted-pbandj-ice-cream-pie", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "Salted PB&J Ice Cream Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2020 IssueSalted PB&J Ice Cream PieBy Sohla El-WayllyJuly 14, 20204.6(25)Read ReviewsTriangleEmailPinterestPrintPHOTO AND FOOD STYLING BY SOHLA EL-WAYLLYEmailPinterestPrintEmailPinterestPrintPeanut butter, jelly, and buttery crackers, now updated in no-churn ice cream pie form. Any nut or seed butter (creamy or crunchy!), jam or jelly combo will do, whether it’s tahini with strawberry jam or almond butter with cherry compote. An equal weight of pretzels or potato chips would also work in place of crackers in the crust. (Taste the mixture before adding salt; you might not need it.) The only real limit is your imagination.Ingredients8 servingsCrust1sleeve (110 g) Ritz crackers or other cracker of your choice⅓cup (45 g) raw peanuts or other nut or seed, finely chopped⅓cup (67 g; packed) light or dark brown sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt6Tbsp. unsalted butter, meltedFilling and assembly3large eggs½cup (100 g; packed) light or dark brown sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt1tsp. vanilla extract½cup (128 g) natural peanut butter or other natural nut or seed butter1½cups heavy cream⅓cup (100 g) grape jelly (preferably Bonne Maman) or other jelly, jam, or compotePreparationCrustStep 1Preheat oven to 275°. Place crackers in a deep pie dish (a shallower one will work but you may have some filling left over) and gently crush with your hands until you have a mix of dime-size pieces, small crumbs, and everything in between. Add peanuts, brown sugar, and salt and toss to combine. Drizzle in butter and toss to evenly coat. Using your hands and the bottom of a measuring cup, press firmly and evenly into bottom and up sides of dish. (Mixture will look and feel crumbly, but it will hold together when baked.) Bake crust until a shade darker, 20–25 minutes. Let cool.Step 2Do ahead: Crust can be baked 3 days ahead. Store tightly wrapped at room temperature, or freeze up to 1 month.Filling and assemblyStep 3Pour water into a medium saucepan to come 1½\" up the sides and bring to a bare simmer over medium-low heat. Whisk eggs, brown sugar, and salt in a large heatproof bowl just to combine (or use the bowl of a stand mixer if you’ve got one). Set over saucepan (bowl should not touch water) and heat egg mixture, stirring constantly with a heatproof rubber spatula, until sugar dissolves, about 4 minutes (mixture will no longer feel gritty when rubbed between your fingers). If you are concerned about undercooked eggs, heat mixture longer, still stirring constantly, until an instant-read thermometer registers 165°, about 3 minutes more. Remove bowl from heat and add vanilla to egg mixture. Using an electric mixer, beat\non high speed until thick and pale and doubled in volume, about 10 minutes. (Or, if using a stand mixer, beat with the whisk attachment, 6–8 minutes.)Step 4Using spatula, mix peanut butter in another large bowl to loosen up and smooth out. Stir one third of egg mixture into peanut butter to lighten, then gently fold in half of remaining egg mixture, running spatula down sides and along bottom of bowl, then lifting up through center and over top while rotating\nbowl, until just combined. Repeat with remaining egg mixture (it will lose a lot of volume, and that’s okay).Step 5Starting on low speed and gradually increasing to medium-high, beat cream in the same bowl you used for egg mixture (no need to wash) until soft peaks form, about 2 minutes. Gently fold into peanut butter mixture and scrape into crust. Dollop jelly all over; swirl with a butter knife. (For more defined swirls, freeze pie 30 minutes before adding jelly.) Freeze at least 8 hours before serving.Step 6To slice, run a chef’s knife under hot water to warm up the blade, then wipe to clean and dry between slices. Use\nan offset spatula or fork to loosen slices from dish. If pie is frozen very hard, you may need to let it temper in the fridge\n30 minutes before serving.Step 7Do ahead: Pie can be made 2 weeks ahead. Wrap tightly and freeze.How would you rate Salted PB&J Ice Cream Pie?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleThis is my favorite pie that I make! The crust in phenomenal- it tastes extra delicious if put honey roasted peanuts in the crust instead of normal.  I usually put raspberry jam in mind as well.  Could not recommend enough!  Alex D. Franklin, TN12/15/2021Love this pie! I had leftover filling so I put it in some popsicle molds and topped with some chopped peanuts. KatyHuntington Beach, CA7/3/2021Literally my go-to dessert for any occasion. Everyone loves it. It's so good.Anonymous4/8/2021LOVE this recipe! So simple and can be easily modified depending on the ingredients you have on hand. I made the crust with pretzels instead of ritz crackers, added a little extra butter and a little less salt than the recipe called for. Strawberry jam instead of grape jelly. Such delightful, satisfying and nostalgic flavors!Lu LovelessNew Orleans, la2/9/2021Though it was pretty delicious and a cool technique, there was sort of a short window in which it was soft enough to eat but not quite melted that was a little hard to figure out. For that reason I probably wouldn't make it again.Paulina12/13/2020I love that this is such a forgiving and rustic recipe already made this twice! First time i made this with a combination of natural peanut butter + pistachios + walnuts, 2nd time was with natural peanut butter + tahini + walnuts + peanuts! Had leftover filling which i froze for ice-cream too. My recommendation is to freeze it for 30-45 mins for better jam swirls, and add slightly more jam. Thank you Sohla! Amazing as alwaysrumyakuzaSingapore9/24/2020SO GOOD. I made this for a birthday party, and it was a huge hit. The flavors play so well together. Everything about this is delicious. I made a few modifications... All I had was crunchy peanut butter, and, honestly, when I make this again I'll use crunchy again. Having little bits of peanut in the ice cream was a really nice touch. Based on the reviews that said the crust sticks, I added an extra two tablespoons of butter to the crust recipe and I also lightly floured the pie dish before the blind bake. My crust didn't stick, so I recommend this modification.AnonymousMichigan9/8/2020AMAZING. I made this for my dad, who loves all things peanut butter and who said this is \"the best thing he ever tasted\" (lolol) \n\nI had the same issue as the below commenters with the sticky crust, but I let the pie sit out for 30 minutes, and it was a lot easier to dig out.Clara YanNew York8/22/2020We tried this with chicken thighs. They key is you have to debone them and chop them into small pieces. Then, it's delightful! Thanks again to JAMES FORKY-FINGERS for another twist on a great bon appétit recipe. #tastydoodoobaking soda kweenOmaha8/22/2020This was an absolute crowd pleaser! It was my first time making ice cream and I thought the instructions were very well written and easy to follow. Got 8 generous servings out of it just like the recipe said, but I did have a bit of trouble with the crust crumbling and sticking to the pie plate. Might use a bit more butter next time to make sure it really holds together. I will definitely make this again!  AnonymousEdmonton, Canada8/18/2020The ice cream tasted AMAZING but I had the same problem of the crust totally sticking to the pie plate. The ice cream pulled clean off and left the crust at the bottom, we tried to dig some out but it was very sticky. Made the recipe as called for with ritz crackers. Wondering if this is because the dish wasn’t quite defrosted enough.Anonymous8/2/2020Yum! I'm a fan of all things peanut butter and this was great. My husband, the opposite of me when it comes to PB, wanted more jelly. Wasn't hard to make, especially using a stand mixer. Unfortunately, this stuck BADLY in the pie dish. The filling came right off the crust and it took my husband holding the plate and me scraping at it to get crust crumbles out to serve alongside the filling. Not sure why, given the amount of butter in the crust. It helped, slightly, to put the dish in some hot water. Hoping the second serving tomorrow is less messy. Great summertime pie! TXHuskerTexas8/2/2020I really wanted to love this and I followed the recipe to the letter, but it was just ok. The texture were interesting, especially with the crust, and it was good when it had a long time to freeze, but the flavors just weren’t great. The jelly was too sweet when combined with the peanut butter pie, and the taste of the pie just wasn’t worth the amount of work that went into it. AnonymousChicago7/31/2020i had absolutely ZERO reason to make this since my household consists of two grownup wives that don't particularly need more excuses to eat dessert in quarantine, BUT I MADE IT ANYWAY, and i am so glad i did. because you only live once. um, anyway, this was AMAZING, and i actually had a lot of fun making it. what's more satisfying than whipping eggs and cream, and crushing ritz crackers with your hands? used about 3/4 almond butter and 1/4 tahini, with a bit of peanut butter powder thrown in for more peanutty flavor, and a mixed berry jam. i also threw some graham cracker crumbs into the crust mixture because i had them lying around. PERFECTION!typeforbreakfastnew haven, CT7/30/2020i had absolutely ZERO reason to make this since my household consists of two grownup wives that don't particularly need more excuses to eat dessert in quarantine, BUT I MADE IT ANYWAY, and i am so glad i did. because you only live once. um, anyway, this was AMAZING, and i actually had a lot of fun making it. what's more satisfying than whipping eggs and cream, and crushing ritz crackers with your hands? used about 3/4 almond butter and 1/4 tahini, with a bit of peanut butter thrown in for more peanutty flavor, and a mixed berry jam. i also threw some graham cracker crumbs into the crust mixture because i had them lying around. PERFECTION! typeforbreakfastnew haven, CT7/30/2020Explore Bon AppétitFrozen DessertDessertPieIce CreamAmericanPeanut ButterCondiments, Sauces & PastesSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-14", "author": ["Condé Nast", "Sohla El-Waylly"]}