{"id": "a188ffea061216f27fa9ad40910f2aa5", "url": "https://www.bonappetit.com/recipe/tuna-nicoise-salad", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Tuna Niçoise Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueTuna Niçoise SaladBy Anna StockwellJuly 9, 20194.8(66)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintNothing says “I’m on vacation” like a two-hour, three-glasses-of-rosé lunch. The key is finding a dish whose prep won’t eat into valuable dozing-off-with-a-book-in-your-lap time. Enter this salad.Ingredients6–8 servings¾cup extra-virgin olive oil¼cup fresh lemon juice2Tbsp. Dijon mustard1tsp. honey1tsp. freshly ground black pepper1tsp. kosher salt, plus more6large eggs1lb. green beans, trimmed and/or new or baby potatoes, halved if larger4cups seedless cucumbers3cups oil-packed tunaOlives, capers, peperoncini, pickles, or other pickled-briny ingredients (for serving)Flaky sea saltPreparationStep 1Whisk oil, lemon juice, mustard, honey, pepper, and 1 tsp. kosher salt in a medium bowl; set dressing aside.Step 2Bring a medium pot of salted water to a boil. Carefully add eggs and cook 7 minutes. Using a slotted spoon, transfer eggs to a bowl of ice water (keep pot over high heat); chill until cold, about 5 minutes. Peel; set aside.Step 3Meanwhile, add green beans and potatoes to the same pot of boiling water and cook until just tender, 2–4 minutes for green beans, 10–15 minutes for potatoes. Using a slotted spoon, transfer to bowl of ice water; let sit until cold, about 3 minutes. Transfer to paper towels; pat dry.Step 4To serve, slice eggs in half and arrange on a platter with cooked and raw vegetables and tuna. Top with pickled-briny ingredient(s), sprinkle with sea salt, and drizzle some reserved dressing over. Serve with remaining dressing alongside.Step 5Do Ahead: Dressing can be made 5 days ahead; cover and chill. Eggs can be boiled and vegetables blanched 2 days ahead; cover and chill separately.How would you rate Tuna Niçoise Salad?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI love this recipe and often use other meats and veggies in order to clear my pantry and/or fridge,  It's such a forgiving recipe!  Tonight I used up leftover rotisserie chicken and added a few radishes in for tang.  This will be lunch for me tomorrow and I'm looking forward to itAnonymous8/16/2021LOVE this recipe.  The instructions are well written and, like others that have reviewed, I serve the extra dressing on the side.  I also save the dressing for using the next time I make it - which is probably once per week in the summer.  As another had written, this travels well.  I make it ahead and bring it to eat on our boat, it presents well, especially when served over a bed of greens. Hope you enjoy it as much as our family and friends do. NNSeattle, WA8/10/2021Summer is here! The minute I saw beans and new potatoes at the Farmer's Market, I began dreaming of Salade Nicoise. This is a lovely version that reminds me of France. The touch of honey in the vinaigrette adds a lilt. Everything came out perfect as timed. We love jammy eggs, and 7 minutes gives you jammy eggs. Make sure your pot is large enough to handle all of the eggs you are cooking and get to know your eggs. If you are using cold ones right out of the fridge, you may need more time with them. Start to know your ingredients and adjust each recipe as needed.MH_sfSan Francisco, CA6/8/2021Great receipt, however for a bigger flavour hit, use use Italian tuna in olive oil and use the the oil for the basis of the the vinaigrette. Gives bigger tuna flavour to the salad.Anonymousottawa canada6/7/2021Wow great salad! I was never a fan of nicoise salad until I had a great one in London England. Your recipe nailed it. I like the idea that one reader placed it on lettuce for a nice presentation.  This salad recipe worked well; entertaining girlfriends for a patio lunch and a glass of rose. It was a big hit!    In response to the negative review by \"sarcastic thanks\" the instructions that you gave were easy to follow and very successful. I didn't think boiling eggs was rocket science. SueS Edmonton, Alberta6/7/2021I write in response to the negative review by “Sarcastic Thanks.”  That reviewer was apparently disappointed in your instructions for hard-boiling eggs.  However, nowhere does the recipe denominate the eggs as “hard-boiled.”  The reviewer should know that a 7-minute egg is not hard-boiled Anonymous6/4/2021Fantastic! A Mother's Day hit for all ages. I prepped everything the night before and it all traveled well.  I dressed salad greens and served all the fixings buffet style so everyone could take what they wanted, and brought the extra dressing to the table.I also added blanched asparagus and cherry tomatoes. For high altitude jammy eggs 8 and 1/2 minutes is perfect.Nicole STruckee, CA5/17/2021This is my absolute go-to recipe when I want a fun, beautiful, easy, delicious salad. We have it for dinner frequently. The egg time given produces yolks just like the picture. If you want them firmer, add a minute at a time. One of the reasons I love this recipe is that it takes you by the hand and walks you through it. All you need to do before starting is to put a pot of water on to boil, and fill a bowl 1/2 with ice cubes and 1/2 water. The only thing we’ve changed is that we put a bed of lettuce down on the plate before building the salad. It is soooo good!SRFernSanta Rosa CA5/13/2021I chose to follow the instructions for hard-boiled eggs for the Tuna Niçoise, which totally did not work out! The egg yolks were still runny! Thanks for ruining & wasting two perfectly good EB eggs! Thanks for wasting my time & money! Don't bother trusting bon appétit!Sarcastic thanks!2/4/2021Perfect\nKaren PLowbanks Ontario Canada1/30/2021Explore Bon AppétitSaladFrenchEuropeanEggGreen BeanVegetablePotatoCucumberTunaFishSeafoodQuickEasyWeeknight MealsMainGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Anna Stockwell"]}