{"id": "a18e3b28a247b29f03a10feecf2919a9", "url": "https://www.bonappetit.com/story/can-i-substitute-onion-powder-for-fresh-onions", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Wait, Can I Substitute Onion Powder for Fresh Onions? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWait, Can I Substitute Onion Powder for Fresh Onions?The answer will bring tears to your eyes.By Emma WartzmanJune 26, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailSo, you’re about to cook dinner but you’re tired and lazy, and the last thing you want to do is run out to the store to buy an onion. But what’s that in the pantry, hiding behind the baking soda and the anchovies? It’s onion powder! A perfectly good substitute, you might think.After all, onion powder is just dried and pulverized onions—the essence of onion, if you will. But just because the two have a very close relationship doesn’t mean they can be used interchangeably. Each is unique, and before you go swapping one for the other, you should consider what each brings to the table.Fresh onions are more than their taste. They have texture—a real crunch when raw, a buttery softness when caramelized. They’re also approximately 89% water, which means that when you cook with them, you’re introducing moisture into your dish.Onion powder, on the other hand, comes from onions that have been dried (either air-dried, dehydrated, or freeze-dried) and then crushed to varying degrees, from flakes to powder. No texture, no water, and a more concentrated oniony punch. And just like with fresh onions, the flavor of onion powder varies, too. It can be made from any kind of onion, be it biting white, milder red, or sweeter yellow. It can be made solely of the bulb—the onioniest part of the onion—or it can include the root, stem, or skin. The onions can be dry-roasted before they’re pulverized, resulting in a golden-brown, mellow-but-toasty powder—or not! Regardless, what you’re getting is undeniably distinct from a whole onion.Onion powder offers provides that umami-forward, almost nostalgic-tasting something-something that keeps you coming back bite after bite. Use it where you would garlic powder—when you want to introduce big flavor without additional wetness or texture: Think dry rubs, popcorn seasoning, potato chips, mixed nuts, hamburgers, or the dredging for chicken cutlets.Adding raw onion to potato chips would be... not good. These get their irresistible flavor from onion powder, instead.\nPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiAnd sometimes, fresh onions and onion powder can actually enhance each other. Want to throw a pinch into this onion dip? Go right ahead. Want to add some to a frittata or scramble? Fine! This potato salad was actually developed with the idea that each has something to give. Which is all to say: There’s no reason that you can’t add onion powder to a dish that already calls for onions, but don’t use it as a 1:1 stand-in.Both onions and onion powder are delicious in their own right, and they can be even better together. It’s enough to bring tears to your eyes. (Well, at least sometimes.)The more you know, the better your potato salad will be:Sour Cream and Onion Potato SaladThis recipe was an excuse to combine our favorite potato chip flavor with the creamy, salty \"salad\" of our dreams. To hammer that home, the whole dish is topped with crumbled sour cream and onion potato chips.View RecipeExplore Bon AppétitOnionOnion PowderRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-26", "author": ["Condé Nast", "Emma Wartzman"]}