{"id": "a1906ec34577a7e8341e55711a019b60", "url": "https://www.bonappetit.com/recipe/focaccia-bread", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Focaccia Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueClassic Focaccia BreadBy Claire SaffitzMarch 6, 20184.8(121)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintOur focaccia has a moist but airy crumb sandwiched between thin but ultra-crunchy top and bottom crusts, thanks to a generous amount of olive oil in the pan and on top of the dough. If you don’t already have a standard 18x13\" half sheet pan, we recommend getting one for this recipe so you have just the right proportion of crumb to crust. Make sure the pan is very clean before you start; otherwise, the dough might have a tendency to stick during baking.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonCloth Bowl Covers$18 At AmazonAteco Bowl Scraper$3 At AmazonAteco Mini Offset Spatula (Set of 2)$12 At AmazonIngredientsMakes one 18x13\" pan6¼cups bread flour (30 oz. or 850g)2¼tsp. active dry yeast (from one ¼-oz. packet)Pinch of sugar2Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt5Tbsp. extra-virgin olive oil, divided, plus more for greasing and drizzlingFlaky sea saltPreparationStep 1Combine flour and 2½ cups room-temperature water in the bowl of a stand mixer fitted with the dough hook. Mix on low speed, scraping down sides and hook as needed to incorporate any dry flour, until a shaggy dough forms. Remove dough hook and cover with cloth bowl cover. Let sit while you prepare the yeast (you can leave the dough in this state up to 2 hours).Step 2Stir yeast, sugar, and ½ cup warm water with a fork in a small bowl to dissolve. Let sit until yeast is foamy, about 5 minutes.Step 3Pour yeast mixture into stand mixer bowl and mix on low speed until dough absorbs all additional water, about 1 minute (pulse mixer on and off a couple of times at very beginning to prevent liquid from splashing over the sides). Add kosher salt and continue to mix, increasing speed to medium, until dough is extremely elastic and very sticky (it will look more like a thick batter and will stick to sides of bowl), about 5 minutes.Step 4Pour 3 Tbsp. oil into a large (preferably glass) bowl and swirl to coat sides. Scrape in dough with a large spatula or flexible bench scraper. Cover and place in a warm spot until dough is doubled in volume, 2–3 hours. If using a glass bowl, it’s helpful to mark the position of the dough at the beginning so you can accurately assess the rise (a dry-erase marker or piece of tape works).Step 5Drizzle 2 Tbsp. oil over a 18x13\" sheet pan and use fingertips to rub all over bottom and sides. Using large spatula or flexible bench scraper, fold dough inside bowl a couple of times to deflate, then scrape onto prepared baking sheet. Using oiled hands, lift up dough and fold over onto itself in half, then rotate baking sheet 90° and fold in half again. Cover dough with a piece of well-oiled plastic and let rest 10 minutes to let gluten relax.Step 6Uncover and go back in with oiled hands, gently stretching dough (to avoid tearing) across length and width of baking sheet in an even layer, working all the way to edges and into corners. If dough starts to spring back, let sit 5–10 minutes and start again. Cover again with same piece of oiled plastic and chill at least 8 hours and up to 24.Step 7Let sheet pan sit in a warm spot until dough is puffed and bubbly and nearly doubled in height, 45–65 minutes (if you’re using a standard half sheet pan, it will have risen to the very top of the sides). Meanwhile, place a rack in center of oven; preheat to 450°.Step 8Remove plastic and drizzle dough generously with more oil. Oil hands again and press fingertips firmly into dough, pushing down all the way to bottom of pan to dimple all over. Sprinkle generously with sea salt.Step 9Bake focaccia until surface is deep golden brown all over, 25–35 minutes. Let cool in pan 10 minutes. Slide a thin metal spatula underneath focaccia to loosen from sheet pan (it may stick in a couple of places, so use some elbow grease to get underneath) and transfer to a wire rack. Let cool completely before cutting as desired.Do Ahead: Focaccia can be baked 1 day ahead. Tightly wrap in plastic and store at room temperature.Step 10Photo by Alex LauHow would you rate Classic Focaccia Bread?Leave a ReviewTell us what you thinkReviews (57)Back to TopTriangleI’m leaving 5 stars because this, the website version of this recipe, is exactly the same as the version in her book, barring one difference: in her book, she calls for 3/4 cup of oil! The focaccia is exquisite if oily. I believe with the amount listed here, 5 generous tablespoons, it’s perfect. SarahTakoma Park, MD1/17/2022I use this recipe with 2 sachets of Mad Millies sourdough mix instead of yeast, you need to proof longer 48 hours so the culture takes effect.\nGary SweetmanNew Lynn Auckland NZ12/6/2021During covid times came upon this recipe and now is our most fav bread recipe ever. we do add rosemary and garlic or olives and rosemary and have tried various combinations. think the 5 tsp salt is a bit too much for our taste so I did reduce that. Best recipe try it you will never move to another focaccia. we make this at least a couple of times a month. svjmiami fl11/29/2021I’ve made this many times and it has now replaced my old favorite foccacia which is also high hydration.  I like a medium thickness and use these proportions for one 9x13 pan: 475 g flour, 1.5 tsp yeast, 400 g water, 10 g honey [mix and autolyse for 15 mins], 10 g salt [mix in, then 20 min rest and a stretch&fold, and if it seems too slack, do a second rest/stretch&fold].  I do it all in one bowl, no oil, then cover tightly and chill 24 hrs.   My family likes it best with the addition of coarsely grated Asiago or Parmesan cheese- put the cheese on after baking for 25 mins then return to the oven for a minute or two before brushing on the garlic-infused olive oil.  I always double the recipe and use two 9x13 pans because this is one of those recipes where everyone wants an outside piece. Be sure to move the baked loaf onto a wire rack immediately to preserve the lovely crispy bottom!MarySCCharleston, SC 11/1/2021Yum! Super easy and nice to make ahead. Would definitely recommend. Anonymous10/3/2021caramelized onion, fresh figs from the tree, gorgonzola people! you're welcomemantis toboggan MD south philly8/17/2021LOVE LOVE LOVE! Highly recommend topping with fresh rosemary and sliced garlic. Cooked and rose wonderfully even in high altitude. KarolinaLake Tahoe, CA4/13/2021I love this recipe!! Soo delicious and great to share with family. I've made it a number of times and will definitely continue to. I've also added different toppings on the focaccia before it bakes like bell peppers and different fresh herbs and it comes out great! Highly recommend this recipe!!AnonymousTORONTO, ON1/10/2021LOVE this recipe. My go to focaccia. I typically let it rise as long as possible per proof and it turns out wonderfully.AnonymousChicago, IL 11/15/2020I've made this several times over the past two months, and I absolutely love it. This recipe was the first time I ever made homemade bread and it's been a hit with my partner and friends. I make the dough in the evening, then let it sit in the fridge overnight so I can pull it out and bake it in the morning. The first time I made this, it stuck to the pan so badly I couldn't eat half of it despite all attempts to dislodge it from the pan. Since then, I've made it with parchment paper lining the bottom of the pan, and it's turned out beautifully every time and I can pull it right out. I top mine with fresh rosemary and salt before baking. Additionally, beware of overmixing - I've had to trash at least one batch of dough because it became too tough, but now I know that once the dough has absorbed the water and yeast, I let it knead for just a bit more so that the dough is sticky and elastic, and looks like batter like the recipe says, but I stop the moment I see the dough start pulling away from the sides of the stand mixer. I would recommend this to absolutely everyone!AnonymousChicago, IL:11/11/2020I love, love, LOVE this recipe!!! My family are focaccia people and they absolutely loved when I made this recipe for them. Will continue to make this for them for years to come! OLIVEFOCACCIASan Francisco 8/30/2020Made the best bread ever with this recipe! I don’t have that much experience with baking breads but this recipe was easy to follow, and, though time consuming, simple to do. I had to adjust my oven temperature to 200C halfway as the tops looked close to burning but otherwise perfect! Would 100% make this again. Anonymous7/28/2020This is a great recipe! The bread has a beautifully crunchy crust and a tender chewy bite. It is important to use bread flour and high-quality olive oil. I added about 1 tsp. of fresh rosemary to dough and then more on top before baking. I recommend using parchment paper to line the baking sheet. \nThe only complaint I have is that I think 2 tablespoons of salt is too much. It was salty tasting. When I make it again I will use half the salt and see if it is better. Other than that, I think it is a great recipe for great focaccia!\n1SonySan jose, CA7/11/2020SO GOOD! Baked for 27 min at 440 degrees. I even bought a new OXO nonstick half-sheet tray for this-- it did not stick at all! The greased plastic wrap was a little tricky but to my surprise, came off clean. I topped it 3 different ways for different guests: sea salt, castelvetrano olives, and caramelized shallot tomato paste (Alison Roman's recipe). Made for a birthday party and the entire tray was gone in minutes. Obsessed!Easton, PA6/28/2020Wow! Wow wow wow. So incredible. I unfortunately had no bread flour so used AP + a bit of a whole wheat. I ended up needing to add a LOT more flour to compensate for the lack of bread flour, but it still came out absolutely incredible. Can't wait to make it again!arnold_b6/5/2020Explore Bon AppétitBreadItalianEuropeanBread FlourFlourYeastOther IngredientsSideNut-FreeDairy-FreeVegetarianVeganBakingEasterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Claire Saffitz"]}