{"id": "a191997d6d6144e2eccc879373d34638", "url": "https://www.bonappetit.com/story/best-can-opener", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "The Best Can Opener Looks a Lot Like the One Your Grandma Used | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Can Opener Looks a Lot Like the One Your Grandma UsedIf it ain’t broke, don’t fix it.By Amiel StanekJanuary 14, 2022FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The best can opener has much in common with the best mouse trap: It’s almost always the simplest, possessing the fewest bells and whistles and moving parts. Because, if we’re being honest, a can opener is the kind of essential home kitchen tool that we’d really rather think about as little as humanly possible, and most innovations in “can opening technology” feel like they create more problems than they solve. We don’t want to think about how much counter space a can opener is going to take up or whether it’ll work when the power goes out or if it’s okay for it to get wet or not. We just want to be able to take it out of the drawer and open cans of chickpeas, thank you very much.Which is why we think that the best can opener for most people is the oh-so-simple EZ-DUZ-IT steel can opener. It’s cheap, will last a lifetime, and works like a champ every single time. For ease of use and reliability, you can't beat a heavy-duty, traditional can opener like the EZ, but it is also the case that certain folks in certain situations might be better served by another type of can opener—and that’s cool too. Read on to find out what kind of can-opening apparatus is best for you.The best manual can openerAs we mentioned, the EZ-DUZ-IT is pretty much our Platonic ideal of a can opener—if there was a can opener emoji, this is what it would look like. You don’t need an instruction manual, you don’t have to spend a single second wondering how it is supposed to work. All you have to do is clamp it onto the rim of the can and give the lever a few good cranks. We also really like that it has rubberized handles, which makes it easier to grip than similar all-metal versions, and that the blade is crafted from carbon steel, which maintains a sharp edge for a really long time. While it's technically dishwasher safe, the manufacturer recommends hand washing to keep it in tip-top shape. Bottom line: If it ain’t broke, don’t fix it.Photograph by Emma FishmanEZ-DUZ-IT Deluxe Can Opener$12 at Amazon$17 at WalmartThe best can opener for left-handed peopleBUT WHAT IF YOU’RE LEFT-HANDED?? Well, if you are, you’re probably sick of using a can opener made for right-handed people. And you may or may not be aware that a company called Lefty’s makes a whole bunch of products specifically for home cooks who are, well, lefties, including this simple, unfussy handheld can opener that’s designed to be gripped in your right hand and cranked with your left. The cutting wheel rotates counter-clockwise, and this model comes with a built-in bottle opener. It’s nice to feel seen, isn’t it?Left Handed Manual Can Opener$22 at AmazonThe best safety can openerSo, the one thing about the aforementioned manual can openers is that they do, in the process of opening cans, produce lids with alarmingly sharp and jagged edges. Those edges can cut your flesh! And snag your sweaters! And tear holes in your recycling bags causing all of your bottles and cans to go absolutely everywhere! To be honest these are potentialities that don’t alarm us that much, or at least not enough to switch up our can openers. But if you like to dump your recycling on the floor for small children to play with or for pets to lick, or you want to safely use leftover bean cans as pots for plants or tin can telephones, then a smooth edge can opener may be in your future. The OXO Good Grips Smooth Edge Can Opener is, in our humble opinion, the best smooth edge can opener in the game. The stainless steel wheel on the opener cuts through the side of the can rather than the top, producing lids with smooth, safe-to-touch edges. We also like the bulky, ergonomic, easy grip handles, which could be a bonus for some cooks with reduced manual dexterity. (Did you know that OXO Good Grips, which makes some of the best kitchen products out there in our book, was originally founded with folks with arthritis in mind?)OXO Good Grips Smooth Edge Can Opener$24 at Amazon$24 at Bed Bath & BeyondThe best electric can openerThere are any number of reasons why the two-handed mechanism of a classic manual can opener might not work for you. If that’s the case, an electric can opener, which can be operated with one hand, could be preferable. Rather than getting a bulky countertop model that takes up a lot of space and might even—gasp!—need to be plugged into one of the few outlets in your kitchen, opt for the Kitchen Mama, which we think is the best electric can opener on the market. It’s hardly more expensive than a manual can opener, small enough to fit in a kitchen drawer, and runs on four AA batteries instead of DC power, which gives it a huge leg up on other electric models. You simply attach the gadget to the top of the can, push a button, and watch it zoooooom right around the rim. AND it produces a safe, smooth can lid to boot. To quote the Amazon description: “Your hands deserve to be treated like royalty! No effort. No injury. Save your energy. Save time. YES YOU CAN.” Indeed.Kitchen Mama Electric Can Opener$35 $30 at Amazon$29 at WalmartCan of chickpeas? Check. Can of tuna? Check. Can opener? Check.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-14", "author": ["Condé Nast", "Amiel Stanek"]}