{"id": "a1975e94c6c18d53e150d1bacbf2fca5", "url": "https://www.bonappetit.com/recipe/melon-panzanella", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Melon Panzanella Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueMelon PanzanellaBy Anna StockwellMay 21, 2019EmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintIn this unexpected take on panzanella, chunks of ripe melon take the place of tomatoes. But the unexpected star is the brine from the Peppadew peppers: Spicy, sweet, and tart, it combines with the melon's juices and soaks into the toasted bread.Ingredients4–6 servings 2thick slices large white country-style bread, cut into 1\" pieces (about 5 cups)¼cup extra-virgin olive oil3Tbsp. white balsamic vinegar1cup jarred Peppadew peppers, torn into quarters, plus 1 Tbsp. brine1garlic clove, finely grated1tsp. finely chopped oreganoKosher saltFreshly ground black pepper½small juicy ripe cantaloupe (about 1½ lb.), rind and seeds removed, flesh cut into irregular bite-size pieces (about 4 cups)Flaky sea saltPreparationStep 1Preheat oven to 400°. Arrange bread in an even layer on a rimmed baking sheet. Bake until golden and lightly crisped, about 9 minutes; let cool.Step 2Whisk oil, vinegar, brine, garlic, and oregano in a large bowl; season with kosher salt and pepper. Add Peppadews, cantaloupe, and toasted bread and toss to combine. Let sit, tossing occasionally, at least 15 minutes and up to 1 hour.Step 3Arrange salad on a platter and sprinkle with sea salt.How would you rate Melon Panzanella?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCantaloupeMelonFruitSummerQuickEasyWeeknight MealsSideDairy-FreeNut-FreeVegetarianVeganHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}