{"id": "a19f66c1422fd609dc1201f9b3a0ed85", "url": "https://www.bonappetit.com/story/best-substitute-for-homemade-chicken-stock-water", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "No Chicken Stock? The Best Substitute Is Actually Free | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Substitute for Homemade Chicken Stock Is FreeDon't have a freezer full of quality chicken stock? You've got the next-best soup base on tap.By Claire SaffitzApril 24, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailHere at Basically, we're all about streamlining recipes. That means not calling for two ingredients where one will do, and cutting only the right corners. One ingredient I have learned to forsake, with very little detriment to most recipes, is chicken stock. Whether we’re talking about a homemade version or the store bought kind, calling for chicken stock is...kind of annoying. No matter how much you try, you almost never seem to have the good homemade stuff around when you need it, and the boxed stuff from the store, well, leaves something to be desired, and spoils quickly to boot. Fortunately, we’re here to let you in on a game-changing secret: Water makes a more than acceptable replacement for chicken stock in most soups, stews, sauces, and braises. And in many cases, water actually produces a better-tasting result.If you are the kind of person who makes homemade chicken stock on the regular and keeps it frozen in various sized containers for all your cooking needs, I truly commend you. Quality homemade stock will invariably add great depth of flavor and body to a recipe. But it’s a luxury, not a necessity—it gilds the lily, as they say. Why? Because a great number of soups, stews, and braises essentially build their own stock while they cook, so starting with a base stock isn’t really necessary. Hearty soups with relatively long cook times like minestrone, for example, are chock-full of aromatics and flavor-lending ingredients like bacon, onions, and garlic. These infuse the water with their flavor and produce a clean-tasting broth all on their own. And when dried beans are involved? Forget it! Those little legumes create such a delicious broth as they cook that adding almost anything to it would be a crime.When you've got brothy beans, you don't need no stinkin' stock.\nPeden + MunkThere are some keys to amping up flavor when using water instead of stock. Make sure you really season your cooking liquid aggressively. Store-bought stock especially tends to have a lot of added salt, so if you’re switching to water you’re probably going to have to add more salt than you’re used to adding. Consider introducing flavor boosters, like a splash of white wine, an old Parm rind, a splash of soy sauce, or a dollop of miso paste into the mix. And, if all else fails, increasing the quantity of the aromatics in a recipe—onions, garlic, celery, herbs, etc.—goes a long way as far as building flavor is concerned. Just make sure you give the ingredients time and space to give up the good stuff by simmering slowly and gently.When should you go through the trouble of using stock instead of water? Only in cases where the flavor of the stock is really essential—it wouldn't be chicken soup without good chicken stock—or when not many other aromatics are worked into the recipe, as for risotto or French onion soup. Generally speaking, though, water should be seen as a functional ingredient all on its own. Try using it instead of stock for your next stew or braise and save yourself time, effort, and money. Once you go water, you might never go back.Now, how about some flavor-packed (and stock-free!) Italian Wedding Soup?Low-Commitment Wedding SoupThis recipe takes all the right shortcuts and none of the wrong ones.View RecipeExplore Bon AppétitBasicallyChicken BrothSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Claire Saffitz"]}