{"id": "a1b0a40eb9bcecdcd069a68308058752", "url": "https://www.bonappetit.com/story/cucumber-melon-salad", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "This Cucumber-Melon Salad Has Everything Good in This World (Aka Salt and Cheese) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Cucumber-Melon Salad Has Everything Good in This World (Aka Salt and Cheese)If you’ve never thought, “Why doesn’t my fruit salad have more salt on it?”, well, why not?!By Christina ChaeyAugust 17, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenFacebookTwitterEmailIf there’s one lesson I have learned in my first summer back at Bon Appétit, it’s that the 29 years I have spent not putting salt on fruit have been, well, A HUGE MISTAKE. I’m talking burrata with plums. Cantaloupe with olive oil. And this new recipe for Cucumber and Melon Salad with Chile and Honey, which is truly the only way I want to eat melon for the rest of the summer.As is the case with roughly 40 percent of the recipes I cook, this salad was born from the mind of senior food editor Claire Saffitz. It’s the kind of salad that seems WAY fancier and difficult to make than it is, but it’s just shaving some strips of cucumber and melon and cheese, toasting nuts, and whisking together a very simple spicy-salty-sweet dressing to pour over it all. (And if you’re currently living in an air-condition-less kitchen like me, you can buy roasted pistachios and skip turning on the oven altogether.)Yep, you need one.\nPhoto by Ted CavanaughThere is one tool that will make preparing this salad infinitely easier, and, yes, it is a mandoline. Like many other BA staffers, I am really about that Benriner mandoline life. My parents had one of these around when I was growing up and then I had to buy my own when I worked as a line cook, so it’s become second nature for me to reach for one in my home kitchen. But I get that they're kind of...alarmingly sharp and scary. (Though I will say in the entire time I spent professionally cooking, the only time I required stitches was when I sliced off the corner of my right index finger off with a dull knife!!! Way more critical in my opinion to make sure your knives stay nice and sharp.) Anecdotally, I know a lot of people who opt for this smaller Oxo Good Grips hand-held mandoline slicer with a finger guard because they find the Benriner a bit too large and intimidating.Once you’re outfitted with a mandoline, go for melon and cucumber planks that aren't too paper-thin like the way we tend to shave radishes for salads. The melon and cukes will release some liquid and lose a bit of crunchiness after they’re dressed; you want the planks to have some heft to them so they don’t get droopy once they’re tossed in the dressing. You’ll also use the mandoline to shave some ricotta salata, aka pressed, salted, and dried fresh ricotta. For that, you’ll want to set the blade width to a slightly wider setting so the cheese doesn’t crumble and instead shaves into smooth sheets.Ever since I first tried this salad, it has actually felt weird to me to eat melon without some form of salt in the mix. I say this as I am eating my second whole melon of the season, which I have blanketed in chile flakes and sea salt and lime juice and 10/10 would eat again. With melon season finally upon us, it’s time to grab a handful of Diamond kosher salt and MAKE IT HAPPEN, people!Get the recipe:Cucumber and Melon Salad with Chile and HoneyConsider this salad more supporting evidence that, yes, you need a mandoline in your life.View RecipeExplore Bon AppétitCucumberMelonSaladSummerRead MoreCantaloupe and Cucumber SaladSavory Peach and Cucumber SaladcookingYou’re Gonna Try This Fruit Salad and You’re Gonna Love ItBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-17", "author": ["Condé Nast", "Christina Chaey"]}