{"id": "a1b94281040e14a81957762a3284a099", "url": "https://www.bonappetit.com/recipe/extra-flaky-pastry-dough", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Flaky Pastry Dough Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueExtra-Flaky Pastry DoughBy Carla Lalli MusicAugust 13, 20194.8(24)Read ReviewsTriangleEmailPinterestPrintPhotograph by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOur be-all, end-all recipe for perfect galette crust is adapted from food director Carla Lalli Music’s Where Cooking Begins. This quantity of dough will roll out to a 12–14-inch round, which is enough to enclose 2 pounds of fruit as a galette, or to fill a 9- or 10-inch tart pan for a pie. Either way, the all-butter crust works with nearly any fruit that’s in season (or arm’s reach). Use it to make this Fall Fruit Galette, Any Berry Galette, or Peach-Plum Galette. (For more tips, tricks, and recipes from Where Cooking Begins, click here.)IngredientsMakes enough for 1 galette or pie1½tsp. sugar¾tsp. kosher salt1⅓cups (180 g) all-purpose flour, plus more for surface¾cup (1½ sticks) chilled unsalted butterPreparationStep 1Whisk sugar, salt, and 1⅓ cups flour in a medium bowl. Cut butter into 6 rectangular pieces (if using ½-cup sticks, cut them in half crosswise, then in half again lengthwise). Toss butter in dry ingredients to coat, then dump mixture out onto a work surface. Most recipes start by pulverizing fat into small bits, but here you’ll use a rolling pin to flatten flour-coated butter into sheets that will puff into layers when baked.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 2Roll butter into flour until it is in long flexible strips, using a bench scraper to scrape butter off rolling pin or surface as needed.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 3Use bench scraper to gather mixture into a loose pile, then drizzle 4 Tbsp. ice water over.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 4Using your hands and the bench scraper, toss mixture until water is distributed, then gather into a rectangular pile.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 5Roll out dough to a long rectangle with short ends about 8\" wide, then use bench scraper to fold dough into thirds, like folding a letter. It will be very crumbly and loose; don’t panic. This turns the floury mass into a cohesive unit while creating flaky-making stacks of fat and flour.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 6Using bench scraper to help, turn rectangle 90° and repeat rolling and folding, gathering loose bits of dough from outer edges into the center and flouring surface as needed.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 7Repeat rolling and folding a third time. Dough should be somewhat homogenous and creamy-looking with some dry bits around edges. Squeeze a bit in your palm; it should loosely hold together. If not, repeat rolling and folding.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 8Wrap folded dough in plastic, then press it into a compact disk about 1\" thick. Chill 30 minutes.Photo by Michael Graydon and Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 9Roll out dough on a lightly floured surface to a 12\"–14\" round or oval about ⅛\" thick (don’t worry about cracks around perimeter). Dust surface and rolling pin with flour as needed and rotate dough often to prevent wider cracks. If dough sticks to surface, lift on one side and scatter flour underneath before continuing. Roll dough onto your pin, then unfurl it on a sheet of parchment paper. Slide onto a rimmed baking sheet and chill while you prep the filling.Photo by Michael Graydon + Nikole Herriott, Food Styling by Susie Theodorou, Prop Styling by Kalen KaminskiStep 10Do Ahead: Dough can be made 3 days ahead. Keep chilled, or transfer to a resealable plastic bag and freeze up to 3 months. Thaw overnight in the refrigerator before rolling out.How would you rate Extra-Flaky Pastry Dough?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleI am a fairly experienced baker for what it is with worth. I had a good struggle with this recipe. My well chilled butter kept breaking into weird chunks and the dough was a sticky mess at times. But I held faith and when all was said and done, it turned out ok. EileenNew Market8/20/2021Should the finished crust be nearly falling apart? Is it meant to be eaten with a fork and knife? Delicious but I certainly couldn’t hold a slice of my galette!Christine New York, NY12/16/2020My grandson cannot eat any dairy. He loves my pies that I make with vegetable shortening (Crisco). I would love to surprise him with a gallette. Do I dare substitute the butter with Crisco? Please advise.ZeldaScottsdale, AZ12/8/2020Oh baby, this is my forever crust now. I'm not good at making pie crust, and get tired of pie weights and parchment paper and still getting slumping crusts, so decided to go galette. The puff-pastry approach of this recipe intrigued me and I wound up using only 2 tablespoons of cold water because the dough didn't need more. It was the tenderest flakiest most delicious crust I've ever made. I mistakenly [perhaps fortuitously !] rolled, folded and turned the mess of butter and flour 3 or 4 times before adding the water, so that most of the flour was already incorporated by the time I added the water. I think less water contributed to the tenderness. Don't know if this crust would work in a pie pan, but if I ever get tired of fruit galettes [doubt it ] I'll give it a whirl. With the dreaded pie weights.Susan GardnerApex, NC12/2/2020Wow - have I missed the boat on this one. I always thought I was so cool because I could whip up a pie crust in no time in my food processor. It's good dough, don't get me wrong, but this.  A whole different thing.  So tender and flaky it almost doesn't hold up, but does.  I divided the dough in two, made a fresh fig galette and an apple one too.  To die for.  Wondering how it will hold up to the rigors of a real pie, we shall see, but I can't wait to try!JoySan Diego, CA11/7/2020Easily the best pastry dough I’ve made. I was intimidated by the steps and it wasn’t overwhelming. Turned out beautifully and made me wonder why I ever bothered with simple pie crust. It’s the kind of dough that’s on its own, without filling, you want to eat. Elena SSeattle, WA10/26/2020Wow! This turned out incredible! It was much less complicated than it seemed, too. I don’t have a bench scraper, but improvised by using a small cutting board as the bench scraper and it worked pretty well. Also, I doubled the recipe and it still turned out perfectly! The flakiness and tenderness of the crust is unbelievable. I can’t wait to make this again. Thanks for sharing this technique!AnonymousMinneapolis7/26/2020Absolutely amazing, I already made three different galettes with this dough and they always came out super flaky and delicious! If you’re thinking about trying this...just do it!AnonymousGermany 5/9/2020I have barely dipped my toe in the world of baking but lately I have been feeling super inspired to try new things so I gave this recipe a shot. the directions were so clear and the pasty dough was so flakey and crispy. I felt very accomplished and my dessert looked and tasted incredible. Would highly recommend trying this one out! AnonymousSan Diego 10/18/2019Explore Bon AppétitDoughGaletteDessertTartNut-FreeVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Carla Lalli Music"]}