{"id": "a1caf6769619cda70066cd504199f5aa", "url": "https://www.bonappetit.com/city-guides/washington-dc/venue/the-line", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "The Line Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginwashington dcThe LineThe kind of place you might hang out at, even if you aren’t staying thereFacebookPinterestTwitterEmailJames C. JacksonFinally, a hotel that doesn’t feel stiff and sterile, but also isn’t trying too hard to be hip (and the staff is exceedingly friendly). The Line, located in a former historic church in the heart of Adams Morgan, opened its doors in late 2017. It’s been filled with a steady stream of freelancers with laptops during the day, and friends catching up over cocktails and dinner at night. Oh, right, and there are guests, too. The rooms feel a bit like that understated apartment your friend had in college... but more adult.For a casual meal in the high-ceilinged lobby, opt for Brothers and Sisters, from Erik Bruner-Yang of Maketto (get the octopus hot dog). Or, head upstairs to the hyper-locavore A Rake’s Progress, from Baltimore chef Spike Gjerde. It heavily sources ingredients from the Mid-Atlantic—think West Virginia truffle butter and rabbit-stuffed rabbit with potatoes and carrots. Michelle and Barack ate there before it was even open, which you can feel free to say to everyone at the table, every time you go.PRO TIP: You can't eat all your meals under the same (very cool) chandelier. A quick walk away is Tail Up Goat, one of our favorite DC spots. Also check out Lapis Afghan Bistro, which is a good option if you’re eating with a group. (Make reservations ahead at both!)THE DETAILS: Rooms start at $268 per night.Gary WilliamsAdrian GautAdrian GautExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-07", "author": ["Bon Appétit"]}