{"id": "a1d25e4d362e6692ae777914d1924b38", "url": "https://www.bonappetit.com/recipe/ricotta-and-clementines-with-date-vinaigrette", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Ricotta and Clementines with Date Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRicotta and Clementines with Date VinaigretteBy Lauren SchaeferMarch 15, 20184.9(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis is actually just a way to serve people a big old pile of seasoned cheese and pretend like it's a salad or something. That said, it's most delicious during the colder months, when those clementines are at their sweetest.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonCitrus Reamer$5.99 At AmazonPlate$55 At Bon Appétit MarketIngredients4 servings2Medjool dates2clementines1tsp. kosher salt, plus more½tsp. freshly ground black pepper, plus more8oz. whole-milk ricottaSmall handful of arugula1Tbsp. extra-virgin olive oilCrusty bread (for serving)PreparationStep 1Remove pits from 2 dates. Slice in half lengthwise, then thinly slice. Transfer to a small bowl.Step 2Slice 2 clementines in half crosswise. Pick out any exposed seeds and discard. Peel 2 halves, then separate into segments.Step 3Using a fork or citrus reamer, juice remaining halves over sliced dates; season with salt and pepper and toss.Step 4Mix 8 oz. ricotta, 1 tsp. salt, and ½ tsp. pepper in another small bowl. Smear across a serving plate.Step 5Scatter clementine segments over ricotta. Top with a small handful of arugula.Step 6Spoon date dressing over, then drizzle with oil. Serve with bread alongside.How would you rate Ricotta and Clementines with Date Vinaigrette?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleEveryone needs to try this. I made this last night and I’m still dreaming about it. Simple ingredients, easy to put together and so so so delicious. Already can’t wait to make it again. AnonymousToronto2/6/2022I just made this and it was one of the best things that I ever put in my mouth. For me that's saying a lot because cooking is my passion and I make a lot of awesome dishes. It's winter and I never knew that clementines are so super ripe and juicy this time of year. The arugula was from my garden picked an hour before serving. I served it with a toasted baguette sliced on a bias and the only adjustment that I had to make was to squeeze another half of a clementine into the dressing because the dates really thickened it up. I would have added toasted pistachio nuts if I had them but the dish didn't need them.AnthonyMiami1/22/2022The arugula was weird IMO, texture-wise.AnonymousColumbia, SC1/11/2020This recipe is SO simple and bright and delicious. We tested the recipe a week prior to Thanksgiving hoping we could serve it as an appetizer before the Big Meal. Good news—it's exactly what we were looking for and now my mother has no choice but to be impressed. Right, Mom??AnonymousKansas City, MO11/18/2019Great recipe! It's light and bright but seems so upscale for something that only takes a few minutes to throw together. I used mandarins instead of clementines which were fine, just a big bigger than ideal, so I would stick with clementines in the future.AnonymousSan Francisco, CA3/28/2018Explore Bon AppétitSaladRicottaCheeseClementineCitrusFruitDateDried FruitWinterQuickEasySideNut-FreeDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-15", "author": ["Condé Nast", "Lauren Schaefer"]}