{"id": "a1d9b8d1ec2250f4a44e89e25c2cc397", "url": "https://www.bonappetit.com/recipe/geng-dang-muu", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Geng Dang Muu Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueGeng Dang MuuSeptember 22, 20204.8(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintThis dish, from chef Parnass Savang of Atlanta’s Talat Market, originated with Savang’s paternal grandmother, who made it for her six children back in Laos and taught it to Savang’s father. It became one of the recipes at his parents’ restaurant, Danthai. The curry and ground pork reference the origins of the dish, while the brussels sprouts and leeks are a nod to the local ingredients of Georgia.Ingredients4 Servings6Tbsp. virgin coconut oil, divided1medium leek, white and pale green parts only, halved lengthwise, coarsely choppedKosher salt1lb. brussels sprouts, trimmed, halved through stem end¼cup red curry paste (without added salt)2tsp. palm sugar or light brown sugar2tsp. fish sauce, plus more4fresh makrut (Thai) lime leaves, 3 whole, 1 very thinly sliced1lb. ground pork113.5-oz. can unsweetened coconut milk1cup Thai basil leavesCooked jasmine rice (for serving)PreparationStep 1Heat 2 Tbsp. oil in a large skillet, preferably high-sided, over medium-high. Add leek, season lightly with salt, and cook, stirring occasionally, until most of it is golden brown, about 5 minutes. Transfer to a bowl; wipe out skillet.Step 2Pour another 2 Tbsp. oil into same skillet over medium-high. Cook brussels sprouts, in a single layer, undisturbed, until golden brown underneath, about 3 minutes. Turn over and cook until other side is browned, about 2 minutes. Transfer to bowl with leek.Step 3Wipe out skillet and heat remaining 2 Tbsp. oil (still over medium-high). Add curry paste, palm sugar, 2 tsp. fish sauce, and 3 whole lime leaves. Cook, stirring often, until paste darkens slightly, about 1 minute. Add pork and cook, stirring and breaking up, until in small pieces, about 2 minutes (pork doesn’t need to be fully cooked at this point). Pour coconut milk into skillet and reduce heat to medium. Simmer, stirring occasionally, until pork is cooked through and curry thickens slightly, about 5 minutes.Step 4Remove skillet from heat and stir in Thai basil and leek and brussels sprouts. Scatter remaining thinly sliced lime leaf over and serve with rice.How would you rate Geng Dang Muu?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleLoved this!  Great combination of flavors.  I thought the addition of Brussels sprouts and leeks was sublime.  Delicious!brushjlSolon, oh8/3/2021This was incredible! I didn't have lime leaves so I subbed a bunch of lime zest (and added some juice at the end because I love lime). The flavor was phenomenal. The curry paste I got was pretty spicy, so I might try to make my own next time to make it just a tad milder. Either way, it is so good and 100% worth making. I can't wait to have it againLaurenAustin, Texas6/11/2021So much flavour!!  I did a couple substitution, lemon leaves for lime leaves and I had some boneless chicken thighs on hand I needed to use up.  The lime/lemon leaf and the coconut milk just blend so well with the spicy curry paste.  What an absolute delight!ChrisOntario4/15/2021I make a couple of new recipes every week and this is going into my circulation, delicious and easy. I didn't find lime leaves and only had 1 red curry paste to choose from that had salt added, but it was still so good. Next time i'll find those items and it'll be even better. Thanks BA! AnonymousEugene, Oregon3/12/2021This recipe is a winner.  My wife and I have made it a couple of times.  Ours come out nice and red in color- the trick is to get a good curry paste.  They are not created equal.  Also, the lime leaves are important.  They don't taste like limes, they are their own aromatic thing.  Try to find an Asian grocery store so you can get all the right ingredients.  You'll be glad that you did.AnonymousSeattle12/16/2020This is one of the best recipes I've used from BA, and I've used a lot. I couldn't get my hands on lime leaves (though lime zest can do the trick), but I am happy that I didn't skip out on the Thai basil. I added about another tbsp of curry paste to get that nice red color. Will make it again and again. AnonymousBrooklyn, NY10/27/2020I’m torn on this one. I have access to a great Asian market, so I had all of the ingredients and a solid curry paste. It’s just a weird amalgamation of ingredients. The Brussels bring nothing to the dish. The pork makes it greasy. The lime leaves don’t affect much. But the curry tastes pretty great. Maybe make the curry (the leeks were a good addition) and use chicken thighs. I may sub the Brussels with baby bok choy. It has potential. Charlotte, NC10/21/2020So good! I used basil instead of Thai Basil and zest of 2 limes instead of the kaffir lime leaves and the flavor was amazing.\nI'm not a very big meat eater so next time i might punch up the veggies and cut down on the meat but the flavors were amazing. AnonymousPlano10/11/2020Delicious!!!\nUnfortunately I wasn't able to get the lime leaves and Thai basil, so I used three strips of lime zest (that I later removed before adding leeks and brussel sprouts) instead of the lime leaves, and fresh lime juice as topping instead of the Thai basil. Turned out great.AnonymousMontreal10/10/2020I love you, BA, but this looks absolutely nothing like your photo. Tastes fantastic, but it’s more of a white/gray/pink color than the red depicted in your picture. Simply false advertising. That being said it’s worth making. Tastes fantastic! AnonymousLos Angeles10/5/2020Ah, wow, delicious! Who needs take out when you can make this gustatory delight of a recipe? I did make sure to let the Thai basil leaves sit about a minute or two so they blended with the rest of the curry. What a comforting dish to make on the cusp of cooler temperatures.minnecookMinneapolis10/4/2020Bon Appétit's came out more red, and mine was more brown. No big deal. I wasn't a fan of the lime leaves - too sharp and bright. Are they like Bay Leaves, where you take them out after? However, the recipe has you use raw ones as garnish, and it just screams over everything else - almost like eating raw lime skin. I did really like the recipe though. I would remove the lime leaves before serving, and not use it as a garnish.kevin.godbee4140St. Petersburg, FL9/30/2020Tried this today. It was not bad, too much coconut milk, would cut it down by half next time and possibly use chicken or beef/pork cubes instead of mince.Anonymous9/30/2020Explore Bon AppétitLaotianSoutheast AsianAsianGround PorkPorkMeatCoconut MilkOther IngredientsEasyQuickWeeknight MealsMainDairy-FreeGluten-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}