{"id": "a1f0e60ca38c0e6befb378a54989a2f4", "url": "https://www.bonappetit.com/recipe/smoked-paprika-and-sun-dried-tomato-potlikker", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Smoked Paprika and Sun-Dried Tomato Potlikker Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueSmoked Paprika and Sun-Dried Tomato PotlikkerBy Carla HallFebruary 8, 20224.0(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintPotlikker (or “pot liquor”) is the brothy, nutrient-dense liquid gold traditionally left behind after boiling greens and beans. An ingredient whose use sheds light on the complex racialized history of Southern cooking, potlikker was once valued only by diligent enslaved Africans who saved the nourishing broth for their families after cooking greens. Chef Carla Hall, for whom potlikker was an essential element of her childhood, switches up the order, making potlikker from scratch to use as an ultra-concentrated broth—for Hall, that’s often the first step in imbuing a dish with layers of deep, powerful flavor.For this untraditional plant-based potlikker, Hall turns to pantry staples like smoked paprika, red wine vinegar, and sun-dried tomato paste to bring umami. If you can’t find sun-dried tomato paste, whole sun-dried tomatoes will work just fine—simply drain (if needed) and finely chop before adding.Use this potlikker as a base for Hall’s Braised Chicken Thighs With Olives and Herbs, her Brothy Pasta With Miso-Butter Turnips, or any dish that would benefit from a smoky tomato broth.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Pot$55 At AmazonMesh Sieve$13 At AmazonLadle$8 At AmazonBayco Glass Food Storage Containers$44 At AmazonIngredientsMakes about 1 quart⅔cup extra-virgin olive oil4medium onions, thinly sliced1cup garlic cloves, coarsely chopped4tsp. crushed red pepper flakes¼cup smoked paprika¼cup sun-dried tomato paste2Tbsp. red wine vinegar4tsp. Diamond Crystal or 2¼ tsp. Morton kosher saltFreshly ground black pepperPreparationStep 1Heat oil in a large pot over medium. Cook onions and garlic, stirring often, until onions are translucent, 6–8 minutes. Add red pepper flakes; cook, stirring, until fragrant, about 1 minute. Add paprika and tomato paste; cook, stirring, until tomato paste is a shade darker, about 2 minutes. Stir in vinegar, salt, and 5 cups water; season with pepper. Increase heat to medium-high and bring to a boil. Reduce heat, cover, and simmer until flavors have melded, 30–35 minutes.Step 2Strain through a fine-mesh sieve into a medium heatproof bowl; discard solids.Do Ahead: Potlikker can be made 5 days ahead. Let cool. Transfer to an airtight container and chill, or freeze up to 3 months.How would you rate Smoked Paprika and Sun-Dried Tomato Potlikker?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleAbsolutely delicious! The broth was smoky, spicy, and full flavored. I made the braised chicken recipe and the turnip and pasta recipe. Both dishes were easy and delicious. I highly recommend this recipe for easy and gourmet level weeknight meals.LeggySan Diego3/23/2022I'd give this recipe Five Stars - Absolutely Delicious. Followed it as written - it's a fabulous base with lots of possibilities!!!! \nJo-Anne Houston, TX3/5/2022Making this now and it smells wonderful.  I'm wondering though why I needed to peel the onions and garlic. Wouldn't a rough chop be OK since the solids will be discarded? I did add a whole jalepeno because we like the bit of fruity heat it gives instead of the dried pepper flakes. Going to use this in the Braised chicken thighs recipe in same article.ChickmaRio Rico AZ 2/28/2022Karla may call this Potlicker, but my mom threw a whole cut up chicken in and called it PaprikashOHSueOH2/27/2022Any suggestions how I can use this Potlikker?\nDiJBowLondon UK2/26/2022I hate to say this, but this recipe was completely underwhelming. Totally unnecessary -- the same ingredients (in adjusted quantities) could've been used in the related \"final\" chicken recipe, with at least 99% the same result. Advance prep of the potlikker was absolutely not worth the effort.\n\nI see no reason to prepare this particular potlikker in advance. That said, I'm looking forward to the same chef's fennel potlikker.StephenWAustin, TX2/23/2022Kind of surprised by the reviews so far...  This is essentially a vegetable broth that you are making as a base for other recipes.  You use a LOT of veggies, just like you'd use a lot of bones for bone broth.  Yes, 1 cup of garlic is correct (I used 2 1/2 heads, smashed, peeled then ran a knife through a couple of times to get that  1 cup).  Yes, 4 onions.  The picture shows the potlikker before it is strained through a fine mesh strainer, like instructed in the last step.  I made this first thing in the morning so flavors could meld in the fridge before making the accompanying pasta recipe (which was delicious).  It made more like 5 cups, instead of 4.  Perfect!  I had the quart I needed for the pasta and popped the last cup in the freezer to make the porkchops in the future.  My husband sat at the table and listed several other recipes we'd like to use this in while my 11 year old son gobbled up seconds.  Amazing!LBinTXTexas2/22/2022I am amazed by one cup of garlic. Is that right?Amanda RutledgeQuilcene WA2/20/2022Them there are solids, but still on stove cooking.  Got it.AnonymousMN2/20/2022Is one cup of garlic accurate?  Even for an Italian such as me, it sounds like a lot of garlic.Mary S. HittPearland, Texas2/20/2022I'm confused. The recipe says to \"discard solids\" - then what is in that photo? C DunnLos Angeles, CA2/18/2022Explore Bon AppétitDinnerStockVeganVegetarianGluten-FreeDairy-FreeNut-FreeSoul FoodAmericanSouthernPaprikaHerbs & SpicesSun-Dried TomatoTomatoVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}