{"id": "a1f78316cd98de9e7de3b767b54b0631", "url": "https://www.bonappetit.com/recipe/stir-fried-eggplant-with-pork", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Stir-Fried Eggplant with Basil and Chiles Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesStir-Fried Eggplant with Basil and ChilesBy Chris MoroccoAugust 1, 20194.5(31)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintAugust is peak eggplant season; look for Japanese and Chinese eggplants for this stir-fry recipe. They are thinner, longer, and less bitter than other varieties and become creamy-tender with minimal cooking. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients2 servings2red chiles, such as cayenne, Fresno, or jalapeño1Tbsp. honeyPinch of kosher salt3medium Japanese or Chinese eggplants (about 12 oz. total)3Tbsp. extra-virgin olive oil, divided¼lb. ground pork, ground chicken, tempeh crumbles, or crumbled tofu3garlic cloves, thinly sliced1tsp. toasted sesame seeds½cup basil leaves, plus more for serving2Tbsp. unseasoned rice vinegar2tsp. tamari or soy saucePreparationStep 1Finely chop chiles and toss in a small bowl with honey and salt. Let sit until ready to use.Step 2Slice eggplants crosswise into 3\" pieces, then quarter lengthwise. Heat 2 Tbsp. oil in a large nonstick skillet over medium-high until shimmering. Cook eggplant, tossing occasionally, until browned and crisp-tender, about 6–8 minutes. Transfer to a plate.Step 3Heat remaining 1 Tbsp. oil in same skillet. Cook pork, breaking into small pieces, until browned, about 2 minutes. Add garlic and sesame seeds and cook, tossing, until very fragrant, about 1 minute. Add ½ cup basil leaves and toss until wilted, 2–3 minutes.Step 4Stir vinegar and tamari into chile mixture. Return eggplant to skillet and add half of sauce. Cook, tossing often, until eggplant is tender, 1–2 minutes more. Season with salt if needed.Step 5Transfer eggplant stir-fry to a plate and drizzle with remaining sauce. Top with more basil.How would you rate Stir-Fried Eggplant with Basil and Chiles?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleTurned out solid! Made it with tofu, but like the other reviewers said, I think it would be better with pork. With tofu, it's missing some umami. Based on another review, I tried adding some fish sauce and miso to replace that, but I think it could do with even more of a savory punch. I fried the eggplant for a while and then put it on a plate with a lid on top so that it would steam and get even softer.SamSeattle, WA9/9/2021Hmm. I also used crumbled tofu instead of pork.  (Not fond of pork grease and fat).It was delish.  I might up the sauce by a tablespoon or so.  AnonymousNY8/1/2021This is our favorite recipe. We could make it once a week for the rest of our lives. One thing I improvised was throwing the eggplant in the oven to broil on high while cooking the meat. I like that it gets a bit crispy this way. Danae D. Santa Monica, California 6/8/2021Made with tofu and thought it was a little bland. Ended up making a second batch of sauce and using it to up the flavor, so if you’re gonna make it I would say use pork and up the sauce measurements. alliejaynedBrooklyn, NY9/18/2020We loved this! Like recipes that are veggie centric and use the meat as a Flavoring and not the main idea. Doubled the recipe. Added a few sliced scallions and a thinly sliced red pepper as we had those on hand  And served over basmati rice with a side of steamed bok  choy dressed with a ginger vinaigrette. Will repeat!Joanna HorobinBoston7/28/2020I am 13 and I decided to make this recipe and I definitely recommend it! It was super easy to make like 15~20 min, smelled and tasted great 🥰💖 MimiwikikiCalifornia 7/17/2020Really nice. Instead of pork I used a hand-chopped piece of chicken which I infused with a bit of fish sauce and soy sauce. Totally worked.\nQuestion: why wait to add the soy sauce and vinegar to the honey and chile mixture? Why not mix them all together at the same time? Is it to infuse the honey with the chiles? Does it really make any difference if you add the soy and vinegar later vs. when you first mix it? (Asking because I'm wondering if this is a \"thought through\" thing or just how it got written up for no particular reason.)AnonymousMontreal6/30/2020This is a delicious recipe. The rice vinegar & soy sauce(tamari) combination goes really well with the eggplant. Santi_MNYC, NY6/5/2020In quarantine cooking times, whenever I find myself with some ingredients I don't know what to do with, I turn to BA. This time, I had some ground pork, basil, and eggplant, and this recipe popped up. Although I ended up using a pound of ground pork, and a little more eggplant, the recipe was still delicious, and would be great over rice, or over soba noodles with a jammy egg, as my husband and I did with the leftover. Super easy and quick. Would recommend. buonjonnaAllentown, PA4/23/2020Its really really good! We ate it with some basmati rice.AnonymousToronto4/6/2020This is pretty tasty! I upped the pork so it was more of a 1:1 ratio of the eggplant and meat. Quick and easy.AnonymousNew York3/13/2020Just made this for the second time this week, extra-firm tofu in place of pork, maple syrup sub for honey, and with a bit of miso paste added is INCREDIBLE. Thank you Chris for making recipes that are vegan-friendly and delicious. 🥰Anonymous1/3/2020LOVE this recipe, fast, easy and so flavourful. We ate it with jasmine rice and pea shoots. I would recommend doubling for leftovers. Don't sleep on the fresh basil!Anonymoustoronto10/11/2019fairly bland tbhtastyrecipespls9/15/2019Didn't have basil, added fresh ginger to the sauce instead. Served it over brown rice and topped it with a poached egg and scallions. The sauce is delish and this makes excellent leftovers. AnonymousSomerville, MA9/1/2019Explore Bon AppétitStir-FryAsianEggplantVegetableChileBasilHerbs & SpicesTempehOther IngredientsTofuGround PorkPorkMeatGround ChickenChickenPoultryFresno ChileSummerQuickEasyWeeknight MealsOne-Pot MealsMainDairy-FreeHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-01", "author": ["Condé Nast", "Chris Morocco"]}