{"id": "a217329806bea1c9bb65353e0e75dd18", "url": "https://www.bonappetit.com/recipe/fried-lentils-and-bratwurst", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Fried Lentils and Bratwurst Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueFried Lentils and BratwurstBy Abra BerensSeptember 14, 20214.6(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by France BoswellEmailPinterestPrintEmailPinterestPrintLooking to do something different with the lentils sitting in your pantry? In this recipe from her new grain-and-bean-focused cookbook, Grist, chef Abra Berens recommends cooking them just until tender then frying them. Their creamy-crispy texture pairs beautifully with juicy bratwurst and a citrusy mojo sauce that’s also great on blanched vegetables, roasted potatoes, and fish. Use black or French green lentils here, as they hold their shape when cooked and will crisp up better than their larger counterparts.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMesh Sieve$13 At AmazonCitrus Juicer$7 At AmazonMedium Skillet$60 At AmazonMicroplane$16 At AmazonIngredients4 Servings1cup black or French green lentilsKosher salt2small sprigs rosemary, leaves finely chopped2garlic cloves, finely chopped¼tsp. crushed red pepper flakes⅓cup (or more) plus 2 Tbsp. extra-virgin olive oilZest and juice of 1 lemon4bratwurst1small head of cauliflower (about 1½ lb.), broken into large florets, florets sliced as thinly as possiblePreparationStep 1Cook lentils in a large saucepan of simmering salted water until tender but still firm, 20–25 minutes. Drain; transfer to a medium bowl. Let cool; pat dry.Step 2Place rosemary, garlic, and red pepper flakes in a large bowl. Heat ⅓ cup oil in a large skillet over medium-high until it begins to shimmer. Pour oil over aromatics in bowl; reserve skillet. Let sit 10 minutes, then whisk in lemon zest and juice; season rosemary mojo with salt.Step 3Meanwhile, heat remaining 2 Tbsp. oil in reserved skillet over medium-high. Cook sausages, turning occasionally and pressing down so they are making good contact with the pan, until deeply browned and they have released some fat, 7–9 minutes total. Transfer to a plate.Step 4Add lentils to skillet and increase heat to high. Season with salt; cook, stirring occasionally, until most of the lentils are crisp, about 5 minutes.Step 5Add cauliflower to bowl with rosemary mojo and toss to coat. Taste and season with more salt if needed. Add lentils and toss again. Add more oil if needed.Step 6Divide lentil salad among plates and top with sausages.Reprinted from Grist: A Practical Guide to Cooking Grains, Beans, Seeds, and Legumes by Abra Berens with permission by Chronicle Books, 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Fried Lentils and Bratwurst?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleBon Appétit, do better.  “2 small sprigs of rosemary”.  The stems on my rosemary plant look very different than those sold packaged at the grocery store. How much is “2 small sprigs” supposed to be?  Please list this as a unit measurement equivalent of teaspoons or tablespoons.   Please do the same for the lemon juice.  Fruits, veggies and herbs come in varying sizes.  Help us home cooks by taking the guess work out of your  recipes. AnonymousDallas, TX2/22/2022I love bratwurst, love lentils and can get along with cauliflower... Decided to give this a try.  So good!  The rosemary mojo is on point.  Use some high quality sausages for sure.  The whole combination of crispy lentils, crunchy cauli and a bit of pork is spot on. We'll be adding this to our weeknight rotation for a quick, tasty and relatively healthy go to. Anonymous1/6/2022If you overcook the lentils (like I did), the good news is that lentil/mojo mix makes a GREAT veggie dip.  AnonymousBaltimore MD11/14/2021Made this with beyond brats. This came together quickly with a nice payoff & plenty of flavor. I wasn't sure about the sausage/lentil/raw cauliflower combo & worried this dish would feel like it needed something.  I also thought it seemed like a lot of steps  . But I was wrong on both accounts. Made in my cast iron pan, which worked great. Will make again. AnonymousSeattle, WA10/6/2021Didn't really know what to expect as I'm not a raw cauliflower person, but this was shockingly good. That rosemary mojo could go well with many things, I'm already thinking of how to re-purpose it with other veggies. Made the recipe exactly as shown, the crispy lentils are very flavourful and the combination of the pork with the freshness of the cauliflowers just makes sense. Going in my recipe book for sure.Anonymous9/20/2021Explore Bon AppétitMainDinnerNut-FreeDairy-FreeGluten-FreeHealthyishEasyQuickWeeknight MealsFryLentilVegetableFrench LentilBlack LentilSausageMeatCauliflowerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Abra Berens"]}