{"id": "a218a729dbaff7a54c875b8ec38d6c6a", "url": "https://www.bonappetit.com/story/steak-lettuce-wraps-corn-nuts", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "The Steak Lettuce Wraps That Stole My Heart with Corn Nuts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Steak Lettuce Wraps That Stole My Heart with Corn NutsThis new recipe for spicy steak lettuce wraps needs to be on your summer dinner list.By Alyse WhitneyJuly 30, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailIn the same way I eat Caesar salads as a vehicle for cheese and croutons, I eat lettuce wraps for the sauce and crunchy things. I’ve been burned by this before at P.F. Chang’s, because I’m just not that into water chestnuts, while other Chinese chicken wraps will have crunchy wonton straps in there. Yes, please. My most recent run-in with surprise crunchies was with our new spicy steak salad wraps. The garnish is none other than CORN NUTS! The snack so crunchy that it makes your ears and teeth hurt a little. Worth it.This recipe is simple: marinate some skirt steak in the adobo sauce from canned chipotles in adobo, lime juice, salt, pepper, and neutral oil. Cook it in a ripping-hot cast iron pan, let it rest, slice, and slide into iceberg lettuce. That’s all fine and dandy, but the reason this recipe is so exciting isn’t because it’s weeknight friendly or because it’s  way to eat less carbs without feeling like you’re depriving yourself. It’s amazing because you are eating corn nuts, a snack that your mom probably didn’t let you buy from the gas station! There are radishes there for a sharp bite and extra vegetables, spicy yogurt sauce, cilantro, and lime too, but really, my eyes are on those corn nuts.Molly Baz, who developed this recipe, suggests you “lightly crush” the corn nuts. I went a little further, using a rolling pin so they’re able to coat each piece of steak like Cheetos dust. But getting a bigger piece once in a while with even more crunch is nice variation. (If you don’t have a rolling pin or a bottle of wine around, you can use the bottom of a glass, drinking cup, measuring cup, whatever you have, and crunch them up. This is also a good technique for nuts, which I learned from Molly in her orecchiette with buttermilk, peas, and pistachios video.) I thought about using peanuts instead when I couldn’t find corn nuts at Whole Foods (lol, duh) but then I went across the street to a drugstore and got two bags: one for crushing and one for munching while the steak cooked.Oh, and in the spirit of not wasting anything, I highly recommend saving that can of chipotles in adobo and making these chipotle-honey shrimp tacos. They are made with corn tortillas, but you could double up and crush some corn nuts on top too. Extra corny, just like every joke I’ve ever made. But I’m not kidding about how great these corn nuts-topped steak wraps are. Make them!Get the recipe:Spicy Steak Salad WrapsThese adobo-marinated steak wraps are garnished with corn nuts, which add salt, crunch, and sweet toasty flavors to each bite.View RecipeHere are those shrimp tacos I was talking about:Explore Bon AppétitLettuceCornSteakRead MorecookingThese Curried Tofu Collard Wraps Are My Summer AnthemBy Aliza Abarbanelrecipes4 Lettuce Wrap Recipes to Assemble, Eat, and RepeatGallery4 SlidesBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Alyse Whitney"]}