{"id": "a218b3d8f3d94b6d3b9a63b81fa559bd", "url": "https://www.bonappetit.com/story/tea-brands", "year": 2020.0, "month": 7.0, "day": 2.0, "content": "These Tea Companies Helmed By Asian-American Are Creating a More Transparent Industry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Asian-American Tea Brands Creating a More Transparent IndustryThe founders of Three Gems, Us Two, and Alaya find themselves uniquely positioned to do business differently.By MacKenzie Chung FeganJuly 9, 2020FacebookTwitterEmailPhoto by Smita SatianiFacebookTwitterEmailThe smell of jasmine tea, floral and plush, reminds Maggie Ranmu Xue of her grandfather. “My parents separated when I was little,” Xue says, “so he was the father figure in my life. I would come to him with my problems, and he would be my shifu.” Her grandpa would dispense his advice over a pot of jasmine tea—his favorite. When she was searching for a name for her tea company, she kept returning to the intimacies they shared over steaming cups of cha at his house in Shanghai. Us Two Tea was born.Halfway across the world in Akron, Ohio, Smita Satiani’s afternoons were organized around tea time. “Every day between 3 p.m. and 4 p.m, my mom would make a pot of chai. It was non-negotiable,” recalls Satiani, who co-founded Alaya Tea with fellow South Asian-American Esha Chhabra. Satiani and her sister sipped warm, spiced milk alongside their mother until they graduated to tea in junior high. “I was deemed old enough to drink caffeine around the same time I was allowed to start threading my eyebrows,” Satiani says. “Real rites of passage!”Xue and Satiani’s childhood experiences are, in many ways, at odds with the current face of tea culture in America. While sweetened, ready-to-drink iced tea still dominates the sector and the anthropomorphic menagerie of Celestial Seasonings isn’t going anywhere, younger consumers are increasingly embracing tea as a healthful alternative to other beverages. Eighty-seven percent of millennials now identify as tea drinkers, and categories like kombucha and functional tea blends are on the rise. For many non-Asian Americans, tea is associated not with weekend dim sum or lingering visits with aunties but with wellness, detoxes, and mindfulness. The founders of tea company Leaves and Flowers identify their clientele as “women who are interested in taking care of themselves.” In a juicy New York Times piece about the tea acolytes of Topanga Canyon, the former frontman of Incubus—whose ex-girlfriend performs elaborate tea ceremonies for a community of shamanic healers and supermodels—is quoted as saying, “Tea was heading in one direction, and then it got knocked towards Venice.”Us Two's lightly oxidized baozhong tea.\ncourtesy of Us TwoUs Two and Alaya are part of a micro-trend of direct-to-consumer tea companies helmed by women with roots in tea drinking cultures. For their founders, the Venicification of tea is both a boon for business and a motivation to make their voices heard in the industry. “There’s no wrong way to enjoy tea, but this overly reverent approach feels very at odds with how I experience tea when I visit my family in Chaozhou,” says Diana Zheng of Three Gems Tea, who lived in Guangdong Province for four years before her family immigrated to the United States. Her co-founder, Daphne Wu, who has since left the company, adds, “Not everyone lives in a zen garden, and you don’t need a tea master in order to have a tea ceremony. When Diana and I go back to Chaozhou, drinking tea is a casual way to connect socially with people.”Aarika Patel, owner of Suraj Spices & Teas in Nashville, grew up hating chai and was amazed when “chai tea lattes” started popping up on menus in mainstream coffee shops. “It’s always interesting when you see things from your own culture sweep across America,” says Patel, “but you don’t identify with the way it’s presented or who gets to be the face of it—like yoga.” As an Indian-American who prefers green tea to black—“the green sheep of the family,” she likes to say—Patel is not out to police who is allowed to enjoy tea and who isn’t. “But,” she adds, “it is important to remember the people behind the tea.”Those people behind the tea often get a raw deal. The supply chain for tea is lengthy; leaves are picked, processed, sold at auction, blended and packaged, and delivered to retail, with middlemen taking their cuts at each step of the process. With a box of 100 tea bags selling in grocery stores for $4, the smallholder farmers who grow the tea and the agricultural laborers who harvest it often live below the poverty line. In the Indian state of Assam, the pickers who work on large estates—mostly women—are paid well below minimum wage, making less than $2 a day and creating a climate where girls with few options are trafficked into slavery.The founders of Three Gems, Us Two, and Alaya find themselves uniquely positioned to do business differently by establishing direct relationships with farmers. \"Esha and I both speak Hindi and have worked in India before, and that familiarity with culture and customs has been enormously beneficial in working with folks on the ground,” says Satiani, who spent childhood summers in India and Pakistan. Sourcing their black and green teas directly from growers in Assam and Darjeeling ensures that they’re buying high-quality leaves that haven’t been languishing in a broker’s warehouse for months. And without several layers of middlemen, profits go straight into farmers’ pockets.Similarly, Zheng, Wu, and their co-founder Ayumi Takahashi all speak Mandarin, and they buy their tea from farmers in China and Taiwan. Three Gems currently sells six varieties of oolong—whose evocative names, like Forever Spring, Orchid Fragrance, and Duck Shit hint at the diversity of this style of tea—sourced from farms that are pesticide free if not certified organic. “Transparency is really important to us,” Zheng says, “and so we value being able to go to the farm, talk to our suppliers about their regenerative farming practices, and translate that to our customers. We know they’re not spraying with pesticides because we can see the rigor of their methods with our own eyes.”By introducing American tea drinkers to these single origin teas, Three Gems also hopes to challenge negative perceptions about China and Chinese products. “We work with farmers who are incredibly strict,” says Wu. “One grower we visited won’t even let animals from neighboring farms wander around his land because he can’t control what they eat or where they poop. We want to show people that there are great products coming out of China made by people who care about health and the earth.” To better showcase the quality of their product, Three Gems—like Alaya and Us Two—sells their tea in loose leaf form. As opposed to the broken, powdery residue typically found in tea bags, Three Gems’ oolong leaves unfurl in hot water, a scant teaspoon of dried tea blooming to fill an entire tea strainer.As with so many first-generation Americans, the founders of these tea companies are performing the role of translator, presenting their parents’ traditions in a way that can be understood by Americans who didn’t grow up drinking tea. “How do we take the best parts of Indian tea culture and introduce it to an American demographic that might drink chai and be into Ayurveda but who are not Indian?” asks Satiani. “How do we do that in a way that does not water down our tea, both metaphorically and literally?\" Satiani won’t be releasing a Pumpkin Spice Chai blend anytime soon, but she and Chhabra have been savvy about how to appeal to a tea-drinking audience that may not be able to pinpoint Darjeeling on a map. Alaya’s labels come in dusty hues of ochre, rose, and pistachio, all “soft colors/earthy tones” that would satisfy the Topanga tea ceremony's dress code. Three Gems’ logo is reminiscent of a Matisse collage; the hands holding their products sport glittery nails. Us Two, whose branding features both blobby shapes and shades of blush, sells some of their teas in bags to lower the barrier to entry for those scared off by loose leaf. The packaging might be Venice catnip—but the goods satisfy non-Asian Americans, third culture kids, and immigrants alike. “My parents may not ‘get’ our branding,” Satiani says, “but they love our tea.”Explore Bon AppétitHealthyishTeaShoppingTrendsRead MoreLifestyle\"I'm Not a Woo-Woo Wellness Ayurvedic Yoga Instructor Selling You Turmeric\"By Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-09", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}