{"id": "a2358a5812bfabe1afbd1a6331bd4014", "url": "https://www.bonappetit.com/story/fine-mesh-skimmer", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Fine Mesh Skimmer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis $6 Skimmer is the MVP of My Utensil CrockForget fine jewelry—I want fine mesh instead.By Hana AsbrinkJanuary 8, 2021FacebookTwitterEmailPhoto by Emma Fishman FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Of all the things that 2020 has brought into sharp focus, one small realization is that only some of my tools deserve their spot in my New York City kitchen. Spending so much more time at home cooking and cleaning, I’ve been surprised at what I’m reaching for to make my job easier and even―dare I say―more pleasurable during these “quarantimes.” Of course, there are my stalwart kitchen helpers (seamless silicone spatula, I’m looking at you), including some divisive players I’ll never relinquish (ahem, garlic press). And then there are some sleeper hits whose value only seems to grow with time and use. Enter the skimmer―specifically, the fine-mesh skimmer. Now, many of us know the benefits of a great spider, whose long handle and generous slotted scoop give you the ability to safely retrieve everything from chicken wings to boiled eggs with aplomb. But what about when you’re tackling a more detail-oriented task? That’s where the fine-mesh skimmer excels. Its uses are plentiful: removing the foamy scum that surfaces on a long-simmering braise or soup (think beans and bone broth); lifting that layer of cooled and hardened fat off of said bone broth; cleaning up all the residual bits in the oil after a fry-up session; and even fetching peas out of boiling water for blanching. While I’m skimming away, I keep the mesh area clean by simply flicking it into a nearby bowl filled halfway with water. After I’m done, I hand-wash the skimmer so I don’t miss any stubborn greasy areas (though this particular model does claim to be dishwasher-safe). This $6 stainless-steel model is the one I currently have. It’s billed as a hot pot skimmer, which makes total sense, as it can find errant fish balls as easily as it can keep the communal soup clear of scum. Its 4-inch diameter makes it wide enough to capture most debris, and the 9-inch-long handle (including a tiny loop for hanging) provides a safe distance from sputtering oil and hot liquids. You might be wondering what a skimmer can do that a regular old spoon cannot. Sure, a spoon will work, but its deeper bowl will also take with it perfectly fine, clean soup. Meanwhile, the fine mesh of the skimmer is a slight and shallow concave net, poised to lightly and quickly glide across a liquid, lifting off the impurities and not much more. Because the screen of the mesh is ultrafine (unlike a spider’s spaced-out basket), no particles can escape. Don’t get me wrong: I’m not advocating that everything be consommé-level clear. But never underestimate the power of a just-skimmed stock or sauce―you can taste the care that goes into one. If you’re looking for a more elegant tool to help out where the spider falls short, this affordable fine-mesh skimmer might just be the ticket.  Photo by Emma Fishman Fine-Mesh Skimmer$6 at AmazonExplore Bon AppétitShoppingSoupStockBrothRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-08", "author": ["Condé Nast", "Hana Asbrink"]}