{"id": "a23c742167c65be27abbeab90ca5f64a", "url": "https://www.bonappetit.com/recipe/double-tomato-focaccia", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Double-Tomato Focaccia Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDDouble-Tomato FocacciaFacebookPinterestTwitterEmailThis focaccia gets twice the tomato goodness through the combination of fresh cherry tomatoes and slowly sautéed and simmered sauce in the topping.PrintIngredients2½ cups all-purpose flour2½ cups bread flour1 ¼-oz. envelope active dry yeast (about 2¼ tsp.)Pinch of sugar2 Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt, plus more6 Tbsp. extra-virgin olive oil, divided, plus more10 oz. cherry tomatoes, halvedFreshly ground black pepper2 shallots, thinly sliced into rings¼ cup basil leaves, torn if large¾ cup Barilla® Vero Gusto Tomato & Basil SauceFlaky sea saltRecipe PreparationMix all-purpose flour, bread flour, and 2 cups room-temperature water in the bowl of a stand mixer fitted with the dough hook on low speed, scraping down sides and hook to incorporate any dry flour, until a shaggy dough forms, about 2 minutes. Let sit while you prepare the yeast (you can leave the dough in this state up to 2 hours).Using a fork, stir yeast, sugar, and ⅓ cup warm water in a small bowl to dissolve. Let sit until yeast is foamy, about 5 minutes.Pour yeast mixture into flour mixture and mix on low speed until liquid is absorbed, about 1 minute. Add 2 Tbsp. Diamond Crystal or 1 Tbsp. Morton kosher salt, increase speed to medium, and mix until dough is extremely elastic and very sticky (it will look more like a thick batter and stick to the sides of bowl), about 5 minutes.Pour 3 Tbsp. oil into a large bowl, preferably glass, and swirl to coat sides. Scrape in dough with a large spatula or flexible bench scraper. Cover and chill until dough is doubled in volume, 18–24 hours (alternatively, let dough sit in a warm spot, 2–3 hours).Drizzle 2 Tbsp. oil onto an 18x13\" rimmed baking sheet and coat bottom and sides with your finger. Using a large spatula or flexible bench scraper, fold dough inside bowl a couple of times to deflate, then scrape onto prepared baking sheet. Using oiled hands, lift up dough and fold in half, then rotate baking sheet 90° and fold in half again. Cover dough with a piece of lightly oiled plastic wrap and let rest 15 minutes so gluten can relax and dough can warm up slightly.Uncover dough. Gently and evenly stretch with oiled hands (to avoid tearing) all the way to edges and into the corners of baking sheet. If dough starts to spring back, let sit 5–10 minutes and start again. Cover with the same piece of plastic and let sit at room temperature until dough is puffed and bubbly and nearly doubled in height, 60–70 minutes (if you’re using a standard 18x13\" baking sheet, it will have risen to the top edge). Alternatively, cover and chill dough at least 8 hours and up to 1 day.Place a rack in middle of oven; preheat to 450°. Toss tomatoes with 1 Tbsp. oil in a medium bowl; season with kosher salt and pepper. Add shallots and basil and toss gently to combine.Remove plastic from dough and generously drizzle with more oil. Spread Vero Gusto sauce over surface, then press fingertips firmly into dough to dimple all over. Sprinkle generously with sea salt, then scatter tomato-shallot mixture over.Bake focaccia until crust is deep golden brown, tomatoes are shriveled and starting to brown, and shallots are browned, 25–30 minutes. Let cool in baking sheet 10 minutes. Slide a thin metal spatula underneath focaccia to loosen (it may stick in a couple of places, so use some elbow grease to get underneath) and transfer to a wire rack. Let cool completely before cutting as desired.Sponsored by Barilla® Vero GustoGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBarilla® Vero GustoBreadItalianCherry TomatoShallotYeastSummerSideVeganVegetarianDairy-FreeNut-FreeBakingMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}