{"id": "a2417e24dbe5118ee3a3c4f4946fe156", "url": "https://www.bonappetit.com/recipe/salty-buckwheat-chocolate-chunk-cookies", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Buckwheat Chocolate Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalty Buckwheat Chocolate Chunk CookiesBy Sarah JampelFebruary 9, 20204.7(111)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan Spungen EmailPinterestPrintEmailPinterestPrintIntroducing the first recipe in the Basically Guide to Better Baking, our 10-week, 10-recipe series to help you become a better, cooler, more confident baker. First up, a chocolate chip cookie. But not just any chocolate chip cookie. This one, which gets its speckled look, earthy, nutty flavor, and chewy middle from buckwheat flour, might just become your new favorite. You can substitute whole-wheat flour for the buckwheat flour and still get a great cookie, though it will (obviously) be missing buckwheat's distinct and complex flavor. More questions about the recipe? You can ask them on our baking forum and receive a response from one of us or your fellow bakers. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketScale$25 At AmazonSmall Saucepan$155 At AmazonSpatula$12.99 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonLarge Bowl$18 At AmazonDish Towel$6.15 At AmazonMedium #40 Cookie Scoop$16 At AmazonParchment Paper$3 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketWire Rack$23 At BA MarketIngredientsMakes 16–18½cup (1 stick) unsalted butter, cut into 8 equal pieces1cup (125 g) all-purpose flour½cup (63 g) buckwheat flour½tsp. baking powder½tsp. baking soda1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, plus more6oz. bittersweet chocolate (65–75% cacao) bars or wafers (disks, pistoles, fèves)⅔cup (133 g; packed) light brown sugar½cup (100 g) granulated sugar1large egg2large egg yolks1tsp. vanilla extractPreparationStep 1Heat ½  cup (1 stick) butter in a small saucepan over the lowest heat possible until melted (you don’t want it to sputter or brown), about 5 minutes.Step 2Meanwhile, whisk 1 cup (125 grams) all-purpose flour, ½ cup (63 grams) buckwheat flour, ½ tsp. baking powder, ½ tsp. baking soda, and 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt in a medium bowl.Step 3Coarsely chop 6 oz. bittersweet chocolate. Set aside a handful of chocolate in a small bowl.Step 4Scrape butter into a large bowl and add ⅔ cup (133 grams) light brown sugar and ½ cup (100 grams) granulated sugar. Whisk vigorously until butter has been absorbed into the sugar and no big lumps remain, about 30 seconds.Step 5Add 1 large egg, then 2 large egg yolks, one at a time, whisking until fully combined after each addition. Whisk in 1 tsp. vanilla extract. At this point, your mixture should look much lighter in color and be smooth, almost creamy.Step 6Add dry ingredients and use a rubber spatula or wooden spoon to stir until just incorporated and almost no dry streaks remain. Add chopped chocolate (but not the chocolate you reserved in the small bowl) to batter. Gently mix just to distribute. Cover bowl with an airtight bowl cover, a kitchen towel, or plastic wrap and chill 2 hours. (If you’re crunched for time, 1 hour will do, but cookies will be best after 2.)Step 7Place racks in upper and lower thirds of oven; preheat to 375°. Using a tablespoon measuring spoon, scoop out scant 2-Tbsp. portions of dough (or, if you have a scoop, this is a leveled-off #30 or a heaping #40) until you have 10 portions divided between 2 parchment-lined baking sheets (you want five per sheet—these will spread a bit!). Roll portions into balls and gently press a piece or 2 of reserved chocolate into each one. It’s okay to cram the chocolate on there—some pieces can even be vertical. Cover and chill any remaining dough.Step 8Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until edges are golden brown and centers are puffed, 8–10 minutes. (Pull at 8 if you like your cookies softer and want to guarantee they’re still soft the next day!)Step 9Working one at a time, pull baking sheets out of the oven and tap lightly on the stove to deflate cookies. Sprinkle with Diamond Crystal kosher salt (if you’re using Morton, skip it: the crystals are too large). Let cookies cool on baking sheets 5 minutes, then transfer to a wire rack and let cool completely. Let baking sheets cool (to do this fast, run them under cold water), then turn parchment paper over. Repeat process with remaining dough, dividing evenly between baking sheets, to make 6–8 more cookies.Step 10Do Ahead: Cookies can be baked 3 days ahead. Let cool; store airtight at room temperature.How would you rate Salty Buckwheat Chocolate Chunk Cookies?Leave a ReviewTell us what you thinkReviews (74)Back to TopTriangleLove these! I love them fresh from the oven so stash a bag of cookie balls in the freezer. My buckwheat has dark flecks in it which you see in the finished cookie. I use regular salt cause that's what's on hand. So delicious and not overly sweet. I'm trying them with two whole eggs instead of using 1 and 2 yolks because I never get around to using the whites. I'm not as fond of them the next day, they're just so special warm... and I'm undecided about the eggs. I do like to leave them in the fridge for a day, convinced they have better flavour.JuneKitchener, Ontario11/23/2021i live in paris, so i've had to substitute 'sucre de canne semoule' for the light brown sugar, and ´fleur de sel' for the diamond crystal. i also had to adjust the butter (using 64g melted, rather than 64g solid) to get it to work. nonetheless, they are amazing, and have been a hit with my friends, my kids and their friends ! Caroline Leeparis, france8/31/2021These are amazing!  They are great as is, but have also tried half and half for flour, browning butter, and swapping out sugar for molasses and all were wonderful. LindsayMaryland5/1/2021i live in France, where brown sugar is not easy to find. so i substituted with pure cane sugar and while they are darker, they came out really well. Anonymousparis, france 1/24/2021I hesitate to write this, because based on the reviews the cookies are perfect as-is! However, I semi-healthified these and wanted to share for anyone w/ an alternative diet, because they still came out amazing:\nI cut butter to about 3/4 of stick (also vegan butter would be perfect if stick)\nReplaced eggs with 3/4 cup of unsweetened applesauce (total)\nReplaced total sugar with 3/4 cup of coconut sugar\nSubstituted AP flour with 1:1 gluten-free AP flour\n\nSoo good and chewy!!!\nAnonymous1/10/2021Just rolling back through to say that I've never remade a recipe as much as I've remade these Salty Buckwheat cookies. I've made them so many times this year that I've lost count. The first time I made them was at the beginning of the pandemic and they became something of a daily tea-time comfort for me. Our office-wide lunch is taken at 1 PM which I maintained during working remotely. I knew each day after lunch that I had these sweet & salty babies to look forward to with a cup of tea. I love them so much and have even gone so far as to add a (heaping) teaspoon of cinnamon (I made them a million times this fall). Delicious! Also - sidebar: I couldn't find Diamond Crystal kosher salt during the height of the pandemic for some reason and instead picked up a package of Morton's Kosher salt (use with caution, saltiest salt ever!) and because I really love the salty bite of this cookie, I just spooned some Morton's planet-sized kosher salt into a mortar and pestle and crushed it to a seemingly acceptable level to sprinkle on top. Happy baking all <3 Maria Staten Island, New York12/30/2020These were absolutely delicious!  Even the dough was incredible.  They may be my go to cookie from now on.  The only change made was the addition of the caviar from one vanilla bean, but probably would have been just fine without.  Anonymous12/26/2020Delicious cookies. I almost followed the recipe exactly, but, on a whim, added 1/4 tsp. of liquid smoke and used Maldon smoked salt, both in and on the cookies. I also used chocolate chips because that's what I had. Finally, I over baked them a minute or two on purpose, because I like a crisp chocolate chip cookie. These are right up there, in my opinion, with David Lebovitz's Mesquite Chocolate Chip cookies.JohnSharon, CT12/15/2020How is this recipe different from David Lebowitz’s cookies of the same name? You seem to have copied everything from that recipe, including the processAnonymous12/12/2020My cookies don't resemble the golden brown ones that are in the magazine because I must have used a darker buckwheat flour ( Bob's Red Mill) and like other readers,  they came out flat.  I recommend you make them half the size of what is recommended and space 3 inches apart.  They spread and puff  up quite a bit, but will become flat when cooled.  I made the mistake of over baking and they became more crispy than chewy. However,  they aren't overly sweet and very addictive.CalleeGlendora. CA11/28/2020I love these cookies! I bake half and store half in the freezer (already in balls) for when I need a cookie ASAP.  But honestly, the recipe doesn't make too many for me to go through before they go stale (can't even confirm if they go stale - eat them too fast). AnonymousSeattle. WA10/20/2020These are so so good. I browned the butter and added toasted pecans, and they turned out delightfully nutty. So chewy! AnonymousWashington, DC8/30/2020Just made these and they are delish! Weighted the cookies out to 50g each and got big, flat, chewy tasty cookies! I also added some toast pumpkin seeds.Jessica DonovanLondon, UK7/7/2020My first batch were great.  Used Bob's Red Mill buckwheat flour.  It's sort of a taupe color so cookies do have a different color but the nuttiness of the buckwheat makes these special, along with the crunchy/chewy texture.  I agree with the comment about the format of Basically.  Would be great to be able to link straight to the recipe. AnninNCPA6/16/2020Silly q- did anyone use Bob's Red Mill buckwheat flour? I found it so dark in color compared to the flour used in pictures above, which made it harder to tell when they were done! Not a big deal though-these were so so so so good! thank you!! 😊AnonymousCanada6/7/2020Explore Bon AppétitCookieDessertAmericanBuckwheatFlourChocolateOther IngredientsSnackBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-09", "author": ["Condé Nast", "Sarah Jampel"]}