{"id": "a25235cc92842445c0824e665fbef3c8", "url": "https://www.bonappetit.com/recipe/healthyish-barbecued-chicken", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "Barbecued Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHealthyish Barbecued ChickenBy Chris MoroccoJuly 16, 20195.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintClassic grilled chicken gets updated with an easy, healthier barbecue sauce. The sauce can also be stored to deploy on whatever you happen to be grilling throughout the week.Ingredients4–6 servings2Tbsp. extra-virgin olive oil3garlic cloves, crushed6Tbsp. double-concentrated tomato paste½cup pure maple syrup¼cup soy sauce¼cup Worcestershire sauce2Tbsp. unseasoned rice vinegar4tsp. Sriracha or other hot sauceVegetable oil (for grill)13½–4-lb. whole chicken, cut into 6–8 pieces, or whatever bone-in cut of chicken you feel like cookingKosher saltPreparationStep 1Heat olive oil in a small saucepan over medium until hot. Cook garlic, turning occasionally, until golden brown all over, 4–5 minutes. Add tomato paste and cook, stirring constantly and scraping bottom of pot, until paste darkens, 3–4 minutes. Add maple syrup, soy sauce, Worcestershire sauce, vinegar, and Sriracha. Bring to a boil, then reduce heat to medium-low and simmer to let flavors meld, about 1 minute. Remove from heat. Transfer about half of barbecue sauce to a heatproof bowl; reserve for serving.Step 2Prepare a grill for medium-high indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off); oil grates. Season chicken generously with salt. Grill chicken over direct heat, turning every minute, until browned on all sides, 5–6 minutes. Move chicken over indirect heat and continue to grill, keeping grill covered as much as possible and turning every 5 minutes or so, until an instant-read thermometer inserted into thickest part registers 140°–145°, 18–25 minutes depending on size. Begin basting with barbecue sauce, turning chicken occasionally, until an instant-read thermometer inserted into thickest part registers 160° for breast and 165° for dark meat, about 10 minutes longer.Step 3Transfer chicken to a platter. Serve with reserved sauce alongside.Step 4Do Ahead: Barbecue sauce can be made 2 weeks ahead. Transfer to an airtight container and chill.How would you rate Healthyish Barbecued Chicken?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleGreat recipe.  The only things I changed were to decrease the hot sauce to use just 2 tsp and seared the chicken at the end for a couple of minutes to get the pretty char marks like in the picture.  Janel C.Colorado4/9/2021Julian- to answer your ? It says to reserve half of sauce for serving. So people can just put extra sauce on their chicken. Making again today Anonymousnew jersey4/12/2020EXCELLENT, this is the best barbecued chicken recipe I have ever had! The bbq sauce is excellent and grilling the chicken in indirect heat was a very good idea to prevent the chicken from burning before it cooks through. nick016NYC7/23/2019This is a question: Are you supposed to put the other half of the barbecue sauce on the chicken before you grill it? Do you marinade the chicken in it, or do you really not use the barbecue sauce until after it is cooked? It looks really good and I want to try making it.Julian  FernaldSanta Cruz, CA7/22/2019Explore Bon AppétitChickenPoultryEasyMainDairy-FreeNut-FreeHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-16", "author": ["Condé Nast", "Chris Morocco"]}