{"id": "a259d9489950616d89a5a3a327b2911b", "url": "https://www.bonappetit.com/story/how-to-buy-coffee-beans", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "How to Buy the Best Coffee Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEverything You Need to Know to Buy the Best Coffee BeansWhole or ground? New or old? Here or there? We break it all down.By Alex DelanyFebruary 25, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe easiest way to brew good coffee at home is to start with good beans. Whether you’re buying coffee at the grocery store, a coffee shop, or direct from a roaster, you need to know what to look for on a bag of coffee. And that can get confusing. But fret not. We’ve distilled all that information and handed you exactly what you need to buy the best beans you can.Let’s start by talking about black pepper. You know that freshly ground pepper is better than pre-ground pepper, right? Well, that same theory applies to coffee beans. You should buy your coffee beans whole and grind them right before you brew. The oils that drive those fruity, toasty, beautiful flavors start to degrade in quality the minute the beans are ground, much like spices. That means pre-ground coffee loses flavor as it sits in the package on a shelf in the grocery store for weeks or months or years. Making the switch from pre-ground to whole-bean will put more flavor, aroma, and energy in your cup, which is exactly what we want first thing in the morning.But there’s more information to unpack than “Whole Bean” or “Pre-Ground” on a bag of coffee. (And when we say bag, we mean bag. You shouldn’t be buying whole coffee beans out of large open barrels in your grocery store, the ones that have been exposed to oxygen and UV rays and the hands of small children.) There are two important things you should always look for on a bag of coffee. Once you really get into coffee, you can get more specific, but for now, you just want to know where your coffee was grown and where it was roasted. Tasty coffee is all about transparency, and great coffee roasters will make sure to provide as much information about the farms, regions, and roasting locations as possible. If your coffee doesn’t say where it was grown and roasted, it’s probably not that great. And we’re all about buying coffee that was roasted close to where you live or are traveling.There’s one more thing that’s even more important: when that coffee was roasted. The roast date is the most important piece of information on a bag of coffee. You want beans that were roasted no longer than two weeks ago. Once they pass that stage, they start to lose flavor. And once they hit a month, they’ll start to taste like cardboard. Can’t find the roast date? That’s because the people who made the coffee don’t want you to know when the beans were roasted. That’s not a good look, and you should definitely put those beans back on the shelf.When you pick up a bag, make sure to look for the roast date first!\nPhoto by Chelsie CraigAnd since buying whole-ground coffee is all about getting the most flavor from your beans, we’d like to ask a favor of you: Please don’t put your coffee in the freezer. The cold messes with the oils and fibers that lead to full, flavorful coffee. Instead, store the beans on your counter or in a cupboard, out of direct sunlight, sealed in the same bag they came in. And remember, you only want to buy as much coffee as you’ll drink in a week or two. Buying whole-bean coffee in bulk isn’t doing you any favors in the storage or taste departments, because of the way coffee’s flavors and aromas degrade over time.That’s all you need to know to start your brew off on the right foot. The foundation of your coffee future starts with fresh, whole-bean, transparently grown and roasted coffee. From here, there’s nothing else to do except catch a nice little caffeine buzz.Now that you've got coffee, breakfast:How to Make the Absolute Best Scrambled Eggs EverThese scrambled eggs are super soft and just a little runny, aka exactly how they should be.View StoryExplore Bon AppétitBasicallyCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-04", "author": ["Condé Nast", "Alex Delany"]}