{"id": "a25fba9b2e5c0ccf1fcb504d635327ec", "url": "https://www.bonappetit.com/recipe/lemon-cake-with-fruit", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Lemon Cake with Fruit Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueLemon Cake with FruitBy Claire SaffitzAugust 14, 20184.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintWhatever you don’t finish for dessert, you should eat for breakfast. This cake was inspired by New York Times writer Marian Burros’s famous plum torte recipe that ran in the newspaper every September from 1983 until 1989. Her original recipe calls for small plums that sink into the batter, but you’ll get the same effect with apples or berries.Ingredients12 servings1cup (2 sticks) unsalted butter, room temperature, plus more for pan2cups all-purpose flour, plus more for pan2tsp. baking powder1½tsp. kosher salt1lemon1⅔cups plus 3 Tbsp. granulated sugar3large eggs1large egg yolk3Tbsp. pear, orange, or apple brandy (optional)2lb. pears or apples, sliced, stone fruit, cut into thick wedges, blueberries, and/or blackberriesPowdered sugar (for serving)PreparationStep 1Place a rack in middle of oven and preheat to 350°. Butter and flour a 13x9\" baking pan. Whisk baking powder, salt, and 2 cups flour in a medium bowl. Finely grate lemon zest into another medium bowl. Slice lemon in half; set aside. Add 1⅔ cups granulated sugar to zest and work with your fingers until mixture is fragrant and looks like wet sand, about 1 minute.Step 2Using an electric mixer on medium speed, beat 1 cup butter in a large bowl until smooth, about 20 seconds. Add sugar mixture, increase speed to medium-high, and beat until very light and fluffy, about 5 minutes. Reduce speed to medium and add eggs one at a time, beating well between additions; mix in egg yolk. Reduce speed to low and gradually add dry ingredients. Beat just until incorporated, then add brandy and beat just until smooth. Fold batter a few times with a rubber spatula; scrape into prepared pan and smooth top. Scatter fruit over (do not press down). Squeeze a reserved lemon half over fruit (save other half for another use) and sprinkle with remaining 3 Tbsp. granulated sugar.Step 3Bake cake until sides are golden brown and top is golden, 55–65 minutes. Let cool; cut into squares. Serve dusted with powdered sugar.Step 4Do Ahead: Cake can be baked 2 days ahead. Store tightly wrapped at room temperature.How would you rate Lemon Cake with Fruit?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleI used pears and ended up with a surprising amount of leftover fruit (they just didn’t all fit on top, maybe my slices were too thin?). The cake was still plenty pear-y, but I made a syrupy sauce out of the leftovers and some cinnamon, and served the cake with that instead of the powdered sugar.  Swapped out the brandy for a bit of vanilla extract. Big hit! The lemon flavor was strong and delicious.Hana12/27/2020I made this using apricots and my family really enjoyed it! This cake is not overwhelmingly sweet which is great, my family is not into super sweet/heavy desserts, so this was perfect! I would definitely make this again!saan1wu4Toronto7/5/2020I made this with strawberries and it was fantastic! Super big crowd pleaser. I covered the cake with sliced strawberries and didn’t think it would be enough and ended up serving it with more sliced strawberries with sugar and it was perfect! Highly recommend!mlbevardAlabama5/22/2020really excellent! very easy to make and really yummy with ice cream! mon.nobleMontreal3/30/2020This cake is excellent. It's even better than the original plum torte - moister, and with more flavour. I think it's plenty lemony - don't skimp on rubbing the zest into the sugar. I used blueberries, and because I don't drink, I used vanilla extract instead of the fruit brandy. I used 1lb of blueberries instead of 2lb by accident, but I can't imagine the cake would have held together with 2lb of blueberries. 2lb of stone fruit and 2lb of berries yield very different quantities, so keep that in mind. Overall, I'll be making this again and again. AnonymousCanada8/7/2019It seems as if something is missing from the cake batter. It’s sweet, but with no actual lemon taste.Colorado 1/22/2019Explore Bon AppétitCakeDessertFruit DessertAmericanBerryFruitLemonCitrusPlumStone FruitAppleBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}