{"id": "a26625d2e77f45a6c91bf9cd58c5ea34", "url": "https://www.bonappetit.com/story/five-supersized-pasta-shapes", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "5 Supersized Pasta Shapes You Can and Should Be Using | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Can and Should Be Using These 5 Supersized Pasta ShapesMassive pasta shapes take your classic dishes to new, unexplored heights. Get ready to carbo-load.By Alex DelanyJune 5, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe working title for this article was Big-Ass Pasta. You didn’t need to know that, but we think it’s probably more fun if you do. What you do need to know is that this article is, in fact, about large pasta. Huge pasta. Pasta that is remarkably sized. Pasta is life, and this pasta is larger than life.Serving up super-sized versions of shapes you already know (or shapes that are completely new to your pasta experience) is an easy way to make your dishes more visually impressive, with zero extra work. But of all the oversized pastas, there are some that reign supreme. These are the massive pasta shapes that hold a special spot in out hearts...and on our forks.Photo by Chelsie CraigManicottiYeah, yeah. You know about manicotti already, but it’s so good that you’re probably fine with hearing about it again. Stuffing these long tubes with ricotta, smothering them in marinara sauce, and baking them until they bubble is a surefire way to any human being’s heart. There’s also a type of homemade manicotti that’s made with sheets of crepe-like pasta. Need a recipe for that? We’ve got you.Buy some manicotti shells for $2 at WalmartPhoto by Chelsie CraigPennoniIf you’re thinking, oh this looks like giant penne, congrats. You’re right. Pennoni is a blown-up version of penne that comes in both ridged and smooth varieties. We love the ridges for grabbing onto meat sauces, like a classic bolognese. And we like the smooth stiff for a classic carbonara.Buy some pennoni for $13 at JetPhoto by Chelsie CraigLumaconi GigantiYou know what’s cool about lumaconi? They’re named after snails. Lumaca means snail in Italian. That’s a fun fact for you to use at parties. No charge. All yours to use. Lumaconi giganti are also all yours to use with pastas with chunks of vegetables in the sauce. They’re neat to tuck into those snail-shaped shells.Buy some lumaconi giganti for $3 at BrandlessPhoto by Chelsie CraigFusilli GigantiThis monster-sized fusilli looks less like pasta and more like those giant drills they use to make tunnels. But instead of drilling into dirt and rocks, how about you drill into a large lake of pesto? Or maybe some romesco sauce? Those seem a lot more flavorful than dirt.Buy some fusilli gigante for $15 at JetPhoto by Chelsie CraigPaccheriThe negative space in the center of these large, smooth tubes looks awesome when plated on a giant platter with some meaty sauce or in this pork and beans pasta. Think of paccheri as a way to pack a bunch of ragú into a pasta suitcase. You fill them up with sauce and roll them right into your mouth. Bon voyage. Have a great trip.Buy some paccheri for $9 on AmazonYou know what’s good with any shape of pasta?Fettuccine AlfredoA fettuccine Alfredo recipe should never include cream; the silky sauce comes from an emulsion of grated Parmesan, melted butter, and starchy pasta water.View RecipeExplore Bon AppétitPastaShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-05", "author": ["Condé Nast", "Alex Delany"]}