{"id": "a26e2ffcd5bb13dcebcfb690466940fb", "url": "https://www.bonappetit.com/story/white-wine-connects-community", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Avis de Tempête’s “Blanc No.1\" Is a Perfectly Balanced White Wine That Connects Me to My Community | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Perfectly Balanced White Wine Connects Me to My CommunityWhen I drink Avis de Tempête’s “Blanc No.1,\" I remember small interactions and long conversations.By Marissa A. RossApril 2, 2020FacebookTwitterEmailIllustration by Katie BennFacebookTwitterEmailIn Unfiltered, Bon Appetit's wine editor Marissa Ross shares her latest favorite bottles and—you guessed it—unfiltered thoughts on natural wine.The sun had long since set behind the San Jacinto Mountains that hug the city of Palm Springs by the time I popped the bottle of Avis de Tempête’s “Blanc No.1” at one of the outdoor fireplaces that freckle the Ace Hotel. Me and Reynaldo Romero, co-owner of Las Palmas Brewing, were shooting the shit: talking wine, beer, J. Cole, SXSW, and wondering if Coachella would be cancelled too. That feels like two months ago, but it was barely two weeks. That was the last wine I shared with another human outside of my home.But that’s not why I chose to write about the Avis de Tempête’s “Blanc No.1” this month. I chose it because it’s a stunning example of Rousanne. The white grape best known for its work in France’s Northern Rhône shines particularly bright in this bottling. With mineral-driven grapes grown in France’s Savoie region and produced in the oxidative-white-wine-worshipping Jura, winemaker Raphaël Monnier has made a perfectly balanced white wine. The nose tries to be coy but can’t help but hide what you are about to sip. It tastes well-rounded with barely baked green apples drizzled with that fancy New Zealand honey your friend brought back for you, and slices of salted pear with high-acid plumes of gardenia and chamomile.I’m now drinking my sixth bottle of Avis de Tempête’s “Blanc No.1,” at home with my husband while a chicken roasts in the oven. And while this could be a moment to write some rom-com self-isolation bullshit, it’s not. Instead I’m thinking about the three times I bought this wine from Sam Zimman at Psychic Wines, and how every time we bickered because I said I’d never had it before, when truthfully I had loved it so much that I drank it immediately and forgot. And walking into Domaine LA a month ago, seeing a couple bottles left, and excitedly grabbing them.This wine isn’t just a wonderful wine. It’s a wine that’s connected me to shops and people I care about and want to support. I’d be lying if I didn’t say I’m scared of what’s happening with Covid-19. So allow me to be sappy for a moment: I’m grateful for the small interactions and long conversations that my bottles of Avis de Tempête’s “Blanc No.1” have brought me. I don’t know what the future will bring, but I know that we have to hold on to the things that connect us.Buy it: Avis de Tempête's Blanc No.1, $32All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishnatural wineUnfiltered essayRead MoreLifestyleThis Cab Franc Pairs Well with Party Subs and Basically Everything ElseBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Marissa A. Ross"]}