{"id": "a26f4a87a05f2048ed0c0ddbc0002295", "url": "https://www.bonappetit.com/story/a-beginners-guide-to-making-weed-butter", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "How to Make Weed Butter for Absolute Beginners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Beginner’s Guide to Making Weed ButterYou don’t have to be a master chef or cannabis connoisseur to make legit weed butter.By Mennlay Golokeh AggreyApril 29, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This guide is excerpted from The Art of Weed Butter by Mennlay Golokeh Aggrey. It's part of the Healthyish Guide to Cooking With, Eating, and Truly Enjoying Weed in collaboration with Broccoli. Check out their spring issue, and click here to read more about how to make cannabis delicious.Listen, you don’t have to be a master chef or cannabis connoisseur to make legit weed butter. You just need to be well-informed, patient, and organized. At the end of the day, making cannabis butter is just a very efficient way of consuming weed. It’s inconspicuous, versatile, and approachable. And I really enjoy how cannabutter helps to minimize the stigma of weed—especially in the black community. It means everything to me when middle-aged black women, like my 80-year-old great Auntie Mildred, can be provided with options like cannabis edibles to help find relief from pain symptoms.With the same principles as making weed butter, you can create infused sesame chili oil to drizzle on rice dishes, or elevated coconut oil to use for your next face oil mask.The following recipe loosely translates into 30 mg of THC per tablespoon of oil or butter. Your perfect dose will vary, but 10 mg is standard. Start by testing ¼ teaspoon of the weed butter you make and wait for about an hour. Take note of how you feel and let your body tell you whether this is a good amount, if you need more, or if you need less. Erring on the side of caution will ensure that you actually enjoy yourself and have a positive experience.Step 1: DecarboxylationThe first thing you’ll have to do is decarboxylate your cannabis. Also known as “decarbing,” this requires you to bake your weed, allowing the THC, CBD and other cannabinoids to activate. Also, it allows for lipids in butter and oil to easily bind to your weed for the ultimate cannabis infusion.What you’ll need:½ ounce of weedHand grinder or scissorsGlass baking dish or sheet panOvenWhat to do:Preheat the oven to 220° F.Gently break apart the desired amount of weed using a hand-grinder, scissors, or with hands until it’s the perfect consistency for rolling a joint— fine, but not too fine. Anything too fine will slip through cheesecloth (or a joint, for that matter). You want your cannabutter and oil to be clean and as clear as possible.Evenly spread your plant material onto the glass baking dish or sheet pan. Pop in the oven on the center rack for 20 minutes if using old or lower quality weed; 45 minutes for cured, high-grade weed; or 1 hour or more for anything that has been recently harvested and is still wet.Check on the weed frequently while it’s in the oven, gently mixing it every 10 minutes so as to not burn it. You will notice that the color of your herb will change from bright green to a deep brownish green. That’s when you know it has decarboxylated.Step 2: Cannabutter Stovetop InfusionIf you have weed, fat, time, and a kitchen, you can make weed butter with this method.What You’ll Need:1½ cup water8 ounces clarified butter, melted butter, or oil½ ounce decarboxylated cannabisMedium saucepanWooden spoonThermometerCheesecloth and/or metal strainerWhat to do:In a medium saucepan on very low heat, add water and butter.When the butter is melted, add the decarboxylated cannabis. Mix well with a wooden spoon and cover with lid.Let mixture gently simmer for 4 hours. Stir every half hour to make sure your butter isn’t burning. If you have a thermometer, check to make sure the temperature doesn’t reach above 180°.After 4 hours, strain with cheesecloth or metal strainer into a container. Let the butter cool to room temperature. Use immediately or keep in refrigerator or freezer in a well-sealed mason jar for up to six months.How to use weed butter:I’ve been slipping a little weed into a lot of recipes that aren’t in my cookbook. Most recently, I combined one tablespoon of canna-infused olive oil with 3 tablespoons of non-weed virgin olive oil to dress this juicy Charred Raw Corn salad. (It came out to 30 mg for the entire dish, and 7.5 mg per serving). It blew my mind. And not because I was stoned. I also have this thing for eating hot soup all year long, and my most recent soup fix was Chicken and Rice Soup with Garlicky Chile Oil. I spiked the garlic chile oil with weed, swapping in two tablespoons of canna-infused sesame oil for two tablespoons of vegetable oil. You can also sub a few teaspoons of infused oil into baked goods, like breakfast blondies or chocolate tahini brownies.Find more recipes for cooking with cannabutter in The Art of Weed Butter, available for $10 on Amazon or wherever books are sold.The Art of Weed Butter$22 $15 at AmazonExplore Bon AppétitHealthyishCannabisWomen in CannabisRead MoreLifestyle5 Chefs Who Are Breaking Stereotypes About “Weed Food ”Gallery5 SlidesBy Helen HollymanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Mennlay Golokeh Aggrey"]}