{"id": "a2815215f411d6da6fdd012217702137", "url": "https://www.bonappetit.com/story/do-nothing-dinner", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "The Do-Nothing Dinner I Make at Least Once a Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Do-Nothing Dinner I Make at Least Once a WeekRelieve dinner fatigue with this low-lift meal.By Carla Lalli MusicMay 21, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris MoroccoFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I love my family, and I love dinner, but I don’t always love making dinner for my family. You can call it fatigue, malaise, burnout, or a bad case of the never-ending Mondays, but when the thought of cooking another meal makes me bonk my forehead against the kitchen counter, I make “Picnic Dinner.” This is when I pepper the table with a haphazard smörgåsbord of cured meats, cheeses, toast, condiments, a salad of some sort, and a bowl of hard-boiled eggs. And even though it’s my white flag of surrender, this party platter inspires nothing but delight from my brood.“Yay, French dinner,” my husband will yell. He equates picnics with a European fantasy of parking a scooter by the side of a country road and noshing on a crunchy baguette.“German style,” my younger son will exclaim. This is because we used to have a German neighbor who regularly ate dry sausages, cheese, and pickles for his evening meal.Then my older son will bottom-line the situation: “We’re having leftovers?”Want this letter before it hits the website? Sign up for our newsletter!Absolute perfection.\nTed CavanaughHe’s not wrong. Along with preserving one’s dwindling sanity, not cooking is an opportunity to resurrect vegetables from previous meals and explore their potential as toast toppers. I also use it as an excuse to slice up leftover roast chicken, partial pork chops, or other cooked proteins and re-sell them as deli meats. It’s a real anything-goes situation and a shameless fridge-dive, and you just don’t know what you might get! I have not always had a salami hanging around, and on those occasions I’ve made a plate of crispy bacon instead. When I don’t have leafy lettuces, I have shredded up cabbage (we have never not had cabbage this whole time), which I'll dress with cider vinegar, grated ginger, salt, and a few glugs of olive oil. A plate of cucumbers could appear, or a bowl of apple wedges. Is it a Kindergarten snack? Maybe! Sometimes I have a hefty wedge of crumbly cheddar or a round of Brie-like cheese, and sometimes I have a bunch of random nubs of cheese that I’ll slice up and present all together because they need to get used up one way or another. Pickles, olives, hot sauce, mayo, room-temperature butter, and kimchi are set down on the table without explanation. Use them! Or don’t! I really don’t care.The one non-negotiable thing on these nights is a hard-boiled egg. I like to cut them in half and then use my fork to smash them onto my mayo’d bread, then top it with salt and pepper and whatever is passing as “salad” that night. I cook them the way Chris Morocco taught me: Any quantity of eggs are lowered into a pot of boiling water, then boiled gently for 10 minutes (I think this is even better than the Julia Child way: cover eggs in cold water, bring to a boil, then cover and let sit off heat for 17 minutes). After they’re done, I shock the eggs in ice water so they don’t overcook, and every time I do this I realize that it’s impossible for me to put up dinner without cooking something. I guess I just like to cook? Except when I don’t. Not every meal will be as simple as a bunch of leftovers and a hard-boiled egg, but on these nights, it’s all I can do, and it’s plenty.Explore Bon AppétitCarla NewsletterRead MorecookingNo-Cook Puttanesca Is Here To Save Your Very Sweaty SummerBy Rachel KartencookingSmashed Green Beans Are the Best Green BeansBy Molly BazcookingThe Easiest No-Cook Side You’ll Make All SeasonBy Carla Lalli MusiccookingAn Antipasto Salad Recipe for People Craving Salami SaladBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "Carla Lalli Music"]}