{"id": "a28ac2811937296c730dc199b9439104", "url": "https://www.bonappetit.com/recipe/caramelized-onions", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Caramelized Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCaramelized OnionsBy Claire SaffitzDecember 16, 20204.8(135)Read ReviewsTriangleEmailPinterestPrintBen DeweyEmailPinterestPrintEmailPinterestPrintEditor’s note: This recipe was originally published on August 3, 2017.This caramelized onions recipe gives you amazingly flavorful onions every single time. Once you’ve mastered the basic technique, you’ll use them for everything from French onion soup to onion dip to topping burgers.It’s key to use a large saucepan. The wide base gives your onions plenty of room to cook without crowding, so that the water released as they soften can evaporate (if it doesn’t, the onions will steam rather than caramelize). Another trick to get the onions to fall apart and break down fast is to slice them along their natural grain, i.e., parallel to the axis that runs between their root and top ends.Here, we break down the process step by step.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Saucepan$60 At AmazonWooden Spoon$6 At AmazonIngredientsMakes about ½ cup2large yellow onions, peeled (about 1 pound)2tablespoons unsalted butterKosher saltLow-sodium chicken broth or water (for pan; optional)PreparationStep 1Halve both onions through root end. Using the tip of your knife, cut a V-shaped notch around root to remove it (this will ensure that all slices separate when you cut the onion).Step 2Place 1 onion half on your cutting board so root end is facing you, then thinly slice onion lengthwise, starting at one side and working all the way to the other (so your knife runs through the root halfway through, not starting or ending at the root end). You’re going for slices that are ¼\"–⅛\" thick.Step 3Repeat same slicing procedure for remaining onion halves. It’s a lot of onion! But it will cook down quite a bit, so it’s best to start with a large quantity.Step 4Heat 2 Tbsp. butter in a large saucepan over medium until melted and sizzling. You can use a skillet to cook the onions, but a pan with high sides will keep the onions from flipping out onto your stove. Using a pan that also has a wide base gives water room to evaporate, allowing the onions to caramelize rather than steam.Step 5Instead of dumping in all of the onions at once, which would fill the pot and make it hard to stir (which would then cause the ones on the bottom to cook faster), start by adding just a couple of large handfuls to the pot. Cook, stirring, until onions are soft and starting to turn translucent, 1–2 minutes. Stir in a few more handfuls of onion and repeat cooking and stirring process until you’ve added all the onions. Season with a pinch of salt.Step 6Reduce heat to medium-low and continue to cook onions, stirring every few minutes to prevent them from sticking and coloring too much in any one place, until blonde-colored, 15–20 minutes. This is the point of doneness for French onion soup! If you feel like onions are getting too brown around the edges or they’re sticking, reduce your heat a bit.Step 7If you’re going for onions that are both softer and more caramelized (say for a patty melt or onion dip), keep cooking, stirring on the regular, until onions are unmistakably golden brown, another 15–20 minutes. Because most of the water has cooked off at this point, there might be some bare spots where the pot could start to burn. If this happens, stir in a splash of broth or water. The liquid will dissolve the cooked-on bits, which the onions will re-absorb.Step 8For extra-dark onions, the kind that make a great burger topping, cook until they start to almost blacken around the edges and go slightly crisp, another 10–15 minutes. This requires constant attention so they don’t burn. No one said caramelized onions were quick!Step 9Let onions cool in the saucepan, then use or transfer to an airtight container and chill. They will keep up to 1 week.How would you rate Caramelized Onions?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleSo clear and so easy!MarkNew Mexico1/30/2022This recipe works great! My onions turned out perfectly after about an hour and fifteen minutes of cook time. After cooking, I blended them with a little bit of water in my food processor to add into my Japanese curry.EricaMontreal12/13/2021These onions are 10/10. Instead of chicken stock, I mixed 1/2  a teaspoon of old bay seasoning with a splash of water. Onions are off the hook!AnnisLondon uk11/12/2021Excellent step-by-step directions with amazing results.PriscillaPhoenix10/11/2021Just plain yum. It's one recipe that will never die and with a snap of your fingers its easy peasy.beeluckyMt hood, Oregon9/4/2021This was the best cooking lesson I've had in 50 years!  I am not and never have been a cook, but got a hankering for caramelized onions. With the mini videos I could follow along easily and see which step I was on for the right finishing. Plus, I'd never thought of cutting onions as this suggested and it sure was easier. In addition, I never thought of pouring water where it had stuck to remove it. I've only washed a pan where that part had hardened and now had to be scrubbed. This made cleaning the pan much easier.\nThank you for so many tips and a fabulous recipe which I will make again.SummerdiamondPhoenix, Az7/29/2021Love the recipe, any excuse to make caramelized onions is always a great reason to make a batch. An average batch for us is about five pounds of Spanish onions. Wonderful for French Onion soup. My wife loves them as an ingredient with her egg breakfasts. Sometimes accidents while cooking leads you down unexpected paths. I turned the heat way down after getting them a delicious looking dark and uniform nearly black color. I mistakenly left them go for hours. We ended up with crunchy onions pieces that were actually wonderful mixed into salads. A tip I am offering after you attempt to loosen all the cooked bits with a little broth or water once that has cooked away . A splash of wine, madiera, brandy or cognac will release the last of the tasty morcels from the bottom of the pan and add another layer of flavor to your onions.Kenny McLarenElk Grove Village, Illinois5/1/2021This is a great simple recipe.  I carmelize and freeze into cubes.  I putt out as I need since it is just by hubby and I.  Take a few out, put on a steak, burger or whatever I need carmelized oninons with.  A real time saver.LupitaMoMadison WI11/16/2020Oh my gosh!  Absolutely delicious.  Make sure you cook LOW and SLOW!!!  \n\nOh, and I used a little leftover Champagne to deglaze.  I don't know if it makes a difference, but boy were they good!!!\n\nAnonymousPhiladelphia8/7/2020Made these onions to top burgers. Cooked them until they were like jam. Added a little sugar. They were the best.AnonymousChicago IL6/8/2020Lovey article. Great Insights. I have seen that making of your recipe require Chef Knife. Find out the  Best Chef Knife here at kitchenspend.com/best-chef-knife-under-100/SathikIndia4/30/2020The idea about adding red wine or Sherry sound really good. Thanks for sharing the tips everyone!Blondierides12/26/2019This recipe is easy to follow and delicious. I just used it on leftover Prime rib sandwiches. I added in red peppers with the last 5 minutes. Will definitely make this again.BlondieridesLake Arrowhead, California12/26/2019So I used this recipe w/ the very last bit of yellow onion I had left to use as a burger topping, thus made some reductions in the amounts I added.  Either way it came out delicious!  My knife work isn’t the best and I’m a college student so I don’t have the luxury of using any other kind of slicing tools other than my chef knife, yet it still came out great!  Granted it probably took longer to cook down because of it lol  Also I loved the tip of adding water because it cooled down the cooking of the onions w/ minimal effort and allowed me to continue w/ my mise en place for the rest of my burger toppings and whatnot. 10/10!!KR18127/17/2019This is an easy and excellent recipe. It bodes well for Thanksgiving when I make some quiche and I also make an oyster and carmelized onion dressing. These will be the hit of the evening and will be enjoyed by all and I will have enough left over for 2-3 quiches for myself. FrancisRaymondReynoldsville Pennsylvania 9/30/2018Explore Bon AppétitCondimentOnionVegetableEasyVegetarianNut-FreeGluten-FreeBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-08-03", "author": ["Condé Nast", "Claire Saffitz"]}