{"id": "a299c4c68c541974b433cdd61c28b563", "url": "https://www.bonappetit.com/story/loaf-pan", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "7 Ways to Use A Loaf Pan That Don't Involve Cake | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking7 Ways to Use A Loaf Pan That Don't Involve CakeThink beyond banana bread. By Emma WartzmanOctober 22, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Kat BoytsovaFacebookTwitterEmailA few months back, senior food editor Molly Baz developed a recipe for No-Grill Elote that involved a pretty genius move: She filled a loaf pan with the mayo mixture that covers the charred corn and rolled the cobs around in it to get them fully coated. They fit perfectly:Self-contained. No mess. This got us thinking: What else can we use a loaf pan for that isn’t cake? Look no further for a list that makes what we think of as a single-use kitchen tool not so single-use after all.Icebox cake:Okay, okay, we’re starting with the item on our list most similar to loaf cake, but we still think it counts. Loaf pans are the ideal shape and size for layering up icebox cake, whether it’s Blueberry-Lemon or Pumpkin Spice. The mold will keep the layers nice and even.The neatest icebox cake is made in a loaf pan.\nEva KolenkoIce cream, and the like:If you’re advanced enough to own an ice cream maker, you probably know that after you churn ice cream, you need to re-freeze it for several hours before you can scoop and eat. A loaf pan is the perfect vessel to do it in. In particular, a metal pan will get colder faster than tempered glass or a random airtight container. In a similar (but less fussy) vain, it should also be your go-to for sorbet, semifreddo, and no-churn ice creams, too.It's much easier to get a nice scoop of ice cream from a loaf pan than a quart container. \nPhoto by Chelsie Craig, food styling by Kat BoytsovaOther sweets:Try this Salted Chocolate Halva or these Nutty Grain and Oat Bars. A loaf pan is also great for layering up a tiramisu, as lady fingers are the exact size of the width of the pan.A cute halva package. \nCrunchy coatings:When you’re making cookies or crackers that are roll-and-slice and require a crunchy coating, a loaf pan will hold that coating in the same way as the mayo mixture for the elote. Fill the pan with sesame seeds for Pimiento Cheese Crackers, poppy seeds for these cheesy guys, or coarse sanding sugar for shortbread cookies.A loaf pan helps you get that sesame seed coat without the mess. \nMeatloaf:Even though our recipe for BA’s best meatloaf is formed directly on a sheet pan because you wrap the meat in...bacon, if you were to make a traditional version, or omit the bacon, it would go in a loaf pan.Ice shards:Associate editor Alex Delany swears that a loaf pans work great to freeze a giant ice block and then smash into shards for your next party. Stay with him: “It’s just an easy and interesting way to make ice for a larger group of cocktails that could be made with cubes,” he says. “ It makes anything in a Collins glass look ten times better.” To do it, fill a metal loaf pan up with water (again, metal is important because it gets so cold) and stick it in the freezer. Let it set overnight—it’ll take longer than a normal ice cube. When you’re ready to break it up, run cool water on the underside of the pan so that the ice slides out. Then smack a large metal or wooden spoon against the top or bottom to create the shards. (You can wrap it in a towel if you’re worried about mess, or just embrace the flying ice.)Food scraps:Opening and closing the trash can or compost every two seconds while you’re cooking gets annoying. Less annoying? Using a loaf pan to accumulate food scraps that you can toss later (you can use a bowl or quarter sheet tray, too, but for this, a vessel is a vessel is a vessel). All those pesky carrot peels, broccoli stems, and the like can be put right into the pan and then discarded all at once.Buy It: Chicago Metallic 9-Inch-by-5-Inch Loaf Pan, $10 on amazon.comAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingLoafRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Emma Wartzman"]}