{"id": "a2bba9b60b52f2c866f20e48e080474b", "url": "https://www.bonappetit.com/story/never-fail-chicken-picatta", "year": 2019.0, "month": 7.0, "day": 3.0, "content": "I Can Make Chicken Picatta and I'm the Official Worst Cook at Bon Appetit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Probably the Worst Cook at Bon Appétit and Even I Can Make Chicken PicattaIt's never let me down—which is how I know it's going to be there for you, too.By Hilary CadiganJuly 19, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Heather GreeneFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Back when I was a 17-year-old waitress at an Italian-American chain restaurant in the suburbs of Boston, chicken piccata stressed me out. Why? Because I had to carry it from the kitchen to the table, and I am clumsy, and that lemon butter sauce is very sloshy. But today, with nearly double that number of years under my belt, I can tell you that carrying a plate of chicken picatta across a restaurant swarming with crayon-wielding children is literally the only stressful thing about it.Everything else about this dish is comforting: the thin slab of dredged and browned chicken, the butter bath it swims in, the salty bursts of capers all around. It’s my go-to order at any red sauce restaurant, not just because I am mildly lactose intolerant and overdosing on cheesy food makes it harder for me to continue ignoring that fact, but because it is a perfect dish. It’s crispy-gone-soggy without ever having been that crispy in the first place. It’s rich but light (well, compared to everything else on the menu). It goes perfectly with everything: a table-side Caesar, a pile of spaghetti marinara, a bottle of house red or house white. Chicken piccata will never let you down—even when it’s bad.And you know what else is comforting? That it’s easy as hell to make a version that's definitely not bad at home.Hear me out, people, because I too am someone who once asked the question: Why would I ever make chicken piccata at home? It’s one of those dishes that seems inextricably married to its surrounds, which is to say: a red-and-white checked tablecloth, a weird pastel mural of someplace vaguely resembling Capri, a waiter named Silvio who's been standing in front of that mural longer than you’ve been alive.But what if you could conjure this exact experience without leaving your house?With this chicken piccata recipe, you can, and you will. Just like me, the officially titled Worst Cook at Bon Appétit, so you know when I say it’s actually that easy, it’s actually that easy. [Editor's note: Hilary is most definitely not the worst cook at BA.]Isn't she lovely? Isn't she wonderful?\nPhoto by Christina HolmesHere’s what you do: Cut a couple chicken breasts in half, pound ’em (so fun! use whatever hard thing you have!), season with a bit of salt, and coat them in flour. Then cook them in a skillet—no touching for two minutes so they get nice and brown on the bottom. Flip and cook for 30 more seconds, then give the cutlets a rest while you make the pan sauce.Pan sauce is simpler than it sounds: Take that skillet full of chicken-y juices and add some more olive oil, along with garlic, wine, capers, and butter. (Order and timing is important here, but that’s what recipes are for.) Something beautiful called “emulsion” happens, and what you get is this gorgeous silky buttery sauce that you may want to drink but shouldn’t—it’s for the chicken. Add lemon juice and you’re done.The other great thing here is that this dish is very hard to mess up. One time I ran out of white wine and used rosé. One time I ran out of capers and used olives. One time I executed the rest of my dinner menu very badly and had to let my poor piccata sit in the pan for half an hour before serving. But never did she ever let me down—not even once.So plate her up, jam a candle into an old wine bottle, and put on this Frank Sinatra playlist. Boom! Your tiny Brooklyn apartment is suddenly transformed into... the tiny Brooklyn red sauce joint down the street. And slosh that sauce all you want: No one is there to withhold your tip.ILY:Chicken PiccataSlices of chicken get dredged in seasoned flour, sautéed in butter, and then smothered in an addictively tangy lemon-butter pan sauce.View RecipeExplore Bon AppétitChickenItalian AmericanRed SauceNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-19", "author": ["Condé Nast", "Hilary Cadigan"]}