{"id": "a2bfc642820942476af6364f247ee69b", "url": "https://www.bonappetit.com/story/michael-w-twitty-back-to-where-it-all-began", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "I Had Never Eaten in Ghana Before. But My Ancestors Had. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Had Never Eaten in Ghana Before. But My Ancestors Had.With oral histories and a DNA test as his guides, a food historian travels to Ghana for a taste of the home he's never known.By Michael W. TwittyAugust 16, 2018FacebookTwitterEmailPhoto courtesty of Michael W. TwittyFacebookTwitterEmailThe six of us have given our undivided attention to Auntie Mabel, owner of the eponymous Mabel’s Chop Bar in Ho, Ghana. Here the kitchen is an outdoor building, a complex of covered shelters where peeling, washing, and butchering happen. Large cast-iron pots sit atop fires built on three stones. The chop bar is a place where you eat whatever is made from day to day, and today Mabel’s table is laden with ginger, garlic, suya spices (a West African version of garam masala), crushed Maggi cubes, tomatoes, and shitor, a hot pepper sauce made from bird’s eye chiles and powdered crayfish, tenderly simmered and stirred until it achieves the consistency of gravy-meets-preserves.As she prepares stock for the meat (more on that in a moment), Auntie Mabel looks every bit the African American or Afro-Caribbean grandma we know from home, right down to tasting the resultant sauce off the back of her left hand. We are in the country of the Ewe people in eastern Ghana, and Mabel’s courtyard is very still with the end-of-season dry heat, nearly 100 degrees. The covered space we sit in is a welcome shelter, and the whole scene, right down to the corrugated iron, reminds me of my first trips to the Deep South.From left, chefs Kenyatta Ashford, Josmine Evans, Kezia Curtis, and Harold Caldwell outside of Mabel’s Chop Bar.\nPhoto courtesty of Michael W. TwittyAuntie Mabel does not have time for our smartphone photos. She works with absolute disregard for our purpose, worrying instead about getting us fed before the afternoon rush. We are African American chefs who have come to Ghana to learn about the cooking of our ancestors. Our leader is fellow culinarian Ada Anagho Brown, the president of Roots to Glory Tours, a group specifically charged with bringing African Americans linked by DNA to their ancestral homelands. Four of us have never set foot in Africa, and I have never been to Ghana. Of those who have tested to get a sense of our genetic roots, all of us trace back to this country. For me, it’s a staggering 32 percent of my DNA.I am an African American, gay, Jewish culinary historian whose life has been shaped by a search for my roots and an exploration of the ways food shapes identity. Food has played a deep and active role in empowering my people to overcome oppression, and how we do so is our greatest form of cultural capital. For most African Americans, slavery forcibly cut our immediate ties to the motherland. Needing to know more about our roots has become one of the central issues in our identity. That’s why we’re here in Ghana. We need to know that this is really home.Author Michael Twitty takes photos at Cece Chop Bar in Kumasi, Ghana.\nPhoto courtesty of Michael W. TwittyBack at the chop bar, a bucket emerges from the refrigerated storage area. Power is precious in West Africa, and refrigeration in the countryside is a luxury, but Mabel is known for her dedication to cleanliness and order. She pulls off the top of the bucket and reveals the cut-up carcass of Thryonomys gregorianus, the lesser cane rat, known across English-speaking West Africa by its descriptive nickname, grasscutter. Pizza Rat has nothing on this 15-to-20-pound bad boy. Low in fat, high in protein, it is vegetarian and tender and said to be the number-one bushmeat, followed by antelope, porcupine, and certain types of snakes and lizards.Kenyatta Ashford and Josmine Evans—fellow chefs on this journey—take turns picking up the grasscutters by the tail, snapping pictures, and admiring their heft. Both chefs have roots in Louisiana, where muskrats and nutria can be dinner. Perhaps that’s the source of their fearlessness. I wince and laugh with Kezia Curtis, a caterer from Detroit, as earthy and open-minded as they come. Ada keeps saying “grah-hhs-kottah” the way the Ghanaians do, smiling and mimicking the animal’s sharp front teeth. As a Jewish guy who loves his roast chicken and brisket, I am feeling mighty not in my roots at the moment. This rat is the treif-est thing I have ever been asked to eat.Preparing herring and sardines for smoking near Accra.\nPhoto by Kenyatta AshfordMy good friend Harold Caldwell, a historical interpreter at Colonial Williamsburg and a trained chef in the 18th-century tradition, is ready to engage with old Thryonomys gregorianus. Not far from the courtyard, we walk through a back alley to the butchering yard, where a young man in his Sunday best is sweating over a fire. He places each grasscutter on the grate and quickly scrapes away the singed hair. Within seconds the carcass is white as snow. Harold, also in long sleeves and used to working in the searing heat, joins in and makes the young brother smile but stops after three scrapes, noting the singed hair on his own arms and hands. The grasscutters are gutted immediately and cut into pieces. While we watch this gruesome display, goats, cats, and chickens skulk around as if there is nothing to see, and a man arrives with freshly shot duiker, a dainty little antelope from the rainforest.Twitty (third from right) poses with his fellow travelers and local Ghanaians in Central Ghana.\nPhoto by Ada Anagho BrownWe retire to the back of the chop bar and take turns pounding fufu, a soft, gluey loaf of boiled yam. Immediately Harold and I think of possum cooked with yams, a treat mentioned often in collected oral histories from folks who were enslaved in the American South. Three women dipping pestles into water knock away at the yam in an ancient beat, making it look easier than it actually is. We stumble at the process, trying not to knock ourselves out and to keep the yam off the ground.Harold and I start singing an old song passed down by our enslaved ancestors in America, changing the words “I’m gonna beat this corn” to “I’m gonna beat this yam, unh-huh!/I’m gonna beat it good/unh-huh/gonna beat this yam/gonna beat this yam and eat it ’til my belly full!” Within seconds the women whose muscles power the chop bar are clapping and call-and-response singing with us, absolutely delighted. When the fufu is ready, we retire to the courtyard. I eat chicken and stew while everybody else chows down on the grasscutter, admiring the perfect flavor of the stock and the juicy tenderness of the meat. Harold offers me a bite, but I shake my head no. As dedicated as I am to learning about the culinary heritage of a third of my ancestors, I’m not crossing this river today.Cooking okra soup in Ewe country\nPhoto courtesty of Michael W. TwittyIn the early 1770s, my sixth great grandfather was captured at war and exiled from his homeland in the Asante Kingdom, now the central heart of present-day Ghana. Within six months of his capture he found himself enslaved in the developing James River port of Richmond. By the time it was the new capital of Virginia in 1780, he was under the lash of George Todd, a Scottish merchant whose surname would carry down through the centuries as our name while my African ancestors’ name was lost. But what mattered most remains: our Asante origins, revealed to me some 240 years later by an elderly relative and later confirmed by DNA.When oral history, genetic tests, historical context, and my informed imagination combined in a moment of revelation, my whole life danced before me. I was a teenager when I drifted into the Ghana embassy in Washington, D.C., as carelessly as you walk into a gas station. I interviewed everybody in that place, including a gentleman who became my Ghanaian cultural mentor. “The ancestors have sent me to make sure you become a proper Ghanaian man,” he said.In my mind I had been preparing for this trip for decades, nibbling at facts and words and recipes. Ghana, it seems, was calling me.Kezia Curtis stirs kenkey, a fermented corn dough.\nPhoto by Kenyatta AshfordIn Ghana, it’s clear I have inherited a remarkably rich culinary tradition, largely expressed through the chop bar. Yet everywhere we look are reminders of home. The white clay that people still eat as a sort of folk medicine in the American South is sold in the market in Kumasi. There is barbecued meat on every corner, roasted ears of corn and sweet potatoes, bits of fried chicken cooked fresh on the spot, and black-eyed-pea fritters. Deep-fried smelt and akple look like fish and grits.Here are the gourds we used to scoop water out of wells, the profusion of fruit both wild and cultivated. Street vendors sell fried everything— river shrimp, cocoyam (taro) chips, plantains, mangrove oysters, and bananas. Hospitality is in every gesture. Our cousins love cooking with us; we help clean freshly caught anchovies and stir thick pots of molten corn mush destined to be kenkey, a popular fermented starch in southern Ghana. There is silver herring, orange-red palm oil, bright pink little rock lobsters, speckled guinea fowl, deep green kontomire (cocoyam leaves that look like collard greens), and basil grown by the front door just like our grandmothers did in the Deep South.Bowls of African red rice and black-eyed peas at the Kumasi Central Market.\nPhoto courtesty of Michael W. TwittyBut this is not a food story that comes without cost. Hours after our arrival we visit the Nkrumah monument, a powerful symbol of African independence and the fight against colonialism. We learn about the welcome that Kwame Nkrumah, the man who spearheaded the movement that led to Ghana becoming the first independent nation in sub-Saharan Africa in 1957, extended to Africans in the diaspora. He wanted us here, because this place is in part where we come from. To be here, though, is to recognize a painful truth: We left as enslaved people.Coming back is reparative. We make our pilgrimage to Elmina, Anomabu, and Cape Coast Castle. “You are fulfilling your ancestors’ dream to come back home,” Ada tells us plainly. “They never thought they would come back. You are giving them peace.” We step five feet into the pitch darkness of the men’s dungeon at Cape Coast Castle, conspicuously placed under the chapel where the same men who violated women and children and subjugated formerly proud warriors prayed for their own souls’ salvation. The sea roils and roars, but I hear nothing except silence down there. And then a weeping.I turn around and my dear brother Harold, who had been bursting with joy at every new and familiar taste, is sobbing. Then we are all sobbing. This is a horrific space, where nail marks still mar the walls. Yet we are facing an inescapable gratitude. Every second endured in this hell, followed by the hell of the bottom of a boat in the Middle Passage, followed by the hell of slavery and sharecropping and Jim Crow and 40 years of liberty(-ish) have led us back here, now finally with the freedom to return our genes and souls to the place where it all began, even humanity itself.I cannot take my eyes off Josmine and Kezia. Their eyes are not their own but instead the lenses of defiant grandmothers, once young women themselves, from centuries past. The women’s dungeon has a slot in one of the doors through which those who resisted violation were fed. These are the ones who kept the roots of soul going, from the village to the market to the memories in their own minds, from here to the Middle Passage to the plantation. This place, in all its horror, is indispensable.We leave the dungeon sober and angry but still grateful. We tumble out the door of no return exhausted, watching the Fante fishermen and their children dutifully tending their nets as twilight sets in; drums and gongs signal the pulling in of the catch.The door of no return has become the door of return. We reenter the fort. A sign welcomes African Americans like ourselves—welcomes us home. We have the eyes of reclaimed orphans. Broken again, we are reset to heal in new ways. We pass around plates of jollof rice and red-red (plantains and beans cooked with red palm oil). Deep sighs turn to deep smiles and we offer up prayers of gratitude and hope, addressing one another in our new Ghanaian names—Dzifa and Sedzugi, Elikim, Yayra, Mawuli. Every step has increased knowledge of our past and set a path for the future. Aware the ancestors’ souls are inside us, we are hungrier than ever before. Akpe na Mawu, as they say in the Ewe language. Thanks be to the Creator.Michael W. Twitty is a culinary historian, food writer, and author of the James Beard Foundation’s 2018 Book of the Year, The Cooking Gene.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Michael W. Twitty"]}