{"id": "a2caf494554b104d97862701801af5b7", "url": "https://www.bonappetit.com/story/shaken-vs-stirred", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Shaken vs. Stirred? How to Mix Any Cocktail the Right Way | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShaken or Stirred? How to Mix Any Cocktail the Right WayThe way you mix matters.By Nico AvalleFebruary 4, 2022FacebookTwitterEmailPhotograph by Isa Zapata. Food Styling by Pearl Jones. Prop Styling by Dondre Stuetley. FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Anyone who’s ordered their first martini at a bar has faced what I call the OO7 dilemma: Should I order my martini shaken or stirred? Sure, James Bond takes his drink of choice straight from the shaker, but (and I’m sorry if this is controversial) James Bond is also a fictional character, not to mention a murderer. Should we really be taking his advice? I’m skeptical.I’ve been working on my bartending skills to save money on going out, and while there are lots of opinions in the world of booze, it’s a straight-up fact that the way you mix a cocktail is really, really important. It can massively alter the taste and texture of your drink long before it’s even in the glass. The difference between shaking and stirring may seem trivial, like just another step of a recipe to do with what you will, but mixing correctly is often the most important part of making a cocktail.Why does mixing matter?Mixing is obviously important for combining ingredients, but it’s far from the only reason bartenders reach for their spoons and shakers. “There are two things we’re trying to achieve whether we’re shaking or stirring a cocktail,” says Natasha David, cocktail consultant and author of the upcoming cookbook Drink Lightly. “We’re trying to dilute the cocktail, and we’re trying to chill the cocktail.”Drink Lightly by Natasha David$27 at AmazonChilling the drink with ice makes sense, but diluting a drink on purpose may seem unexpected (and even like…a rip-off?). But it’s actually a good thing. According to David, the ice that melts during the mixing process helps bind the ingredients into a cohesive drink and softens the harsh taste of uncut liquor. Mixing in the right amount of ice-cold water is the difference between drinking two-plus shots of plain gin and drinking a cool, classy martini (give or take a couple of olives).So when should I shake vs. stir a cocktail?Shake it!“The general rule of thumb is that if a cocktail has citrus, egg, cream, or any opaque ingredient, then you shake it,” David says. Essentially, that means shake when you’re mixing booze with anything that isn’t booze. A vigorous shake thoroughly combines alcoholic and nonalcoholic ingredients while quickly chilling a cocktail and incorporating air. The end result is a light and frothy drink that’s uniform all the way to the last sip.Stir it!If a cocktail’s ingredients are all liquor, you’re better off stirring it. Think classics like martinis and negronis. The biggest source of flavor in these drinks is the booze itself, so you want to preserve their character during mixing. Gently stirring the drink with ice prevents over-diluting the cocktail and keeps aeration to a minimum. The result is a smooth sipping drink with a lush, velvety mouthfeel and the right amount of bite.Build it!The last category of drinks is built cocktails, which don’t need stirring at all. These are mixed drinks like scotch and sodas or gin and tonics, along with many champagne and sparkling wine cocktails. “You have bubbles in there,” David warns, “so you don't want to flatten the drink by shaking them.” By far the easiest category to make, simply pour over ice and serve as they are.What kind of shaker should I use?The two most popular shaker designs are the Boston shaker and cobbler shaker. Boston shakers are two tin cups (or a tin and a glass) slammed together to create a seal. They’re incredibly lo-fi, but as a result, simple to use and even simpler to clean. Cobbler shakers, on the other hand, are a bit more high-tech. These bottle-shaped devices are what you probably picture when you imagine a cocktail shaker, and they come in three parts: a cup, a built-in strainer, and a cap to keep things from splattering while you shake.Cocktail Kingdom Boston Shaker SetNote: The top and bottom tins are sold separately.\n$12 at Amazon (Base)$11 at Amazon (Top)While both styles are the same in terms of function and almost certainly won’t make a difference in the quality of the drinks you make, we tend to prefer the simplicity of Boston shakers. There are fewer pieces to keep up with and no nooks and crannies to clean, which makes scrubbing them out between rounds much faster. You will need a separate strainer (we like spring-loaded Hawthorne strainers for ease of use), but luckily those are nice and cheap.Hawthorne Strainer$7 at AmazonHow should I serve my cocktails?Some stirred cocktails—like an old-fashioned—are mixed and served in the same glass, ice and all. This creates a dynamic drink whose first sip is punchy while the last one is light. (To prevent over-diluting, you can use large ice cubes when stirring and serving these cocktails as they melt more slowly.)Pretty much all other cocktails, shaken or stirred, are strained into a separate vessel before serving. Cocktails served “on the rocks” are poured from the strainer over fresh ice to keep things chilly and refreshing—ideal for bright drinks like margaritas, mai tais, and negronis. Cocktails served “up” or “straight up,” on the other hand, come without ice and are classically strained into a stemmed coupe or martini glass. If you ever get confused, you can remind yourself that the tall, stemmed glass lifts the cocktail up off the bar. You’ll often see shaken drinks like cosmos and stirred drinks like Manhattans served this way. While the glass won’t make or break your drink, the stem will help keep your hands from heating things up in the absence of ice. Still, if you don’t own martini glasses, it’s not the end of the world. You’ll just have to drink faster.Like most cooking “rules,” you shouldn’t take any of these tips as cocktail gospel. Making your own cocktails is about making drinks that are perfect for you. Once you know the basics, you can riff and experiment and tweak recipes to make the drinks you’ve been dreaming of. Shaken or stirred, you can always just make another round.Explore Bon AppétitcookingtechniqueCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-04", "author": ["Condé Nast", "Nico Avalle"]}