{"id": "a2cb8ab37c5f10888ba050145931ec6f", "url": "https://www.bonappetit.com/story/tokyo-etiquette-tips", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Before You Go to Tokyo, Learn These Etiquette Tips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptokyoBefore You Go to Tokyo, Learn These Etiquette TipsBut if you stick your chopsticks straight into your rice, you're on your own.By Kee Byung-keunMarch 13, 2018FacebookTwitterEmailPhoto by Xavier Girard LachaîneFacebookTwitterEmailWelcome to Tokyo. You've probably traveled a long way to get here, you want to have a good time, and—most importantly—you’re hungry.But the language barrier for tourists is real, and when the culture is also not your own, the risk of messing up your manners is high. While sightseeing and shopping are easy enough to fumble through with a gesture or an awkward phrase, mealtime presents many more opportunities to offend. The Japanese table is generous, but it’s also an obstacle course of small courtesies and understood decorum.Omotenashi, the Japanese value of wholeheartedly caring for guests with nothing expected in return, is a golden model of hospitality. But even gracious hosts are at their best when met with gracious customers. A rudimentary command of the language will improve your experience dramatically, but there’s obviously a vast distance between your phrasebook and the sounds that will come out of your mouth.So what can you do? Most people are willing to overlook your linguistic blunders as long as you abide by a few other rules. (But if you unceremoniously stick your chopsticks straight up in your bowl of rice, you’re going to be on your own.)Photo by Xavier Girard LachaîneFirst and foremost: Mind your manners. Tokyo is a vast, complex entity with more moving parts than the human mind can fathom—and yet it remains civil, functional, orderly, and clean thanks to social codes too complicated for this essay to cover. Be constantly aware of the others around you: Your personal space is yours, but know that it might not be more than an inch or two. On crowded trains, you might not even get that small pittance. A lot of restaurants can be cozy affairs, as well, so keep the chewing and the talking down, like your mother would want you to do.Secondly: Remember that you are not at home—both in terms of the country you are visiting and the public spaces you’ll occupy here. In Toyko, queues are real and respected—you aren’t going to be muscling your way in anywhere. Foot traffic flows in an orderly direction in public spaces. If you feel like everyone is standing on the wrong side of the escalator but you, it’s probably you that needs to move (hint: stand on the left). Trains arrive on time, and if you have an appointment or dinner reservation, you should arrive ten minutes before the scheduled time. If you are not early, you are late.Littering is not cool, and recycling is common practice. Trash cans might be harder to find than bathrooms (which are blessedly everywhere), so do what Tokyoites do and keep it in your bag until you pass a convenience store (which are also everywhere), where you’ll find all the clearly labeled bins you need. And do not expect to find a rich street food culture, because there isn’t one. Why? Because there is no eating on the street. You can parade down the sidewalk with an open can of beer, but if you’re cruising around with a mouthful of onigiri, you’re going to get stares. Snack on the train and that stare might be with you for a while.Photo by Xavier Girard LachaîneLastly, and most importantly: Restaurants here are not meant to be all things to all people. The idea is that before you have even arrived at a venue, you’ve done your research and have decided that you’d like to eat what they’re cooking. Substitutions are not done, and if you have a dietary restriction or a strong aversion, think carefully about where you want to go. It’s not the responsibility of the restaurant to honor your preferences—it’s up to you to pick the restaurant that is appropriate for you. If you don’t like seafood, do not go to a seafood izakaya. If you are a vegetarian or vegan, be aware that your choices will be severely limited. A restaurant serving tonkatsu is not going to have a vegetarian option. If you avoid MSG, you might be in for some rough waters: The Japanese don’t have any antagonism toward the ingredient, and its usage can be quite liberal.A few more things:Slurp your noodles, but don’t slurp your soup.If you know there is a line outside the noodle shop you’re at, don’t squat on your seat after you’ve finished. Someone else wants to eat, too.Pour other people’s drinks, but never pour your own unless you are alone.Sharing food is fine, but don’t pass things to each other from chopsticks to chopsticks.While on that subject, if you can’t hack it  with the local utensils, then it’s okay if you ask for more familiar ones. But if you poke a fork into a piece of sushi, no one will be able to protect you from a bit of scorn.  Just use your hands to pick the sushi up. It’s the way it was meant to be eaten, and you’ll look more in the know than you would wielding a fork. And as for those chopsticks you can’t use, just leave them on the table. They are not pointers, drumsticks, or magic wands.You may not always have to do it, but be ready to take your shoes off at the door.You may want to try everything on the menu, because it’s new and exciting, but in resource-strapped Japan, food is not to be wasted. Order as much as you want, but once it’s all spread out in front of, remember that you have to finish your food.The Japanese capital is a living, breathing leviathan that’s home to 37 million people who are not on vacation. Tokyoites are happy to open their city to you as long as you respect their way of life. Most Japanese people do not speak English and because this is Japan, they don’t need to. You’re here now. Be patient with them—and they will be patient with you.Explore Bon AppétitJapanTokyoCity GuidesTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Kee Byung-Keun"]}