{"id": "a2d5662efa94ab2dd0786815eed2eddc", "url": "https://www.bonappetit.com/recipe/kielbasa-cabbage-stir-fry", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Kielbasa-Cabbage Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueKielbasa-Cabbage Stir-FryBy Molly BazAugust 21, 20204.2(61)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe key to stress-free stir-frying is all in the prep work. Be sure to chop, slice, and grate everything before even thinking about turning on the stove. Top this dish with fried eggs to put it over the top, but it’s also great without them.Ingredients4 Servings5garlic cloves, finely grated¼cup apple cider vinegar2Tbsp. white miso1Tbsp. Dijon mustard1cup chopped walnuts3–5Tbsp. extra-virgin olive oil, dividedKosher salt14oz. kielbasa sausage, chopped into ½\" pieces½medium head of cabbage (about 1 lb.), cored, cut into 2\" piecesFreshly ground black pepper4celery stalks, leaves reserved, sliced on a diagonal4large eggs (optional)¾cup chopped dillPreparationStep 1Whisk garlic, vinegar, miso, mustard, and 3 Tbsp. water in a small bowl to combine; set sauce aside.Step 2Combine walnuts and 2 Tbsp. oil in a large skillet, preferably cast iron, and set over medium heat. Cook, stirring often, until nuts are golden brown, about 5 minutes. Using a slotted spoon, transfer to a large plate and season with salt.Step 3Wipe out skillet and add 1 Tbsp. oil, then sausage. Cook over medium-high heat, undisturbed, 3 minutes. Stir and continue to cook until sausage is mostly crisp and rust-colored, about 3 minutes longer. Using slotted spoon, transfer to plate with walnuts.Step 4Add half of cabbage to skillet and stir once to coat in oil. Cook (still over medium-high), undisturbed, until charred underneath, about 4 minutes. Add remaining cabbage, stir, and cook, stirring occasionally, until wilted, 6–8 minutes. Season with salt and lots of pepper. Return walnuts and sausage to pan; add sliced celery and reserved sauce. Cook, stirring, until coated, about 30 seconds. Remove from heat; season with more salt and pepper if needed.Step 5If topping with an egg, heat remaining 2 Tbsp. oil in a large nonstick skillet over medium-high. Crack eggs into skillet and season with salt and pepper. Cook until edges are browned and crisp and whites are just set but yolks are still runny, about 5 minutes.Step 6To serve, stir dill and celery leaves into stir-fry. Divide among plates and top each with a fried egg if desired.How would you rate Kielbasa-Cabbage Stir-Fry?Leave a ReviewTell us what you thinkReviews (37)Back to TopTriangleI wanted to love this recipe.  I really did - considering the components and the fact that we had thoroughly devoured and enjoyed a Molly Baz recipe the night before (One-Pot Gingery Chicken and Rice with Peanut Sauce).  Coupled with the glowing reviews, I was sure this would be a winner.  Not so much.  Everything appeared to be fine until I added the sauce which made the dish watery and surprisingly off-putting. Maybe it was just our family's taste buds but we couldn't finish it.  Sorry to be the skunk at the garden party but this isn't a keeper for us.  KateRichmond, VA11/3/2021This was very good, and I agree with the reviewer who said it was lighter than you would have expected. Perfect for this shoulder season. I thought it needed a carb, so served with some noodles, but not sure it's at all necessary. If so, potatoes would be fine too. I also substituted slivered almonds for the walnuts since I had them and don't like walnuts. Thought nuts would be weird, but they WORKED. Also, did the dressing on the side, and a good thing because my green market garlic was potent! Have brushed my teeth twice since dinner last night, but the garlic is lingering. Definitely no additional salt needed. Didn't do the eggs, and they weren't missed, but might try them with the leftovers. AnonymousNew York City10/2/2021Lovely one pan meal.  The flavors are delightful.  It's not a heavy dish as I initially imagined.  My only suggestion is to omit salt if the kielbasa is salted.  The egg on top was a perfect complement to the dish.  Stay true to the recipe and you can't go wrong. Diane LeachOrlando, FL8/16/2021This was the bomb! I was looking for a recipe with sausage and this popped up. Ticked all the boxes with the healthy ingredients. The smoked sausage topped it off! Will definitely make this again! Cath PAustralia6/28/2021I thought this recipe was going to be super strange, but it was actually very tasty and quite fast to pull together on a weeknight.  The walnuts were especially delicious!  I tend to like a lot of salt, but I agree with others that a light touch is better in this dish--especially if you have particularly salty sausage.  I'd recommend salting the walnuts lightly, NOT salting the cabbage (but still crank that pepper mill!), and then adjust if needed at the end.  Kudos, Molly!AnonymousNorthern VA4/14/2021Made this dish for my Polish husband on the fly - no walnuts. He loved it! Jamie P. Long Island NY 3/21/2021As with others I needed to amend the recipe a bit based on what I had. My hand me down white miso paste had yuzu, I didn’t have enough ACV and instead of adding some other vinegar I made up the difference with a leftover homemade vinaigrette, pecans for walnuts, and my dill was sad so I just left it out. I also used a Savoy cabbage, which needed a longer cooking time and didn’t really release enough of its own moisture which my pan was unhappy about. Cooking it lid on did help. The overall result was very good! I prefer the 12 tomatoes version of cabbage and kielbasa a bit better, though the flavor profile certainly has less going on it’s mainly mustard and vinegar. It requires fewer specialized ingredients and is a bit less fatty, but if I happen to have an open miso and nuts around I could see myself making this version again. My dad liked this one better so it could also be upon request. I do agree that it did not need any salt added - there would’ve been plenty from the sausage and dressing without addition and I usually think things need more salt, so proceed with caution there. BananaMartiniElkins Park, PA2/4/2021Didn't have miso, so I looked around the Web and made up what seemed like a reasonable sub: hummus (lemon/dill hummus, so matched the recipe flavor profile nicely), a touch of honey, soy sauce, and beer. Did it taste the same as if I had used miso? No idea, but the final dish was tasty. I was skeptical about the walnuts, but they added a welcome crunch. \n\nFirst day, we had it with homemade rye bread. Two days later, we had leftovers with home fries. Like many dishes, it tasted even better the 2nd time. We added mustard at the table both times, so maybe next time I'll add more to the recipe.\n\nDan WConnecticut1/30/2021This was so weird but I loved it so much. Made some pandemic life edits and it was still awesome: used a mix of broccoli & cabbage, used almonds, used veggie sausages, & even dried dill and it was still great for a week night. I cut down the nuts & oil a but to fit my calorie needs & it worked out fine. AnonymousSeattle, WA12/17/2020Very disappointing. Not worth the bother.Anonymous11/29/2020TOM BENGHAUSER-why in the world would you write something so negative when it doesn't even have anything to do with the recipe. So sad ...Sweet-n-SourEstes Park, CO11/26/2020Really unique blend of ingredients and flavors. I followed the recipe but substituted dried dill for fresh as it is what i had on hand. Next time, I might add a little butter or top it with greek yogurt as it was pretty tangy. I didnt find it too salty. It is a good stand alone dish, could omit the keilbasa for a good vegetarian meal as well. I'll make it again!Michelle Chicago11/24/2020ANONYMOUS from BOSTON, MA said that this recipe \"slaps.\" That's a Gen Z term, meaning its used by individuals between the ages of 10 and 24. I'm a little surprised that someone falling with that age range reads BA and, moreover, actually makes your recipes. \n\nMy guess is that BOSTON ANOMYMOUS heard one of her children - in all likelihood a daughter - using \"slaps\" and, in the hope that everyone will think she is oh-so-hip, has started using it herself. \n\nSo sad....\n\nTom BenghauserDenver CO11/16/2020Wowed my spouse. Deeply charred the cabbage leaves which she loves. For me - a tad too vinegary and I like it when the cabbage gets a bit softer and buttery whereas she liked them with more bite. So a bit of a conundrum if/when I make it again - which my wife has already told me is a must. EssieDeeStamford ct11/13/2020Very tasty!  As someone below also did, we omitted the dill and eggs and it was delightful.  I did make more sauce (misread the mustard amount so scaled up) and my cabbage was huge so it worked out correctly, though it looked like too much at first.  I think it would be about as good without the sausage, the cabbage and sauce were the star here, and the walnuts added little crunchy fat bombs.  Husband said next time serve with pierogies.RobinFLSouth of the south11/11/2020Explore Bon AppétitStir-FryKielbasaSausageMeatDillHerbs & SpicesWalnutNutCabbageLeafy GreensVegetableQuickEasyOne-Pot MealsWeeknight MealsMainGluten-FreeDairy-FreeKetoSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Molly Baz"]}