{"id": "a2ecf4937f2c9e01eeba2e8913778f28", "url": "https://www.bonappetit.com/story/christmas-cookie-box", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Healthier Holiday Cookie Boxes from New York City Baker Sarah Owens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleYou Still Have Time to Order This Beautiful Cookie Box For ChristmasWith organic ingredients and heirloom grains, these are the perfect gift for anyone who likes cookies, so...anyone.By Sarah JampelDecember 13, 2018FacebookTwitterEmailChelsea CraigFacebookTwitterEmailI run the risk of getting too ambitious during the holidays. I see stunning examples (A, B, C) of cookie boxes filled with a bazillion varieties of intricately-designed treats and think, \"Hey, I can do that!\" Only I, ummm, can't. (I know this because I recently tried to organize a package for a holiday swap and ended up sending brined nuts and not much else in a shoebox across the country.)So this year, I'm leaving it to the professionals—to Sarah Owens, specifically. Owens is an award-winning cookbook author and former ceramicist who started shipping her cookie boxes all over the country from her home base in New York City's Rockaway Beach in 2017, after seven years of small-scale sourdough bread baking.Instagram contentThis content can also be viewed on the site it originates from.She uses organic ingredients and heirloom grains—Sonora, Maris Widgeon, and Einkorn, for example—that have the complex flavors and aromas missing from modern flour hybrids (a.k.a. the all-purpose stuff most of us use at home). But since these flours haven't been blended, standardized, or commercialized, they're a little bit less predictable when it comes to how they'll behave in baked goods—another reason why it's best to leave the healthyish en masse cookie production to a professional grain tinkerer.Owens's cookies are not only slightly healthier but also slightly more global versions of classics: This year's box features, among its nine types, ras-el-hanout almond linzers (Owens blends the spices—including golpar, fenugreek, and anise—herself and sandwiches the cookies with homemade jam), Amarena cherry cheese spritzes, and, Owens's personal fave, raspberry cardamom chocolate chip. Made with rye flour, their fruity essence comes from a raspberry caramel that's whipped into the creamed butter, sugar, and eggs to create a cookie that's chewy in the center but ultra crispy on the edges. And, lest she forget the cookie purists, there are also chocolate crinkles and gingerbread men.The cookies are decorated in an organic, wabi-sabi fashion that I'd never be able to pull off, let alone replicate. They're more Eileen Fisher than Lilly Pulitzer—earth tones and subtle embellishments, not pastels and neon animals—because Owens believes in honoring, not masking, her materials. And besides, \"keeping the decorating relatively simple means that the cookies arrive to someone's doorstep in a similar manner to how they left my hands,\" Owens told me.And lest you think these cookies are too rustic to impress your fanciest friend, wait until you see the 24-karat gold-dusted lemon-turmeric sugar cookies. It's the holidays, after all—your loved ones deserve a little glitter and, yes, a box of these delicious cookies.Get a cookie box online starting at $35. Order by 12/16 for delivery in time for Christmas.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCookieHoliday Cookiesholiday2018Read MorecookingBake These Cookies and Upstage Any Holiday MealBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Sarah Jampel"]}