{"id": "a2ecba6a35f6fd490e5205e96f359dd5", "url": "https://www.bonappetit.com/recipe/bok-choy-with-brown-sauce-and-crispy-garlic", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Bok Choy With Brown Sauce and Crispy Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueBok Choy With Brown Sauce and Crispy GarlicBy Justin LeeApril 20, 20214.4(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Frank Frances, food styling by Lillian Chou, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintSteamed bok choy is taken to another level with this veganized take on oyster sauce from Fat Choy chef and owner Justin Lee. By marrying cooked-down mushrooms, rice wine, and soy sauce, Lee creates a condiment with a big umami punch—and a major payoff. “The addition of one condiment can vastly change the direction of a dish,” he says.Ingredients4 ServingsBrown Sauce3Tbsp. vegetable oil8oz. shiitake mushrooms, stems removed, caps thinly sliced¼cup Shaoxing wine (Chinese rice wine) or medium-dry sherry3Tbsp. soy sauceBok choy and assembly6garlic cloves, finely chopped3Tbsp. vegetable oilKosher salt1lb. baby bok choy, quartered lengthwisePreparationBrown SauceStep 1Heat oil in a medium pot over medium-high. Cook mushrooms in a single layer, tossing halfway through, until browned, 8–10 minutes. (They may steam at first but will eventually brown.) Pour in wine, soy sauce, and ¾ cup water, reduce heat to low, and simmer, stirring occasionally, until mushrooms are very soft, 8–10 minutes.Step 2Transfer mushrooms and liquid to a blender and purée, adding more water by the tablespoonful as needed, until sauce is smooth.Bok choy and assemblyStep 3Combine garlic and oil in a small skillet. Set skillet over low heat and cook, stirring occasionally, until garlic is golden and crisp, about 3 minutes. Strain through a fine-mesh sieve into a small bowl. Season garlic with salt; set oil aside.Step 4Heat 1 Tbsp. reserved garlic oil in a large wok or skillet over medium-high. Add bok choy and 2 Tbsp. water and cover immediately (a baking sheet works great if you don’t have a lid). Cook 1 minute. Uncover and toss, then re-cover and cook until bok choy is tender at the core, about 2 minutes.Step 5Spoon some brown sauce in a large shallow bowl or on a platter; arrange bok choy over. Top with crispy garlic.How would you rate Bok Choy With Brown Sauce and Crispy Garlic?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglethis as really good......flavor was awesome, easy to make and great healthy choiceHobbitOcala FL8/30/2021Explore Bon AppétitEast AsianAsianBok ChoyLeafy GreensVegetableShiitake MushroomMushroomGarlicQuickEasySideVeganVegetarianDairy-FreeNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Justin Lee"]}