{"id": "a2f6f6e3250e7870da36931ac3c8ce62", "url": "https://www.bonappetit.com/story/lentils-meal-ideas", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "The Lentil Recipe That Turns Into a Week of Distinct Meals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Turn One Batch of Lentils Into a Week of Distinct Meals10/10, would lentil again.By Aliza AbarbanelMay 27, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI need a little structure in my life these days, especially when it comes to cooking. The initial thrill of bulk shopping and creative cooking has faded, leaving me with a vague sense of menu-planning agita that increases every time I open my pantry. Luckily I’ve developed a strategy to vanquish decision paralysis: making a really big pot of marinated lentils.Keeping a cache of cooked lentils provides a blueprint for a full week of meals (even when the rest of my fridge is lacking). As for the marinade, pre-seasoning creates a solid base layer of flavor that can be taken in countless directions.Although I love all lentils equally, I stick to sturdy French green or black for this scenario, which easily hold their shape to maximize repurposing opportunities. I usually pull out a cup or two of cooked lentils to use as a blank canvas later in the week. Then I add a flavorful marinade to the rest of the pot based on whatever my pantry can provide. Instead of getting hung up on specific ingredients, I draw from two essential categories: spices bloomed in oil and fruity vinegar. My salad game has never been better, and I’ve since expanded my universe:Fry 'em upFried lentils are a crispy, compulsively snackable revelation that can be topped with almost anything in the fridge. Test kitchen director Chris Morocco tipped me off to the idea of turning crisped lentils into a pseudo grain bowl with quick toppings like shaved raw vegetables, grated cheese, and pickled onions, but my favorite trick might be from contributing writer Priya Krishna’s mom, Ritu, who sautées her cooked lentils in extra ginger and garlic before topping with chopped red onions, quartered cherry tomatoes, cilantro, and lime. The combination of textures and toppings turns leftovers into an entirely new dish.Simmer into soupThis one came to me on a frantic afternoon: My blood sugar was dropping. My sandwich staples were nonexistent. When I realized I had marinated lentils and chicken broth in the fridge, I simmered the two together, floated some thinly shaved carrots on top, and grated on a pretty significant pile of parm. The lentils’ marinade infused the chicken broth with a soup’s worth of aromatics and spices, and a new go-to weekday lunch was born. I’ve since added leftover shredded chicken and silken tofu cubes to great success, but pretty much any cooked protein should work great too.Who can resist a lentil burger this beautiful?\nPhoto by Alex Lau, Food Styling by Susie TheodorouForm into lentil burgersImpossible and Beyond burgers may have overshadowed the humble lentil burger as the designated cook out option for vegetarians, but I think it’s time for a comeback. Chris Morocco’s all-star recipe combines partially-mashed cooked lentils with chopped crimini mushrooms, white miso, smoked paprika, and grated garlic for a seriously punchy patty. But really, it’s all about the texture: a bit of frying pan action creates a lacy, crisp crust that’s contrasted by crunchy pickles, a smear of lemony yogurt, and a tangle of sprouts (for some welcome health food store nostalgia). The burgers, which can be made up to four days in advance, are ideal for using plain cooked lentils—an oily, vinegar-spiked marinade would add too much moisture.Make a (really) quick dalDal is traditionally made with dried lentils, but it’s a great way to repurpose cooked lentils too. Because cooked lentils are already hydrated, start by reducing the amount of liquid by half. Keep an eye on the pot as it simmers, tasting periodically and adding more liquid if needed, until the dal is tender, not mushy.Lentil sauce, meet pastaI would have never thought to transform marinated lentils into pasta sauce, until I saw Anna Stockwell’s Lentil Bologenese recipe on Epicurious. She blends them into a tomato sauce enriched with harissa paste, wine, and sizzled bacon to create an earthy-sweet bolognese—then sprinkles some extra lentils over the top for added protein and heft. 10/10, would lentil again.Explore Bon AppétitHealthyishLentilRead MoreLifestyleHow to Turn One Blender Sauce Into a Week’s-Worth of Delicious MealsBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-27", "author": ["Condé Nast", "Aliza Abarbanel"]}