{"id": "a300b796373b314f1314ef987287505b", "url": "https://www.bonappetit.com/story/cooking-at-border", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "In the Midst of a Border Crisis, Cooking Is About More Than Survival | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureIn the Midst of a Border Crisis, Cooking Is About More Than SurvivalEvery day, more and more asylum seekers get turned away at the U.S.-Mexico border to wait in a dangerous Matamoros tent camp. But they’ve found their own ways of coping.By Michelle GarcíaFebruary 13, 2020FacebookTwitterEmailPhoto by Verónica G. CárdenasFacebookTwitterEmailTo prepare the steaming vat of caldo de pollo, someone has to tend the fire. Another person must deal with the wind that kicks up the dirt and garbage. And still others run to the grocery store, chop the vegetables, and haul drinking water from the communal cistern. Here at the tent camp under the Gateway International Bridge, which connects Matamoros, Mexico, with Brownsville, Texas, everything is made fresh out of necessity. There is no pantry, no refrigerator. People must cook and eat as they live: in the open air, with more than 2,000 other asylum seekers, on a levee perched on the southern banks of the Rio Grande River.The aroma of chicken broth soon fills the air, a ribbon of goodness twisting its way through the stench of trash and car fumes and feces. Jose, who came here from Nicaragua, is in charge of the fire. Marisela, from El Salvador, loses her footing and nearly slides down the slope while carrying buckets of water with Melissa and Areli, who coordinate the makeshift restaurant operation and are both from Honduras. The simple lean-to that they use as a kitchen was a gift from a Honduran couple who gave up hope and left. Like everyone else at the camp, Marisela, Jose, Melissa, and Areli are waiting for their asylum cases to be decided just a few yards away in the U.S.From left, Edgardo Rios, 7, his dad Jorge Rios, and his mother Kenia Villeda, all from Honduras, at the tent camp in Matamoros.\nPhoto by Verónica G. CárdenasAt the largest tent camp along the U.S.-Mexico border, cooking is a means of survival—not just for the body, but for the mind and soul. Cooking is caring for families, a means to earn money by selling meals to other migrants, an expression of human dignity to sustain spirits while living through a brutal humanitarian crisis that worsens by the day.Until January 2019 asylum seekers were permitted to enter the U.S., with most eligible to work, while their cases were reviewed. But a new policy imposed by the Trump administration, known as \"Remain in Mexico\" or the Migrant Protection Protocols (MPP), changed everything. Now people seeking asylum under U.S. and international law are sent to Mexico—far from attorneys and families—while their cases are processed, which could take years. This camp, as with other similar migrant camps across the U.S.-Mexico border, is where many of them end up.And yet, Melissa says, “we have nothing of protection.”When I meet her in December, she’s wearing pink sweatpants and neatly tied braids. She arrived here as an asylum seeker from Honduras eight months prior, in May 2019, joining hundreds of other people waiting to submit their initial asylum claims. After she passed the first phase, the credible fear interview, she waited here, trying, as she says, “to do everything right” and make her case for asylum. But her odds are slim. In the year since MPP went into effect, only 11 people have been granted asylum, while some 60,000 have been sent away, according to December 2019 reports. The admission rate hovers around 0.1 percent, though outcomes differ widely depending on factors like the state where asylum seekers’ cases are heard or whether they have legal representation—which is exceedingly difficult to obtain.It’s estimated that about 2,000 people live at the encampment in Matamoros.\nPhoto by Verónica G. CárdenasThe Trump administration has defended its new rules by claiming that asylum seekers were exploiting the immigration system with fraudulent claims. But political turmoil, government corruption, and rampant violence in Central America rages on, causing more and more families to head north. This tent city is a forced camp, populated by people stranded in the same predicament as Melissa, people who sleep in tents and under tarpaulins. Conditions are so dangerous that not even the United Nations High Commissioner for Refugees will establish a humanitarian mission in Tamaulipas, the Mexican state where Matamoros is located, to cope with the crisis, citing security reasons.To call it a camp is to suggest intentionality: organization, running water, adequate restrooms. But that’s not the case here. Discarded toilet paper lines the dirt road leading to the Rio Grande River, where people are forced to bathe and wash their clothes. Parents, in particular, know that threats are everywhere, and children are particularly vulnerable.Asylum-seeking children eat a meal at the camp's once-a-week class in Matamoros.\nPhoto by Verónica G. CárdenasMarisela’s son, like many of the children, was suffering from diarrhea. When volunteer doctors informed her that the cause was malnourishment, she decided to take action. Melissa, Jose, Areli, and Marisela pooled their money to form a cooking cooperative. “I have to be careful about the food that I give my son,” she tells me, chopping carrots, potatoes, chayote, and corn into a large stew pot. “This way I know how the food is prepared, what’s in it.” She’s careful to use only bottled water for cooking.“I think dignity is the key word here. They worked hard for what they had, and for various reasons, the rug got pulled out.”A skinny teenage girl walks up and asks about the day’s dish. Chicken soup for 50 pesos ($2.50 USD), Melissa says, shaking out a bundle of cilantro. “As a father, the most important thing is my children’s diet,” Jose says. He uses the word alimentar, which can mean diet, but its literal translation in these horrific conditions is even more meaningful: “to nourish.”Rosa, 37, from El Salvador, prepares pupusas made with cornmeal to sell at the encampment. She was sent back from the U.S. after seeking asylum under the Trump administration's “Remain in Mexico” policy.\nPhoto by Verónica G. CárdenasAs we speak, in the middle of the border bridge above our heads, a toddler lies next to her mother, a doctor, and an attorney. The girl needed surgery, the doctor said, and they were waiting for agents to decide whether she’d be permitted to enter the U.S. for medical attention. But after four hours they were denied and sent back to Mexico.Not far from the collective’s kitchen, three volunteers from Team Brownsville, a Texas-based humanitarian group, walk by. They’re carrying sacks of rice and beans on their shoulders to distribute around the camp. With donations, Team Brownsville provides food, tents, blankets, and potable water to asylum seekers.It’s an effort that began with a few dozen breakfast tacos—or as they’re known in South Texas, taquitos—in the summer of 2018. With temperatures hovering in the triple digits, news had spread across the Rio Grande Valley that U.S. immigration agents were suddenly accepting only a few asylum claims a day, or none at all, in a policy known as “metering.” Families became stranded on the bridges, and locals on both sides of the border sounded alarms for help through text messages and Facebook posts. It was then that a Brownsville resident named Mike Benavides ran to a local gas station and loaded up on warm flour tortillas stuffed with eggs, bacon, and chorizo, or as he calls them, “99 cents of heaven.”Michael Benavides, right, co-founder of Team Brownsville, walks through an encampment in Matamoros with fellow volunteers.\nphoto by Verónica G. CárdenasMany in the U.S., including the president, deem the asylum seekers a threat. Others describe them as desperate masses. But sharing a taquito with someone every day, Benavides says, you learn to distinguish between individuals and their circumstances. “I think dignity is the key word here,” he tells me. “They worked hard for what they had, and for various reasons, the rug got pulled out.”Benavides had known missions before. He served in the military, fighting in the Iraq War during the 1990s. “When I came back, I would wake up smelling burning flesh,” he recalls. Veterans’ services provided help with his post-traumatic stress disorder, and it’s an anguish he recognizes daily in the camp among people fleeing violence. “Every single person I’ve met here has PTSD,” he says, “but they won’t get the help that I got.”So Benavides made his taquito runs, eventually creating a volunteer group called Team Brownsville. Once costs had ballooned to $200 a day, the group became a bona fide nonprofit, taking donations for a local Mexican restaurant to serve breakfast to asylum seekers. Now daily operations involve 360 eggs, 10 pounds of sausage, six pounds of beans, and 66 pounds of corn tortillas, delivered to the camp in wagons and scooped onto plates. Enough for several hundred people—but only a fraction of the 2,000 or so at the camp.A breakfast provided by Team Brownsville is seen in the Matamoros restaurant where it was prepared.\nPhoto by Verónica G. CárdenasIn January, chef José Andrés deployed his nonprofit, World Central Kitchen, which provides meals following massive disasters such as earthquakes and hurricanes, to the Matamoros camp. Team Brownsville continues to serve its meals, now sometimes in collaboration with World Central Kitchen. But Benavides himself has stepped back to focus on the roots of the border crisis, delivering presentations to lawmakers about the dangerous and deplorable conditions and their toll on the body and the mind.Violence in the region is on par with nations at war and the countries these people fled in the first place.Asylum seekers are often kidnapped, and Human Rights First has documented 800 cases of murder, rape, torture, and kidnapping of people sent to Mexico to wait for a decision in their cases. Around the camp in Matamoros, gang lookouts are often spotted nearby. Violence in the region, according to the U.S. State Department, is on par with nations at war and the countries these people fled in the first place.In the face of such despair, some 350 parents have tearfully sent their children across the border alone, according to news reports. A few weeks after my visit, a desperate father who was turned away by U.S. immigration agents slit his own throat on the bridge and died.Jenny, a Honduran asylum seeker, makes tortillas on the comal.\nPhoto by Verónica G. CárdenasIn a situation like this one, keeping up spirits is a matter of survival. At the camp, I watch children play games, ride bikes, and chase after each other. They read donated books and kick balls. And to take their minds off the danger, they talk of their culinary fantasies. Outside the supply tent set up by Team Brownsville, I come across two Honduran boys delivering gushing descriptions of their favorite Honduran breakfast—baleada—to a Salvadoran girl. “We are telling her about what delicious food is,” one of the boys tells me, smiling as he describes the hot tortillas and mashed fried beans, the melted cheese and scrambled eggs.Under a tree and inside a makeshift enclosure, a woman named Jenny and her new friend Fransy, both from Honduras, prepare the baleada. Pans and a hot comal sit on an adobe-like stove commonly used in Honduras. It took them about an hour to make, they tell me. Jenny’s sons collect scrap wood from a nearby construction site for the fire while she grabs an empty glass bottle to roll out some dough.Jenny, right, cooks in a makeshift camp kitchen.\nPhoto by Verónica G. CárdenasTwo days earlier, Jenny says, they made another Honduran favorite, pollo chuco, a.k.a. dirty chicken, topped with layers of plantains and chimol, a mild salsa. With a few dollars sent from family, they’d walked around Matamoros for three days searching for the starchy green plantains, Jenny says, pointing to an empty carton. And it was worth it. “The children were asking for them, and we try to give them their favorites,” Fransy says. “Everyone got so excited.”Jenny tosses a tortilla onto the sizzling comal while Fransy flips through photos of dishes past that she keeps on her phone. Chicken rolled in corn tortillas, fried like flautas, with a side of salad. Plantain patties, steamed broccoli, cabbage, and potatoes. “Where I grew up, salad was essential,” she says. “The kids love it.” Fresh produce reminds them of the Honduran coast they left behind.Jenny's take on the traditional Honduran baleada.\nphoto by Verónica G. CárdenasFor the women, cooking helps the wait pass faster. And, Fransy says, “you feel the sadness of being in this place a little less.” Why the photos? “To take with me the beautiful memories of cooking with her,” she says, pointing to Jenny, who hands me a green plastic plate full of food.And there it is: a toasty flour tortilla wrapped around eggs, chorizo, and beans, topped with sliced avocado. Like the beloved taquito to which it bears so much resemblance, the baleada is warm and slightly chewy with a tinge of spiciness. And like the taquito, it is, in a place of anguish, a little bit of heaven.Michelle García is a journalist, filmmaker, Soros Equality Fellow, and native Texan. She is currently working on a non-fiction book about borders.Want More Stories From Taco Nation? Right This Way...Why Korean Tacos Are Margaret Cho’s American DreamIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.For a Group of Chicana Cooks, Vegan Tacos Aren’t a Trend—They’re a Way to Reclaim Their RootsAnd so much more!Explore Bon AppétitTaco NationRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Michelle García"]}