{"id": "a312fc10447276267ebfb7334bca0318", "url": "https://www.bonappetit.com/recipe/chile-chicken-nachos", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "Chile Chicken Nachos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChile Chicken NachosBy Rick MartinezJanuary 16, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintMeet your ideal nacho construction plan. Dividing everything between two baking sheets solves problems and creates party opportunities. You’ll get the ideal ratio of ingredients layered on each tray, and if you want, you can put them into the oven at different times so that there’s always a hot melty batch for your guests.Ingredients10 servings2Tbsp. extra-virgin olive oil2garlic cloves, chopped1medium red onion, chopped, divided1Tbsp. achiote paste or tomato paste8ancho chiles, stemmed, seeded1chipotle chile in adobo, chopped (or 1 Tbsp. adobo sauce to keep things mild)3cups low-sodium chicken stock1tsp. ground cuminKosher salt1rotisserie chicken, meat pulled from bones and shredded210-oz. bags frozen corn, thawed, drained1poblano chile, stemmed, seeded, chopped8oz. finely grated Cotija cheese (about 2½ cups), dividedNonstick vegetable oil spray28-oz. bags tortilla chips, divided2lb. sharp cheddar cheese, shredded, dividedThinly sliced radishes, cilantro leaves, and pickled jalapeños (for serving)ToppingsSour creamGrilled Salsa RojaAvocado-Tomatillo Salsa VerdePreparationStep 1Heat oil in a large saucepan over medium-high until shimmering. Cook garlic and half of onion, stirring occasionally, until tender and beginning to brown, 6–8 minutes. Stir in achiote paste and cook, stirring occasionally, until brick red, about 1 minute. Add ancho chiles, chipotle chile, stock, cumin, and 2 tsp. salt and bring to a boil. Cover, remove from heat, and let sit until chiles are very soft, about 30 minutes.Step 2Place racks in upper and lower thirds of oven; preheat to 350°. Transfer chile mixture to a blender and purée until smooth. Return to saucepan, stir in chicken, and bring to a simmer over medium-low heat; season with salt. Remove from heat; set chicken aside until ready to assemble.Step 3Meanwhile, toss corn, poblano chile, ¾ cup Cotija cheese, and remaining onion in a medium bowl until combined; season with salt.Step 4Coat 2 large rimmed baking sheets with nonstick spray. Arrange half a bag of chips on each sheet. Top each with one-quarter of the chicken mixture, one-quarter of the corn mixture, and one-quarter of the cheddar. Repeat layers with remaining chips, chicken mixture, corn mixture, and cheddar. (Each tray will contain half of all the ingredients.)Step 5Bake nachos, rotating pans top to bottom and front to back halfway through, until cheese is melted and edges of chips are beginning to brown, 8–10 minutes. Serve topped with radishes, cilantro, pickled jalapeños, remaining Cotija cheese, and desired toppings alongside.Step 6Do Ahead: Nachos can be assembled 1 hour before baking. Cover with plastic and store at room temperature.How would you rate Chile Chicken Nachos?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI've made these three times--satisfying and fun every time.AnonymousSan Francisco3/28/2020Holy cow, these are AWESOME. I forewent the radishes because I have no self-respect and am willing to eat these without getting a single fresh vegetable involved. \nNext time I'll toast the chips by themselves before layering up, in hopes of preserving more crunchiness. But, damn. Good stuff. cheterPhoenix2/4/2019Explore Bon AppétitNachosTex-MexAmericanMexicanLatin AmericanChipotleChileVegetableAncho ChilePoblano ChileCheddarCheeseCornCotijaMainSnackNut-FreeSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-16", "author": ["Condé Nast", "Rick Martinez"]}