{"id": "a32ab531abfa37484f19dc3bae6121df", "url": "https://www.bonappetit.com/recipe/frisee-salad-with-warm-bacon-vinaigrette", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Frisée Salad With Bacon Vinaigrette Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrisée Salad With Warm Bacon VinaigretteBy Molly BazOctober 20, 20194.4(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintPoaching eggs is one of those cooking techniques that's shrouded in mystery—but for no good reason! We have two tricks that will help you poach with confidence—even if it's the first time—and yield runny yolks surrounded my firm but not bouncy whites. Perch one atop a French bistro-style salad and magic happens: The yolks mingle with the bacon vinaigrette (that's right—we're using bacon renderings as the fatty element of the salad dressing) to create a rich sauce that coats the lettuce and the crunchy-soft croutons. We're calling for 1 poached egg per salad in this recipe, but if you’re really hungry and want to make a more filling meal of it, go ahead and poach 2 eggs per person. The method is the same. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Saucepan$39 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Bowl$18 At AmazonMedium Skillet$60 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketWooden Spoon$6 At AmazonSmall Bowl$13 At AmazonSieve$18 At AmazonMedium Bowl$17 At AmazonPaper Towels$13.45 At AmazonIngredients2 servings¼baguette6oz. thick-cut bacon (about 6 slices)1large shallot½small bunch chives8cups frisée (about 1 large head)3Tbsp. extra-virgin olive oilKosher saltFreshly ground black pepper¼cup red wine vinegar, plus more1Tbsp. honey2large eggsPreparationStep 1Bring a medium saucepan of water to a boil. Meanwhile, tear ¼ baguette into 1\" irregular craggy pieces (these will be your croutons). Cut 6 oz. thick-cut bacon crosswise into ¾\" strips. Peel 1 large shallot, then thinly slice crosswise. Slice ½ small bunch of chives into ¾\" batons.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Thoroughly wash and dry 8 cups frisée. Transfer to a large bowl.→  Need a salad spinner recommendation?Step 3Heat 3 Tbsp. extra-virgin olive oil in a medium skillet over medium until shimmering. Add torn bread and stir well to evenly coat in oil. Reduce heat to medium-low and cook, stirring occasionally, until golden brown and crisp in some areas, 4–5 minutes. You aren’t looking for croutons that are crisp all the way through—just some good browning on the outside. Season with kosher salt and freshly ground black pepper and transfer to a plate. Let cool; reserve skillet.Step 4Return skillet to medium heat. Cook bacon, stirring frequently, until just shy of crisp, 4–5 minutes.Step 5Add shallots and ½ tsp. pepper and continue to cook, stirring occasionally, until shallots are just softened, about 2 minutes. Remove skillet from heat and stir in ¼ cup red wine vinegar, scraping bottom of skillet to collect all those yummy bits.Step 6Add 1 Tbsp. honey, stirring to combine. Taste the dressing—if it feels like it needs a little bit more acidity, add a splash of vinegar. Every type of bacon will render out a different amount of fat, and it’s that fat that will balance out the acidic vinegar, so you have to use your judgement.Step 7Time to poach 2 eggs! Crack each egg into small separate bowls. Working over another bowl or the sink, carefully tilt bowl into a fine-mesh sieve, allowing excess white to slip through. This leaves behind a smaller orb of egg white that surrounds the yolk and ensures that your poached eggs won't have those scraggly, tail bits. Transfer egg to a medium shallow bowl. Repeat with remaining egg and transfer to same medium bowl.Step 8Carefully lower rim of medium bowl into saucepan of boiling water. Tilt bowl so each egg gently drops into the water, one by one. Turn off heat and set a timer for 3 minutes. Poaching the eggs in hot, unmoving water, allows them to cook super gently.Step 9While eggs cook, toss lettuce, bacon vinaigrette, croutons, and chives to combine; season with salt. Divide salad between bowls.Step 10Back to those eggs. Using a slotted spoon, scoop up each egg and lightly blot on a clean kitchen towel or paper towels to remove any water clinging on.Step 11Transfer egg to top of each salad; season eggs with salt and pepper.How would you rate Frisée Salad With Warm Bacon Vinaigrette?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleSo good!! Seriously one of my favorite unhealthy salads!DasJerminationsFlavortowne, Ohio3/14/2021My mother used to make this sixty years ago. So good. She'd make it without the egg for dinner lots of times.AnonymousNorthville, MI2/24/2021So tasty, easy enough to whip up on a lazy morning. And a great way to use up greens if you \"accidentally\" purchased two farm boxes at the farmers market because you are just trying to support your local farmers during the trying time and now good lord what am I to do with ALL. THESE. GREENS.  Only edit I made: my bacon didn't render much fat so I tossed on a scoop from my fridge fat jar and it happened to be from some maple bacon. That sweetness really mellowed out the vinegar nicely, a great contrast if you're into salty/sweet.AnonymousSeattle, WA5/4/2020This tasted SO good. One comment though—the thick cut bacon ended up producing a LOT of grease, so when I went to add the red wine vinegar, the grease outshined the vinegar. I poured a *little* bit of the grease/vinegar mixture out, then replenished the vinegar back in. Also, I substituted the frisee for a mesclun salad mix. Trying to stay somewhat healthy this quarantine people! driannealicenew york city4/26/2020I have EVERYTHING to make this except frisée. Can't find it at any grocery store in town (and there are 8) probably BC of these crazy times. Think it would be good with chicory lettuce?Ntorresbernal1St, Catharines, ON, Canada3/31/2020Loved it!  Having fun cooking at home in these crazy times!Anonymous3/25/2020Possibly my favorite recipe from the website! Super easy and impressive towards guests. Will make over and over again.kelleycothron8693Nashville, TN3/9/2020This was very good! The vinaigrette is absolutely perfect. Next time I make it, I am going to combine this recipe with some ingredients from the BLT salad recipe to make it a bit more substantial. This is a perfect lunch salad, but needs a little something extra around dinner time.AnonymousIndiana, USA11/19/2019Loved this salad! The croutons, the vinaigrette and the poached eggs were sooooo good together. Thank you for the simply directions on poaching an egg! Could you tell us how many calories are in the dressing? Thanks!AnonymousLouisiana10/27/2019This recipe is amazing! My husband goofed on the baguette so we used croissants for the croutons instead and it was perfect! I've eaten this salad for times in the past week now, it's so good!\n\nThe basically format is super clunky on my phone, though. I would love a recipe card at the end so 8 don't have to scroll while I'm cooking. sm00bsDFW10/26/2019The recipe is very good, and the dressing is delicious. However, with typical poor judgement from Bon Appetit, the format is stupid. The only way to print the recipe is to use the 'Print' button - there is no way to edit, so we get a recipe with font size too small to read.tatwoodWestern Massacusetts10/23/2019Explore Bon AppétitSaladFrenchEuropeanBaconCured MeatMeatFriséeChicoryLeafy GreensVegetableEggWinterWeeknight MealsSideDairy-FreeNut-FreeLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-20", "author": ["Condé Nast", "Molly Baz"]}