{"id": "a32a58be7b7b5d575e264948ee8ff0d4", "url": "https://www.bonappetit.com/story/best-air-fryer", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "The Best Air Fryers, Because We Are All Air Fry People Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese Are the Best Air Fryers, Because We Are All Air-Fry People NowDo you need one? Probably not. Should you get one? Almost certainly.By Alex BeggsOctober 7, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Like everyone else you know who has an air fryer, I won’t shut up about mine. I got what Cook’s Illustrated ranked the best air fryer—the Breville Smart Oven Air Fryer—and soon realized that this is not actually the type of appliance that most people have. Mine looks like a toaster oven (because it is, but more on that later) while the other air fryers look like dinosaur eggs with pull-out “baskets” that make the whole experience feel a little more like a novelty. But I love my Breville. It’s big; it’s also a conventional oven and dehydrator and like eight other things; and I can watch stuff cooking inside. But you’re here to find out whether or not you need an air fryer, which one is right for you, and what all of this has to do with corn dogs. Well, let me tell ya.What is an air fryer anyway?Let’s get this out of the way: Air-frying is a rebrand of the stodgy old term “convection.” It’s essentially the same thing, but “air frying” just sounds so much lighter, doesn’t it? An air fryer is a mini countertop convection oven, which means it uses a fan to help circulate hot air around your food so that it cooks more evenly and efficiently than in a normal oven. It preheats in minutes and makes weeknight cooking convenient, mostly hands-off, and so, so crispy.How do I know if I need one?Like shearling-lined Birkenstocks and children, an air fryer is something you want, not something you need. The only person who needs an air fryer is someone who has no other oven and craves a corn dog. However, if you answer yes to two or more of the following questions, you’re a prime candidate for the air-frying lifestyle:Do you have counter space for extra kitchen appliances?Are you kinda impatient?Do you get extremely excited about new kitchen gadgets and just want permission to buy this one?Do you want the crispness of fried food without using a deep fryer?Do you L-O-V-E roasted vegetables but hate turning on your oven and heating up the whole apartment?Yes, I feel seen; this is me. I really, really want one—and a corn dog—right now. But which is the best air fryer?You have two options: a basket-style unit or a toaster oven–esque one. Honestly, it mostly comes down to how much space you’re working with. A basket-style air fryer takes up a lot less real estate, but a toaster oven-style can, well, double as a toaster oven. I leave mine on the counter because it’s so big, which is kind of an eyesore, whereas a basket-style model could be stashed away when you’re not using it. That said, most people find they use it so much it stays out. If you’re cooking for 4+ people or if you also need a toaster oven, I’d suggest getting a toaster-oven-style air fryer because you can jam more food in there. Here are our top picks for both styles:The best air fryer–toaster oven comboAs mentioned, this is an all-in-one air fryer and regular toaster oven, so if you'd like to make crispy sesame-coconut chicken tenders and cook a whole chicken in the same appliance, this one's for you. The control panel has a variety of presets for specific foods like frozen pizza, bagels, and cookies, or you can choose cook modes like reheat, broil, bake, or roast. The air fry mode activates the “super convection” fan setting, which hits your sweet potato wedges with rapidly circulating air. The Breville is considerably roomy and front-loading, making it easy to cook large items. And the window means you can watch food as it cooks (fun!) so you don’t have to open the oven to check that dinner isn’t burning—letting precious heat out.Photo by Emma Fishman, Food Styling by Pearl JonesThe downside of this one is that it takes up a lot of space. Because it gets so hot, you CANNOT stack cutting boards and cookbooks and drying dishes on top (or boxes of cereal behind it) while you’re using it or the fire department might come a’calling. And because the heating element is exposed and sits below the included perforated basket (it’s all about the air flow), I often line the basket with parchment for foods that might drip, or place a pan below it to shield the heating rods on the floor of the unit from falling fat. Like other air fryers, it’s annoying to clean.Photo by Emma FishmanBreville Smart Oven Air Fryer$350 at Bed Bath and Beyond$650 $350 at Sur La TableIf you want an even bigger version of the Breville Smart Oven Air Fryer, you're in luck—the Breville Smart Oven Air Fryer Pro can fit an entire 14 lb. turkey, 5 qt. Dutch oven, or a 9\"x13\" pan. It also comes with two more additional presets—proof and dehydrate.Breville Smart Oven Air Fryer Pro$750 $400 at Sur La TableThe best basket air fryerThis touchscreen digital air fryer is our favorite basket-style unit and the one Rachel Gurjar used to test her new air-fryer recipes (make those potato wedges!). With a spacious 5.8-quart capacity, it’s larger than most other basket air fryers, so you can get a double portion of french fries going at once. The removable baskets are nonstick and dishwasher safe, and it’s easy to unplug and stash this thing under the counter—ideal if you have limited counter space. Unlike with the Breville Smart Oven, you can also fry foods right in the basket without worrying about dripping and smoking fat. Bonus: It’s equipped with a \"shake\" reminder to ensure all of your chicken wings, mozzarella sticks, and brussels sprouts come out super crispy. When the alarm sounds, just pull the basket out and give it a shake to make sure the goods are all evenly exposed to the circulating air.The downsides: The basket is enclosed, meaning you’ll have to keep opening it to check for doneness, which will release some heat. And as a single-purpose appliance, it’s just not as versatile as the multitasking Breville oven.Photo by Emma FishmanCosori Basket Air Fryer Max XL$120 $110 at Amazon$120 at Bed Bath & BeyondAir frying is healthy, right?Photo by Emma Fishman, Food Styling by Pearl JonesAir-frying is ingenious marketing; it sounds so light, so fat-free, so noncaloric. But it’s not “healthy” by default. Yes, the air fryer uses a lot less oil than deep-frying, but were you really deep-frying that much before? I do love that it makes roasted veggies and salmon in a flash, which maybe means I’ll eat more of them. If you’re looking to make some changes in your eating habits, I’d suggest talking to a registered dietitian not your toaster oven.Now that you have one, let’s get cookingAs mentioned, oil plays a crucial role in air-frying. You do need some fat in order for your food to come out evenly cooked and perfectly browned. You’ve got two routes to take here:Coat ItEVERYTHING you cook in an air fryer needs a coating of fat to encourage caramelization and prevent sticking. Some users swear by spray bottles of oil—we recommend La Tourangelle Organic Extra Virgin Olive Oil Spray, a high-quality olive oil—but you can also just toss your veg in oil in a bowl before cooking. If you’re playing with oil sprays, make sure to spray food before you transfer it into the basket.Incorporate ItBreaded foods get nice ’n’ toasty in an air fryer, but without some fat mixed into the breading they’ll take longer to brown and the food inside could overcook before max crispiness is achieved. Tragedy! For our Sesame Coconut Chicken Tenders, we toss the breadcrumb mixture with a generous amount of oil before using it to coat the meat, which ensures perfectly golden brown outsides and juicy insides.How do I convert a recipe for air-frying?Some foods might take the same amount of time to cook as they would in the regular oven, like dense meatballs, while others will cook faster, like chopped broccoli. Set the air fryer to 25 degrees lower than the recipe calls for and start checking halfway to your recipe’s indicated cook time.What should I cook in my air fryer?Brussels sproutsPotato wedgesChicken tendersAnything breaded, reallyBroccoli, cauliflowerFrozen foods of all shapes and sizesChicken wingsFish (whole or fillets)Cornstarch-coated tofu cubesSpice-coated chickpeasLeftover pizzaWhat should I absolutely not cook in my air fryer?Watery veg, like zucchini and mushrooms (may cause the machine to billow steam or the food to never quite brown)Pies, pastries, or cakes (they tend to dry out from the fan action)Bacon (a mess to clean)Eggs (a novelty—but go ahead, try it once!)Steak, burgers, or anything typically pan searedBut what about fries?One of the most googled air-fryer recipes? Surprise surprise: homemade french fries. But here’s the truth: Real-deal, restaurant-worthy DIY fries are a labor of love, and they need to be soaked in water beforehand to remove excess starch and cooked multiple times. Annoying! But the good news is that frozen fries (and tater tots, and just about any frozen snack) are soooo much better in the air fryer than in the oven. And now if you'll excuse me, my air-fried oatmeal bites are ready.Shop Now:Photo by Emma FishmanBreville Smart Oven Air Fryer$350 at Bed Bath and Beyond$650 $350 at Sur La TablePhoto by Emma FishmanCosori Basket Air Fryer Max XL$120 $110 at Amazon$120 at Bed Bath & BeyondExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-07", "author": ["Condé Nast", "Alex Beggs"]}