{"id": "a32fc00a52b7466f19f8a7ee7675f276", "url": "https://www.bonappetit.com/story/melissa-miranda-wok", "year": 2022.0, "month": 3.0, "day": 1.0, "content": "To Cook Like Chef Melissa Miranda, You Need a Carbon-Steel Wok | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingTo Cook Like Chef Melissa Miranda, You Need a Carbon Steel WokIn her YouTube videos, chef Melissa Miranda shows off the wok she uses for stir-fries, pancit, and even pasta.By Jenna Adrian-DiazMarch 3, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.“If you ask chefs what we use in our homes, most of us probably didn’t buy the pre-seasoned wok from a fancy kitchen store for $100,” says Melissa Miranda, chef-owner of Musang in Seattle. Miranda’s own wok, a traditional carbon steel workhorse, stars alongside her in her Bon Appétit video for adobong pusit pancit (a Filipino noodle dish with squid and adobo). In the video, Miranda uses her wok to cook the alliums that serve as the base for the dish before adding the diced tomatoes, squid, fish stock, and adobo sauce in quick succession. “It’s super important to have all your mise ready because you can see it’s already starting to cook,” Miranda says. She then adds the noodles to the wok, which soak up the deliciously saucy base of the adobong pusit pancit, and gives the dish a very impressive flip or two to combine.Years of use and care have given Miranda’s wok a rich patina of seasoning that acts like a nonstick finish, and its carbon-steel construction allows the chef to use stainless-steel tongs and spatulas without a second thought. “I remember growing up, my mom ended up buying a nonstick wok and it got ruined,” she says. “If she used tongs it scraped up the bottom—whereas this one, it can take a beating.”It’s clear why carbon steel is a staple material for professional chefs: It’s lightweight, durable, comes up to temp in a flash, and becomes naturally nonstick with use. For all of the attributes that endear the material to the pros, Miranda thinks it’s suited to the enthusiastic home cook too. “When you’re talking about Asian cuisines, you want that kind of char or smoky high-heat sear that you can’t really get when you're waiting for stainless steel to heat up.”Carbon-steel woks excel at stir-fries (“The beauty of fast cooking at a high heat means you can’t overcook the vegetables,” she says), but Miranda also uses hers for everything from sautés to fried rice and noodle dishes. “My team makes fun of me, but I’ll actually make pasta dishes in my wok,” she says. “It helps to have a large enough surface to really get that integration of the sauce and noodles, which release their gluten and starches into the liquid and make the dish more creamy.”Craft Wok Carbon Steel Wok$60 at AmazonWoks are offered with either a flat bottom, which allows them to sit atop a stovetop’s burner grate like any other pot or pan, or a round bottom, which requires a wok ring to help position the wok as close to the heat source as possible. Aside from the “rounded versus flat” and “carbon steel versus nonstick” choices to make while you shop, the last consideration is whether to season your wok yourself or buy one pre-seasoned.While some may prefer the ease of a pre-seasoned wok, Miranda is all for embarking on the seasoning journey yourself. “Seasoning is part of the story of the wok,” she says. Because carbon steel is vulnerable to rust, you must ensure your wok is bone-dry before storing. Miranda dries hers over a stovetop burner and reseasons it with a coat of cooking oil spray. “It’s kind of like cast iron in that way,” she says.While Miranda sourced her go-to wok—it’s one in a rotation of several the chef uses in the kitchen at Musang—from a restaurant supply store, the online outpost of San Francisco’s Wok Shop is another reliable source for woks and their accessories. Miranda also recommends in-person shopping: “You can go to Asian markets or walk around Chinatown. They have such beautiful, beautiful pans. It takes a little bit of extra elbow grease and love to cook with an unseasoned carbon-steel wok, but it will last a lifetime.”Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-03", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}