{"id": "a333b7405d960ccfce8b7082bd631d1f", "url": "https://www.bonappetit.com/recipe/hot-smoked-salmon-with-salted-yogurt-and-fennel", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Hot-Smoked Salmon with Yogurt and Fennel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueHot-Smoked Salmon with Salted Yogurt and FennelBy Andy BaraghaniJuly 10, 20184.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis is entrée recipe you want to serve to guests when you have no time to cook and have no desire to turn on the oven. Hot-smoked salmon is sold wherever you purchase gravlax and other cured fish; in the supermarket it’s probably stocked alongside packages of smoked trout.Ingredients4 servings1cup plain whole-milk Greek yogurt2Tbsp. fresh lemon juice, dividedKosher salt3Tbsp. whole grain mustard2Tbsp. coarsely chopped capers3Tbsp. extra-virgin olive oil, divided, plus more for drizzling1large fennel bulb2lb. hot-smoked salmonFreshly ground black pepperPreparationStep 1Mix yogurt and 1 Tbsp. lemon juice in a small bowl; season with salt.Step 2Mix mustard, capers, and 2 Tbsp. oil in another small bowl. Set dressing aside.Step 3Cut fennel stems away from bulb, then cut fronds away from stems; you’ll use each part, but they’re prepped separately. Thinly slice stems crosswise and place in a medium bowl. Coarsely tear fennel fronds until you have about 1 cup and add to bowl. Remove tough outer layers from fennel bulb; discard. Slice bulb in half, then thinly slice crosswise; add to bowl. Add 1 Tbsp. oil and remaining 1 Tbsp. lemon juice, season with salt, and toss to coat.Step 4Divide seasoned yogurt among plates and use a spoon to spread it out. Using your hands, break salmon into big flakes and arrange over yogurt. Spoon mustard dressing over salmon and scatter fennel salad on top. Drizzle with more oil and season with lots of pepper.How would you rate Hot-Smoked Salmon with Salted Yogurt and Fennel?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI could eat this any time of day, it is so good. Light and full of flavor. We smoke our salmon with light seasoning to 145F. Sautéed beets with thyme and butter go well with this for dinner. For breakfast, I serve it with a poached egg. For snack, I add rye crackers and when I run out of yogurt, mascarpone stands in. I imagine this as a great appetizer too. LOVE IT. Thank you so much for this recipe!AnonymousDenver5/18/2021Are you catering to a large crowd? Who TF has 2 lb of smoked salmon around?Do you Cater? 1/30/2021This made a fabulous quick lunch. Will be making it again.AnonymousSan Francisco7/24/2020Explore Bon AppétitSmoked SalmonSalmonFishSeafoodFennelVegetableQuickEasyWeeknight MealsMainGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Andy Baraghani"]}