{"id": "a33e84298f5908ee065a73c2527626bb", "url": "https://www.bonappetit.com/story/alexis-schwartz-natural-wine", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Alexis Schwartz Wants You to Pair Magnums of Natural Wine with Takeout | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAlexis Schwartz Wants You to Pair Magnums of Natural Wine with TakeoutHer natural wine-pairing series, Thirsty Thirsty, is the coolest way to drink in NYC this summer.By Emily SundbergJune 7, 2018FacebookTwitterEmailPhoto by Emily SundbergFacebookTwitterEmailAlexis Schwartz wants you to pair sparkly natural wines that have been fermented in the bottle with Wu’s Wonton King. And not only does she want you to do it, she thinks you’re really going to love the result.Wine experts can sometimes seem intimidating, but not Schwartz. Her eyes, often lined with bright colors, widen when she talks about the soil the grapes grow in, the winemakers’ histories, and their connection to their vineyards. Schwartz and Anthony Roy are the co-founders of Thirsty Thirsty, a new natural wine-pairing dinner series in NYC that feels like a dinner party with thirty of your closest friends.“I started working with wine when I was nineteen in New York,” Schwartz told me at a recent Thirsty Thirsty at the perennially cool Lower East Side restaurant Dimes. At the time, she was working for the Manhattan hospitality group Silkstone, and one of the group’s vegetable-focused restaurants, The Fat Radish. “I got to sit in on tastings with the wine buyer because I begged hard enough. It was the first time I tasted anything that I felt I could understand. I felt like I actually loved the wine.” Years later, she found out that the wine she was so in love with was natural: made without chemicals, sulfites, or filtering.After working in restaurants on both coasts, she moved to Lyon, France and worked at the natural wine cave and bar a vins, O Vins d'Anges under the owner, Sebastien Milleret. “He was the first man I encountered who genuinely wanted to uplift me and help me learn about wine,” says Schwartz. “Every Monday and Tuesday we would drive to a different region of France, spend time with winemakers in their vines and at their lunch table and just talk. We'd then drive the wines back, stock the shop, and eventually pour the wines to customers throughout the weekend.”While at O Vins d'Anges, Schwartz realized that she wanted to put natural wine in the glasses of more young people, so, when she got back to New York three years ago, she started Thirsty Thirsty, pouring natural rose at Cafe Henrie and summer wines paired with Italian snacks at Fitzcarraldo in Williamsburg.“It's festive but discreetly educational. It's also industry friendly, but I’m more interested in bringing together friends of friends who are in different industries.”Schwartz now works for Zev Rovine Selections, a natural wine distributor in New York that supplies restaurants like Mission Chinese Food, around the corner from Dimes, and The Four Horsemen in Brooklyn.At the Dimes dinner in May, Schwartz poured three different wines corresponding with the night’s theme: an homage to Chinatown. “Wines are a perfect match with the complex flavors of Chinese cuisine, which are based on an ancient desire to uplift flavor, texture and terroir,” Schwartz told the room. For $25, guests got three pours and an open buffet of steamed sesame buns, garlicky soy greens, and a seemingly endless supply of spring rolls. By sunset, guests had spilled out onto the sidewalk, still drinking, still holding plates of snacks, definitely not thinking about work the next day.“People come to drink natural wines on the cheap with us. It also promotes a pretty magical no phone zone naturally that I'm particularly fond of,” says Schwartz.Thirsty Thirsty doesn’t have a set schedule, but Schwartz hinted at a big party happening this summer… on a farm! As soon as she plans it, she opens up invites to all of her Instagram followers on @thirstythirsty. Until the next one, Schwartz has a few tips for shopping for natural wine: “Go for petillant naturel style wines (pét-nats) and chilled red options. That is the way to anyone's heart and won't be too costly.” And her best suggestion? “When you find one you like, buy a magnum of it.”Explore Bon AppétitHealthyishnatural wineWineNew YorkTrendsRead MoreLifestyle11 Natural Wines That Taste as Good as They LookGallery11 SlidesBy Marissa A. Ross and Emily EisenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-07", "author": ["Condé Nast", "Emily Sundberg", "Emily Eisen"]}