{"id": "a345b3645933268b420c8d279c33bc21", "url": "https://www.bonappetit.com/story/athletic-brewing-company-non-alcoholic-beer", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "I Never Thought I Would Say This: I’m Into This Non-Alcoholic Beer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Never Thought I Would Say This: I’m Into This Non-Alcoholic BeerAthletic Brewing Company’s booze-free golden ale actually smells, tastes, and feels like the real thing.By Alex DelanyJanuary 24, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If someone were to steal art off the wall of your home, it would take you a while to notice. Not because you don’t love your wall decor, but because you (naturally) expect it to always be there. You’d walk around feeling uneasy, knowing something was missing without being able to put a finger on exactly what that something was. And that is exactly what I—a certified beer enthusiast—feel when it comes to non-alcoholic beer. Or at least I did, until I started drinking Athletic Brewing Company’s Upside Dawn Golden Ale.I heard about it last year from my friend Benjamin Pratt, co-owner of the always excellent beer bar As Is in New York City. He’s also a frequent marathon runner and, at the time, he was training for a massive race and swore off booze until he finished. Now, I am not a marathon runner...but I do take a month off from drinking every January—just as impressive, right?—so I took mental note of his serious endorsement of a non-alcoholic beer.Then, earlier this month, I bought a six-pack of Athletic’s golden ale—and I’ve bought a couple more since. This beer tasted and felt and smelled like the beers I love to drink the other 11 months of the year. It has a pleasant hoppy bitterness, layered with notes of lemon peel, fresh cut grass, and black tea. The yeast strain is light and bready, like a fresh baguette, and the body of the beer is soft and creamy up front with a crisp, clean finish that brings the can immediately back to your lips. I didn’t have to think twice: That sense of something missing wasn’t there.How do they do it? In short, I don’t know. Only the Athletic team—led by founder Bill Shufelt and head brewer John Walker—does. At their Connecticut brewery, they developed a proprietary (read: secret) fermentation process to remove alcohol from their brew, which they tell me no other producer of non-alcoholic beer has done. But really, you don’t need to know the science behind the process to appreciate its intent: A zero-alcohol beer that lives up to the same nerdy standards as regular stuff. And they did.All of this is really just to say: Don’t steal the art off the walls of my apartment. And don’t serve me a non-alcoholic beer that falls short of the real thing. After drinking Athletic for the past few weeks, I’ll notice.Buy it: Athletic Brewing’s Upside Dawn Golden Ale, $28 for a 12-pack on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendBeerNonalcoholicRead MorecultureI’m Now a Leisure Soda Guy, Thanks to These Refreshing Leisure SodasBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-24", "author": ["Condé Nast", "Alex Delany"]}