{"id": "a367b5b29ac4ecbc4e30c11f257254d6", "url": "https://www.bonappetit.com/story/donabe-steamer", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Donabe Is the Most Functional and Beautiful Thing in My Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Most Functional and Beautiful Thing in My KitchenI can't wait to bust out this donabe when friends come over for dinner.By Christina ChaeyApril 6, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Technically, everything you can cook in the Nagatani-en Mushi Nabe you can also make in a $5 metal steamer basket set inside a banged-up saucepan. But this is not a newsletter about pragmatic kitchenware, it's about beautiful splurge-y things for yourself and others (but mostly yourself). And considering I need only the barest of excuses to treat myself to $70 of California dates or a set of fancy ice cream dishes, here I am to tell you: You need this donabe.Elegant, durable, and outfitted with a removable steamer grate, this is the pot I can't wait to bust out when friends come over for dinner. As a steamer, it makes everyday sweet potatoes, broccolini, and asparagus all feel luxurious, like all my vegetables decided to take a day trip to the spa. Remove the steamer grate and the donabe becomes a gorgeous vessel for making hot pot, soups, or stews. True story: I once saw senior editor Amiel Stanek fill his donabe with warm bagna cauda and set it on a small rack arranged over a small candle, fondue-style. Dream big. —Christina Chaey, associate editor at Bon Appetit.Buy it: Nagatani-en Mushi Nabe Donabe Steamer, $144.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItShoppingRead MoreLifestyleThe Reusable Container I Shamelessly Eat My Desk Lunch Out OfBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-06", "author": ["Condé Nast", "Christina Chaey"]}