{"id": "a36ebff6475165a1963914c01a766dd9", "url": "https://www.bonappetit.com/story/kimchi-hot-honey", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Kimchi Hot Honey, Where Have You Been All My Life? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingKimchi Hot Honey, Where Have You Been All My Life?I made this two-ingredient condiment on a whim, but now I put it on everything.By Haneen J. IqbalAugust 5, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Kat BoystovaFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Hot honey has been having a moment for few years now—and for good reason. It’s an extremely versatile and delicious condiment, enhancing any food it touches with an irresistible hit of sweetness and heat. So, one morning, while I stood in front of my fridge and stared at my large container of very bubbly three-day pizza dough, I knew at least one of the pizzas was going to get some hot honey action. On the shelf right above the dough sat a bright green box of ssamjang—my latest condiment obsession—along with a huge jar of kimchi. That’s when I had my light bulb moment: I would use ssamjang as the pizza sauce, thinned with a bit of tomato sauce and olive oil, and I would make my own hot honey enhanced by a bit of surplus kimchi brine. The idea of this Korean-inspired pizza excited me in a way that few things have before or since then.Photo by Emma Fishman, food styling by Kat BoystovaSo, while the dough came to room temperature, I poured some of my favorite local honey into a small jar and then began adding brine from the kimchi jar a tablespoon at a time. I tasted as I went until it reached my desired consistency and spice level. The beautiful thing about making hot honey this way is that not only does it taste fantastic, or that it uses only two ingredients, but that the brine acts as a thinning agent as well, so there’s no need to dilute it with flavorless water to make it less thick and sticky. When my hot, steaming pizza came out of the oven, I drizzled the kimchi hot honey all over the mozzarella and then brushed the crust with copious amounts of it too. The result was *chef’s kiss*.Since that faithful day, I’ve dunked grilled cheese sandwiches into my beloved kimchi hot honey, along with slices of tomato, spears of cucumber, chunks of crispy tofu, chicken nuggets, and even ripe peaches. I’ve also drizzled it on top of burrata, any kind of egg dish, cheese toasts, and salads galore. This is all to say that kimchi honey makes everything it touches sing and that everyone should have a jar of it on hand at all times.Here’s how to make it: Take a small container or jar and fill it two thirds of the way with your favorite honey and then the remaining one third with kimchi brine. The basic ratio is two parts honey to one part kimchi brine. Whisk it around until well combined and you’re done! (The honey will taste as spicy as the kimchi you have, so keep that in mind.) Add more brine if you want your kimchi spicier and thinner, and less brine if you want to keep it thicker and less spicy. If the kimchi brine isn’t making it spicy enough for your taste, add a sprinkle of gochugaru or chile flakes to take it to the next level. Keep the jar or container in the fridge and use it with reckless abandon. You’ll thank me later.Explore Bon AppétitIt's That SimplecookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-05", "author": ["Condé Nast", "Haneen J. Iqbal"]}