{"id": "a37d2db002c24d4581ca2c6253d190c7", "url": "https://www.bonappetit.com/story/citrus-seeds-feud", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "A Super Bowl Menu from My Home to Yours | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Super Bowl Menu from My Home to YoursFajitas, hot soup takes, polenta inspiration, and more from the Beggs newsletter.By Alex BeggsFebruary 1, 2020FacebookTwitterEmailPhoto by Laura Murray, styling by Judy ManciniFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Big bowlWhat am I making for the Super Bowl? So glad you asked.Queso, Not From a JarMezcal-Marinated FajitasGin and TonicA salad????Photo by Chelsie Craig, styling by Molly BazWant this letter before it hits the website? Sign up for our newsletter!Soup, good“Gazpacho can’t be number two,” Christina Chaey scolded me. She helped me shape my hard-hitting, controversial speech performed at Bon Appétit’s live podcast this week called “Soups, Ranked.” So what? I like gazpacho! I moved it to number four. It’s so acidic and refreshing. After declaring an unpopular opinion about chicken noodle (dumb soup), I sprinted offstage. An audience member tapped my arm: “But have you ever had tomato soup with grilled cheese dipped in it?” she pleaded. Then Adam interviewed my hero Stella Bugbee; Priya Krishna and Jia Tolentino read beautiful essays; and a Test Kitchen competition game show had us SCREAMING about how to pronounce paprika. Keep an ear out for when the episode airs here, soon!Get the recipe for a Good Soup: Instant Pot Split Pea SoupGet mad at me here: Soups, RankedPhoto by Alex Lau, food styling by Sue LiPocket full o’ polentaI bought a giant bag of polenta to make lemon polenta cookies from Pastry Love over the holidays (fantastic cookbook AND cookies), but only used a ¼ cup. Since then, I’ve become obsessed with making oven polenta for dinner using a method Carla Lalli Music taught me that goes something like this: boil 5 cups of water in a Dutch oven, whisk in polenta, put the top on and move it to a 325° oven for 40 minutes. When the timer buzzes, stir in half a stick of butter (rounding up, Carla) and too much parmesan and pepper. Done! Then roast broccoli and mushrooms, bake some Trader Joe’s chicken-less tenders, do whatever you gotta do. That will go on top of the polenta all week.Claire Saffitz had a similar recipe a few years ago: Oven Polenta with Roasted Mushrooms and ThymePhoto by Laura MurrayNo meat zoneSpeaking of those chicken-less tenders, I tried all of Trader Joe’s meat imitators over a period of three days for a Healthyish article. By my final bite of an oddly firm but gelatinous not-turkey roast, I needed to chug a gallon of water. Because most of these meatless wonders are PACKED with sodium. (And preservatives, and rando starches, and plastic packaging). Use sparingly. While their Beyond Burger-esque burger is the biggest and newest accomplishment, my favorite product was the soy chorizo. That’s the only one of these I’ll buy again. Otherwise, I’m sticking to plant-based plants.Read it: All the Meat-Substitutes at Trader Joes, RankedPhoto by Gentl & HyersHa ha haThis is an entire experiment about how when we fart, our clothes act as a filter that keeps fart bacteria from escaping into the room and spreading bacteria. “Our final conclusion? Don't fart naked near food,” write some actual scientists. Noted. Hat tip to my friend Christina who shared this on Facebook, a popular social medium.Get the recipe: Brothy Heirloom Beans with CreamNot enough sauceOld Bay announced a limited-edition hot sauce that sold out in an hour. On Brad Leone’s Instagram story, “please hook me up haha” was a plea for a sample. Shameless, Brad! (Whispers: I want sooome.)Quota fulfilledWe said goodbye to digital director Carey Polis this week, who’s moving to D.C with her fam. Carey hired me at Bon Appétit a few years ago and I’ll never forget the most important advice she gave me. “You get one, Beggs,” she warned. She meant I could only compare food to a human toenail once. Thanks for looking out, Carey!!! Gonna miss ya.Unnecessary food meme of the weekUnnecessary food feud of the weekAlex LauIt’s STATUS CITRUS season, folks. You know what that means: $2 Sumo oranges tempting us with their booblike shapes. And my Christmas gift of 10 lbs. of Ojai tangerines arriving on my doorstep, weeeee! Everyone in the BA offices is walking around with orange hands (as you may remember, an unfortunate side effect), and one person in particular is WHINING about SEEDS. That’s Alex Delany, who prefers his citrus seedless. “We live in 2020—no need for seeds here,” he campaigned. “Let’s keep pushing society forward.” I rescinded my offer of a tiny, juicy, impossibly sweet tangerine—packed with seeds. Jesse Sparks and Emily Schultz booed, “WE HATE SEEDS.” From an office, Meryl Rothstein shouted out her love for farmers’ market grapes, which usually have seeds. “I don’t enjoy seeds,” confessed Christina Chaey, “but they help me from overeating grapes.” Chaey, what?!? In what Bacchanalian situation are you GORGING on GRAPES? Sarah Jampel is Team Seeds Are Fine. Aliza Abarbanel had thoughts. “If you complain about seeds in a good orange you are a wimp,” she said. “Oranges take work! You have to peel them and you might get a seed but that’s part of the deal! Nobody complains about cherry pits!” EXACTLY.Make the beautiful recipe pictured above: Citrus and Avocado Salad with Orange WaterExplore Bon AppétitBeggs NewsletterSuper BowlRead MorecultureI Made BA’s Best Banana Bread and It Was Indeed the BestBy Alex BeggscultureMake Chicken Meatballs for the SoulBy Alex BeggscultureMy 2019 “Keeper” Recipe Is Never Leaving My SideBy Alex BeggscultureSoups, RankedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-01", "author": ["Condé Nast", "Alex Beggs"]}