{"id": "a382db8a7ea66f522de3a71d8b7afca7", "url": "https://www.bonappetit.com/recipe/cranberry-rum-punch-1", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Cranberry Rum Punch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueCranberry Rum PunchBy Kendra VaculinNovember 23, 20214.1(13)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintSince this fall-flavored rum punch is so simple to throw together, go the extra mile and make festive cranberry-studded ice, which serves as a garnish and temperature control in one. A mix of whole and thinly sliced berries looks best—any ice tray will work. Depending on the sweetness of your ginger ale and hard cider, you might not need the simple syrup, but it will be worth making to have on hand for other cocktails (a pre-feast Whiskey Smash? An NYE French 75? We could go on).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLadle$27 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonSmall Saucepan$155 At AmazonWhisk$10 At AmazonIngredients8 Servings1cup fresh or frozen cranberries1cup sugar1750-ml bottle white rum3cups dry hard cider2cups unsweetened 100% cranberry juice1cup ginger ale¼cup fresh lime juicePreparationStep 1Thinly slice about a third of the cranberries and leave remaining berries whole. Fill sections of an ice cube tray with berries, then pour in water to fill. Repeat with more trays as needed until you have used all of the cranberries. Freeze until solid.Step 2Meanwhile, bring sugar and 1 cup water to a boil in a small saucepan, whisking until sugar is dissolved. Let simple syrup cool.Step 3Stir rum, cider, cranberry juice, ginger ale, lime juice, 3 tsp. simple syrup, and some cranberry ice in a pitcher or punch bowl. Taste punch; add more syrup if needed. Fill 8 glasses with remaining cranberry ice and pour punch over.Do ahead: Cranberry ice and simple syrup can be made 1 month ahead. Transfer ice to a resealable plastic bag and keep frozen. Transfer simple syrup to an airtight container and chill.How would you rate Cranberry Rum Punch?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI made this for New Year’s Eve at home and it was a huge hit. It is a bit strong, but we were fine with that! Adding more cranberry juice lowers the booziness. We made the cranberry ice cubes and they were the star - everyone loved them! \nThis was a super easy recipe that I’ll make again very soon. Rachel Z1/1/2022Very festive. I accidentally put too much run in, even with that, did not find it as strong as previous reviews. Will definitely use again over the holidays. \nNot too sweet, limey and refreshing. Was a hit with our family. AnonymousMichigan12/26/2021Fabulous. Definitely strong but absolutely delicious. Had it for work party and everyone loved itKe HaAtlanta, GA12/24/2021Extremely easy — didn't have time to make the cranberry ice, so just threw regular ice and frozen cranberries into the drink. Totally beautiful holiday vibes in a coupe glass. VERY strong, as a word of warning. Anna12/13/2021The servings seem inaccurate for this recipe. A fifth contains at least 15 shots (depending on how you measure a shot). AnonymousDC12/7/2021Explore Bon AppétitDrinksPitcher DrinkDrinks AllPunchCocktailRumAlcohol & Other DrinksCranberryBerryFruitHard CiderChristmasNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Kendra Vaculin"]}