{"id": "a383fb6d25028ab18c21a4d6b96f517c", "url": "https://www.bonappetit.com/recipe/hasselback-short-rib-bulgogi", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Korean-Style Hasselback Short Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueKorean-Style Hasselback Short RibsBy Chris MoroccoJune 2, 20204.5(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintCrispy bits. Charred edges. Burnt ends. They’re inarguably the best part of any piece of grilled meat and inevitably the ones in shortest supply. That’s the sheer brilliance of the boneless short rib served at Cote, NYC’s tony Korean steak house. By making deep slashes all along both sides of the meat before marinating and grilling (imagine a Hasselback potato) rather than thinly slicing the meat before cooking, chef David Shim creates a whole new world of surface area, creating enough crunchy, crusty morsels to keep the whole table happy. For this recipe, we combined his slashing technique with a bulgogi-inspired marinade, for a riff on bulgogi that is ideal for grilling at home. You can simply grill the scored short ribs on a standard grill grate without fear of losing meat to the fire below.Ingredients4 servingsSsamjang1scallion, very finely chopped¼cup white miso1tsp. gochujang (Korean hot pepper paste) or hot chili sauce (such as Sriracha)1tsp. sugar1tsp. toasted sesame oil1tsp. toasted sesame seedsScallion Salad6scallions2tsp. toasted sesame oil2tsp. unseasoned rice vinegar1tsp. toasted sesame seedsShort Ribs and Assembly11\" piece ginger, peeled, finely grated2garlic cloves, finely grated¼cup soy sauce2Tbsp. unseasoned rice vinegar2Tbsp. light or dark brown sugar1Tbsp. gochugaru (coarse Korean red pepper powder) or 1 tsp. crushed red pepper flakes1Tbsp. toasted sesame oil1½lb. 1\"–1½\"-thick boneless beef short ribs, trimmedVegetable oil (for grill)Kosher saltLettuce leaves (for serving; optional)PreparationSsamjangStep 1Mix together scallion, miso, gochujang, sugar, oil, sesame seeds, and 1 tsp. water in a small bowl.Scallion SaladStep 2Trim scallions and slice in half lengthwise. Cut crosswise into 3\" lengths, then slice pieces lengthwise as thinly as possible into matchsticks. Rinse under cold water; drain well and pat dry. Transfer scallions to a medium bowl; add oil, vinegar, and sesame seeds and toss to combine.Short Ribs and AssemblyStep 3Mix ginger, garlic, soy sauce, vinegar, brown sugar, gochugaru, and sesame oil in a medium bowl to combine.Step 4Using a sharp knife, slice short ribs at a steep angle every ¼\", cutting no more than halfway through meat. Turn over and slice on the second side, maintaining the same angle as the first side (this helps to keep meat in 1 piece by minimizing the danger of slicing all the way through). Place meat inside bowl with marinade and toss well to coat, working marinade into slashes in meat. Cover bowl with a large plate and let sit at room temperature at least 2 hours or chill up to 1 day.Step 5Prepare a grill for medium-high heat; oil grate with vegetable oil. Remove short ribs from marinade and very lightly season with salt. Grill, turning every 1–2 minutes and moving to a cooler part of grill if needed, until meat is firm to the touch and peeking inside deepest slashes shows just a streak of pink (cooking the meat to at least medium helps build flavor and yields the best texture), 8–10 minutes.Photographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykStep 6Transfer short ribs to a cutting board and let rest at least 5 minutes before slicing across the slashes—or frankly, just tear it apart.Step 7Season scallion salad with salt. Serve short ribs with scallion salad and ssamjang, wrapped in lettuce if desired.How would you rate Korean-Style Hasselback Short Ribs?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI was a bit wary of the bulgogi-\"inspired\" marinade, I thought maybe I should just make this with actual bulgogi marinade, but I always try to give the original recipe a shot before modifying. It came out delicious. I still think it would be great with an actual bulgogi marinade, but I enjoyed this one a lot, and it's less work than real bulgogi marinade. I love the idea of hasselbacking the short rib, the texture was super nice, and I will definitely be making short ribs this way in the future. I should mention, I don't own a grill or even a grill pan, so I seared it like a steak in a carbon steel skillet. Perhaps that missed the point of the recipe, but it worked out well for me.pigeonWhispererNYC6/15/2020Explore Bon AppétitAsianEast AsianKoreanShort RibBeefMeatScallionOnionVegetableMainDairy-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}