{"id": "a3911e87ca9307bc1cb7e83fbf6627c3", "url": "https://www.bonappetit.com/recipe/bushs-fireside-brisket-chili", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "BUSH’S® Fireside Brisket Chili Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® Fireside Brisket ChiliFacebookPinterestTwitterEmailBrisket, bacon, and beans are the culinary trifecta you’ve been waiting for.PrintIngredientsOne 2 pound piece beef brisket, fat mostly trimmed, cut into two piecesKosher salt and freshly ground black pepper3 tablespoons extra-virgin olive oil1 medium red onion, chopped (2 cups)2 garlic cloves, peeled and smashed2 tablespoons tomato paste3 oz. bacon, cut into ½-inch pieces1 (28-oz.) whole peeled tomatoes1 cup low-sodium chicken broth2 guajillo chilis, stemmed, seeded, and torn into small pieces1 teaspoon dried oregano2 (15.5 ounce) cans BUSH’S® Pinto Beans in a Mild Chili SauceSour cream, diced avocado, shredded cheddar cheese, and chopped scallion for servingRecipe PreparationSeason brisket all over with salt and pepper. Set Instant Pot to high Sauté function and add 2 tablespoons of the oil. When hot, add the brisket and cook, turning to brown all over, about 8 minutes. Remove brisket to a plate and drain fat.Return the insert to the Instant Pot and add the remaining tablespoon of oil, the onion, bacon, and garlic and cook until softened, about 5 minutes. Add the tomato paste and cook, stirring, until slightly darkened in color, about 2 minutesUsing kitchen scissors or your hands, break up the whole peeled tomatoes in the can and pour into the instant pot along with the broth. Return the brisket to the pot and add the guajillo chilis and oregano. Lock lid and set to Pressure Cook on High for 1 hour.Follow manufacturer’s instructions to quick release, then remove lid.Carefully transfer the piece of brisket from the pot to a plate and shred using two forks. Return brisket to pot and stir in the beans to warm through. Serve topped with avocado, sour cream, scallion, and cheese.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansChiliTex-MexBrisketPinto BeanGuajillo ChileMainGluten-FreeInstant PotSuper BowlDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}