{"id": "a395922b522c6fa3d277836179bbfe29", "url": "https://www.bonappetit.com/recipe/caesar-salad-roast-chicken", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Caesar Salad Roast Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueCaesar Salad Roast ChickenBy Molly BazAugust 18, 20204.8(40)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe only thing better than a roast chicken and a Caesar salad is a Caesar salad served with a chicken smothered in Caesar dressing and roasted until the garlic, anchovies, and mustard become deeply caramelized and flavorful.Ingredients4 Servings8anchovies, mashed to a paste8garlic cloves, finely grated6Tbsp. mayonnaise, divided1Tbsp. Dijon mustard, plus more for serving2Tbsp. extra-virgin olive oil, divided1½tsp. freshly ground black pepper, plus more13½–4-lb. whole chicken or 4 chicken legs (thigh and drumstick; about 3 lb.)Kosher salt8medium shallots, unpeeled, halved lengthwise2lemons, divided1oz. Parmesan, finely grated4oz. country-style bread, torn into 1½\" pieces2romaine hearts, leaves separated, tornPreparationStep 1Place a rack in lower third of oven; preheat to 450°. Whisk anchovies, garlic, 3 Tbsp. mayonnaise, 1 Tbsp. mustard, 1 Tbsp. oil, and 1½ tsp. pepper in a small bowl. Set aside 1 Tbsp. anchovy mayo in another small bowl.Step 2Pat chicken dry; season outside and inside all over with salt. Arrange breast side up in a cast-iron skillet and tuck wings underneath. Arrange shallots around (if using legs, nestle under and around); season with salt and pepper. Brush remaining anchovy mayo all over chicken, making sure to get it into the nooks and crannies, then brush shallots with any leftover anchovy mayo.Step 3Place chicken in oven so legs are facing toward the back (this is the hottest part of the oven and will help the legs cook before the breast dries out) and roast until some anchovy mayo and fat begin to drip onto shallots, about 15 minutes. Remove from oven and, using tongs, turn shallots to coat in drippings. Return skillet to oven and continue to roast chicken, stirring shallots once or twice, until golden brown and an instant-read thermometer inserted into the thickest part of breast registers 155°, 45–55 minutes. If skin starts to get too dark on the top before chicken is done, tent area with foil, leaving the rest of the bird exposed. If using chicken legs, start checking at 40 minutes (a thermometer inserted right at the joint should register 160°). Transfer chicken and shallots to a cutting board, leaving behind any juices and fat in skillet. If shallots need more time to soften and darken, roast a bit longer without chicken before proceeding. Reserve skillet.Step 4Reduce oven temperature to 400°. Finely grate half of zest of 1 lemon into a large bowl; cut lemon in half and squeeze in juice. Add reserved 1 Tbsp. anchovy mayo, remaining 3 Tbsp. mayo, and remaining 1 Tbsp. oil and whisk to combine, then stir in Parmesan. Season with salt and pepper. Set dressing aside.Step 5Add bread to reserved skillet with fat and turn to coat. Return skillet to oven and toast bread, tossing halfway through, until golden brown and crisp, 12–15 minutes. Transfer croutons to bowl with reserved dressing. Add romaine and gently toss until lettuce is well coated. Season salad with salt and pepper.Step 6Slice remaining lemon into wedges. Carve chicken and nestle back into skillet or transfer to a platter; arrange shallots and lemon wedges around. Serve with salad and more mustard alongside.How would you rate Caesar Salad Roast Chicken?Leave a ReviewTell us what you thinkReviews (25)Back to TopTriangleI made this a couple of nights ago.  I used skin-on thighs and they were delicious! Like most of the reviewers, my wife raves about it!  And I love a good Caesar, too - it's one of my faves.  But.  I feel that it was too much of the same flavour throughout.  Caesar chicken, Caesar salad.  It just needs a bit of flavour contrast to become one of my faves.  I will make it again because my wife loves it, but I think it would be better with a contrasting dressing on the salad - maybe do the croutons with Caesar dressing, but a brighter dressing on the salad....Bill C from Victoria BCVictoria, B.C., Canada2/25/2022I’ve make this pretty regularly. Use my mini food processor to make the anchovy garlic mayo and sometimes I’ll roast some broccolini or asparagus on a sheet pan at the same time as the croutons when I want a little more veg. Fantastic recipe. MiguelDallas, TX6/17/2021I made this recipe at least once a month--usually add some extra anchovy paste and garlic and it always tastes amazing. Make sure you bring your chicken to room temp before cooking otherwise it'll take longer. Also yummy with red onion instead of/in addition to shallots! During Whole 30 I omit the parm, roast some butternut squash instead of croutons, and make my own mayo. Mmmmmm! Noelle Berkeley, CA 2/19/2021This recipe is my favourite chicken recipe..  So tender and Wonderful, the salad is perfection. MOLLY BAZ is the best..I trust her on most recipes...j. acunaBiarritz France.2/14/2021This was surprisingly easy to make - fewer steps than it looks like. BOLD in flavor and the garlic lingers long after the meal - a good thing! Used chicken thighs and it came out beautifully. Easy way to get kiddos to eat salad when they're usually reluctant. So delicious, they didn't even realize. Will make again with whatever chicken I have on hand. Wonderful for any season or occasion - weeknight dinner or guests. Just when you thought chicken caesar salad was boring and done, a fresh take makes it new again. A must in the repertoire.LaurenCLos Angeles, CA1/20/2021Chicken Caesar Salad may be in my top 5 favorite foods and this does not disappoint. I have made this at least once a month since I learned about it. This is delicious! The chicken is perfect and very anchovy-y with a good amount of garlic. The croutons are what makes this dish special, it soaks up all of the chicken drippings and turns the flavor up 100%. Currently waiting for them to finish now before I indulge in another plate of chicken caesar salad. This time with some anchovy mayo grilled shrimp and avocado.SimonChicago, IL1/3/2021I've made this three times now, and it might be my favorite chicken recipe. Obviously a riff on the famous Zuni Cafe roast chicken and bread salad, this one amps up the crunch and the garlic. A couple of notes: I've used three different brands of anchovies that come packed flat in olive oil in 2-ounce cans. There are about 10 anchovies in those cans (perfect for putting eight in the recipe and snacking on the other two) and there are about 2 tablespoons of oil with them -- use that as the oil in the recipe. The first time I tried this, I thought it would be easy just to use my knife to smear the garlic into a paste with the anchovies like you do with kosher salt. Bad, bad idea. The anchovies are too wet to get the garlic fine enough by a long shot. I had to spend almost 20 minutes finishing it in a mortar and pestle, and even then, the result was too chunky. Follow the recipe and grate the garlic on a microplane. The mayonnaise has to be homogenous. For my version last night, the shallots at my market were no-go, so I used two  quartered medium red onions and the result was every bit as delicious. And also last night, I had challah leftover from the first night of Hanukkah. Old challah isn't very good, but it was awesome as croutons here, though it required more attention in the oven than a sturdier bread. My personal preference would be to make the croutons a little smaller than called for here if you're using a sturdy loaf. Next time, I'm going to try cutting the bread into eighth-inch slices about the size of a golf ball, the way Lidia Bastianich does for the croutons in her restaurant caesar salads.AnonymousKansas City12/14/2020Awesome new way to roast a chicken (even if you aren't putting it on salad). Used onions instead of shallots but still got a beautiful result.Izzy SiedmanPortland, ME11/26/2020Delicious. Worth every step! I did without the shallots and it still turned out great.AnonymousBay Area, CA10/19/2020Incredible. This is an 11/10 recipe that will please even the salad-haters (truthfully, we don't have any of those in my family). The  \"croutons\" are to die for. Very filling, rich, and flavorful. AnonymousLos Angeles10/12/2020Stellar. If you’ve ever had or made the Zuni roast chicken - this uses the same crouton soggy/crispy bread situation. Holy s**t they’re tasty addicting little nuggets of heaven. My whole chicken legs were done when I checked them 30 min after going back inAnonymousSan Francisco 10/7/2020This has quickly become one of my favorite recipes. If I haven't recently made some and have leftovers in the fridge, I'm already thinking about the next time I'm going to make it. I'm insecure about working with a whole chicken, so I tend to use thighs or legs and it works out perfectly fine. The croutons and shallots are my favorite elements of the dish. I definitely recommend splurging a little when it comes to the bread. Thus far I've used garlic bread, rosemary bread, and sourdough. All were delicious. Can't wait for the next time I make this. invadethecitySpokane10/4/2020So rich and savory--the chicken dripping-coated croutons stole the show, and the chicken itself (I used legs) was very good and juicy, though the skin didn't crisp up quite as much as I would have hoped. Next time I'll put it higher in the over to try and help it along.Anonymous9/23/2020Anchovy taste is really really strong, I would probably cut down to 4 or even 2 pieces of anchovies next time.Anonymous9/22/2020Amazing! So flavourful. I marinaded the chicken overnight in the anchovy mayo, made it even better!sumi-e9/21/2020Explore Bon AppétitSaladItalian AmericanAmericanChickenPoultryAnchovyFishSeafoodRomaineLettuceLeafy GreensVegetableParmesanCheeseChicken LegMainHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Molly Baz"]}