{"id": "a39642ff6370f858e09db1058c2fb117", "url": "https://www.bonappetit.com/story/jenny-feldt-restaurant-diary-3", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "The Vaccine Is Having a Profound Impact on Hospitality Workers' Mental Health...Including Mine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Vaccine Is Having a Profound Impact on Hospitality Workers’ Mental Health…Including MineIn her third Restaurant Diary entry, brand ambassador Jenny Feldt talks about how things are starting to feel almost normal again for Atlanta’s hospitality industry.By Jenny Feldt, as told to Elsie YangApril 21, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week, you’ll hear from one of them: farmer Kristyn Leach, wine educator Kyla Peal, line cook Peter Steckler, and bartender turned brand ambassador Jenny Feldt. Here Feldt talks about how access to the vaccine has positively impacted workers in the hospitality and service industries and how she’s keeping that going with her work at Grey Goose and on a personal level. Read her first and second diary entries here.During the election, Atlanta turned a number of its sports stadiums into polling places to help folks cast their ballots. Now, as the tide hopefully starts to turn against the pandemic, the city is taking similar actions at one arena, Mercedes-Benz Stadium, to provide vaccinations—around 6,000 per day.It’s important to recognize the degree of exposure that many people in the hospitality industry had—and continue to have—to the virus during the pandemic. Both in my role as a brand ambassador at Grey Goose here in Atlanta and as a beverage consultant at Prost in Washington, D.C., I recognized the fear that a lot of my industry friends and colleagues had with going to work. Their jobs are people-facing jobs. So when a pandemic strikes, it can be really hard to be vigilant about protecting yourself, no matter how careful you are.Because of that, making the vaccine readily accessible in Atlanta has had a pronounced effect on the mentality of the hospitality workers I’ve seen. It feels like we’re collectively breathing a big sigh of relief and starting to get back to how things used to be. I’ve been a huge proponent of getting hospitality workers vaccinated as soon as possible, and while I haven’t been able to get my first shot due to health reasons, just knowing that it’s readily available provides some sense of comfort. And in my role at Grey Goose, as we keep a finger on the pulse of how bartenders and folks in the industry are doing, we’re hearing that more and more people are feeling safer on the job.Photo by Jose PereiroEven as more of us get vaccinated, certain things will never go back to the way they were pre-COVID-19. For example, before the pandemic, I would’ve never even thought to do virtual education. But now it makes so much more sense for me to be projected on a screen in restaurants in three different states in a day rather than having me travel to those places throughout a week. While Grey Goose originally pushed these virtual sessions for the safety of our team members, it now just seems like the practical thing to do. In some ways, I don’t think the virtual part of my job will ever go away.This also allows us to reach more bartenders and industry workers more easily. We’re able to check in with folks around the country to better understand what bartenders need to keep their businesses afloat. We’ve definitely done some programming around financial assistance, but just as—if not more—important, in my mind, are the mental health initiatives. The health and wellness of hospitality folks is often overlooked. So as we head into the spring and the summer, we’re looking for ways to help industry workers, whether that’s through encouraging them to get outside or simply providing access to a range of mental health apps.One project I’ve taken on here in Atlanta is teaming up with A Sip of Paradise, which is a community garden created by an incredible group of bartenders for bartenders. The garden provides plots of land for bartenders to grow their own produce, fruits, and herbs and tend to their own mental health. I’ve held meditation classes in the garden, and I’m planning a variety of educational resources for the community members throughout the year. I’ve also set aside a portion of my garden plot to donate to others who need it more.As more of us in the industry become comfortable with being out and about and interacting with customers again, that will have a positive effect on our general mental well-being. I’m really hopeful that the vaccinations will keep pushing us in that direction. Explore Bon AppétitRestaurant DiariesCoronavirusBarsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-21", "author": ["Condé Nast", "Jenny Feldt", "As Told To Elsie Yang"]}