{"id": "a39cbdc8be785edffac095ff9f654831", "url": "https://www.bonappetit.com/story/fruition-easter-chocolate", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "This Easter Chocolate Is Perfect For Gifting (or Buying Yourself) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Chocolate Isn’t Your Average Easter Basket CandyStep away from the hollow rabbits.By Elaheh NozariMarch 28, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailGenerally speaking, Easter chocolate is predictable: solid bunnies that hurt your teeth, Reese’s peanut butter cups reshaped as eggs, Cadbury cremes. They’re not bad, they’re just not memorable. Which is why this year, we’re all about Fruition, whose Easter eggs and chocolate berries are standout treats that capture spring in a way that day-old, clearance rack milk chocolate never will.Hat tip to senior food editor Chris Morocco for recommending the Catskills, New York-based chocolatier; he loves their dark milk chocolate, even though he doesn’t even like milk chocolate. Fruition’s Easter eggs ($12) elevate traditional peanut butter- or ganache-filled chocolate eggs to a whole new level. The packaging resembles four quail eggs in a nest—the two blue ones have a creamy center with peanut butter and crunchy toffee, while the pink strawberry basil ones have a slightly savory white chocolate filling. The eggs aren’t big—you can eat one in two bites—and (spoiler alert) each egg has a flat chocolate surface, so really, you’re getting four halved eggs. A trompe l’œil, if you will.Not your average chocolate egg.\nIn terms of chocolate pairings, the eggs taste well alongside the chocolate tumbled raspberries ($15). They don’t scream Easter as much as the eggs, but that’s what makes them a good gift all season long (hi, Mother’s Day). Each jar contains a shareable amount of chocolate gum drops-meet-powdered truffles filled with freeze-dried raspberries. They have a pure cocoa aroma and though the outer surface is powdery, you’ll taste the smooth white chocolate inner coating before you get to the raspberry filling. They simultaneously melt and crumble in your mouth and aren’t at all gooey. Like the Easter eggs, the chocolate raspberries combine rich dark chocolate with sweet and fruity touches in a parade of flavor.All of Fruition’s “bean to bar” chocolates are handcrafted from fair trade and organically grown cacao beans. There’s a solid selection of 60-gram bars like the 68% dark milk chocolate one that Morocco loves, and the insanely rich 100% dark chocolate. And if you can’t resist a chocolate bunny, fear not—Fruition makes a classic hollow one for all those Easter baskets.Buy Fruition chocolate on its website or bars on Amazon. The last we checked, the eggs were sold out on Fruition’s site, but we found them at Zingerman’s for $20.A different kind of egg:Explore Bon AppétitShoppingChocolateEasterRead MoreshoppingCompartés Chocolate Bars Are the Gift I'm Giving Everyone This YearBy Amanda ShapirofeaturesTrader Joe’s Newest Products in 2018, ReviewedBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-28", "author": ["Condé Nast", "Elaheh Nozari"]}