{"id": "a3bac0411e10e572740a7fd5cbed9146", "url": "https://www.bonappetit.com/story/chef-traci-des-jardins-closing-jardiniere", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "My Restaurant Jardinière Is Closing, But I’m Not Letting It Go Away Quietly | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMy Restaurant Is Closing, But I’m Not Letting It Go Away QuietlyChef-owner Traci des Jardins explains how she’s choosing to say goodbye to her landmark San Francisco restaurant, Jardinière.By Traci des Jardins, as told to Elyse InamineApril 25, 2019FacebookTwitterEmailPhoto by Ed AndersonFacebookTwitterEmailAfter 21 years—and numerous accolades, including a James Beard Best Chef: Pacific award—chef-owner Traci des Jardins is closing Jardinière on Saturday. She says she’s “tired of fine-dining,” and as of the announcement made on March 25, she’s received overwhelming support from the restaurant community, food media, and her regulars. In the days when restaurant cooking was flashy and theatrical, and long before San Francisco’s Hayes Valley became a hotbed of trendy restaurants, des Jardins opened this quietly confident white table-clothed, French technique–driven, local produce–powered restaurant. It was a revolutionary move in 1997, and Jardinière soon became an institution. But it was more than just a groundbreaking restaurant; it was a home for all who came in to dine, and especially to those who came to work. How do you close a restaurant with so much history? Des Jardins is figuring that out. —Elyse InamineWe’ve changed a lot of things at Jardinière over the years to stay relevant. We got rid of the live music and replaced the stage with a somm station. We turned the dining room downstairs into a lounge. Recently, I’ve been examining what works and what doesn’t at Jardinière. I was trying to figure out what else we could do to keep the restaurant fresh and current. I don’t think there was one moment, but I realized I didn’t want to change anything. I’m proud of the work we’ve done. The hospitality. The food. The wine service and the cocktails. I stand by it. So I decided to close Jardinière.I’ve opened a lot of restaurants, but I’ve never had the experience of closing one. I reached out to colleagues who had and asked them: How can I do this graciously? How do I do this in a way that makes sense on my own terms? I’ve always been self-reflective and thought about my impact on the world; it probably came from my parents. “Treat people the way you want to be treated—with fairness and kindness,” they said. As I close Jardinière, I just want to make sure everyone, whether they’re guests or staff, feels like someone cares. That’s the person I want to be in this world.Des Jardins with Audie Golder, the current executive chef of Jardinière. He's been at the restaurant for the last eight years.\nPhoto by Ed AndersonSo, we talked to the staff first about a month ago, and it was extremely emotional. It was an all-staff meeting, which doesn’t happen that often. They were wondering what was going on. I had remarks prepared, but the emotions took over, not just in terms of my own feelings but the staff’s. When you run a restaurant as long as I have, you have people who have been there for 19 years. It’s family.The public announcement happened at the same time. With social media, you have to be mindful. If one staff member puts it on social media, then word gets out. We had to be cognizant of communication. Since then, I’ve been in the restaurant every night. Guests have come back, like a couple who had their first date, got engaged, threw their wedding reception, and eventually brought their kids here. Reliving that whole trajectory of people’s lives and understanding the role that the restaurant has played in their lives has been incredibly rewarding. I’m talking to dozens of people every night, some I know well and others I don’t. It’s exhausting, but it’s my way of letting go and saying goodbye as well as my way to give the staff support.Perfectly cooked duck, the Jardinière way.\nPhoto by Ed AndersonSome have left already, which is expected, but a lot of them have stayed on. They want to go out strong. The most important thing to me is that every single person who works for me has a job and a sense of work security moving forward. We have 65 employees. There are a lot of opportunities, so the management team and I are looking at each person and making sure there is a spot for them that is best for them. We know things, like where they live and what they think the ideal job is for them. We’re a close-knit community.Twenty-one years ago when we opened, we offered health care for our employees; we paid 50 percent of it from the beginning. These were the things that were important to me as an operator. I want to make sure my staff is moving into a new job that has those same aspects. I have one runner who is going to work at Prospect. I know Kathy King and Nancy Oakes; they have a similar service and kitchen style. And I know he’s going to be super happy and feel appreciated there. We’re very much in process on this—we’re not done until everyone who needs assistance is taken care of.A lot of restaurants try to gently go away when they close and not make noise about it. Not making any judgments about that, but I decided to go through this process much more publicly and use it as an opportunity to share. This is something a lot of people will go through. It’s not easy. It’s not all positive. I’m curious how I can be a leader in this kind of stuff. There’s a lot of learning to be done, but I’m realizing closing can be done gracefully. And it can serve a purpose.Explore Bon AppétitRestaurantsChefsSan FranciscoFirst PersonRead MorecultureMy Restaurant Was the Greatest Show of Excess You’d Ever Seen, and It Almost Killed MeBy David McMillan of Joe BeefrestaurantsAfter Three Moves, A Cult Neapolitan Pizzeria Calls NYC HomeBy Anthony MangierirestaurantsHow a Cheap, Bent-Up Composition Notebook Helped Me Open a RestaurantBy Ori MenasheRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Traci Des Jardins", "As Told To Elyse Inamine"]}