{"id": "a3db9f617ffa23bb7729dd8bf0b2608e", "url": "https://www.bonappetit.com/story/diet-for-a-small-planet-anniversary", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "Diet For a Small Planet Started a Food Revolution in 1971—And It’s Never Felt More Relevant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Book Started a Food Revolution in 1971—And It’s Never Felt More RelevantDiet For a Small Planet argued that plant-centered eating is better for ourselves and our planet. Fifty years later, that idea is still shaping how we eat.By Jonathan KauffmanMarch 23, 2021FacebookTwitterEmailIllustration by Clay HicksonFacebookTwitterEmailGo back in time with us to 1971, the year that changed the way we eat forever.When Frances Moore Lappé called cattle “a protein factory in reverse” in her 1971 book Diet for a Small Planet, she wasn’t just arguing that meat was an inefficient way to feed humans, though it is. Nor did she set out to turn millions of Americans vegetarian and help the natural foods movement find its political voice, though she did. For the 26-year-old researcher, Diet was an act of radical hope.From 1968 to 1971 young Americans like Lappé had witnessed the assassinations of Martin Luther King Jr. and Robert Kennedy, civil unrest that ripped through dozens of cities, and the violent suppression of activists like the Black Panthers and the Kent State protesters. The futile carnage of the Vietnam War was endless, and their generation were the ones killing and dying.Yet this generation, weaned on the civil rights movement and President Johnson’s War on Poverty, were caught up too in the intoxicating possibility of change. After graduating college Lappé worked as a community organizer in Philly. Then she moved to California and enrolled in UC Berkeley’s School of Social Welfare but dropped out, convinced it was pointless to try to alleviate poverty and hunger if we couldn’t identify their causes.You can still find early editions of the book (like this one from 1975) for sale on the internet.\nOne of the ambient stories circulating at the time was that Earth was so overpopulated it could no longer feed itself. So Lappé descended into Berkeley’s Agricultural Economics Library, armed with a slide rule, to analyze crop reports and nutritional studies. She calculated that hunger wasn’t caused by a scarcity of food. It was a problem of food distribution. If we grew crops for humans instead of for livestock, ethanol, or high-fructose corn syrup, the United States alone could feed every famine-afflicted person on earth.“I was so excited,” she says now. “We’re creating hunger. So we can end it. There’s nothing inevitable about that.She was convinced everyone would want to hear such good news, so she wrote up a one-page flyer and distributed it around Berkeley. That turned into a booklet and then, after someone forwarded it to Ballantine Books, into the first edition of Diet for a Small Planet. When Betty Ballantine bought the book, the publisher told Lappé she shouldn’t just tell people about hunger. She had to show them how to feed themselves. So Lappé enlisted her friend Ellen Buchman Ewald to help transform a manifesto into a cookbook.Diet for a Small Planet came out the very year the natural foods movement took off. Lappé’s generation rejected the industrially produced, chemical-infused foods that dominated American grocery stores, instead cobbling together a mishmash diet: the brown rice and tamari that macrobiotic practitioners loved; wheat germ and sprouts from tiny health food stores; granola invented by Seventh-day Adventists. But the recipes (Nutty Noodle Casserole, Garbanzo Cheese Salad) inspired folks with no interest in the long-haired, pot-smoking counterculture to search out unfamiliar ingredients, sparking a food co-op boom.Lappé was not without her critics, who zeroed in on one of her first edition’s core concepts: the now disputed idea that in order to replicate the perfect balance of amino acids in meat and eggs, we had to pair “complementary proteins” in, for example, grains and beans. (It was based on science that quickly evolved past the studies she cited.) But Diet’s message is just as trenchant now as it was 50 years ago, especially as climate change and soil degradation threaten our food supply. Today the book’s echoes infuse Impossible Burger press releases and UN reports alike.“Choosing a plant-centered diet doesn’t change the world, but it changes me,” Lappé says. “Change is not based on individual acts alone, but without those acts, how can we believe that it’s possible?”The 50th anniversary edition of Diet for a Small Planet drops in September, with new recipes from José Andrés, Bryant Terry, Alice Waters, and more.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Jonathan Kauffman"]}