{"id": "a3dc30c867fbfc652f418b18e9d2cd5a", "url": "https://www.bonappetit.com/story/valentines-day-cheese-and-rom-coms", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "10 Valentine's Day Pairings for Cheeses and Cheesy Rom-Coms | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture10 Valentine’s Day Pairings for Cheeses and Cheesy Rom-ComsRoses are red, cheese is blue, 'How to Lose a Guy in 10 Days' is the movie for you.By Alyse Whitney and Carey PolisFebruary 12, 2018FacebookTwitterEmailParamount PicturesFacebookTwitterEmailValentine’s Day is notoriously cheesy. The dozens of roses, poorly-rhymed cards, and heart-shaped boxes of chocolates are recycled every year. But if you really want to embrace the cheesiness, you need one thing: cheese. Actually, two. Cheese and cheesy romantic comedies. Instead of a drinking game where you take a shot every time someone chases the love of their life in the rain, or two friends realize they’re falling for each other, take a bite of cheese. Whether you’re watching movies solo on your couch, ordering in a few pizzas with best friends, or enjoying a night in away from chaotic restaurants this V-Day, this is the game plan for you. Here are 10 cheesy rom-coms to stream online and the cheeses to devour while watching.1. 13 Going On 30 (Netflix)When we turned 13, we should have wished for cheese. To represent Jennifer Garner’s character Jenna at ages 13 and 30, pair a young gouda with an aged gouda here. You might not even be able to tell they are the same thing—young goudas are springy and melty, whereas their elder counterparts are nutty and complex.2. Dirty Dancing (Amazon Prime)If you eat Harbison—one of our favorite creamy, funky, birch-wrapped cheeses—you’ll have the time of your life. Nobody puts this cheese in the corner, because as soon as people try it they are obsessed.3. Bridget Jones’s Diary (Netflix)If you're alllll byyyy yooourseeeeelf on Valentine’s Day, Montgomery’s Cheddar will keep you company. It is the definition of a classic English Cheddar. A Colin Firth of Cheddars, if you will. Charming, a bit quiet, and irresistible.4. She’s All That (Hulu)Epoisses, a custardy French washed-rind cheese, is known for being stinky. At first you may not be so into the smell, but once you try the robust, almost-meaty, impossibly-creamy cheese, you won’t be able to stop thinking about it. The first bite is like when nerdy Laney (Rachael Leigh Cook) walks down the stairs post-makeover and Zach (Freddie Prinze Jr.) realizes what he’s been missing out on.5. How To Lose A Guy In 10 Days (Netflix)We’d sing “You're So Vain” to a blue-veined cheese like Cambozola on Valentine’s Day. It’s kind of like Matthew McConaughey—a crowd-pleasing guy with a little bit of something you can’t quite put your finger on. Alright? This is the type of cheese you could fall in love with in fewer than 10 days, easy.6. Sweet Home Alabama (Hulu)Green Hill from Sweet Grass Dairy is a great example of excellent cheesemaking in the American South. If they made this Camembert-esque double cream cheese in the fictional Alabama town that NYC fashion designer Melanie (Reese Witherspoon) grew up in, even she’d be impressed.7. Me Before You (Amazon Prime)You’ll probably cry a lot when watching this movie adaptation of Jojo Moyes’ heartbreaking book about a quirky caretaker (Game of Thrones’ Emilia Clarke) who falls in love with her snarky patient (Sam Claflin). So eat your feelings with La Tur, a decadent, almost molten cheese that takes care of you and makes any bad day go away. It’s like a personal pan pizza—but a single-serving wheel of cheese instead.8. Ella Enchanted (Netflix)Let Purple Haze chevre cast a spell on you. It’s an elegant goat cheese thanks to lavender and fennel pollen, and if you were under a spell like Ella Enchanted (Anne Hathaway in this fairytale adaptation), you wouldn’t mind being commanded to eat lots and lots of it.9. 50 First Dates (Hulu)If we had to eat one cheese over and over again because we “forgot” about it like Lucy (Drew Barrymore) forgets about Henry (Adam Sandler), it’d be garlic and herbs Boursin. No, we could never forget about it! Ever.10. Definitely, Maybe (Netflix)This 1992-set movie feels very nostalgic. We could imagine Will (Ryan Reynolds) dipping into some fondue with any one of his exes that he tells stories about to his daughter (Abigail Breslin). He’d probably be into this cheese fondue with beer rather than the classic Swiss version, though. Since this movie is thrice as cheesy as the rest—three romantic stories in one!—it makes sense to give it meltiest cheese. By the end of the movie, your heart will Definitely, Maybe have melted, too.No, you‘re a cheese ball:Explore Bon AppétitMoviesPop CultureValentines DayCheeseRead MorecultureHow to Pair Cheese with Cheese Crackers for Double the CheeseBy Tia KeenantechniquesHow to Pair Cheese with Potato Chips, Please Take This SeriouslyBy Tia KeenanPhotography by Noah FeckscultureHow to Serve a Killer Cheese Plate with Only ONE CheeseBy Alyse WhitneyValentine’s Day RecipesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Alyse Whitney", "Carey Polis"]}