{"id": "a3e32eba2a88cdea96cd2ad1fd775cba", "url": "https://www.bonappetit.com/story/knife-sets-scam", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "A Knife Set is Not the Answer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Don’t Need a Knife SetInstead of 14 rando knives, buy 3 good ones.By Sarah Jampel and Alex DelanyNovember 9, 2020FacebookTwitterEmailIllustration by Tim LahanFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.We originally published this article by Alex Delany in 2017. Sarah Jampel has updated it to include information and research from our 2020 print feature.When you buy a knife set, you’re paying for knives you don’t need and probably won’t use. (As a vegetarian, do you really need six mediocre steak knives?) Most home cooks will be just fine with two knives. “If you're just getting started,” says Jon Broida of Japanese Knife Imports in L.A., “get a big knife and a small knife. Just get that! You don’t need more than that. You can do everything you need to do with one big knife and one small knife.” And we'd throw in a third knife—the serrated knife—for cutting bread. Choosing your knives individually, rather than buying them in a bundle, lets you get exactly what’s right for you. When you commit to a set, on the other hand, you’re committing to one brand for every single knife you own. You might absolutely love the chef’s knife that one company makes but not feel as passionately about their paring knife. That brings us to the most important piece of advice: When possible, you should hold a knife before you buy it and make sure you’re comfortable with the way it feels in your hand. You wouldn’t buy pants without trying them on, right? Even if you got an extra pair for half the price, you’d be walking around looking pretty foolish.Go to a store where the salesperson will take out a knife out, talk to you about it, and let you feel the weight of it in your hand before you take it home. Even better if they're willing to walk you through several knives! If IRL shopping isn't an answer, order from a site with a generous return policy and big selection, like KnifeCenter or Cutlery and More.On top of all that, when you buy your knives individually, you have more options for storing them. Those clunky wooden knife blocks take up a very solid chunk of real estate on your counter. Save some precious counter space and go with a magnetic strip or individual sheaths instead. A tighter, more thoughtful knife lineup saves space and money, but it's also about learning to use the knives you do have to their full potential. You’re not going to become an onion-chopping expert by practicing the process with six different knives. You’re going to get there by using one.One day, your knife skills could be like Jacques'. Explore Bon AppétitBasicallyToolsKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-07-25", "author": ["Condé Nast", "Sarah Jampel", "Alex Delany"]}