{"id": "a3fe211e904c4ed8b7ba62bffe36ad0e", "url": "https://www.bonappetit.com/story/friends-kids", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "So Your Friends Had a Kid. Here's How to Hang Out With Them Even If They Eat Dinner at 5 p.m. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSo Your Friends Had a Kid. Here's How to Hang Out With Them Even If They Eat Dinner at 5 p.m.All your too-embarrassed-to-ask questions, answered by two parents in their 30s.By Meryl Rothstein and Julia KramerJune 12, 2019FacebookTwitterEmailIllustrations by Marylou FaureFacebookTwitterEmailThis story is part of the Healthyish Guide to Your 30s, our best advice for how to cook, shop, date, and generally survive your best (or maybe worst?) decade yet.Your 30s bring with them many things: punishing hangovers, a realization that you should look into this 401(k) thing, and, in all likelihood, friends with kids. How do you navigate this new world of nap regimens and 5 p.m. dinners? We asked child-free staffers to pose their most honest questions to BA’s resident experts Julia Kramer and Meryl Rothstein, both of whom are parents in their 30s.How do I tell you that I don’t want to hold your child?A simple, “She’s adorable, but holding babies makes me nervous,” should suffice.What's preferable, especially with parents with a new kid: suggesting a night out, offering to come to you, or inviting you to come over?Everyone is different: Some people are desperate for a night out, some people want to host so they don’t have to deal with getting a kid (or themselves) out the door. Some people want to meet up right after work so they can be home at a reasonable hour, others prefer late plans so they can go out after bedtime. There’s pretty much nothing nicer you can do for your parent friend than ask, “What’s best for you?” The only constant is convenience: Travel time is expensive if we’ve hired a sitter, or, if we’re bringing the kid, an easy way to burn through the little time we have before their next nap (they nap a lot!) or meltdown. Choosing a location close to us is a huge help.Should I discipline your child or wait for you to take action?If he’s about to eat a Tide Pod/fall down the stairs/bite someone else’s kid, please intervene. If he’s being mildly annoying but no one’s getting hurt (grabbing a chip with the hand he just sneezed in, for example), it’s better to judge us in silence.I’m having a dinner party, and, given the way these things go, the actual dinner probably won’t be served until 9 p.m. Should I invite you, knowing that you’ll probably have to decline because you have an infant, or should I just not even mention it’s happening?When in doubt, extend the invite. On the list of fears that new parents face, “Will my friends forget about me?” is not far behind “Was that a quarter she just put in her mouth?”Follow up: You’re not going to bring your child to my dinner party…right?For most parents of young kids, it’s assumed that an event with a start time after 8 p.m. is kid-free, and you don’t need to say anything. For anything else, be polite but explicit—e.g. “And though I love your kids, this dinner is for adults only. I hope you can make it.” If your friend is from out of town—maybe it’s your wedding, not a dinner party—it’s super nice if you’re able to recommend a few trusted babysitters (ask friends or coworkers!) at the same time.Actually, your kid is pretty cute and I would like him to attend my raucous dinner party. Is there anything I’m expected to have at the ready? Should I go out and buy juice boxes?Definitely not. Parents are generally in the habit of traveling with everything they need and then some, so you can assume we’ll show up with all the necessary food/sippy cups/toys/Paw Patrol episodes.Can I make up absurd lies when your kid asks me questions about the universe that I don’t know the answer to?Absolutely.When is bedtime?!?!Extremely early. Like, the sun is probably still out. You might even still be at work. 7 p.m. is a fairly typical bedtime for babies and toddlers.Okay but if I’m running late on my way over to your house, can you keep the baby up so I can hold her?Yeah, no. If this were possible, we’d keep the baby up until 10 p.m., and she’d sleep until 10 a.m., and we’d spend the morning lazily doing a crossword puzzle and drinking coffee, and that would be almost like not having kids which...actually...come to think of it….I want to bring you a meal since you just had a baby and are probably living on Seamless. What are some good dishes to bring?Anything that can be prepared ahead of time and either served room temp or easily reheated, such as:A bag of fancy pasta, quart of BA’s Best Bolognese, a simple green salad, and a bottle of red wineA big batch of chicken-noodle soupA dinner salad, like this Steakhouse Salad with Red Chile Dressing or Spring Chicken Salad (bring the steak or chicken already cooked)Pan of assembled (but not baked) vegetarian enchiladas or Butternut Squash ParmChicken and Cucumber Rice BowlsQuiche! (A meal could be brunch, and then you’d get to actually see the baby!)Sausage and Ricotta Baked Cannelloni and an Italian saladAnd anything I should avoid?Not setting off the smoke alarm would be good, so don’t sear off a ribeye. Also, while new parents will likely appreciate your company, they’ll also likely be very tired, so once the dishes are cleared, scuttle out.What should I do if I accidentally swear in front of your child?!Not worry about it.Explore Bon AppétitHealthyishGuide to Your 30sRead MoreLifestyleTwo Writers on the Joys of Being Single, But Also Sometimes Dating, in Your 30sBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-12", "author": ["Condé Nast", "Meryl Rothstein", "Julia Kramer"]}