{"id": "a400926b82b4e0acd5f39a9ffc3db9d4", "url": "https://www.bonappetit.com/recipe/sous-vide-pork-belly-sweet-and-spicy", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sous Vide Pork Belly Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSous Vide Sweet and Spicy Pork BellyBy Brad LeoneJanuary 24, 20183.6(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Anna BillingskogEmailPinterestPrintEmailPinterestPrintThis sous vide technique will also work if you keep the pork belly in one large piece. Enjoy over rice, or serve in a bowl of ramen. Read more about what sous vide cooking is, and see how to cook anything sous vide with step-by-step photos here.Ingredients4 servings2pounds skinless, boneless pork belly6scallions, cut into 1-inch pieces¼cup honey¼cup soy sauce3tablespoons sambal oelek1tablespoon grapeseed or other neutral oilSpecial EquipmentA sous vide machine; a 1-gallon vacuum-sealable or resealable plastic bagPreparationStep 1Clip (or stand) sous vide machine to a tall, large pot. Fill pot with warm water to height according to manufacturer’s instructions (keep in mind that pork when added will cause water to rise).Photo by Alex LauStep 2Cut pork belly crosswise into 2\"-wide strips (imagine really thick bacon). Place pork belly, scallions, honey, soy sauce, and sambal oelek in bag and turn to coat.Photo by Alex Lau, Food Styling by Anna BillingskogStep 3Vacuum seal or partially close resealable bag, getting as much air out as possible to keep bag from floating, and place in water bath. If using a resealable plastic bag, push down into water to submerge (this will push more air out of the bag) and fully close. To ensure proper cooking, contents of the bag need to be completely submerged in water. Turn on machine and heat water to 165°.Step 4Using a small clip, secure top edge of resealable bag to rim of pot, positioning it opposite the machine’s water outlet; as the water circulates, it will help keep the bag submerged. If using a vacuum-sealed bag, you may need to set a small plate on top to prevent floating. Cook pork belly, maintaining water bath at 165°, at least 8 hours and up to 16 (letting it cook overnight is ideal, but you can start it in the morning for dinner later). Remove bag from water bath and let pork belly rest in bag 15 minutes (this lets the pork absorb some of the juices).Step 5Remove pork belly from bag and pat dry with paper towels. (You can also save the liquid left in bag and use it as a dipping sauce or for making stir-fry.) Heat a large cast-iron skillet over medium-high until very hot. Add oil and cook pork belly on all sides until browned and crisp (it happens fast, so don’t walk away), 1–2 minutes total. The honey will help the meat brown quickly. Transfer to a platter and serve.Step 6Do Ahead: Pork can be cooked in water bath 4 days ahead. Keep sealed in bag and chill, or freeze up to 1 month. Reheat with sous vide machine at 100° until warmed through, about 1 hour, before searing.How would you rate Sous Vide Sweet and Spicy Pork Belly ?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleImprovised a tad with the marinade; subbed out sambal for an equal amount of sriracha and a mix of half tamari and half fish sauce instead of soy. Cooked for a full sixteen hours and then seared over a ripping-hot cast-iron. Served over white rice, sliced scallions and strained, reserved cooking liquid. The sous vide pork belly was delicious and tender, but I've gotta agree with the Anon comment below: the marinade didn't do much lifting here. Next time, I'll just salt the pork belly and make a sauce using most of the same ingredients, reduced until thick and glossy, on the side. broazayBushwick6/25/2020Made this as the recipe and then served as appetizers (1x1x2” chunks on toothpicks).  Cooked the juices down into a sauce with molasses, brown sugar and vinager.  Was a huge hit even without the dipping sauce.  Don’t take advice from people who don’t even try the recipe.stephensmart236501Houston12/17/2018@Anon Salt or smoke? Suggested googling \"how does a marinade work\" also suggested, \"what is soy sauce made of\"AnonymousLos Angeles, CA2/25/2018Nothing penetrates the protein but salt (and smoke). \nThe herbs, spices, and sauces added to the bag offer surface flavor at best. They might flavor the purge, but fresh herbs remain raw at sous vide temp. \nThe sauce should be built after the protein is cooked. \nSous vide isn't magic, it's a cooking technique that is usually combined with conventional cooking methods. \nThe public needs to be informed by people who know what they're talking about.\nNothing in the bag but salt.AnonymousUSA2/10/2018Explore Bon AppétitPork BellyPorkMeatMainDairy-FreeNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Brad Leone"]}