{"id": "a404c4a657f0539f91b4ac689ba757d9", "url": "https://www.bonappetit.com/story/rhubarb-questions-answered", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Your Most Pressing Rhubarb Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Most Pressing Rhubarb Questions, AnsweredHow to buy, store, and cook with spring’s pinkest produce.By Sarah JampelMay 9, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailOur favorite rites of spring include baring our legs for the first time in months; making the first no-cook dinner of the year (and eating it outside); stuffing ourselves with peas and asparagus; and, of course, buying all of the rhubarb we can carry as soon as we see the pink stalks sprawled out in the market stalls. Tart, sour, and bright, rhubarb is a harbinger of what’s to come—an entry point into the loads and loads of fruit desserts we’ll be baking from now ‘til fall. But as much as we love a strawberry-rhubarb situation, this fruit (or hold up: is it a vegetable?) is good for so much more than pie. Read on to find how to buy, use, and appreciate this leggy, pink…fruit vegetable produce.First things first: Is rhubarb really a vegetable?It’s often treated like a fruit in desserts, but rhubarb is technically a member of the buckwheat family. It was declared a fruit by the U.S. Customs Court in Buffalo, NY, in 1947 to reflect how Americans were using it.How do I know which stalks to buy?Pick thin, firm stalks—these are likely to be sweeter and less stringy than thicker ones. (Redder stalks aren’t always sweeter, but they make for prettier presentations.)Try this super fluffy Rhubarb Custard Cake.\nPhoto by Alex LauHow should I store them?Keep unwashed rhubarb in an unsealed plastic bag in the crisper for up to a week. If you have a large haul, wash stalks, slice, and then freeze for future pies and crumbles.Can I eat the whole thing?When prepping rhubarb, get rid of the leaves; they contain oxalic acid, which is poisonous to humans in large quantities.Put your rhubarb pickles on a salad.\nAlex LauWhat should I do with it?Try pickling! Slice 2 rhubarb stalks on a diagonal and pack into a heatproof 1-pint jar. Bring 1 cup red wine vinegar, ½ cup sugar, 1 ½ tsp. kosher salt, and ¾ cup water to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour into jar; cover and chill at least 1 hour and up to 1 week. Add to salads, grain bowls, or cheese plates.Rhubarb compote would be gooood on top of yogurt\nPhoto by Alex Lau, Food Styling by Susie TheodorouIs there any other way to preserve it?Yes! For a rosy-hued syrup to add to cocktails or mix with club soda, bring ½ cup sugar and ½ cup water to a boil in a small saucepan, stirring to dissolve sugar. Add 1 ½ cups grated rhubarb, reduce heat, and simmer until fruit starts to fall apart and mixture thickens, about 5 minutes. Let cool 30 minutes. Strain into an airtight container; cover and chill up to 1 week.Or turn it into compote. Cook 1 ½ lb. rhubarb, chopped, 1 ½ cups sugar, and 2 Tbsp. fresh lemon juice in a large heavy saucepan over medium heat, stirring to dissolve sugar. Reduce heat to medium-low, cover, and simmer, stirring occasionally, until rhubarb is tender, 6–8 minutes. Transfer to a container and chill at least 2 hours and up to 3 days.Okay, but what if I want to eat it straight away?Strawberry-rhubarb pie is a classic for a reason, but that doesn’t mean you can’t change it up. Try adding vanilla bean seeds, the zest of half an orange, or a pinch of ground cardamom.Explore Bon AppétitRhubarbRead MorecookingThis Rhubarb-Almond Cake Is the Only Reason I'm Turning on My Oven This SummerBy Emma WartzmancookingA Rhubarb Custard Cake Somewhere Between Pudding and HeavenBy Emily SchultzcookingA Strawberry-Rhubarb Pie Recipe, with Special Guest Star: VodkaBy Alex BeggsRhubarb-Fennel Gin CocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-08", "author": ["Condé Nast", "Sarah Jampel"]}