{"id": "a40706fe18c918ce3c465fb095d6e15e", "url": "https://www.bonappetit.com/recipe/warm-spiced-saucy-lamb-stew", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Lamb Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueWarm-Spiced Saucy Lamb StewBy Claire SaffitzSeptember 18, 20183.7(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Megan HedgpethEmailPinterestPrintEmailPinterestPrintHarissa and lamb are a fantastic marriage, but keep in mind that the level of heat in the harissa varies widely brand to brand—adjust how much you add depending on your preference. If your stew skews hot, just top it with a dollop of minty yogurt for instant relief. You can also make the stew 12 hours ahead to really let all the flavors meld, but this step is totally optional. Serve the stew as the centerpiece surrounded by fixings that guests can pick and choose to build their own bowls.Ingredients8 servings Toasted Cauliflower Crumbs½medium head of cauliflower3Tbsp. extra-virgin olive oilKosher salt, freshly ground pepperLemony Mint Yogurt1cup plain whole-milk Greek yogurt3Tbsp. finely chopped mint1Tbsp. fresh lemon juiceKosher salt, freshly ground pepperStew and Assembly5lb. lamb shanks (about 6), patted dryKosher salt, freshly ground pepper¼cup extra-virgin olive oil2large red onions, peeled, cut into 1\" wedges2heads of garlic, top third removed13\" stick cinnamon or ½ tsp. ground cinnamon1½tsp. coriander seeds, crushed3Tbsp. harissa pasteTorn pitted Castelvetrano olives, mint leaves, and/or finely chopped preserved lemon (for serving; optional)PreparationToasted Cauliflower CrumbsStep 1Coarsely chop cauliflower and pulse in a food processor until about the size of grains of rice (or, you can very finely chop with a knife instead). You should have about 2 cups.Step 2Heat oil in a large skillet, preferably cast iron, over medium-high. Cook cauliflower, stirring often, until golden brown all over and charred in spots, 6–8 minutes. Remove from heat; season with salt and pepper. Let cool in skillet.Lemony Mint YogurtStep 3Mix yogurt, mint, and lemon juice in a medium bowl; season with salt and pepper.Step 4Do Ahead: Yogurt can be made 1 day ahead. Cover and chill.Stew and AssemblyStep 5Season lamb shanks very generously all over with salt and pepper. Heat oil in a large Dutch oven or other heavy pot over medium-high. Working in 2 batches, cook lamb shanks in a single layer, turning occasionally, until browned all over, 8–12 minutes per batch. As the shanks finish cooking, transfer to a large plate.Step 6Reduce heat to medium; add onions and garlic, cut side down, to the same pot and cook, tossing onions occasionally, until onions are browned in spots and garlic is golden brown, about 5 minutes. Add cinnamon and crushed coriander and cook, stirring constantly, until spices are very fragrant, about 1 minute. Add harissa paste and cook, stirring often and scraping bottom of pot, until vegetables are coated and paste is slightly darkened in color, about 2 minutes. Add 7 cups water, stirring to release any bits stuck on bottom of pot. Season generously with salt and pepper and bring to a simmer. Return lamb shanks to pot and bring stew back up to a simmer. Cover with a lid, leaving slightly askew so steam can escape, and cook, adjusting heat to maintain a very gentle simmer and skimming foam from surface as needed, until meat is tender and easily pulls away from bones, 1½–2 hours.Step 7Transfer lamb shanks to a cutting board and let cool 10–15 minutes; keep liquid at a simmer. Pull meat from bones and tear into bite-size pieces. Add bones back to pot as you go. Transfer meat to a medium bowl and cover with plastic wrap.Step 8Simmer bones in broth, uncovered, until liquid is thick and very flavorful, 25–30 minutes. Remove from heat; add meat back to pot and let cool uncovered (bones and all) until no longer steaming. Cover pot and chill stew at least 12 hours (you can skip this step, but it will dramatically improve the flavor).Step 9Uncover stew and spoon off half to three-quarters of fat on the surface; discard. Gently reheat stew until barely simmering. Pluck out and discard bones and garlic heads (don't worry about any cloves that may have escaped into stew). Taste and season with more salt and pepper if needed. Ladle into bowls and serve with Toasted Cauliflower Crumbs, Mint Yogurt, harissa, and olives, mint leaves, and/or preserved lemon as desired.Step 10Do Ahead: Stew can be made 3 days ahead. Keep chilled.How would you rate Warm-Spiced Saucy Lamb Stew?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI really liked it, but I like a rich stew. Next time I would use a little more harissa. I made it for myself and my husband and for the first night we didn't even skim the fat off. I will when I portion the rest out for leftovers though.AnonymousVancouver, Canada1/17/2020There were many flavors to love here, but the shanks were just so fatty that I was disappointed. I found myself spending more time avoiding fatty looking pieces of meat than enjoying tender lamb in the stew. As others have mentioned, the lack of direction on the garlic is also frustrating. You need to figure out how to improvise. I just chopped up the smashed garlic the boring way because I wasn't sure what to do about the skins. It looked pretty though... AshleyBrookeWashington, DC11/9/2018Really wanted to like to like this stew, but it came out way too gelatinous and fatty (and that was after waiting 12 hours, and scrapping about 1.5 cups of solid fat off the top). It might better if you used only 1 lamb shank, and the remainder of the meat was cubed leg of lamb or something with less fat and marrow. It would have also been nice to have some vegetables in the soup. It was a one note stew: fatty meat. Wouldn’t bother with this one without some major alterations to the recipe. Concerning the comment about when to pull out the garlic, I cooked it the whole time, and then squeezed the cloves out and whisked them in. AnonymousDallas, Texas10/14/2018When do you take the garlic (and it’s skins) out?AnonymousPhiladelhia9/30/2018Explore Bon AppétitStewSoups and StewsAfricanNorth AfricanHarissaCondiments, Sauces & PastesCinnamonHerbs & SpicesCauliflowerVegetableLamb ShankLambMeatWinterMainKetoSimmerBraiseRamadanDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Claire Saffitz"]}