{"id": "a40e13418b3a202e078b963e4870f6a7", "url": "https://www.bonappetit.com/story/how-to-clean-instant-pot-sealing-ring", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "How to Clean Your Smelly Instant Pot Sealing Ring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Clean Your Smelly Instant Pot Sealing RingThat rubber ring absorbs a lot of smells—here's how to clean it.By Alex BeggsJanuary 10, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWere you one of the MANY people who received an Instant Pot over the holidays? If so, welcome to the cult. One of the first things I made in mine was pulled chicken tacos, riffed from a few blog recipes and the instructional manual. The Instant Pot is awesome for shreddy chicken in around 30 minutes. But the next time I pulled the pot out off my bookshelf-full-of-kitchen-stuff-and-not-books, a waft of cumin hit me in the nostrils. Oof. The Instant Pot’s rubber sealing ring (inside of the lid, essential for keeping steam and whatnot from escaping) takes on smell like a school-issued soccer jersey—not a breathable fabric.It’s dishwasher safe, and most of the time that gets the scent out. But I don’t have a dishwasher, and maybe you don’t either, which is why you’re here. Some people buy two rings to keep the savory separate from the sweet (Instant Pot cheesecake is a thing!)—you can get three rings for $10 on Amazon and stop reading this. Yet two rings felt extraneous to me, person with an entire shelf of spillover kitchen appliances, pots, and specialty gelatin molds, so I’d rather just clean it. Here’s how.Courtesy of Instant PotAs a lot of cleaning in the kitchen goes, white vinegar is the answer. Soak the ring in white vinegar diluted with water, as long as you can stand it. I do this in my sink with a few glugs of vinegar and then water to cover, but you could do it in a sheet pan as pictured above (if you need that sink for other dishwashing activities) or a plastic tub, whatever. After an hour or whenever you remember it was soaking, wash with dish soap and leave it out to dry—in the sun is ideal.Another popular option from the Instant Pot Facebook community is steaming the entire Instant Pot—the Kitchn wrote up the method here. You fill the pot with white vin, water, and lemon rind, run a steam cycle for a few minutes, and boom. But when I’m done cooking, I’m done. So this process didn’t appeal to me, or my hoarder’s instinct to save my lemons.That’s all for the stinkiest situation. If you use your pot nearly every day, like Urvashi Pitre, author of Indian Instant Pot, the soak might be overkill: “I run [the sealing ring] through the dishwasher, then I store the pot lid upside down so it airs out, and if all else fails, I put it out in the sun.”My mistake was putting the ring back into the lid and storing it enclosed, trapping the chicken taco smell when it really only needed some of fresh apartment air.“The main thing,” Pitre added, “is that just because the ring smells doesn’t mean it transfers the smell to the food, so people need to not worry quite as much as they do.”Dinner in an Instant author and New York Times writer Melissa Clark, who also puts hers through the dishwasher, agreed: “I have two, but you know what? It doesn’t matter. I’ve cooked chocolate pudding with a garlicky, stinky one. [The ring is] clean. It’s been through the dishwasher, but if you sniff it, you can still smell garlic. I have never found that it transfers to the custard.”TL; DR: Leave the ring to air out after you use and wash it. Everything will be fine if it’s slightly smelly the next time you use it. If you’re really concerned, soak it in white vinegar and water.Related: The Instant Pot’s Master Plan to Invade All of Our KitchensHow to make your own vinegar cleaner:Explore Bon AppétitInstant PotCleaningRead MorecultureThe Instant Pot’s Master Plan to Invade All of Our KitchensBy Alex BeggscultureAre You Cleaning Your Kitchen Sink Often Enough?By Alyse WhitneycultureThe Appliance Brad Cannot Live WithoutBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-10", "author": ["Condé Nast", "Alex Beggs"]}