{"id": "a41052fc5e8f5f932f747ec74af43a76", "url": "https://www.bonappetit.com/recipe/chicken-with-honey-glazed-carrots-and-ginger", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Slow-Roasted Chicken with Honey-Glazed Carrots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSlow-Roasted Chicken with Honey-Glazed CarrotsBy Chris MoroccoFebruary 13, 20184.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad BaileyEmailPinterestPrintEmailPinterestPrintFor this roasted chicken recipe, keep an eye on the vegetables as they glaze at the end—the honey can burn if given the chance. Cooking the chicken in a lidded pot over low heat lets the bird gently steam, resulting in meat that’s juicier than if you roasted it uncovered. When you’re ready to eat, crank up the oven to crisp up the skin.Ingredients4–6 servings13½–4-lb. chickenKosher salt1head of garlic, halved crosswise, plus 4 cloves, thinly sliced1½lb. carrots, scrubbed, cut in half8small shallots, peeled12\" piece ginger, unpeeled, thinly sliced2Tbsp. unsalted butter1Tbsp. honey2Tbsp. extra-virgin olive oil1tsp. crushed red pepper flakes¼cup fresh lime juicePreparationStep 1Preheat oven to 250°. Season chicken generously with salt inside and out. Place head of garlic inside cavity; tie legs together if desired. Let sit at least 5 minutes or chill, uncovered, up to 2 days.Step 2Combine carrots, shallots, ginger, butter, and honey in a large Dutch oven or other heavy pot; season lightly with salt. Place chicken on top, nestling into vegetables so lid will sit tight. Cover; bake until an instant-read thermometer inserted into the thickest part of breast registers 155°, about 2 hours. Uncover and let rest 30 minutes.Marcus NilssonStep 3Meanwhile, cook oil and sliced garlic in a small saucepan over medium until garlic is lightly browned, 6–8 minutes. Add red pepper flakes and let cool. Stir in lime juice; season dressing with salt.Step 4Increase oven temperature to 450°. Place chicken on a rimmed baking sheet and roast until skin is browned and crisp, 10–14 minutes.Step 5Meanwhile, place pot over medium-high heat; bring juices to a simmer. Cook, reducing heat as needed, until vegetables are glazed, 10–12 minutes. Keep warm over low heat until chicken is done.Step 6Serve chicken on top of vegetables with dressing drizzled over.How would you rate Slow-Roasted Chicken with Honey-Glazed Carrots?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleVery yummy and easy. Gratifying to make!AnonymousPhiladelphia5/4/2020Deee-licious!  The juciest, most flavorful, easiest way to prepare a perfect chicken.  We all loved it!  My husband said that he thought it was the very best way to prepare a chicken - and being in our 60's we have eaten a lot of chickens.   Definitely doing this again!  In fact, this recipe made me decide to renew my subscription.  BTW- I added the dressing to the glazed vegetables and just cooked it down.  So good!Sunny Florida!4/20/2018The flavour of everything was great but I had to remove a lot of cooking liquid from the pot to get the vegetables to glaze. AnonymousGA3/3/2018The chicken and vegetables were fine but the sauce is really tasty, and just drizzling the sauce over the top of the chicken and vegetables seems like a waste.  Next time I would pass the sauce separately so that it can be spooned directly over the sliced chicken.  In fact, the sauce is so easy and fast that I would make it to jazz up rotisserie chicken when time is short.  Also, I added the crushed red pepper with the garlic and oil, instead of adding it after the garlic was browned.AnonymousDunedin, Florida2/21/2018Explore Bon AppétitChickenPoultryCarrotVegetableMainGluten-FreeNut-FreeHealthyishRoastEasterRosh HashanahPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Chris Morocco"]}