{"id": "a412c61707cae50ffdadc3c4adc84cc2", "url": "https://www.bonappetit.com/story/hottest-streetwear-is-from-restaurants", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "The Hottest New Streetwear Brand Is Actually a Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Hottest New Streetwear Brand Is Actually a RestaurantHow food-related merch became a status symbol.By Emilia PetrarcaFebruary 6, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIt’s a balmy day in early October, and the crowd of 20-somethings dressed in their best logo-clad T-shirts and sweatshirts is taking up space on Noho’s Lafayette Street. A new limited-edition Nike collaboration had been announced on Instagram the day before, and these hypebeasts are lined up to get a piece of it.“I AM THIRSTING AT THESE SNACKS,” commented one enthusiastic follower on the post.“Dying!! NEED immediately!!!”“How I do get a pair? I don’t live in NYC.”The item they’re there to claim? A pair of Air Force 1 sneakers done up in the signature pink-and-green color scheme and cursive logo of…a matcha tea shop.Since Cha Cha Matcha opened its first location in New York three years ago, the Japanese-inspired tea shop has attracted a loyal customer base of models, influencers, and fashion designers with its $5 lattes and millennial-pink cups. It was one of those frequent customers, designer Virgil Abloh of streetwear brand Off-White, who orchestrated the Nike collaboration last fall. The move was so successful that the shop followed up with limited-edition T-shirts and hoodies designed by Abloh himself, timed to the launch of its Los Angeles shop in December.“I’ve never wanted merch this bad in my life tbh,” wrote a follower on the exclusive drop.It’s been cool to wear restaurant merchandise since the Hard Rock Cafe’s heyday, but this marriage of streetwear and food is new. In the last year alone, KFC launched a collaboration with Nigo, the legendary Japanese streetwear designer; Mission Chinese tapped a Yeezy designer (Lauren Devine) for its casual skate-inspired merch; Los Angeles’ Sqirl, famed for its thick-cut ricotta toast, teamed up with small skate brand Brain Dead on a jar of jam. Dover Street Market sold the fruit spread next to a T-shirt with a bagel for a logo from Palace, a British skate brand.As fashion weeks unfold around the globe this month, luxury fashion houses will be showcasing their big bets on the next trends from London to Paris. But for a certain crowd Stateside, white lace-up Vans made in collaboration with Los Angeles hot spot Jon and Vinny’s carry more cache than any chunky Balenciaga sneaker.So, how did we get here?From the Kith x Sadelle’s capsule collection.\nPhoto by Chelsie Craig“We have a lot of people from the fashion industry that come to the restaurant, and that we are friendly with,” says Sant Ambroeus creative director Alireza Niroomand. Not only has he had a hand in turning the restaurant into the go-to spot for fashion-related meetings in New York, but Niroomand was also one of the first to see collaborations with trending brands like Superga, Oliver Peoples, and Italian windbreaker company K-Way as a natural “organic” fit.“I never sit at my desk and think, Oh, we should collaborate with these people,” Niroomand says. “It’s never forced.” Neighbors and regulars of the Lafayette Street location come to eat, they get to chatting, and boom, skateboarder Mark Gonzales has his own Sant Ambroeus x Supreme deck. Morgan Collett, cofounder of vibey skate-surf brand Saturday’s NYC, swings by for an espresso, and bada bing! a $125 limited-edition pink crewneck sweatshirt is born.For the restaurant, this isn’t about diversifying its revenue stream. “It’s definitely not a monetary thing,” Niroomand says. Rather, the association with the right and relevant fashion labels “elevates the restaurant’s brand in the world that we live in right now, especially with the downtown crowd. It gives it a ‘cool factor.’”And it’s not just upscale restaurants that are tapping into the moment. The tactic has worked just as well for larger mass-market food brands like White Castle (Telfar Clemens) and Coca-Cola (Bathing Ape). Buzzy salad chain Sweetgreen, meanwhile, has been using merch designed by labels like Cult Gaia and Deerdana to make its fast-casual veg-forward meals more fashionable. It started with T-shirts and tote bags featuring punny phrases like “Beets don’t kale my vibe”—a reference to a more explicit lyric from rapper Kendrick Lamar. Then last October, Sweetgreen dropped “Burrata 2020” merch, which was a spoof of Balenciaga’s own Bernie Sanders’ campaign spoof.“We’re a company that celebrates healthy food,” said Sweetgreen cofounder Nicolas Jammet.\n“We use these fun fashion and music references to engage people even more and create that connection. It’s changing the cultural paradigm of what food is cool, and what people want to associate themselves with.”And increasingly, what people want to associate themselves with is restaurants.Pizzaslime’s Erewhon “drip.”\nPhoto by Chelsie Craig“If you’re aware of this great spot and you’re repping it, people give a silent nod,” said Matthew Hwang, cofounder of Pizzaslime, a creative agency that aims to make instant “micromerch” in response to trending pop culture topics. “You’re part of a smaller, niche group that knows about this food or place.”Pizzaslime started as a music blog and eventually made a name for itself with celebrity-related products, like the “Drake Tears” mug that went viral in 2014. Now many of its best sellers revolve around food. In November, Pizzaslime collaborated with Jon and Vinny’s on a plate of fusilli T-shirt. Just this week, the creative agency made merch for an L.A. pop-up event with New York’s much-hyped slice joint Prince Street Pizza. One of its most popular items so far, though, was an unofficial sweatsuit promoting L.A.’s favorite fancy health food store, Erewhon.In April, Kanye West tweeted the photo of someone wearing sweats (purportedly a Yeezy prototype) with the caption, “Grocery story drip Erewhon drip laundry day drip airport drip.” The timing was sweet: Pizzaslime had just dropped their own swag the month before: black and gray Champion sweatsuits with the store’s name written in big orange letters.The sweats sold out almost instantly, with orders shipping all the way to Paris. “Do these people even know what Erewhon is?” wondered Nicholas Santiago, the agency’s other half, of his international customers. “Or is the hype that big?”Perhaps no one understands hype better than Ronnie Fieg, founder of the popular streetwear brand Kith, who’s created limited-edition shirts and hoodies in collaboration with Major Food Group’s swanky Red Sauce restaurant Carbone and upscale Jewish deli Sadelle’s—two Manhattan spots he frequents. But he’s just as likely to tap into his own 1990s nostalgia, as he did with the California Milk Processor Board, when he put his spin on the Got Milk? milk mustaches campaign.But in a climate where labels have to justify their brick-and-mortar existence in an increasingly digital world, he’s also figured out how to use food as a valuable, and often exclusive, IRL experience to get people in the door. Kith Treats, the brand’s in-house cereal/ice cream/milkshake bar, serves 20-something different flavors and toppings curated by everyone from LeBron James to, again, Virgil Abloh.Sure, the sugary treats are all made up of ingredients you can get at the grocery store for half the price—a bowl of The Don, a mix of Cap’n Crunch and coconut flakes curated by streetwear designer Don C, runs you $6.50. And yet all the cool kids wearing Off-White on their backs are willing to shell out in order to spoon their snack out of a disposable Kith-branded bowl.As Fieg well knows: “It’s all about what you’re willing to wait in line for, right?”Emilia Petrarca is a fashion news writer at New York Magazine’s The Cut, and the proud owner of a Ferrara Bakery “Holy Cannoli” T-shirt.Explore Bon AppétitRestaurantsFashionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-06", "author": ["Condé Nast", "Emilia Petrarca"]}