{"id": "a4165c10f8c4f2f5befcc4b3299e12d5", "url": "https://www.bonappetit.com/recipe/healthyish-lentil-burgers", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Lentil Burgers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLentil BurgersBy Chris MoroccoJune 24, 20194.2(91)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintEveryone questioned why the world needed another veggie burger recipe until they saw how easy and Monday-nightable this one is. You can even make the patties four days ahead to cut down on your day-of prep time.IngredientsMakes 61cup dried green or brown lentils½cup whole-milk Greek yogurt¼tsp. finely grated lemon zest1Tbsp. fresh lemon juice2garlic cloves, finely grated, dividedKosher salt6oz. crimini mushrooms, stems trimmed2Tbsp. white miso¼tsp. smoked paprika4Tbsp. (or more) extra-virgin olive oil, divided¼cup (or more) oat, gluten-free 1:1 blend, or all-purpose flourWhole wheat buns, sprouts and/or lettuce, and sliced pickles (for serving)PreparationStep 1Pour water into a large saucepan to cover lentils by 4\". Bring to a boil, reduce heat to medium, and simmer, stirring occasionally, until lentils are tender but not mushy, about 10 minutes from the time the water reaches a boil. Drain very well in a fine-mesh sieve, then let cool at least 10 minutes (spread them out on a baking sheet, which will help them cool faster).Step 2Meanwhile, combine yogurt, lemon zest, lemon juice, and half of garlic in a small bowl. Season with salt; set aside.Step 3Finely chop mushrooms and transfer to a medium bowl. Add miso, paprika, 2 Tbsp. oil, and remaining garlic clove. Add lentils (you should have 2 cups cooked) and stir and mash them with the back of a spoon or a potato masher until lentils are partly mashed but with lots of whole lentils still remaining. Vigorously stir in flour until mixture holds together when squeezed; if it doesn’t, continue to mash until it does and add 1–2 Tbsp. flour if needed. Form into 6 patties about ¾\" thick.Step 4Working in 2 batches, heat 1 Tbsp. oil in a large nonstick skillet (nonstick is essential since these will definitely stick to a regular skillet) over medium. Cook patties until deeply browned and very crisp on bottom side, about 3 minutes. Carefully turn and repeat on second side, adding more oil as needed to maintain a light coating around patties in skillet.Step 5Spread reserved yogurt mixture on buns. Top with burgers, sprouts, and pickles.Step 6Do Ahead: Patties can be made 4 days ahead. Tightly wrap in plastic and chill.How would you rate Lentil Burgers?Leave a ReviewTell us what you thinkReviews (56)Back to TopTriangleHave made these twice now, did use an egg based upon other reviews, used button / baby bellas because that's what I had.  went heavy on Red Miso.  first night these are good.  put the mixture in the fridge for a few days and try again them again. Oh my, soooo delicious.  fry them almost to the point of burning them.   Not a vegetarian but these are super and I think I like them better than regular burgers.  Give them a  try!Jane ANOVA, VA5/19/2021Flavor is good but the texture just isn't there. They were falling apart quite a bit and although the crispy edges were quite good the interiors were pasty. I'm not sure how to fix the texture to be firmer but I'd at least recommend adding an egg or two to the mixture to help the structure. Might just crumble what I have left, fry the pieces up, then use as a topping on eggs/salad. LaurenVirginia4/6/2021Aye these with avocado and pickled red onions! Yum!! Sara SimmsNC3/1/2021Cooked them in the oven at 450 for 15 minutes! I carefully flipped them halfway through but I’m not sure it’s absolutely necessary. I used a good hand of Worcestershire sauce instead of miso paste and added a dash of curry, basil, thyme, ginger, nutmeg... just a dash! Used half water half chicken stock to cook the lentils and added a bag leave and some garlic ends. Instead of the grated garlic used in the sauce and burgers, I used 4 cloves of roasted garlic I had leftover in the fridge. Love using a recipe as a guideline and making it your own. Not a vegetarian or vegan but now I’m thinking about making these way more often Sara SimmsAsheville, NC 3/1/2021My big complaint about this recipe is that the burgers fell apart when I flipped them, even though the mixture had been holding together just fine when I formed the patties. However, everyone at dinner agreed that it is a delicious way to eat lentils – we especially loved the crispy edges, and the mushrooms smelled amazing as the burgers cooked. I'll probably make this again, but add an egg as a binder and increase the amount of flour. I'm considering chilling or even freezing the patties before cooking them, on the chance that they would hold together better.MeganDallas, TX1/27/2021Sorry guys, I love your recipes, and this is a tasty way to eat lentils, but it delivers none of the textural or structural requirements of a burger. Anonymous10/24/2020Wonderfully simple recipe. I have made it at least a dozen times.\n\nBut for the love of God, would BA please translate the measurements in their recipes to grams? It is an enormous headache having to do it manually for every recipe.AnonymousUK10/17/2020These were pretty good. I liked the texture, but as other reviewers said, these could have used some more flavor. I would have added more salt, and maybe some herbs or something else. Also, I baked them instead of frying at 450 for about 15 minutes and that worked just fine!AnonymousChicago9/7/2020I did what a few others suggested and used the food processor to get a nice fine chop, and did the same with the lentils, keeping about a good handful (3/4cups) whole. I used red Miso paste since that's what I had. Everything else including method I kept true to the recipe. These are SOOOOOO good! Patties are a little softer than I'm used to so don't squeeze the bun too hard, but they cook up beautifully. I love the crust, 3-4 minutes a side is a must.  Doesn't need any greens or tomatoes, but I found a thin slice of white onion and a little heat necessary for my taste (chili garlic paste added to the yogurt sauce). A Brioche bun is a definite must for this burger.  Day 1 I had it fries with it, and topped the burger with onion, lettuce, and tomato, but found it too much.  Day 2 I had just the burger with onion and chili garlic paste, no side.  Perfect meal. Might try adding mustard on Day 3.TheMOUSEOttawa7/14/2020This was a really good recipe.  I put the mushrooms into my food processor to chop them up and then I added approximately 2/3 of the cooked lentils to the food processor as well.  Then I stirred in the last1/3.  This made the prep really easy.  I did not have miso, so I substituted 1T of soy sauce and 1T of fish sauce.   I think I would add a little more salt and smoked paprika next time. Anonymous7/9/2020This recipe is perfection! It's going to be a weeknight staple in my house.AnonymousToronto, Canada6/23/2020I am making these tonight, but I'm wondering if they freeze well.  \nTrissy6/18/2020Really tasty combo with the miso lentil mushroom combo. My husband did the mashing of the lentils 💪so I thought the recipe was easy ;) overall, I think there was such good complimenting flavors of the umami of miso and mushroom with the garlicky yogurt sauce. Top it with some pickles and greens—- mmmmm. Side of sweet potato fries! AnonymousEverett 6/16/2020these are in the rotationn now.  Although I messed up and added the yogurt / lemon juice sauce right into the bean mix, They were a hit.  In order to dry them up without adding too much flour I added ground walnuts. They took probably a little longer to cook, but they came out yummy and in tact. i will make them again, correctly for comparison, but i think I will keep the walnut pieces. AnonymousBritish Columbia6/16/2020These were pretty good...worth a try but I wasn't blown away. The patties were a pain to make and I had to go back in with a potato masher multiple times (and add a few Tbsps more oat flour) before they started to stick together. If you're not vegan, I'd just add an egg to help it along. I think the burgers could have used a lot more flavor and couldn't believe there was no direction to add salt/pepper to the mixture. I'd recommend giving it a taste and seasoning it before you cook the patties - I added probably a half teaspoon of salt and lots of pepper, and it could have used even more along with some spice and herbs. I also found the yogurt spread to be way too garlicky, so use a small clove or just skip and make it more of a lemon-forward spread.soapnanaChicago, IL6/15/2020Explore Bon AppétitBurgerSandwichVeggie BurgerAmericanMushroomVegetableMisoCondiments, Sauces & PastesPaprikaHerbs & SpicesLemonCitrusFruitGreen LentilLentilBrown LentilQuickEasyWeeknight MealsMainVegetarianHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Chris Morocco"]}