{"id": "a4216a590c4a323fb68a62583c9b6cde", "url": "https://www.bonappetit.com/recipe/sesame-salt", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Sesame Salt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueSesame SaltBy Molly BazMarch 19, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintGomasio is the nutty, toasty Japanese wonder condiment we’re sprinkling on everything: salads, of course, but also roasted vegetables, seared fish, and even buttered toast. Make it with white or black sesame seeds—or do a confetti-like mix.IngredientsMakes about ¾ cup¾cup white and/or black sesame seeds1tsp. flaky sea saltPreparationStep 1Toast sesame seeds in a dry medium skillet over medium-low heat, tossing often, until evenly deep golden brown, about 5 minutes. Transfer to a food processor and let cool.Step 2Add sea salt to sesame seeds and pulse until about half of the seeds are pulverized (there should still be some whole seeds), 6–8 pulses. (Alternatively, coarsely grind in a mortar and pestle.)Step 3Do Ahead: Sesame salt can be made 1 week ahead. Store airtight at room temperature.How would you rate Sesame Salt?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI first came across this \"recipe\" in the 80s.  It was in a Moosewood cookbook.  It's especially wonderful on roasted cauliflower that has been tossed in olive oil.  I keep it on hand for salads and rice bowls.SherryLeighKalamazoo MI10/2/2021Explore Bon AppétitCondimentJapaneseEast AsianAsianQuickEasyDairy-FreeGluten-FreeVegetarianVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}