{"id": "a424bf82a26c19a2e036ad323adcdcf0", "url": "https://www.bonappetit.com/recipe/breakfast-calzones", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Breakfast Calzones Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueBreakfast CalzonesBy Ignacio MattosApril 17, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you can’t find nduja, a funky and spicy spreadable Italian salami, substitute torn or chopped hot soppressata or a salami with some kick. Make breakfast an occasion by serving these calzones alongside a savory peach and shaved fennel salad, marinated beans with ricotta salata, and torta pasqualina.Ingredients8 servings21-lb. 6-oz. balls of pizza dough, room temperatureAll-purpose flour (for surface)6oz. Fontina cheese, grated (about 2 cups)1cup whole-milk fresh ricotta4oz. nduja8large egg yolks1Tbsp. finely chopped rosemaryExtra-virgin olive oilKosher saltPreparationStep 1Prepare a grill for medium-low heat. Set cast-iron griddle on grill. (Alternatively, heat on stovetop over medium-low. And if you don’t have a cast-iron griddle, use a cast-iron skillet instead and cook in batches.) Cut each piece of dough into quarters for 8 pieces total. Roll out 1 piece of dough to an 8x6\" oval. Spoon a heaping ¼ cup Fontina over half of dough and form a well in the center. Dab 2 Tbsp. ricotta and 1 Tbsp. nduja over Fontina, leaving well empty; slip a yolk into the well. Sprinkle with a bit of rosemary and drizzle with oil; season with salt. Moisten edges of dough with water, fold empty side of dough over filling and press together edges to seal. Brush with oil; sprinkle with salt. Repeat with remaining ingredients to make 7 more calzones.Step 2Place calzones, oiled side down, on griddle and cook until deeply browned, pressing gently with a spatula to create contact with griddle, about 5 minutes. Brush oil on the other sides and sprinkle with salt; turn calzones over. Cook until other sides are deeply browned, about 5 minutes. Transfer to a cutting board and let sit 1 minute before cutting in half.How would you rate Breakfast Calzones?Leave a ReviewTell us what you thinkExplore Bon AppétitItalianEuropeanSalamiCured MeatMeatRicottaCheeseFontinaNut-FreeFryBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}