{"id": "a42827b3c7f93250961b2eb3445f5513", "url": "https://www.bonappetit.com/story/nasim-alikhani", "year": 2021.0, "month": 9.0, "day": 3.0, "content": "Sofreh Brooklyn: Nasim Alikhani's 30-Year Voyage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNasim Alikhani’s 30-Year VoyageBefore she opened Sofreh, she collected culinary knowledge for decades.By Dawn DavisSeptember 16, 2021FacebookTwitterEmailNasim_PortrtPhoto by Ellen SilvermanFacebookTwitterEmailWhen Nasim Alikhani learned she had been chosen as one of the 10 chefs to contribute to this year’s Met Gala menu, she didn’t comprehend for about five minutes. She remembers thinking, Met? As in the Met Gala? Then she took a call with Marcus Samuelsson, who had selected the chefs. “He asked if I knew about the Gala. Of course I knew about the Met Gala—I’ve been in New York since 1985.”Alikhani is the brains and heart behind Sofreh, a Persian restaurant in Brooklyn that draws diners from all over the world. She opened the restaurant in 2018 when she was 59. She is the oldest chef to contribute to the 2021 Met Gala menu, which featured her dish of tahini-stuffed dates during cocktail hour.It’s not just the Met Gala; Alikhani has received acclaim from myriad best-of lists. But she didn’t set out for this kind of recognition—it’s simply the by-product of a 30-year culinary voyage culminating in the opening of Sofreh. I spoke with Alikhani about her untraditional path toward becoming a restaurateur, her take on eating meat, and her advice for young chefs who are just starting out on their own long journeys.When you found out you were one of the Met Gala chefs, what was your reaction?It was just a total shock. This whole thing with Sofreh, it was not about recognition or even money. I just had this deep desire to exercise what I knew and what I believe and provide the best representation of my culture, my identity, my roots. For me to be acknowledged and to be given that space came out of nowhere. I’m so honored.You’re here for the work. And then this comes just from following your path.I just see myself as a very capable cook who has a passion about exercising her craft, and then suddenly, Met Gala. Wow.Tell me a little about your food journey.I have been a very discerning person since birth. Everything that would go into my mouth had to be the best. And that continued when I had the opportunity to travel the world, eating everywhere, including in Michelin-starred restaurants.After years of that, I kept thinking, Why is our food not being offered to the public in interesting, clever, and unique ways? I consider Persian food to be one of the most complex, diverse, and delicious cuisines that I have tasted. So why wasn’t it being offered? My whole mission is to introduce this exquisite food in an accessible and interesting way to the public.Your training includes culinary school, but you also learned cooking at the sides of your aunties and the foremothers before you, right?I went to culinary school, so I understand this whole training stuff, and I don’t want to disregard it. But I’ve had 50 years of cooking in various kitchens with limited tools or no tools at all. I’ve been cooking since I was 11, 12, next to my mother. I’ve cooked in the mountains with some charcoal and some light. I cooked in my apartment for a party of 400 people. I’ve cooked in professional kitchens.I also bring a heritage; generations and generations of knowledge. When I cook something alongside a young chef who is culinarily trained, they might use a fancy term to describe what I’m doing. And I’m thinking, Who cares? You want to name it, name it, but where do you think all these techniques came from to begin with? They came from our great-great-great-grandmothers in Africa, in India, in Iran. And then somebody named and classified it. I get it, but I like to open a parenthesis: There is tremendous room for people like me all over the world; all these women who cooked and kept their cultures and kept their traditions alive, like my great-grandmother with her famous marmalade and her bread.The Met Gala served a fully plant-based menu this year for the first time. What’s your approach to cooking without meat?In my own home, I only serve meat once a week, because I believe we should not eat more than that. Historically, that’s how we eat meat in Iran. It’s a flavor enhancer, except with kabobs. But all the stews, all these complex dishes that are so delicious, are 90% vegetables. So I wanted to be able to even design a whole menu that is fully vegan, but also culturally sound without using any items that are not native to it, such as coconut. Such as tofu.How did you narrow down the choices you’d present to Marcus Samuelsson for the Met Gala?I was going to send them 20 dishes, and then I realized I’m limited to three items. [At first, I sent Marcus these dishes.] One is a dip made with olives, pomegranate paste, pomegranate seeds, herbs, and garlic. It’s almost like an olive tapenade.It sounds delicious. Oh, my goodness.It’s garlicky and has sweet-and-sour molasses with tons of local herbs. I was going to use a mix of mint and tarragon.The other item was a little tiny potato pancake that we used to serve at Sofreh. I top it with a sour cherry marmalade, enhanced with vanilla and lime zest. I don’t even know if this was the requirement, but not only did I give them the recipe, I also cooked it for them and took pictures. And I said, “That’s how I would serve it.”I’m hungry just hearing about it.And the final item was a simple leafy salad with a red leaf or a Boston head, depending on whatever quality lettuce is available, topped with radishes and glazed dates and tahini dressing with chile. At Sofreh, I serve that tahini dressing with yogurt. I simply omitted the yogurt, and I increased the sourness and topped it with toasted sesame seeds. [Editor’s note: The dishes selected were not among these.]You’ve said that opening your first restaurant was a 30-year journey. If you could, would you go back and pursue a career as a restaurateur at the start of it?Probably not. Because the reason I am who I am is because of the life I have managed to have. I became a business owner. I finished my degrees. I traveled the world. I raised my kids and I lost kids. I went through so much in life. If I had opened a restaurant [at the start of my career] with the commitment I have to Sofreh right now, I wouldn’t have been able to have a life aside from Sofreh. And I’m glad I experienced this life. And I’m glad I treasured this dream in my heart. It was like a little seed that every year grew a little bit more roots to ground me to do exactly what I’m doing, exactly at this point. So who is to say? I don’t know.As someone who has studied at law school, owned a printing firm, and catered, all before opening your own restaurant at age 59, what’s your advice for young culinary professionals?Take different jobs, venture out, travel, and eat other people’s food as much as you can. For example, I [don’t eat much] meat personally, but you don’t know how many places I traveled to because somebody told me they made a special pork or beef dish. And I went not for my own pleasure but for the knowledge of it, for the understanding of it. And, again, foremost, hold different jobs. Experience working at a desk job for a little bit, even if you’re young. Dedicate yourself to do a little outside of your craft because every job, no matter what it is, teaches you something.And in any opportunity, eat and be adventurous. Eat like you’re testing and sampling. I just traveled and was constantly nibbling and munching, making notes in my little booklet. Some things are just totally awe-inspiring, and some things make you go, “Fine.” But 10 years later, 20 years later, this all becomes your culinary knowledge.This conversation has been lightly edited for clarity.Explore Bon AppétitCulturePerson of InterestInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-16", "author": ["Condé Nast", "Dawn Davis"]}