{"id": "a42e89f60e4a923a525e2f8c1cd083f7", "url": "https://www.bonappetit.com/recipe/raspberry-rugelach", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Raspberry Rugelach Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueRaspberry RugelachBy Chris MoroccoNovember 20, 20183.7(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese bright, sweet-tart beauties are the perfect addition to the typical cookie plate. Adding orange zest and salt to store-bought jam gives the filling an extra dimension of flavor without creating a lot of extra fuss. Plus, rather than shape each rugelach individually, we form a log, then cut it into wedges. Not only is this method easier to execute, but it also reveals more of the jammy, nutty insides.IngredientsMakes 18–222½cups all-purpose flour, plus more for dusting¼tsp. baking powder½cup granulated sugar, divided2tsp. kosher salt, divided1cup chilled unsalted butter, cut into pieces8oz. cream cheese, room temperatureZest of 1 orange1½cups finely chopped walnuts1cup raspberry or any other flavor jam or marmalade½cup freeze-dried raspberries or strawberries1large egg, beaten to blendSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Mix flour, baking powder, ¼ cup granulated sugar, and 1 tsp. salt in the bowl of a stand mixer fitted with paddle attachment on low speed to combine. Add butter and beat until it is flattened into nickel- and dime-size pieces and dry ingredients look a bit like sand, about 2 minutes. Cut cream cheese into 8–10 pieces and add all at once to mixer. Beat until dough starts to clump together in pieces (but not so long that it forms one large mass) with pieces of butter and some cream cheese still visible, about 1 minute longer.Step 2Turn out dough onto a work surface and divide in half. Pat each into a disk and wrap tightly in plastic. Chill just until firm, 30–45 minutes.Step 3Meanwhile, mix together orange zest, nuts, jam, and remaining 1 tsp. salt in a medium bowl. Set filling aside.Step 4Working one at a time, roll out dough between 2 lightly floured sheets of parchment paper, dusting with more flour and turning over and rotating as needed, into ⅛\"-thick ovals about 18x11\". Spread half of filling over each oval, leaving a ½\" border. Rotate dough so a long side is closest to you and roll up into a tight spiral, using parchment to help you lift it as you go. If dough is sticking, chill 5 minutes before proceeding. Chill rolled-up dough until firm, at least 60 minutes and up to 1 day (wrapped in plastic).Step 5Place racks in upper and lower thirds of oven; preheat to 375°. Finely grind raspberries in spice mill or with mortar and pestle. Transfer to a small bowl; mix in remaining ¼ cup granulated sugar. Brush tops of dough with egg. Sprinkle with half of berry sugar and cut into wedges 2\" wide at the base and ½\" wide at the point. Make each cut on a diagonal, changing direction each time so that short and wide ends alternate. Divide rugelach between 2 parchment-lined baking sheets. Bake, rotating baking sheets top to bottom and front to back halfway through, until deep golden brown, 28–34 minutes. Let cool on baking sheets, sprinkling with remaining berry sugar while still warm.Step 6Do Ahead: Cookies can be baked 5 days ahead. Store airtight at room temperature.How would you rate Raspberry Rugelach?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleThis recipe did not work for me at all! All of my rugelach completely fell over during baking and the raspberry sugar topping burned so they just looked like burned pinwheel cookies. They taste okay, but I also think the zest of an entire orange is a bit overpowering and I would have maybe used half. Would love to know what baking settings were used by those who were able to bake without burning the topping.Jen SChicago, IL12/17/2020I've been wanting to try these since they came out several seasons ago, but had been dissuaded because I was nervous about rolling out the dough. Although my ovals were a bit cracked at the edges, I think it was okay. I agree with some others that there seemed to not be quite enough filling to spread it evenly to the edges, although I may attribute this to my walnuts not being finely chopped enough. If I make these again I might even pulse them in the food processor to chop. I used strawberry rhubarb jam and freeze dried strawberries for the top dusting. Love the orange zest addition-totally essential. I think I got 21-22 cookies out of the two rolls, although I was skeptical when I first began to cut them. It is hard to not fixate on what we make coming out looking like the Bon Appetit photos, but sometimes you have to get beyond that and enjoy the sweet treat. Having said that, my sugar dusting didn't burn, although it did get a little dark, but I think I should have pulled them a couple minutes sooner. I enjoyed that these were not overly sweet. I've never made rugelach before, but I look forward to trying it again. These do seem like they'd travel well, which is certainly a boon for 2020, as many of us will likely be mailing cookies in lieu of in-person get togethers. Natalie MatzOmaha,NE11/29/2020I followed the recipe, but opted to dust the cookies with the raspberry-sugar at the end after reading the other reviews. I liked them, but would not add the salt to the Jam/Zest again as it made the filling too salty and destroyed the brightness of the fruit flavor. (Might not be the same with every jam, but it was the case with mine) WineCountryBaker3/31/2020Impressive looking cookie, Not too difficult to make.\nA few suggestions -- Like one of the other reviewers, my sugar and freeze dried raspberries burned in the oven.  I would just put it on after coming out of the oven.  Also, I found the amount of filling suggested in the recipe was not sufficient -- added another 1/2 cup of jam.AnonymousSan Francisco12/24/2019This turned out beyond fantastic. I was really nervous because I read all the lukewarm reviews and I don't bake often. I couldn't find freezedried fruit so I omitted the sugar coating and just did eggwash and they were a beautiful dark golden colour. For the second batch, I experimented with shredded coconut in the filling and coconut sprinkled on top (I added it about 5 minutes before baking was over to avoid burning) and it looked really nice. Couldn't taste the coconut that much but I was also just trying to use up some leftover coconut lol. I also zested lemon into the filling as well as orange because I wanted it more zippy than sweet. Everyone who ate these were incredibly impressed and I was very pleased. The recipe is a lot of work and doesn't yield that many pieces but for a special occasion  (I made them for my father-in-law's birthday), it's a nice satisfying project.AnonymousToronto, Canada12/17/2019I’m hot and cold on this one. I’ve made it a couple of time, always trying to make them look like the picture. They’re a lot of work but the filling is REALLY good and the raspberry sugar sprinkles are pretty. That being said, I think the example photo is very unrealistic. I don’t know how everyone else in the reviews seemed to bake them so perfectly. They turn into brown flat lumps and often fall over. Also if you put the sugar on while it bakes (even just 3 mins before you take them out of the oven) the sugar and raspberries burn!!! It’s so sad. Finally, the size they suggest (2in on one side and .5in on the other) is ridiculous and even hard to fit in your mouth. The best takeaway might be the simple filling - maybe use it with an easier cookie Anonymous12/10/2019I just saw this recipe and have not made it yet, but it looks interesting. I like the idea. However, I’m the Queen of Rugelach here in Charleston. Although, that’s an easy feat in the South. I had found a great recipe on Epicurious. The best one from all the research I have done and I will use that and incorporate that with this. Ladies. Anyone reading this, please take note! For your dough, It’s 2 cups cream cheese and 2 sticks of unsalted butter and 1/2 tsp. Salt.  Room temperature. Use a paddle and beat it till smooth! That’s it. Pat it into a 7 x7 square. Wrap it in cling film and put in the refrigerator for 24Hours! The dough must rest for at least 24 hours. It can even rest longer! You can also divide it into 4 equal parts. Then you roll out each piece into a 8x12” rectangle! When you roll your first piece out, put on a cookie sheet and put in refrigerator. Put parchment paper on top, and roll out second pc. Of dough and so on.  Then take you first pc.out. Do not and I mean do not mix the jam with the nuts. Spread your jam on the rectangle. You can mix your zest in your jam. Then I would sprinkle your finely chopped nuts over it. Now, if you want, you can add some chopped golden raisins over it. Now I’m wondering if we could take some of that crushed raspberries with sugar and sprinkle over the nuts. Then when done, roll the rectangle like a jelly roll. Then brush with the egg yolk and sprinkle with the raspberry sugar mixture. You should have 4 long rolls on a cookie sheet. Then put in the FREEZER! It should take about 15 minutes for the rolls to get hard enough for you to cut. And just cut 3/4 of the way through. When I make my regular Rugelach, at 350 degrees, it takes about 55 minutes. But all ovens are different. You will be on your own. But you don’t hv to do the triangles. This way comes out much better. lynn rossCharleston, SC12/2/2019These came out so beautifully. I had no problems with the recipe and they looked just like the photo. Such a clever twist on Rugelach with the diagonal cut and bright, punchy raspberry-sugar topping. The pastry is tender and delicious and the orange zest brings out the Christmas. The filling could pack more bold flavor though. It was pretty mild - maybe next time I will use homemade jam or add some freeze dried raspberry into the filling. Also not sure the purpose of dusting the tops before baking just to have it brown so much. Why not just do all after baking? Does it make the post-bake dusting stick better? Regardless, I will definitely be making these again. AnonymousLos Angeles11/4/2019I want to start by saying I didn’t exactly follow the recipe, so here are my modifications. Whenever I try a new recipe I make half of it, in case they don’t turn out. Then I would like to add that you don’t need any fancy equipment for this recipe. I made the dough by hand, like you would make pie dough, and crushed the raspberries with the back of a measuring cup. I made my halves dough into two logs, so a quarter of the original size so I could make one with nuts, and the other without. If you let the zest sit in the jam while the dough is filling, then the jam takes on more orange flavor. I chilled the dough before I rolled it, and after I sliced it. Even though some of them fell over, i found that the ones with nuts still looked fine, no damage done. Overall they taste great, but if you’re going for the visuals I would leave the nuts in. Remember, unless you’re creaming butter to make cookies, or frosting, you can usually get away with not using any fancy appliances.ShiitakeUSA6/14/2019I did not have a problem with this recipe. The final product looked exactly as in the picture. I think the key to success is refrigeration. I refrigerated the dough for 1 hr before rolling it out. It was impossible to roll it into an oval since it kept cracking at the edges. So I continuously cut off pieces and glued them over the breaks using water and re-rolling those spots. I eventually had a rectangle of the appropriate size. Then I referigerated the rolled dough for another hour. Then it was firm enough to spread the filling without damaging it. After filling and rolling it I refrigerated the rolled-up dough for 2 hours. The end result was very good. I gave it four stars because I think this recipe can be improved. Next time I will add some cinnamon and perhaps chopped raisins.Michael SilversteinMontreal2/15/2019I didn't have a problem with the nuts, finely chopping then is the key.  I have to make mine GF, I forgot to add xanthan gum, so the form was not there, and I didn't have access to freeze dried fruit. so mine were rather bland tasting.  I looked at other traditional recipes and will try one of them to compare. Due to not having unsalted butter I only added 1 tsp of salt and they were just fine, not salty at all.besusanCentral Wisconsin1/22/2019Intriguing recipe that I followed pretty exactly. Too salty and dough was too soft. Cut them smaller than 2\" and they toppled over. Other than the salt, they tasted okay but look very unprofessional. I will use a different recipe next time although I might incorporate the strawberry sugar on top.AnonymousBoynton Beach, FL1/17/2019I made a double batch of these and they turned out really well. Similar to other reviews, I had issues spreading the filling. At first i tried using a fork to spread the nuts and ultimately added additional jam.  I also like the idea of spreading the jam on it's own and sprinkling the nuts. I was ok with working to spread the filling if it meant that they wouldn't be overfilled and oozing. I also refrigerated the cut dough for 5-10 minutes before baking because I was nervous that the filling would ooze out. This seemed effective as I had no seepage. I'm confused by the burning complaint in other reviews. The recipe instructs you to reserve half of the sugar/berry mixture and sprinkle on top right after baking. Right out of the oven mine didn't look like the picture and the sugar/raspberry mixture baked a deep color (though they didn't taste burnt at all). When I added the reserved mixture the cookies looked very similar to the picture (without professional food styling and photoshop, of course). Before I made these I was sure they wouldn't be worth the effort, but I was really pleased with the flakiness and intense raspberry/orange/walnut flavor. Such a festive and delicious treat for the holidays that I will definitely make again.Joey3Boston, MA1/5/2019Made these a few days ago and they came out fabulous! I gave them as Christmas gifts as part of a cookie bag and they were one everyone’s favorites.  I pretty much followed the recipe - not sure i was able to roll the dough out 18” x 11” but was able to spread the filling as written. Love the idea of rolling dough between parchment paper - it made it SO much easier than rolling on my countertop (made the Chocolate Tahini Linzer cookies and the dough stuck to the counter no matter how much i dusted). Refrigerated an extra day (as I ran out of time making a gob of other cookies but it didn’t seem to change anything).  I split the time first baking 10-12 minutes then rotated/switched the pans then baked another 10 minutes and they came out just done with a nice golden brown edge. The berry sugar did get a titch brown so i sprinkled more of the sugar/fruit mix after I pulled them out of the oven so it had the pretty pink color ...and i sprinkled a touch of powdered sugar as well to give it a snow-touched look. Definitely will add to my yearly cookie list and will make again! Love these!zenbladerColorado12/30/2018These turned out pretty well, and tasted wonderful. A few split and opened up, but for the most part, they came out quite well. I had enough filling; it just took some patience to spread it. And, as recommended, I trimmed to dough and moved pieces (used a little water to make them adhere) to form a rectangle (how do you roll a rectangle?). I set the oven just a couple of degrees low, and watched them very closely toward the end of the minimum cooking time. As soon as they were golden, I pulled them out and sprinkled on the extra sugar. They looked pretty much like the photo. Because a few split, I'm giving it 4 stars, but I'm going to make some more for gifts (and eat the ones that break--win-win!). Alexandria VA12/26/2018Explore Bon AppétitCookieDessertJewishRaspberryBerryFruitWalnutNutCream CheeseCheeseBakingRosh HashanahHanukkahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Chris Morocco"]}