{"id": "a46025ba26db7d749e192e452135c694", "url": "https://www.bonappetit.com/recipe/the-perfect-pot-of-rice", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Perfect Pot of Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2012 IssueThe Perfect Pot of RiceBy The Bon Appétit Test KitchenMay 5, 20194.2(168)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintEver wondered how to make the perfect pot of rice without a rice cooker? We got you. This no-fail method works for short-, medium-, and long-grain white rice.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSieve$18 At AmazonMedium Saucepan$39 At AmazonWooden Spoon$6 At AmazonForkIngredientsMakes about 3 cups1cup short-, medium-, or long-grain white rice (NOT parboiled, converted, or quick-cooking)½tsp. kosher saltPreparationStep 1Rinse 1 cup long-grain white rice in a fine-mesh sieve until the water runs clear (this may take up to a minute). Alternatively, you can rinse the rice in a bowl or pot with several changes of cold water, draining carefully between rinses, but we think the fine-mesh sieve method is the least annoying. Rinsing rice before you cook it is key—it washes away the starchy powder that would otherwise make the grains of rice clump up and stick together. Combine rice, ½ tsp. kosher salt, and 1¼ cups water in a medium saucepan.Step 2Give everything a gentle stir. Bring to a boil, then cover pot with a tight-fitting lid and reduce heat to low, aiming for the lowest possible flame. Cook rice, undisturbed—that means NOT opening the lid!—for 18 minutes.Step 3Remove pan from heat. Let stand at least 15 minutes or until ready to use. Uncover and fluff cooked rice with a fork before serving.How would you rate The Perfect Pot of Rice?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleI found this rice recipe a week ago. This is no doubt the absolute best way to cook rice. I doubled the recipe to make fried rice and couldn't believe how fluffy and not sticky the rice turned out. I'm actually making another batch right now to make Dirty Rice. Thank you so much!!!DaveFalls Church, VA12/23/2021We have searched for years for the perfect way to prepare rice. This method never fails! I can add whatever flavorings I want and it’s always the perfect pot of rice. The rice cooker always burned our rice, this is better than any other way I have cooked rice. Thank youCassUtah9/25/2021Perfect rice!   We are at our cabin without our rice cooker.   I was worried because we are at a slight elevation ~4000FT and our pot cover has a tiny hole, so not quite tight fitting.  Anyway, I eliminated rice but carefully followed the cooking instructions and the rice is perfect.  As tempting as it is to lift the cover, do NOT do so until after cooking and resting time are complete.      NanciBay Area, CA7/30/2021I don’t have a problem with stovetop rice, but decided to try this anyway. It failed for me the first time out. I used my right back burner, designed for “low simmer,” and the flame was too low. I rescued it with an additional ten minute on regular burner on low. The recipe did work for me the second time, but it turns out we prefer our rice sticky and clumpy. The individual grains didn’t satisfy. As other reviewers have pointed out, this recipe takes longer than necessary. I’ll stick to my old method for plain white rice. No rinsing. 12 minutes on low heat, covered. Have a peak at 10 minutes to check for doneness. Raising the cover does no harm to the finished product. ChrisKnitzOconomowoc 4/19/2021I'm 12 And It Worked Pretty Well But It Is To Slow For MeOwenC3/21/2021There is a quicker way to cook rice.\nFollow the instructions but cook rice for 10 minutes.\nRemove from heat and let sit for 8 - 10 minutes.\nFluff up and serve perfect rice.\nWorks every time. :)Big JoeMontreal,Canada3/2/2021 I decided to make this rice while my son was home. Since it is covid time still, I need some good recipes so my teenager will eat some healthy food.\n I had some rice in the cabinet and thought let me try to make some rice.\nI bought sweet and sour sauce the other day and thought the two would go well together.\n\n  I cannot stop my son from eating the rice now.\n Not sure if it is the jarred sauce...but I highly doubt it. The rice came out perfect!!! I love it too. I might make rice more often now.   Thanks for the recipe. It is simple and easy to make too!BrigitteNC1/26/2021I tried this recipe in Denver (altitude of roughly 5,200 feet) in hopes of getting less sticky rice kernels, but the result was a  very disappointing pot of very toothy undercooked rice with puddles of water still in it. I ended up dumping the result and remaking my rice instead.\n\nI used  regular long-grain rice despite adding a tad more water and extending cooking time to about 25 minutes to adjust for altitude. As instructed, I used the lowest setting (1) on my Samsung induction range, two steps below the setting at which I would normally cook rice, and allowed the pot to sit with a tight lid in place and undisturbed for 15 additional minutes. I suspect that this recipe might probably need either a higher heat setting or significantly longer cook time to work for me given the altitude and induction cooking method.\n\nFor sake of comparison, if I were to cook regular long-grain rice my usual way, I'd typically not pre-rinse the rice and would use just under 2 cups of water to a cup of dry rice at a higher setting on the dial (3, just above a simmer. I cook that covered for about 18-20 minutes followed a 10 minute rest before fluffing and serving.Jim C.Denver, CO1/26/2021I would like to know if this method will work as well for brown basmati rice (higher in fibre and not an empty carb :-). I suspect I might have to alter one or all of liquid, time and temp ??\nAnonymousGuelph, Ontario12/1/2020i think this arroz is amazing as it is so delicious and nice. The texture of the rice is amazing and the taste is amazing.Anonymousguildford11/30/2020Perfect rice recipe every time! Don’t disturb it, no poking, leave that lid on!jenceeOakland,Ca11/24/2020A quick warning - it could be my altitude (6,200') or the range I'm using, but \"aiming for the lowest possible flame\" and cooking for 18 minutes led to woefully inadequately cooked rice for me. (I'm crunching on it with sesame beef as I type this.) It probably needed 25 minutes if not closer to 30, or I should've aimed for something a bit more robust than the \"lowest possible flame.\" Otherwise, I dig the recipe. Empty InnsCarbondale, CO11/18/2020This kinda blew my mind. I don't know where the 2:1 water-to-rice ratio comes from but this is the only recipe on the web that doesn't have it. I feel like they should mention that in the article, because I thought it was a typo at first.\n\nAnyway, I'm at altitude so I added a couple splashes of water like you do up here. Maybe a tablespoon tops. Tiny splash of EVOO. I used a pot with a TIGHT fitting lid, cooked 25 mins at the lowest heat on the stove, and let it sit with the lid on for 15 mins after that.\n\nAnd boom, this was the best rice I have ever cooked. Not even close. The rice doesn't stick together at all, and has a pleasant little bite to it. Just a firmness throughout, not like al dente where it's stuck in your teeth. No mushiness whatsoever. Nothing stuck to the bottom of the pan either which was a pleasant surprise. mimbleysteamboat10/15/2020Looks like a good recipe, but will it still turn out if I skip the salt?  My kidney health is poor and I need to minimize sodium for my health.SpookstazMontreal9/21/2020Worked flawlessly. This is how I'm cooking stovetop rice from now on. Both the best and the easiest rice I've ever made.\n\nRemember to adjust the salt to 1/4 tsp. if you're using regular table salt instead of kosher.AnonymousAtlanta, Georgia USA6/6/2020Explore Bon AppétitRiceRice & GrainsEasySideDairy-FreeGluten-FreeNut-FreeVeganVegetarianBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2012-05-15", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}