{"id": "a47cbfebad5f79ba2af9f59fc6c6c154", "url": "https://www.bonappetit.com/story/a-restaurant-for-a-chipmunk", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "I Miss Restaurants, So I Opened My Own…for a Chipmunk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Miss Restaurants, So I Opened My Own…for a ChipmunkIt all started when my uncle sent a tiny wooden picnic table in the mail.By Angela HansbergerOctober 15, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThe aromatic broth of vegetable scraps, mushrooms, and scallions simmers on the stove. I place a twirl of noodles into a bamboo bowl, ladle in the steaming broth, add chopped shiitakes and bamboo shoots, then tweezer on a few sesame seeds for flavor and garnish. There is a diner already seated at my new ramen-ya, awaiting the artful balance I hope to have achieved. He sniffs, sips, and in one giant slurp, it’s gone—bowl and all. Sometimes this happens with chipmunks. Did I mention my food is tiny and my “restaurant” is on the front steps of my porch?I am a freelance food writer by trade. My work centers around eating and drinking and observing the restaurant culture of Atlanta, where I live, and then writing about it. But these days, like everyone else, I’m at home. ALWAYS at home. There are no more new cafés to review or omakase dinners to critique or chicken wing competitions to judge. I’ve hoarded the beans, planted the garden, and grown the scallions on the windowsill. I’ve written about how industry folks are coping with “the new normal.” But how am I coping? Well.It was mid-April when the giant box appeared on my front porch. The return address was from my Uncle Ed, who owns a bowling center in Ohio and thus has had quite a bit of time on his hands since COVID-19 shut down his business. I unwrapped layers and layers of Bubble Wrap and there it was: a mini wooden picnic table on which red magic marker scrawled out “Angela.” It was intended for hanging on a tree for squirrels, said Ed, but I took a shortcut and sat it out on the porch, putting a few walnuts left over from Christmas on top. By the time I’d walked the box to the recycling bin, a chipmunk had taken a seat at the wee table. In seconds he’d gobbled up all the walnuts.The next morning he came back and dined on walnuts again. He seemed eager.Thelonious, catching up on his reading\nPhoto by Angela HansbergerBy day three I’d made a makeshift tablecloth cut from a bandana. Then I fashioned a vase out of one of those rubber guards for pencils and filled it with a tiny purple vinca bud. “What do chipmunks eat besides nuts?” I wondered as I made a grocery list. A deep google dive gave me answers. Much as expected: seeds, berries, buds, and small worms. And, more surprising: mushrooms, vegetables, and small frogs. (Spoiler: This porch café does not serve small frogs.) I read that chipmunks are crepuscular creatures mainly active at dawn and dusk when fewer predators are a threat. And sure enough, those were the hours in which Thelonious, as I had now named my chipmunk (Thelonious Munk, get it?), came calling.Important to dining, especially now, is tipping. Thelonious, I’ll admit, had always been a poor tipper. Then one evening I watched as he carried over a mysterious wad of leaves and bits of flowers, things not available near my porch, and left them at the table. For me? Did he leave these special things for me? I considered it an excellent tip.Thelonious Munk comes every day now. Sometimes he sits at the table, waiting for me. He is the diner critiquing my meals; I am the chef and the server, waiting for positive reviews. I switch up the menu, making sure not to overfeed, as chipmunks are hoarders and can eat to their detriment. I watch like a new parent introducing foods to a baby, cataloging likes and dislikes. Google be damned, Thelonious doesn’t dig mushrooms, fresh or dried, crimini or enoki (I tried). He loves blueberries and hates peanuts and yellow bell peppers. He pushes cabbage to the side.Missing my own restaurant experiences, I try to give them to Thelonious. One day, reminiscing on my sushi habit (a frequent writing subject), I turned the table into a sushi counter. I made a tray from modeling clay. I took individual grains of rice and tweezered them atop pieces of carrot, peach skins, mango, and seaweed with grated ginger and “wasabi” made from a sassafras leaf. I fashioned itty-bitty chopsticks from stems of the aforementioned scallions. It was definitely wabi sabi—perfectly imperfect.Thelonious, at the sushi counter\nPhoto by Angela HansbergerThelonious devoured pizza from a crust of almond flour topped with smashed raspberry and slivered almond “cheese.” I made a Detroit version too, and placed the pizzas on a stand made from a Champagne cage. He loved the accompanying salad of garden herbs and nut “croutons.” It took a lot of trial and error to create tiny taco shells, but once I did, he seemed to marvel at them before eating them with his paws, just like a person would. The chips and guac disappeared too. I created a pretzel recipe without the salt, so as not to damage little kidneys. Making the teeny twists was especially tedious, but after about 10 attempts and a few more tries baking them at various temperatures, my improvised recipe worked: Munk ate them in his own personal beer garden, and I, too, was soulfully satiated.Later, with the help of my husband, I built a full miniature bar with stools covered in scraps of leather: the Peanut Club. Thelonious sat anxiously on the stoop as we worked, watching and waiting to eventually steal the nut bowl as I positioned mini bottles of booze, a cocktail shaker, and bev naps. Once it was complete, he took his place on a stool for a while before opting to be bartender and moving behind the counter. And after a spell at the bar, he went to his table ready for the next dinner experience. I used to do this too.Over these past months, my Instagram feed has shifted from shots of the newest restaurants and meticulous chef platings to this little guy encountering a new setup and new variations on his favorite flavors each day. Instead of noting the ambiance, the particulars of design, or the nuances of a restaurant’s menu, I dream it up chipmunk-sized. And for once I do the verboten in food journalism—I read the comments. Bringing a little joy to others is the secret sauce that quells my pandemic anxiety. Messages from strangers who found my munk via social media keep me going. A recent human-sized take-out order from a local restaurant included a small container labeled “Thelonious.” Inside were hazelnuts, carrot curls, and wee chanterelles, a gift from the kitchen.The existential dread of a global pandemic is pervasive. I find myself often caught in a state of hopelessness and helplessness, unable to celebrate newborn babies, birthdays, graduations, and marriages. Unable to properly grieve losses or sit with a close friend undergoing chemo. Worried about the chefs and restaurant workers who rely on our collective ability to go out to eat. News is bleak and we are all feeling physically and socially isolated. But every day, there is also Thelonious, a chipmunk who sits down to eat in a world without a doomful election and a deadly virus. This is how I am coping, laying out a picnic, watching tiny hands hold my tiny food. It’s silly, yes, but sometimes silliness is needed.The evening Thelonious dined with a white tablecloth, a battery-lit candle, and petite silver dinnerware was the best restaurant experience I’ve had in months. I sat behind my window—next to my eternally frustrated cat—and marveled as the chipmunk prepared his to-go order, stuffing nut after nut into his impressively expanding cheek pouches. It made me feel hopeful, knowing his face luggage would carry these supplies into his own little subterranean pantry. Knowing that, come winter, they would get him through his own period of isolation.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-15", "author": ["Condé Nast", "Angela Hansberger"]}