{"id": "a47f21801354cc8b1361cbedffa452e6", "url": "https://www.bonappetit.com/story/celebrating-tet-from-afar", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Celebrating Lunar New Year in Isolation Is a Reminder of My Family’s Resilience | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCelebrating Lunar New Year in Isolation Is a Reminder of My Family’s ResilienceFor us, Tết has always been a time of celebration and grief—this year more than ever.By Caitlin PhanFebruary 11, 2021FacebookTwitterEmailIllustration by Nhung LêFacebookTwitterEmailEvery Lunar New Year, my Vietnamese family places an altar by the front door, teeming with candles, oranges, plates of rich pork curry and pillowy sticky rice. The tradition is part of Tết Nguyên Đán (Feast of the First Morning of the First Day), when we invite our ancestors into our homes so they might hear our prayers. My parents are Vietnamese refugees, but I was born and raised in Dallas, Texas. While I grew up practicing our cultural rituals, I never fully grasped the reasons behind them. For as long as I can remember, Tết celebrations included a visit to my grandparents’ Buddhist temple in Grand Prairie, Texas, where monks ceremonially placed photos of my great-grandparents alongside the rest of the community’s ancestors. We admired the vibrant flowers and lanterns strung up in the temple courtyard and the people bustling about wearing traditional áo dài. Then our extended family gathered at our grandparents’ home to pray, exchange red envelopes, break bread, and play a few rounds of low-stakes blackjack.This year, however, will be different. Like with 2020, COVID-19 will cast a shadow over our ordinarily joyful festivities. During this time of isolation, though, I’ve been thinking about how my family’s lives have been shaped by devastations of the past. Tết, our most sacred holiday, has never been a purely happy occasion in Vietnamese cultural memory. It is instead a time of both celebration and mourning, with its own painful history—a chapter we can look to now in this extraordinary new era of loss and grief.On January 30 and 31, 1968, the Viet Cong and North Vietnamese army coordinated attacks against South Vietnam and its allies (including the United States). The siege, known as the Tết Offensive, fell upon the first days of Tết, breaking a holiday ceasefire that had been honored in years past. The military strike claimed the lives of an estimated 30,000 Communist soldiers, wounded at least 12,000 American troops in the first two weeks alone, and lasted for 21 weeks total. What is less documented is the physical and psychic toll the event took on those who survived—including my own family.My maternal grandparents hail from Huế, a central city in Vietnam, five miles west of the South China Sea. When the Tết attacks first commenced, my grandfather (a South Vietnamese military officer) left home for duty in Mang Cá. Armed Communist soldiers interrogated my grandmother, demanding to know the whereabouts of her husband and his relationship to the South Vietnamese government. Markets shut down for weeks. Neighbors escaped the unrelenting gunfire and land mine explosions by sheltering frequently in their basements. My grandmother recalls doing this with her children, too, until a rocket destroyed their property. They relocated to a nearby pagoda. That too collapsed, and in the chaos, a piece of shrapnel fused the knee joint of my grandmother’s leg. After a high-risk surgery, she was able to keep the limb. My grandmother rarely speaks of that time, yet I understand it to be some of the saddest moments she has ever had to endure.We don’t actually have to be together, in the same space, to reach out and remain connected.After the Fall of Saigon in 1975, my grandparents, along with their five children, fled Vietnam to start new lives in the States. Yet the war still reverberates in my family’s lives, and my own, to this day, shaping our politics, habits, and fears. The new year always provided them with a familiar structure through which they could honor the family members they lost or left behind, which became unspeakably valuable in a foreign land. Despite her painful past, my grandmother is troubled by how most Americans associate Tết with bloodshed and war instead of what it once represented: a celebration of renewal, reunion, and hope. We make our pilgrimage home to gather with family, so my grandparents can feel close to loved ones, both living and dead.But Tết has historically been about the transcendence of familial ties, too, beyond the physical or temporal. We don’t actually have to be together, in the same space, to reach out and remain connected. This year, my grandparents, who value family time and closeness with near-religiosity, will prepare their Tết altar alone. My grandfather, who has a notorious sweet tooth, will place M&M’s beside the bowls of rice. We’ll drop off lucky red envelopes in mailboxes. And we won’t be visiting the temple festooned with lanterns and flowers. At my father’s house, we’ll leave out gà bóp—a chicken salad dish from Huế—for my paternal grandpa along with a Corona (he preferred Tiger, but my dad only keeps one type of beer on hand). Then we will all light incense and pray at our separate altars—feeling the weight of the trauma born of this time—and look to what’s next. I come from a loving and nurturing people, and stoicism remains one of our guiding principles. For all that she has endured, my grandmother doesn’t concern herself with the past. Instead, she agonizes endlessly over the future, a trait she has generously passed on to me. We focus on what we have, what remains, what is still possible. And we will ask our dead for help, with the hope they will answer.Explore Bon AppétitHealthyishessayRead MorerestaurantsAt Charleston’s Jackrabbit Filly, Here's How to Eat Your Weight in LuckBy Jenny Liaorecipes9 Recipes for a Vibrant Lunar New Year CelebrationGallery9 SlidesBy Lisa Cheng SmithRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-11", "author": ["Condé Nast", "Caitlin Phan"]}