{"id": "a48041c4a6c0720d7a1d2bf3a9bcb9cd", "url": "https://www.bonappetit.com/story/the-vegas-effect", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "The Vegas Effect | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredThe Vegas EffectGet ready to say \"yes\" to adventure and try something new with these tips for one-of-a-kind eats, drinks and things to see while in town.By Vegas Uncork'dJanuary 17, 2018FacebookTwitterEmailFacebookTwitterEmail1. PRONTO, DELIZIOSO! CAESARS PALACEAs her namesake restaurant GIADA hits its fourth anniversary at The Cromwell, Chef Giada De Laurentiis opens her first fast- casual concept Pronto at Caesars Palace.2. A WORK OF ART: THE COSMOPOLITAN OF LAS VEGASAt The Chandelier, order the Fire-Breathing Dragon— its sweet-and- spicy Thai-inspired flavors blend berry-flavored rum with lemongrass, raspberry, and Thai chili, topped with nitrogen-charged raspberries that create a mind-bending swirling mist.3. CAN’T MISS SHOWSMichael Jackson One: Mandalay BayAbsinthe: Caesars PalaceLe Rêve - The Dream: Wynn Las Vegas4. INDULGE AT MORIMOTO: MGM GRAND LAS VEGASIron Chef Masaharu Morimoto’s modern take on Japanese cuisine delights savvy diners inside the contemporary restaurant space at Morimoto, which features exotic photographs by Yasumichi Morita.5. A SPEAKEASY SECRET: COMMONWEALTHThe Laundry Room is a speakeasy that you’ll be vying to get into. Impress your friends by texting their reservation line with your most inventive access request to see if you’ll be able to sip on cocktails behind the secret door in the back.6. BAZ–A MUSICAL MASH-UP: THE PALAZZO® THEATREIf a mash-up of music, dance, and moments from some of Baz Luhrmann’s greatest films sounds like an awesome experience, BAZ at The Palazzo® Theatre is sure to captivate you.7. STEP INTO HELL’S KITCHEN: CAESARS PALACEChef Gordon Ramsay’s very first immersive and experiential HELL’S KITCHEN restaurant opened at Caesars Palace, transporting you to the set of his hit TV show.8. POUR, SHAKE & STIRIf late night cocktails are your game, the rich leather wrapped wood, imported granite, and polished nickel & brass accents at ALIBI Ultra Lounge at ARIA Resort and Casino might be your match.9. ¡HOLA CHICA!: THE VENETIAN LAS VEGASCelebrity Latina chef Lorena Garcia brings the bold flavors of Venezuela, Peru, Brazil, Mexico, and Argentina, among many more, to the Las Vegas Strip at Chica.10. SIP ON THISShake things up with the classic and signature cocktails at Bound, the elevated and sexy circular bar space at The Cromwell.Visit vegasuncorked.com for more information.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-17", "author": ["Condé Nast", "Vegas Uncork'D"]}