{"id": "a48919e3087cadb2c3d1d9bad230c4f9", "url": "https://www.bonappetit.com/story/graf-lantz-wool-coasters", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "I Use These Wool Coasters on a Daily Basis | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Use These Wool Coasters on a Daily BasisGraf Lantz coasters do their job, last forever, and look good on any coffee table. By Emma WartzmanNovember 5, 2020FacebookTwitterEmailPhoto Courtesy Graf LantzFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.There is a ring-shaped stain on my wooden coffee table that haunts me. Okay, it doesn’t haunt me—but when I’m sitting on the couch and it catches my eye, it certainly annoys me. The stain made its mark in my pre-coaster life. More specifically, it made its mark in my pre-Graf-Lantz-coaster life.Oftentimes, coasters, while cute, do not get the job done. They allow for condensation on their own surface, which in the worst cases can drip down and onto the surface you were originally trying to protect. Even more common, they warp with moisture and discolor over time. Not Graf Lantz coasters.This L.A.-based textile company makes the coasters from merino wool felt. This particular material doesn’t just create a barrier between moisture and your table; it also creates a perfect cycle of absorption and evaporation. (Yes, I am actually talking about the cycle of absorption and evaporation in coasters.) Apparently, felt can absorb up to 30 percent of the moisture from your beverage of choice and still feel dry to the touch because it disappears so quickly into the body of the coaster.Meanwhile, in a natural process called wicking, that moisture turns to vapor as it is continuously pulled outward from minuscule air spaces between the fibers of the felt, eventually evaporating entirely. I promise, I didn’t make this up. The company goes into even more detail on its website if you’re interested, but in the meantime, I’d like to thank you for attending my science class.What I can personally attest to, fancy words and processes aside, is that these coasters work. I’ve used mine on a daily basis for years, and they still look as good as the day I got them. Plus, they come in different shapes and beautiful colors, both bold and neutral, that you can mix and match to make your set into an ombré. I have a gradation of gray squares in my living room, and I recently gifted my mom four jewel-toned circular ones.One day I’ll replace my stained coffee table. But I’ll never replace my coasters.4-Pack of Merino Wool Felt Coasters$24 at Graf LantzExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-05", "author": ["Condé Nast", "Emma Wartzman"]}