{"id": "a48dede0f58f0eae4185ec66e2bea5de", "url": "https://www.bonappetit.com/story/weeknight-spicy-sweet-pork-noodles", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "All Other Meat Sauces Look Sadder Since This Spicy Pork Ragù Came Into My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll Other Meat Sauces Look Sadder Since This Spicy Pork Ragù Came Into My LifeMeet the new rich, tangy weeknight red sauce that combines two of our favorite noodle dishes.By Alex BeggsFebruary 22, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailChris Morocco had a craving: Pad kee mao, the spicy-porky Thai dish also known as drunken noodles, meets meaty, tomato-rich bolognese, he said. We’re listening, we replied. It would be savory and spicy. It’ll cook much faster than bolognese, but longer than pad kee mao. It’d have an umami hit of tomato paste mixed with spicy sambal oelek, soy sauce, garlic, and ginger. It will be a flavor explosion. We were really listening.A few weeks later, a recipe was born: A quick-cooking (30-40 minutes) red sauce we nicknamed Sambalognese. Sambal-bolognese. (You get it.) At the end of the day, it’s not that close to bolognese, nor is it totally faithful to pad kee mao—hence its Official Name as Spicy-Sweet Sambal Pork Noodles—but one thing is for certain: It’s a simple, flavor-packed, not-so-typical red sauce that’s fast, comforting, and totally addictive. During the testing process, everyone in the office passed by to try a bite. Some were more shameless than others, taking a seat right at the Bon Appétit Test Kitchen tasting table and making all kinds of obscene moans and groans as they finished every last noodle. Honestly, I can’t even blame them.Here’s how we got here: First, Chris experimented with some fish and oyster sauces, as are used in pad kee mao, to get at that earthy funky flavor, but ground pork ends up adding that on its own. We wanted to keep the ingredient list low, so we cut them. (Fish sauce lovers—you already know this because you do it all the time—feel free to add it back in.) Instead of a fresh Thai chile, we opted for pantry staple sambal oelek because we always have it on hand; it has heat and an extra hint of funk from vinegar (some brands also have fish sauce or shrimp paste in them), so your bases are covered. There’s also basil for a bright green note. (If you can find Thai or holy basil, those are spicier and have more bite than your usual grocery store basil—obviously that would be good here.) Add the soy and ginger, and you get big, punchy flavor fast, which means no need for the hours it takes to develop a deep Sunday sauce.You can serve it with thick spaghetti, fresh ramen or udon, or what I did: Korean rice cakes. I added the tteok directly into the sauce when it was done, with a cup or so of water to rehydrate them. Those starch bombs soaked up the spicy sauce and I loved the bouncy chewy texture against the broken-down tender bites of browned pork. (I was worried my 2-lb. bag of rice cakes would be too much so didn’t use them all, but there was a LOT of sauce—next time I’ll use the whole bag.) I’m eating it for leftovers for lunch today. Like Chris’s reader favorite soy-ginger scrambled eggs, it’s a recipe that keeps you coming back for more.Get the recipe:Spicy-Sweet Sambal Pork NoodlesFull-on explosive flavor in under an hour.View RecipeExplore Bon AppétitWeeknightSambal OelekNoodleGround PorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-22", "author": ["Condé Nast", "Alex Beggs"]}