{"id": "a49953f066be53b42811a94439d48750", "url": "https://www.bonappetit.com/recipe/curried-peanut-dip", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "Peanut Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCurried Peanut DipBy Molly BazOctober 7, 20194.8(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintThis creamy, spicy-sweet dip will be loose and pourable when warm, but it will thicken once fully chilled. We love to pair it with leftover roast or rotisserie chicken, jammy eggs, cucumber spears, and roasted sweet potatoes for the perfect (desk-friendly) lunch. This dish is part of the Bon Appétit Guide to Actually Enjoying Your Lunch at Work. Find more recipes, tips, and tricks here.IngredientsMakes about 1 pint1Tbsp. vegetable oil¼cup jarred red curry paste114.5-oz. can coconut milk½cup creamy peanut butter3Tbsp. unseasoned rice vinegar1Tbsp. fish sauce1Tbsp. honeyKosher saltPreparationStep 1Heat oil in a medium saucepan over medium. Add curry paste and cook, stirring frequently, until paste begins to stick to bottom of saucepan and is very fragrant, 2–3 minutes.Step 2Whisk in coconut milk and bring to a simmer. Continue to cook, whisking occasionally, until mixture turns darker in color and is slightly reduced, about 3 minutes. Remove saucepan from heat and whisk in peanut butter, vinegar, fish sauce, and honey. Season to taste with salt; it should be well seasoned since the things you are dipping in it may not be (i.e., boiled eggs, cukes, etc.). Let cool to room temperature, then transfer to an airtight portable container and chill.Step 3Do Ahead: Dip can be made 4 days ahead. Keep chilled.How would you rate Curried Peanut Dip?Leave a ReviewTell us what you thinkReviews (32)Back to TopTriangleAbsolutely loved it!  Have had it on noodles, cucumber spears and sweet potatoes (as above), vegetable rice bowl, etc.  \nCan't imagine why the person who was complaining would have thought that a peanut sauce with curry paste and fish sauce would be appropriate for a child's lunch though. Perhaps she/he thought that 'desk friendly' meant school desk?  AnonymousVictoria, BC2/11/2022This recipe is great for satay! Need to try with other things!!  Can't wait!!  Agree that it doesn't say it's for a kids lunch, definately a lunch at work or just because!!AnonymousBoston. MA9/18/2021Love this recipe! It's perfect as a dip and even better as a sauce for just about anything.  I usually make a half recipe and it's the right amount for us. I may try subbing the fish sauce with soy next time just to lessen that pungency but overall, love it\n\nTo the person complaining that this is not a lunch recipe for kids - most gourmet recipes aren't so make what is practical for you & maybe just review the recipe next time lolAnonymousSt. Louis, MO8/29/2021I’m beginning to wonder if anyone who created most of these Lunch recipes, ACTUALLY have children in School! Messy marinara soaked meatballs are awful for younger kids who tend to dribble and drop foods, stains abound! Tuna Salad becomes pungent in a lunchbox, there’s nothing worse than opening your box and being the kid with the “stinky fishy” sandwich, even if they like tuna at home they don’t want some classmates getting grossed out. LASTLY... MANY SCHOOLS ARE NUT FREE ZONES due to potential allergies of other kids, which could mean your child’s lunch is hitting the trash and they get stuck with a lunch tray they won’t eat. AnonymousEastern, KY3/19/2021This was OUT OF FRICKIN CONTROL! Delicious. Made exactly as listed - I used Maesri red curry paste. We recreated the plate and were not disappointed! Came together really quick and was a great thing for a \"fancy\" weekend lunch, threw everything on a cutting board so we could snack and watch a movie - fantastic. Cucumbers, some thin sliced marinated tofu, roasted sweet potato, 8 minute eggs, some cold rotisserie chicken - damn! Very good and also so much protein. Can't wait to put leftover sauce on every bite of food I eat until it's gone, it's delicious.  kmarxmarxchicago, il2/20/2021This dish brings excitement and fun to the table. The dip is complexly flavourful-but still peanut forward and pairs well with so many foods. sheakToronto, ON8/13/2020I've made this recipe a few times, and here are my takeaways:\n- yield: this recipe yields about 3 cups, so scale down if you want less!\n- spice: maybe it's just the brand of curry paste I use, but 1/4 cup is WAY too much. I'd scale it to 1 or tbsp. Otherwise it tastes like a very spicy curry sauce with a hint of peanut. For reference, I use Mae Ploy brand.\n- As other users have noted, you can sub the fish sauce for Tamari, soy or aminos as needed.\n- If you have certain niche ingredients on hand, use them! I like to add a little liquid palm sugar, tamarind concentrate, and citrus zest (Makrut/Thai lime is the best, along with the leaves, but other are good too).\n- I double or 1.5x the peanut butter. It needs more peanut flavor, imo.\n\nI love to scale this recipe down by around 8x for a yield around 3-4oz, which is a generous single serving. For a light lunch,AnonymousBay Area, CA7/9/2020Really tasty! I used coconut cream instead of coconut milk and it worked very well. Very easy to make - highly recommend!Rachel_0London7/6/2020Surprisingly bummed by this one! I recreated the exact plate in the picture and I was so excited. This tasted just like whipped, flavored peanut butter... it was very sweet and not the curry/spicy/umami mix I hoped for. I will admit I'm not a regular peanut butter eater, but it just wasn't that great. AnonymousSan Diego6/17/2020This slaps! It goes so hard! I didn't have rice vinegar or fish sauce, so I used apple cider vinegar and coconut aminos instead. Dubious substitutions, I know, but it still turned out so well. Even without the exact ingredients, it was still delicious  :) Added a bit of cumin, gochujang, and cayenne too. AnonymousChicago 5/15/2020I've been eating this over ramen (water mostly drained) every other day for the past week and it is truly incredible!!!AnonymousLong Island, NY5/6/2020Really enjoyed this dip! It took a bit longer than expected for mine to reduce but it eventually got there and was delicious with crackers, sweet potatoes, and bell peppers. Love the sweet/salty/spicy flavors - will definitely make again. abbygauenChicago4/16/2020Just to the person who said there was no curry powder in this recipe.  I wonder if you noticed there was curry paste in the recipe?Anonymous3/26/2020Hey, Mr. Anonymous \"health nut\" from Virginia, why don't ya look at the nutrition facts on the ingredients label and just kinda go from there? Alright? Ok buddy? Alright.KeeperofTheCommentSectionCyberspace3/17/2020Is it At all possible to add Nutrition facts to these recipes, I'm a serious health nut and me and my family kinda consider BA the authority on cooking, so we would appreciate it if we knew how we were nourishing ourselves.AnonymousVirginia3/13/2020Explore Bon AppétitDipCruditéThaiSoutheast AsianAsianPeanut ButterCondiments, Sauces & PastesCoconut MilkOther IngredientsQuickEasyWeeknight MealsSnackStarterDairy-FreeHealthyishNew Year'sLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-07", "author": ["Condé Nast", "Molly Baz"]}