{"id": "a49e738963e8405aa6ffc03ceddb0ae9", "url": "https://www.bonappetit.com/story/how-to-make-thanksgiving-salad", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "How to Make a Thanksgiving Salad That Everyone Will Actually Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make a Thanksgiving Salad That Everyone Will Actually EatYes, they’re raw. Yes, they’re room temp. And yes, they’ll be the first thing to disappear from the table.By Sarah JampelNovember 15, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailWhat if we told you that this year, the salad’s going to be the talk of the Thanksgiving table? That guests are going to ask you what’s in that dressing rather than what’s in the dry rub? That your relatives will strategically position themselves for proximity to the salad bowl rather than the carving board?It’s a hard sell, salad on Thanksgiving. What, with mashed potatoes and roasted potatoes and sweet potatoes (and then there’s turkey and, hopefully, a spread of desserts), it can be hard to justify making room for raw fiber. And the very sensible arguments that might convince you to eat salad on any other day—it balances your plate; it slows down your eating (lots of crunching and munching) so that you can pace yourself; it’s a good source of vitamins and minerals, yadda yadda—don’t hold much weight on the Year’s Biggest Eating Holiday. You can eat salad tomorrow!But before you write salad off for yet another starchy side, ask yourself: Wouldn’t you welcome a break from the monotony of rich, creamy, meaty food if it came in the form of delicious salad that felt just as festive, special, and—hate to use this word but...—indulgent as the rest of the menu? (And, don’t you think there’s some truth to the notion that eating salad now actually opens up more room for sweets later?)Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiSenior food editor Chris Morocco dreamt up three new Thanksgiving salad recipes that don’t feel like ho-hum vegetable placeholders. “Putting coleslaw on the table would fulfill the mission of a raw vegetable side, but not in a way that’s in keeping with Thanksgiving.” So he set out to do what any vegetable-loving recipe developer would: Create salads as beautiful as they are desirable. Here’s how can you do the same.Seek knockout ingredients: Now’s the time to drag yourself to the farmers market or the speciality food store and seek out the colorful, unusually shaped ingredients that don’t make it on the table on any old day. Produce like purple carrots, pink-speckled Castelfranco radicchio (the darling bitter green of some of the country’s coolest restaurants), and wispy Napa cabbage are stunning all by themselves (read: they won’t require much compensating). “When you change the players, says Chris, “you change the game.”Take what’s usually cooked, and serve it raw: Think about a vegetable you’re used to seeing cooked to death (broccoli, carrots, beets) and present it raw for an addition to the table that’s surprising—and not to mention pleasantly crisp and refreshing in comparison to the velvety softness elsewhere. Chris lets the carrot coins and broccoli pieces sit in the dressing to ease up, so you won’t feel like a bunny rabbit when the time comes to eat.You don’t have to stick with leafy greens. When you swap out the massaged kale or baby spinach for something less voluminous, like thinly sliced carrots or cabbage, you’ll be able to feed more people without having to devote your entire fridge to bags of lettuce (since you’ve got a turkey dry-brining in there, don’t you?).Aim for a complete set of flavors in every dish: When you make a salad with salty and acidic components plus a touch of sweetness (like the charred, jammy dates in the carrot salad), heat (from crushed red pepper flakes or pickled chiles), and fragrant herbs, there’s no need to make more than one.And don’t forget lots of citrus. Whether it’s lemon, lime, grapefruit, or blood orange, that acid will cut through the richness of the rest of the table.Thanksgiving salad’s sounding real good right about now, isn’t it?Get the recipes:Shaved Carrots with Charred DatesTangy, crunchy carrots meet soft and sweet blackened dates for literally everything you want in one bite.View RecipeRadicchio Salad with Sour Cream RanchWith salty, sweet, and creamy components, this recipe is more than just a salad: It's a fully realized side dish.View RecipeBroccoli CaesarYou've never met a better, brighter riff on the classic Caesar than this raw broccoli twist.View RecipeExplore Bon AppétitThanksgivingSaladWinterRead MorecookingThe Glazed Brussels Sprouts You’ll Be Making All FallBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Sarah Jampel"]}