{"id": "a4a0500bdd4090f81abafb4f57304a98", "url": "https://www.bonappetit.com/recipe/frozen-margarita-pie", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Frozen Margarita Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFrozen Margarita PieBy Andy BaraghaniJuly 17, 20184.6(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintYour favorite cocktail in pie form—what's not to love? Just keep in mind that you'll need to freeze the pie at least 8 hours, preferably overnight, for the ideal texture, so be sure to plan ahead.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketSmall Saucepan$155 At AmazonFood Processor$49 At AmazonPie Pan$19 At AmazonWhisk$10 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonSieve$18 At AmazonGlass Measuring Cup$19.99 At AmazonSpoon$24.69 At AmazonMicroplane$16 At AmazonIngredients8 servings6Tbsp. unsalted butter10graham crackers3Tbsp. sugar½tsp. kosher salt. divided¾cup chilled heavy cream5limes, divided114-oz. can sweetened condensed milk3Tbsp. tequila blancoPreparationStep 1Melt 6 Tbsp. butter in a small saucepan over medium heat. Let cool slightly.Step 2Crumble 10 graham crackers into the bowl of a food processor. Add 3 Tbsp. sugar, ¼ tsp. salt, and melted butter to bowl and process until mixture resembles wet sand.Step 3Transfer graham cracker mixture to a shallow 9\" pie pan. Using a measuring cup, press firmly into bottom and up sides of dish. Freeze 20 minutes.Step 4Meanwhile, whisk ¾ cup heavy cream in a medium bowl until cream begins to thicken to the point you see ripples and stiff peaks begin to form, 3–5 minutes.Step 5Cut 4 limes in half and juice into a fine-mesh sieve set over a glass measuring cup (you should have about ½ cup juice). Pour lime juice into another medium bowl and whisk in 14 oz. condensed milk, 3 Tbsp. tequila, and remaining ¼ tsp. salt until smooth.Step 6Fold half of whipped cream into lime juice mixture, carefully folding under and over while turning the bowl. Add remaining whipped cream and continue to fold until no streaks remain.Step 7Remove pie pan from freezer and pour in filling. Using the back of a spoon, gently spread filling to edge of crust.Step 8Using a microplane, zest half of the remaining lime over pie.Step 9Freeze pie at least 8 hours, or preferably overnight.How would you rate Frozen Margarita Pie ?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleI added a full cup of cream and whipped it into the desert plus added a cup of 4% Greek yogurt folded in also. I used the zest of 2 limes and this helps cut down on the sweetness plus add more tartness to the desert. It has been extremely well received by friends and family. KeenerToronto 8/3/2021This recipe is very sweet. Experiment a bit and also try doing this in a square 9\" baking. Put parchment paper underneath with 2\" left over on the sides.  When you are ready to serve, it is easy to lift out.  Then cut it into squares and have it as a side for berries. that way it is a compliment rather than the whole dessert. I also like to add a bit more tequila and a bit of triple sec or grand marnier. Pamela LessingVail, CO8/1/2021My trick for making the pie slices easier to remove is after the pie is removed from the freezer, soak the pie plate in a very shallow bath of warm water to loosen the crust slightly.  After about 5-8 minutes you can cut & they should be much easier to remove.  This is a trick from the instructions of the no-bake jello cheesecakes and it worked perfectly for this recipe when I did it.  This recipe has been such a huge hit even in conversation so I have given several copies of the recipe out to people who haven't even tried it themselves yet just so they don't have to wait until I make it again.  ;-)DianePBend OR7/12/2021Cloyingly sweet.  Will not make again.Anonymous7/5/2021This pie is amazing and super simple. After reading the reviews which indicated how difficult it was to get a good slice out of a pie plate ? I used a springform pan with great success. A couple of changes that I made were (1) adding an extra tablespoon of butter to the crust recipe which helped soften the crust enough to manage the slices. (2) I topped up the cream to a full cup to add a slightly fluffier texture to the product and I also topped the desert with zest from 2 limes to counter the sweetness of the condensed milk. Great success all around!! Stephen CraigToronto6/18/2021Great pie...I added a little more tequila 😜 and did a raspberry swirl in too..beautiful AnonymousShawnee Ks 6/6/2021I received this pie as a gift for my birthday in 2020 and I have made it twice since then. My sister-in-law is gluten-free and dairy-free and I have been able to successfully make this pie with coconut milk and sweetened condensed coconut milk which I found at whole foods and gluten-free graham cracker and it is a really faithful facsimile.AbbyDallas, TX5/2/2021This pie was so delicious that I'm making it again just one week later! Oh, and I made it in a springform pan as another reviewer suggested, and I had no problem at all slicing and serving it.AnonymousBoise, ID9/3/2020I've made this pie a few times and I have friends requesting it now.  I even switched up the lime for grapefruit to make a Paloma Pie. When using the grapefruit you still need a little lime and i added a little more sweetness to counter the bitterness of the grapefruit.  RomeyneGrand Rapids, MI9/3/2020My whipped cream cuddled a little when I added it to the lime mixture, as well. I opted to whip more air into it with a whisk and that seemed to solve the problem...in the freezer now. Can't imagine it affecting the texture that much since it's a no-bake situation. AnonymousPhiladelphia5/23/2020I also had issues with the crust freezing solid. And the filling started melting within minutes of coming out of the freezer, so it was impossible to get a good slice out. So, I scooped all the filling out and froze it separately, then broke the crust into little chunks and put it in the fridge. To serve, I presented this as \"margarita ice cream with crumble\"! The flavour was amazing! AkankshaIndia5/20/2020This pie was delicious but please tell me how to get the slices out in one piece!!! The frozen crust was IMPOSSIBLE to get out of my glass Pyrex pie dish. I basically just lifted out the filling and then scraped out the crust as best as I could. I’d rate this five stars if it wasn’t such a nuisance to get out.AnonymousBoston, MA5/7/2020Help! My condensed milk curdled when I added it to the lime juice!Barro32Ireland3/17/2020I have made this three times now in 8 1-cup wide-mouth sealer jars. Perfect for just the two of us to have on hand in the freezer, and I love the portion control. It's not like I'm going to get another jar from the freezer, while if in pie-form I might just have another \"little sliver.\"valerie_joyVictoria, BC, Canada10/29/2019I have made this twice and like others, found it difficult to cut. Springform pan idea should help with this. I added a tablespoon of Paula's Texas Orange liquer with the tequila--which made it taste even more like a margarita!AnonymousAustin, Tx9/22/2019Explore Bon AppétitPieDessertFrozen DessertLimeCitrusFruitTequilaAlcohol & Other DrinksEasyNut-FreeFourth Of JulyMemorial DayLabor DayBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Andy Baraghani"]}