{"id": "a4db50320b6b3f6ecad10ae01fe04a84", "url": "https://www.bonappetit.com/story/how-to-build-better-vegetarian-sandwiches", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "Vegetarian Sandwiches Are Delicious—Here's How To Build A Better One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow To Build Better Vegetarian SandwichesChef Matthew Cahn schools us on the new rules of veggie sandwiches.By The Healthyish TeamFebruary 21, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailArtfully constructed sandwiches are one of the most exciting things happening in food right now. While deli counters have long been beloved for their prosciutto and fried bologna sandwiches,  the eggplant-based Phoagie at Philly's Middle Child is proof that the formerly sad vegetarian option on menus is now every bit as good as the meaty stuff. Here, Phoagie chef Matthew Cahn schools us on the new rules of vegetarian sandwiches.1. Treat herbs like lettuce.Soft herbs with tender stems up the ante on standard greens by offering a fresh flavor and crunchy texture.\"When you're dealing with a lot of complicated layers in a sandwich, think outside the box with the lettuce,\" Cahn says. Iceberg and Bibb lettuce are sandwich staples, but subbing in a mound of herbs can be transformational.2. Pick your \"meat.\"A toothsome vegetable that mimics meat's heft distinguishes a true veggie sandwich from a salad between two slices of bread. Think roasted eggplant, sweet potato, butternut squash, broccolini, and seared king trumpet mushrooms.We dream about these broccolini cheesesteaks.\nPhoto by Alex Lau, food styling by Yekaterina Boytsova, prop styling by Emily Eisen3. Fat is good.Add mayo, avocado, or cheese to give a sandwich body and blend flavors together.\"The classic sandwich build is salty and fatty and rich, and you just need a good balance of all those flavors,\" Cahn says. \"Cheese is the cheater that makes it all fine.\"4. Do it for the 'gram.\"Chicken is white. Steak is brown. That's not pretty,\" Cahn says. You know what is? Fiery orange sweet potatoes. Hot-pink beets. Green herbs. Live by this maxim: A colorful sandwich is a flavorful sandwich.5. Play with textureBiting into a sandwich should be an explosion of textural interplay. Cahn likes to combine crunchy, tender stemmed cilantro and bean sprouts with \"noodly soft\" eggplant and avocado for a multi-textural eating experience.6. Don't forget something pickled.Pickles and coleslaw are classic sandwich condiments, but go beyond the norm with pickled red onions or mustard greens. \"That vinegary pickle flavor is really important in a sandwich.\" Cahn says. \"Raw mustard greens can be too intense for a lot of people but pickling them makes them fresh and palatable.\"These sandwich rules all come together in this spiced sweet potato sandwich. It's packed with quick-pickled beets, creamy feta, hefty roasted sweet potato, and topped off with a mound of mixed herbs. Each component in this sweet potato sandwich recipe is seasoned really well, which makes everything pop. It's a new-school veggie sandwich that has the potential to become a real classic.Okay, it's veggie sandwich time:Spiced Sweet Potato Sandwich with FetaEach component in this sweet potato sandwich recipe is seasoned really well, which makes everything pop.View RecipeExplore Bon AppétitHealthyishVegetarianSandwichVegetableSweet PotatoRead MorecookingThis Broccolini Cheesesteak Is the Sandwich You NEED Right NowBy Mike SolomonovRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "The Healthyish Team"]}