{"id": "a4f2c50277973db959061c14e88fc781", "url": "https://www.bonappetit.com/story/iris-apfel", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "'Geriatric Starlet' Iris Apfel Isn't Telling Anyone How to Live | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture'Geriatric Starlet' Iris Apfel Isn't Telling Anyone How to LiveThe 96-year-old has the same breakfast every single day.By Abid HaqueMarch 23, 2018FacebookTwitterEmailPhoto by Getty Images/Dustin HarrisFacebookTwitterEmailRegardless of where in the world she is, Iris Apfel starts her mornings around 9 a.m. with a small glass of freshly squeezed orange juice and a bowl of hot cereal—oats, grits, or cream of wheat—and always a decaffeinated coffee with hot skim milk. The 96-year-old, self-proclaimed “geriatric starlet” and consummate fashion insider spends the winters at her home in Palm Beach, Florida, where we spoke in January.Well-known by fashion and design insiders for decades, Apfel is the former owner of Old World Weavers, a textile firm commissioned by nine U.S. presidents—from Truman to Clinton—to design the interiors of the White House. Apfel garnered even more attention in 2005 when her personal style was the subject of an exhibit at the Metropolitan Museum of Art.Since retiring in 1992, Apfel has not slowed down; this past July, a documentary about her life, Iris, directed by Albert Maysles was nominated for an Emmy. She also serves as the face of Happy Socks, designs collections for the Home Shopping Network, and is a regular presence at the Met Gala and New York Fashion Week. In March, Apfel published her collection of illustrated thoughts and observations, Iris Apfel: Accidental Icon.Even with a hectic schedule at 96, Apfel’s skin is glowing; she’s full of energy, and her laugh is as infectious as her style is unique—much of this she contributes to her healthy but simple approach towards life. Even though her perspective on the world hasn’t changed much, one thing that has changed for Apfel in the last several years is her eating habits.“When I was young, my husband and I were very adventurous,” she recalls. “We traveled a lot, and there wasn’t anything we didn’t try.” Apfel says her husband made “the best omelet,” thanks to a lesson from their close friend and La Grenouille founder, Charles Masson. But neither Apfel nor her husband (who died in 2015) cooked regularly. “We worked very hard, and we had erratic hours” she explains. Now, as she approaches a century of life, she has altered her diet to simpler foods. “I don’t like rich things,” she says. “and a big portion always scares me off.”Apfel’s lunches and dinners typically consist of a white fish or other lean meat with lots of vegetables and fruit for dessert. She readily admits she has become a creature of habit when it comes to food, but one with high standards. “I never buy ground hamburger meat. We always get a good steak and we grind it here at home.” She eats fruit for dessert (anything except watermelon), though she’s known to accept a slice of pumpkin pie during the holidays.She’s been hip to the benefits of turmeric for decades and wary of fad diets. “I don’t believe in trends of any kind. I think they’re all cuckoo,” she says. “I think the best diet is to push yourself away from the table.” She avoids raw fish and other uncooked meats after witnessing the cholera epidemic 40 years ago in Naples, Italy (it had been caused by mussels).Apfel doesn’t take any supplements, and she doesn’t stray from her regular foods when she travels. When asked whether she has a favorite restaurant, meal, or food to recommend, she says, “That’s a dumb question,” and she has a point. “I don’t eat junk food, I don’t take a lot of salt, I don’t drink sodas, and, most importantly, I don’t advise anyone,” she declares. “It’s not my place to tell other people how to live.”Explore Bon AppétitHealthyishprofileRead MorecultureStella Bugbee Makes Breakfast, Lunch, and Dinner While We're Still AsleepBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-23", "author": ["Condé Nast", "Abid Haque"]}