{"id": "a4fcb93df04817243a2573bba58b20c0", "url": "https://www.bonappetit.com/recipe/meatballs-with-tahini-sauce", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Meatballs with Tahini Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueMeatballs with Tahini SauceBy Anissa HelouApril 17, 2018EmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintFor this meatballs recipe, be sure to roll the meatballs firmly into the millet so that the tiny grains don’t fall off during frying.Ingredients4 servingsMeatballs½cup millet1lb. ground beef chuck (20% fat)5garlic cloves, finely grated1tsp. ground coriander1tsp. freshly ground black pepper1½tsp. kosher salt, plus moreSauce and AssemblyVegetable oil (for frying; about 9 cups)½cup tahini1garlic clove, finely grated3Tbsp. fresh lemon juiceSpecial EquipmentA deep-fry thermometerPreparationMeatballsStep 1Cook millet in a dry medium skillet over medium heat, stirring occasionally, until fragrant and lightly toasted, about 3 minutes. Transfer to a small bowl and let cool.Step 2Meanwhile, mix beef, garlic, coriander, pepper, and 1½ tsp. salt in a medium bowl with your hands just to combine; be careful not to overwork.Step 3Working one at a time, roll meat mixture loosely between your palms into 1¾\" balls (you should have about 18) and place on a rimmed baking sheet. Roll each ball in toasted millet, pressing and packing firmly into meat with your palms. Repeat process as needed until completely coated. Chill meatballs at least 20 minutes and up to 2 hours (this will help the millet adhere during frying).Sauce and AssemblyStep 4Pour oil into a large heavy pot fitted with a deep-fry thermometer to come 1½\" up sides; heat over medium until thermometer hits 350°.Step 5Meanwhile, combine tahini and garlic in a medium bowl. Gradually add 6 Tbsp. water, then lemon juice, whisking constantly until sauce is smooth and pourable. Season with salt.Step 6Using a slotted spoon, gently lower meatballs into oil and fry undisturbed 2½ minutes (millet will be light golden). Transfer to a baking sheet lined with paper towels; season lightly with salt. Serve meatballs with tahini sauce.How would you rate Meatballs with Tahini Sauce?Leave a ReviewTell us what you thinkExplore Bon AppétitMeatballMiddle EasternGround BeefBeefMeatTahiniCondiments, Sauces & PastesMilletRice & GrainsMainDairy-FreeGluten-FreeHealthyishDeep-fryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Anissa Helou"]}