{"id": "a504f38d629e755abcd8d8d44579a24c", "url": "https://www.bonappetit.com/story/slow-cooker-roast-pork-sandwich-recipe", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "This Slow Cooker Roast Pork Sandwich Wins Championships | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Slow Cooker Roast Pork Sandwich Wins ChampionshipsA roast pork sandwich, not a cheesesteak, is the best sandwich in Philadelphia. It will also be the best sandwich at your Super Bowl party.By Alex DelanyJanuary 31, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Claire SaffitzFacebookTwitterEmailMention the words “Philadelphia” and “sandwich” in the same sentence, and you’ll be slapped with a cheesesteak faster than the Philadelphia Parking Authority can plaster your car with parking tickets. But real ones know that Philadelphia’s greatest sandwich doesn’t involve steak. Philly’s most noteworthy contribution to the wide world of meat-on-bread is the Italian roast pork sandwich, topped with sharp provolone and broccoli rabe. That tender, juicy, soul-reviving creation was made for this year’s Super Bowl.The Birds (Eagles) are in the Super Bowl, after all, and what better way to show the underdogs some love than to serve up a delicious underdog of a sandwich. That’s why we’ve spent the past couple months developing this Italian roast pork sandwich recipe, an easy, slow-cooker rendition of the classic sandwich served at true South Philly joints like John’s Roast Pork. (Home to the best sandwich in Philly, in my opinion.) We can’t all make it to Snyder Ave. This is the next best thing.The pork is meant to be big, in portion and in flavor. Setting it in a slow-cooker and letting it hang out with honey, vinegar, salt, rosemary, garlic, and red pepper flakes for four hours is going to give you synchronized hits of sweetness, heat, and tangy acid, working together like some kind of...professional sports team. All that flavor should be savored, which means the sauce that collects in the bottom of your slow cooker needs to be ladled over the pork, cheese, and broccoli rabe. It gives your roll that just-dunked French Dip texture, satisfyingly soggy and crispy at the same time.If it were socially acceptable to bathe in this pork jus, I’d already be in the tub. Hell, maybe I’ll still do it and call it performance art. (“Oh, you don’t get why this grown man is swimming in pork juice? You must not understand art.”) It’s the kind of sauce that you’ll be thinking of next week, as you stare at your mediocre lunch. The flavor of this pork is inspires thoughts of glory.Photo by Chelsie Craig, Styling by Claire SaffitzAnd the toppings? Sharp provolone and garlicky broccoli rabe (which you blanch quickly, then crisp in a skillet with garlic). White and green. Eagles colors. The combination of two bitter toppings balances the intense, fatty pork below. Defense may win championships, but the bite of sharp provolone wins sandwiches.This is a sandwich that makes the frigid, 8:00 a.m. tailgate tolerable. This is the sandwich that draws equal levels of interest from the super-fan and the \"Why are we watching sports?\" party guests. This might even be the sandwich for a Patriots fan, the kind who would shed team loyalty for glorious, game-winning pork. But only a fool would walk around South Philly in a Patriots jersey. Think before you pull a stunt like that. Take off the Pats jersey, and pick up the Italian roast pork.Now, find the slow cooker and make these immediately:Slow-Cooker Roast Pork SandwichesThis slow-cooker version of the Philly classic has all the makings of a great sandwich: sharp provolone, garlicky broccoli rabe, and lots of jus from the pork for dipping.View Recipe1 / 63ChevronChevronHerby Avocado HummusView RecipeExplore Bon AppétitSandwichPorkBroccoli RabeProvoloneSouth PhiladelphiaPhiladelphiaSuper BowlRead Moreculture50 Super Bowl Favorites That You Need at Your PartyGallery50 SlidesBy The Bon Appétit Staffrecipes73 Super Bowl Appetizers to Tackle This YearGallery73 SlidesBy Alyse Whitneyrecipes57 Super Bowl Dessert Recipes, Because Life Ain't All Chicken WingsGallery57 SlidesBy Bon Appétitrecipes95 Vegetarian Super Bowl Recipes That'll Make You Forget WingsGallery95 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Alex Delany"]}