{"id": "a5095317b1bf53f33d41383a491dc0e3", "url": "https://www.bonappetit.com/story/best-potatoes-for-roasting", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "What Are the Best Potatoes for Roasting? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are the Best Potatoes for Roasting?The best potato for roasting is thin-skinned, perfectly textured, consistently sized, and available everywhere.By Alex DelanySeptember 11, 2019FacebookTwitterEmailChristina HolmesFacebookTwitterEmailYou can use a Yukon Gold potato for anything. Well, almost anything. Maybe not a doorstop or a cellphone or an affordable, efficient form of public transportation. But when it comes to cooking? Yeah, it’s good for everything. Yukon Golds are perfect for mashing, blanching, frying, and most of all, roasting. In fact, Yukon Golds are the best potatoes for roasting out there. Here’s what makes them so great:The Starchy-to-Waxy SpectrumRussets are very starchy. Fingerlings are super waxy. The starchier the potato, the better for frying. The waxier the potato, the better for mashing or boiling. Yukon Golds fall right in the middle of the spectrum. There’s enough waxiness to hold their shape and develop nice caramelization on the outsides, while simultaneously having enough starch to make the interior creamy, silky, and luxuriously buttery. This is the real beauty of the Yukon Gold, what makes them the best potatoes for roasting. The crisp. The creaminess. The texture.Thin-SkinnedThinner skin means heat can get all up inside that potato more quickly. Less time hanging around, waiting for your 'taters to cook is a good thing in our book. Especially when you’re cooking for someone else. Like us. We’re still waiting for that dinner invite.Ben DeweySize, Size, Size Is the Same, Same, SameYukon Golds are pretty consistent in terms of size and shape, which helps us a bunch when roasting them. Since each potato is about the same size, they will all cook at the same rate, meaning there won’t be any of that over cooked mixed in with the undercooked nonsense.You Can Get Them EverywhereThis isn't some crazy, obscure, farmers' market-only ingredient—we're talking about the most common potato there is. You can walk into any grocery store in the country and find Yukon Gold potatoes in the produce section. They will be there, whether loose or in bags. Ready to serve. Always.So now that you've got the best potatoes for roasting, here's the perfect method for roasting them:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-09", "author": ["Condé Nast", "Alex Delany"]}