{"id": "a532a29d7d467d6e23e45c18eb2be478", "url": "https://www.bonappetit.com/recipe/grilled-swordfish-with-tomatoes-and-oregano", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Swordfish with Tomatoes and Oregano Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Swordfish with Tomatoes and OreganoBy Claire SaffitzMay 21, 20195.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWe're flipping the script and marinating after grilling. Inspired by the technique called escabèche, where cooked fish and meat are preserved in an acidic mixture, we're cooking first, marinating second—in this case, it's swordfish steaks in a punchy red wine vinegar dressing with capers and oregano. There’s only a kiss of honey in there, but it’s an essential player. With all the briny flavors from fish and the capers, you need a touch of sweetness for balance.Ingredients4 servings½cup plus 2 Tbsp. extra-virgin olive oil, plus more for grill2Tbsp. pine nuts212-oz. swordfish steaks, about 1\" thickKosher salt, freshly ground pepper¼cup red wine vinegar2Tbsp. drained capers, finely chopped1Tbsp. finely chopped oregano, plus 2 sprigs for serving½tsp. honey2large ripe heirloom tomatoes, halved, thickly slicedPreparationStep 1Prepare a grill for medium-high heat; lightly oil grate. Toast pine nuts in a dry small skillet over medium heat, shaking often, until golden, about 4 minutes. Let cool and set aside for serving.Step 2Pat swordfish dry and season all over with salt and pepper. Place on a rimmed baking sheet and let sit at room temperature 15 minutes.Step 3Meanwhile, whisk vinegar, capers, chopped oregano, honey, and ½ cup oil in a small bowl to combine; set marinade aside. Arrange tomatoes on a rimmed platter, overlapping slightly; set aside.Step 4Rub swordfish all over with remaining 2 Tbsp. oil and grill, undisturbed, until grill marks appear, about 4 minutes. Carefully turn over and cook on second side until fish is opaque all the way through, about 4 minutes. Transfer to reserved platter with tomatoes and top with oregano sprigs. Season with more salt and pepper. Pour reserved marinade over and let sit at least 15 minutes and up to 1 hour. To serve, scatter reserved pine nuts over.How would you rate Grilled Swordfish with Tomatoes and Oregano?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI'm not much of a fish fan, but this was delicious.  The tangy sauce overcame any fishy-ness, and I actually loved this!AnonymousSt Paul, MN8/10/2021I’ve made this recipe multiple times, and it’s now my favorite way to eat swordfish. Grilling the fish before marinating is brilliant! Use whatever herbs you have. It’s always delicious. In winter I omit the tomatoes and it’s still fabulous. Ecini Dayton, OH7/20/2021SO GOOD! really tender and summery! made this with grilled summer squash and red onion with feta (another ba) recipe, it was the perfect dinner!Kiersten Wasserman1/31/2021Marvelous recipe.  Perfect summer swordfish preparation using home grown tomatoes and oregano.  Easy preparation.  My husband's favorite meal.Kathy KinseyBonita Springs, Fl8/15/2019So delicious!! Simple, elegant, easy. This is my new go to summer meal! It came together so easily and looks beautiful.Anonymous7/17/2019Explore Bon AppétitSwordfishFishSeafoodTomatoVegetableOreganoHerbs & SpicesSummerEasyWeeknight MealsMainDairy-FreeGluten-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Claire Saffitz"]}