{"id": "a5326d62a17b34b3b1940b196dde0bff", "url": "https://www.bonappetit.com/story/martha-stoumen", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Martha Stoumen, Natural Winemaker, Turns Work Into Highly Drinkable Play | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Natural Winemaker Martha Stoumen Turns Work Into Highly Drinkable PlayThe ‘recovering perfectionist’ is also one of the coolest women we know.By Lizzie NoonanAugust 6, 2019FacebookTwitterEmailPhoto by Rhonisha FranklinFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Martha Stoumen, first generation natural winemaker, responsible farmer, and recovering perfectionist.Martha Stoumen was trying to figure out what she wanted to be when she grew up. Armed with a freshly minted UCLA geography degree and a deep curiosity about her Italian lineage, Stoumen headed to Tenuta di Spannocchia, an organic farm and learning center in Tuscany. She was put to work in the vineyard and olive orchard: pruning vines, harvesting grapes and olives, tasting fruit for ripeness, and navigating the small cellar. “I felt like I was playing,” she says. “When I got back to California and I was trying to face ‘real’ life, I decided to try to make my work what I feel like play is. I haven’t stopped since.”Stoumen, then twenty-two, set out for eight years of apprenticeships with winemakers around the world, even picking up a masters in Enology and Viticulture from UC Davis along the way. Her time abroad culminated with Giusto Occhipinti at COS in Sicily— a trailblazing natural winery founded in 1980 that was amongst the first to celebrate the region’s indigenous grape varieties rather than follow the norm of producing bulk wines with international grape varieties to be sold-off for blends.“Wine is such an expression of a place—it’s also a self expression—but it’s a love letter to a place,” she says.”California wines were being overworked to the point that they ceased to tell us anything about their regions. I kept thinking about what California is, what would I like it to be in terms of winemaking, and that’s when I realized I needed to come home.”In 2014, Martha Stoumen Wines was born with the ambition of making distinctly Californian wines. Stoumen toiled away at her own projects during off-hours while working for Broc Cellars in Berkeley, making wine with a few friends in one of their parents’ basements. The first release under her eponymous label dropped in 2017.Nowadays, running the Sebastopol winery is a full-time gig that includes leasing and farming half her own vineyards, collaborating on a pét-nat with funny guy Eric Wareheim, and keeping up with orders for Post-Flirtation, her zippy, playful subset of wines that inevitably sells out. “Seeing years of hope and hard work come to fruition is probably one of the most rewarding experiences in life,“ Stoumen says, “At the end of the day, I just want people to enjoy these wines and have some delicious pleasure in their lives.”We caught up with Stoumen about the power of wine to transcend generations, letting go of perfection, and how winemaking can be more sustainable.My winemaking philosophy is… nature provides the answers and you just have to be open enough to see them.The biggest challenge in winemaking is…  keeping your cool. Nature provides the answers, but man, it can be real rough sometimes. When things don’t go the way you expected, look at how they are going and think of the creative, wonderful outcome you can make of that.The biggest reward of winemaking is…creativity and connection with other people.I believe wine has the power to…connect humans in the present moment and transcend generations. I work with grapes that were planted by people who have now passed away and I’ve tried wines that were made by people who have passed away: It is literally the translation of their handwork and you’re ingesting it into your body and it becomes a part of your experience.Learning winemaking in Italy taught me… to trust in my ability as a human to taste and smell rather than overcomplicate things. When I’m in Italy, I feel more like myself than I do in the states. There’s so much freedom in the way you speak and the way you say things.If I could share my wine with anyone, it would be…all of my ancestors, most of whom I don't know, at a huge feast. Who knows? My ancestors might be assholes, but I’m truly curious about who they are, what their stories are and how they got to the U.S.I feel supported when… people show up and help. It’s a huge love language of my family: my parents help me disgorge (Editor’s note: when sediment is removed from a bottled sparkling wine after secondary fermentation) and my brothers come take down trees in the vineyard. They won’t say much necessarily; they’ll show their love through help instead.I’m listening to... Lauryn Hill, Sly and the Family Stone, and early ’90s Mariah Carey.Right now I’m reading... Dune. I never thought I’d be into sci-fi, but I felt like I needed a little adventure.The pleasure I have to fight for is…letting go of this idea of perfection. Growing up, I was a severe perfectionist and have worked to undo that throughout my adulthood. I think making natural wine is a huge counterbalance for that; you get to be very creative without being controlling.I want us all to joyfully rally around changing our habits to better the environment rather than using guilt and fear as mechanisms for change. Herbicides and fumigants have taken a huge toll on soil bacteria and fungi, which has yielded less nutritious, flavorful food (and grapes) over time. Rather than stopping the conversation at \"herbicides are bad, fumigants are bad, our soils are dead, we should stop using these chemicals,\"we should look at how our soil systems work and feel empowered to compost more, help keep soils aerated, and let soils, bacteria, fungi, and plants do their choreographed dance with one another to make our food more delicious again.Whether or not Martha Stouman Wines lives beyond my lifetime, I would love the future to be one that pushes the boundaries of transparency in the wine industry through education and an open dialog around farming and wine. When I came back to California, I thought about what I really wanted to say. If that becomes irrelevant, then Martha Stoumen Wines will fade out naturally. If it stays relevant and connected, then it will live on as long as it needs to.Explore Bon AppétitHealthyishPerson of Interestnatural wineInterviewsRead MoreLifestyleNew Orleans Chef Nina Compton Isn't Afraid of the Dish PitBy Kristin BraswellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-06", "author": ["Condé Nast", "Lizzie Noonan"]}