{"id": "a53a957fe45a0e792977d178df770dcb", "url": "https://www.bonappetit.com/recipe/yogurt-and-spice-roasted-broccoli", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Roasted Broccoli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesYogurt and Spice Roasted BroccoliBy Chris MoroccoDecember 11, 20183.8(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Frances BoswellEmailPinterestPrintEmailPinterestPrintYour roasted broccoli recipe could use an upgrade. Yogurt isn’t just for marinating proteins; it's also a great vehicle for vegetables that could use a little help.Ingredients2–4 servingsKosher salt1lb. broccoli, tough stems trimmed, stalks peeled½cup plain whole-milk yogurt1Tbsp. extra-virgin olive oil¾tsp. hot paprika½tsp. ground coriander¼tsp. ground turmeric1small garlic clove, finely gratedPinch of cayenne pepper or a couple dashes of hot sauceLemon wedges (for serving)PreparationStep 1Place a rack in top third of oven; preheat to 425°. Bring a small pot of salted water to a boil over high heat. Cut broccoli in half lengthwise, then cut on a diagonal into 2\"–3\" pieces, leaving tips of florets intact. Working in batches, cook broccoli just until bright green, about 30 seconds. Drain very well. (Alternatively, you can skip the blanching process—the broccoli may be a bit tougher in the end but will still be super delicious.)Step 2Meanwhile, whisk yogurt, oil, paprika, coriander, turmeric, garlic, and cayenne in a medium bowl. Season with salt. Add broccoli and toss to coat. Transfer broccoli mixture to a foil-lined rimmed baking sheet and arrange in a single layer. Roast broccoli until browned and stalks are tender, 15–20 minutes (unblanched broccoli may take as long as 25 minutes).How would you rate Yogurt and Spice Roasted Broccoli?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleWow, this was really good. I made it pretty much as described but on an oiled and well-seasoned sheet pan (no cleanup problems). Super tasty, and the spiced yogurt makes a nice sort of crust that’s a bit like crispy cheese - just catch it before it gets too dark and then tastes burnt. Will definitely make again.BlorkMontreal 7/14/2021Very tasty and interesting treatment for roast broccoli. Anyone who says that this tastes bad has either bungled the recipe, or simply doesn't have the taste for a vegetable side dish of this kind.  The list of ingredients had originally gotten me negatively biased before trying, but I had everything that was called for, and needed to do something with some broccoli that I didn't want to go bad in the refrigerator, so I took a chance.  \n\nI would advise that you double the sauce recipe for a pound of broccoli.  Also, don't forget (like I did) to \"drain\" the broccoli \"very well\" after blanching. Get it as dry as possible.  Also, toasted slivered almonds sprinkled over the top of each serving will kick the taste up a notch and make it look very classy.G.G.Grand Marais, Minnesota2/22/2021Yes I will make this again and again. It will become my go to recipe. the yogurt sauciness is cheesy and delicious. I used previously frozen but already cooked broccoli florets and nonfat plain yogurt, which was all I had. Im thinking I did not cook it as long as if the broccoli was not precooked. I do love these wondeful spices, a bit on the India side. It was really just perfect, perfect, perfect.Cyndy allardHouston, Texas10/20/2020Seriously awful, do not make this. The spices and yogurt just don't work. I even tried rinsing it out of the broccoli afterwards but still couldn't get rid of the strong flavor. Skip this recipe!AnonymousCalifornia6/11/2020I agree the texture is grainy and odd, owing to the yogurt. But the combination of spices is simply wonderful. I will roast broccoli like this again, using just olive oil with the spices. \nAnonymousMinnesota4/29/2020A very easy yet very tasty and refined recipe. A very good way to prepare broccoli. I coated my sheet in some oil so the broccoli doesn't stick to it and it worked well! IkeanerMünster, Germany4/16/2020Not great - frankly disappointed by this recipe. It comes out dry, and the yogurt creates a strange consistency. Katerina SlootskyBrooklyn, NY 3/18/2020Such a super simple idea that can be tweaked with different spices or flavors for lots of combos. \nThis was a great blend of spiced and savory, and the lemon adds a great brightness to the finished product. \nI made it with whole milk greek yogurt instead of regular yogurt and it turned out just fine. Will definitely make again!Matthew LynessVirginia4/26/2019This recipe is so tasty but the broccoli is an absolute mess to get off the foil. Any tips for keeping it from sticking to the aluminum or wax paper?AnonymousWashington, DC2/22/2019The spices are similar enough to the South Asian spice palette to suit the family and its simple enough that you can experiment with whatever flavours you like.easyaspie1/16/2019An absolutely wonderful recipe! I have tried it three times now and the whole family loves it. It doesn't taste like Doritos but it's spicy and crunchy, makes for a great snack or side dish and is so easy you barely have to think about it. I find it easy to pour a kettle of boiling water over my broccoli florets and then after 30 seconds drain out the water; saves me from doing it in batches.\nI also peel the tough broccoli stalks and slice them into thick coins and add them to the recipe too. I find them just as delicious as the florets and then I don't have to throw away all the stems! Thanks for the recipe Chris Morocco!easyaspie1/16/2019Absolutely disgusting. Whoever thought this tasted like Doritos has never encountered a chip in their life. Anonymous12/30/2018Explore Bon AppétitBroccoliVegetableYogurtOther IngredientsSideGluten-FreeNut-FreeVegetarianKetoHealthyishRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Chris Morocco"]}