{"id": "a5519026a8c337534096dedb5572c53d", "url": "https://www.bonappetit.com/story/spritz-summer-drink-of-choice", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "A Spritz Is My Only Summer Drink of Choice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Spritz Is My Only Summer Drink of ChoiceCan you spritz it? Yes, you can.By Adam RapoportJuly 2, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.If you’re wondering what I’ll be drinking this July 4th, the answer is anything with the word spritz in it.Now, what that means, exactly, depends on who you ask. Everyone at BA seems to have an opinion.Fancy-pants cocktail boys like Andrew Knowlton and Alex Delany will lecture you about how a “true” spritz is a combo of Prosecco and an aperitivo (such as Aperol or Campari), on ice, topped with club soda and garnished with anything from a lemon or orange twist to green olives.Molly Baz kind of concurs, riding hard year-round for her Fall Spritz, which subs dry, Spanish-style cider for the Prosecco.Alex Beggs, always one to stir the pot (or at least a drink) lobbies for the intriguing mix of Cynar, grapefruit soda, and Prosecco.Want this letter before it hits the website? Sign up for our newsletter!Photo by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiI’m less discriminating and far less creative.When it is above 75 degrees and there is a body of water within a Nerf football’s throw, I will drink pretty much anything as long as there is enough ice and fizz—and it’s not too strong.Beer on ice? All. Summer. Long.Laura MurrayThe much maligned, then defended, Aperol spritz? Yes and no. I don’t need the standard day-glo orange concoction, which is basically an adult Shirley Temple. These days, if I’m at a nice restaurant—or an outdoor wedding in August—I’ll ask for prosecco on ice with just a smidge of Aperol, enough to give the bubbly wine a blush. It’s a pesky order, which might elicit an eye roll from your bartender, but give it a shot.But mostly, because it’s summer and I’m lazy (as one should be this time of year), my go-to drink is a rosé spritz. And I don’t mean some highfalutin version that you’ll find in Bon Appétit. I mean rosé on ice with a splash of crisp club soda, preferably from one of those little glass bottles. Less sweet than a glass of rosé, colder than a glass of rosé (key, if you’re in the sun) and not at all stiff. In other words, ideal for day drinking.And if said spritz is in a Solo cup and I’m in a pool or on a boat, well, even better.Get the recipe:Aperol SpritzThis classic combo should be credited with starting the whole spritz phenomenon in the United States.View RecipeExplore Bon AppétitAdam NewsletterSpritzAperolRead MoreLifestyleI'm Now A Person Who Drinks Lightly Brewed Sparkling TeaBy Alex Delanycooking3 Campari Cocktails You Don't Need a Gazillion Ingredients to MakeBy Al CullitoncookingIf You Can Open a Cheap Beer, You Can Make This CocktailBy Alison RomancultureBring Your Host This Wine and Win At Being a Dinner Party GuestBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Adam Rapoport"]}