{"id": "a551e9f7c34d213403d20b4e9c589d5d", "url": "https://www.bonappetit.com/recipe/corn-and-crab-beignets-with-yaji-aioli", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Corn and Crab Beignets With Yaji Aioli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueCorn and Crab Beignets With Yaji AioliBy Marcus SamuelssonDecember 1, 20205.0(21)Read ReviewsTriangleEmailPinterestPrintPhotograph by Joshua Kissi, food styling by Roscoe Betsill, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThis ode to Gullah Geechee cuisine marries crabmeat with corn kernels for a crispy party starter. The aioli, spiked with the West African spice blend yaji, is ideal for dipping. It’s a flavor-packed condiment ideal for everything from seafood dishes (like these beignets) or grilled vegetables to just a warm baguette.This recipe was adapted from ‘The Rise: Black Cooks and the Soul of American Food.’Ingredients8 - 10 ServingsYaji Spice Blend½cup unsalted dry-roasted peanuts2Tbsp. ground ginger1tsp. cayenne pepper1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. garlic powder1tsp. onion powder1tsp. paprikaAioli2large egg yolks*1Tbsp. fresh lemon juice¾cup peanut oil1small shallot, finely chopped1garlic clove, finely grated2Tbsp. thinly sliced chivesKosher saltBeignets and assembly4Tbsp. unsalted butter10oz. frozen corn (about 2 cups)2Tbsp. thinly sliced chives1½cups all-purpose flour½cup cornmeal2tsp. baking powder1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt½tsp. cayenne pepper1large egg, beaten to blend1cup buttermilk8oz. lump crabmeat, picked overVegetable oil (for frying; about 6 cups)Ingredient Info* Raw egg is not recommended for the elderly, pregnant women, people with weakened immune systems…or people who don’t like raw egg.special equipmentA deep-fry thermometerPreparationYaji Spice BlendStep 1Pulse peanuts in a food processor until very finely chopped (be careful not to go too far; if you overprocess, the peanuts will turn into butter). Add ginger, cayenne, salt, garlic powder, onion powder, and paprika and pulse until powderlike.Do ahead: Yaji can be made 3 months ahead. Transfer to an airtight container; cover and chill or freeze.AioliStep 2Whisk egg yolks and lemon juice in a medium bowl to combine. Whisking constantly, add oil, starting with just a few drops at a time and gradually increasing to a fine steady stream. Whisk until all of the oil is incorporated and mixture is emulsified, about 4 minutes. Whisk in shallot, garlic, chives, and 1 Tbsp. yaji spice blend. Taste and season with salt.Do ahead: Aioli can be made 3 days ahead. Cover and chill.Beignets and assemblyStep 3Melt butter in a medium high-sided skillet over medium heat. Add corn and cook, stirring occasionally, until softened slightly and bright yellow, about 5 minutes. Transfer to a large bowl and stir in chives; let cool.Step 4Meanwhile, whisk flour, cornmeal, baking powder, salt, and cayenne in a medium bowl.Step 5Add egg and buttermilk to corn mixture and stir to combine. Add dry ingredients and stir again just to incorporate, then fold in crabmeat.Step 6Pour in oil to come 1½\" up sides of a large pot or deep fryer. Fit pot with thermometer and heat oil over medium-high to 350°. Place a wire rack inside a rimmed baking sheet and line rack with paper towels. Working in 4 or 5 batches, scoop out heaping tablespoons of batter, carefully place in oil (8–10 per batch) and fry, turning often, until beignets are golden brown and cooked through, about 5 minutes. Transfer beignets to prepared rack; season with salt.Step 7Serve beignets warm with yaji aioli for dipping.How would you rate Corn and Crab Beignets With Yaji Aioli?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleI didn't make the aoli but it sounds tasty, maybe I will make it for the leftovers, which heat up great again in the air fryer (I made them a couple of hours before dinner in case I messed them up). These were simple to make and very tasty, crunchy crunchy on the outside and fluffy inside. The toasty corn is what it is all about, I think you could even skip the crab and not miss it much. SarahAustin, CO3/2/2022I didn’t care for the aioli / ended up using my own garlic/ lemon aioli but the beignets themselves were awesome/ will definitely make them again.Christine Lancaster PA8/1/2021For the person wishing to keto-fy this (or any recipe involving flour), you could try almond or other nut flours. However, the textures are likely to be somewhat to extremely heavy by comparison. Corn is never going to be keto, so I'd find some other recipe site to work from. Minimalist Baker and Gnom-Gnom are both excellent bloggers who do the research and take the time to truly craft worthwhile keto-friendly foods. Gnom Gnom has a churros recipe that you could perhaps adapt to be a crab fritter, but be prepared to experiment with different recipes. I'd start without risking the uber pricey crab to get the texture dialed in. Good luck.SuzinsfSan Francisco3/1/2021Can this be made Keto friendly. What can be substituted for the cornflour and other carbs listed in the recipe?AnonymousAlbany OR2/4/2021I love this type of food and will make it this coming  weekend..Gillian Toronto Canada 🇨🇦 1/31/2021I made the beignets without the aioli. They were an extremely enjoyable comfort food and I'll definitely make them again. L PetersenSpringfield, IL12/16/2020Calling these ‘beignets’ certainly sounds more elegant, but they are NOT beignets, they are fritters.  I love beignets, but was disappointed when I read the recipe, and have no interest in making fritters.AnonymousCocolalla, Idaho12/14/2020dont know how much of yaji  to put in aioli ..Anonymousminneapolis12/2/2020Explore Bon AppétitFritterCrabShellfishSeafoodCornVegetableButtermilkOther IngredientsCornmealFlourStarterDeep-fryKwanzaaDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}