{"id": "a551099db999b4e3ffd4b9dab43e8b58", "url": "https://www.bonappetit.com/story/new-school-bakeries", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Technicolor Croissants and More Glimpses Into the Future of Pastries | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTechnicolor Croissants and More Glimpses Into the Future of PastriesThese are the new-school bakeries you need to check out now.By Leah MenniesApril 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailLately bakeries seem less like pit stops—a place to grab a scone on the way to the office—and more like destinations. People are traveling across town to try the crazy matcha croissants that are taking over the internet, or the culty morning buns that’ll make you forget you decided to go gluten-free. So why should you hit up a new-school bakery right now? Keep reading.The matcha-lemon croissant and the Ferrero Rocher croissant from Supermoon in NYC.\nPhoto by Alex LauWe’ve Totally Taken the Insta BaitIf you ’gram it, they will come. At least that seems to be the philosophy behind the surge in ultraphotogenic sweets you’re seeing, from jet-black doughnuts to Technicolor croissants. Just because a rainbow bagel photographs well doesn’t mean we want to eat it, but when the sweets taste as good as they look (Exhibit A: The matcha-lemon croissant from NYC’s Supermoon Bakehouse, above), we don’t mind being superficial.The counter at Austin's Le Politique, and their cinnamon rolls, chocolate tarts, and clafoutis.\nPhoto by Wynn MyersArchitectural Digest Would ApproveWhen designing the patisserie arm of Austin’s hipster-Gallic Le Politique, designer Melanie Raines wanted to evoke spaces like L.A.’s Bottega Louie and Paris’ Ladurée, filtered through a casual downtown lens. This means white Carrara marble counters, powder-blue tiled floors, and the pièce de résistance: hand-screen-printed wallpaper from Portland, Oregon, design studio Makelike. (Which you can buy!) “This isn’t a very fancy patisserie where you don’t want to bring your children,” Raines says. “The vibrant wallpaper really plays to that.”Get your very own cookie subscription from BK17 Bakery.\nPhoto by Alex LauSometimes They’re Not Brick-and-Mortar Bakeries at AllLevee Baking Co., New OrleansWilla Jean alum Christina Balzebre specializes in laminated pastries (like morning buns scented with Meyer lemon) and decadent vegan cookies (ahem, salty-chocolate-olive-oil) at her pop-up out of a shared space with Cajun restaurant Mosquito Supper Club.Third Culture Bakery, Berkeley, CAThe Bay Area’s baked good of the moment—the mochi muffin, a puffy, precious specimen containing rice flour, coconut, and pandan leaf—comes courtesy of this new wholesale venture, which sells to coffee shops throughout the area.BK17 Bakery, BrooklynGood news! You don’t even have to leave the house to try Sarah Owens’ dark chocolate-bee pollen lace cookies and cocoa-tahini bites. Her mail-order subscription service ships cookies straight to your door.The Pastry ArchetypesFor all the creativity happening at bakeries right now, there are a few pastry archetypes we’ve spotted (and eaten!) over and over again. Not that we’re complaining—the world could certainly use more morning buns.Who says everything spice can only top a bagel? Not Chicago’s Fat Rice.\nPhoto by Matt HaasThe Savory PastryBeets star in galettes at North Bakery in Providence, sea buckthorn sneaks into the muffins at Kantine in SF, and everything spice tops these doughy knots from The Bakery at Fat Rice in Chicago.We’ll take six of the crullers from NYC donut shop Du’s, please.\nPhoto by Alex LauThe CrullerCruller fever has taken hold in New York in particular, from the crazy popular glazed offerings at Daily Provisions to this corn powder–dusted, kaffir lime–infused specimen from Du’s Donuts.There’s cardamom in this morning bun from Machine Shop in Philly.\nPhoto by Stevie ChrisThe Morning BunIf you’ve had a great morning bun in Philadelphia, it’s probably been this cardamom-pecan beauty, made by Machine Shop Boulangerie and sold at the city’s coolest coffee shops.Bellecour in Minnesota knows that bigger is better.\nCourtesy of BellecourThe Giant CookieThe current cookie mantra: Bigger is better. Consider the huge strawberry lemonade cookie at Mañana in Austin or this oversize flourless chocolate one from Bellecour in Wayzata, MN.At Seylou, one of the alt grains is Danko Rye, a variety of Hard Red Winter Wheat grown by Heinz Thomet at Next Step Produce in Newburg, Maryland.\nPhoto by Scott SuchmanThey’re Ditching White Flour (and We Don’t Miss It)At Seylou in Washington, D.C., the directives are clear: No white flour, no white sugar. Pastry chef Charbel Abrache, the brains behind the millet canelés, explains why it’s worth all the effort: “Once you understand the grain, you will end up with something remarkable. The flavor is amazing. When I smell millet, I smell vanilla—it reminds me of crème caramel. Sorghum is more earthy…it works well with spices and chocolate. Sometimes you need rum or bourbon to give flavor to pastries. But I don’t need that anymore—I have all the flavor I need from the grain. There’s no going back.”Coffee in a Cayler Ceramics mug and the sumac-hibiscus-glazed cake from Brooklyn’s Golda.\nPhoto by Alex LauOf Course They Care About the CeramicsIf you’re getting a cortado with your sumac-hibiscus-glazed cake, there’s a decent chance it’s going to come in a custom ceramic mug. Take Brooklyn’s Golda, which teamed up with Calyer Ceramics for the cup shown here, or Seattle’s Sea Wolf Bakers, whose Tesha Karpoff mug will make your croissant brittle taste that much better.Speaking of morning buns...Explore Bon AppétitRestaurants + TravelPastryTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-03", "author": ["Condé Nast", "Leah Mennies"]}