{"id": "a569f3edc0959d5a659e23dfa8ce3131", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/restaurant-palaegade", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Restaurant Palægade Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenRestaurant PalægadeHead to Indre By to eat all the open-face sandwiches (and herring)FacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for a smørrebrød fix that feels more modern than Schønnemann (which we still love). But this design-district spot is just as plush—we can’t get enough of the classic-looking Scandi furniture, especially those chairs—without the tourists.ORDER THE: lobster salad smørrebrød topped with a panko-breaded fried egg and a teensy dollop of mayo and the herring assortment. Herring lovers get elaborate service: countless ramekins filled with several preparations of that very particular fish, plus classic accompaniments like capers, fried onion, and mayo. Overall, the menu lightens up the classics, sending out elegant plates of dark rye topped with, say, fried plaice with remoulade, or shrimps in mayo.THE VIBE IS: clubby and correct, with several generations of what look like architects, designers, and gallerists.PRACTICAL STUFF: Open every day for lunch (which is better), from 11:30 a.m. to 3 p.m., and dinner (except Sunday), from 6  p.m. to 9:30 p.m.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVERestaurant SchønnemannGet the OG Copenhagen experience at this Indre By *smørrebrød* destinationNomaThe next evolution of René Redzepi’s destination restaurant in RefshaleøenMirabellePlan a mini croissant- and yogurt-filled vacation at this café-like spot in NørreboroExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}