{"id": "a56db820e1a8f9ed7827849a6fd5cc36", "url": "https://www.bonappetit.com/recipe/stone-fruit-caramel", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Stone Fruit Caramel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueStone Fruit CaramelBy Sarah JampelMay 25, 20214.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'Mytrek BrownEmailPinterestPrintEmailPinterestPrintBelonging somewhere among jam, compote, and caramel sauce, this spoon-over-everything sweet-tart topping is made by thinning a caramel with fruit juice and vinegar rather than cream. The consistency of your final product will vary greatly depending on the nature of your fruit, like whether it’s super juicy or how much pectin it contains. Embrace the variance (and follow your instincts!)—it will taste great any which way. Mix and match the fruit and vinegar based on what sounds good to you and what you have on hand (maybe it’s plums and unseasoned rice vinegar, nectarines and sherry vinegar, or apricots and Champagne vinegar).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonMedium Saucepan$39 At AmazonCutting Board$10 At IKEAGlass Storage Containers$36 At AmazonIngredientsMakes about 1 cup12oz. ripe stone fruit (such as plums, peaches, nectarines, sour or sweet cherries, or apricots), pitted2–3Tbsp. vinegar (such as unseasoned rice, apple cider, sherry, Champagne, or red wine)½cup sugar1Tbsp. chilled unsalted butter, cut into pieces½tsp. vanilla bean paste or vanilla extract¼tsp. almond extract (optional)¼tsp. kosher salt, plus morePreparationStep 1Coarsely chop half of fruit and place in a blender along with any juices that have accumulated on cutting board. Chop remaining fruit into ½\"–1\" pieces (no need to chop if using cherries); set aside.Step 2Add 2 Tbsp. vinegar to fruit in blender. Purée until mostly smooth. Taste and add up to 1 Tbsp. more vinegar to brighten if needed. You should have ½–¾ cup, depending on the juiciness of your fruit.Step 3Pour sugar in an even layer in a medium heavy saucepan set over medium heat and cook, undisturbed, until most of the sugar is melted. Stir melted sugar gently into unmelted sugar until all of the sugar is melted. Continue to cook, without stirring, until caramel is amber in color, 7–10 minutes total. Remove from heat and immediately pour in fruit purée, stirring constantly with a heatproof rubber spatula. Don’t be alarmed if mixture seizes. Set back over medium heat; cook, stirring, until smooth, about 2 minutes.Step 4Add reserved chopped fruit, increase heat to medium-high, and cook, stirring, until caramel is bubbling and thickened slightly and fruit is warmed through, 2–5 minutes, depending on fruit. Remove from heat and stir in butter, vanilla bean paste, almond extract (if using), and ¼ tsp. salt. Taste and season with more salt if needed. Let cool slightly before serving.Do ahead: Fruit caramel can be made 3 weeks ahead. Let cool. Transfer to an airtight container; cover and chill.How would you rate Stone Fruit Caramel?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis recipe is terrific, and easy.  Does the author or anyone out there know whether there is any reason why I couldn't make this in a larger quantity and home-can it for a longer shelf life?AnonymousSt. Louis, MO8/15/2021This has changed my breakfast routine forever.  A topping for overnight oats is the hands-down favorite of everyone in my family.  But it's also good on yogurt, warm oatmeal and cream of wheat.  I've done just plums, plums and cherries, just cherries...\nIt's the perfect blend of sweet, tart and fruity.  AnonymousLittle Rock, AR6/30/2021This... is a gastriqueAuguste EscoffierFrance5/29/2021Explore Bon AppétitSauceFruit DessertDessertJamSpreadsStone FruitFruitVanillaHerbs & SpicesSummerGluten-FreeSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Sarah Jampel"]}