{"id": "a57a5ebd2b268052ad4e03932ce9ea45", "url": "https://www.bonappetit.com/story/natural-dyes-upstate", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "These Natural Dyes Are Going on Everything We Own | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Want to Use These Natural Dyes on Everything We OwnHere's how to enter to get one of Upstate's new dye kits for free.By Zoë SessumsFebruary 22, 2018FacebookTwitterEmailPhoto by Pippa Drummond, Art Direction by Ryan GieseFacebookTwitterEmailIf you fell in love with the rose-colored jumpsuits and vivid indigo sarongs when we last featured Upstate, we have good news. This week, Upstate founder Kalen Kaminski is launching a line of natural dyes, which we're immediately buying in every color so we can recreate her beautiful designs at home. But before you buy, listen up: Kaminski is giving a few kits to Healthyish readers for free! Read on for more details and how to enter to win.The six-step kits, which retail from $48 to $52, each include the dye formula, a silk hankie, protective gloves, string, and a manual on shibori—the Japanese dyeing technique that produces those better-than-tie-dye patterns on fabric. The tin it all comes with can be used to dye the hankie, then reused again and again.Kaminski, who teaches shibori and natural dye workshops around the country, has been getting inquiries about home dyeing for years. \"I have received emails on the regular from people asking how they can work on this process at home and not be intimidated by it,\" she said. \"It seemed like the next step to make an easy to use kit so anyone can do it in six steps.\"The dye kit in action\nPhoto by Pippa Drummond, Art Direction by Ryan GieseThe kits come in three colors, inspired by scraps of produce and spices: indigo, turmeric (made from turmeric and chamomile), and rose (made from hibiscus flowers and sandalwood). Kaminski sources these plant-based ingredients from sustainable manufacturers in the U.S., and concocts the dyes in her Brooklyn studio. Each kit can dye up to 5 yards of fabric—though if you use a stock pot, a little bit goes a long way. \"You can dye anything from five minutes to three hours to achieve varying shades of color,\" Kaminski says.So, now that you’re jazzed about becoming your own textile designer, here's how to enter to get a kit for free: Sign up for the Healthyish newsletter (It's fun and not spammy, we promise!), and introduce your friends, your parents, and your co-workers to Healthyish too. Make sure to sign up before Sunday, when we'll pick three winners to get a kit of their choice. And if you're not a winner, you can still buy a kit at Upstate.Click here for full contest rules.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleYou Can Totally Dye Your Clothes With FoodBy Ashley MasonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-22", "author": ["Condé Nast", "Zoë Sessums"]}