{"id": "a58432f02270fb8bb6a234136c7efd4c", "url": "https://www.bonappetit.com/recipe/potluck-chopped-salad", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Potluck Chopped Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssuePotluck Chopped SaladBy Yia VangApril 14, 20204.7(6)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangEmailPinterestPrintEmailPinterestPrintThis recipe is from chef Yia Vang at Union Hmong Kitchen in Minneapolis. This style of salad is a staple of Hmong potlucks. It was one of the first things that new Hmong immigrants to the Midwest learned to make from the families who sponsored them in the 1980s and ’90s.Ingredients4 servings4large eggs1garlic clove, finely grated½cup buttermilk¼cup mayonnaise1Tbsp. chopped dill¼tsp. Aji-No-Moto umami seasoning \t(MSG; optional)1romaine heart, quartered lengthwise, cut crosswise into 1\" pieces1small carrot, peeled, cut into matchsticks1medium radish (such as watermelon or black), cut into quarters through root end, thinly sliced1½cups mixed tender herb leaves (such as Thai basil, cilantro, dill and/or mint)PreparationStep 1Bring a medium pot of water to a boil. Carefully lower eggs into water with a slotted spoon and cook 8 minutes. Transfer eggs to a bowl of ice water and let cool. Remove eggs from ice water, pat dry, and peel. Slice eggs crosswise and set aside for serving.Step 2Whisk garlic, buttermilk, mayonnaise, dill, and Aji-No-Moto seasoning (if using) in a large bowl to combine; season with salt and pepper. Add romaine, carrot, radish, and herbs and toss to coat; season with salt.Step 3To serve, tuck egg slices in and around salad.How would you rate Potluck Chopped Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleYUM!! We all loved this salad! My daughter kept saying that it tastes like summer with all the fresh herbs. It was a lot of dressing, but I like the extra just pooled at the bottom of my bowl and didn’t seem to be overwhelming. I used the tiniest clove of garlic that O had on hand since it was raw in the salad, and that was perfect. I can’t wait to be able to bring this salad to an actual potluck. thank you!carolinasfinaChicago, Illinois 4/26/2020I thoroughly enjoyed this salad! I wish I would've split the dressing between my big salad bowl and a jar to save for later. The dressing is delicious but there is bit too much of it for the quantities of vegetables listed. ayycraySeattle4/19/2020Explore Bon AppétitSaladLettuceLeafy GreensVegetableRadishEggButtermilkOther IngredientsSpringEasyQuickWeeknight MealsSideNut-FreeGluten-FreeVegetarianKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Yia Vang"]}