{"id": "a598c29ef54cc2f493cbc04ba0bc2c4c", "url": "https://www.bonappetit.com/story/what-is-a-potato", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "What Is A Potato, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is A Potato Anyway? Come on, we've all wondered it!By Amiel StanekNovember 9, 2021FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailPotatoes! You know them, you love them. But what is a potato, really? And where did potatoes come from? Potatoes, quite simply, are the tuber that changed the world. Originally domesticated by Indigenous peoples of the Andean highlands and brought back across the Atlantic by Spanish colonizers in the 16th century, many researchers argue that the humble potato contributed to the rise of modern forms of agriculture in Europe. Today it’s the world’s fifth-largest staple crop. For our part potatoes are far and away America’s most consumed produce item—we eat nearly 50 pounds per person each year. (Unsurprisingly, tomatoes take the number-two spot; what’re french fries without ketchup?)So what is a potato exactly?Known as Solanum tuberosum, potatoes are a tuber (not the same as a root vegetable like, say, a radish) that fall into the “starchy vegetable” category. (So yes, potatoes absolutely count as a vegetable according to the USDA.) Typically grown in cooler climates and seasons, they come in a vast variety of sizes, colors, shapes, and textures.Potatoes aplenty!\nPhotograph by Isa ZapataWhat potatoes should I buy?The wide world of spuds is staggeringly diverse—Peru’s International Potato Center has preserved close to 5,000 unique varieties. But, broadly speaking, your local grocery store is likely to have a few main types on offer, each suited to different preparations:FlouryThe russet, a floury friend.\nPhotograph by Isa ZapataRelatively low in moisture and high in starch, with dark, matte skins, floury types like russets and Idahos cook up light, fluffy, and a little crumbly, which makes them ideal for a classic baked potato or a smooth, creamy mash. Their starchiness means that these potatoes also lend themselves well to fried applications, like crispy-on-the-outside, creamy-on-the-inside french fries and potato pancakes.WaxyIn contrast to their floury counterparts, waxy potatoes tend to have thinner, shinier skins and dense flesh that’s moister and lower in starch. Red Bliss, new potatoes, fingerlings, and a lot of the smaller, cuter varieties fit into this category. These hold their shape well when cooked and are therefore perfect for applications where that’s a priority—think potato salad, gratin, roasted potatoes, and good old-fashioned boiled-and-buttered spuds.Waxy—but like, in a good way!\nPhotograph by Isa ZapataAll-PurposeTwo words: Yukon Gold. This storied variety and other floury-waxy hybrids have been bred to be somewhere in the middle. The Goldilocks of potatoes, they’re not too crumbly, not too dense, and versatile enough to work in almost all preparations. Boil them. Mash them. Roast them. Stir-fry them. You name it, these potatoes can do it.…but wait, there’s more!Having ready access to supermarket potatoes you know will perform as expected is a beautiful thing. But if you love potatoes as much as we do, you’d be missing out if you didn’t play the field. (Remember: 5,000 varieties.) The fall farmers market can be a great place to try out delicious and idiosyncratic heirloom varieties you’re less likely to find in stores, like purple-fleshed Magic Mollys, creamy Russian Bananas, and adorable pink Red Thumbs. And if you’re not sure how to prepare them, just ask whoever’s selling them for their favorite method.Does buying organic potatoes matter?According to the Environmental Working Group, potatoes retain fairly high levels of pesticides relative to other kinds of produce (they grow in the dirt, so it kind of makes sense), so it's best to shell out the extra buck for organic if you can.Potato, potahto, gimme that recipe:Perfect Baked PotatoCrisp on the outside, pillowy on the inside, and up for dancing with any savory flavor in your fridge or pantry. View RecipeExplore Bon AppétitcookingPotatoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-09", "author": ["Condé Nast", "Amiel Stanek"]}