{"id": "a59e77299711f0a8e4bc44cd7a3b9872", "url": "https://www.bonappetit.com/recipe/peach-and-sesame-crumble", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Peach and Sesame Crumble Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPeach and Sesame CrumbleBy Sarah JampelAugust 4, 20194.8(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolEmailPinterestPrintEmailPinterestPrintTriple the sesame, triple the fun. Tahini teams up with toasted sesame seeds and toasted sesame oil to balance the sweetness of late summer peaches with rich, earthy nuttiness. The only tricky part of this recipe is calculating how much cornstarch to use: You’ll want to use the full amount for super ripe peaches and skip it entirely if they’re not so juicy. But when in doubt, err on the side of less: If you use too much starch, your crumble might be gloopy; if you use too little, you’ll just have extra juices (and that's not so bad). This crumble is just as good warm from the oven with a scoop of ice cream as it is for breakfast the next day atop a bowl of yogurt—so rejoice if you have leftovers.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAParing Knife$10 At Amazon13x9\" Baking Dish$20 At AmazonMicroplane$16 At AmazonMedium Bowl$17 At AmazonSpatula$12.99 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketLarge Bowl$18 At AmazonWhisk$10 At AmazonIngredients6–8 servings2½lb. peaches (6–7)1lemon⅓cup plus 1¼ cups sugar1¾tsp. kosher salt, divided⅓cup raw white sesame seeds1cup all-purpose flour½cup (1 stick) unsalted butter½tsp. ground cinnamon⅓cup tahini2tsp. toasted sesame oil1tsp. (or more) cornstarch (optional)Vanilla ice cream (for serving; optional)PreparationStep 1Place a rack in top third of oven; preheat to 375°. Now prep your peaches. These should be some of the sweetest, most fragrant peaches you can find. Better peaches make for a better peach crumble. (If you've got peaches that aren't ready, place them in a brown paper bag with a banana, then check back every day. The banana will speed up the ripening process.) Slice 2½ lb. peaches (6–7) in half with a chef’s knife. Using a paring knife, cut around pits; pry them out if necessary (\"clingstone\" peaches have pits that cling to the flesh, whereas \"freestone\" peaches' pits can be easily pried out). Cut each peach half in half (so you have peach quarters), then cut each quarter into half twice more (you want 4 thin slices from each quarter, or 16 thin slices from each peach). As you go, transfer peach slices to a 13x9\" baking dish.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Zest 1 lemon into a medium bowl; set aside.Step 3Sprinkle ⅓ cup sugar, 1 Tbsp. fresh lemon juice (from the zested lemon), and ¾ tsp. salt over peaches. Toss to gently combine, then let sit while you prep the topping—aim for about 20 minutes. The maceration draws the sugar out of the fruit, making the peaches taste even peachy-er.Step 4Spread ⅓ cup raw white sesame seeds on a rimmed baking sheet or in an ovenproof skillet. Toast, tossing halfway through, until golden brown all over, 12–15 minutes. Toasting the sesame seeds yourself makes for a deep, nutty richness that store-bought toasted sesame seeds cannot match. Immediately transfer to a large bowl (so they don’t keep cooking on hot baking sheet).Step 5Add 1 cup all-purpose flour and remaining 1¼ cups sugar and 1 tsp. salt to bowl with seeds. Whisk to combine.Step 6Add ½ cup (1 stick) butter and ½ tsp. ground cinnamon to medium bowl with lemon zest. Microwave until butter is melted, about 1 minute. Add ⅓ cup tahini and 2 tsp. toasted sesame oil and whisk to combine.Step 7Pour tahini-butter mixture into dry ingredients, then mix until dry ingredients are incorporated and mixture holds together when you squeeze it in your hands.Step 8Assemble! The peaches should look juicy. And now you determine whether you’re using 1 tsp. (or more) cornstarch. If peaches are not-so-ripe, skip it entirely. If they’re perfectly ripe, use 1 tsp. And if they’re really juicy, use 2 tsp. Gently toss to combine.Step 9Using your hands, squeeze crumble topping into big hunks, then break off uneven pieces and scatter over peaches.Step 10Bake crumble until topping is well browned and firm and peaches are tender with bubbling juices, 60–70 minutes.Step 11Serve warm with vanilla ice cream (if using).How would you rate Peach and Sesame Crumble?Leave a ReviewTell us what you thinkReviews (18)Back to TopTriangleFabulous! I've also made it with pears, also yummy. We love this recipe!Diana TPortland, OR11/10/2020Too much tahini/sesame flavor. This overpowered the flavor of the peachesclshimer598697Durham, NC9/7/2020SO delicious! New favorite summer recipe. Anonymous8/28/2020Incredible!! Definitely a new summer staple for me. I only used 2/3 of the sugar required and it was more than enough. I also added a dash of cardamom, it was a great complement. AnonymousNew York8/26/2020Excellent recipe! For those who don't have Tahini - I added sour cream and it worked. Honestly, I don't know much I added because I added maybe a tablespoon at a time into the mixture until it reached the right consistency for the topping. Make sure it's not too wet because it will melt into the peaches when it's in the oven. Also, leave your peaches in the sugar mixture long enough so you know how much cornstarch you will need! \nMy family members were not so most open-minded about the sesame seeds but they all agreed that it compliments the dish sooooo well. I absolutely loved this recipe!!! AnonymousNevada8/12/2020My mom used to make a peach crumble when I was growing up that I LOVED, but as an adult I've found it too sweet and one-dimensional.  This recipe is exactly what I wanted it to be - an updated version of that.  The sesame is not overpowering, but provides a nice, almost bitter, counterpoint to the sweetness of the peaches.  The only change that I made was from cinnamon to cardamom (a personal preference).  I will definitely look for other uses for this wonderful streussel! Anonymous8/5/2020Didn't have enough sesame seeds so used a mixture of sesame seeds + almonds. Added cardamom and cinnamon to the filling. Cut the sugar back a TON so it was more balanced. Turned out really goodAnonymousSouth Carolina8/3/2020this was really good! used a mixture of sesame seeds and almonds, added cinnamon and cardamom to the peaches, and cut the sugar a TON so it was balanced. Anonymous8/3/2020I love tahini/sesame and thought that this recipe sounded interesting.  I made it for a gathering with a few friends.  While the outcome wasn't bad, many thought that the tahini and peach combination was odd (\"it's not bad, but . . .\").  The combination *was* unusual but overall the sesame flavor detracted from the lovely peaches.  I'll make a different peach dessert next time.stevenhbBoston area7/29/2020What is more quintessentially American summer than peach crisps and cobblers? I gave the recipe a whirl. It's easy to follow and understand (I say going from the magazine version, these little video clips are great for visual learners too!), and pretty straightforward. My house immediately started smelling like baked peaches five minutes into baking time, which really built up anticipation as bake time is an hour. \n\nThe end result is a thin, crispy, gooey crumble (not cobbler, important distinction) that pairs perfectly with vanilla ice cream. There's nothing that quite matches the mouthfeel of cold, melty ice cream and warm, gooey peaches and streusel. Sesame's three-way presence in this dish really added a nice dynamism to the dish. This wasn't syrupy, it wasn't sticky sweet. In the whole recipe, less than 2 cups of sugar are added, which is pretty low for most summer baked desserts. The flavor of the peaches is emphasized, but not overridden with processed sugars. \n\nI made mine gluten-free to fit my own needs, and the strudel actually held (see step 7). You couldn't tell it was gluten-free either, which was a big win for me. (I used my ride or die, Bob's Red Mill 1-to-1 Baking Flour as a sub). I also added a little more cinnamon to the top of it before putting it into the oven. When plating with ice cream, I garnished with roasted sesame seeds. When eating with plain full-fat Greek yogurt in the morning, I added a little extra dash of cinnamon. You could also try garnishing with raw turbinado for a little extra sweetness. I'll definitely make this again. \n\nP.S. To the Anon from Louisiana, you put those sesame seeds in with the dry ingredients in step 5. smanthey141775Columbus, OH7/21/2020quick question-- what are we supposed to do with the sesame seeds, use them as garnish? or mix in with the crumble topping? maybe I missed but I did reread the recipe a bunch of times. regardless--- this recipe is freaking fabulous, I couldn't stop eating the raw crumble before it even got in the oven. AnonymousLouisiana6/21/2020You know when you see a recipe, and you imagine it and are almost certain it's not going to live up to your expectations? This is not one of those recipes. I first saw this recipe months ago, and the idea of making it popped in and out of my mind until finally I got my hands on some peaches, and with each of these thoughts came the craving. Finally, peaches in hand, I made it, and it actually far- from here to Timbuktu- exceeded my expectations. Not only did I love it, but so did the rest of my family. I made it exactly as listed, but the peaches I got ended up being a little bit on the smaller side and about half a pound short weight-wise, so I baked it in a smaller (8x11) baking dish; still came out amazing. I'm going to have a hard time convincing myself to wait before I make this again.AnonymousCocoa, Florida4/28/2020I made this with some pretty low-quality peaches and I was still blown away by how good it was! The crumble's texture and flavor paired so well with peaches, I would've never thought to combine them, and I can't wait to make this again the next time I see peaches on sale!dsasalaBuffalo9/21/2019Oh my gosh. I just took this out of the oven. Made it for my partner bc he likes fruity dessert. Typically I just want chocolate etc. This was RIDICULOUS. After cooling I wanted to try and it is unreal. Highly recommend with a great ice cream (Philly local Zsa’s sweet cream vanilla is the best with it). AnonymousPhiladelphia9/4/2019This is probably my favourite peach dessert to make ever? The sesame pairs SO WELL with the peach it's unbelievable. I will 100% be making this again!gabdarToronto8/20/2019Explore Bon AppétitCrumbleFruit DessertDessertPeachStone FruitFruitTahiniCondiments, Sauces & PastesSummerEasyBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-04", "author": ["Condé Nast", "Sarah Jampel"]}