{"id": "a5a0ce486f76d80bc0b59d87c3e14a63", "url": "https://www.bonappetit.com/story/making-perfect-thanksgiving-issue", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Our Most Perfect Thanksgiving Meal Started as a TV Show | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOur Most Perfect Thanksgiving Meal Started as a TV ShowThe turkey will be televised.By Adam RapoportNovember 5, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.When you work at a food magazine, Thanksgiving is your Groundhog Day. Same holiday every year. Gotta have turkey on the cover, and there better be mashed potatoes and gravy and stuffing and cranberry sauce and some sort of side that feels new but not, you know, too new.That last part, I guess you could say, is the mission for each November issue of Bon Appétit: Reinvent something that no one really wants reinvented.At BA we start percolating ideas in July, ensuring we have enough time to develop recipes, stage photo shoots, and get the whole thing to the printer and to your mailbox in time for you to start percolating.But this year, before we could sit down at some oversize conference table to debate russets versus Yukon Golds or whether we wanted jiggly cranberry sauce or tart relish, the BA video team cornered me: What if we based the magazine on a video? they asked. What if we shot a six-part series starring our test kitchen editors in quest of the perfect Thanksgiving meal?Hmm...Want this letter before it hits the website? Sign up for our newsletter!Our old-school meets new-school cranberry sauce.\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiOn one hand, it was exactly the kind of tradition-bucking suggestion that makes you recoil. Like when your progressive-minded sibling announces that they’re bringing an autumnal quinoa salad this year.But on the other hand, it was also the kind of idea that jolts you awake, that rekindles your love of the year’s biggest food holiday and reminds you that traditions don’t have to calcify—they can evolve.So we set about filming Making Perfect: Thanksgiving. We challenged our test kitchen editors turned YouTube stars—Carla and Molly—to discover if it’s possible to make creamy, buttery mashed potatoes any more perfect than they already are (answer: yes—make them crunchy); we asked stuffing nerds Chris Morocco and Rick Martinez to ponder cornbread versus white bread, and so on and so forth.All the while, I sat there in my office, wondering how we got here. How, for our most tradition-suffused issue, did we agree to rely on a video series as our lodestar?But then I realized that every year our Thanksgiving Issue stars our editors. They’re the ones who develop the recipes, who write the stories, who implore you to add a dash of MSG to your gravy. Whether they’re debating all this in front of a camera or in a conference room, what’s the difference?So we took the video series (which launched on YouTube and our free streaming channel on October 15) and used its framework to build a mondo package. Each story unlocks the secret to the most indulgent mashed potatoes, the most tender turkey, the most impossibly moist stuffing, and plenty more. In other words, it’s exactly the kind of thing we do every Thanksgiving (see Groundhog Day).Well, maybe not exactly. When it came time to conceive the cover, we made the shoot as much of a lift as the Thanksgiving meal itself. The issue features eight covers, each with a member of the Making Perfect team holding the same flawless spice-rubbed roast turkey.Our 4.5 million YouTube subscribers will recognize Carla and Molly and Andy and Rick and Christina and Brad and Chris and Claire, and our 1.6 million print subscribers will get their cover turkey. Turns out you can give the people what they want and something new at the same time.Get the recipes:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeExplore Bon AppétitAdam NewsletterThanksgivingRead MorecookingThe Perfect Thanksgiving Mashed Potatoes and Gravy Have ArrivedBy Alex BeggscookingEverything That Goes Into Making the Absolutely, Positively Perfect Thanksgiving TurkeyBy Alex BeggscookingOur Nostalgic, Fancy, and Kinda Polarizing Cranberry Sauce Is HereBy Alex BeggscookingThe Perfect Thanksgiving Stuffing: There Will Be Corn NutsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Adam Rapoport"]}