{"id": "a5aac04fe1aa9395f65a02514f368b7b", "url": "https://www.bonappetit.com/recipe/doogh", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Doogh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFizzy Mint DooghBy Andy BaraghaniAugust 24, 20204.3(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Tami HardemanEmailPinterestPrintEmailPinterestPrintDoogh, a salty-tangy Persian yogurt drink, is the perfect antidote to a humid summer afternoon. It’s traditionally made with dried mint (and sometimes dried rose petals and/or ground black pepper), but this recipe employs fresh mint for a boost of bright flavor and color. This drink can be made with flat water, but club soda adds a refreshing fizzy finish. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.Ingredients4 Servings2cups plain whole-milk yogurt (not Greek)1Tbsp. dried rose petals (optional)1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½cup (packed) mint leaves, plus sprigs for serving2cups club sodaPreparationStep 1Blend yogurt, rose petals (if using), salt, and ½ cup mint leaves in a blender until only tiny flecks of mint remain. Pour in club soda and mix with a fork or wooden spoon, scraping down sides of blender, until everything is incorporated.Step 2Pour doogh among 4 iced-filled glasses and garnish with mint springs.How would you rate Fizzy Mint Doogh?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI loved this recipe👍GillianToronto Ont Canada9/6/2021Explore Bon AppétitCold DrinkDrinks AllPersianMiddle EasternMintHerbs & SpicesYogurtOther IngredientsSummerEasyQuickDrinksNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-24", "author": ["Condé Nast", "Andy Baraghani"]}