{"id": "a5b0163f7624224353dff0821436fb55", "url": "https://www.bonappetit.com/recipe/seeded-whole-wheat-banana-bread", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "Seeded Whole-Wheat Banana Bread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSeeded Whole-Wheat Banana BreadBy Lindsay Maitland HuntJanuary 18, 20184.4(11)Read ReviewsTriangleEmailPinterestPrintLinda PuglieseEmailPinterestPrintEmailPinterestPrintLindsay Maitland Hunt, author of the cookbook Healthyish (no relation to our site!), writes: \"I absolutely LOVE banana bread, but so often it’s as sweet as a cake and too oily. That’s good for special occasions, but for weekday mornings, I want a slice that feels mostly wholesome. That’s the 'ish' in Healthyish.\"Healthyish by Lindsay Maitland Hunt, published by ABRAMS (c) 2017.IngredientsMakes one 8½×4½\" loaf½cup (120 ml) neutral oil, such as canola, vegetable, or grapeseed, plus more for pan1½cups (6.4 oz./190 g) whole wheat flour, plus more for pan⅔cup (135 g) plus 1 tablespoon sugar¼cup (35 g) plus 2 teaspoons poppy seeds¼cup (46 g) plus 2 teaspoons sesame seeds2teaspoons baking powder½teaspoon kosher salt1cup mashed banana (from about 3 really ripe bananas)2large eggs, room temperature1teaspoon vanilla extract1cup (4 oz./120 g) pecans or walnuts, toasted, choppedPreparationStep 1Preheat oven to 350º. Oil and flour an 8½x4½\" baking pan. Mix 1 Tbsp. sugar, 2 tsp. poppy seeds, and 2 tsp. sesame seeds in a small bowl; set aside.Step 2Whisk baking powder, salt, and remaining 1½ cups flour, ¼ cup poppy seeds, and ¼ cup sesame seeds in a medium bowl.Step 3Whisk banana, eggs, vanilla, and remaining ⅔ cup sugar and ½ cup oil in a large bowl. Fold in dry ingredients until just combined. Stir in pecans. Scrape batter into prepared pan; smooth top. Sprinkle reserved poppy-sesame-sugar mixture evenly over.Step 4Bake bread until a tester inserted into the center comes out with just a few crumbs attached, 50–60 minutes. Let cool in pan 15 minutes, then turn out onto a wire rack and let cool completely. If you feel comfortable, carefully invert loaf over sink to catch any loose seeds and sugar.Step 5Do Ahead: Bread can be baked 3 days ahead. Wrap tightly in plastic and store at room temperature.How would you rate Seeded Whole-Wheat Banana Bread?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI love this recipe! It is so much more interesting than your standard banana bread!  A couple notes, you will need about 1.75-2 oz each of sesame and poppy seeds (I accidentally bought twice as much, so I will probably be making this again in the near future).  Also, I thought it wasn't quite sweet enough and drizzled honey on top, but my parents both thought it was plenty sweet and ate it just as is.  Bakes beautifully, mine looked almost exactly like the picture. AnonymousPittsburgh, PA6/29/2021Agree w/ MHARPER4 in that this is also the best banana bread I've possibly had E V E R. It's a huge hit w/ friends and family I've shared this with. I've definitely come back to this recipe a few times and love it still. godsyllaLos Angeles, CA4/6/2021I followed the recipe to a T and my loaf came out of the oven hearty and colored a gorgeous dark brown. The bread is dense, which makes just one or two slices enough for breakfast. The bread is dry for banana bread, but still plenty moist. It would go great in a bowl with some milk if you prefer a more moist slice. The seeds inside and the crust on top add a crunch to make the bread feel less cake-y and the lessened sweetness is perfect for making the banana more than just an ingredient for sugar. You can really appreciate the subtle banana flavor in this bread alongside the toasted nuts and seeds. While I love the lowered sugar, my mom put jam on hers to boost the sweetness of the bread. All around great, simple recipe that provides a quick breakfast for days ahead.adeline2000Harrisonburg, VA6/18/2020This is the best banana bread I’ve made possibly ever. I’m preg so I’ve been looking for nutritious baked goods to eat quickly in the morning and this is a winner. I used coconut oil because I love it in quick-breads and chia seeds instead of poppy because that’s what I had. I don’t normally like nuts in banana bread but toasted pecans really make this great. WILL make again!Mharper4Raleigh, NC1/11/2020Loved this, the perfect match with coffee for a not-too-sweet breakfast. It's also very customizable: I did a mixture of chia, flax, and sesame seeds and used chopped roasted cashews since I didn't have any pecans. The result was just as delicious.AnonymousBerlin, Germany11/1/2019What can I use instead of 2 eggs here? Are the eggs being used to rise the bread or texture?AnonymousIndia2/28/2019Great texture between the poppy seed crunch and the meatiness of the pecans.  Not too sweet and still a great breakfast/snack treat.Chicago1/30/2019Explore Bon AppétitBreadPoppy SeedSeedBananaFruitPecanNutWalnutEasySheet-Pan DinnersSnackDairy-FreeVegetarianHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-18", "author": ["Condé Nast", "Lindsay Maitland Hunt"]}