{"id": "a5b2c77925de0529df3fcfce06c75243", "url": "https://www.bonappetit.com/recipe/old-school-tiramisu", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Old-School Tiramisù Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2019 IssueOld-School TiramisùBy Chris MoroccoApril 16, 20194.0(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneEmailPinterestPrintEmailPinterestPrintThis tiramisú is moist but not wet, extra-fluffy, and made with real coffee (not espresso powder) and the perfect amount of dark rum. The trick to getting enough of the bittersweet coffee flavor into the ladyfingers is dunking them until they are soaked but removing them just before they start to fall apart. Squish them as needed to fit into the pan.Ingredients8 servings Vegetable oil (for pan)1½cups very strong coffee, cooled1Tbsp. dark rumPinch of kosher salt1Tbsp. plus ⅓ cup sugar1cup chilled heavy cream½cup mascarpone3large egg yolks24ladyfingersCocoa powder (for dusting)PreparationStep 1Lightly oil a 9x5\" loaf pan and line with plastic wrap, leaving plenty of overhang. Whisk coffee, rum, salt, and 1 Tbsp. sugar in a shallow dish until sugar and salt dissolve. Chill until ready to use.Step 2Whisk cream and mascarpone in a medium bowl just until smooth. Set aside.Step 3Pour water into a large saucepan to come 2\" up the sides and bring to a simmer. Combine egg yolks, remaining ⅓ cup sugar, and 2 Tbsp. water in a medium heatproof bowl. Set bowl over pan and reduce heat to low so water is at a bare simmer. Using an electric mixer (or a large whisk and a friend to fill in when your arm cramps), beat mixture on medium-high until eggs triple in volume and are extremely pale yellow and mixture forms a slowly dissolving ribbon when drizzled over itself in bowl, 5–7 minutes. Remove bowl from heat.Step 4Using clean beaters (or whisk), beat reserved cream mixture until medium peaks form. Add egg yolk mixture and gently fold until no streaks remain.Step 5Working one at a time, dip ladyfingers into chilled coffee mixture and let soak just long enough for them to soften, 1–2 seconds per side. Lay 8 cookies in prepared pan (it’s okay to smush them in a bit). Spread one-third of filling over. Layer another 8 soaked ladyfingers on top and spread half of remaining filling over. Repeat layers one more time with remaining ladyfingers and filling. Cover pan with plastic wrap; chill tiramisù until firm, at least 6 hours and up to 12 hours (longer is better; you’ll get cleaner slices and the layers will be fully set).Step 6Invert a small platter or a large plate over top of loaf pan, hold together tightly, and flip them over so plate is underneath. Set on a work surface and carefully remove pan. Peel away plastic wrap from tiramisù; discard. Generously dust tiramisù with cocoa powder. Serve in slices, dusting with more cocoa powder if desired.Step 7Do Ahead: Tiramisù (without cocoa powder) can be made 3 days ahead. Keep chilled.How would you rate Old-School Tiramisù?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleOL from Europe: 1 cup equal 250mL, so 1 1/2 cup is 375mL. JudithMontreal9/23/2021OL from Europe - this recipe apparently comes from America so you will have US measurements.  We have the same problem here with European recipes that are in metric.  Guess you just have to find a conversion table.  Good Luck!Anonymous3/30/2021OL-Europe: One cup is 8 ounces. One and a half cup is 12 ounces. This measurement is not critical because you will not use all of the coffee since it is just for dipping the ladyfingers. The metric system is easier to use but there may be a website for an easy conversion to metric equivalents. In this case, use12 ounces to convert to metric system.AnnCalifornia3/30/2021The recipe I use came from my ex's Italian grandmother.  It is essentially the same but uses only mascarpone and whipped egg whites instead of yolks.  Could this be a regional difference?   I shamlessly changed the rum to kaluha.  CynthiaPark City, UT12/30/2020How much coffee is \"1½ cup\"? Seems like there is no one specific answer to that hence why you should STOP USING AMERICAN MEASURING UNITS IN ALL YOUR RECIPES \n\nThey're illogical and stupid and there is NO reason to not phase them out in favour of metrics so the rest of the world can follow as well\n\nPlease please please do it OlEurope12/30/2020Don't sleep on this recipe - it is the best way to make homemade tiramisu with minimal fuss. I have to refrigerate for the full 12 hours to keep its shape when cut - but worth the wait!TeddySan Francisco, CA11/20/2020What do medium peaks with mascarpone and whipped cream look like? The mascarpone  and heavy cream pretty much turn to a dry cottage cheese type consistency. I have to assume I’m doing something wrong, but next time I’m going to whip the cream separately. A learning experience but a waste of $20 in cream and mascarpone.AnonymousCincinnati 7/19/2020Holy sh*t! This is delicious. Thank you, based Chris Morocco. A show stopper for sure. And, a way to catch up on missed carbs in quarantine... if that was ever a problem.boulezLos Angeles5/3/2020Though there are a lot of steps it’s overall a simple recipe. This is a go to recipe for me! It’s got the best flavor and it’s always a hit. AnonymousPhiladelphia 12/5/2019Explore Bon AppétitDessertItalianEuropeanCoffeeAlcohol & Other DrinksMascarponeCheeseNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Chris Morocco"]}