{"id": "a5b90221426475f31a6148d686d65dce", "url": "https://www.bonappetit.com/recipe/pecan-rye-pumpkin-pie", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Pecan Pumpkin Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssuePecan-Rye Pumpkin PieBy Claire Saffitz and Brad LeoneOctober 15, 20194.0(67)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintImagine a pumpkin pie with pecan pie’s best feature—obviously, the candied nut topping. Now spike the custard with rye whiskey, up the flavor of the crust with rye flour, and voilà: pecan-rye pumpkin pie. We use Libby’s canned pumpkin because it’s reliably consistent, with an ideal water content, and few variations in flavor (and no, we’re not paid to say that). The egg wash added during the blind bake serves as a moisture-fighting barrier—a seal-tight guarantee that the bottom crust won’t get soggy. The rye flour will make the crust look darker than your standard pie dough. If it starts getting too dark while baking with the custard filling, tent it with a ring of foil. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8 servingsCrust¼cup rye flour or all-purpose flour1Tbsp. granulated sugar¾tsp. kosher salt1½cups all-purpose flour, plus more for dusting¾cup (1½ sticks) chilled unsalted butter, cut into pieces1large egg white, beaten to blendFilling and Assembly3large eggs1large egg yolk115-oz. can Libby’s 100% Pure Pumpkin¾cup heavy cream¼cup granulated sugar2Tbsp. rye whiskey1tsp. ground cinnamon1tsp. ground ginger¼tsp. freshly grated nutmeg¼tsp. ground cardamomSmall pinch of ground cloves8Tbsp. light brown sugar, divided3Tbsp. unsalted butter, melted, divided1¼tsp. Diamond Crystal or 1 tsp. Morton kosher salt, divided1½cups whole pecans1Tbsp. pure maple syrupWhipped cream (for serving; optional)PreparationCrustStep 1Whisk rye flour, sugar, salt, and 1½ cups all-purpose flour in a large bowl to combine. Add butter and toss to evenly coat. Working quickly and aggressively, use your fingers to rub butter into flour to create large shaggy pieces of dough (you want some pieces of butter that are flat and thin and some that are large and chunky). Drizzle 5 Tbsp. ice water over, running your fingers through flour mixture to evenly distribute. Knead dough in bowl until it starts to come together (it should look a little dry, but add more ice water by the teaspoonful if needed, just until dough comes together).Step 2Turn dough out onto a work surface and knead 1 or 2 more times, pressing to incorporate shaggy edges and any loose bits. Dust surface and dough lightly with flour to keep dough from sticking. Using your hands, form dough into about a 7x5\" rectangle. Using your rolling pin, gently tap and press dough to compact and tidy up edges. Roll out dough, dusting dough and surface as needed, until 3 times longer than when you started. Fold dough over onto itself in thirds like a letter to make a square. Wrap in plastic and chill until firm, at least 30 minutes.Step 3Preheat oven to 400°. Roll out dough on a lightly floured surface to about a 12\" round. Wrap dough around your rolling pin and unfurl into a standard 9\"-diameter pie dish. Gently lift dough so it slumps down into edges of dish. Trim overhang and crimp as desired. Line crust with parchment paper or foil. Place dish on a rimmed baking sheet and fill with pie weights or dried beans. Bake until edges of crust start to brown, about 20 minutes. Remove parchment and weights. Decrease oven temperature to 350° and bake crust until edges are golden, 20–25 minutes. Remove dish from oven and brush 1 Tbsp. egg white over bottom of crust. Return to oven and bake until crust is golden brown, 5–10 minutes (the egg creates a water-resistant coating that helps prevent the custard from making the bottom soggy). Reserve remaining egg white for topping.Step 4Do Ahead: Dough can be made 3 days ahead; keep chilled. Crust can be baked 3 days ahead; store tightly wrapped at room temperature.Filling and AssemblyStep 5While your crust is baking, combine eggs, egg yolk, pie filling, cream, granulated sugar, whiskey, cinnamon, ginger, nutmeg, cardamom, cloves, 6 Tbsp. brown sugar, 2 Tbsp. butter, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large bowl and blend with an immersion blender until smooth; try not to aerate. (Alternatively, you can whisk mixture well and blend in 2 batches in a blender until smooth and homogenous.)Step 6Pour into crust and bake pie (still at 350°) until filling is puffed and mostly set with just a slight wobble in the center when gently shaken, 40–45 minutes.Step 7Just before the pie is done baking, toast pecans on a rimmed baking sheet, tossing once, until slightly darkened and fragrant, 8–10 minutes.Step 8Whisk reserved egg white, remaining 2 Tbsp. brown sugar, and remaining ¾ tsp. salt in a small bowl until foamy, about 30 seconds. Add syrup and remaining 1 Tbsp. butter; whisk just to combine. Add pecans and toss to coat.Step 9Carefully remove pie from oven and top with pecan mixture, allowing any excess egg white mixture to drip back into the bowl. Return pie to oven and bake until filling is completely set (a tester or paring knife inserted into the center should come out clean) and nuts are not tacky to the touch, 8–10 minutes. Transfer pie to a wire rack and let cool, at least 2 hours. Serve with whipped cream if desired.Step 10Do Ahead: Pie can be baked 1 day ahead. Store uncovered in a cool oven or at room temperature.Photo by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiHow would you rate Pecan-Rye Pumpkin Pie?Leave a ReviewTell us what you thinkReviews (51)Back to TopTriangleHad no problems with this recipe, and it tastes delicious. Wish the measurements were in grams, but, whatever. Cook time was definitely a bit longer but I think it's because this is too much filling for a 9 inch pie (I made an extra mini pie with about a cup of the total filling). Agree with the reviews that say put the weights back in the crust during the blind bake after the egg wash.FenWashington, D.C.11/26/2021The first year I made this, it came out perfectly. I made it this week and I experienced the slumped crust everyone else mentioned. I'm going to chill the rolled out crust, in the pan, in the fridge for 30 minutes before baking, and I'm going to dock the crust before baking. Because of the crust slump, I had a lot of extra filling that I baked in little muffin tins. Also, if you go the \"Brad\" route and line the top of the pie with the nuts instead of dumping all of them on, 12 ounces is WAY too much. But they make a nice snack.NicoleArlington, VA11/26/2021made it for thanksgiving 2021. Came out way too salty and not very sweet. will cut back on salt in the crust next time, and up the sugar in the filling. Sherry CSan Antonio, Texas 11/26/2021Flour is given in volume quantities? C'mon now.\nRach4/1/2021Made this for Christmas. Everyone loved it! BeckyOregon12/26/2020Made this today (except for the topping because I accidentally burned my pecans) and it was delicious! The best pumpkin pie I've had. The crust was flaky and crumbly and the filling was very flavorful.\n\nThe recipe doesn't say to do so, but I would definitely chill the crust after rolling out and shaping into the pie tin. I did so for 30 minutes and didn't have any problems with the crust melting during the blind bake.Casey11/28/2020This was my first time making any type of pumpkin pie and it was amazing! Some of the other reviews about the crust made me nervous, but I had no problems. I did have to chill the dough for longer than 30 min though. The filling was so good–the perfect amount of sweetness and spices–and it was so smooth. I added a bit more of all of the spices, more like heaping teaspoon measurements, and the end result was absolutely perfect. We also made our own pumpkin puree and used about 1 3/4 cup to match one can of puree. The pecans on top are a nice touch, but definitely not necessary if you don't want the extra trouble. I'd say this is the best pumpkin pie I've ever had!AnonymousNorth Carolina11/27/2020Re shrinking pastry!  I wonder if the complainants overlooked the instruction to place pastry in refrigerator for 30min prior to baking  Chilling\nstops the pastry shrinking whilst being baked!  \n\nHave not made the pie as yet, but as in this great southern land - Australia, we do not as a rule,  use tinned pumpkin, I will roast  some pumpkin slices and then blitz them  in a food processor.   Roasting sweetens the pumpkin so I will leave  a review after I make the pie. Thanks for the recipe.Mazza Australia11/23/2020I went to pastry school and I can confirm this was far more difficult than I was anticipating. Crust melted during the blind bake. Will try again with a different crust recipe. AnonymousNY, NY11/9/2020Oof... I was so excited for this recipe but somehow it turned our wayyyy to salty. Perhaps weight in grams would have helped a lot here. AnonymousNetherlands6/8/2020So, I made this recipe when first published, and it was good.  I decided to bake this again, but more closely followed the instructions.  The only swap I made was regular flour and instead of rye whiskey, I used Grand Mariner.  It was fabulous!  Some of the other reviews miss this key component: The varying textures and flavors of the pie makes it an experience as well as flavor.  Make sure to egg wash the crust to keep it flaky, then using an immersion blender makes the pumpkin filling a true chiffon; next, when preparing the toasted pecan topping, follow the instructions for a savory sweet crunchy topping.  I followed with a stiff whipped cream which created a buttery mouth feel on top of crunchy, savory, flaky crust which was a party for my mouth!AnonymousMichigan12/29/2019made this the night before thanksgiving      my family loved itAnonymousstaten island ny12/7/2019I followed this recipe almost exactly.  I made the dough in the food processor and it was lovely to handle and work with.  The crust baked up very nicely with a flaky and crispy texture, and the egg white coating worked wonders to prevent it from getting soggy.  The filling was silky smooth like cheesecake with great flavor.  Using an immersion blender was genius!  I only give this 4 stars because of the pecan topping.  The flavor was very bland and really added nothing to the pie overall.  If anything it took away from the fantastic simplicity of the classic pumpkin pie.  I will definitely make this again, just without the topping. LyraRDVMMassachusetts12/4/2019I made this for my family thanksgiving and it was divine! I was apprehensive reading the negative reviews but didn't have any problems when I made it. I didn't modify anything except I didn't use rye flour - just AP flour instead. The cook time as stated in the recipe worked just perfect for me. riceanyoneWichita, Kansas12/3/2019Filling is excellent. I'd call this THE quintessential pumpkin pie (didn't make the topping BTW). IMO, the whiskey  does make a contribution to the overall background flavors, but it;s subtle enough that you could either leave out (correcting for the liquid) or sub in any of a number of other ingredients (rum might be interesting). The pie set up perfectly and on schedule (but I WAS using the convection setting)\n\nPie crust is okay, but agree with everyone else that there is no excuse to not use weight measurements--I'm sure that's a major contributor to all the negative reports here as everyone measures flours a little differently. I personally had to make 3 crusts until I got something that didn't \"melt\" during the blind bake.  AnonymousTennessee11/30/2019Explore Bon AppétitPieDessertAmericanRye FlourFlourPumpkinSquashVegetablePecanNutFallVegetarianBakingThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Claire Saffitz", "Brad Leone"]}