{"id": "a5bfde541df2fe4a6183b1dfc30605a1", "url": "https://www.bonappetit.com/story/cheese-eat-pregnant", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Wait, So What Cheese Can You Eat While Pregnant? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWait, So What Cheese Can You Eat While Pregnant?There's a lot of confusing advice about eating cheese while pregnant. We lay out the rules (and the risks).By Liz ThorpeApril 23, 2018FacebookTwitterEmailFacebookTwitterEmailI don’t remember what dietary advice my midwife offered when I was pregnant with my first daughter, but I clearly recall the directions my second time around. Maybe that’s because at the end of the standard “don’t consume” laundry list (no booze, hot dogs, deli meat, or sushi) I was told not to eat unpasteurized cheese, “like soft cheese or blue or…well. You know.”I wondered if I was supposed to know because I’d already had a kid, or because I was a cheese expert. Following that was the brief consideration that I should ask why unpasteurized cheese was de facto a bad idea. But I said nothing, instead imagining what every other pregnant woman was hearing and how confused she must be. It’s more than a little stressful when your health-care provider warns of impending doom to your unborn child if you ate…“you know.”The standard laundry list of pregnant lady non-consumables comes from the Food and Drug Administration (FDA) and United States Department of Agriculture (USDA). Together, these groups ensure the safety of our nation’s food supply and execute federal laws related to food. The American College of Obstetricians and Gynecologists agrees with their recommendations and so it is standard for ob-gyns, family physicians, and midwives to direct patients to avoid certain foods that might  bear a higher risk for Listeria.This higher risk is precisely why the FDA has very clear national laws about the production, importation, and sale of cheese: If a cheese is less than 60 days old, it must be made of pasteurized milk. If a cheese is more than 60 days old, certain varieties may be made of pasteurized or unpasteurized (often called raw) milk, because the raw milk cheese has aged long enough to kill any potential harmful bacteria.Pasteurization is the process of heat-treating milk with the express purpose of destroying potentially harmful pathogens, such as Salmonella, that the milk may contain. FDA rules promulgated in 1949 determined that should these pathogens be present in milk, they died off in cheese during 60 days of aging, hence the 60-day rule for cheese.So what does this mean for us cheese eaters? In the U.S., nearly all fresh (unaged, rindless) cheese—like mozzarella, fresh goat cheese/chèvre, ricotta, or feta—is pasteurized. It also means that 99 percent of soft, creamy, spreadable cheeses are pasteurized. Think Laughing Cow, Brie, Camembert, or Taleggio. Longer-aged cheeses (which will be firmer in texture, potentially even hard, dry, or grainy) may or may not be pasteurized. Cheddar, Manchego, and blue cheeses are readily available in both raw and pasteurized form.These legal technicalities became deeply relevant when my job as cheese-guide means helping a pregnant woman navigate a counter with 300-plus cheeses. What should she get? What’s safe? And here, things get a bit more complicated. Because, of course.Standard medical advice tells you to avoid unpasteurized cheeses and stick exclusively to the pasteurized ones. But given the 60-day rule, the pasteurized choices will be disproportionately soft cheeses, as in, the ones that some doctors suggest pregnant women to avoid. Soft cheeses are soft (and by U.S. law pasteurized) precisely because they are younger and higher in moisture. Microbiologically, soft cheeses are more hospitable environments for pathogens (like Listeria) than hard, dry cheeses. Bacteria need moisture to grow. They also thrive in low acid and low salt environments, which is precisely the condition of most pasteurized cheeses in the U.S.The other thing to consider about cheese is that, even when pasteurized, it can become contaminated by Listeria (or Salmonella or other pathogens) after it is made. Secondary contamination is a risk that can occur farther down the supply chain. Consider two very common circumstances: cheese sliced at a supermarket deli counter, or cheese cut at a retail counter. In either case, deli meat or another cheese that may be contaminated with harmful pathogens can spread bacteria with surprising efficiency if machinery or worker sanitation isn’t rigorously maintained.Before falling down the scary-food rabbit hole and concluding that the best answer is to eat nothing but air and purified water, let me share the perspective of Dr. Catherine Donnelly, Professor at the University of Vermont, and an expert on the microbiological safety of food (with a particular focus on Listeria monocytogenes): “Swiss-style hard cheeses [like Gruyère or Comté] and Italian-style grana cheeses [like Parmigiano-Reggiano or Grana Padano] have been determined by Food Standards Australia New Zealand [FSANZ; those countries equivalent to the FDA] to have equivalent safety to cheeses made from pasteurized milk, even though they are all raw milk cheeses.” It’s worth noting, too, that both Australia and New Zealand prohibit the import or sale of nearly all unpasteurized cheeses, regardless of age, so they’re not exactly lax on this topic. The hard cheeses noted by Dr. Donnelly have the combined effects of lack of moisture, high acidity, and high salt content that create, as she describes it, “a hurdle effect where pathogens can’t grow in the cheese or survive if they’re present in the first place.”Another helpful tip to consider for women craving soft, buttery cheese is to buy individual rounds of pasteurized cheese rather than pieces that have been cut from a larger wheel. These carry no risk of cross-contamination from cutting at the cheese counter. Look for mainstream Brie and Camembert brands available in eight- or nine-ounce rounds, like La Bonne Vie, Le Châtelain, or Président; or American artisan offerings like Jasper Hill Farm’s Harbison or Sweet Grass Dairy’s Green Hill.As Dr. Katherine McCleary, Clinical Assistant Professor of Family Medicine at Brown University Warren Alpert Medical School summarized, “Everything we do carries a little bit of risk so these decisions are ultimately personal.” I find it much easier to make a confident decision when I’m fully informed. So, to recap:The standard medical advice is to avoid all unpasteurized (a.k.a. raw milk) cheese.However, creamy, high-moisture cheeses (most of which are pasteurized) are microbiologically more hospitable to harbor or grow pathogens like ListeriaHard, dry, acidic, salty cheeses (that can be unpasteurized but aged for well over 60 days) are less likely to harbor or grow pathogens like Listeria.There are lots of aged pasteurized cheeses if you want to be doubly careful. Look for Aged Gouda (Beemster, Parrano, Prima Donna, or Reypenaer are all great brands), cheddar (Cabot Clothbound, Dubliner, Excalibur, or Old Croc are all good and readily available), Manchego, Parmesan (not Parmigiano- Reggiano), or Piave.But even these are not immune to the risks of cross-contamination; whole intact cheeses are.With this in mind, happy eating! High in fat and protein and rich in many nutrients except vitamin C and fiber, cheese is one of the best one-stop sources of nutrition out there. And if you’re like me, cheese comes in handy during a nine-month aversion to meat.Want more cheese content? Yeah, you do.Explore Bon AppétitCheeseCheese WeekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-23", "author": ["Condé Nast", "Liz Thorpe"]}