{"id": "a5bf4349342983f35bb6824486ee8679", "url": "https://www.bonappetit.com/recipe/istanbuls-famous-mackerel-sandwiches", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Istanbul’s Famous Mackerel Sandwiches Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueIstanbul’s Famous Mackerel SandwichesBy Yasmin KhanApril 20, 20214.6(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintWalking along the Bosporus in Istanbul, cookbook author Yasmin Khan recalls the iconic sight of men grilling fresh mackerel to make these sandwiches, known as Balik Ekmek. In her book, Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, you’ll find Khan’s interpretation of the recipe, which she says is great for feeding a crowd at picnics and cookouts. These sandwiches traditionally feature grilled mackerel (always fresh, never canned!), so if you can cook the fish outdoors over an open flame, we highly recommend doing so. Feel free to tweak the ratios of crunchy veg, but the dressing and mint are essential to cut through the mackerel’s intensity. Can’t find fresh mackerel? You can sub in snapper or black bass, but the flavor will be more mild.IngredientsMakes 2Dressing2Tbsp. extra-virgin olive oil2Tbsp. fresh lemon juice1Tbsp. pomegranate molasses½tsp. Aleppo-style pepper¼tsp. sumac1small garlic clove, crushedKosher salt, freshly ground pepper¼small red onion, thinly sliced into ringsMackerel and assembly2Tbsp. extra-virgin olive oil, plus more for drizzling26–8-oz. skin-on mackerel filletsKosher salt2ciabatta or other crusty rolls1medium tomato, slicedHandful of arugula leaves1medium carrot, cut into matchsticks½cup mint leavesPreparationDressingStep 1Whisk oil, lemon juice, pomegranate molasses, Aleppo-style pepper, sumac, and garlic in a medium bowl; season with salt and pepper. Let sit 5 minutes, then fish out and discard garlic. Stir in onion; let sit until ready to use.Mackerel and assemblyStep 2Heat 2 Tbsp. oil in a large nonstick skillet over medium-high. Season fish with salt and lightly coat flesh side with dressing. Cook fish, skin side down, until skin is browned and crisp, about 3 minutes. Turn over; cook until flesh side is browned and fish is just cooked through, about 2 minutes. Transfer to a plate.Step 3Drizzle cut sides of rolls with oil. Divide fish among bottom halves and top with tomato; season with salt. Add arugula, carrot, and mint to dressing and toss to coat. Mound on top of tomato; close up sandwiches.How would you rate Istanbul’s Famous Mackerel Sandwiches?Leave a ReviewTell us what you thinkExplore Bon AppétitSandwichTurkishMiddle EasternMackerelFishSeafoodEasyMainNut-FreeSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Yasmin Khan"]}