{"id": "a5d14d484ac011e477947f865e7c2bfc", "url": "https://www.bonappetit.com/recipe/warm-chicken-and-swiss-chard-salad", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Warm Chicken and Swiss Chard Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueWarm Chicken and Swiss Chard SaladBy Christian David ReynosoMarch 16, 20214.7(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by D’mytrek BrownEmailPinterestPrintEmailPinterestPrintRecipe developer Christian Reynoso describes this elegant warm chicken salad as the “grown-up version of a deli-case chicken salad I used to serve up as a teen.” But where the chicken salad of his youth had grapes and too-sweet mayo, this one is filled with bursts of chewy dates, briny olives, toasted almonds, blanched Swiss chard, and a bright citrus vinaigrette to tie everything together. Feel free to get creative by swapping in different nuts and dried fruits for the almonds and dates. Reynoso likes this salad with a side of torn baguette or sourdough rolls for making little open-face sandwiches.Ingredients4 Servings3Tbsp. raw skin-on almonds4skinless, boneless chicken thighs (about 1¼ lb.)Kosher salt2large bunches Swiss chard, preferably rainbow (about 1 lb.)1large shallot, thinly sliced1tsp. finely grated lemon zest2Tbsp. fresh lemon juice1Tbsp. white wine vinegar½tsp. cumin seeds, crushed5Tbsp. extra-virgin olive oil, divided, plus more for drizzling6Medjool dates, pitted, coarsely chopped⅓cup kalamata olives, pitted, coarsely choppedPreparationStep 1Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing once, until darkened slightly, 6–8 minutes. Let cool, then coarsely chop.Step 2Meanwhile, season chicken with salt; set aside. Remove ribs and stems from Swiss chard leaves. Tear leaves into 3\" pieces. Cut thicker ends of stems on a diagonal into 1\" pieces; discard thin ends.Step 3Combine shallot, lemon zest, lemon juice, vinegar, and cumin seeds in a large bowl; toss to coat. Season vinaigrette with salt.Step 4Heat 1 Tbsp. oil in a large skillet over medium-high. Cook chicken thighs, undisturbed, until golden brown underneath, about 5 minutes. Turn and cook until golden brown on other side and cooked through, about 5 minutes. Transfer to a cutting board; reserve skillet with pan juices. Let chicken rest 5 minutes, then cut into 1\" pieces. Whisk pan juices and 4 Tbsp. oil into vinaigrette.Step 5Cook Swiss chard stems in a large pot of generously salted boiling water until slightly tender, about 2 minutes. Using a slotted spoon, transfer stems to bowl with vinaigrette; toss well. Working in batches if needed, cook Swiss chard leaves until just wilted and bright green, 15–30 seconds. Drain leaves and let cool slightly. Squeeze out as much liquid as possible. Separate leaves and add to vinaigrette along with dates, olives, and chicken; toss well.Step 6Transfer salad to plates; drizzle with oil and top with almonds.How would you rate Warm Chicken and Swiss Chard Salad?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleAbsolutely delicious! The combination of flavors and textures is divine. Definitely entering the regular rotation!  I went a bit heavier on the lemon juice and zest and loved the citrus kick.Kym Los Angeles2/10/2022I love this recipe. Perfect for using the red chard that reseeded and came up during the winter in my garden. This is the second time I have made this recipe since receiving the April issue. Just LaDonaChico, CA4/24/2021I love this recipe AnonymousLos Angeles 4/12/2021Seriously so good and so easy! I think it may be one of my favorite recipes. I love the depth of the flavor profile. You can taste every ingredient. I added garlic and lots of cracked black pepper! emihowAustin, TX4/7/2021This is divine. I could eat this every night, and sometimes I actually find myself eating it every night!Joan HLos Angeles, CA4/6/2021This was OUTSTANDING. We got rainbow chard in our Misfits so it was kismet. Just magnificent from beginning to end.PattieNJ4/4/2021Explore Bon AppétitSaladChicken ThighChickenPoultrySwiss ChardLeafy GreensVegetableQuickWeeknight MealsMainGluten-FreeDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Christian David Reynoso"]}