{"id": "a5d2ff9582246ae0b7f13495f36d65bb", "url": "https://www.bonappetit.com/story/bria-vinaite", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Bria Vinaite's Before-Bed Routine Involves Cotton Candy Grapes and a Migraine Hack | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureBria Vinaite's Before-Bed Routine Involves Cotton Candy Grapes and a Migraine HackThe indie star has a favorite vape pen too.By Martine ThompsonAugust 9, 2018FacebookTwitterEmailFacebookTwitterEmailIn 'Going to Bed with...' we talk to the people we're crushing on about how they wind down before going to sleep.There are plenty of rules you’re expected to follow as a woman—from the way you look and speak to the career you pursue and what defines “success.” So naturally, when a woman unabashedly breaks those rules, it’s refreshing as hell. That’s part of the charm of Bria Vinaite, the Lithuania-born, Brooklyn-raised 25-year-old who burst onto the Hollywood scene (and into our hearts!) with her portrayal of a single mother raising her daughter Moonee in a Disney World-adjacent motel in the 2017 Oscar-nominated film The Florida Project.Since then, the vegetarian animal lover—expect to see the occasional home-cooked veggie dish on her Insta feed, along with carefree dancing videos, and relatable depression/anxiety/self-love memes—has been doing what many women her age yearn to do: exploring different fields that feed her creative spirit and making a living while doing so.Despite the whirlwind of excitement following Vinaite’s big debut, prioritizing solo time to recalibrate and pursue various other passions remains key. “No one’s going to take care of you but yourself, and when you start making that a top priority, your life changes,” she says like the friend who somehow always delivers that glass-half-full wisdom without sounding corny. “It’s making sure that you’re 100 percent or working on being the best you that you can be. When you’re feeling good, you can be a light to others and spread that happiness.” Here, Vinaite shares her favorite bedtime weed treats, how disconnecting from technology has made for a more peaceful night of rest, and the “wholesome” LaCroix drink she sips before bed.Bria's bedroom walls\nPhoto by Emma FishmanUnplugging with a bookI buy a lot of random books, and it’s really hard to immediately fall asleep if I’ve been staring at a screen, so reading and trying to put my phone away maybe an hour before I go to sleep are two of my go-to strategies before bed. I have a bunch of Paulo Coelho books, and I recently bought his book Warrior of the Light: Short Notes on Accepting Failure, Embracing Life, and Rising to Your Destiny, thinking it was going to be a book book, like a story, but it ended up being page-long short passages. I flipped to a random page and it was so accurate with the things I’ve been going through. They’re little life lessons I try to sleep on at the end of my day. It’s been really nice to have those be my last thoughts before I fall asleep.Joints at home; vape pens on the goI love to smoke a joint before I go to sleep: That’s my number one thing. I have two favorite products. If I’m in L.A., I always get the Dosist pens for sleep. They’re so perfectly dosed and if I take two pulls of that, I go right to sleep. It’s the most ideal option when I’m traveling. If I’m at home, I have special pre-rolls of indica joints that are for bedtime. That’s really relaxing. And lately I’ve been trying CBD pills from this great brand, Remedi. Literally every night that I took one I went to sleep within half an hour. So that’s something I’m definitely incorporating on nights where I feel like I’m not able to fall asleep because I’m anxious about the next day.A warm shower and a good body scrubA warm shower before bed to feel relaxed is always nice. I’m really into scrubs and use a green tea and lemon nourishing body scrub by Tocca. It wakes you up and has such a lovely, refreshing scent. It sounds like it would be weird or gross but I like it, and I’m a weirdo who’s so picky, so I feel like a lot of people would.Bria's seriously stocked skincare lineup.\nPhoto by Emma FishmanLaCroix and cotton candy grapesI am obsessed with LaCroix, and I drink so much of it. I’ll definitely have one before I go to sleep. Usually, I go for the grapefruit flavor but lately I’ve been drinking the unflavored one just because it’s called “pure” and I feel like that’s so wholesome. I’ve also been eating a lot of blueberries, and I’m really obsessed with cotton candy grapes. They have them at Whole Foods. They’re organic, and it’s the weirdest thing: they taste like blue cotton candy.Removing makeup before bed aka ~ growth ~I’ve struggled with skin issues my whole life. The one thing that changed 100 percent for me, from being younger to now, is I will not go to sleep until I’ve fully taken off my makeup and washed my face and put on every moisturizer. I really love Neutrogena’s acne mask. It’s cleared up my skin on a bunch of occasions. I just started using it again because my skin is acting crazy because of the weather. And I really love masks like GlamGlow and the mint mask from Lush. I just like minty and cooling things. Brooklyn, who plays my daughter in The Florida Project, her mom taught me a little mint hack. Back when I used to get bad migraines, she sent me peppermint oil and told me to put it on my temples, and it’s definitely helped me a lot.Explore Bon AppétitHealthyishGoing to Bed withInterviewsRead MorecultureAlok Vaid-Menon Winds Down with Vegan Junk Food and a \"Massage Drill\"By Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-09", "author": ["Condé Nast", "Martine Thompson"]}