{"id": "a5d7a468b900da50f787f11e10673224", "url": "https://www.bonappetit.com/story/what-is-a-ba-restaurant", "year": 2020.0, "month": 6.0, "day": 5.0, "content": "What Does It Mean to Be a BA Restaurant? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Does It Mean to Be a ‘BA Restaurant’?How we’re covering the food industry moving forward.By Elyse InamineJune 29, 2020FacebookTwitterEmailFacebookTwitterEmailThis newsletter has historically been Bon Appétit’s Letter from the Editor. Until we have a new editor in chief, the BA and Epicurious staff will use this platform to update you on the work we’re doing to move BA forward in our editorial coverage. This week, BA’s digital restaurant editor Elyse Inamine talks about how she’d like to see our restaurant coverage evolve.What is a BA restaurant? This question has haunted me since I started as the digital restaurant editor a little over two years ago. Categorizing something as a BA restaurant meant everything and nothing. It was a seal of approval, an invitation to the cool kids table, but under very vague terms. The one time I asked, I was told I had to figure it out for myself, like I was a literary heroine ready to embark on a journey of self-discovery, lol. Eventually, I figured it out: A BA restaurant is a restaurant our staff liked.I’m a fourth-generation Japanese American and one of a handful of BPOC editors. Most of our staff is white, straight, upper-middle class, and urban-dwelling. Early on, I noticed how they gravitated towards the same aesthetic, cuisines, and chefs—and how little we had in common. During meetings, the room swelled with joyful recognition and loud approval as stories centering those benchmarks were pitched. My ideas fell with a thud on the cutting room floor, no cushion of mutual experience to buoy them. But I felt this most acutely with restaurant coverage. Not only did restaurants need to pass through this groupthink sieve of approval, but I did as well. I was told I didn’t have the right voice, the right taste. So I tried to change. For so long, I had to shapeshift my ideas, my writing, myself to become the BA restaurant equivalent of a staffer. Not anymore.Now, as needed change demanding racial justice spreads across the country and within BA, I hope to use our brand’s privilege to be more inclusive, just, and diverse. Instead of swooping into long-standing conversations about the intersectionality of food, politics, race, class, and gender when it’s “convenient,” I want us to stay invested in the issues our industry faces by covering them often and regularly. I don’t want us to only talk about undocumented workers after Trump erodes their safety and character on Twitter but as long as their labor is exploited in restaurants and meat processing plants. I want to expand who gets to tell these stories by asking not just chefs but porters, sous-chefs, and activists to speak, and widen our pool of freelancers to be more diverse and inclusive.I’m taking a hard look at how we do the Hot 10, our annual list of the best new restaurants in the country. I’m working on establishing a new process that acknowledges our biases when it comes to the restaurants we choose to cover, and instead focuses on the work of chefs and owners of color who have been historically underrepresented by brands like ours. Before I cover a restaurant, I’m thinking about how it fits into its community: Is it passively contributing to gentrification or actively engaging through inclusive service and price points that ensure locals feel welcome? When we travel to scout restaurants, I’m analyzing who we ask for recommendations on the ground and who we dine out with and making sure they don’t just know their city but have a different POV than us. This is just the beginning.So what is a BA restaurant now? Honestly, I’m not entirely sure. I know I want to redefine those two words that have held power over so many but have been defined by a homogeneous few. Instead I’m asking myself what a BA restaurant could be.Elyse InamineDigital Restaurant EditorExplore Bon AppétitLetters From the EditorsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-29", "author": ["Condé Nast", "Elyse Inamine"]}