{"id": "a60af1e4750f6e592ee4e9a06219f766", "url": "https://www.bonappetit.com/recipe/cold-roast-salmon-with-smashed-green-bean-salad", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Cold Roast Salmon with Green Bean Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCold Roast Salmon with Smashed Green Bean SaladBy Anna StockwellJuly 10, 20184.8(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintRoasting salmon low and slow yields fish that stays moist and tender even when served chilled. A raw green bean salad is a perfect crunchy accompaniment; our trick for smashing and marinating the beans softens their texture and flavors them inside and out.Ingredients8–10 servings13½–3¾-lb. whole side of salmon7Tbsp. extra-virgin olive oil, divided, plus more for servingFreshly ground black pepper4tsp. kosher salt, divided, plus more½tsp. crushed red pepper flakes, divided¼cup fresh lemon juice2lb. green beans, trimmed1bunch radishes, preferably French breakfast, trimmed1cup coarsely chopped salted, roasted pistachiosFlaky sea saltLemon wedges (for serving)Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde (for serving; optional)PreparationStep 1Preheat oven to 300°. Place salmon on a rimmed baking sheet and rub 2 Tbsp. oil over each side. Season all over with black pepper, 2 tsp. kosher salt, and ¼ tsp. red pepper flakes. Arrange skin side down and roast until a tester, metal skewer, or thin-bladed knife inserted laterally through salmon flesh meets no resistance, 20–25 minutes. (Fish should be opaque throughout and just able to flake.) Let cool.Step 2While salmon is roasting, make the salad. Whisk lemon juice, 3 Tbsp. oil, 2 tsp. kosher salt, and remaining ¼ tsp. red pepper flakes in a large bowl to combine. Set dressing aside.Step 3Working in batches, place green beans in a large resealable plastic bag. Seal bag and whack beans with a rolling pin to split the skins and soften the insides without completely pulverizing the flesh. Place in bowl with reserved dressing. Toss, massaging with your hands to break beans down further and coat. Let sit at room temperature at least 1 hour.Step 4Thinly slice radishes lengthwise. Place in a large bowl of ice water, cover, and chill until ready to serve (this will allow you to get the prep out of the way and keep the radishes crisp and firm).Step 5Just before serving, drain radishes and toss with marinated green beans. Add pistachios; taste salad and season with pepper if needed. Transfer to a platter and drizzle with oil and sprinkle with sea salt.Step 6Using 2 spatulas, carefully transfer salmon to another platter, leaving skin behind on baking sheet. Drizzle with oil and squeeze juice from a lemon wedge or two over; sprinkle with sea salt. Serve with more lemon wedges and Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde alongside.Step 7Do Ahead: Salmon can be roasted and green beans can be marinated 1 day ahead; cover and chill separately. About 45 minutes before serving, remove green beans from the fridge and let sit at room temperature to warm up a bit. Radishes can be sliced 1 day ahead; keep chilled.How would you rate Cold Roast Salmon with Smashed Green Bean Salad?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThe salmon was a little bland, but perfectly cooked.  To add texture and flavor, I crisped the salmon skin in a skillet (be careful; it can go from crisp to burnt quickly).  When all the fat is rendered (like bacon) crumble ithe skin over the salmon.  Fresh, chopped Italian parsley or basil is good too.Anonymousnew york10/25/2021I'm a little chagrined by how easy this approach to cooking salmon is. No starting it on the stove top, no flipping it, no wrapping it up in foil. Just stick it in the oven and out comes perfect fish. The low-and-slow method really works for cooking it through (appropriate for something served cold a day or two later) while locking in all the juices. Made it for brunch a day-ahead and everyone thought it was fantastic.\n\nCannot speak to the green bean salad but I did make the serrano green sauce. Very good, though I'd suggest using a little bit less oil and maybe 1 or 2 fewer serranos (it was quite potent).AnonymousCambridge, MA3/26/2020Made this salmon and it was so good I didn't even have time to let it get cold before it was consumed by everyone in the house, absolutely amazing ... Next time I'm going to double the recipe and have leftovers cold with salad (or eat way too much dinner, lol)threadbarebluesPortland1/9/2020I decided to try this recipe out for my lunches this week, since it's going to be in the 90s all week. It is very simple and easy to prepare. The salmon took a bit longer to cook than suggested - mine took a solid 32 minutes. The pairing of the spiced salmon accompanied by the Lemony Yogurt Sauce is delicious and just perfect for hot summer days.K10KenLeonardtown, MD9/3/2018Explore Bon AppétitSalmonFishSeafoodGreen BeanVegetableSummerEasyMainDairy-FreeGluten-FreeHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}