{"id": "a60c922ed739c896c904bca651fbca25", "url": "https://www.bonappetit.com/story/stress-relieving-products", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Stress Relief Products Getting Me Through Thanksgiving Chaos | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle6 Stress-Relieving Products Getting Me Through Thanksgiving ChaosAnd only one of them is cannabis.By Amanda ShapiroNovember 20, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailCompared with every TV show, movie, and comic strip about Thanksgiving, my family’s version is extremely chill. Examples of “dramas” we’ve faced: Someone arrives an hour early and we must entertain them. Someone comes with a new girlfriend or an acquaintance or a Canadian friend and we must set an extra place. Someone brings a raw cranberry sauce to put alongside the cooked one, and there’s a heated conversation about whether the raw one is technically a relish. So I really have no business being stressed on Thanksgiving; it’s just that my usual low-grade anxiety is heightened thanks to the fun combo of heinous travel plus cooking responsibility plus large family gathering. But I didn’t come here for therapy. I came to talk solutions.The JourneyIt starts with the Thanksgiving Eve journey, wherein I smash myself onto a subway car and then a commuter train to get to my parents’ house north of New York City. Here, between the armpit of a business suit and\na tiny dog in a Vera Bradley bag, I’m grateful for my daily Sun Potion ashwagandha habit. I get the adaptogenic herb powdered and stir it into hot water every a.m. to build up and support my body’s resilience to stress.The ArrivalBy the time I make it home, smelling like the pumpkin spice beverage someone spilled\non my shoes, I’m ready for a drink of my own. But I’m also taking half a dropper of CBDoil, which has been shown in some studies to help with pain relief and muscle relaxation. I look for products made from the whole hemp plant, like Lily CBD. My parents can’t quite remember the acronym, but they keep asking me about “that new weed thing,” so this year I’ll share. Family bonding!The Wake-UpNo one in my family sleeps late—it’s in our genetic code. If I want to try to make it past the still-dark hour, I need a set of earplugs and my Slip sleep mask, which stays put all night and feels like lingerie for your face.The PrepBetween table setting, potato peeling,\nand whatever other tasks my ruthlessly efficient parents find for me to do, I pause for sips from my Fressko infuser flask. Inside is fresh-brewed skullcap, a plant that calms my nerves and helps with stomach pain. If things start getting a little hot in the kitchen, I’ll sneak off with a Monq aromatherapy pen. It looks like an e-cigarette but is really nothing but pure delicious smells such as eucalyptus, lime, and tangerine.The MealIf I’ve done all these things, I’m on cruise control by the time extended family and friends start arriving. This is the easy part: a frenzy of plates passing, glasses refilling, and claims that this year’s turkey is the best ever and we mean it this time. Afterward, with tryptophan coursing through my bloodstream, all I need is a couch, Forrest Gump, and a promise to do the dishes later. For a moment, I’ll forget what stress even is.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishThanksgivingSelf CareShoppingessayRead Moreculture5 Easy Ways to Feel Less Stressed Right NowBy Dr. Tiffany LesterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Amanda Shapiro"]}