{"id": "a60e6dc971401017290027c1e173811c", "url": "https://www.bonappetit.com/story/crispy", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "There’s an Entire Industry Dedicated to Making Foods Crispy, and It Is WILD | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThere’s an Entire Industry Dedicated to Making Foods Crispy, and It Is WILDEver wonder why are we so drawn to the snap of a potato chip or the crackle of fried chicken? Biology, psychology, and an incredible amount of engineering.By Alex BeggsFebruary 20, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailTwo beach chairs sit side by side in front of the glittering blue ocean. The sun is shining. And in between those chairs, nestled in the warm sand, is a perky yellow bag of Funyuns. That’s a mural I saw in the Frito-Lay headquarters in Plano, Texas. I was there! My pilgrimage to the pinnacle of potato chips! Each step I took down those carpeted corporate hallways was a bounce. I love potato chips. I love snack foods as a whole category, but chips are my number one. I have a stash under my desk that I share on our office snack table when the mood calls for it. I have a designated “chip plate” my coworkers know by name. At my last job I became known for shrieking “They put chips on your sandwich!” every time we ate at a local lunch spot (that had no other redeeming qualities).I’m trying to set myself up here to explain how I ended up at Frito-Lay headquarters, standing in a stainless-steel-outfitted Culinary Innovation Center in front of a spread of chips, accepting a strawberry Bubly water from a guy called Chef Jody.Related: The Snack Queens with Alex Beggs and Andrea HernandezContentThis content can also be viewed on the site it originates from.Because the thing about chips is, they’re perfect. The reason chips are perfect is their texture. They’re crispy. And crispy foods are the best foods.Okay, fine! I also like jiggly. A colleague of mine wrote a piece about the beauty of chewy. Another is enamored with “crispy gone soggy.” There are other fantastic food textures out there. But why is crispy so alluring, so valuable, so desirable? Bon Appétit used it around 500 times (I’m rounding up) last year to describe everything from salmon skin to the top of baked French toast. Frito-Lay yearns to achieve hyperbolic levels of crisp. Popeyes has us lined up for crispy chicken sandwiches. The opulence-forward restaurant Benu in San Francisco has served “pork with inverted crispy skin” on its $325 per person tasting menu.In the datasphere, the use of crispy/crispiness in U.S. reviews on Yelp has increased 20 percent in the past decade. In close to 7,000 menus analyzed by Stanford’s Dan Jurafsky, crispy is by far the most frequent adjective used to describe texture. The Cheesecake Factory uses the words crisp or crispy nearly 50 times on ONE menu. Researchers have revealed that people find crispy foods “appealing” and “enjoyable,” and that people associate crispy and crunchy food sounds with “FUN” and “pleasantness.” Get this, brainiacs: Neurons in our orbitofrontal cortex DING DING DING like game-show bells whenever we eat crispy foods. Crispy is everywhere. Crispy is beloved. Crispy is...Totally calculated.Our predictable, blatant obsession with crispy has sparked an entire food and marketing industry that caters to it. You can measure crispy, engineer it, and promote it. Scientists can make crispy crispier. But why do we love it? How do we see it, hear it, and taste it? What even is it? Who the heck is crunch? Let’s get to the bottom of this bag of potato chips.Are we having funyun yet?\nPhoto by Alex LauFirst, Put On a Lab CoatThe study of crispy started in the food lab that brought the world Jell-O, instant coffee, and a Seinfeldian array of breakfast cereals: General Foods (now owned by Kraft Heinz). Scientists weren’t paying close attention to food texture until the legendary General Foods research scientist Alina Szczesniak broke it wide open in the ’50s. Me summarizing her work: “Everyone’s obsessing over how foods taste and totally ignoring how important TEXTURE is to the experience of FLAVOR.” The other scientists: “Oh daaaaaaaaaamn. She’s right.”Szczesniak, who died in 2016, laid out a scientific range to evaluate food texture based on eight qualities, like hardness and elasticity, called the sensory texture profile. Crispiness is a “stimulant to active eating,” wrote Szczesniak with a colleague, and “it appears to hold a particular place in the basic psychology of appetite and hunger satiation, spurring one to continue eating.” Well, yeah.To assess crispiness, which Szczesniak categorized as “brittleness,” you had to measure the force a bite needs to break a food. Her team used human panels to test texture, but she also invented a few machines, including the Texturometer, a mechanical mouth (with blades, not teeth, I know) that spits out readings on crispiness and other traits. Today Frito-Lay and its competitors have their own versions of the Texturometer to measure products’ crispiness.What did General Foods do with this data? The company came out with aisles of crispy cereals, frozen foods, and packaged snacks as Americans were starting to spend more and more time in front of the TV. How convenient.Wait, What About Crunch?People tend to use crispy and crunchy interchangeably, but there’s a difference, and it’s been studied. This isn’t a matter of opinion, okay?! Scientists recorded people eating a variety of crispy and crunchy foods—crackers, chips, apples—and found that crispy foods make easier breaks and higher-pitched sounds and are usually attacked with the front teeth, while crunchy are molars, lower-pitched. Other studies looked at the mess a food makes when it’s bitten, and crispy foods had more breaks and pieces compared with crunchies. Many have pointed out that the words are onomatopoeic: crispy ends with an uplifting quick isp like a chip snapping in your teeth, crunch comes out of the mouth like a bulldozer hitting dirt. A Pringle is crispy; a thick Snyder’s pretzel is crunchy.Let’s Talk About PCsBack at Frito-Lay HQ, I stood in front of a chip lineup that spanned from airy Wiffle ball–like Poppables to classic Lay’s (which they refer to as “PCs”) to kettle-cooked Lay’s and these new chickpea flour Frisbees called Off the Eaten Path. Dr. Chris Cioffe, senior vice president of sustainability and global snacks R&D at PepsiCo (phewph!), beamed with pride at her chip babies. I beamed with gluttonous joy. I gushed like a red-carpet reporter about what a fan I was of jalapeño kettle chips.“Women really seem to like the kettle-cooked,” Dr. Chris said, “and usually the fold-overs are the secret”—fold-overs, as in, the chips that fold in the fryer like shells. Frito-Lay got the female fact from post-market reports and from consumer panels, but a 2015 study at the University of Arkansas came to similar findings: Female consumers were more likely to notice food texture, especially crisp and crunch, than their male counterparts, whose attention first goes to food color and flavor. Don’t ask why! No one knows!! Maybe we’re trying to drown out the noise of men talking so much!!!Kettle chips are in the “hard bite” category, which “is growing like crazy” right now, Dr. Chris said. They’ve introduced Ruffles Double Crunch, a kettle-cooked Ruffle, plus revamped Cool Ranch and Flamin’ Hot Limon Doritos.But where do chip babies come from? Frito-Lay creates crisp in four major ways, executive chef Jody Denton told me: ingredients (finding the right combination), moisture control (dehydrating snacks), shaping method (each chip has its own custom equipment), and the speed and method of cooking (frying, baking, etc.).Kettle chips are all about that fry time. A regular potato chip is fried fast at a high temp. A kettle chip cooks longer at a lower temperature, getting browner and crispier. Cheetos get extruded, which means they get squirted out of a machine like cheese turds or Play-Doh noodles. By squirting the dough out with added air, they end up as Puffs. Cheetos Crunchy are extruded, but their time in the fryer is the key to their harder bite. I got a glimpse of the machines, which look like missile launchers. That, folks, is why you can’t replicate Cheetos at home, unless you’re Claire Saffitz.Frito-Lay sustains crisp with packaging. The bags are puffed with nitrogen-infused air that keeps the chips fresh. Packaging is also how they promote crisp. The pop and whoosh of released air. Classic Lay’s bags had a makeover recently and on the back there’s a list of words with “CRISPY!” up top—where they know consumers’ eyes go first because, of course, they do eye-tracking experiments. You thought we lived in a world without chip surveillance?!?! And don’t forget the sound of the crumpling bag, or the pop-off of the Pringles lid. Those signify crispiness as much as the chip itself.Then there’s the photo of the single oval chip—no crumbs in sight—on the front of the bag. Katie Ceclan, a marketing exec at Frito-Lay, told me this is because consumers associate crumbs with broken boys at the bottom of the bag. Plus, “we spent a lot of time with shadows,” Ceclan said. On the previous bags a straightforward shot was too flat and cartoonish. Crispy is dynamic and tactile, multidimensional mouth magic! Crispy lives in the shadows.Behind every chip commercial, there’s a chip biter with a microphone. Executive producer Becca Falborn expertly chomps on a stack of Pringles at the Sound Lounge mixing studio in New York.\nPhoto by Alex LauA coveted Popeyes crispy chicken sandwich.\nPhoto by Alex LauCall Me Crispy PoppyWell, sometimes crispy lives in the crumbs. At Popeyes, they call them crispy poppies. “That’s when you get that kind of gnarled or almost cornflake texture on the chicken,” said Amy Alarcon, vice president of culinary innovation at Popeyes. Her team’s latest creation, the wildly popular crispy chicken sandwich, captivated the crispy nation for weeks. The ad campaign was just one close-up photo and a viral tweet that threw shade at Chick-fil-A’s sandwich: “Y’all good?”We tried the sandwich in the office. Senior food editor Andy Baraghani was impressed with the supremely crispy skin despite it having traveled at least 30 minutes. (A box of fries, on the other hand, was pure sog.) All of our talk was about the crispy shell—what’s inside, in this case, isn’t what counts. The coating here is not the same as what you’ll find on the classic Popeyes chicken. It’s a combination of hard and soft wheat flours, similar to the difference between all-purpose and fluffy cake flour. Popeyes works directly with flour mills to source flour that has the exact percentage of protein needed to “deliver that perfect shatter bite that people expect from us,” Alarcon said. Each season the wheat crop changes slightly, in the way corn does, so the culinary team has to regularly measure the protein in the flour and adjust the blend until the ratio is calibrated for peak Popeyes crispy.If you look at the ad for the sandwich, it’s nearly 3-D. I spoke to Tom Hamling, head of creative for the agency GSD&M, who oversaw the campaign. Every detail was scrutinized to make it appear as crispy as possible. Photographers and food stylists are sent a styling brief, which no one dared show me, that sets the ground rules. IT SHOULD NOT LOOK GREASY, but there should be a twinkle of shine, it might say. A food stylist who definitely signed an NDA gets the official recipe, and the beauty pageant begins.There’s a crowd on set that includes some of the Popeyes culinary team to give the stylist notes as the camera starts rolling. If the sandwich loses its recently fried glow, a stylist might dab it with oil in the places the light hits, which is exactly how I apply highlighter to my cheekbones. If a spot on the chicken is lacking definition, a stylist who has worked on similar shoots told me she might do some “crisp grafting,” piling fallen crispy poppies back on the chicken to oomph it up. “Even Kate Moss wears makeup sometimes,” the stylist said.We told you crispy lives in the shadows.\nPhoto by Alex LauCrispy in Concert“This is Pringle chews, starting slow.” Marshall Grupp was splayed on a rug in the offices of the Sound Lounge, a sound mixing studio in New York. He has wavy long hair and was wearing an incredible fleece pullover in a southwestern print, which is a look I’d say screams: I’m the sound guy. They’d assembled a tray of crispy foods to take into a recording studio with me—a Honeycrisp apple, Frosted Flakes, Ruffles, a Rice Krispies Treat—and Grupp was snacking on them analytically: “There’s sugar on the Frosted Flakes, so it might add to the texture of the sound.”Years ago he made a hundred-something sound effects library for Pringles, a collection of sounds for ads and wherever else a Pringles crunch might be heard (your dreams?). When the first recording played on the Sound Lounge’s giant speakers, we heard a big satisfying crrr-unch and then four crunchy decrescendoing bites. It was like hearing Pringles at Carnegie Hall. I was rapt. “Wow. That was a pretty good sound,” Grupp said, amused. There were no mouth noises, no hint of moisture or breathing. It was “clean.”“This is a single. Pringle. Crack.” A quick, papery snap. “That’s just hands,” Grupp said, snapping a chip in half with his hands to show me.“Chip nibbles.” A rapid-fire tat-tat-tat. Grupp exclaimed: “I even did nibbles!!!”The Sound Lounge records Foleys—sounds that match up with an image—for movies, TV, and commercials. For food clients, a producer goes into the recording studio and eats the food itself. Then the Sound Lounge will edit the sound: layering sound over sound like thwacking Bruce Lee punches, balancing the bass and treble, or adding reverb for slow-motion chip action. “It becomes a little more artistic, a little more dramatic,” Grupp said. “[We’re] taking a real sound and making it more than what it really is.”When a commercial for Ore-Ida tater tots needed to sound crispier, producers fried the tots a second time, which did the trick. In the ad, a sports commentator narrates as a little girl sits at the dinner table with her mom: “Will Lily trade a bite of chicken for the crispy Ore-Ida tater tot???” Lily bites into the tot and the Sound Lounge’s beautiful crunch crackles in its split second of stardom.When we bite into crispy food, the crunch in our teeth vibrates up our jaw to our ears. We hear it and feel it. It’s a huge part of why we find crispy foods exciting. In an Oxford University study published in 2015, people bit into 180 Pringles while listening to the feedback sound of their biting. The researchers found that the louder the sound, the crispier the chips seemed. In a bacon study (!), the sound of crispy bacon was as important to people’s enjoyment of it as smell and taste. Frito-Lay has measured products’ crunch in decibels, mostly to “maintain brand identity,” confirming that Cheetos are consistently crunchy, year after year. They once audibly confirmed that Doritos make the loudest crack.I put on headphones and headed into the Sound Lounge recording booth with the tray of snacks. We cranked up the volume and I bit into a Ruffle; I could hear the crunch loud and surreally clear. It sounded plasticky. A Nature Valley granola bar that I snapped in my hands was sandy and anticlimactic. Corn Flakes crushed in my palms sounded like a giant walking on Legos. We looked at the sound waves of my crunches and you could see the sound spike up and down. “It has a personality!” Grupp said.Apples are what scientists call “wet crisp.” Really!\nPhoto by Alex LauMeanwhile, in New JerseyWhen Gail Vance Civille picked me up from the train station in Summit, New Jersey, I noticed we were both wearing blue corduroy pants. “I wore my most textured outfit for you,” I said. “My friends say my house is full of textures,” she replied before defying every turn her Google Maps narrated and yet somehow ending up at Sensory Spectrum, her consulting company. There they evaluate everything from body lotion to kitty litter to granola bars in development. They might get 15 chip prototypes to test, after which the maker might narrow down to three to test with consumers. Then Sensory Spectrum might see the product again to determine shelf life (you thought expiration dates were plucked from thin air?). Civille, 76, has eaten a lot of stale chips.Civille worked with Szczesniak at General Foods back in the day. Since then she’s cowritten a book that explains how to run a sensory panel (similar to what Szczesniak started) that most food companies use. A food-loving crowd of 10–15 trained experts sit around a table and VERY thoroughly analyze, say, a new frozen chicken finger, according to a VERY specific set of categories. One of which is, duh, crispiness. It’s a 0–15 point scale. A marshmallow is 0. A Life Saver is 15. Iconic products like Quaker Chewy granola bars (2) and Goldfish (11) are tentpoles in the scale, so if you’re trying something new, you can think, Is this crispier than a Goldfish? Then it probably ranks at 11 or higher. If you look at the evaluations of snack foods on the whole, Civille said, “As the crispiness goes up, the liking score goes up.”She and panel leader Liz Filoramo set up a sample panel for me. I got an evaluation worksheet, a water cup, a plate of Cheetos—Crunchy and Puffs—and a spit cup. As if I’d ever spit out a Cheeto! Chester, I would NEVER. The Puff was up first, and Civille instructed me to bite it between my molars, slowly. Crispy, Civille reminded me, makes many small ruptures when bitten, while crunchy makes fewer breaks and is denser. The Puff shattered easily between my teeth with a shhhick and dissolved into exfoliating cheese goo. We gave it a 7.5. The Crunchy was a much denser bite and over with much faster. That was a 12.Is it a Poppable or an as yet undiscovered planet.\nPhoto by Alex LauCrispy in TheoryMeet the new Ruffles Double Crunch. They’re caramel-colored because they’re “kettle-processed,” which you’ll remember means they were left in the fry oil a bit longer for extra crisp. The ridges are almost dangerously sharp. “Ouch!” said one of my colleagues when we tried them around the office snack table. “I can’t hear what anyone’s saying when I’m chewing this,” said another (please note, female) loudly. “They’ve gone too far!” cried a third. I thought they’d be great with a tub of sour cream and onion dip, tucking the second bag under my desk for myself.The package has “2X the crunch!” stamped in a chalk font and reminds me of ads for CrossFit gyms and protein powders. Sensory Spectrum’s Civille has a theory that people of a certain personality type like crispy because it’s an attack. “It’s much more aggressive than chewing on a caramel,” she told me, baring her teeth.That doesn’t fully explain it, though. Szczesniak and other scientists published in The Journal of Texture Studies, which you better believe I read, posited that humans like crispy because it signaled freshness and safe-to-eatness in our caveman days (lettuce, apples, tasty crickets). Then fire meant we could create crispy—we adapted to love crispy things even more when fried in fat.The Omnivorous Mind author John S. Allen wrote that crispy rescues us from “sensory habituation,” getting bored by the third slippery sip of tomato soup. The most comprehensive, logical theory to me was a similar argument from Oxford professor Charles Spence, who did the Pringles sound studies. He writes that crispy is king because it offers a “multisensory experience”—sight, taste, feel, and especially sound, piled together like a tin roof sensory sundae.I didn’t talk much in this story about cooking crispy at restaurants, where it can be just as scientific as at Popeyes, but for a much smaller audience and with much scarcer ingredients. At Atomix in New York, chef Junghyun Park adds nitrous oxide gas to the batter for a super-crispy langoustine twigim (like a fritter). In outer space—I mean Vespertine in L.A.—chef Jordan Kahn makes an herbal distillate of Turkish bay leaves as the base for a thin and crispy bay leaf cage that holds a caramelized leek heart hostage inside. At New York’s Momofuku Ko, you start your meal with a one-bite pommes soufflé—a dollhouse-size potato pillow that’s been fried at two different temperatures in order to explode into its puffy shape and dehydrated so that it remains insanely crispy, two techniques the Frito-Lay execs would surely nod in agreement with.And I didn’t talk about cooking crispy at home! The joys of chicken thighs fried in their own fat, crispy pakoras, icy-crisp fennel salad, none of which require a bulk order from modernistpantry.com. I figured you were pretty familiar with those cooking techniques since we seem to wax poetic about them in every issue.Instead I keep thinking about how unreal crispy has become when it’s formulated in food labs for mass consumption, preserved in puffy packaging. How the photography we see is saturated, shadowed, and oil-slicked by professional perfectionists. How the crunch sound in commercials is amplified and deepened, like a fart in a porcelain bathtub.There are so many places in our lives where, when trying to re-create reality, we simply take it too far—see Instagram, Vanderpump Rules, and Botox as reference. Where will we go when crispy’s gone too far? After the roofs of our mouths are cut up from too many extreme Ruffles? And that’s when a smooth, jiggly cup of pudding starts sounding really nice.Explore Bon AppétitChipsSnackScienceRead MorecultureCrispy-Gone-Soggy Is the Finest Texture of Food There Is, Fight MeBy Amiel StanekcultureEveryone Loves Crispy and Crunchy, But What About Chewy?By Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-20", "author": ["Condé Nast", "Alex Beggs"]}