{"id": "a617d6844f083810886c472537d3f3d3", "url": "https://www.bonappetit.com/story/ilse-apple-cake-recipe-readers-choice", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "Ilse’s Gorgeous Apple Cake Recipe Won Our Reader’s Choice Contest by a Landslide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIlse’s Gorgeous Apple Cake Recipe Won Our Reader Recipe Contest by a LandslideAnd it will definitely fulfill your apple-a-day quota.By Emma WartzmanApril 4, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe best things in life are worth preserving, which is why Olaf Klutke knew he had to record the recipe for Buttery German Apple Cake, this year’s winning Reader Recipe. Out of the hundreds of recipe submissions we received, this one stood out. It’s creative in its construction, delicious, and, perhaps most of all, passes on a family tradition.Ilse is Klutke’s mother, and her famous apple cake recipe was based on one she learned from her mother-in-law, Marta. Newly married (and newly cooking) Ilse learned how to bake with Marta in a tiny, hand-built kitchen in Hamburg, Germany. In 1964, Ilse and her family, including three-year-old Klutke, immigrated to the United States, just outside of Chicago. She brought the memorized recipe for the cake with her, too.“Once she learned, it was always there,” Klutke says. “For special occasions, for Sunday night dinner. Even if she saw good-looking apples at the store, that was reason enough to make it.”It's based on a traditional German apple cake, Versunkener Apfelkuchen, but what is usually a runnier batter is more dough-like in her version, yielding something between a cake, a tart, and a cookie. It’s moist and chewy, with a crisp, golden crust. The dough comes together in one bowl but makes two different textures through baking. First it’s pressed into a buttered springform pan with a removable bottom that is sprinkled with breadcrumbs, which is where the cookie-like, crumbly quality comes from. Then the top of the crust is spread with apricot preserves, which seep into the dough and keep a layer of it soft like Oooey Gooey Butter Cake, even as the bottom crisps up. There are peeled and quartered apples on top, displayed like the top of a beautiful tart. You can use any kind you prefer to bake with, like Pink Lady or Honeycrisp.The apples are a brilliant move in and of themselves. Each peeled quarter is sliced like a fan at ⅛-inch thick almost to the bottom, but not fully, so that they still hold together, like a hasselback squash or potato. Though Marta probably wasn't thinking this, we’re happy to point out that this makes for a particularly ‘grammable cake. The real reason she did it? “When the cake bakes, those slivers separate and brown on their own,” Klutke says. “They get soft, but the center core stays firmer, so you have variety. When my mom was cutting, I took out a ruler to see how far apart the slits were.” He told the BA test kitchen the apples should be “al dente” when we cross-tested the recipe. The baked result was pleasantly firm, unlike soft-bordering-mushy apple pie filling. It almost made the cake taste healthy.In the original recipe Klukte notes that his grandmother Marta, or omi, served it with a dollop of whipped cream, or schlagsahne, as we do here. “The more American version would be with a scoop of ice cream,” he writes, “which omi would certainly approve of!”Because she knew what it meant to adapt. During World War II, Klutke’s grandparents had to escape Germany. They fled to Poland, and then eventually to the small town of Schruns, Austria, where they lived in a hotel for about five years. In exchange for their stay, Marta worked in the hotel kitchen, baking her cake for its visitors, who were often American and French soldiers. Once the war was over and it was safe to return, his grandparents made their way back to Hamburg, where they found their city, and house, in ruins. Klutke’s grandfather re-built the structure from the ground up, but Marta’s memorized recipes were always at-hand, and then passed down to her daughter-in-law, Ilse.Klutke has been recording his family recipes for the past year, trying to make a written record of dishes in his mom’s head—things like beef Rouladen and goulash. For the cake, he even printed photos and made diagrams of how to slice the apples to go along with it. “I have to stand next to her and grab ingredients and actually measure them as she’s working,” he says. “I have a whole cookbook like this that I’ve done.”Get the recipe:Buttery German Apple CakeThis gorgeous cake uses a surprisingly simple method to slice the apples just so.View RecipeExplore Bon AppétitCakeAppleDessertGermanReader's Choice WeekOur ReadersRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Emma Wartzman"]}