{"id": "a621284a3b23e5d9337259abb03e461b", "url": "https://www.bonappetit.com/recipe/brown-butter-croutons", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Brown Butter Croutons Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueBrown Butter CroutonsBy Molly BazMarch 19, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFor croutons that look ordinary but have big flavor, we borrowed a tip from Kindred in North Carolina, where they steep hunks of bread in herb-infused butter before toasting. Here, we toss the bread in garlic brown butter before baking in the oven.IngredientsMakes about 4 cups6oz. country-style bread, torn into 1\" irregular pieces (about 4 cups)10garlic cloves, smashed4Tbsp. unsalted butterKosher salt, freshly ground pepperPreparationStep 1Preheat oven to 375°. Place bread in a large bowl. Cook garlic and butter in a medium saucepan over medium-low heat, swirling often, until foaming subsides, butter turns golden brown, and garlic is fragrant, 6–8 minutes. Drizzle garlic butter over bread and toss to coat; season with salt and pepper.Step 2Spread out bread mixture on a small rimmed baking sheet. Bake croutons until deep golden brown and crisp, 20–25 minutes. Let cool, then pluck out and discard garlic cloves.Step 3Do Ahead: Croutons can be made 1 week ahead. Store in an airtight container at room temperature.How would you rate Brown Butter Croutons?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGreatAnonymousHouston Tx3/6/2021Explore Bon AppétitCondimentNut-FreeVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Molly Baz"]}