{"id": "a633792ddc0ba8d5f75cac8dd1ad08e9", "url": "https://www.bonappetit.com/recipe/pollo-en-chicha", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Pollo en Chicha Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssuePollo en ChichaSeptember 22, 20204.8(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Andria Lo, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintIn El Salvador chicha is a popular drink made from any number of things, ranging from corn to pineapple. It’s fermented until fizzy and tangy—but not truly alcoholic. It’s also the key ingredient in the dish that made chef Anthony Salguero of Popoca want to cook Salvadoran food in the first place: gallo en chicha, rooster braised in a pineapple-skin chicha. For this recipe we’re using chicken, and because chicha can be hard to find, Salguero suggests combining pineapple juice and apple cider vinegar as a substitute in this recipe. If you happen to get your hands on some chicha, or go the extra mile to make it yourself, replace the pineapple juice with 2 cups chicha and reduce the vinegar to ½ cup.Ingredients4 Servings6skin-on, bone-in chicken thighsKosher salt, freshly ground pepper2Tbsp. vegetable oil1large onion, cut into 1\" pieces4medium carrots (about 10 oz.), peeled, halved lengthwise10garlic cloves, halved10oz. fingerling potatoes, scrubbed, halved lengthwise2Tbsp. Relajo¼tsp. crushed red pepper flakes¾cup apple cider vinegar4oz. prunes (about 1 cup), halved, pitted1cup pineapple juice1Tbsp. dark brown sugar2cups low-sodium chicken broth1Tbsp. oregano leavesSliced pickled chiles and toasted sesame seeds (for serving)PreparationStep 1Preheat oven to 375°. Season chicken generously with salt and pepper. Heat oil in a large heavy pot over medium-high. Cook chicken, skin side down, until golden brown and crisp, 10–12 minutes. Transfer to a plate.Step 2Add onion, carrots, and garlic to same pot, season with salt, and cook over medium-high, stirring occasionally, until onion is brown around the edges, 6–8 minutes. Add potatoes, Relajo, and red pepper flakes and cook, stirring constantly, 1 minute. Stir in vinegar and cook, stirring, until mostly evaporated, about 3 minutes. Add prunes, pineapple juice, and brown sugar. Bring to a simmer and cook, stirring occasionally, until liquid is reduced by half, about 5 minutes. Season with salt and add broth. Bring to a simmer and cook, stirring occasionally, until reduced by about one fourth, about 5 minutes. Nestle chicken back into pot, arranging skin side up. Cover and transfer to oven. Braise until meat is tender but not falling off the bone, 45–50 minutes.Step 3Divide stew among shallow bowls. Top with oregano, pickled chiles, and sesame seeds.Step 4Do ahead: Stew (without toppings) can be made 3 days ahead. Let cool; cover and chill. Reheat over medium-low.How would you rate Pollo en Chicha?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleSO GOOD. I used a spicy homemade tepache instead of chicha and it was super. I will definitely make this again.IvyPhiladelphia, PA1/24/2021This was incredible! The flavor in the relajo is outstanding - at first I was hesitant to  put so much time and ingredients into just one portion of the meal - but it was damn worth it. The cinnamon / anise gives it a flavor that I really haven't been even able to come close to tasting since lockdown. What a variation!! leilaChicago, IL11/8/2020This is an amazing recipe. Great depth of flavor. I am going to give it a try with pineapple kombucha just for fun. It is annoying though when a picture of the dish is not actually what is represented in the recipe. There are no chicken legs in the ingredients and the chicken in the photo is obviously charred for photo op only. AnonymousIdaho11/2/2020This was one of the best things I've made or eaten recently--both my partner and I were astonished by how good it was. The linked recipe for Relajo makes a lot, but after experiencing that spice mix I'm glad we have so much of it left over -- I'll be using it in everything. The chicken's also relatively easy and comes together in one pot. I would ignore the person who complained about the acidity of the vinegar-- the recipe as is is perfect, just make sure both the vinegar and pineapple juice actually reduce. I might try pre-crisping the cut side of the potatoes next time after searing the chicken and before starting the braise base, but that's just my preferred texture. We're going to try tearing up the leftover chicken and making quesadillas with it tonight with some oaxaca cheese. AnonymousNew York10/20/2020This dish is wonderful. During the pandemic I try to limit my trips to the store but I had almost everything. Used pure cacoa powder in lieu of nibs for the relajo , no prunes so added equal amt of golden raisins, no pineapple juice but pureed canned crushed pineapple. It came together beautifully. One reviewer was unhappy with vinegar but if reduced properly it really offsets the sweet elements added to the stew. I would love to use the sauce for pulled pork. carringtonashSouth Carolina10/13/2020We made this last night for dinner after reading the recipe in the October issue. We made a few minor substitutions on the spice blend but added the called-for amount of vinegar and pineapple juice. Incredibly flavorful and absolutely delicious. Very well balanced and the chicken was super tender.  Highly recommend the recipe as-is!NotfoodbloggersCharleston, SC 10/7/2020Absolutely amazing recipe!! I made this for dinner the first time tonight and my family (husband and 4 kids) all loved it. I love the reduced vinegar touch, it's something I use often and adds an amazing depth. Don't change a thing! And try this right away!PandemoniumVirginia10/5/2020This recipe was absolutely delicious until adding the questionable ¾ cup apple cider vinegar. The dish became way too acidic, and that was only worsened by the pineapple juice. If I make this again I will only use 1/4 cup of vinegar and half the pineapple juice, watered down. If you want to avoid the excessive sourness I suggest omitting the vinegar and pineapple completely and substituting more chicken broth. The sweet/sour of the prunes is enough, and you'll have more of a classic, pallet-able stew.AnonymousToronto, Ontario10/5/2020If you are making Chicha an integral part of the recipe as well as having it on the cover of the story in the mag, please include a recipe for it. ScottyMazPortland, Or9/30/2020Explore Bon AppétitStewSoups and StewsSalvadoranCentral AmericanLatin AmericanChicken ThighChickenPoultryOne-Pot MealsMainDairy-FreeGluten-FreeBraiseDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast"]}