{"id": "a635b47f3e053526f8f91528605ccfa8", "url": "https://www.bonappetit.com/recipe/charred-sweet-potatoes-with-hot-honey-butter-and-lime", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Charred Sweet Potatoes With Hot Honey Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCharred Sweet Potatoes With Hot Honey Butter and LimeOctober 15, 20194.6(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus Nilsson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWhen you mix hot sauce with butter, it turns into a spicy, creamy spread that’s perfect for melting atop burnished sweet potato halves, bringing them to life.Ingredients8 servings8small sweet potatoes (about 3 lb. total), scrubbed, halved lengthwise½cup extra-virgin olive oil, dividedKosher salt6Tbsp. unsalted butter, room temperature (so the hot sauce can be easily incorporated)2Tbsp. honey3Tbsp. hot sauce (such as Tapatío or Cholula)¼cup raw pumpkin seeds (pepitas)1Tbsp. ground corianderFlaky sea saltLime wedges (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 425°. Place sweet potatoes on a rimmed baking sheet, drizzle with ¼ cup oil, and season with kosher salt. Turn to coat. Arrange cut side down and roast until tender (the tip of a knife should slide easily into flesh) and cut sides are browned, 25–30 minutes.Step 2Meanwhile, smash together butter and honey in a small bowl with a fork until smooth. Add hot sauce a tablespoonful at a time, blending well after each addition. Season hot honey butter with kosher salt.Step 3Cook pumpkin seeds and remaining ¼ cup oil in a small skillet over medium heat, stirring often, until pumpkin seeds are golden brown, about 4 minutes. Remove from heat and stir in coriander; season with kosher salt.Step 4Arrange sweet potatoes on a platter and spread with hot honey butter. Sprinkle with sea salt and spoon pumpkin seed oil over. Serve with lime wedges for squeezing over.Step 5Do Ahead: Hot honey butter can be made 1 week ahead. Cover and chill. Bring to room temperature before using.How would you rate Charred Sweet Potatoes With Hot Honey Butter and Lime?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleGreat recipe. simple, delicious, and I make it all the time.\nWorks with all kinds of sweet potatoes.\nI omit the pumpkins seeds 'cause i never have em on hand and sub valentina/cholula/etc.... for sriracha.\n\nMy only suggestion is to go ahead and use an electric mixer for the butter.AnonymousOakland, Calif.1/2/2021AMAZING. An instant thanksgiving classic.  Next time I will serve the hot honey butter on the side so people can add the amount that they would like upon serving.JordanNewark, CA12/1/2020I served this to 150 people for a community lunch takeaway program last week.  Elegant and VERY well received.  Entrée was honey baked ham with prickly pear/plum glaze and corn pudding side dish.Jimmie VaughnPittsboro, NC11/13/2020I love me some honey butter with hush puppies but...  I found this recipe to be greasy. I prefer clean, crisp flavors. The butter made the sweet potatoes mushy and soggy. If you have a crowd that doesn't like vegetables - go for it, it will be a hit. Los Angeles, CA 6/8/2020To get the hot honey butter consistent I melted the butter, stirred in the honey and hot sauce, and chilled it to firm up a bit. Dunno what the final texture is like with softened butter but with melted it maintained a very spreadable liquidy-but-not-too-thin texture.Anonymous5/29/2020Everyone enjoyed; my mom loved it and wants it a ton at the thanksgiving table! Only changes I made were using japanese sweet potatoes because that’s all I could get, and probably using only 6TB of olive oil in total.AnonymousKentucky 5/28/2020Made this for my family today and they loved it! Will definitely be making this again.hannah.pnnggAustria5/16/2020Love this! Had to make a lot of substitutes. Only had mixed bits so used those. Only had vegan butter, no butter at the store. No coriander. Only had Valentina instead of Cholula. ¯\\_(ツ)_/¯  was still delicious! Added some raw red onion and extra honey and hot sauce on top for kick.\nWas still supbrookeatillman@gmail.comAtlanta, GA4/11/2020Wow! Made for second Sedar.  Excellent...will definitely make again.mikermealsChicago, Illinois4/10/2020We thought these were delicious, easy and very filling! I loved making the hot honey butter and pine nuts (subbed for pumpkin seeds, will have to try next time) while the potatoes were going. This is great for big groups, possibly Thanksgiving. tarahegermillerGeorgetown, TX (near Austin)4/7/2020These were super good, but took a ton of work. It wasn't a difficult recipe, but (in my small kitchen) it felt like a ton of steps. I haven't wanted to make them again given that I wasn't sure the pay off was worth the mess and time. Anonymous4/6/2020Absolutely incredible. We didn’t have pepitas on hand so we ended up substituting for sunflower seeds and they definitely filled the texture void had we just left the seeds out (the crunch really makes it, so definitely do not recommend making this sans seeds). Will FOR SURE be making again, this is going to be a knockout at our next Thanksgiving or Christmas! kaylayestalToronto2/29/2020These are magical! It's amazing how these ingredients come together and make such delicious potatoes. Definitely will make this regularly. AnonymousLouisville, KY1/22/2020Delicious, easy and so impressive! These were the standout side dish at a dinner party we hosted recently, coming in a very close second to our beef tenderloin. These are an amazing combination of flavors and textures! I prepared the recipe just as written and everyone agreed it's a keeper.AnonymousCincinnati, OH12/30/2019I made this for Thanksgiving and LOVED it.  I used Trader Joes pumpkin spiced pepitas instead of making the ones here, but other than that I made it just as written.  The hot honey butter was delicious and came together just fine for me.  Like another reviewer said, the combination of textures and tastes are what make this recipe.  I'll definitely make this one again.  My only concern was I didn't understand having the potatoes cooled.  I ended up heating them up again a little and serving with the hot honey butter slowly melting over the top.  Yum!Boise, ID12/4/2019Explore Bon AppétitSweet PotatoPotatoVegetableFallWinterSideVegetarianNut-FreeHealthyishRoastThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast"]}