{"id": "a639e1a3701534b34e4e1fb5f4d3574e", "url": "https://www.bonappetit.com/recipe/broccolini-cheesesteaks", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Broccolini Cheesesteaks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueBroccolini CheesesteaksBy Rooster Soup Co., Philadelphia, PAJanuary 30, 20184.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Yekaterina Boytsova, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintA healthyish take on the classic Philly cheesesteak, these party-ready sandwiches are packed with roasted broccolini, a thick, tangy romesco sauce, and of course, lots of cheese. You’ve heard it before, and you may not believe us until you’ve tried them, but you won’t miss the meat. This recipe was developed by Rooster Soup Co. in Philadelphia, PA.IngredientsMakes 42large carrots, peeled, thinly sliced2bell peppers, ribs and seeds removed, chopped1large white onion, chopped1tsp. crushed red pepper flakes¾cup plus 3 Tbsp. extra-virgin olive oil, divided4bunches broccolini, trimmed (about 2 lb.)3garlic cloves, thinly slicedKosher salt2Tbsp. plus 2 tsp. sherry vinegar4seeded hoagie rolls (about 8\" each)81-oz. slices provolone cheesePreparationStep 1Position racks in top third and center of oven; preheat to 425°. Toss carrots, bell peppers, onion, red pepper flakes, and 3 Tbsp. oil on a rimmed baking sheet. Roast on center rack, tossing occasionally, until vegetables are tender and well browned (it’s okay if some spots are beginning to look burned; this will give the romesco a deeper flavor), 25–30 minutes.Step 2Meanwhile, separate broccolini florets from stalks; thinly slice stalks. Transfer florets and stalks to a clean rimmed baking sheet. Add garlic and ¼ cup oil, season with salt, and toss to combine. Roast on top rack, tossing halfway through, until florets are charred and stems are cooked through but still have some crunch, 16–18 minutes. Pour 2 tsp. vinegar over and toss to coat; season with salt.Step 3Transfer carrot mixture to a food processor. Add 2 Tbsp. vinegar and pulse until smooth. With motor running, gradually drizzle in remaining ½ cup oil and process, scraping down sides as needed, until emulsified; season with salt.Step 4Slice rolls in half lengthwise. Arrange cut side up on a rimmed baking sheet and toast until light golden brown, about 3 minutes.Step 5Divide romesco between tops and bottoms of rolls. Pile broccolini on bottom halves. Top broccolini with cheese. Toast sandwiches, open-faced, until cheese is just melted, about 2 minutes. Close sandwiches and cut crosswise before serving.How would you rate Broccolini Cheesesteaks?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleTo be honest, I don't know what a cheesesteak tastes like but this sandwich is incredibly delicious! You will have quite a lot of sauce left over at the end which can be used to justify eating these sandwiches several time a week. JuliaBamberg, Germany11/13/2021This recipe was incredible. So full of flavor. Although it’s different than a cheesesteak it was actually just as satisfying. Will definitely make again. ZZOttawa Hills, OH7/11/2021SO DELICIOUS! I am a vegetarian so I naturally am much more adventurous and willing to try funky recipes, but my boyfriend is a big ole' carnivore. He was whining all night about how he didn't want to eat a broccoli sandwich and boy did he shut up when he had his first bite. The sandwich is so juicy and satisfying and full of flavor. I'm surprised how flavorful and rich it was for being 90% veg. Also for those vegans out there — I think you can totally do this without the cheese without compromising the flavors too much. AnonymousNew York, New York 2/3/2021This was a REALLY satisfying sandwich! Of course no one is going to be fooled into thinking it's a true \"cheesesteak\" but it isn't trying to fool you, it's just making sure you'll love it. Not only was it entirely delicious but I didn't feel heavy after eating it. I will definitely make this again and if I can get my broccoli-hating boyfriend to try it I think he will love it tooBCalifornia 1/8/2021Oh boy. This Sandwich. I made a few adjustments out of necessity. I used a jar of roasted red peppers with garlic and the oil from the jar in the romesco sauce. One review said the sauce lacked flavor and I think this solution really added some depth of flavor. I also used round cheesy buns instead of a hoagie, and I used a different cheese. I couldn't find broccolini so I had to use normal broccoli florets but they worked just as well. Will probably just be keeping a jar of the romesco in my fridge forever now to add some oomph to every other sandwich I make from now on. This recipe will definitely be on repeat.Ashley AILinköping, Sweden1/6/2021I  have made this recipe several times since discovering it a few months back -- it is that good! I'm a fairly new vegetarian, was in the mood for a Philly cheesesteak (!!!) and wanted to see if I could find a non-meat version that would hit the mark. This Michael Solomov recipe delivers everything I want -- savory, cheesy, toasty deliciousness. As other reviewers have noted, it does make quite a bit of Romesco sauce; but  kept the leftover sauce  in the back of our (very cold) fridge and it didn't go off before we used it all. I roast the vegetables for the Romesco slightly longer than suggested (I like a good quantity of the vegetables to have the roasted brown spots) but generally roast the broccolini for the noted time. Saffy Cooks!New York, NY11/22/2020New favorite dinner recipe! The romesco sauce is delicious & simple to make (I halved the sauce since I only made two sandwiches and still had a ton of leftover). Really, really good sandwich and will definitely make it again.AnonymousQueens, NY6/18/2020This recipe made a TON of romesco sauce. I'm not sure if it was my ingredients, or because I mixed it in a blender, but the sauce was not that great. Needs garlic, maybe sundried tomatoes? And now I have a salsa jar FULL of this stuff... don't waste your bell peppers on this. The sandwich itself was just OK. Sad, but this is not a good one.AnonymousBrooklyn4/28/2020Made this for dinner and it was a hit! I never cooked with broccolini before so I was nervous about the stems, but it was all delicious. Served it with some air fried potato wedges, great with the leftover romesco sauce!AnonymousChicago2/19/2019We have made these sandwiches a few times now, and they are so delicious! The romesco is super simple to make and so yummy paired with the roasted broccolini.AnonymousGeorgia7/22/2018So amazing. Have made this multiple times and think it will be a staple in our home forever. The romesco is DELICIOUS, and you'll likely have some left over—put it on eggs, dip vegetables in it, lick it from a spoon, put it in a grilled cheese.... Anonymoustexas7/2/2018This was unique and delicious. I quartered the recipe to make just one so I think some of my ratios were off, but still the garlicky broccolini and the spice and acidity of the romesco were so good together with all that cheese. YumAnonymousMadison, WI2/25/2018Explore Bon AppétitSandwichRollsBreadAmericanProvoloneCheeseBroccoliVegetableEasyNut-FreeVegetarianHealthyishRoastSuper BowlLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Rooster Soup Co.", "Philadelphia"]}