{"id": "a63a03ced922d698df8bd6f78f3a1881", "url": "https://www.bonappetit.com/story/carolyn-wandell-widdoes-gramercy-tavern", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "Meet ‘Mama’, Gramercy Tavern’s Grande Dame of Servers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMeet ‘Mama’, Gramercy Tavern’s Grande Dame of ServersCarolyn Wandell-Widdoes, aka “Mama,” has been working in restaurants almost her whole life. Here’s what she’s learned.By Elyse InamineJuly 16, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Lifers, our column dedicated to the bartenders, porters, hostesses, and more who have made grinding through the restaurant industry their life’s work.Ask for “Mama” at Gramercy Tavern in New York City, and everyone knows you’re talking about Carolyn Wandell-Widdoes.For 30 years, she’s been working as a server within the Union Square Hospitality Group, mostly at Union Square Cafe, Danny Meyer’s power lunch spot, and now at Gramercy Tavern, the farm-to-table beacon. If you’ve been to either restaurant, you’ll probably recognize Wandell-Widdoes by her tight blond bun, Cabernet-red lips, flashy earrings, and cat-eye glasses with blue eyes that follow your every move. In a nice way, of course. She’s trying to give you the dining experience of your dreams, and she’s an expert at that.For the first installment of Lifers, we sat down with Wandell-Widdoes to find out how she got her start—and what she’s learned on the job.Setting the table at Gramercy Tavern.\nAlex LauWhat was your first restaurant job?“Peachey’s Ice Cream Family Restaurant in Ringoes, New Jersey. It was kind of similar to Denny’s but more of a family-run restaurant, serving old-fashioned burgers and really great ice cream. I was 16 years old and looking to make some extra money. The best part was putting together ‘The Pleasurable Suicide’: 20 scoops of ice cream with bananas, wonderful toppings, and whipped cream.”What’s the most tips you made in one night?“Oh, geez. I remember working at Union Square Cafe on New Year’s Eve sometime in the last century. [Laughs] It’s a pooled house, meaning everyone shares the tips. I made about $400. I’ve always worked in a pooled house type of restaurant, so I never made $1,000 a night or anything like that. With that $400, I paid my American Express bill, so I started the new year right. That’s how I looked at it.”When did you realize you wanted to do this for life, and what convinced you to go all in?“I got my social work degree in 1995. Then, my mother got Alzheimer’s, so I needed to help my father and my sister with taking care of her in Upstate New York. Social work means working overtime, so I couldn’t take days off. I started waitressing because it was more flexible and still gave me the salary I needed to make ends meet. Now after many years, I think of hospitality as a kind of social work.”“When I first walk over to a table, I say hello and welcome everyone, then I read that ‘sign.’ Everyone comes in with a sign.”\nAlex LauWhat is the craziest thing that’s happened on the job?“The day we had a blackout in New York in 2003. I was working the bar during lunch at Union Square Cafe and wondering what we should do. Do I close the cash drawer? Are we closing the restaurant? We ended up closing and prayed that the refrigerators would keep the food fresh. Many of us on staff walked home together over the Brooklyn Bridge. It was very beautiful and unifying.”What is the best perk about the job?“When I see a returning family and the kids are grown up. I get verklempt. Little kids can be picky eaters, and I always had this one trick up my sleeve at Union Square Cafe: I tell them about the pillowy, marshmallow-y clouds with tomato sauce called gnocchi. They’d look at me, thinking ‘Can I trust her?’ but end up ordering it. Years later, they come in and tell me, ‘I’d really like to have that again.’ I love when that happens. It makes me feel like my work is worth it.”Why does everyone call you “Mama”?“I got the nickname from one of the fabulous back waiters at Union Square Cafe. At the end of the night, he would always bring me dessert and I would say ‘Come to mama!’ He told me that ‘mama’ means ‘learned, wise one’ in Swahili, so it became his pet name for me. It just stuck.”On table dynamics: “Some people want power at a business dinner, and you see everyone at the table consulting with them before talking to me.”\nAlex LauWhat qualities make a good server?“Empathy. Compassion. Efficiency. Urgency. Grace. Anything can go wrong—a food order incorrectly handled, a drink falling off the tray—so you need to be quick on your feet and reorganize in the moment. One time Danny Meyer asked me, ‘How do you do this job so well?’ I told him that I imagine myself sitting his seat, thinking, ‘What would I want?’ and then bring that before he even knows that he needs it. I also told him about Mary Kay and how she had this great philosophy about everyone having an invisible sign that says ‘Make me feel important.’ As a salesperson, you read how big that sign is for each person. He goes, ‘I like it!’ That story is in Setting the Table, page 92, and he mentions a ‘wonderful server.’ That’s me.”What is something you are unusually good at now, thanks to this job?“Reading people and lifting their spirits. I can only say that because that’s what people tell me. I set the tone for a blissful experience, whether it’s for my guests or my entire restaurant team to work together in harmony. So I look everyone in the eye, ask the hospitality angels for help, and generally send good vibes. And I make sure the water glasses are always filled. Hydration is key.”She needs to stay hydrated too.\nAlex LauHow have customers changed in the years you’ve been working as a server?“We’re becoming a more global community now, thanks to things like the Internet. People are much more willing to try new things and ‘taste’ new cultures, which is exciting. There’s been 180-degree turn. I think the whole hospitality industry has changed, even with #MeToo. We’ve definitely worked with and served people who crossed the line, and in the past, it took too long to get the situation handled. You had to tell your story over and over again and you didn’t always get a respectful follow-through. But it’s finally being addressed, and here at USHG we’ve recently taken a definitive stand on it: There’s a zero-tolerance policy on sexual harassment. Now we feel more validated and heard.”How have you changed?“I’ve seen it all working in this industry. I’ve touched the lives of over 100,000 people, whether I’ve waitressed their table or served them food. I figured that out about five years ago. I’ve seen people at their best and at their worst. I know I’m not perfect, but I’m definitely a better team player and more compassionate human being because of it.”Meet the man keeping New York City hydrated—with seltzer.Explore Bon AppétitRestaurants + TravelLifersRead MorecultureHow ‘Sweetbitter’ Compares to Real Fine-Dining Restaurant TrainingBy Alyse WhitneyrestaurantsGeneral Life Advice from the Owner of Portland’s Finest Dive BarBy Marnie HanelcultureOur Staffers' First-Ever Food Jobs, from Dishwashers to Ice Cream ScoopersBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast", "Elyse Inamine"]}