{"id": "a6418b3cb833870b55757b635e4bd1f8", "url": "https://www.bonappetit.com/recipe/double-garlic-roast-chicken-with-onion-gravy", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Double-Garlic Roast Chicken With Onion Gravy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueDouble-Garlic Roast Chicken With Onion GravyBy Chris MoroccoOctober 20, 20204.5(51)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“For me, gravy is the thing that makes Thanksgiving feel like Thanksgiving,” says Chris Morocco. This year he’ll celebrate with just his wife and kids, with this garlic oil-coated chicken in place of a huge turkey and a side of Squash and Caramelized Onion Tart. The fast-cooking gluten-free onion gravy goes with everything. Pour liberally.Ingredients4 Servings13½–4-lb. whole chickenKosher salt2garlic cloves, finely grated3Tbsp. (or more) extra-virgin olive oil1Tbsp. garlic powder1Tbsp. thyme leaves2tsp. soy sauce1tsp. mild red pepper flakes or ½ tsp. crushed red pepper flakes1large red onion, cut into 8 wedges through root end½cup dry white wine1cup low-sodium chicken broth or waterPreparationStep 1Place rack in middle of oven; preheat to 425°. Pat chicken dry inside and out and season generously with salt. Mix garlic, oil, garlic powder, thyme, soy sauce, and red pepper flakes in a small bowl.Step 2Place chicken in a medium cast-iron or other ovenproof skillet. Smear garlic oil all over outside of chicken. Roast until skin is golden brown all over, 20–30 minutes. Reduce oven temperature to 350°. Continue to roast, rotating skillet if chicken is browning unevenly, until skin is crisp, leg joints wiggle easily, and an instant-read thermometer inserted into the thickest part of breasts registers 155° and the thickest part of legs registers at least 160°, 35–40 minutes longer. Transfer chicken to a cutting board; let rest at least 20 minutes before carving.Step 3Meanwhile, set skillet with pan juices over medium heat (wrap a dry kitchen towel around handle), add onion, and cook, stirring often, until softened and golden brown, 8–10 minutes (if the skillet looks dry, add a little more oil).Step 4Add wine to skillet and cook, scraping up browned bits, until wine is almost completely evaporated, about 5 minutes. Add broth and cook, stirring occasionally, until gravy looks slightly thickened (it will be a little looser than a regular gravy), 6–8 minutes.Step 5Serve chicken with onion gravy.How would you rate Double-Garlic Roast Chicken With Onion Gravy?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleI made this last week, and it was unbelievably flavorful and not difficult at all to make. I followed the recipe exactly, and it came out wonderful.  My chicken was nearly 5 lbs., so I did cook it about 15 minutes longer than the recommended cooking time.  Just use a meat thermometer to determine when it's done.  Bon appetit!S RoseSan Diego, California2/2/2022I’ve only made this recipe with the onion gravy twice (and it’s great!) but this recipe is my go to whenever I need to make a roast chicken for anything. Tastes so good and is so easy. Love itAbby1/26/2022What would be an alternative to white wine in the recipe?SantanuIndia12/27/2021Time out... A recipe titled \"Double-Garlic\" contains two cloves and 1 tbsp of powder? Let's quadruple the cloves and and double the powder. Then we'll be in better shape.AnonymousMichigan10/27/2021Interesting recipe. What else can I use instead of wine?AnonymousIndia10/4/2021I performed this to the letter and still didn't get crispy skin. I got instead a lot of burnt garlic and thyme along the top. The chicken was moist and tasted great. The gravy was phenomenal in taste but never thickened properly. It's quite thin, which was fine with us but something to note. All-in-all, I want to try it again but not sure how to make the skin crispy like I want.Laura BNashville, TN9/1/2021I am always sceptical of receipts that have you put fresh herbs and garlic on the outside of the chicken, and alas yet again this recipe much like most others is an amazing way to have burnt herbs and garlic all over your lovely roast chicken.\n\nI presume the tempts must be with a fan oven, as no 4lb chicken is going to cook within 35-40mins at 155c.\n\nOverall a poorly written recipe with a poor outcome. I am no idea how this was rated 4.7 for 34 reviews.AnonymousBoston Ma8/29/2021Love this recipe, when I make roast chicken it is the only recipe I use.  It is easy to make, delicious and looks\nbeautiful when done!\nThe gravy is delicious. My family is not crazy about biting into onions so I make sure I grind it in the food processor or sometimes I use onion powder and it works just fine!AnonymousNew Hope,PA2/2/2021Loved this dish. Originally made for Thanksgiving dinner for two and was blown away by the flavor - the onion gravy is to die for!! Have made it once since and it is just about wrapping up in my oven for Christmas dinner as I type this! The leftovers are very tasty and flavorful. This is absolutely a go to recipe for me now. Melissa JonesSan Francisco, CA12/26/2020Made this for Thanksgiving solo, to the letter of the recipe, and it was sensational. The chicken was perfectly cooked throughout and the flavor of the gravy was amazing and really lit up the instant mashed potatoes I served with it (I made 4 dishes from scratch on my lonesome, I am allowed instant potatoes.) It also kept flavorful for days of leftovers. The recipe is simple but it goes to show how much technique can do. I've decided to make it again for Christmas, but I was less careful to get every necessary ingredients, so I'll be attempting the gravy with yellow onion and white wine vinegar. But - I now have chicken stock from my freezer, made from the carcass of my first pass at this bird, so I'm confident that it will still be totally delicious.BreeHouston, TX12/25/2020Made this and it was very good. Sprung for a fancier chicken and the taste difference was worth it. Would definitely make this again.YusufAlexandria, VA12/10/2020My niece made this chicken for my birthday dinner which is in November 2020. My mother who will be 94 soon said she thinks this was the best chicken she ever had ! Maybe we will make it again for Mama's birthday in December. Destined to be a family favorite . Thank You ! \nElizabeth BrimPenland, North Carolina11/24/2020To Wildbill:  I wouldn't strain the gravy.  Red onion  being cut into wedges is for presentation and side dish purposes.  Serves the wedges along side the chicken.  If the gravy was to be strained, the onion would be minced or chopped. a cook Alberton, MT11/22/2020This looks terrific!  I plan on this for Thanksgiving.  For the gravy the recipe looks like straining is called for.  Is that so?  Thanks😷wildbillWhidbey11/22/2020While I have not made this recipe and it looks delicious, I wanted to make sure a note is made that this is NOT a gluten free dish. Soy sauce has gluten and therefore there will be gluten in the gravy. I just wanted to warn in case someone has a high sensitivity and isn’t aware soy sauce has gluten. Wiley PaylorOklahoma City11/20/2020Explore Bon AppétitChickenPoultryMainGluten-FreeRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Chris Morocco"]}