{"id": "a64df4bc5d6e646efe7ba5d856bbcae6", "url": "https://www.bonappetit.com/story/vegan-banana-pancakes", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "A Vegan Banana Pancakes Recipe That’s Perfect for Lazy People Like Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Banana Pancake Recipe That’s Perfect for Lazy People Like MeYou probably have all the (vegan!) ingredients in your kitchen right now.By Emily SchultzFebruary 11, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Laura RegeFacebookTwitterEmailDo you know what a Finstagram is? If not, let me explain. It’s a private Instagram account that people use to share things they wouldn’t share on their “main” Instagrams. 2019. Really quite a time to be alive. I don’t have a Finstagram because my job is to run all of the Instagram accounts for this place, but if I did, my handle would definitely be something like Saltygurl93. If you’re wondering why, it’s because my sweet tooth was replaced with double the salt tooth. I love everything savory, especially when it comes to breakfast items. Shakshuka, breakfast salad, frittatas–you name it.This is a story about how I went from Saltygurl93 to PancakePrincess93.One random morning, I woke up with a craving for something sweet that was so strong I couldn’t ignore it. It felt too early for cake, and I recently threw my waffle maker out in a Marie Kondo style spree. It felt like the best option would be pancakes. So, I poked around in my pantry for viable pancake ingredients and hopped on Google looking for something simple. I came across this recipe, scanned my kitchen, realized I had all of the ingredients, and dove in.First I smashed an overripe banana that had been sitting on my counter a little too long, then I added a drizzle of oil and ⅔ cup of almond milk. I opted for some maple syrup because I still wanted a little pancake-house sweetness in my life, then in went cinnamon, baking powder, and a pinch of salt. This recipe calls for buckwheat flour, but I had whole wheat so I subbed that. Use what ya got! And if you have leftover whole wheat flour, you should make these flatbreads. Sorry for the aside, I just really like bread! And whole wheat flour! Deal with it!I whisked it all nicey nicey, then doled out the batter into little pancake blobs on my non-stick. In less than one Friends episode, I had a stack that looked just like those leaning towers of pancakes you see on the commercials! Truly! I’m not vegan, so I mixed together some honey and butter and spooned that right on top of the stack.These vegan banana pancakes don’t require one thousand things like buttermilk or fancy grains, and they come together fast enough for your random Saturday morning banana pancake craving. And yes, I played the Jack Johnson song while I ate them.Get the recipe:Why Everyone (Yes, Everyone) Should Make These Vegan Banana PancakesYou don't have to be a veg-head to love these banana and buckwheat vegan pancakes.View StoryExplore Bon AppétitHealthyishVeganPancakeBreakfastBananaRead MoreLifestyleThese Muesli Muffins Are Peak Fall...And They Happen to Be Gluten FreeBy Anna StockwellRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-11", "author": ["Condé Nast", "Emily Schultz"]}