{"id": "a64d88d5f7b543cafcd1b6829dd6d473", "url": "https://www.bonappetit.com/story/dave-grohl-backbeat-bbq", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "How Dave Grohl Got Hooked on Barbecue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDave Grohl Is Hooked on BarbecueFour years ago the musician was messing around with a Big Green Egg. Now he’s cooking ribs for 400 people.By Dave Grohl, as told to Adam RapoportMay 29, 2019FacebookTwitterEmailPhoto by Harry EelmanFacebookTwitterEmailWhen I was in Nirvana and Nevermind came out, all of a sudden I was making a ton of money, which was something I never had. So I bought a beach house in Nags Head, NC, and spent the entire summer of ’92 there, eating Carolina pulled pork from this tiny shack. I would get a pint and eat it until it ran out, then I would get another pint until it ran out—just pulled pork on a white bun with slaw, and that was it. I realized, Oh, this is barbecue: so simple, but sublime and complex.I broke my leg falling off the stage during a Foo Fighters show four years ago. When I got off tour, I had nothing to do but mess around with a Big Green Egg that our bassist Nate got me. I went on YouTube and watched some guy. The first thing I tried was ribs because that’s what’s on the Chili’s commercials. I got the dry rub, hit them with smoke, and served them to my kids. They loved it. Everyone only got like two ribs so I said, I'm doing this again tomorrow! I was hooked.Most musicians are obsessive compulsive weirdos, whether it’s the instrument that they play, or an arrangement, or composition. You’re always trying to one up the thing you’ve just done, or perfect it, or get to the place where you’re playing your instrument but you’re not actually thinking about it. It’s kind of the same with food. The parallels are insane.Grohl making barbecue in a parking lot.\nPhoto by Harry EelmanAfter a few months, I was hosting parties for 50 to 75 people. The Egg was no longer big enough, so I got a cabinet smoker, then a Lang trailer rig from Georgia. I was doing brisket and pork butt. At this point, friends were saying, “Dave, this is really good—you should open a restaurant!” And I’m like, “I don’t know, that kinda sounds like a job.”What really got me cooking for a crowd were the Malibu fires. I wanted to cook for everyone who was displaced. I ended up barbecuing hundreds of pounds of meat and bringing care packages to the fire stations, just to say thank you. Those guys were heroes.That’s when I had the idea for Backbeat BBQ, my one-man catering company. I didn’t want to open a restaurant, but I did want to pull up at a Slayer show or a Harley dealership or a church or the L.A. Food Bank benefit and cook. It’s kinda cool that I’m able to do that—and it’s f*#%ing fun!The process of making music is a lot like cooking for a crowd: You create a recipe as you would a song. You prepare a meal as you would record in a studio. And you serve it as you would perform live. When people come back for seconds, well, that’s your encore.Listen to the full interview on our the Bon Appétit Foodcast:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitBarbecueCelebritiesFirst PersonRead MoreculturePaul Rudd Loves This Kansas City Barbecue Sandwich So Much, He Flies It to NYCBy Paul Rudd, as told to Alyse WhitneyLifestyleJapanese Breakfast on Making Her Mom’s Kimchi Soup and Embracing Her Half-Korean RootsBy Alyse WhitneycultureChrissy Teigen on the Long Road to Making Her Second CookbookBy Alyse WhitneyLifestyleUnbreakable Kimmy Schmidt Cast Gets Real About Viral Food TrendsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Dave Grohl", "As Told To Adam Rapoport"]}