{"id": "a652caf7474729b1be1ff7c871113110", "url": "https://www.bonappetit.com/story/chocolatey-chia-pudding", "year": 2019.0, "month": 1.0, "day": 1.0, "content": "This Chocolatey Chia Pudding Is the Dessert We're Eating Every Night of the Week | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Chocolatey Chia Pudding Is the Dessert We're Eating Every Night of the WeekThe Feel Good Food Plan knows that a square of dark chocolate does NOT equal “dessert.”By Zoë SessumsJanuary 3, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailThis story is part of the 2019 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.I am not the type of person who passes on dessert. So when Molly Baz mentioned she created a dessert chia pudding inspired this recipe, I knew I was in for something cold, creamy, and flavorful. Because the Feel Good Food Plan knows better than to suggest that an apple or one square of dark chocolate be my “dessert.” And once you make a big batch of this recipe, you're set for a week of healthyish desserts, not to mention that the ingredient list means it's totally acceptable as your morning meal.The only hard part of making this Chocolate-Cashew Chia Pudding is waiting the six hours for the chia seeds to thicken, chill, and soak up the rich cinnamon-chocolate liquid. It all together in basically two steps: blending and assembling. First you blend a dozen or so pitted Medjool dates with cashew milk, raw cashews, cocoa powder, vanilla, salt, and cinnamon. I bought dates with pits, so it slowed down the process. Even so, I found it to be a therapeutic moment, standing in my kitchen, peeling apart the soft and squishy dates, nibbling the sweet bits off my fingers. I made the process slightly challenging by using my Ninja Personal Blender (note to self: get a real, full-sized blender, so I had to blend half the ingredients, pour the concoction into a large bowl, and repeat the process. With proper tools, this takes about two minutes, but my version still came out like a dream.From there you transfer the date milk to a quart-size jar or resealable container. I used a couple old take-out containers when, again, I realized I didn't have anything as big as a quart (the recipe is very forgiving). Stir in your white chia seeds—black ones are fine too, the color is all about aesthetics—cover, and chill. The small seeds work their magic, thickening the mixture while adding fiber, protein, and omega-3s. Baz noted that the ratio of liquid to chia is higher than what you see in other chia puddings. This makes it more thick and puddingy.While your chias are chilling, you make your maple yogurt. I used coconut yogurt, but another fabulous aspect of this recipe is how adaptable it is. Use Greek yogurt, almond milk yogurt, or whatever variety you like as long as its plain and unsweetened. Stir the yogurt and a little bit of maple syrup in a medium bowl, then transfer the mixture to a resealable container or use the yogurt container itself.The final step is a choose-your-own-adventure assembly. You can alternate layering spoonfuls of the chia pudding and maple yogurt in a small ramekin or glass, then drizzle it with extra maple syrup, a sprinkling of flakey sea salt, and a dusting of cinnamon for a just-sweet-enough dessert. You can dollop the rich, chocolate pudding on top of some morning oatmeal. You can scoop your spoon straight from the container to your mouth, still standing in front of the open refrigerator door, and exclaim to the empty room, \"Holy wowowow!\" The recipe gives you between four and six servings, so you can go in for a few spoonfuls multiple times a day.Get the recipe:Chocolate-Cashew Chia PuddingThis chia pudding is delicious on its own—and even better when layered with maple yogurt as a parfait.View RecipeExplore Bon AppétitHealthyishFeel Good Food PlanChiaCashewDessertChocolatePuddingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-03", "author": ["Condé Nast", "Zoë Sessums"]}