{"id": "a6537b7f1a2f237802b6d4b124e16720", "url": "https://www.bonappetit.com/recipe/baked-eggs-and-greens-in-harissa-tomato-sauce", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Baked Eggs and Greens in Harissa Tomato Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueBaked Eggs and Greens in Harissa Tomato SauceBy Kendra VaculinFebruary 8, 20225.0(9)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Kendra VaculinEmailPinterestPrintEmailPinterestPrintThese baked eggs are as good for a speedy weeknight dinner as they are for a festive brunch, and the pan-crisped croutons soak up just enough sauce to create wonderfully crispy-gone-soggy texture. Some brands of harissa are spicier than others, so be sure to taste as you go and adjust the crushed red pepper flake usage depending on how spicy you’d like your finished product.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Straight-Sided Skillet$290 $199 At AmazonBamboozle Nesting Bowls$80 At Bon Appétit MarketWooden Spoon$6 At AmazonCan Opener$14 At AmazonIngredients4 servings128-oz. can whole peeled tomatoes½small loaf country-style bread, torn into 2\" pieces (about 3 cups)5Tbsp. extra-virgin olive oil, divided, plus more for servingKosher salt, freshly ground pepper2garlic cloves, coarsely chopped3Tbsp. capers¼tsp. crushed red pepper flakes3Tbsp. harissa paste1Tbsp. double-concentrated tomato paste1bunch Tuscan kale, ribs and stems removed, leaves coarsely chopped4large eggs1cup plain whole-milk Greek yogurtCoarsely chopped parsley (for serving)PreparationStep 1Preheat oven to 425°. Place tomatoes in a medium bowl and crush with your hands into small pieces. Set aside.Step 2Place bread in a large bowl. Drizzle 2 Tbsp. oil over and season with salt and black pepper; toss to coat. Heat 2 Tbsp. oil in a medium ovenproof high-sided skillet over medium-high. Transfer bread to skillet, arranging in an even layer; reserve bowl. Cook bread, undisturbed, until browned and crisp underneath, about 3 minutes. Continue to cook, tossing occasionally, until browned and crisp on all sides, about 3 minutes more. Return to reserved bowl.Step 3Pour remaining 1 Tbsp. oil into skillet. Add garlic, capers, and red pepper flakes. Cook, stirring often, until starting to soften, about 1 minute. Add harissa paste and tomato paste and cook, stirring constantly, until garlic and capers are coated and pastes are dark red, about 1 minute. Add kale and reserved tomatoes; season with salt and black pepper. Cook, stirring often, until kale is slightly wilted and sauce is slightly thickened, about 3 minutes. Remove from heat.Step 4Stir toasted bread into sauce, then make 4 wells in mixture. Crack an egg into each well and season with salt and black pepper. Transfer skillet to oven and bake mixture until egg whites are set but yolks are still runny, 5–8 minutes.Step 5To serve, dollop yogurt on top of baked eggs, drizzle with more oil, and scatter parsley over.How would you rate Baked Eggs and Greens in Harissa Tomato Sauce?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleBread turns to mush even with pan frying it beforehand.  \nAnonymous3/25/2022Excellent and easy. I didn’t have any harissa so I used a little extra tomato paste and more red pepper flakes. Very tasty and perfect degee of hotness.Anonymous2/21/2022Wonderful and simple! Loved the addition of bread into this. I used a very stale and hard baguette that softened up beautifully in the spicy and briney sauce. I will definitely be making this for the family again and again. AnonymousNew York, NY2/13/2022Explore Bon AppétitEasyQuickWeeknightDinnerBreakfastLunchVegetarianNut-FreeEggCanned TomatoTomatoVegetableKaleLeafy GreensHarissaCondiments, Sauces & PastesMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}