{"id": "a65ef8c67e04986aeb678a51d93205ec", "url": "https://www.bonappetit.com/recipe/lemony-cabbage-with-mint", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Lemony Cabbage with Mint Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueLemony Cabbage with MintBy Maydan, Washington, D.C.August 14, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintWhen all the flavors meld, the dried mint blooms and transforms this dish into an addictive slaw that pairs well with fatty cuts of meat. This recipe is from Maydan in Washington, DC, our No. 2 Best New Restaurant 2018.Ingredients8 servings 1cup fresh lemon juice¼cup dried mint1medium head of cabbage (about 1½ lb.), halved, very thinly sliced2tsp. kosher salt, plus more¼cup extra-virgin olive oil, plus morePreparationStep 1Combine lemon juice and mint in a large bowl. Add cabbage and 2 tsp. salt.Step 2Toss cabbage with your hands for a few minutes, squeezing to help soften (the lemon juice and salt will continue to tenderize it as it sits). Add ¼ cup oil and toss again to coat. Cover and chill at least 2 hours and up to 12 hours.Step 3To serve, taste and season with more salt and drizzle with oil.How would you rate Lemony Cabbage with Mint?Leave a ReviewTell us what you thinkExplore Bon AppétitAmericanMintHerbs & SpicesCabbageLeafy GreensVegetableEasyStarterSideVeganVegetarianDairy-FreeGluten-FreeNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Maydan", "Washington"]}