{"id": "a66cea611713f0891018b0cee610587b", "url": "https://www.bonappetit.com/story/steam-fry-steam-roast", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Steam-Roasting and Steam-Frying Will Help You Achieve Perfectly Cooked Roasted Vegetables and Pan-Fried Dumplings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Better Steaming and Roasting, Just Add WaterDrier isn’t always better.By Christina ChaeyMarch 18, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailWe’re taught that moisture is the enemy when roasting or frying foods that we want to get perfectly crispy and/or golden brown. So the two techniques I’m about to discuss may seem counterintuitive: In each of them, a splash of water improves rather than sabotages a batch of crispy roasted potatoes or lacy pan-fried dumplings.The key methods to know are steam-frying and steam-roasting. Both involve adding just enough water to a pan or skillet of food to create a little steam. That steam power helps everything cook evenly and all the way through. Steam-frying happens on the stove, while steam-roasting happens in the oven. So when and why do you want steam creeping around as you fry and roast? Read on:Steam-FryingWhen you want to cook something through without burning the undersides—think juicy dumplings with crispy bottoms or perfect sunny-side up eggs (no more patches of translucent/gloppy/uncooked whites!)—a bit of water is your ally.There are two ways you can do this. One option is to add a little water to a cold skillet at the same time you add your cooking oil and food. Heat everything together, covered, until the food you’re cooking absorbs some of the water, while the steam helps to cook the ingredient’s top as well as its bottom. When you uncover the pan and allow the rest of the water to evaporate, the oil can do its thing and turn your food golden brown. This is a common way to cook pan-fried dumplings so that the filling stays juicy while the bottoms get nice and crisp.Alternatively, you can pan-fry your food first, and then after you’ve achieved the desired level of color, carefully add a splash of water and immediately cover until everything is cooked through. The water will quickly convert to steam to form a dome of enclosed heat that will quickly cook bulkier vegetables like broccoli or fennel and wilt big piles of greens. Since you’ll be adding water while your cooking oil is already quite hot, have a lid ready to immediately cover the skillet and protect yourself from any hot-oil splatters.Add a bit of starch to the water and voilà—a crispy dumpling skirt!\nPhoto and Food Styling by Sohla El-Waylly Steam-RoastingSometimes it’s important to sap every bit of moisture out of whatever you’re oven-roasting—for crispy-skinned chicken, say, or a tray of perfectly blistered asparagus. But in other cases, a little water added to a foil-covered pan creates steam (sound familiar?) that keeps sturdier vegetables such as potatoes, halved beets, and whole carrots from drying out or toughening up in the oven.Perfect roasted potatoes begin with…water!\nLike steam-frying, you have two paths for steam-roasting: You can first steam your veg until tender with ½ cup of water on a foil-covered baking sheet; carefully tip out any excess liquid, toss with oil, salt, and pepper, and roast uncovered (this method prioritizes crispy edges). Or, you can toss the veg with oil in a 13x9\" baking dish and pour in ¼ cup water before covering with foil. By the time your vegetables are tender, they’ll be creamy inside, with caramelized, if not crisp, exteriors.It’s about to get steamy:Perfect Oven-Roasted PotatoesCrispy. Creamy. Salty. And all the other things roasted potatoes were born to be.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-18", "author": ["Condé Nast", "Christina Chaey"]}