{"id": "a686c3a105aba55cb192029bab25550c", "url": "https://www.bonappetit.com/story/jimmy-fallon", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "The Very Fancy Tea Party of Jimmy Fallon's Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Very Fancy Tea Party of Jimmy Fallon’s DreamsThe actor, comedian, and host of The Tonight Show would invite one guest and one guest only. (Hint: 👑.)By Dawn DavisNovember 27, 2021FacebookTwitterEmailIllustration By: Joana PartykaFacebookTwitterEmailWelcome to Dream Dinner Party, where we ask notable figures to describe just that: the dinner party of their dreams.While we’re in the high season of cocktail parties and seated dinners, of epic reunions with family and friends, of long-awaited trips to tropical destinations, the incomparable Jimmy Fallon is going all in on…tea. So of course we needed to ask the late-night host who he’d invite to his dream tea party.I understand that during the lockdown you got into tea, chasing an immunity-boosting elixir. So we’re going to change the rules a bit for you. Instead of a dinner party, you can throw the tea party of your dreams.Yes, I got into astragalus root during the pandemic. I added mint to give it a bit more flavor.Which three people get invited to your party? Please don’t give me a dozen names. As a rule I never go out with more than three people. I like having conversations and want to hear people’s stories. But for this party there’s only one guest: the Queen of England. I’d love some one-on-one time with Her Majesty.Won’t that be intimidating? Just you and the queen?No, this will be a ’70s Disco Murder Mystery party. We will start by setting up our characters and then we’ll play music. I hear she loves ABBA’s “Dancing Queen.” We’ll do the hustle, then we will get down to tea. Maybe, if she’s relaxed enough, we can even take a selfie.Parlor games, how perfect. I understand they are popular with the royals. But what about the tea? It has to be on point. What kind do you serve Her Majesty?I love sencha myself, but for the queen, I’m thinking Earl Grey. That’s classic.How do you dress for tea with a queen?We would both wear twinsets and matching fancy gloves, of course.After you bond over disco music and games, it would be great if she were relaxed enough to tell you what she actually thinks about The Crown. Beyond that, what do you ask her?What it is that gets you through it? The decisions, the stress. There has to be something. Your kids? Your grandkids? She’s always ahead of the game, ahead of the curve. I would want to know: How do you make those tough decisions, year after year, decade after decade? And what makes you laugh?I imagine that after such a scintillating discussion, you’ll be too excited to just go home and check your email. So you head out to your favorite restaurant in New York City. Which one is that?I’d go to Eleven Madison Park. I just tried it. It blew me away. I love the chef, Daniel Humm. He just zigs when everyone else zags. He’s got the best restaurant in the world, so he goes and does something totally different out of his comfort zone.I’m sorry to say this, but I think there’s a good chance the queen may decline your offer. You get to put together another tea party. Who do you ask this time?If I get to invite one other person living or dead, it would have to be Prince. He was a friend of the show. And like the queen, he was very funny, and I don’t know if people knew that. He had a sense of humor.Something you would know a thing or two about, Jimmy.Explore Bon AppétitDream Dinner PartyPop CultureInterviewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-27", "author": ["Condé Nast", "Dawn Davis"]}