{"id": "a68b09a7178c6dcb563b8e41b4d1e3d0", "url": "https://www.bonappetit.com/story/how-to-introduce-new-recipes-on-thanksgiving", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "How to Introduce Your Family to New Recipes on Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHelp! I Want to Introduce a New Recipe to Thanksgiving Without Disrupting Precious Family TraditionsSo grandma wants to make her classic stuffing but you want to make a newfangled version with chorizo... By Tyler KordNovember 20, 2019FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, Food Styling by Rebecca Jurkevich, Prop Styling by Angharad Bailey FacebookTwitterEmailCooking food (not to mention sharing it with others during a loaded, fraught holiday) can be confusing. So in Unprofessional Advice From a Professional Chef, we ask Tyler Kord (the professional chef) the hard-hitting questions.Q: How can we introduce a new recipe to a Thanksgiving menu full of precious family traditions?A: I mean, is this new recipe good? Is it really, really good? Do you think that a tired, stressed out, overworked editor at a food magazine had a new idea about stuffing this year that just so happened to be the greatest thing since sliced bread got cubed, toasted, and drenched in butter and turkey fat…or do you think they’re just throwing ideas out there and taking pretty pictures for the sake of holiday content?While I too love to read that content, I’m not sure it’s worth inciting a family fight before you even get the chance to talk about Joe Biden’s electability. And if, the first thing that comes to mind when you think about celebrating the colonists and Native Americans breaking bread together is bread pudding rather than the difficult history of colonists and Native Americans and the way we just throw it out the window when it’s time for a party...maybe now’s the moment to give it all a little more thought anyway, no? I’m sorry, you asked a simple question and I am not helping, but there are PLENTY of “hot takes” on this historically-fraught holiday out there that don’t even touch on the fact that there’s something deeply wrong with celebrating violent colonization, so maybe go read one of them if you want advice on how to introduce your fresh cranberry sauce to a family who only likes the canned jello stuff.Or stay here and I will try!When it comes to cranberry sauce, simple is best. \nPhoto by Laura Murray, Food Styling by Pearl JonesBut first, I have a few questions: What is this recipe? Is it better than Idaho potatoes that have been boiled and mashed with cream, butter, and a ton of salt? Or a turkey that’s been seasoned, oiled up, and roasted until it’s brown and amazing? And do you really think that somebody has come up with something better than gravy? I’ll tell you, sometimes I add some parsnips to my mashed potatoes. But who cares? While I think my food comes out great, everybody is different and I don’t know the tastes of the people you’re eating with and I wouldn’t presume to.So my advice is that there are 364 days a year that are not Thanksgiving, and if your family or friends or coworkers have a specific set of dishes that they want to make and eat on this one specific day, I’m not entirely sure why you’d want to change that. Traditions can be cool! Innovation is cool too, but food media (and this website is no exception!) needs to constantly innovate. It’s a lot like capitalism in that it needs to grow, and to grow it needs people to get excited, and to get people excited it needs to keep finding new ways to throw just a few ingredients in a pot and produce something new and amazing in 15 minutes and, oh no, my metaphor was off because somewhere in there I was going to talk about how capitalist economies have to keep growing but that growth comes at the expense of other economies and I lost the thread. But the point is that maybe all of the new content is making people feel like their traditions are boring or not as “bold,” “nom-nom-able” or “tik tock-gram-worthy” and maybe that is why you’re asking me this question in the first place?And here I am, assuming that your grandmother makes turkey and stuffing every year and you want to make some ten-minute-sous-vide-sheet-pan-sweet-potato-casserole you read about in the New York Times when, in fact, your step-father makes saag with turkey and you want to introduce some special noodle recipe you translated from ancient Sumerian and I am not helping by ranting about colonialism and “content” and I am sorry, but I AM VERY HUNGOVER AND I COULD TOTALLY WORK ON THIS TOMORROW BUT I AM ALMOST DONE SO BEAR WITH ME PLEASE.Oooooh yeah. \nAll that said, it’s a weird holiday that has something to do with bounty and cornucopias and maybe I’m just being too harsh. So go ahead, just make the dish. Whatever it is. Holidays and big meals, whether with family or  strangers in a hostel, are about excess. And I don’t mean lobsters and caviar excess (though I do like those things)—I mean the excess that results in eating that same meal in sandwich form for a few days. What’s an extra dish anyway?Of course, if you’re going to somebody’s house and haven’t been asked to bring anything, don’t show up with a 25-pound turkey and an outdoor frying rig because nobody will be pleased by that. Actually, I take it back, do that and take photos and email them to turkey_notthecountry_explosion@basically.com. And actually, if I’ve just entirely misunderstood this whole thing and it’s just a question of etiquette, then there is a different column for that.Or, as I implied before, you could just cook your Thanksgiving truth meal any day that’s not the last Thursday of November. Seriously! I love Thanksgiving food but the celebration of invading another country feels off anyway. If you’re just looking for an excuse to cook lots of stuff you’ve been meaning to make, then go have the meal that your family wants you to have, and then cook the meal you desire in the middle of summer or spring, or even winter! If the point of Thanksgiving for you has nothing to do with pretending that the politics of the 17th century were all peaches and cream and more about arguing with family and friends about current events, then please don’t forget that you can do that any time of year. Invite a bunch of people, and get crazy with the bounty of whatever is in season at the time, though I vote that there should still be mashed potatoes, stuffing, and gravy because I may not show up if they’re not invited, too.Explore Bon AppétitThanksgivingUnprofessional Advice From A Professional ChefRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-20", "author": ["Condé Nast", "Tyler Kord"]}