{"id": "a694b20e1e6d8859ff780e461c627497", "url": "https://www.bonappetit.com/recipe/chaider", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Chaider Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueChaiderBy Molly BazFebruary 8, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Yekaterina Boytsova, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis chaider recipe is our warm, spiced-up, wintery alternative to bulletproof coffee. It’s a sweet mash-up of masala chai flavors and mulled cider, with an unexpected buttery finish to smooth it all out.Ingredients2 servings3½cups fresh apple cider18green cardamom pods, lightly crushed13\" cinnamon stick, broken into pieces with the flat side of a chef’s knife12\" piece ginger, peeled, thinly sliced6whole cloves1tsp. black peppercorns4black tea bags, such as PG Tips2tsp. ghee, unsalted butter, or virgin coconut oil (optional)PreparationStep 1Bring apple cider, cardamom, cinnamon, ginger, cloves, and peppercorns to a boil in a medium saucepan over medium-high heat, stirring occasionally. Reduce heat to medium-low and simmer gently, stirring occasionally, until reduced by about half, 8-10 minutes. Remove from heat. Add tea bags and press down to submerge. Cover and let steep 5 minutes.Step 2Strain tea mixture through a fine-mesh sieve into a large measuring glass, pressing firmly on solids to extract as much liquid as possible. Wipe out saucepan. Return chaider to saucepan and reheat over medium until just barely simmering.Step 3Divide chaider and ghee, if using, between mugs. Serve hot.Step 4Do Ahead: Cider and tea mixture can be made 5 days ahead. Strain and chill. Gently reheat in a small saucepan over medium heat.How would you rate Chaider?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleIf I want to double or triple this recipe, do all of the spices need to be increased the same amount?Anonymous11/19/2019Explore Bon AppétitHot DrinkDrinks AllApple CiderAlcohol & Other DrinksCardamomHerbs & SpicesCinnamonFallWinterQuickEasyDrinksGluten-FreeVeganVegetarianDairy-FreeNut-FreeNonalcoholicHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-08", "author": ["Condé Nast", "Molly Baz"]}