{"id": "a69d67b1ee61a24ec2ae7c36a69836c8", "url": "https://www.bonappetit.com/recipe/meaty-beef-chili", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Beef Chili Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueBeef ChiliBy Claire SaffitzJanuary 9, 20184.9(31)Read ReviewsTriangleEmailPinterestPrintBobbi LinEmailPinterestPrintEmailPinterestPrintIt’s faster and easier to brown the meat in larger pieces first and chop them afterward. Using intact dried chiles instead of jarred powders contributes a more complex flavor and a saturated color. Adding lager imparts just the right amount of bitterness, rounding out the chiles. This is a part of our Super Bowl party menu—see the rest of the recipes here.Ingredients12 servings4large or 6 medium ancho chiles2dried guajillo chiles2dried pasilla chiles3tablespoons extra-virgin olive oil5pounds boneless beef chuck, cut into ½-inch slicesKosher salt, freshly ground pepper2large yellow onions, chopped6garlic cloves, finely chopped1tablespoon ground cumin2teaspoons dried oregano114.5-ounce can fire-roasted crushed tomatoes3tablespoons dark brown sugar112-ounce bottle lager2teaspoons apple cider vinegarToppings as desired (sour cream,  grated cheddar, chopped red onion, lime wedges, cilantro, sliced avocado, pickled jalapeños, corn nuts, and don't forget Fritos)PreparationStep 1Remove seeds from ancho, guajillo, and pasilla chiles and place in a medium bowl. Pour in 3 cups boiling water and cover bowl tightly with plastic wrap; let sit until chiles are softened, 20–25 minutes. Transfer chiles and soaking liquid to a blender and blend on high until smooth, about 1 minute; set aside.Step 2Heat oil in a large Dutch oven or other heavy pot over medium-high. Season beef all over with salt and pepper. Working in 2–3 batches, cook, turning pieces once, until browned, about 5 minutes per side. Transfer to a plate.Step 3Reduce heat to medium; add onions and garlic to pot. Cook, stirring often to loosen browned bits from bottom of pot, until onions are translucent and very soft, 6–8 minutes. Add cumin and oregano and cook, stirring, until spices start to stick to pot, about 1 minute. Add tomatoes and brown sugar and scrape bottom of pot to loosen spices, then add lager. Bring to a lively simmer and cook, stirring occasionally, until beer is almost completely evaporated, 10–15 minutes.Step 4Meanwhile, cut beef into ½\" pieces, discarding any large bits of fat or gristle.Step 5Add beef, reserved chile purée, and 2 cups water to pot; season with salt and pepper. Bring to a boil, reduce heat, and simmer gently, uncovered, until liquid is thickened and meat is very tender, 1½–2 hours. Taste chili and season with more salt and pepper if needed. Remove from heat and stir in vinegar. Divide chili among bowls and top as desired.Step 6Do Ahead: Chili can be made 4 days ahead. Let cool; cover and chill. Reheat gently over low, stirring occasionally, and adding a splash of water to loosen if needed.How would you rate Beef Chili?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleAs others have noted, this recipe is foundational - a solid grounding on the fundamentals of beef chili stew. Once you have this under your belt you are free to improvise around the edges. This time around I added tomatillos. The chili puree can be tweaked endlessly. Grind the best cumin seeds you can find, use Mexican oregano. Fry it all in Bison tallow, use the best fat you can find, use bacon fat. Use maple syrup instead of sugar, balsamic instead of apple. It's time consuming and labor intensive but when you truly grasp what serarates this technique from a typical chili recipe you will have learned an important lesson in cooking, one that applies across the board in every cuisine. Robert HaavieNew York1/23/2022Just tried this for the first time and won a little chilli competition. I had to make a few slight adjustments, I added 2 cans of kidney beans because, well this is chili after all. I also didn't have the same peppers available so I substituted Serrano and put them in with the garlic. \nIt was a big hit.MACThe Ozarks of Missouri12/19/2020I get so many compliments every time I make this, and frankly, they are deserved.  This recipe is just a total winner.  linkin22luke6400Denver, Colorado10/9/2020hands down one of the best chili recipes i've found!!! i never follow cooking recipes to the tee, i'm a natural improviser but i have always used this as a reference point and my chili comes out on point every timesheisflamemojiDallas, TX4/20/2020Make this recipe, it's delicious! It has a deep, developed flavor and is very filling. I could only find dried pasilla chiles in my local grocery store so that's what I used. Favorite toppings: crushed fritos, sour cream, diced red onion, shredded cheese and pickled jalapenos! whitneybPORTLAND, OREGON3/20/2020This chili is amazing!! Though I will also say that I think it takes a lot better the 2nd and 3rd day than it does the first. Give that chili time to marinate in it's own deliciousness! hhastingsPortland, Oregon1/16/2020Made it today. Followed the recipe. No changes. Pretty good. Not amazing. I was looking for a bean-less recipe because not everyone in my family likes beans. More like meat soup than chili. Could use some vegetables, perhaps. Or serve it over cornbread. The flavor is unique and good. And the process with the peppers is a good one to know. Definitely reusable in other recipes and a nice alternative to chili powder. Only other thing is three T of brown sugar is probably too much. shawnmizeMidwest12/28/2019This recipe is virtually perfect. Balanced in all the right ways and exceptionally beefy. Followed the recipe exactly and it yielded an end result that people scraped the bottom of the pot for. You won me a chili cook-off, thanks Claire!Not-a-goatThe North11/30/2019This recipe is fantastic! I make it at least a few times a year (started the month it was published) and my guests applaud it. I'm so happy to find a recipe that doesn't require me to toast the chiles -- I still haven't gotten that down!\nQuestion: instead of soaking the chiles in a bowl and transferring them to a stand blender, couldn't you just start them out in the stand blender and soak them there? Is there any reason not to? Thanks!AnonymousTexas10/30/2019Ground beef chili is an abomination. This here is the real thing. Beautiful. JeromeFMidwest8/28/2019The absolute best chili I have ever had. I took it to a chili cook off and I had NO leftovers. I will never make another chili again siennafrancescaCalifornia 4/14/2019This chili is fantastic! So flavorful and hearty. AnonymousCalifornia3/2/2019made this recipe for a party and literally everyone said it was the best chili they had ever had. One person said she didn't usually even like chili, but asked me for this recipe because she wanted to make it. \n\nMy wife likes beans in chili, so we made half of it with beans, and it was a totally fine addition. \nAnonymousLos Angeles2/5/2019This recipe was to die for. I will honestly never make another chili again. Everyone that was at my little football party was raving about it, calling it the best chili they've ever had. HIGHLY recommend. If you're concerned about spice (my fiance has heartburn problems), just cut the amount of peppers in half. These particular peppers are not super spicy, just flavorful and smokey. sbalashMassachusetts2/1/2019We've made this several times now and it's by far the best chili recipe ever. Full stop. We live in the UK at the moment so swapped chilis for what we could find (used a mix of red and green chilies, jalapeños and scotch bonnet peppers). It has the perfect amount of heat, warmth and sweetness. Highly recommend. AnonymousLondon1/6/2019Explore Bon AppétitChiliStewSoups and StewsCanned TomatoTomatoVegetableAncho ChileChileBeef ChuckBeefMeatPasilla ChileGuajillo ChileWinterEasyOne-Pot MealsWeeknight MealsMainNut-FreeDairy-FreeSimmerSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Claire Saffitz"]}