{"id": "a6a9fc702db340b11c672c10589f3eb0", "url": "https://www.bonappetit.com/story/writing-wines", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "5 Great Writing Wines, aka Wines to Drink on Deadline | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture5 Great Writing Wines, aka Wines to Drink on DeadlineWines that will fuel your creativity without making you fall asleep. We have a lot of experience with this topic.By Marissa A. RossMarch 8, 2018FacebookTwitterEmailPhoto by Marissa A. RossFacebookTwitterEmailNot unlike Liam Neeson in Taken, I too have a very particular set of skills: writing and drinking wine. At the same damn time. Some may argue this is not an actual skill set. It is true you cannot get a degree in it, nor will it save anyone from kidnappers. Also, I wouldn’t recommend it on a resumé. But the truth is, most of us come home from a long day and still have to be productive even though all we want to do is pour a glass of wine. Whether you’re working on your side-hustle, a midterm essay, or a three-act play about the inner thoughts of Maine Coon cats, all I’m saying is, you can do it with wine. Here’s how.First, you want to avoid big, high-alcohol wines. I know cozying up with a bold Napa Cab and your laptop at night may sound romantic, but you’re not going to get shit done. You’re going to accidentally get a little drunk, watch an episode of Law & Order: SVU you’ve already seen a million times, and fall asleep on the couch. Stick with wines that are 12.5 percent ABV (alcohol by volume) or less.You also want to get a natural wine if possible. This is not only so you can take an Instagram because these wines are suddenly “cool,” but it’s also because commercial wines can have dozens and dozens of chemicals and additives. These extra ingredients are often never disclosed, and you can have no idea how they affect your body. Choosing a natural, organic, and/or biodynamic wine will decrease the likelihood of headaches or hangovers if you decide to really get crankin’.Personally, I love juicy wines with lots of acidity and tartness to keep me feeling energetic and awake. Here are a handful of my favorites to try now and write with later.Photo by Marissa A. RossFor Writing Poetry Inspired by NatureFurlani “Sur Lie Alpino Macerato” Pinot Grigio$23, Domaine LAWhether you prefer to cozy up in a mountain lodge or nap on a secluded beach, Furlani’s sparkling “Sur Lie Alpino Macerato” will inspire all your earthly desires. This nearly nude sparkler from Trento, Italy, is unlike any Pinot Grigio you’ve ever had. It transcends seasonality with flavors of grilled summer peaches, tangerines, and limes combined with eucalyptus, pine trees, and new snow. Light and bubbly with heightened minerality, you’ll be blasting through flowery haikus with a bottle of Furlani regardless of the landscape.Photo by Marissa A. RossFor Writing Under the Tuscan Sun 2: Over the AlpsBernhard Ott “Fass 4” Grüner Veltliner$26, Lou Wine ShopWe live in a divided world, but if there is one thing we can all agree on, it’s DIANE LANE. If a new Diane Lane joint came out right now, it would be the only movie I’d see in the theater besides Black Panther. Bernhard Ott’s “Fass 4” is exactly what Diane would be drinking on an Austrian veranda with Sandra Oh while contemplating their lives with some real Nora Ephron–esque dialogue. It smells and tastes like gardenias, fennel, and spiced cantaloupe— straight from the hot neighbor’s garden, obvi—drizzled in homemade olive oil, tossed with white pepper, and served over polished stoneware. This is a white wine both you and your mom will love, JUST LIKE DIANE LANE!Photo by Marissa A. RossFor Writing That Assignment You Really Don’t Want to WritePatrick Sullivan “Jumpin’ Juice” Rosé$27, Domaine LANo matter how much you love writing, there will always be assignments that leave you with your head slung back, moaning “uuughhh…” into the void. The only recourse is to power through, but when you’re that unmotivated, you need an exceptionally exciting wine to keep you going. Patrick Sullivan’s creation is a deliciously vibrant punch in the taste buds. The “Jumpin’ Juice” rosé, made of Sémillon, Sauvignon Blanc and Moscato Giallo, is a fiery coral color in the glass and smells like guava, nectarine, and mango are tubing across a lemonade lake. Despite the tropical nose, this wine is shockingly alive: It tastes like a cold, Pacific, cranberry-limeade wave and feels like you doused your face with ice water at 2 a.m. so you don’t have to actually douse your face with ice water at 2 a.m. when you finally reach that word count.Photo by Marissa A. RossFor Short Stories Inspired by Reading Hemingway OnceVini Viti Vinci “Le Rougeot” Pinot Noir$26, Domaine LAThere is nothing more difficult than doing something simply. Or rather, doing something simply well. This applies to wine as much as it applies to words. Much like Hemingway’s prose, Vini Viti Vinci’s “Le Rougeot” Pinot Noir is direct but with finesse. It smells like peppered cranberries in dusty trenches, and it tastes like ripe raspberries and sour black cherries strolling hand in hand down a stony Parisian street where they briefly run into their buddy Brett(anomyces). Both sharp and soft in all the right places, you might as well be in chapter three of A Moveable Feast. (That’s the one you read, right? Yeah, ol’ Hem-dawg and his wife are in Burgundy, the same region this wine is made.)Photo by Marissa A. RossFor Writing About Yourself, I Mean, Your Book of EssaysFrançois Saint-Lô “Hey Gro!!” Grolleau$27, Lou Wine ShopYou have a lot of opinions and even more stories, which you feel compelled to share with the world. Great! Do it! And do it with François Saint-Lô “Hey Gro!!” Grolleau. This wine from France’s Loire Valley smells like goji berries tossed in allspice and tastes like crunchy cranberries and raspberries with salty eucalyptus. It goes down like delicious water, allowing you to focus on what’s important: You! And at only 8.5 percent alcohol by volume, you could drink this entire bottle while crafting your very unique and interesting perspectives about millennial dating and Labradoodles without becoming arrogant and incomprehensible.The best part about all these wines, though, is that you don’t need to be a writer to enjoy them. All you need is a glass.Marissa Ross is the author of Wine. All the Time. Pick it up on Amazon for $14 and thank us later for all of your new wine knowledge.You’ll Also Need Some Writing Snacks:Explore Bon AppétitWineRead MorecultureWine Calculator: How Many Bottles of Wine Does Your Dinner Party Need?By Marissa A. Rossculture6 Bottles of Syrah That Prove It Isn't as Big As You ThinkBy Marissa A. RosscultureA Beginner’s Guide to Wine Faults and FlawsBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-08", "author": ["Condé Nast", "Marissa A. Ross"]}