{"id": "a6b96baae7082d5c016b89da823bb7e5", "url": "https://www.bonappetit.com/story/bas-best-matzo-balls-recipe", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "I Thought I Knew How to Make Perfect Matzo Balls, And Then I Tried These | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Thought I Knew How to Make Perfect Matzo Balls, And Then I Tried TheseDon’t tell my grandmother, but I’m trying something new this year.By Emily SchultzApril 8, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailDuring the Passover holiday, there’s a lot of talk of the ten plagues that were cast down upon Egypt: Thunder, blood, locusts, slaying of the firstborn—it wasn’t a good time. The year is now 2019, Passover is only a few weeks away, and there’s something new plaguing us: The realization that we’ve been thinking about our matzo balls all wrong.In our quest to develop BA’s Best Matzo Ball Soup (read all about that saga here), we dug into one of the holiday’s most essential components, parsing through the generations of lore to see what really makes the best ball. After weeks of testing (and eating lots and lots of matzo balls), we discovered that, while every family makes theirs a little differently, a few common misconceptions prevail—and a few small changes can really make a difference.The first of many A/B matzo ball tests\nPhoto by Emily Schultz1. The great seltzer debate: A lot of matzo ball recipes will tell you to add baking powder or seltzer, which is said to curb the density of matzo balls and make them lighter and fluffier. We did a side by side—by side by side—comparison for both of these factors and decided that adding it in didn’t affect the texture enough to pop open a can of plain La Croix.2. Get schmaltzy: Schmaltz, or rendered chicken fat, is like gold. And you deserve nothing but the best. The flavor and texture that schmaltz gives a matzo ball is nothing that vegetable oil can really compare to, which is why if you can get it (or make it!), use the good stuff.3. Herb is your friend: The first time I heard about someone adding fistfulls of herbs directly *into* their matzo ball batter was when senior editor Sasha Levine waxed poetic about her family’s recipe—packed so full of dill and parsley, they’re practically green. Intrigued, Molly added some chopped dill for a nice speckled effect, but didn’t go as far as Sasha.Don’t they look happy in BA’s Best Matzo Ball Soup?\nPhoto by Chelsie Craig, Food Styling by Kate Buckens4. Salt not stock: Matzo balls are like sponges, and they take on the flavor of whatever liquid they’re cooked in. You’ll see some recipes call for simmering them in chicken stock, while others ask for salty water—but how salty is the question. Molly tested a bunch of different ratios and found that if your water is too salty, your matzo balls will be too, but if your water isn’t seasoned enough, all of the flavor in the balls will leach out into the water that you’ll eventually discard. Three quarts of water to three tablespoons of salt is the perfect ratio, and results in an even more flavorful ball than balls cooked in stock.5. Hard to handle: Jewish grandmothers will pinch your shayna punim (yiddish for beautiful face) until your cheeks turn red, but will hardly even touch their matzo balls lest they turn out dense—the sin of all matzo ball sins. So Molly set out to find the perfect texture, trying one batch where she shaped them til they were *just* spherical and another batch where she rolled them to form perfect spheres. Though the extra surface tension gave the second batch a more textured bite, it didn’t make them tough or springy. The moral of the story? Don’t worry about over handling the batter too much; just get the balls to the size and shape you want.6. A quiet murmur: You don’t have to worry too much about over-handling your matzo balls, but you should consider the vigorousness of your boil. Molly says it’s incredibly important that your matzo balls cook at a simmer, because a roiling boil will be too harsh and could cause them to disintegrate. And if you’ve already gone through all this trouble, you definitely don’t want that.Get the recipe:BA’s Best Matzo BallsThe perfect matzo ball doesn’t require seltzer, baking powder, egg whites, or even a light touch, and this recipe proves it.View RecipeExplore Bon AppétitMatzoPassoverSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Emily Schultz"]}