{"id": "a6bf4e269cbcbc83773ff4b42790ea62", "url": "https://www.bonappetit.com/story/roy-choi-broken-bread", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Chef Roy Choi Has Never Been Realer Than on His New TV Show Broken Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureChef Roy Choi Has Never Been Realer Than on His New TV ShowIn his new series ‘Broken Bread,’ the L.A.–based Kogi truck chef explores topics, like sustainability, incarceration, health, and yes, food.By Elyse InamineMay 14, 2019FacebookTwitterEmailPhoto by EMARI TRAFFIEFacebookTwitterEmailRoy Choi is no stranger to breaking the mold. He was the first to make a food truck a destination when he opened Kogi in Los Angeles in 2008. His cookbook L.A. Son, out five years later, was as much autobiography as it was a collection of recipes. Now, he’s putting his own twist on the food show template with Broken Bread, a new series made in partnership with local public TV station KCET and global entertainment company Tastemade. Premiering May 15, the series peels back the layers of a complex Los Angeles to highlight locals taking on issues effecting the city, the nation, and beyond. Here we talk with Choi about his vision for the new show.How did the idea for Broken Bread come about?It’s been a lifelong thing, really. The topics we cover on the show—I’ve either lived them, am enduring them now, or I think about them deeply: Addiction. Anxiety. Self confidence. Hunger. Disparity. Transformation. The streets. Weed. Inequality. Injustice. Health. Sustainability. Love and kindness. I’d pitched the idea in hundreds of rooms over the last eight years. But maybe the timing wasn’t right. Then out of the blue, right when I was about to give up, Tastemade and KCET approached me. I almost said no. I was over it. But because it was public television and Tastemade, I said I’d hear them out—they just seemed like the right partners. With public television, they’re making things that aren’t driven by advertisers. They’re one of the only platforms where we can really mine for truth.They showed me the unsexiest dek; it didn’t have any bells or whistles. It looked like a college syllabus. But once I read it, time seemed to slow down. Everything changed in that moment. It was exactly what I had been trying to do on my own. The show was already greenlighted, too, and they were hoping I’d say yes to being an executive producer and the host. [Laughs] I was the last one to know. To me, it was spiritual serendipity.Inside Homeboy Industries.\nPhoto Courtesy of KCETHow did you pick the topics to center the episodes around—incarceration, climate change, health and food deserts in L.A.?We, the executive producers, all became a study group. It wasn’t about who was the boss because these kinds of topics require all of us to put our ego on the shelf, to really go for it and tell the truth. But a lot of it was inspired by the life I lived and the communities I spend time with, so I unpacked my brain and my heart to talk about the things I cared about. All these questions came to mind.Why are kids being fed processed foods? Why can’t people get jobs just because they made a mistake when they were 18 years old? Why are we throwing away 40 percent of our fresh produce in this country? Why are we eating chicken, cows, and pigs at a rate that’s unsustainable? Why are we so woke as a media community and care about these issues, yet we post pics of our Double-Doubles without thinking of the impact this burger has on the environment?We pose all these heavy, deep questions on the show, but instead of getting depressed by them or feeling like we’re lecturing, we’re just saying, “Here are the problems, and here are people who are doing something about it.”With that, I wanted to create a show that was still entertaining and rich with culture and art. A question I’ve been asking myself about this show is: Can we make love and kindness part of pop culture?Do you consider it a “food” show?Not all food shows have to be porn or anthropological. This is a food show about our food systems and how they affect our livelihood. So, yes, it’s a food show.Olympia Auset of SüprMarkt.\nPhoto Courtesy of KCETHow does your role of chef feed into this? Do you feel like its changing?Yeah, definitely. I’m in a place where I feel comfortable not being a chef anymore. That’s taboo in our industry. “Chef” is supposed to be the ultimate end of the road. You wonder, “Have I abandoned my brethren? Will I never get respect again?” You’re almost conditioned to believe you’re a chef until you go six feet under.But what if you grow out of being a chef? It’s not that I don’t love cooking. I do. But I’m growing into other things—becoming a storyteller, a TV producer. Chefs have always been leaders, but now because of social media and the evolution of the chef identity, we have a voice that expands beyond cooking. So it’s up to us chefs to maintain the same level of integrity and honesty that drives us in our cooking. We’re still feeding you, but now it’s your mind and spirit—not just your tummy. And we got shit to say.Choi getting a taste of invasive species.\nPhoto Courtesy of KCETThere’s been a rise in shows with chefs as the host or personality, like Ugly Delicious, Salt Fat Acid Heat, and in the past Parts Unknown. But there’s a particular kinship, it seems to me, between your show and Bourdain’s. Do you feel like you need to carry the torch?Totally different shows, but same heart. Whatever torch Tony held is Tony’s and ZPZ’s [his production company] to carry. There are 7 billion people in the world, so we can have more than one voice in TV. We don’t all have to be extensions of the same wave. I love Tony eternally. But this is my voice.Everyone in the food world seems to be obsessed with L.A. right now. Did that attention influence how you approached the series?Nah. We did L.A. because we all live here and want to maximize our time and energy. Plus, L.A. has enough stories to feel universal. It’s the second biggest city in the U.S. and one of the most diverse yet disparate cities in the world. Anything broken in L.A. is a microcosm relative to any community. We want to show our real city, with tears and eye boogers, laughter, strength, problems, people. Everything. My hope is that everyone who watches this show can admit to mistakes, and then take action.Explore Bon AppétitChefsRead MorecultureEverybody Loves SaminBy Amanda ShapiroLifestyleIt's Friday Night and Lana Condor Is Probably Home With a Bowl of NoodlesBy Alyse Whitneyculture“Edna Lewis Was Unapologetically Herself the Entire Time”By Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Elyse Inamine"]}