{"id": "a6c72a97d00f87ca1a774cc1662166c8", "url": "https://www.bonappetit.com/story/meal-strategy", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "2 Hours of Meal Prep for a Week’s Worth of Meals | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking2 Hours of Prep for a Week’s Worth of MealsFour things that I’m doing to set myself up.By Carla Lalli MusicMarch 26, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailEvery week, Bon Appétit food editor at large Carla Lalli Music is taking over our newsletter with some helpful cooking advice and shopping tips for the moment we’re in. If you have any questions about recipes, shopping, or meal prep while you’re working from home or practicing social distancing, we want to hear about it! Please email us at askcarlaanything@gmail.com, and Carla will do her best to answer them. Sign up for our newsletter, and you’ll get this letter before everyone else.It would be a stretch to say I’ve adjusted to daily life within the confines of my home, but if last week was about transition, this week is about pragmatics. My reality is that we are now a family of four eating three meals a day, every day, while also using our home to go to school and do work; we’re exercising here, we’re socializing from a distance, and we’re trying to relax. At the end of last week, I spun out completely, then realized that trying to make decisions on the fly throughout the day wasn’t going to work. I am now trying to carve out specific time to future-plan, especially around what we’re going to eat.If you have stocked up to some degree and are trying to reduce your market trips and create meals out of what you already have in the house, here are a few techniques you can use to get ahead for the next several days. If you are still going into work (and thank you to everyone who is fulfilling essential jobs), this could be a way to create something nutritious to grab out of the fridge when you get home. Weekends and weekdays are starting to blur together, so just find a day when you can devote a two-hour chunk of time to the kitchen, and try multitask cooking, as though you were a prep cook in a restaurant. You will come out of your “shift” with several building blocks for future meals, and because there’s a mix of hands-on and hands-off tasks, you should never feel overwhelmed (though there will be a few pots and pans to clean up afterwards). Here’s how it goes:Essential IngredientsApproximately 3 lb. piece of protein, such as boneless pork shoulder,\nwhole chicken, short ribs, leg of lamb, or lamb shoulder1 lb. dried lentils or other small bean/legume (e.g. black eyed peas\nor mung beans)1 lb. whole grains, such as wheat berries or brown rice3–4 bunches leafy greens, such as kale, Swiss chard, collards, and/or\nmature spinach (okay to combine, too!)Garlic, shallots, and/or onionsOlive oil, vinegar, limes or lemons, mustard, honey, salt and pepperThe dressing you can use on everything.\nPhoto by Chelsie CraigWant this letter before it hits the website? Sign up for our newsletter!The clock starts now!First: get the protein in the oven. Preheat oven to 250°. Season your meat/poultry with a generous teaspoon of kosher salt for every pound of protein—so if you have a 3 ½ lb. chicken, use 3 ½ tsp salt. Then season all over with freshly ground pepper. Anything else you want to add is based on your existing spice cabinet: dried oregano and crushed red pepper; fennel seeds and oregano; cinnamon and coriander; chili powder and smoked paprika. Totally up to you! Spice it up generously. Put the protein on a rimmed baking sheet and put it in the oven. Forget about it. (No, really, forget about it.) Most things will be tender in 3-3½ hours (tug at a piece with a pair of tongs to see if it yields), at which point you can let it cool, then shred the meat, cover, and chill. (Yes, I said this would all take you two hours, but you don’t have to do much with this once it’s in the oven.)Lentil time. Once the meat is cooking, rinse 2 cups of lentils, then place in a medium pot and cover with several inches of cold water. Season with a tablespoon of kosher salt, a drizzle of oil, a bay leaf if you have it, a couple of smashed garlic cloves (optional). Set over medium-high heat to bring to a simmer, then reduce to very low and cook until just tender, stirring occasionally. Set a timer: Regular green lentils will take about 20 minutes, so start there and add time if needed. They’ll hold up better if they’re not cooked to mush.Grains go next. Bring a large pot of water to a boil and salt as you would for pasta. When boiling, add 2 cups of grains and cook, stirring occasionally, until al dente. This could take 15 minutes for barley, 30 minutes for pearled farro, 35 minutes for spelt. Check the package for a rough estimate and set a timer so you don’t lose track. You now have three things going!Time to prep the greens. While the lentils and grains (and meat) are underway, strip the leafy part of your greens from the stems, then cut or tear into 2-inch pieces. You can use up to three bunches at a time. Wash the greens. If you’re using Swiss chard, slice the stems too (keep separate from the greens).Are the lentils done? Great. Drain them, spread them out on a rimmed baking sheet or large plate to cool, and season with salt and pepper. Clean the pot. Fill it with water, bring to a boil over high, and salt generously. This is for blanching the greens, which will make them super luscious when slow-cooked.When the water is at a boil, add the greens and cook until tender, 2–3 minutes. Drain greens; return pot to medium and follow this recipe, which calls for olive oil, garlic, some chiles, and lemon juice (use vinegar if you don’t have it). It takes 30 minutes of hands-off time, and at the end of that you will have a concentrated, space-efficient, extremely nutritious batch of greens to eat for the next few days.Grain drain. Your grains have probably reached completion. Drain them, then transfer to a bowl and dress with olive oil, salt, and pepper. Let cool, stirring occasionally. If you have any tender herbs on hand, like basil or cilantro, chop them up and add them to the grains once they’ve cooled. It’s a good way to use up your herbs and adds value to the grains.Big batch your vinaigrette. If there’s a vinaigrette you usually make, make a quadruple batch. If you don’t have a favorite recipe, try this one, which is designed to be made in a jar and uses a combination of vinegars, so rely on whatever you’ve got.Dress the lentils. Use a few spoonfuls of the vinaigrette to coat your lentils. As they sit in the fridge, they’ll just get better and better.Throw it all on a plate and call it “grain salad.”\nPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiReap your rewardsHere are a few ways to combine what you’ve made, or use them in other applications.Grains + lentils + any crunchy veg you have in the fridge + grated\ncheese + more vinaigrette = grain saladStir-fried grains with shredded protein and greens tossed through =\nall-in-one crispy grain bowlReheated greens + any shape drained pasta + pasta cooking liquid +\nparm = vegetarian pasta dinnerGrains + any broth or stock + lentils + diced vegetables of any kind\nfrom the fridge = quick lentil soup. Serve with a dollop of yogurt if\nyou have it!Tortillas + crisped-up shredded meat + sour cream + hot sauce = now\nyou’re taco-ing to me!Reheat greens and meat together + fried egg + toast = power breakfast\n(or breakfast for dinner)Reheated greens + garlic-rubbed toast + slab of feta = my favorite\nstand-up-at-the-kitchen-counter lunchI know how resourceful you all are and hope that these ideas serve as a jumping-off point for your own easy meals. As always, season to your personal taste and make substitutions based on what’s actually in your fridge and pantry. And while we have plenty of big-batching meal prep recipes to help inspire, some ingredients are still spotty at the market. I’m here to remind you that you don’t always need a super-specific road map to arrive at a beautiful meal.Note: If you like this newsletter, perhaps you might like to receive (or send a friend) a personalized video message from me or one of my colleagues in the Test Kitchen. Well, you're in luck: Between now and Friday, we’re trying to raise as much money as we can for No Kid Hungry through the Cameo app. Millions of vulnerable children are losing the healthy meals they depend on as fallout from the coronavirus forces schools to close nationwide. No Kid Hungry has a plan to feed them. Please visit Cameo to request a personalized message from me or any of the other food editors—all the funds we earn will go directly to No Kid Hungry.Explore Bon AppétitCarla NewsletterRead MorecookingThese Metal Nesting Bowls Are a Kitchen Prep LifesaverBy Emma Wartzmancooking5 Very Smart Ways to Use Frozen Hash BrownsBy Priya KrishnaLifestyleCreamy Vegan Pasta…and 9 Other Ways to Turn a Can of Beans Into DinnerBy Sarah JampelcultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-26", "author": ["Condé Nast", "Carla Lalli Music"]}