{"id": "a6ca3da6b153361687eba732a106e2e4", "url": "https://www.bonappetit.com/story/white-river-fish-market", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "White River Fish Market in Tulsa Is a Feast of Fresh Seafood in a Landlocked State | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhite River Fish Market Is a Feast of Fresh Seafood in a Landlocked StateFresh flounder, rainbow trout, and hushpuppies where you’d least expect them.By Jeff MartinJune 6, 2018FacebookTwitterEmailPhoto by Valerie GrantFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Here’s a wild bit of trivia for your next cocktail party. Or shrimp cocktail party for that matter. Because Oklahoma has more man-made lakes than any other state, some say it boasts more miles of shoreline than the Atlantic and Gulf coasts combined. But let’s not beat around the bush. This place is landlocked.I didn’t see an ocean for the first time until I was eight years old. The closest I had ever been up to that point was White River Fish Market in Tulsa, where generations of families have gone to feast on fresh Gulf catfish, red beans and rice, gumbo, rainbow trout, and endless hushpuppies. The hushpuppies are as indispensable to this experience as baguettes are to a summer in Paris. It’s hard to know the exact date, but sometime in the mid-1980s, around the time I was in kindergarten, I had my first White River hushpuppy. I’d always liked cornbread. This was something else. This was love.White River, located in an unassuming strip mall not far from the airport, has a strong cafeteria vibe with Formica tables pushed close together in order to squeeze in as many diners as possible. It’s not uncommon to be elbow to elbow with complete strangers during a busy lunch. The long cases of seafood on ice serve to both stir the appetite and present quite a challenge to anyone with decision-making issues.All the fish and sides.\nPhoto by Valerie GrantIt opened in 1932 as a counter-service fish market in downtown Tulsa at the height of the Great Depression when Oklahoma was most often known for being part of the Dust Bowl, a time when far more businesses were closing than opening. The restaurant part didn’t come for another decade (billed honestly as “Sea Food Restaurant”). In 1965 the market and restaurant moved to its current location, the only one I’ve ever known. Its simple, folksy founding motto, “you pick ’em, we fix ’em” works as a kind of de facto mission statement that endures to this day.Despite its somewhat misnomer of a name, the actual White River doesn’t even run through Oklahoma (see Arkansas and Missouri). Most of the seafood—shrimp, soft-shell crab, rainbow trout, flounder, frog legs (they don’t taste exactly like chicken)—is flown in from the Gulf or the coasts, hence the handy proximity to the airport.There are four kinds of meals: smoked (just salmon), grilled, broiled, and, of course, fried. Each has its own individual merits. But for my money, and considering I’m not eating there every day, I almost always go full-on-fried. I’m like some kind of prairie Proust, with the impact of that first hushpuppy continuing all these years later. The little crispy pieces of batter that break off and collect underneath serve as their own unique treat.The counter for picking your seafood.\nPhoto by Valerie GrantDue to all kinds of forces, gentrification among them, there aren’t as many places where I can go to lunch and see road crews in orange vests eating next to suited-up business folks. The best restaurants still have the power to blur those lines. There’s really no way to compare this humble space to the likes of Boston’s legendary chain Legal Sea Foods or a buzzy spot like Seattle’s the Walrus and the Carpenter, but I once had the opportunity to take a well-known food writer to a hopping weekday lunch at White River. That writer ordered nearly one of everything, covering our booth table with endless plates and platters. The response to most of the food was borderline rapturous. The cornmeal-crusted catfish was a memorable standout, so simple and humble it somehow embodies the hardworking era in which the restaurant was born. I realized in that moment that I’d been taking White River Fish Market for granted. I never will again.Jeff Martin is the founder of Magic City Books.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Jeff Martin"]}