{"id": "a6cf26355a028fc1f440a33eab404d6f", "url": "https://www.bonappetit.com/recipe/smoky-green-chicken-pozole", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Smoky Green Chicken Pozole Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDSmoky Green Chicken PozoleSponsored by Campbell'sFacebookPinterestTwitterEmail6 - 8 servingsActive Time: 30 minTotal Time: 45 minA dash of smoky mezcal adds an unexpected layer of complexity to this Mexican influenced stew. Leave the seeds in the jalapeños if you prefer a spicier stew.PrintIngredients3/4 pounds tomatillos, husks removed and rinsed1 8-ounce poblano pepper, stems and seeds removed, halved1 Jalapeño, stems and seeds removed, halved, plus more sliced for serving1 small white onion, quartered, (12 ounces)2 garlic cloves, peeled2 tablespoons vegetable oil1 1/2 pounds bone-in, skin-on chicken breastsKosher salt and freshly ground black pepper4 cups Swanson's Chicken Broth1/2 tsp. dried oregano2 15-ounce cans white hominy, drained1 tablespoon mezcalFor serving: diced avocado, shredded green cabbage, thinly sliced radish, fresh cilantro leaves, warm corn tortillas, and lime wedgesRecipe PreparationPreheat oven to broil with a rack in top third. Arrange tomatillos, poblano peppers, jalapeno peppers, onion, and garlic in a single layer on a rimmed baking sheet. Blister vegetables, turning frequently, until blackened in places but still firm, about 10 minutes.Scrape blistered vegetables and any accumulated juices into food processor and add 1 cup of water. Puree, in batches if necessary, until smooth.In a medium heavy bottomed pot, heat oil over medium-high. Season chicken with salt and pepper and sear, turning to brown all over, about 8 minutes.Pour broth and tomatillo puree over chicken. Add oregano and bring to a boil. Reduce to a gentle simmer and cover. Simmer until chicken is just cooked through, about 10 minutes. Turn off heat. Using tongs or a slotted spoon, remove chicken to a plate and let cool slightly.Discard skin and bones and shred chicken meat. Stir picked chicken back into pot and add the hominy. Bring back to a simmer, to reheat. Stir in mezcal to taste and season with salt and pepper.Ladle hot stew into bowls and garnish with diced avocado, cabbage,  radish, cilantro, and jalapeno. Serve with lime wedges. Makes about 9 cups soup.Sponsored by Campbell'sGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitCampbell'sSponsoredSoupMexicanSouthernSouthwesternMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}