{"id": "a6d13401335caccd637934810dc08e7d", "url": "https://www.bonappetit.com/city-guides/new-york/venue/29b-teahouse", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "29B Teahouse Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew york29B TeahouseTransport yourself to your happy, oolong-filled place at this chill East Village barFacebookPinterestTwitterEmailYunji Ko GO HERE: for a quiet moment in the middle of the city, plus the most soul-soothing (and delicious) ochazuke, Japanese tea rice, that will fortify you for the next excursion.ORDER THE: tea! Duh. The line-up constantly changes, based on owner Stefen Ramirez’s recent travels, so you might get fragrant yet mellow oolong from Taiwan one day and the next month a smokier oolong sourced from the Wuyi Mountains in southeastern China. While the carefully curated teas are the draw, it’d be such a shame to miss out on the boozy options, like matcha you can pair with sparkling wine or Echigo beer or infused Tokki soju. While the abbreviated food menu can be a little all over the place, the ochazuke is on point: it's made of soy-and-wasabi-cured fish, vegetables, and ume, all piled on rice. Mix it altogether with hojicha tea for a complex and comforting soup that beats out any chicken noodle.PRACTICAL STUFF: Open everyday: Monday to Saturday, from 11 a.m. to 11 p.m., and Sunday, from noon to 6 p.m.—Elyse InamineYunji KoYunji KoWE ALSO LOVEBuvetteTrès West Village, with hints of ParisTé CompanyA tearoom with a one-of-a-kind tasting menuWildairThis Lower East Side natural wine bar delivers some of New York’s best foodExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Elyse Inamine"]}