{"id": "a6d381ee4816df14a2436b8f018a628a", "url": "https://www.bonappetit.com/story/nocry-cut-resistant-gloves", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "The Test Kitchen Swears By These Cut Resistant Gloves | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Test Kitchen Swears By These Cut-Resistant GlovesGet the thinnest slices on your mandoline without a trip to the emergency room.By Zoë SessumsApril 4, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Our collective love for the mandoline is no secret. Senior food editor Andy Baraghani even wrote about how the tool totally changed his life when he first encountered it in a restaurant kitchen many years ago. The deep pleasure of witnessing a cucumber become uniform rounds, or zucchini elegant ribbons, or fennel paper-thin wisps never gets old. That is, until the moment you cut yourself. Luckily, there’s a way to prevent that disillusionment (and injured digit) from happening: protective cut-resistant gloves.(Jump to 9:39 to watch Natalie Portman and Carla Lalli Music sport the gloves.)\n“This glove is amazing and gives me confidence when I’m using a mandoline,” senior food editor Anna Stockwell says as she pulls out a single heather grey glove from her station. The hand guards that come with certain mandolines can be clunky and difficult to work with, she explains, but the NoCry Cut Resistant Gloves she uses are flexible and comfortable.Made of food safe ultra-high molecular weight polyethylene (i.e. an extremely strong material that is used in suspension lines for skydiving, climbing gear, etc.), glass fiber, and Spandex, these gloves have been designed to resist cuts from the sharpest blades. But their thin fibers and tight weave makes them more like fine chain mail than a clunky suit of armor. Better yet, they’re totally ambidextrous, and you only need to wear one at a time.I mean, we could probably find some other reasons to wear these...\nPhoto by Chelsie CraigThey’re so useful, in fact, we’ll use them when chopping, grating, peeling—shucking oysters even. Heck, they’re so versatile (and kinda cool looking?), I might just throw them on anytime I walk into a kitchen.NoCry Cut Resistant Gloves$11 at AmazonExplore Bon AppétitToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Zoë Sessums"]}