{"id": "a6da82f027b10d25428c2f823fe8f80f", "url": "https://www.bonappetit.com/story/what-is-butterscotch", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "What is Butterscotch, Caramel's Low-Key Cousin? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Stress Over Caramel When You Can Make Butterscotch InsteadA case for caramel's low-key cousin.By Sarah JampelMarch 23, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.There are certain cooking projects I simply refuse to take on when I’m anxious, stressed, or otherwise short-fused. Caramel is high on that list. (Also: aioli.)Caramel is wonderful but fussy. The sugar can clump, seize, crystallize, or burn. And while there are all sorts of tricks for ensuring this doesn’t happen (like, brushing the side of your pot with a damp pastry brush or adding corn syrup or cream of tartar), sometimes I’m not prepared to take on risks for something that’s supposed to be all about pleasure.That’s why, when I’m craving caramel and can’t deal with the worry, I turn to butterscotch, its more reliable, less dramatic cousin. But what is butterscotch, exactly? Whereas caramel is made by cooking white sugar until it melts, darkens, and breaks down into its component parts, which in turn react with each other to create complex aromas, butterscotch is built on brown sugar, which gives it a couple of advantages. The addition of molasses, the source of brown sugar’s darker color and deeper flavor, means it’s both more moist and more acidic than white sugar. Acidity helps fight crystallization (that’s why you’ll often see acidic ingredients, like lemon juice, vinegar, or the aforementioned cream of tartar, added to traditional caramel recipes), and the moisture means it’s slower to burn.Plus, butterscotch is most commonly made by melting brown sugar with butter (rather than on its own), which helps the granules to dissolve evenly and melt gently. You’re sidestepping all of the usual caramel issues—there’s less that can go wrong.Butterscotch isn’t a dead ringer for caramel—it’s usually sweeter, softer, and richer, without those bitter notes that makes caramel so special and, you know, sophisticated. But it’s close enough for me, especially when the butterscotch is just a component of a dish, like the sauce glazing a cake or one layer of Tahini Billionaire Bars. I think that butterscotch tastes best with plenty of salt and an ingredient that will cut through the richness—whether it’s tangy sour cream or savory tahini.Give butterscotch a chance. You may not miss caramel, and you definitely won’t miss the stress you would’ve endured trying to make it.Get the recipe:Tahini Billionaire BarsWe took millionaire bars—shortbread plus caramel plus chocolate—and gave them an upgrade (hence, billions) with sesame seeds and tahini. The shortbread is tender, the filling is gooey, and the chocolate ties it all together.View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-21", "author": ["Condé Nast", "Sarah Jampel"]}