{"id": "a6e0f59d00a3741a53b4a1b2d235c000", "url": "https://www.bonappetit.com/story/the-best-pot-of-beans-is-in-your-future", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "The Best Way to Cook Beans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirus7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstEverybody's doing it.By Caroline LangeMarch 22, 2020FacebookTwitterEmailPhoto by Gentl & HyersFacebookTwitterEmailMaybe you have dried beans in your pantry right now—and maybe it's for the first time. Whether you bought them as a just-in-case backup meal (purveyors are reporting record sales) or because you're transitioning towards more plant-based eating, it's time to learn to make your best pot of beans.Sure, canned beans allow for a certain spontaneity and ease that makes them extremely lovable and useful, but cooking a pot from dried is a totally sensory, highly rewarding activity (way easier than nurturing a sourdough starter!) that’s worth devoting a couple of hours to: It’ll feed a gang easily, deliciously, and cheaply—and hey, we could all use the comfort of something warm and long-simmering and good-smelling right now.The first step towards making the best pot of beans is just doing it—jump in! If you’re afraid, take a deep breath—these seven tips will guarantee success:1. Make sure your beans are (relatively) fresh.The magic number for bean freshness is about two years from being milled and packaged. Of course, there’s no surefire way of knowing exactly when your beans were packaged unless the packaging notes a date, but if you buy from a place that sees a good turnover (like the bulk bins of a busy grocery store), they’re probably okay.Drying beans certainly extends their lifespan but it doesn’t promise immortality. Even dried beans can get too old to cook: Like many dried goods, the sooner you cook them, the more of their nutrients they’ll retain and the better their texture and flavor will be—and the faster they’ll actually cook.Pour the amount of beans you want to cook into a colander and give them a once-over for little stones or other unwelcome additions. Rinse, transfer to a large pot or Dutch oven with a tight-fitting lid, and proceed.2. You’ll probably want to soak.Soaking beans helps to ensure tenderness and reduce the cook time. I’d recommend soaking your beans all day or overnight (you’re aiming for 8-12 hours), covered, in cool water that covers them by 2 to 3 inches. Unless your kitchen is very warm or it’s the thick of summer, you can do this at room temperature. (Otherwise, it’s a good idea to soak in the fridge.)Spaced out and didn't soak? This chickpea soup is made with straight-from-the-bag chickpeas.\nPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaIf you forgot to soak, though, you’re not in dire straits. It's not 1000% necessary, and I usually skip the soaking step myself: Beans that are on the smaller side only take two or so hours to cook from dry, and I buy fresh, high-quality bags from Rancho Gordo.But if you’re less sure about your beans’ age, or you’re working with large beans (like gigantes), or you’re a beginner, try soaking at least a couple of times. (And if you forgot to soak your who-knows-how-old lima beans? Employ the “quick-soak” method: Cover beans with 2 to 3 inches of cool water, bring to a boil, then remove from heat, cover, and let sit for an hour.)After soaking, the beans should be BIG—they’ll have absorbed much of the water. If they don’t change in size, or are visibly wrinkly or shriveled, your beans are probably too old. If it seems like just a few of the beans are wrinkled, pick them out and proceed. If it’s the whole pot, start over with fresh beans or buckle in for a looooong, slow cook—and add a pinch of baking soda: The baking soda increases the pH of the liquid (the opposite effect of adding acid to the mix!), naturally making the beans more tender.A final, perhaps controversial note: Don’t toss your soaking liquid. Though some say tossing the soaking liquid and replacing it with fresh water can make the beans easier to digest (that is, limit their infamous musical qualities, toot toot), that soaking water holds your beans’ flavor as well as some of their nutrients—not to mention color, especially in the case of black beans. Cook your beans right in it.3. Embrace salt and fat.There’s some beef amongst bean-cookers about  the best time to add salt. Some say that adding the salt too early can make beans tough, but I think that salting from the start is the only way to get properly seasoned beans.I’m not the only one. Joe Yonan, author of the new entirely-bean-devoted cookbook Cool Beans, brines his beans as he soaks them, which just means he adds a tablespoon of salt to the soaking water to season and soften. In general, a good rule of thumb is one tablespoon of salt per pound of beans—if you’re soaking, add it then; if you’re not soaking, add it whenever you’re ready to cook.The best pot of beans should have little beads of oil on top.\nPeden + MunkYou’ll also want a generous pour of extra-virgin olive oil, which flavors the beans and the broth as they cook. Cookbook author Lukas Volger, whose #31daysofbeans Instagram campaign is a great spot for bean-spiration, recommends starting with ¼ cup oil per pound of beans in his new book Start Simple.That’s really all you need for a delicious pot of plain but well-seasoned, versatile beans. Top off soaking liquid with enough cool tap water to keep the beans covered by 2 to 3 inches, then add the oil and the salt right to the pot. These beans will be delicious and straight-up.4. Bring the flavor.Maybe you’re going for a one-pot special here, something to enjoy as-is rather than as a component of another recipe. In that case, you’ve got about a zillion options for additions. There’s no real need to measure, but as with most things, it’s better to go light at first and add more later on. Try these additions:Smashed garlic cloves and/or halved peeled onions (or shallots or scallions), plain or lightly charred first in the olive oilSpices and herbs: fennel, coriander, or cumin seeds; cinnamon sticks; bay leaves; smoked paprika; dried or fresh oregano; fresh parsley, rosemary, sage, or thymeChiles: whole dried chiles (like chipotle, morita, or guajillo); ground chile powder; crushed red pepper flakes; a couple of canned chipotles en adobo sauce (careful—these guys are HOT)Aromatics: carrots, celery, fennel—leave them whole if you want to fish them out once the beans are tender, or finely chop and sauté them until tender in the olive oil before adding the dried beans.Even more: bacon or pancetta (dice, then cook until halfway crisp in the olive oil before adding dried beans); bones (smoked or otherwise); parmesan rinds; miso; kombu; instant dashi; a couple of strips of lemon peelWhat about things like canned or fresh tomatoes, wine, lemon juice? Acid will make your beans tough, so wait to add acidic ingredients until the beans are tender.The best chickpeas hinge on plenty of lemon peel and olive oil.\nPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen Kaminski5. Cook low and slow—patience is key.To cook on the stove, bring the pot of beans (soaked or unsoaked, with olive oil, salt, and any seasonings plus 2 to 3 inches of liquid covering them) to a boil over high heat, then reduce the heat so that your beans are barely but steadily simmering and cover with the lid. I like to cook beans over my stove’s wimpiest burner to give them the gentlest simmering experience possible. The gentler the cooking, the better your beans will hold their shape and not burst out of their skins.Cook in the oven if you want to be really hands-off (or you’re using the stove for something else!): Bring the beans to a boil on the stovetop, then cover and transfer to a 275°F oven.Whatever way you cook them, you’ll want to check in every half-hour or so, topping off the liquid as necessary so that the beans remain submerged. Stir very gently and very occasionally.6. Taste, then taste again, then taste again.To know when they’re done, you’ll have to watch and taste. In her book An Everlasting Meal, one of my favorite writers on beans, Tamar Adler, quotes another wonderful writer on beans, Clementine Paddleford: When they’re done, beans should be “swelled like the fat boy in his prime” (!). Adler also writes that you should be able to nibble a few in a row that are perfectly tender and delicious all the way through. Don’t stop at one bean: At least three in a row should be totally tender. Be sure to give them the time they need; you can’t rush beans! Count on a couple of hours.This is a good time to adjust the seasoning: Taste the beans and the broth, and add more salt if you like. (Too salty? Thin the bean broth with a bit of water.) Once the beans are tender, feel free to jazz them up with acid.7. Don’t toss the bean broth.When you've got the beans where you want 'em, fish out any whole aromatics, then cool and store your beans right in their liquid for the best flavor and texture (beans handled too much before they’re cool are prone to breaking or getting mushy). I like to leave them in the pot to cool, then divide the beans between containers and add bean broth to cover. One pound of dried beans yields about 6 cups of cooked beans, plus broth.That brothy black bean business. \nAny leftover bean broth should go in additional containers—and definitely not down the drain. Bean broth is nearly as delicious as the beans. Use it to cook rice or potatoes or wherever you’d use vegetable or chicken stock.Beans and their broth will keep in the fridge for up to a week or in the freezer for up to 3 months.And the beans?Soften chopped greens (like spinach, kale, or collards) right in the pot with themAdd them to soup or pastaPurée into a dip or spread—hummus is only the beginningRefry them and smear onto tostadas or into burritosFold them into tomato sauce, top with feta or shredded mozzarella, and bake in a skillet until bubblyDrain the beans from their broth (saving it!), pat dry with a paper towel, toss with olive oil and salt (and any other spices you like, like paprika or turmeric), then roast at 450°F until crispy and golden for a warm, savory snack or salad-topperAdd them to one of these 86 recipesOr give them to a friend or neighbor as a care packageOh, you want a recipe?Vegetarian Chili With Lots of FritosQuick, spicy, filling, and made mostly of pantry ingredients, this chili/tortilla soup/frito pie mash-up is calling your name. (Shhh. Listen closely.) View RecipeCaroline Lange is a recipe tester and developer, private chef, and food stylist living in Brooklyn.Explore Bon AppétitCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-22", "author": ["Condé Nast", "Caroline Lange"]}