{"id": "a6e1cdee5878f742ebfd8751cd716ab5", "url": "https://www.bonappetit.com/story/royal-gourmet-flat-top", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "When It's Too Hot to Cook, I Turn to my Royal Gourmet Flattop Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen It’s Too Hot to Cook, I Turn to My Flattop GrillThis portable plancha connects me to my ultimate childhood comfort food—mall food court teppanyaki.By Minda WeiJune 17, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Like yesterday and the day before, it is nearly 100 degrees in Austin, so hot that I feel like a melting figure in a Dali painting. Want me to heat my skillet or oven? Prepare an ambitious recipe? Call me in November, when fall actually begins in Texas and my mood can no longer be described as “sweaty.” That’s why, this summer, my Royal Gourmet flattop grill has been my savior. Dinner is ready in the time it takes to chop a head of broccoli, and the only tools to clean are a squeeze bottle of water and a spatula. It flawlessly delivers the wok hei of a Hong Kong street hawker, and more important, it brings me back to my ultimate childhood comfort food: food court takeout from Sarku Japan, a teppanyaki chain found almost exclusively in malls across America.In the sprawling suburbs of Cypress, Texas, just northwest of Houston, summers are best described by their duality—the heat of the Gulf Coast (demonstrated by the Texas Neapolitan, sunburned on top, pale in the middle, finished with a distinctive Old Navy flip-flop tan on the bottom) and the cool of the shopping mall, where it’s always a brisk 65 degrees. The mall raised me, from when I was five running around permanently sticky play places to when I was 13 going on Forever 21. It’s in my DNA—even my prom was at the mall. And while some kids were raised on PB&J or Little Caesars’ Hot-N-Readys, I grew up on Sarku Japan. On every visit to Willowbrook Mall, my mom and I would split a $5.69 styrofoam box of teriyaki chicken and beef, caramelized to perfection, and piled high atop rice and steamed vegetables. For an extra $1.79, we dared them to double our meat, but only after helping ourselves to a free sample.Now, at home, the Royal Gourmet grill challenges me to escape the rigidity of daily menu planning. Armed with a squirt bottle and spatula, I’m riffing. Whether it’s smash burgers, tacos al pastor, or my favorite diner breakfast, the flattop makes it easy for me to just show up, without the pressure of perfection. No timers, no thermometers, just me and my mise en place flowing. When the neighbors curiously poke their heads out, nose first, to smell my teppanyaki, it’s time to throw the glaze on the meat, the sweet and savory lacquer balanced by the comfortable familiarity of cabbage and rice.Now that I’ve left my hometown, the nearest Sarku Japan is about a 30-minute drive, in an unfamiliar mall that raised someone else but still boasts the best summertime air-conditioning this side of the Colorado River. A trip to the mall feels a little sad now. Some things, like low-rise jeans, are better left in the past. But thanks to my Royal Gourmet grill, I can have food court teppanyaki whenever I want. In a way, making Sarku Japan at home strikes the same chord as cooking one of my mother’s Cantonese recipes. It feels like a return to my heritage, a culture shaped by Frappuccinos, soft pretzels, and the Zumiez background music. Mall food court teppanyaki is part of who I am, and my backyard plancha is my homecoming.Royal Gourmet Flattop Grill$95 at Home Depot$139 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-17", "author": ["Condé Nast", "Minda Wei"]}