{"id": "a6e20175c2fcc1de3cfc875bf6ae8a36", "url": "https://www.bonappetit.com/story/entremar-mexico-city", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "When You Can’t Get Into Contramar, Entremar Has Your Back | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhen You Can’t Get Into Contramar, Entremar Has Your BackYes, it has the tuna tostadas. Breathe in, breathe out.By Emily SchultzOctober 22, 2019FacebookTwitterEmailPhoto by Andrea TejedaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My Co-Star app tells me that my Virgo moon and rising signs make me a planner. It’s clear when I go on vacation. The Google maps, intense itineraries, and saved Instagram posts prove this. But you can’t plan every single minute of your vacation, especially when you’re with seven of your closest friends in Mexico City. And for that, I thank Entremar.If you know anything about Mexico City (or have followed the BA staff on Instagram recently), you’ve probably heard of Contramar, chef Gabriela Cámara’s iconic seafood restaurant. And you’re probably all too familiar with the food: that butterflied grilled fish, carefully painted with red and green salsas; a plate of four pristine tuna tostadas topped with slivers of avocado; and the mints at the end of the meal stamped with the “Contramar” logo. So you know the deal. Immediately after you book your flight to Mexico City and secure the perfect Airbnb in Condesa or Roma Norte, you make your Contramar reservation. Right? Well kids, I didn’t do that.Somehow I forgot to make that essential reservation until it was too late. On top of that, we were a party of eight in the city during a long weekend, which meant the restaurant was busy. As in there was no way we’d get seated, and I was panicking. (I define FOMO by the food I’m not eating in a specific moment.) I needed to have that grilled snapper! I yearned for the tuna tostada! And that’s when Entremar saved the day.Contramar’s helpful staff directed me to the restaurant’s the much-lesser-known sister spot mid-meltdown. It’s got nearly the exact same menu—and somehow none of the hype. We slipped into Entremar on our last night in the city, and it was everything I dreamed of. We ate the perfectly charred fish with still-warm tortillas, those freakin’ tuna tostadas that I still think about, and succulent stone crabs, a new favorite. Sure the mints at the end weren’t stamped with Contramar, but they did bear the name of a place that means so much more to me now: Entremar.Go there: EntremarExplore Bon AppétitHighly RecommendMexico CityRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-22", "author": ["Condé Nast", "Emily Schultz"]}