{"id": "a6e40038c1cbedf9ee45203d42f20ff1", "url": "https://www.bonappetit.com/recipe/bright-and-spicy-shrimp-noodle-salad", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Shrimp Noodle Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueBright and Spicy Shrimp Noodle SaladBy Chris MoroccoDecember 26, 20194.9(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintA punchy fish sauce vinaigrette works as a marinade and as a dressing for glass noodles and handfuls of basil and cucumber. This recipe, which is like a pared-back version of Thai yum woon sen, is part of the 2020 Healthyish Feel Good Food Plan, a ten-day headstart toward eating well all year long. Ingredients4 servings⅓cup fresh lime juice2tsp. honey1serrano chile, very thinly sliced11\" piece ginger, peeled, finely grated1garlic clove, finely grated1Tbsp. plus 1½ tsp. fish sauce4Tbsp. extra-virgin olive oil, dividedKosher salt1lb. large shrimp (preferably wild), peeled, deveined6oz. bean thread (cellophane or glass) noodles1English hothouse cucumber, halved lengthwise, thinly sliced crosswise½cup salted, roasted peanuts, crushed, divided1cup basil leavesPreparationStep 1Stir lime juice and honey in a small bowl until honey dissolves. Mix in chile, ginger, garlic, fish sauce, and 3 Tbsp. oil; season dressing with salt.Step 2Toss shrimp and 2 Tbsp. dressing in a medium bowl to coat; let sit 10 minutes.Step 3Meanwhile, cook noodles according to package directions. Drain and add to bowl with remaining dressing along with cucumber and ¼ cup peanuts; toss well.Step 4Heat remaining 1 Tbsp. oil in a large nonstick skillet over medium-high. Pour off any liquid from shrimp and pat dry; season all over with salt. Cook shrimp, tossing occasionally, until browned and bright pink, about 5 minutes. Transfer to bowl with noodles, add basil, and toss well to combine.Step 5Divide noodle salad among bowls and top with remaining peanuts.How would you rate Bright and Spicy Shrimp Noodle Salad?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis was yummy! I couldn’t find my Serrano chile  pepper, so I added a good squeeze of Siracha and ur as the perfect addition. Also, used medium shrimp and they were a perfect size in relation to cucumber wedges. Partner says it’s a company-worthy dish. MimiAtlanta 2/5/2022really good!!!coraline barcelona1/17/2022The reason I chose this dish was to use up basil(AreoGarden gone nuts) the dressing is amazing.  It would be great on anything.  I marinated my shrimp for an hour, because the other reviews said it was bland,  it was not. I was not found of the peanuts. I think next time I will omit them and add some green onions instead. Very good dish.  Will definately do again!Christine Denver co12/4/2020Definitely a keeper! I added cilantro instead of basil, and I also had the world's dried limes, so I added orange juice to get to 1/3 cup. This is very easy to prepare, and the sauce is to die for. Anonymous10/8/2020A super refreshing dish and a relatively quick meal to pull together. The dressing was perfectly balanced. I didn't have basil but added cilantro instead. I used cashews instead of peanuts and it turned out great!AnonymousSan Francisco5/10/2020This is honestly one of my new favourite dishes - so bright, fresh and zingy. I'm just an absolute sucker for basil so that always help too. I recommend eating it fresh as the leftovers get a little watery but I mean that shouldn't really be a problem when I'm chowing down 4 servings.bloodynomNew Zealand4/25/2020I've made this multiple times and I've never been disappointed. I was a little intimidated by the quantity of fish sauce listed, but trust in the Morocco magic and just go with it... It was bright, spicy, punchy but still really light. A perfect meal. Obsessed.aboliBangalore4/7/2020It's a great, super simple recipe that has become one of my weeknight go-to's! Love the brightness of the shrimp and vegetables and it's still very filling. I cook the shrimp in a few tablespoons of the marinade rather than straining and patting dry and I find it gives them more flavor.AnonymousColorado3/8/2020Delicious! My husband, who is not usually a fan of these flavor combinations, devoured it. Don’t skip the Serrano — it adds the perfect kick to the dressing and the flavor brings the dish together. I toasted, chopped, and salted some almonds in place of the peanuts (didn’t have any on hand), which worked perfectly! Such an easy, quick, and delicious meal. Will definitely make it again. AnonymousSan Diego1/24/2020Had to make it with rice noodles since I couldn't find cellophane noodles, but the dressing was nice and I liked the crunch from the cucumbers and peanuts. The shrimp were a little plain; I didn't feel like they picked up a lot of flavour from the marinade.AnonymousNew York1/14/2020Great recipe!  The dressing was perfect with just the right amount of kick from the serrano pepper.  My teen said I should definitely make it again.Julie BrownAustin, Tx1/14/2020The perfect antidote to a cold winter night. Marinade/dressing was tasty...I sipped from the bowl at the end of the meal. Only change, I made half the noodles (1 dried bundle per person), kept the rest of the recipe the same and it served two perfectly.AnonymousTruckee, CA1/11/2020Any suggestions for a substitution for the shrimp? Some of my family do not like shrimp.Anonymous1/2/2020Isn't this basically just Thai yum woon sen?AnonymousCalifornia12/28/2019Explore Bon AppétitSaladShrimpShellfishSeafoodGlass NoodleNoodlePasta & NoodlesSideMainDairy-FreeGluten-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Chris Morocco"]}