{"id": "a6e57983f962c9251e34cba12218cd93", "url": "https://www.bonappetit.com/story/take-out-with-lisa-ling", "year": 2022.0, "month": 1.0, "day": 4.0, "content": "‘Take Out with Lisa Ling’ Is a Delicious Crash Course on Asian America | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture‘Take Out with Lisa Ling’ Is a Delicious Crash Course on Asian AmericaIt’s a food show, sure—but it’s really more of a history lesson that’ll also make you hungry.By Bettina MakalintalJanuary 28, 2022FacebookTwitterEmailPhotograph by Carmen Chan/HBO MaxFacebookTwitterEmailTake Out with Lisa Ling, the new HBO Max docuseries about Asian American cuisines, kicks off on an energetic note. “Tell me a story I don’t know,” snarls the theme song by the Linda Lindas. (You might remember them as the teenaged band whose Los Angeles Public Library performance of their song “Racist, Sexist Boy,” spurred by a Sinophobic incident, went viral last year.)ContentThis content can also be viewed on the site it originates from.It’s an apt way of setting the tone for the series: It’s a food show, sure, but it’s really more of an attempt at elucidating the overlooked yet long and rich history of Asians in the United States. For example, the first Asian American settlement on the continent—St. Malo in Louisiana, established as early as 1763—was created by Manilamen, a fact that few American history classes teach. But that’s covered in Take Out’s very first episode, in which journalist Lisa Ling sits down for a seafood boil with these Filipino settlers’ descendents and considers how they paved the way for the region’s shrimp industry.This focus on Asian American history hits at the right time: Just this month New Jersey became the second state, after Illinois, to sign into law a history curriculum that’s more inclusive of Asian Americans and Pacific Islanders. Across the country calls for increased education about this less-regarded history have grown, especially as anti-Asian prejudice and hate crimes have risen over the course of the pandemic.In Take Out food becomes the conduit for bigger conversations about history, immigration, identity, and how to piece all of those things together. Take Out is the kind of show you’ll like if you enjoyed High on the Hog, Taste the Nation, or Broken Bread—shows that put food into context of a community’s struggles and successes. Of course, all of those big ideas are interspersed with segments of really, really good-looking meals and moments of levity, like Ling and her husband, Paul Song, doing kimchibacks (like picklebacks but with kimchi) with D.C.–based chef Danny Lee.Photograph by Carmen Chan/HBO MaxOver six episodes Take Out explores the history of the Filipinos in Louisiana, the Chinese in Northern California, the Vietnamese in Orange County’s Little Saigon, the Bangladeshis in New York, the Japanese in L.A’s Boyle Heights, and the Koreans in Fairfax County, Virginia—and how all of those immigrant groups used food to find their footing in the United States and understand themselves and the people around them.In each episode Ling establishes the background info, often using archival footage, and then interviews multiple members from each diaspora. In episode four, for example, Ling explains the formation of Bangladesh, then meets with actor Alaudin Ullah, who shares how his father, a steamship worker, jumped ship to start a new life in New York as an undocumented immigrant. He eventually started the restaurant Bengal Garden, refusing to compromise on his culture during a time when many Bengali immigrants felt pressure to present their establishments as Indian restaurants. Later, Ling goes to Jersey City’s Korai Kitchen, where cofounder Nur-E Farhana Rahman explains how they pushed Uber Eats to create a new category for Bangladeshi restaurants when they joined the service. We see how the decisions of forebears still influence how younger generations understand their cultural identity today.Is the selection of cultures featured by Take Out the complete breadth of groups who make up Asian America? Certainly not, but it’s a step in the right direction. And it bodes well for the future that all the major streaming platforms are exploring shows that dive deep into the ways food is linked to race, history, and power for communities from all over the world.Unlike the many food shows that center around the premise that food is the great unifier, able to bridge gaps between different groups, Take Out considers food the key to unlocking the connections within a diaspora. In Boyle Heights—the neighborhood that became a refuge for Japanese Americans after their incarceration during World War II but saw an exodus as Japanese Americans gained upward mobility—Ling visits Otomisan, its oldest-running Japanese restaurant. There, owner Yayoi Watanabe has taken on a role akin to the “community’s Japanese mom,” as Ling puts it, by sharing history and food with younger generations. In this way Take Out highlights the importance of remembering and learning from the past.That we, as viewers who might not share the backgrounds of the communities in each episode, learn about their livelihoods is more a pleasant by-product than Take Out’s sole appeal. Where Take Out shines is by letting communities whose histories have been unheard tell their own stories in their own way.Explore Bon AppétitTvCultureLifestylePop CultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-28", "author": ["Condé Nast", "Bettina Makalintal"]}