{"id": "a6ed74d7dee3d5303e278d08e6f81b91", "url": "https://www.bonappetit.com/story/herb-prep-cleaning-tip", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "How to Store Herbs So They Stay Fresher, Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Store Herbs So They Stay Fresher, LongerHaving them prepped and ready to go makes all the difference.By Ashley Mason and Alex DelanyMay 9, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailDo yourself a favor: Rinse off your herbs as soon as you get home from the market or store. Don't wait until three minutes before starting dinner. Not only will they be ready to deploy whenever you need to add brightness and a finishing garnish, but giving the whole bundle a proper wash rehydrates the tender leaves so they stay fresher longer, meaning no questionably brown parsley or cilantro. Being able to eyeball the difference between parsley and cilantro? That's a lesson for another time.But the reason washing your herbs in advance is truly a pro move is that it makes you about 100 times more likely to reach for them when you’re in the kitchen. Clean any herbs that are visibly dirty or feel gritty in your mouth (dill, too) beforehand, so you can add them by the handful to a dish in an instant. Here’s how we do it in three easy steps. All right, maybe not stop, drop, and roll easy, but still, super super easy.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon Andrews1. Trim the ends of your herbs with a knife or shears. Freshly cut stems help herbs absorb water better so they’ll perk up. The better your herbs look, the better your finished dish will look. If the stems are thick and you’re going to discard them later, you might as well pick the leaves now, too.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon Andrews2. Place the herbs in a salad spinner and fill it with cold water. Agitate the herbs with your hands to loosen dirt from the stems and leaves. Then drain the spinner. Repeat this process until the water is clear, and spin those herbs dry.Photo by TED+CHELSEA CAVANAUGH, Food Styling by Simon Andrews3. Transfer the herbs to paper towels, then roll them up in the damp towels and store them in a plastic bag. You want to keep some moisture in there, so they stay fresh. You can refrigerate them for up to a week, pulling a few leaves whenever you need.And you're done. You'll be slinging herbs so fast, you'll get some kind of Wild West bandit nickname. Quick Draw Susie. Leafy Luther. Quality Parsley Patrick. The Good. The Bad. The Herbaceous.Do you have to pick your herbs though?Do You ACTUALLY Have to Pick Herbs?Well, that depends. Are they hardy? Are they tender? And how lazy are you?View StoryExplore Bon AppétitherbTest KitchenCooking TipsBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-03-01", "author": ["Condé Nast", "Ashley Mason", "Alex Delany"]}