{"id": "a6f0b897b484f7d05325db647bfb825b", "url": "https://www.bonappetit.com/recipe/farmers-market-farro-bowls", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Farmers Market Farro Bowls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2020 IssueFarmers Market Farro BowlsBy Christina ChaeyJuly 18, 20204.8(23)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, FOOD STYLING BY CHRISTINA CHAEYEmailPinterestPrintEmailPinterestPrintThis lunch-friendly, veg-packed grain bowl takes loose cues from bibimbap, the Korean rice and veg dish, and relies on a few make-ahead staples to come together fast. The farro, tofu, eggs, dressing, and pickles can all be made up to five days ahead and stored in the fridge. When you’re ready to eat, all that’s left to do is toss in a handful of your favorite sliced or shredded vegetables for a versatile, on-the-fly lunch.Ingredients4 servings1cup semi-pearled farro1tsp. kosher salt, plus more4large eggs1large watermelon radish or 6–8 red radishes, trimmed, thinly sliced on a mandoline if you’ve got one¼cup unseasoned rice vinegar2Tbsp. sugar, divided114-oz. block extra-firm tofu, drained3Tbsp. plus ¼ cup grapeseed or vegetable oil, divided2Tbsp. fresh lime juice2Tbsp. gochujang (Korean hot pepper paste)1Tbsp. mayonnaise1Tbsp. plus 1 tsp. soy sauce1Tbsp. plus 1 tsp. toasted sesame oil1medium zucchini or summer squash, halved lengthwise, cut crosswise into ¼\"-thick half-moons2–3cups thinly sliced or shredded raw vegetables (such as carrots, scallions, blanched sugar snap peas, baby bok choy, cucumbers, pea shoots, or alfalfa sprouts)PreparationStep 1Pour farro into a medium saucepan of boiling salted water, reduce heat, and simmer, stirring occasionally, until tender, 25–30 minutes. Drain farro and spread out on a rimmed baking sheet; let cool.Step 2Meanwhile, using a slotted spoon, carefully lower eggs into a small saucepan of boiling water and cook 6½ minutes for an oozy, jammy yolk or 7 minutes for a slightly firmer middle. Transfer eggs to a bowl of ice water with slotted spoon and let sit until cool enough to handle, about 2 minutes. Remove eggs from ice water; peel and slice in half lengthwise.Step 3Pack radish slices into a pint jar. Whisk vinegar, 1 Tbsp. sugar, 1 tsp. salt, and ½ cup hot water in a small bowl until sugar and salt are dissolved. Pour brine over radish slices; let cool. Cover and chill at least 1 hour before using.Step 4Cut tofu crosswise into ½\"-thick slabs, then cut each slab on a diagonal to create 2 triangles. Pat dry with a clean kitchen towel. Heat 2 Tbsp. grapeseed oil in a large nonstick skillet over medium-high. Add tofu in a single layer, season with salt, and cook, undisturbed, until golden brown underneath, about\n4 minutes. Turn over and cook until golden brown on second side, about 4 minutes. Transfer tofu to a plate; reserve skillet (no need to wipe out).Step 5Whisk lime juice, gochujang, mayonnaise, ¼ cup grapeseed oil,\n1 Tbsp. soy sauce, 1 Tbsp. sesame oil, and remaining 1 Tbsp. sugar in a small bowl. Taste; season with salt if desired.Step 6Heat remaining 1 Tbsp. grapeseed oil in reserved skillet over medium-high. Add zucchini, season with salt, and cook, tossing just once or twice, until tender and blistered in spots, about 4 minutes. Add remaining 1 tsp. soy sauce and 1 tsp. sesame oil and toss to coat. Transfer to a plate.Step 7To serve, divide farro among bowls. Arrange eggs, drained pickled radish, tofu, zucchini, and raw vegetables of choice on top as desired. Drizzle each bowl with a few spoonfuls of dressing to your liking.How would you rate Farmers Market Farro Bowls?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleI have made this SO many times in the last year - and it never gets old. Usually what ends up happening is I prep everything and then throughout the week I make changes or just end up dipping all of my veggies/tofu/jammy eggs straight in this addictive gochujang vinaigrette. This bowl is the reason I ALWAYS have pickled veggies around and in all my salads and bowls now. Thanks so much Christina for this amazing recipe - a filling lunch and now the template for all my fave lunches and bowls.AnonymousChicago8/24/2021It's a grain bowl, not a rocket launch, you don't have to follow a precise recipe and you can make substitutions to your taste. Especially in a recipe where the whole point is to use it as a foundation and change it up to what's in season or available! Of course sambal doesn't taste the same as gochujang, you'll definitely miss out on some of the sweet-savory fermented flavors, maybe put some extra tamari or a little gluten-free miso paste, or maybe even try doubanjiang and add a touch more sugar. The possibilities are endless. AnonymousBerkeley, CA1/20/2021Ok, non-ethnic ppl...you can't just sub different asian hot sauces/pastes willy-nilly. They all have different flavour profiles (sweet, salty, sour/tangy, etc)! If you are gluten free, and can't use gochujang, find another recipe...there are hundreds to choose from out on the world wide web 🙃 Peace!AnonymousVancouver 1/15/2021This was really tasty - my boyfriend and I enjoyed it a lot. While it was good, it was, for me, too much effort for the outcome though - and for a lunch bowl. For the same or possibly less effort, I would rather just have straight-up traditional bibimbap.AnonymousCalifornia9/8/2020My Thai husband loves this dish! So good as leftovers and he can put the sauce on anything. Definitely recommend! AnonymousFlorida8/26/2020JAMES FORKY-FINGERS, may we (my spouse and I) respectfully disagree... Only large eggs will complete this delectable dish. Small eggs are riotously inedible even at this time of year when many pullets are beginning to lay. Any by raw beef, we can only assume you meant ground beef, to which we say, \"kudos again!\"baking soda kweenOmaha8/22/2020Delicious and a great template for future grain/veg bowls. Love the mix of raw, sauteed, pickled veg. The eggs turned out perfectly jammy.a.goekler7491Denton, TX8/12/2020This dish tastes amazing, but the best part might be how pretty it is to look at. Like, I actually got excited to eat my work-from-home lunch (which never happens anymore). Everything but the zucchini can be prepped ahead of time and kept in the fridge, which I love. You could probably prep the zucchini, but I can't tolerate when it gets soggy, so I always make it fresh.Anonymousminneapolis8/12/2020Really delicious and flexible, the sauce is flavorful and ties everything together.  AnonymousCalifornia8/4/2020Delicious! I subbed zucchini for nacho cheese doritos to give it that extra zing!Leo GardinerNew Zealand8/1/2020Great, healthy, and tasty! It was easy to throw it all together, and is forgiving in the realm on toppings.\nAnonymousOregon7/30/2020Love this! Have been making on repeat for lunches. I find it to be super adaptable (I have subbed rice for farro when I was out or added spinach/mixed greens to the base, etc.) and the dressing ties it all together. AnonymousSan Francisco7/28/2020I made the dressing with 1 Tbsp of sesame oil and the sesame oil was all I could taste - remade using 1 tsp and it was much better. Overall pretty good recipe. Anonymous7/27/2020Tasty! Denver, try subbing Sambal Oelek maybe? I think that’s gluten free and I use that or Siracha when I run out of goghujang kilpatrichbacon9659Denver7/26/2020Instead of large eggs I used small eggs, still tasted great! Fantastic recipe as always Janice. Would recommend using raw beef James Forky-FingersWisconsin7/25/2020Explore Bon AppétitRice and Grain BowlFarroRice & GrainsRadishVegetableTofuOther IngredientsSpringSummerMainVegetarianDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-18", "author": ["Condé Nast", "Christina Chaey"]}