{"id": "a6f6b98f1cc17c7efd176ed5c08b3f44", "url": "https://www.bonappetit.com/story/wellness-cocktails", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Stop Selling Me “Wellness’’ Cocktails, Please | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleStop Trying to Sell Me “Wellness’’ CocktailsMarrying booze with ostensibly healthful ingredients doesn't negate alcohol's harmful effects; it adds baggage to what should be a purely hedonistic pursuit.By Laura ScholzOctober 11, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailI emerge blissful and calm from my heated vinyasa yoga class and head to the studio’s juice bar for some post-sweat hydration. What do I spy among the usual assortment of grain bowls, dairy-free smoothies, and immunity-boosting tonics? Cocktails.Wherever I look, from my Instagram account to my inbox—which is full of eager pitches for things like botanically driven boozy teas and low-calorie alcoholic shrubs—it’s clear that the wellness monster is coming for cocktails.This needs to stop.The wellness industry, which includes everything from global-festival juggernaut Wanderlust to 2,245-dollar Peloton bikes to health-focused lifestyle stores pedaling small-batch kombucha next to healing crystals, is, by its own account, a $4.2 trillion dollar business. It’s no surprise that the wine, beer, and spirits industry is trying to get in on the action by attempting to redefine alcohol as healthy. Even as some millennials are becoming more mindful of their drinking habits, every fun run ends with a pint of beer (or three), and yoga studios are hosting “Namaste Rosé” events. So-called wellness cocktails might seem like just another gimmick, but it's just plain irresponsible to brand drinking as \"healthy.\"This muddy marketing means that wellness, which Merriam-Webster defines as “the quality or state of being in good health” has become a nebulous concept. But health isn’t. The WHO defines health as “a state of complete physical, mental and social well-being.” Much like fat-free cookies, veggie chips, and gluten-free snacks, this wave of so-called wellness cocktails feels like yet another attempt to peddle faux health foods to the masses. But no matter how you spin it, alcohol isn’t healthy. Sure, you can infuse vodka or tequila with CBD, apple cider vinegar, ginger, or any adaptogen on the menu at your corner juice shop, but the base product remains the same: a potentially dangerous mood and mind-altering drug.This isn't the first time that alcohol has been associated with medicine and nutrition. Ancient Egyptians used bitters to treat common maladies, Medieval monks prescribed beer to prevent the plague, and our own grandparents swore a shot of whiskey flushed out fevers. But contemporary research proves that (too much) alcohol isn't good for the human body. So when brands and restaurants boast about the supposed health benefits of celery juice cocktails and boozy turmeric tonics, they're actually spreading false information.Am I interested in cocktails that have less sugar and fewer artificial flavors than a 700-calorie, pre-batched jumbo margarita? Absolutely. But I'm under no illusion that these alternatives will be good for me, nor do I want them to be. I’ve spent more than half my life counting calories (or fat or carbs or whatever food group has been deemed “bad” by the wellness machine in any particular year). I’ve been paralyzed by fear of making the “wrong” choice every single time I sit down for a meal, and sometimes I still feel culturally programmed to order the chopped salad (with dressing on the side, of course) when all I really want is a bacon double cheeseburger. I don’t need another one of my vices—sipping an ice-cold cocktail with my dinner or on my rooftop deck at the end of a long day—co-opted by toxic diet culture driven by pseudo-science and Instagram influencers. Marrying booze, an ingredient that is not healthy by any scientific definition, with ostensibly healthful ingredients, doesn't negate alcohol's harmful effects; it simply adds baggage to what should be a purely hedonistic pursuit.Just as I’ve come to terms with the fact that eating a few slices of deep-dish pepperoni pizza (not that cauliflower bullshit) now and then doesn’t make me an unhealthy person, I’ve come to understand that alcohol is an indulgence in my otherwise well-balanced diet. It's not a plate of fruit and vegetables, and that's the point.Explore Bon AppétitHealthyishAlcohol & Other DrinksessayRead MoreLifestyleMy Intrepid Quest for a Non-Alcoholic Cocktail I Actually Want to DrinkBy Rachel Sugar Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-11", "author": ["Condé Nast", "Laura Scholz"]}