{"id": "a7052b686820c8a436a921674cc35fc2", "url": "https://www.bonappetit.com/story/if-you-care-about-wellness", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "If You Care About Wellness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleIf You Care About WellnessI hope you’ll also pay attention to the lack thereof.By Amanda ShapiroMay 14, 2020FacebookTwitterEmailIllustration by Karl-Joel LarssonFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Healthyish launched over three (!) years ago, just a few days after the presidential inauguration. I worried a lot about bringing a site focused on food and wellness into the world in that political climate. I worried, at the time, about it being relevant or helpful or even interesting. What I’ve learned since then is that everything—recipes, restaurants, food businesses, wellness—is political whether we like it or not. It’s up to us to choose whether and when to acknowledge it explicitly.Sure, sometimes you just want to find a quick stir-fry recipe for a Wednesday night. Or a cookie stuffed with enough nuts and seeds to count as healthyish. Or to laugh about one writer’s absurdist quest to recreate the Impossible Burger while self-quarantined. But other times you gotta talk about it. And I think right now is one of those times.It might be convenient to think that the killing of Ahmaud Arbery, while terrible and tragic, is beyond the scope of a wellness site. I got a letter to that effect this morning, though the sender used some different words that I won’t repeat here. But I have to disagree with the letter-writer because I think a 25-year-old Black man’s killing couldn’t be more relevant, especially right now.As writer Shanika Hillocks wrote in yesterday’s essay, which I hope you’ll read, Arbery was killed while exercising: something we know to be one of the best and easiest ways to protect our health. And he was doing what we’ve been told, again and again, is one of the most accessible and affordable forms of exercise there is: jogging outside. I’ve been thinking a lot about that: The very act of trying to preserve his health became the reason he lost his life. And all because two white men saw his body as a threat.If there’s one mission statement that’s guided Healthyish from the start, it’s that wellness should be accessible to everyone. Arbery’s killing is a blunt-force reminder of how far we are from that dream. Want another reminder? Look no further than this global pandemic, which is killing people of color at twice the rate of white people in some parts of the country. The health conditions that put people at high risk of dying from COVID-19—like heart disease, asthma, and diabetes—are the same ones that plague many low-income and Black communities. These, in turn, are caused by systems of racial and economic inequality: mass incarceration, poor healthcare, neighborhood and workplace pollution, lack of healthy food options, and, yes, not enough time, money, or ability to exercise.If you pay attention to wellness, I hope you’ll also pay attention to the lack thereof. Who gets to be well and who doesn’t, and who gets killed for trying. A GoFundMe is raising money to support Arbery’s family, and RaceForward is a national nonprofit working to dismantle barriers to racial justice. As Hillocks writes, “I’m now holding those who consider themselves allies accountable: keep us moving, and keep us alive.”Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleI Run For My Health. Do I Have to Fear For My Life?By Shanika HillocksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-14", "author": ["Condé Nast", "Amanda Shapiro"]}