{"id": "a7084d96a33810edd1655a906290c143", "url": "https://www.bonappetit.com/recipe/coconut-and-lemongrass-steak-skewers", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Coconut and Lemongrass Steak Skewers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueCoconut and Lemongrass Steak SkewersBy Chris MoroccoJune 2, 20204.2(9)Read ReviewsTriangleEmailPinterestPrintPhotographs by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintAt Laser Wolf, an Israeli-style “skewer house” in Philly, chef Andrew Henshaw grills heavily marinated cubes of well-marbled steak until the exteriors are charred and the insides are still juicy. The technique’s advantages are clear: more surface area, more caramelization, an astonishingly quick cook time, and tidy pieces that are easy to share. Creamy, almost-but-not-sweet coconut milk will help tenderize and flavor humbler cuts like hanger, flatiron, and flap.Ingredients4 servingsDressing2serrano chiles, chopped (seeds and all)¼cup fresh lime juice2Tbsp. extra-virgin olive oil2Tbsp. finely chopped red onion2tsp. honeyKosher saltSkewers and assembly2lemongrass stalks, bottom third only, tough outer layers removed, thinly sliced2serrano chiles, with seeds if you want some heat12\" piece ginger, peeled, thinly sliced4garlic cloves113.5-oz. can unsweetened coconut milk⅓cup seasoned rice vinegar1½lb. trimmed hanger, flatiron, or flap (bavette) steak, cut into 1\" cubesVegetable oil (for grill)Kosher saltChopped cilantro (for serving)Special EquipmentTen to twelve 8\"–10\" metal skewers, or bamboo, soaked 30 minutesPreparationDressingStep 1Whisk chiles, lime juice, oil, onion, and honey in a small bowl to combine; season with salt.Skewers and assemblyStep 2Purée lemongrass, chiles, ginger, garlic, coconut milk, and vinegar in a blender until smooth. Transfer to a medium bowl. Add meat and toss to coat completely. Cover with a large plate and let sit at room temperature at least 4 hours or chill up to 1 day.Step 3Prepare a grill for medium-high heat; oil grate. Drain marinade from meat and thread meat onto skewers; season lightly with salt. Grill, turning every 1–2 minutes, until meat is browned all over and firm around edges with just a bit of bounce in the center when gently pressed, 6–8 minutes for medium.Step 4Transfer skewers to plates. Drizzle with dressing and scatter some cilantro over.How would you rate Coconut and Lemongrass Steak Skewers?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleLove these! Huge hit with my family and super easy to make as long as you have all the ingredients (which I actually didn’t). I subbed lemon zest for the lemongrass stalks and they still tasted amazing! Anonymous8/5/2020Delicious kebabs! Used tri-tip steak, as the others were unavailable. Very tender and flavorful.AnonymousSeattle, Wa7/24/2020Good flavors although I wish they came through more! Marinated for a day but still wish flavors were more intense.KatiehwalshAustin7/11/2020This was a hit! I doubled the dressing because I always like to have extra. I paired it with the Miso-y Grilled Potatoes from the same issue. Prep for both can be done ahead and then the grill time is about the same for both the skewers and potatoes - perfection!AnonymousAustin, TX7/11/2020Really delicious kebabs!! I couldn’t find flank in my grocery store so I used some beef tenderloin instead. It was a pretty good replacement but I would’ve cooked them a little longer. All in all really good but just use flank. groseoWisconsin6/12/2020Explore Bon AppétitSkewerAsianSteakBeefMeatSummerMainGluten-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Chris Morocco"]}