{"id": "a719421d9ea2db25fbd7b0a105e7c6a6", "url": "https://www.bonappetit.com/recipe/omusubi-with-soy-butter-mushrooms", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Omusubi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueOmusubi With Soy-Butter MushroomsBy Keiko NakashimaSeptember 14, 20215.0(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Pearl Jones, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintYou can find a version of the adorable Japanese stuffed rice balls known as omusubi (or onigiri) at the California chain Sunny Blue. These are filled with a salty-buttery mix of chopped mushrooms, such as earthy shiitake, shimeji, and enoki. All are easy to find in Asian supermarkets, but you can also use crimini or button mushrooms with great results. Just make sure to cut the mushrooms into fairly small pieces so they can eventually fit inside the rice balls.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonLarge Nonstick Skillet$50 At AmazonChef's Knife$34.53 At AmazonMeasuring Cups$18 At Bon Appétit MarketIngredientsMakes 92cups short-grain sushi rice, rinsed until water is almost clear2Tbsp. unsalted butter5oz. shimeji mushrooms, finely chopped3½oz. shiitake mushrooms, stems removed, caps very thinly sliced2oz. enoki mushrooms, trimmed, halved crosswiseKosher salt1Tbsp. plus 1½ tsp. soy sauce1Tbsp. sake or mirin1tsp. toasted sesame oilPinch of shichimi togarashi or crushed red pepper flakes5toasted nori sheets, cut in halfFurikake (for serving)PreparationStep 1Bring rice and 2½ cups cold water to a boil in a medium saucepan over medium-high. Reduce heat to low, cover pan, and cook until water is evaporated and rice is tender, 18–20 minutes. Remove from heat and let sit, covered, 10 minutes. Fluff rice with a rice paddle or fork, cover again, and let sit until ready to use.Step 2Melt butter in a nonstick skillet over medium heat. Add all of the mushrooms, season lightly with salt, and cook, stirring occasionally, until slightly softened, about 2 minutes. Reduce heat to medium-low. Add soy sauce, sake, and oil and simmer, tossing occasionally, until liquid is reduced to a glossy sauce that coats mushrooms, about 2 minutes. Stir in shichimi togarashi. Transfer to a small bowl and let cool.Step 3Set up a workstation with a small bowl of water, a small bowl of salt, cooked rice (it should still be warm but cool enough to handle), mushroom mixture, and nori.Step 4To make 1 omusubi, scoop ½ cup rice onto a work surface. Dip your hands in water to moisten, then rub them with a little salt. (This prevents the rice from sticking to your hands as you work and also flavors the omusubi.) Cupping rice in your nondominant hand, make a shallow well in the center of the rice mound and fill with a heaping tablespoonful of mushroom mixture. Using your hands and moistening as needed to prevent rice from sticking, gently but firmly shape rice into a ball, fully enclosing mushroom mixture. Place rice ball back on surface and flatten lightly. Using the side of a wet chef’s knife, gently push into a triangle shape. Wrap in a sheet of nori and sprinkle with furikake. Repeat with remaining rice, mushroom filling, and nori.How would you rate Omusubi With Soy-Butter Mushrooms?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI have made this recipe twice now. First time, I made an omusubi at the counter and popped it in my mouth one after another after another, delectable. Second time, I platted nine to munch on and watch a movie. I do prefer the informality of eating them before they even touch the plate. The mushrooms stay warm and tender, along with the omusubi. But either way, delicious and interesting way to use up leftover mushrooms, just chop them fine :)MadelineReno, NV3/4/2022So yummy and easy to makeAnonymousCorvallis, OR9/22/2021This looks good!Ruben BillingsSanta Clarita, CA9/20/2021Explore Bon AppétitMushroomVegetableRiceRice & GrainsJapaneseEast AsianAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Keiko Nakashima"]}