{"id": "a7235e93bf4cb3a30c81ff72be31c34b", "url": "https://www.bonappetit.com/story/pantry-spreadsheet", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "My Pantry Spreadsheet Is Bringing Me So Much Joy Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Pantry Spreadsheet Is Bringing Me So Much Joy Right NowIt's become one of my most invaluable tools for cooking in quarantine.By Christina ChaeyMay 16, 2020FacebookTwitterEmailPhoto by Underwood ArchivesFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish readers,Would you believe me if I told you the most exciting thing in my life right now is a...spreadsheet of all the things in my pantry/fridge/freezer? I started it a few weeks ago after I couldn’t get the freezer door to shut, did a quick intake of what all was in there, and realized about 80 percent of it was mine (sorry, Emma and Becca!).Before I attempted to shove everything back in the freezer, I made a resolution to cook with at least one frozen thing a day (because what was I saving it all for, anyway?). I logged every single item in a Google Sheet, possibly the most Big Virgo Energy thing this Sagittarius has ever done. (I know Healthyish editor/Virgo Amanda Shapiro will appreciate this reference.) I made categories for fish, meat, carbs (tortillas, ramen noodles), and frozen vegetables. I made columns titled “Quantity” and “Use For,” where I jotted down recipe ideas. And pretty soon, my “Quarantine Pantry” spreadsheet became one of those permanently-open tabs in my browser, next to all the longform articles I keep promising myself I will read this weekend.I’ve since added tabs for fresh produce, dried goods, condiments, and baking supplies. I’ve learned that knowing how much of something I have is crucial, because the second I realize I’m almost out, I’m motivated to find a way to use it up sooner rather than later. (Which is how a couple of almost-empty jars of pumpkin and sunflower seeds and a container of frozen egg whites recently became a batch of Granola Cluster Cookies.)The beginnings of Granola Cluster Cookies \nI’ve also been copy/pasting in links to inspiring recipe ideas I come across. When I see a line in the spreadsheet that says I have a pound of Italian sausage in the freezer, I can also see notes I’ve written for myself that say things like, “sausage and greens lasagna; broccoli bolognese; lentil soup.” Each of those excites me just reading them—all that’s left to do is pick one.Almost three weeks in, I’m happy to report I can finally see the back wall of the freezer again. Using the spreadsheet as my guide, I’ve slowly chipped away at my stash, turning corn tortillas into enchiladas, pints of frozen red wine and beef broth into comforting mushroom bourguignon (a Smitten Kitchen classic), and stewing up quick pots of cod chowder. What started out as an attempt to get organized has become an invaluable tool in quarantine, as indispensable as my cast iron skillet or Microplane. I have no idea how long this system will last. But for the time being, when I’m barely leaving the house and seeing no one but my roommates, this is my idea of “making my own fun.” And if kitchen organization is your jam, stay tuned for next week’s newsletter, where I will probably write 500 words on how obsessed I am with my new tape-cutter for labeling things around the kitchen. Call it the new me!!!Wishing you a meticulously organized weekend,Christina ChaeyAssociate editor, chronically disorganized except when it comes to the pantry now(P.S. You can listen to Adam Rapoport making fun of me for how much I love my pantry spreadsheet on the upcoming episode of the BA Foodcast, which comes out on Wednesday 5/20.)Explore Bon AppétitHealthyishWhat's Chaey Cooking?essayRead MoreLifestyleThe Recipe I Make For My Mom Every YearBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-16", "author": ["Condé Nast", "Christina Chaey"]}