{"id": "a73af8adb86e32827835a36ba2ef7335", "url": "https://www.bonappetit.com/recipe/simple-and-citrusy-asparagus-stir-fry", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "Asparagus Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSimple and Citrusy Asparagus Stir-FryBy Andy BaraghaniMay 9, 20194.6(13)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThe trick to this citrusy stir-fry is to get your pan roaring hot before adding the ingredients, which brings out all of the flavors in the aromatics while keeping the asparagus beautifully bright green and crisp.Ingredients4 servings1red chile (such as Fresno or Holland), thinly sliced, seeded if you prefer less heat2garlic cloves, thinly sliced1Tbsp. vegetable oil1lb. asparagus, trimmed, thinly sliced on a diagonal about ¼\" thickKosher salt1Tbsp. soy sauce1Tbsp. unsalted butter, cut into pieces1medium orange, halved½cup cilantro leaves with tender stems1tsp. toasted white sesame seedsPreparationStep 1Heat a large skillet over medium-high until hot, 3–5 minutes (a drop of water should jump around in the pan). Cook chile, garlic, and oil, stirring constantly, until oil starts to shimmer and garlic just begins to turn golden, 60–90 seconds. Immediately add asparagus; season lightly with salt. Cook, tossing occasionally, until asparagus is just beginning to brown around the edges, about 2 minutes. Add soy sauce, butter, and 1 Tbsp. water and cook, tossing constantly, until asparagus is still crispy yet cooked through and coated in sauce, about 30 seconds longer.Step 2Remove pan from heat. Finely grate zest from one-quarter of orange over stir-fry. Squeeze juice from one orange half over and toss once more.Step 3Transfer asparagus mixture to a platter. Top with cilantro and sesame seeds. Taste and squeeze more orange juice over if needed.How would you rate Simple and Citrusy Asparagus Stir-Fry?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThe flavors of this dish come together beautifully. The perfect accompaniment to fish, red meat, pork, poultry, or a side of rice. So simple and delicious. Will definitely be making this again, and again. Laura Santa Fe 2/17/2022This is deliciously composed and so simple. I wouldn't call the yield 4 servings though. For a family of 4 to be satisfied, I would suggest doubling the recipe. Will PlattMadison, CT5/18/2021This was surprisingly wonderful.  I had to swap out red chiles for jalapenos and added a few drops of sesame oil instead of the sesame seeds because that's what I had, but it was still great.  I think it would be fabulous with some shiitake mushrooms added in.  Went great with fish.  I will definitely make this again!AnonymousNWPA!5/15/2020A bright & summery side dish! Great, creative way to use up asparagus.AnonymousToronto4/6/2020Be judicious with the cilantro; it can takeover the dish. The orange flavor is niceacookfromdetroit1/2/2020Delicious warm or cold. The orange really brightens this up and pairs well with salmon and rice. Definitely a new go-to!erica_kellySavannah, GA7/24/2019A+ recipe.  Paired it with the peanut noodle recipe that called for tempeh but left the tempeh out and added lots of veg. It was better than any Chinese takeout!  This dish is incredible - great side for any pasta or protein meal and so east but will be a huge hit.  Will keep this in rotation!FlourIsAGirlsBesrFriendBoston5/18/2019The orange zest and juice take this little meal to a whole new level! I was worried that I would just be eating a plate of asparagus but there was so much flavor happening! Andy hit it out of the park, as usual.bstevens94Wenatchee WA5/14/2019So flavorful and fast! The orange juice adds so much brightness.alizaraeNew York 5/10/2019Explore Bon AppétitStir-FryAsparagusVegetableOrangeCitrusFruitSpringQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeVeganVegetarianHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Andy Baraghani"]}