{"id": "a75bb98df3c900cee0860db9bc4a422b", "url": "https://www.bonappetit.com/recipe/iced-spiced-hermits", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Iced Spiced Hermits Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueIced Spiced HermitsBy Dorie GreenspanNovember 23, 20214.3(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintChewy and dark with molasses, these spicy hermits from Dorie Greenspan lie somewhere between a cake and a cookie. Featured in her newest book, Baking With Dorie, these classic New England treats are spiced with cinnamon, nutmeg, ginger, and black pepper. “Play around with their proportions, if you’d like,” Greenspan writes, “or include other spices that you’d use for Christmas cookies, pumpkin pie, or fruitcake.” Don’t like raisins? Try other plump dried fruit like currants, cranberries, or chopped figs.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronElectric Mixer$40 At AmazonWhisk$10 At AmazonAteco Bowl Scraper$3 At AmazonMesh Sieve$13 At AmazonSerrated Knife$54 At KorinIngredientsMakes about 24Cookies2cups (250 g) all-purpose flour1½tsp. ground cinnamon1½tsp. ground ginger1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¾tsp. baking soda½tsp. freshly grated nutmeg¼tsp. baking powder¼tsp. freshly ground black pepper1cup (packed; 200 g) light brown sugar½cup (1 stick) unsalted butter, room temperature1large egg¼cup mild-flavored (light) molasses½cup (80 g) golden raisinsGlaze and assembly1cup (110 g) powdered sugar, sifted2Tbsp. (or more) milk, fresh lemon juice, or rumPreparationCookiesStep 1Whisk together flour, cinnamon, ginger, salt, baking soda, nutmeg, baking powder, and pepper in a medium bowl.Step 2Using an electric mixer on medium speed, beat brown sugar and butter until light and creamy, about 3 minutes. Beat in egg and molasses, scraping down sides of bowl as needed, until incorporated, about 2 minutes. Reduce speed to low and add dry ingredients; beat until just combined. Add raisins and mix just to evenly distribute. Cover and chill at least 30 minutes and up to 12 hours.Step 3Place a rack in middle of oven; preheat to 350°. Divide dough in half and transfer to a parchment-lined baking sheet. Using wet hands, shape dough into two 12\"-long logs (a plastic bowl scraper is helpful for this) and arrange on opposing long sides of baking sheet, spacing 2\"–3\" from long edges. Lightly flatten top of each log.Step 4Bake logs until edges are just set but centers are still soft, 23–26 minutes (logs will spread and crack). Let cool.Glaze and assemblyStep 5Whisk powdered sugar and milk in a small bowl until smooth. Glaze should be thick but pourable; thin with more milk if needed. Drizzle glaze erratically over logs; let sit until set, at least 30 minutes. Using a serrated knife, slice logs crosswise 1\" thick (or slice 2\" thick and cut in half down the center for a squarish cookie).Do ahead Cookies can be assembled 4 days ahead. Store airtight at room temperature.Excerpted from ‘Baking With Dorie: Sweet, Salty, & Simple’ 2021 by Dorie Greenspan. Reproduced by permission of Mariner Books, an imprint of HarperCollins Publishers. All rights reserved.\n\nBuy on Amazon or Bookshop.orgHow would you rate Iced Spiced Hermits?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleCandied ginger definitely!  Maybe finely chopped walnuts as well.  I find this a perfect breakfast cookie with tea or coffee.JeanneSammamish, WA12/28/2021Made these as written because I trust Doris implicitly.  I did substitute chopped dried figs for raisins because I had them on hand. They are PERFECT. Soft, chewy, spiced just right. Definitely keeping in the winter rotation Anonymous12/23/2021These rock. I reduced the brown sugar to 150g and also didn't make the icing just because I was out of powdered sugar. I love the super molasses-y flavor and the spices go beautifully. The texture is also awesome and functional; I brought these in to a work holiday party and they easily withstood a jostley train ride. Highly recommend! KatChicago12/17/2021Truly sensational. The most unique, spicy, slightly salty delight! Great for the holidays. I subbed maple syrup for molasses, because it's what I had.MollyWashington, D.C.12/15/2021These were lovely! Altered the recipe a bit…replacement of GF flour blend (1:1), reduced to half of the brown sugar, added a “pour” of maple syrup, replacement of blackstrap molasses, and nixed the raisins. The dough was quite sticky after chilling so i formed the logs as best i could and they turned out delicious! Looked beautiful as well! Baked for 23 min; would have pulled a minute sooner if i checked beforehand. Jo SteinbargerSaint Paul, MN12/8/2021I made these as written - I thought they were a little too sweet and not quite spicy enough, but nice flavor and texture. I added cloves and a little bit of candied ginger in with the raisins, and used lemon juice for the glaze. I'd make these again, but next time I'd cut down the sugar and use stronger flavored molasses. EmilyNew Jersey11/28/2021Explore Bon AppétitCookieDessertHoliday CookiesChristmasMolassesCondiments, Sauces & PastesBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Dorie Greenspan"]}