{"id": "a75c6ddc77132021643a020b9454aac1", "url": "https://www.bonappetit.com/recipe/piri-piri-meatballs", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Piri-Piri Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPiri-Piri MeatballsBy Molly BazApril 5, 20194.7(49)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintFresh piri-piri chiles can be difficult to find in the U.S., so for our take on a vibrant piri-piri sauce, we subbed in a fresh Fresno chile, which carries noticeable heat and a delicious fruity flavor. You can also double the sauce recipe and use it on anything from chicken to pasta the next day.Ingredients4 servingsPiri-Piri Sauce½cup jarred roasted red peppers, drained1red Fresno chile, stemmed, seeded1small garlic clove3Tbsp. extra-virgin olive oil2Tbsp. red wine vinegar1½tsp. kosher salt1tsp. smoked paprikaMeatballs and Assembly⅔cup panko (Japanese breadcrumbs)1large egg2garlic cloves, finely grated1¼tsp. kosher salt¾tsp. ground cumin½tsp. smoked paprika1Tbsp. extra-virgin olive oil, plus more for drizzling1lb. ground beef, divided¾cup whole-milk Greek yogurtPreparationPiri-Piri SauceStep 1Purée red peppers, chile, garlic, oil, vinegar, salt, and paprika in a blender until very smooth. Transfer to a small bowl.Step 2Do Ahead: Sauce can be made 1 day ahead. Cover and chill.Meatballs and AssemblyStep 3Place a rack in upper third of oven; preheat to 450°. Mix panko, 2 Tbsp. piri-piri sauce, and 1 Tbsp. water with a fork in a medium bowl to hydrate panko. Add egg and mash together with fork until paste is homogenous, about 1 minute. Let sit until panko is softened, about 3 minutes. Add garlic, salt, cumin, paprika, and 1 Tbsp. oil and stir to incorporate. Add about one-third of ground beef and gently work into panko mixture with your hands until it no longer feels wet and is well incorporated. Add remaining ground beef and gently combine again with your hands until evenly dispersed and homogenous.Step 4Form ground beef mixture into twelve 2\"-diameter balls. Space evenly on a foil-lined rimmed baking sheet.Step 5Bake meatballs 5 minutes, then turn on broiler (you can leave the meatballs in the oven while broiler heats up) and broil until golden brown on top and just barely cooked through, 5–6 minutes longer.Step 6Spread yogurt among plates. Arrange meatballs on top. Drizzle with remaining piri-piri sauce and more oil.How would you rate Piri-Piri Meatballs?Leave a ReviewTell us what you thinkReviews (29)Back to TopTriangleOne of my go-tos. I find it a bit too salty, so I cut back on the salt. I also double the meat (But not the sauce, the ratios work out and you still have some sauce left-over). I don't bother with the yogurt unless I'm plating it for guests.JSChicago, IL4/19/2021I've made this many times, and I do it as written with the BIG exception of adding the sauce directly to the meatball mixture! It makes them so tender, flavorful and moist. I find the uncooked vinegar-y sauce way too harsh, but cooked it is mild smoky and not overwhelming at all. MonicaNew York NY3/12/2021Delicious recipe. Made exactly as written. The piri-piri sauce is vibrantly colored, piquant, spicy, and salty. Nom-nom. The meatballs had good texture and flavor. 10/10 will make again.funfoodinfloridaFlorida, USA2/10/2021Loved this recipe.  Very simple, but wonderful flavor with a hint of spice that is then cooled by the yogurt.  Definitely on my list of repeats.  twj36Frederick MD2/9/2021Absolutely loved this recipe and have already shared with friends!  I made a few substitutions to work with what I had - regular breadcrumbs versus panko, sour cream versus yogurt, and no fresno chili.  The later probably meant my sauce wasn't as spicy, but it was still delicious!  The only thing I'll change for next time is making sure my meatball mixture is better combined.  I thought I had done a good job and mixing thoroughly, but when I baked them there were definite spots of meat versus breadcrumb mixture.  Other than that, delicious! RachaelToronto, Canada2/3/2021We thought this recipe was excellent and will definitely make it again. We used our own ground beef which made the meatballs very tender. We also used a very generous 1/2 cup of red peppers we roasted ourselves. For seasoning we used toasted cumin and opted for the smaller portions of (coarse) kosher salt. And as usual for us we doubled the garlic. Next time we may try  mixing in some ground lamb with the beef.AnonymousBedford NH1/16/2021The meatballs were good, but the cooking time was too long. They were well done. I think 2 minutes at 450 then 5-6  minutes under broiler would be better. I broiled until they were just brown, but that made them overdone.\nThe sauce was overwhelmed by the smoked paprika. Way too much. I would do 1/4 tsp smoked paprika and 3/4 tsp sweet paprika.\nAlso, this sauce is not cooked so it is very harsh from the uncooked garlic and the acid from the vinegar. This sauce needs to be gently simmered for at least a half hour to mellow out the flavors.\nAnd I only had 85/15 ground beef - it needed the extra fat in 80/20.\nI'm going to try it again with these modifications.tubbyjbearEvans, GA9/28/2020If you're vegetarian I highly recommend subbing Gardein meatballs in for the homemade ones in this recipe. Serve with the piri piri sauce and yogurt, plus rice and seared green beans. It's one of my favorite meals.kthrns8/17/2020So flavorful!!! I used almond flour to make this gluten free and roasted my own bell peppers. I can’t have dairy so left out the yogurt. The meatballs and sauce were quite salty without the counterbalance of the yogurt, so I’d reduce the salt a bit if you’re not using yogurt. Though I can imagine it would be delicious with the yogurt — I may have to find a good dairy free alternative. Will make this again!AnonymousSan Diego7/14/2020We liked this recipe but didn't love it. The smoked paprika and cumin were a bit much in the meatballs and we couldn't really taste the sauce because it was overpowered by the meatball spices. I would try making it again but adjusting some of the spices a bit so it's better balanced.Anonymous7/12/2020Just so so good! Loved it. Sauce was perfecttt. Would probably be great served with rice but did side of store fried bok choy. adamleclairOsaka, Japan6/4/2020Just made this dinner and it was a hit. Didn’t have Panko so used regular breadcrumbs and substituted a red chilli pepper for the Fresno. Turned out great! The balance between the piri-piri sauce, savoury meatballs, and creamy yogurt is incredible, will definitely be returning to this recipe. AnonymousToronto5/26/2020This was delicious. The aroma of the sauce is amazing. I had to use red chili flakes instead the Fresno chile and I didn't have any jarred roasted red peppers, so I just roasted a fresh red bell pepper under the broiler, peeled off the black skin and chopped it up to get 1/2 cup. It was still great and a nice change of pace.Sunglasses56Fishers, Indiana4/27/2020This was amazing and pretty easy to pull together. I did not have any Fresnos, so substituted red pepper flakes. My husband declared, \"This is one of the top five things you've ever made.\" We will definitely be adding this to the dinner rotation.Portland, Oregon4/20/2020Very flavorful! Love the smokiness, the tanginess and how the yogurt balances all then rich flavors of the meatballs and piri piri sauce. I trust BA, I’m glad I use the yogurt. I sub the panko for season breadcrumbs, all I had in the pantry. So I had to adjust the salt. It was really delicious 🤤 jessicaolBrooklyn, NY4/14/2020Explore Bon AppétitMeatballGround BeefBeefMeatChileVegetableFresno ChileMainStarterNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Molly Baz"]}