{"id": "a766444dbdac30175dc35eaf5b90dbcb", "url": "https://www.bonappetit.com/recipe/bhindi-ki-sabzi", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Bhindi Ki Sabzi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBhindi Ki SabziBy Priya KrishnaAugust 17, 20205.0(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown EmailPinterestPrintEmailPinterestPrintIn my family, this smoky, crispy, North Indian–style okra is an iconic, clamored-after dish. The key is to cook the okra for a long time, with a lot of whole spices. It’s a foolproof and quick way to get the most flavor out of the summer vegetable while avoiding any slimy texture. You end up with charred, fragrant morsels that are perfect as a side or as a main dish eaten with rice or roti. The key seasoning here is ajwain, which tastes like a more piquant oregano and is a classic pairing for okra’s mild, slightly grassy tones. If you don’t have access to fresh okra, particularly later in the year, try precut frozen okra—it often tastes just as great as the fresh stuff. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.Ingredients2–4 servings2Tbsp. extra-virgin olive oil1tsp. ajwain seeds¼tsp. ground turmericPinch of asafetida1small Indian green chile or serrano chile, finely chopped12oz. fresh or frozen okra, sliced ½\" thick1Tbsp. ground coriander½tsp. fennel seedsKosher salt½tsp. amchoor (green mango powder)Fresh lime juice (for serving)PreparationStep 1Heat oil in a large skillet over medium. Add ajwain seeds and cook, stirring, until golden brown, about 1 minute. Add turmeric and asafetida and swirl skillet to combine, then add chile. Increase heat to high; add okra, coriander, and fennel seeds and toss gently with a metal or other heatproof spatula (you don’t want to smash the okra). Reduce heat to medium and spread out okra in an even layer. Cook, tossing halfway through, until starting to brown, about 10 minutes total. (Tossing instead of stirring is the best way to keep the okra intact and from getting gummy.) Season with salt and continue to cook, turning occasionally, until lightly charred, about 5 minutes longer. (Okra may look gummy at first, but eventually it will start to char).Step 2Remove okra from heat; gently mix in amchoor and add lime juice to taste. Season with more salt if needed.How would you rate Bhindi Ki Sabzi?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleI am not a bhindi person at all, but this recipe has made me a believer! I served it alongside a wet Masoor Dal and basmati rice and *muah* it was divine. Going to be buying and cooking bhindi a whole lot more now!HinaOntario, Canada12/15/2021amazing flavors!\nAnonymousAtlanta6/3/2021I made a variation on this the other night and it was delicious! At the beginning I added some mustard and nigella seeds after the cumin, and a bunch of ground spices (I remember putting in fenugreek and turmeric but can't remember what else) and added in mushrooms with the okra. I seasoned with chaat masala and used ghee. I had this as tacos with scrambled egg and !!! dude ! so goodHannahUK1/4/2021This is so great and really easy!  I loved the flavors and it's always great to see an okra recipe!!AnonymousSeattle10/28/2020This was incredible and so easy to follow without feeling watered down for a white palette. Priya is a genius, pay her what she deservesAnonymousNashville, TN9/13/2020Take some of the cash from the Mercedes ad covering over 50% of my screen and PAY PRIYA!AnonymousNY8/27/2020Priya and all your BIPOC contributors and employees should be paid what they deserve. They are part of the reason we all come back for more recipes, sign up for newsletters and continue to push Bon Appetit to be better. Stop gaslighting and stealing.AnonymousMinneapolis8/20/2020Pay Priya what she deserves. Her recipes and videos are among the best at BA. It's a shame your company doesn't have decent values.AnonymousWashington8/19/2020Priya's recipes are just great!\n\nYou know what else would be great? Fair pay! Priya, Rick and Sohla need to be back on video! Shame on CNE.Belo Horizonte, Brazil8/18/2020if you're going to feature priya's recipes please pay her and the rest of the POC who work hard to create content for you the same as your white creators.Anonymous8/18/2020This cooking technique worked perfectly even for rather large older okra pods. Delicious.AnonymousCamino. Ca8/17/2020Explore Bon AppétitIndianSouth AsianAsianOkraVegetableSerrano ChileChileSummerFallQuickEasySideNut-FreeVeganVegetarianGluten-FreeDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-17", "author": ["Condé Nast", "Priya Krishna"]}