{"id": "a767aadea1ca4861a986512c29869d2b", "url": "https://www.bonappetit.com/story/chocolate-pudding-pie", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "This Classic Chocolate Pudding Pie Doesn’t Need a Twist Thank You Very Much | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Classic Chocolate Pudding Pie Doesn’t Need a Twist Thank You Very MuchIt’s delicious. It’s epic. It makes all your nostalgic diner dreams come true. By Sasha LevineNovember 8, 2019FacebookTwitterEmailPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailWe love a twist at BA. It’s why we put miso in an otherwise traditional blueberry cake, tahini in a classic chocolate brownie, and cheddar Cheez-Its in a straight up apple crumb bar. That said, we won’t riff on every bit of nostalgia that pulls at our heartstrings. No? Don’t believe me? Have you seen Chris Morocco’s new recipe for a diner-style chocolate pudding pie?It’s epic. It’s delicious. And when you’ve got a crispy crust, a rich chocolate pudding, and an impressive mound of cocoa-dusted whipped cream, there’s not much else you need to fuss with. The kicker? For all its grandeur, it’s actually very possible to pull off, even for baking and dessert refuseniks like me. Here are a few things to know before you dive in.The DoughThe pie crust is inspired by a version from cult-favorite baker Stella Parks—it has a higher hydration dough (i.e. there’s more water), which makes it more forgiving to beginners like me, since the dough can tolerate some extra flour dusting when you’re rolling it out. The thing to know though is that more water = more gluten development, so crispy can turn to tough real fast if you’re not careful. Just make sure to be precise in how much liquid you’re actually distributing, and not to overwork the dough.And a note on that: You chill the dough in the pie dish, as opposed to forming it into a disc, chilling it for a while, letting it come to room temp, and then rolling it out to fit. This means you won’t have to wrestle the dough as much to get it into a thin layer, and hopefully, that means you won’t have to handle it too much to get comfortably in the dish. Pro tip: Make sure that the dough is in a relatively even disc shape (use your hands!) before pulling out the rolling pin. If it’s got any angles to start with, it will likely keep those when you roll, and you want as perfect a circle as you can get before moving it to the dish.Big Cream Energy\nPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe CrustYou’re blind baking this bad boy, and you need to take the time to get it right. We’re going for a deep chestnut brown here, and rushing through it is not an option. If it’s really taking a while (i.e. much longer than the 35 minutes denoted in the recipe) you can always move the dish to the lower third of the oven, which will put the crust bottom closer to the heat source. If you’re worried about the edges getting a little past golden brown, just carefully wrap any vulnerable spots with some foil.The PuddingThere’s a lot of whisking. You will get a work out. It will pay off in the form of silky smooth results. Failing to whisk means some spots will get heated and dry out, allowing a sludgy skin to form on all that hot, bubbling dairy—which is about as gross as it sounds.The Whipped CreamHow does it get so over-the-top high and stay that way? Gelatin. You need stabilization if you want to make this pie ahead of time, and this recipe will hold for three days easily in its perfectly assembled form. You can still make this sky-high whipped cream castle without the gelatin, but you’ve got a serving window of about 1-2 hours instead.Oh and one more thing: The whipped cream is super salty. This, Chris assures me, was a deliberate choice, albeit a controversial one. For one, no whipped cream should ever taste like bland milkiness. For two, salt accentuates the flavors happening elsewhere, which makes the whole thing work better together.Get the recipe:Chocolate Pudding PieA dazzling chocolate pudding pie cloaked in voluminous whipped cream.View RecipeExplore Bon AppétitPieDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-08", "author": ["Condé Nast", "Sasha Levine"]}