{"id": "a76b78dc23a658dd51004943f9093d55", "url": "https://www.bonappetit.com/story/i-never-thought-id-eat-a-frozen-dinner-until-i-tried-these", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "I Never Thought I'd Eat a Frozen Dinner Until I Tried These | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredI Never Thought I'd Eat a Frozen Dinner Until I Tried TheseDaily Harvest showed me that frozen food can actually be fresher, more flavorful, and better than what’s on a lot of grocery store shelves.By Amanda ShapiroMay 21, 2020FacebookTwitterEmailKale + Coriander FlatbreadFacebookTwitterEmailPicture me at 8 p.m., tired from a long day of work and sweaty from a workout, standing in front of my fridge, trying to decide what to cook. It’s a grim scene, and, unfortunately, I’ve been there a lot. What makes it even grimmer is when the fruits and vegetables staring back at me are on their deathbeds: lackluster greens, molding berries, and avocados so black that even guacamole couldn’t save them. And the only backups I can think of are greasy takeout or a slice of pizza from the shop next door, both bound to leave me with a salt hangover the next day.Kale + Coriander Flatbread\nThanks to Daily Harvest’s flatbreads, nights like these are rare now. I keep my freezer stocked with options so that I know I can always get my servings of vegetables in. Their flatbreads go from freezer-to-plate in minutes but hear me out: these aren’t your mom’s frozen meals. First of all, they’re completely plant-based and 95% organic. The all-veggie crusts on the flatbreads are made with cauliflower, broccoli, or sweet potato—and without any of the cornstarch, corn flour, xanthan gum or other processed ingredients that some gluten-free crusts use. They’re topped with delicious sauces like creamy cauliflower and tahini as well as more vegetables, and they’re all gluten and dairy free. I love the Kale + Coriander Flatbread, which has a sweet potato crust and a cilantro and parsnip-based green sauce and is topped with red cabbage (Vitamin K!), kale (fiber!), and hemp hearts (omega-3s!). Spicy, hearty, pizza-y, and happens to be great for me.Artichoke + Spinach Flatbread\nEating these flatbreads—along with Harvest Bowls like Spinach + Shiitake Grits and Sweet Potato + Wild Rice Hash—has made me think about frozen food in a new way. The produce in these dishes is actually fresher than what I can find in the grocery store’s produce aisles much of the time. Grocery supply chains harvest produce when it’s still green (before it reaches peak-nutrition) and it degrades in nutritional value over the weeks and months before it appears on the shelf. It also often requires chemicals and preservation methods to help keep it “fresh.” On the other hand, all the fruits and vegetables in Daily Harvest’s dishes are harvested at the perfect moment—when their nutritional (and flavor) potential is highest. Then the produce is frozen, on the farms, within 24 hours, which locks in these nutrients and flavor eliminates the need for preservatives. (No ultra-refined, hyper-processed, oversalted, and additive-laden products here). That means food that tastes incredibly fresh straight from the freezer to the pan to my mouth.Artichoke + Spinach Flatbread\nFreezing also helps reduce food waste, producing 47-percent less waste compared to non-frozen foods. That means, even if the grocery store is full of wilting kale, it won’t end up sitting in my fridge. And I’ll be supporting sustainability-minded farmers, and my tastebuds, instead. Get $25 off your first Daily Harvest Box with code HEALTHYISH.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Amanda Shapiro"]}