{"id": "a774d7364562c96cf3592c133ca9db48", "url": "https://www.bonappetit.com/story/these-white-beans-are-more-reliable-than-my-wifi", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "These White Beans With Broccoli Rabe and Lemon Are More Reliable Than My WiFi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese White Beans Are More Reliable Than My WiFiThe anchovy-garlic-lemon sauce has never let me down.By Alex BeggsNovember 1, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Mariana VelasquezFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I’m good at half-things. Like cleaning out the closet but not dealing with the piles. Or the Reading/Writing section of the SATs but not the Math. Or making a side dish but not the whole meal. So when my better half (haha, get it?) is making chicken thighs for dinner, or pork chops, or penne alla vodka, I’m in charge of the sides. And all that’s a convoluted way of saying that these white beans with lemon and broccoli rabe are that side.We’ve been really pushing the bean agenda at Bon Appétit lately and that’s for a reason, or three: cheap, healthy, delicious. In this recipe, we’re using two cans of cannellinis. Also called white kidney beans, they’re another list of three: creamy, buttery, possibly already in the back of your pantry. The other major players of this dish are broccoli rabe a.k.a. rapini (it's NOT broccoli, gah) and an entire thinly sliced lemon that caramelizes a little and counters the bitter broc.The minor, but not to be ignored, players are anchovies, garlic, red pepper flakes, and parmesan. Umami city. A little heat. And since those ingredients are typically already in my pasta-prolific pantry and fridge, all I need to pick up at the store to complete the recipe is the broccoli rabe. (Now picture me in line at the store with a basket full of things I definitely don’t need, plus broccoli rabe.)The cooking process comes down to three throwing-stuff-in steps: First, throw in and cook the lemon, anchovies, and garlic in oil, 5 minutes-ish. Second, throw in broccoli rabe and cook, 5 minutes-ish. Third, throw in beans and water to simmer, 5 minutes-ish.When it’s time to serve, hit it with cheese and red pepper flakes and fill half your plate. You did it! You’re halfway there.Get the recipe:White Beans with Broccoli Rabe and LemonIf you like bold, assertive flavors—like broccoli rabe and lemon—this rustic white bean side dish is the recipe for you. Try it with roast chicken or pork tenderloin.View RecipeExplore Bon AppétitNever FailSideSideRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-01", "author": ["Condé Nast", "Alex Beggs"]}