{"id": "a77b7be3768340a37852b8c4bceb3cf1", "url": "https://www.bonappetit.com/recipe/squash-and-caramelized-onion-tart", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Squash Tart Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSquash and Caramelized Onion TartBy Chris MoroccoNovember 14, 20184.6(114)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintWe aren’t going to try to stop you from serving tofu turkey if that is how you roll on Thanksgiving, but for a vegetarian main that can hold its own at the center of the table, this tart makes a very convincing argument.Ingredients6–8 servingsCrust1cup whole wheat flour1tsp. kosher salt1cup all-purpose flour, plus more for surface10Tbsp. chilled unsalted butter, cut into piecesFilling and Assembly4Tbsp. extra-virgin olive oil, divided4medium yellow onions, thinly slicedKosher salt3garlic cloves, thinly sliced2Tbsp. Dijon mustardPinch of cayenne pepper4oz. coarsely grated sharp cheddar or Gruyère½small butternut squash (a lengthwise half, about 1¼ lb.), seeds removed1delicata squash (about 1 lb.), halved lengthwise, seeds removed1small sweet potato1small red onion2sprigs thyme2Tbsp. unsalted butterFlaky sea saltSpecial EquipmentAn 11\"- or 12\"-diameter fluted tart pan with removable bottom or a 9\"-diameter springform panPreparationCrustStep 1Whisk whole wheat flour, salt, and 1 cup all-purpose flour in a large bowl to combine. Add butter and work into dry ingredients with your fingers, smashing between your palms to flatten, until largest pieces are the size of a nickel. Drizzle in 6 Tbsp. ice water and rake in with your fingers. Gently squeeze handfuls of mixture together until a shaggy dough forms. Turn out onto a work surface and knead until only a few dry spots remain. Pat into a disk and wrap in plastic. Chill until very firm, at least 2 hours or up to 3 days.Step 2Roll out dough on a lightly floured surface to about ⅛\" thick. Transfer to tart pan. Lift up edges and allow dough to slump down into pan. Gently press into corners and trim excess. (If using springform pan, trim dough to 1½\" up sides of pan). Freeze until firm, 15–20 minutes, or cover and chill up to 12 hours.Filling and AssemblyStep 3Place a rack in lower third of oven; preheat to 350°. Swirl 2 Tbsp. oil in a large skillet to coat bottom and add yellow onions; season with kosher salt. Set skillet over medium heat and cook onions, stirring occasionally and making sure to scrape bottom of pan, until very soft and deep golden brown, 15–20 minutes. Add garlic and cook, stirring occasionally, until onions are caramelized and deeply browned, 25–30 minutes (if any pieces get super dark and stick to the pan, a few drops of water should dislodge them). Let cool.Step 4Brush mustard over chilled dough, then sprinkle with cayenne. Stir cheese into caramelized onion mixture and spread across crust in an even layer.Step 5Using a mandoline or very sharp knife, thinly slice both squashes crosswise. Cut sweet potato and red onion in half lengthwise, then thinly slice crosswise with mandoline. Arrange vegetables in concentric circles, with rounded edges facing up, starting from the outside edge, leaning slices against the crust, and working your way inward. Drizzle remaining 2 Tbsp. oil over vegetables and season with kosher salt.Step 6Bake tart until edges of vegetables are browned (a few spots may even get deeply browned) and crust is golden brown, 75–90 minutes.Step 7Melt thyme and butter in a small saucepan and cook just until butter is bubbling. Brush over tart with a pastry brush and sprinkle with sea salt.How would you rate Squash and Caramelized Onion Tart?Leave a ReviewTell us what you thinkReviews (60)Back to TopTriangleSo this recipe has very good flavor .  However it should be called a Caramelized Onion tart with Squash.  It is onion forward with not enough squash to justify calling it a squash tart.  If your looking for a good onion tart this is great.  If your looking  for a good squash tart this is lacking.  I would make it again but use half the onions and double the squash and sweet potato.AnonymousWausau, WI12/25/2021I was totally seduced by the photo and made this for Thanksgiving in respect of a vegetarian guest.  Didn't bother making the crust from scratch, got Pillsbury's out of the store's refrig section. I put a lot more  caramelized onions in the base layer with an English cheddar shaved over it. Tasted  fine, lots of compliments on all counts. \n\nBut using a 9\" springform pan, I had a lot of squash and sweet potatoes left over, like all the reviewers above. I wrapped it all up and stuffed it in my refrigerator, and forgot about it till twelve (!) days later.  The sliced veg still had some taste and crunch, so what the heck. I got the rest of the fixings out and made another one, but this time all I had on hand was a brick of store brand \"extra sharp cheddar,\" so I laid in a lot more of it. And with no vegetarians in the house, I tucked folded slices of mesquite-smoked turkey from the deli counter into the array of squash slices. Result: still delicious, but  a little greasy (the added cheese), and  the turkey provided nothing  but some protein and  tryptophan. And everybody  needs  that.PauldadaRiverwest, Milwaukee WI12/9/2021I love this tart and so does everyone I have made it for. I don['t understand how folks think that this is not flavorful. I agree with more Dijon, I use 3Tbl. I believe the flavor is about super caramelizing the onions, and using a really flavorful Gruyere.  I used \"Emmi\" Cave aged Gruyere.  I am now going to only use HALF the amount of Squash and sweet potato.  I find myself making another tart today because there is enough veggies left over for another tart.   EnjoyBlytheOakland, CA11/26/2021Really, really Good.  Few changes to make it easier and heart friendly.   I used refrigerated pie crust to save time.  My iron cast skillet cooked pie crust evenly (did not have a spring pan).   I cut the salt and butter out.  Before cooking I sprayed the pie (tart) with organic olive oil and applied thyme.  So flavorful, no one missed the salt or butter.    AnonymousTampa, FL11/25/2021We have made this several times now, and it is always a showstopper.  Without fail.  Beware, it does take quite a bit of effort, but it has a huge payoff and it's always worth it.  JeffGrass Valley, CA11/23/2021I've now made this twice, and have some thoughts on the recipe. The first time I made it, the pie was \"okay\". Not great. I also had some modifications which were of mixed use. I use coconut oil in my crust instead of butter, and goat cheeses instead of cow (attempting less cow products but I still like cheese). \n1) You really need a mandolin slicer, and use the thinnest setting. First time was on 2nd thickness, and it didn't work as well. This is better when the squash are SUPER thin. The red onions won't hold together but kinda sprinkle them between the rest of the layers and it is fine. \n2) You need a deep upright springform pan. The first time in a regular pie pan didn't do well. \n3) WHY DOES THE RECIPE CALL FOR SO MUCH SQUASH?! You can easily use half that quantity. I have so much leftover thin sliced squash that I either need to make this again (lots of work) or just slap it all in a soup to blend together. \n4) You need good cheese and at least the 400g. My go with half goat cheddar and half standard soft goat cheese worked well. \n5) Brush the top with olive oil and thyme and salt and pepper liberally before putting it in the oven. \n6) Don't skimp on the cayenne or mustard. Slather the inner crust with mustard, then cayenne, then your caramellized onion/garlic/cheese mix, then some more cayenne. \n7) As you are putting the rose together, kinda grab a bit of the goop and push it to the outside to hold the squash in place, instead of just setting the squash in. It isn't perfect but it helps blend the flavors. \n8) Once you make your rose of squash, go back and stuff more pieces in where it looks less dense. \n9) If you use coconut oil in the crust like I do, don't try to chill the dough then roll it. Just mash the dough into the pan, then chill it overnight. \n\nThe concept for this tart is great, but the recipe lacks \"tricks\" to make it shine. Up the garlic, the applying of salt, pepper, garlic, thyme, mustard, and olive oil a lot. Squash is wonderful, as is cheese, but with the recipe it kinda just feels like a compilation of its parts - needs more TLC to be better than the sum of its parts. Make sure your slices are really thin. My 2nd one was delicious, when my 1st was only \"okay\". The result is DENSE, tasty, and ridiculously filling. CyrVancouver, BC11/22/2021Will try this recipe, but do you leave the skin on the butternut and delicata squashes?AnonymousSan Francisco, CA11/20/2021Why is it that when I try to print using your print icon, it prints 5 pages with tons of unnecessary spaces, a big picture of the dish, and an ad. Is there no way to get a concise print out with just the key information? David Lebowitz and other bloggers have figured this out. I don’t always want my laptop or iPad in the kitchen. (I’ve been a subscriber for many years and supporting your content, if that matters, .) Thanks.AnonymousPortland Oreagon11/5/2021Does this do well made a day ahead and reheated?DebNJ11/1/2021The tart is good. The question is - is it good enough to warrant the time it takes to make it. The presentation was professional and it looks stunning on a Fall table. The onions took quite a bit longer to actually caramelize , and Butternut alone would have tasted fine, but the different shapes of the 2 squashes added to the presentation. It was a little heavy on the fat. Instead of drizling 2 tbsp of oil over the tart before it's baked, then brushing with butter and thyme at the end, next time I will mix up the butter and thyme ( needs more)  and brush it over the tart  before it goes in the oven, and as it is baking. I am also going to try a different cheese. One reviewer recommended smoked gouda. The smokiness may add more depth. This tart is good but not amazing as it stands. Jury is out until I try it again with a few changes.MaryNew London, PA10/24/2021I have made this several times because I think it’s the perfect fall vegetarian main. I am pretty critical if a dish is lacking flavor but that is not my experience here. The caramelized onions, squash, and pastry work together beautifully— and it’s stunning to look at! I personally have a lot of fun arranging the ingredients in the tart.  I’m very grateful for a vegetarian dish that tastes and looks like a main event. Thank you!Audra BSeattle, WA10/23/2021 This is a great vegetarian dish. I don't make it with the pastry crust. That's too much work, and sometimes the dough can be under cooked/overcooked in certain spots. Instead I line a pie dish with parchment paper. Line bottom of dish with onion and cheese mixture and spread mustard on top. To help juliene the squash and potatoes I nuke the veggies for a couple minutes in the microwave to soften before slicing. The most time is spent slicing and layering all the veggies. This takes about 45 minutes. Put in the oven for ths same amount of time. Drizzle thyme butter on top and serve. The bottom layer of cheese is a little crunchy (delicious) and comes right out of the pan. Plus, leftovers taste just as good and a bit healthier without the crust.AnonymousDenver, CO2/27/2021Excellent, comforting, and delicious. I don't understand all the negative reviews... we've made this tart 3 times. We love it. You gotta really carmelize those onions and don't forget the salt. TiaChicago, IL2/4/2021Not worth the time or effort. I prefer Andy and Sohla's galettes, which are much more flavorful and take half the amount of time. 1/5 starsAnonymous1/9/2021I am not sure how people think this has no flavor. It is beautifully flavored. As a Thanksgiving or other special meal this is a five star. It is a little heavy on the fat side for everyday for me. The crust is a dream to work with. There are definitely a lot of veggies left over- my solution make two crusts- or saute everything and throw it on a pizza crust later with a spread of Dijon. Back to the tart-The Dijon stands out in the tart and I think those that found lack of flavor may have forgotten the mustard. Anyway, I followed the recipe and this was just fantastic. I did use salt when suggested.  When arranging, don't worry too much about the look, do keep it neat, but be sure to put the red onions in the design because those are so very yummy. I did use dried thyme because that is what I had, I just mixed it with the melted butter, which I used sparingly at 10 minutes prior to pulling out of oven. I cooked it the entire 90 minutes. For the cheese, I used a smoke Gouda and I did put about 1/4 tsp or less smoked paprika in that mixture, although I don't think I noticed so I will increase that next time. It is time consuming, but put some music on and chill.Christine WeissChagrin Falls, OH1/5/2021Explore Bon AppétitSavory Pie & TartButternut SquashSquashVegetableSweet PotatoPotatoOnionWhole Wheat FlourFlourFallMainVegetarianHealthyishBakingThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Chris Morocco"]}