{"id": "a7800a6ed60fc8ff87885899b02a8146", "url": "https://www.bonappetit.com/story/zoe-kanan-baker", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "The Baker Behind Some of the Best Carby, Buttery Goods in New York | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Baker Behind Some of the Best Carby, Buttery Goods in New YorkAfter working under the baking greats (Christina Tosi!), Zoe Kanan is making a name for herself with grain-packed chocolate chip cookies and stunning cakes.By Elyse InamineSeptember 24, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailZoe Kanan doesn’t look stressed out at all. It’s 7:13 a.m., and here’s what’s on the to-do list for the head baker at The Freehand hotel in New York City: train a new hire on how to make 15 or so doughs, from her years-in-the-making chocolate morning bun to the new flaky seaweed bread, for all-day cafe Studio, neighborhood-y restaurant Simon & The Whale, and sleek bar George Washington Bar. She’s wearing a tan apron, white clogs (with pink argyle socks), and a light blue bandana with the bow tied right above her forehead, the Christina Tosi way, a relic of her tenure at Milk Bar.At a small metal prep table downstairs in the commissary kitchen, she stretches out the balls of simit dough and dunks them in thinned-out grape molasses. Then she turns around and pokes the proofing croissant dough. “Give them another five minutes, so they’re not so jiggly,” she says to another baker. She takes a tray of flatbread dough blobs, flags me (yet another thing to keep her eye on this morning), and heads up the stairs to Simon & The Whale.The Freehand’s ground-floor restaurant is totally empty and silent this morning, except for one click as Kanan flicks a button that heats up the deep fryer. “This is my favorite part of the morning,” she says as she rips holes in the flatbread and drops them into the hot oil.The rhurbarb-y Persian love cake\nAlex LauThe Freehand wasn’t supposed to have a head baker. But last November, as restaurateur Gabe Stulman was opening three new concepts inside the hotel, he met Kanan at Christina Tosi’s urging and created the role just for her. A head baker isn’t flashy and show-stopping like a pastry chef, who leaves the final impression on the diner, or review-worthy like an executive chef, who attracts critics like magnets. Rather the role of the head baker is to be the ultimate collaborator, to make everyone else’s food shine. And Kanan does just that with black bread and pita for dips, laminated seaweed bread for sandwiches, and craveworthy cookies and cakes for filling a glass display. Kanan, 28, relishes in that duty and takes it seriously.But a funny thing happened. Those carby goods, which were intended as accompaniments, supporting actors, became the things people were talking about. She’s become the breakout star, despite not having more than a small prep table, no previous name recognition, and a quirky sensibility that leads her to put seaweed in bread dough.Kanan frying Moroccan doughnuts\nAlex LauAs a kid, Kanan imagined herself somewhere else, far from deep fryers and claustrophobic kitchens: on Olympic ice. Growing up in The Heights in Houston, Kanan woke up at 4 a.m. everyday to drive to Sugarland to skate for a few hours before going to school. (Tara Lipinski trained at her rink.) But when she broke her arm right before qualifying for senior competition (a.k.a. Olympic level), she felt a sense of relief. “I was looking for an out,” she says. Plus, she had other interests that she wanted to explore: film, music, and, of course, sweets.In the summer of 2009, she convinced her parents to let her go to pastry school at the French Culinary Institute in New York City. Before she even started her program, Kanan knew she wanted to work at Milk Bar, which she read everything she could on food sites like Eater and Grubstreet.Her resume is a who’s who of the best desserts in New York City: frosting wedding cakes under Tosi at Milk Bar, crimping pies at Four & Twenty Blackbirds, and honing in on laminated pastries at Vaucluse. Eventually she returned to the things her grandmother baked—babkas, honey cakes, and bagels—and perfected them alongside pastry chef Melissa Weller at Sadelle’s.The full spread at Studio\nAlex Lau“In the ten years of Milk Bar, we’ve had incredible talent come through, but there are few people that I’m like, ‘They’re going to do something.’” Christina Tosi tells me later on over the phone. “With Zoe, I definitely thought that. Everything she makes is warm, soulful, and clever. She respects tradition but looks for something new, something that hasn’t been discovered before.”It’s that drive and determination that led her to the Freehand, where she oversees a team of four. At Studio, the dreamy, lounge-y restaurant on the second floor of The Freehand, everything builds up to 8 a.m. That’s when Kanan sets up a small glass box on the bar top and carefully fills it with everything from downstairs. Airy sourdough croissants, so impressive that they apparently upset her French customers. (They’re that perfect.) Chocolate morning buns, a “brownie meets a croissant,” per an enthusiastic server. Cakey chocolate babkas for all the purists out there who turn their noses at the proliferation of croissant-like babkas. Beautiful cakes, like a rose-scented Persian love cake. Chocolate chip cookies, packed with whole-wheat flour, oats, millet, polenta, and sunflower seeds. “Like a healthy version of the Compost Cookie,” Kanan says. (You’ll know what she means once you bite into them—get the recipe here.)Kanan’s grain-packed cookie, an unintentional ode to Tosi’s Compost Cookie\nAlex LauA customer walks up to hand Kanan an empty espresso cup, which she plops into a bin full of dirty plates with a smile. She pushes the empty baked goods cart towards the service elevator that will take her back to the production kitchen. As she waits, she checks her phone. Her bakers text madly with updates on proofing dough and the 300 pitas that need her prompt attention. Her day is only beginning.Get that cookie recipe:Multigrain Chocolate Chip CookiesYes, there are multi ingredients in these multigrain cookies, but that’s what makes them so over the top.View RecipeUpgrade your bread game:Explore Bon AppétitBreadRestaurants + TravelRead MorerestaurantsThe Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office LobbyBy Elyse InaminecookingThe 10 Baking Questions People Ask Me Literally All the Time, AnsweredBy Claire SaffitzcultureInside the National Pie Championships: Keep Calm and Carry Cool WhipBy Claire McNeillRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-24", "author": ["Condé Nast", "Elyse Inamine"]}