{"id": "a78a068dcc3b463db7a5496934b93604", "url": "https://www.bonappetit.com/story/level-up-your-cocktail-game-this-summer-with-spindrift", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Level-Up Your Cocktail Game This Summer with Spindrift® | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredLevel-Up Your Cocktail Game this Summer with Spindrift®By Spindrift®July 11, 2018FacebookTwitterEmailFacebookTwitterEmailIt’s finally summer. A fine time to slow down, kick back, and have some good ole fun. The warmer months are also a time when we crave fresh, clean flavors with a dose of real fruit pulp that gives as much back to our health as to our picky taste buds. Which is why the sparkling, refreshing goodness of Spindrift® is the perfect mixer on a hot summer day when selfies by the pool are a rite of passage. Whether it’s a berrylicious mojito, a tart creamsicle, or a bright citrus punch you favor—a Spindrift® cocktail shall be your summer lifesaver. See our seasonal cocktail recipes featuring the light and airy Spindrift® Sparkling Water with a healthyish dose of real fruit—never the fake stuff—and settle in for one heck of a delicious summer.Summer JamBlackberries pack a powerful punch of antioxidants and bright, ripe sweetness. Muddle fresh berries and mint, add rum, pour over crushed ice, top it off with Spindrift® Blackberry, and reap all of the sparkling benefits.Dream of LemonsLike the greatest-ever summer in a glass: Strawberry ice cream acts as a decadent “float”, topped with Campari, and dazzling Spindrift® Lemon. Why yes, we will have another!Strawberry Sunset PunchThis summery take on a classic punch involves sliced berries, loads of citrus, rum, and Spindrift® Strawberry. Serve in a classic punch bowl with ladle, and dish out single servings over ice. Guaranteed to be the star of a ripe party.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-11", "author": ["Condé Nast", "Spindrift"]}