{"id": "a78cbfff860192c317f3ece1bf83c384", "url": "https://www.bonappetit.com/recipe/cauliflower-rice", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Cauliflower Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueCauliflower RiceBy Claire SaffitzMarch 20, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintDon’t overcrowd the food processor with florets or you might end up with cauliflower “rice” that’s a mix of too-big pieces and mush. For this recipe, work in batches and keep the pulses short.Ingredients4 servings 1small or ½ large head of cauliflower, coarsely chopped (about 7 cups)4Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepperCoconut-Turmeric Relish (for serving; optional)PreparationStep 1Working in 2 batches, pulse cauliflower in a food processor until pieces are about the size of a grain of rice (some smaller and some larger is fine).Step 2Heat 2 Tbsp. oil in a large skillet over medium-high. As soon as oil is shimmering, add half of cauliflower and cook, tossing often, until golden in spots and tender but not mushy, about 3 minutes. Season with salt and pepper and transfer to another medium bowl. Wipe out skillet and repeat with remaining oil and cauliflower. Let cool slightly before serving.Step 3If using relish, add to cauliflower and toss to coat. Season with more salt and pepper.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Cauliflower Rice?Leave a ReviewTell us what you thinkExplore Bon AppétitCauliflowerVegetableQuickEasySideDairy-FreeGluten-FreeVeganVegetarianNut-FreeKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}