{"id": "a7ab8264c618143dde49f716802ca81e", "url": "https://www.bonappetit.com/story/virginia-willis-secrets-of-the-southern-table", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Virginia Willis: ‘Southern Food Is a Living, Breathing, Changing Thing‘ | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureVirginia Willis: ‘Southern Food Is a Living, Breathing, Changing Thing‘Her new cookbook “is about going deeper, about including the Vietnamese shrimpers, the Hispanic communities in Kentucky, the Hmong in North Carolina.”By Hilary CadiganAugust 1, 2018FacebookTwitterEmailPhoto by Angie MosierFacebookTwitterEmailVirginia Willis knows the south. The Georgia-born chef and author has written half a dozen cookbooks on her ancestral cuisine and cooked for southerners as notable as Aretha Franklin and Bill Clinton. But what she learned during the research and writing of her newest book, Secrets of the Southern Table, was that even she had a few things left to learn.Unlike her previous cookbooks, which focus primarily on the food Willis and her family grew up cooking, Secrets looks outward. Willis spent nearly a year traveling through 11 states, seeking out the stories and the dishes that so often get buried under stereotypical impressions of the region—the Latinx communities of Appalachia, the black-owned urban farms of Southwest Atlanta, the women-owned heirloom cideries of the Blue Ridge Mountains. “I wanted to share the fullness and the richness of what I think southern food and cooking is,” she says. We caught up with Willis to learn more about the south’s secrets.Why was it so important to you to show that southern cuisine is more than fried chicken and biscuits and pimento cheese?I travel a lot, and it became apparent to me that a lot of people outside of the south don’t seem to understand it. Some of those traditional recipes are truth, but they’re not the only truth. The south is a modern place with a complicated history. There’s a tremendous African influence on southern food and cooking because of slavery, and there are many other immigrant populations, both new and old, that people aren’t so aware of.Willis drew inspiration from Charlie, Nan and Dee Dee Niyomkul, the family behind several Thai restaurants in Atlanta, to create this Chicken Larb with Georgia Peanuts recipe.\nPhoto by Angie MosierIn my last book, Lighten Up Y’all [which won a James Beard Award in 2016], I was trying to explain that all southern food wasn’t unhealthy. This book is about going deeper, about including the Vietnamese shrimpers, the Hispanic communities in Kentucky, the Hmong in North Carolina.Southern food has been having a moment for the past ten years, but right now, we are looking beyond the surface. We’re understanding that the south is not simply this homogenized society that hasn’t evolved. Southern food is a living, breathing, changing thing.And this is all happening against a very fraught political landscape. Did politics come into play during your ideation and writing process?They’ve come into play tremendously. I mean, this book was written over the past year. I don’t want people to look at the news and see those angry faces and Dixie flags in Charlottesville, Virginia and think everyone in the south is like that. I know this is a cookbook, but this cookbook is the way I can express that. As I’ve said for many years, the south does not have a monopoly on rednecks. Yet when people hear a certain accent, they make presumptions.Was there a fine line you were trying to walk, to make the book palatable to a wide audience but still get your points across?Really, my goal was just to share these stories. Because if you read someone else’s story, or think about someone else’s food, they become more human. All the stories are very specific because I wanted to present the unexpected. For example, the average farmer in Georgia is a 57-year-old white male. Instead I wanted to present this young couple in Atlanta with a farm 30 minutes from the world’s busiest airport. These stories were my way of getting people to know other people.Willis with Bobby Wilson, CEO of the Metro Atlanta Urban Farm, which provides fresh produce and opportunities for self-sufficiency to people living in the area’s many food deserts.\nPhoto by Angie MosierThe juxtaposition of some of these stories says a lot too. Like the two different farmers at the beginning, one a white descendent of Confederate soldiers and one a black descendent of people who were enslaved.That one was very specific. The whole point of moving past racism and understanding difference is that we have to talk about it. So it was very intentional that I started with Will Harris, whose family farm was founded when his ancestors came home from fighting for the Confederacy, and then Matthew Raiford, whose family farm was founded when his ancestors were emancipated from slavery. That was probably the most intentional thing in the whole book, because I just felt like we needed to start right there.Matthew [who attended the Culinary Institute of America in New York and UC Santa Cruz in California before moving back to family land in Brunswick, Georgia] was so interesting because his cafe, The Farmer & The Larder, is incredibly diverse, and yet when we were walking in the woods he was telling me about how he learned to walk there because this white guy used to charge a tax for black people to walk on the road. I remember tearing up and being like, oh my god, why did you move back here?Okra came to the south with the transatlantic slave trade, but today India is the world’s largest producer. Willis’s Smashed Fried Okra with Spicy Yogurt Dipping Sauce recipe drew inspiration from chef Vishwesh Bhatt of Snackbar in Oxford, Mississippi.\nPhoto by Angie MosierWhy did he?I think he just really wanted to return home. That farm has been in Matthew’s family since the Civil War, and the fact that they have maintained and been able to keep that land since 1864 is, in my opinion, nothing short of a miracle. He showed me all of these growing and planting and harvesting records for generations, and my feeling was that he wanted to go home, and to make a difference there. And that’s what’s so wonderful: He is.What did you most hope readers would take away from stories like these?I want readers to understand that the south is not this little whitewashed, homogenized society. I want people to understand that—like Sean Brock wrote in the foreword—the south is one million square miles. So when you say southern food, what do you mean? Do you mean Texas, do you mean Tennessee? Do you mean Florida seafood or low country seafood? I want people to understand the rich diversity of the south: the culture and people and food and history.Alberto Ramirez makes fresh tortillas at his restaurant Tortillería y Taquería Ramírez in Lexington, Kentucky, where thousands of Mexican immigrants have settled.\nPhoto by Angie MosierI mean, I even learned things over the process of writing. I thought that Appalachia, for example, was almost solely Scotch-Irish. But there have been different pockets of immigration throughout the south since the beginning. Like the Hispanic populations that moved to Lexington, Kentucky to work in the horse industry. You can find some really delicious, super authentic Oaxacan and Mexican food in the middle of Appalachia.There were a lot of moments like that. Like, I knew there were a ton of Greeks in Birmingham, Alabama but I didn’t know why. But just barely scratch the surface, and there’s the answer: They came to Birmingham to work in the steel industry in the 1800s. Also back then there was a direct trade route from Palermo, Sicily to New Orleans, so at one point in the 1800s there were more Italians in New Orleans than any other part of the country, including Manhattan.If you think about it, it makes sense. New Orleans barbecue shrimp is essentially butter-poached shrimp, which is Italian. The circles of influence in terms of foodways still exist.Willis’s Shredded Beef Arepa recipe comes from Lis Hernandez, a first-generation American from Venezuela and chef-owner of Arepa Mia, which has two locations in the Atlanta area.\nPhoto by Angie MosierWhat was the best part of writing this book?Southern hospitality is real. Everyone was kind and generous and opened their homes to me and my photographer, Angie Mosier. I am a gay woman, and that isn’t always going to be comfortable for people. I’m not like, “Hi, I’m Virginia. I’m a lesbian.” But what I’m saying is that people were open and welcoming and kind, and shared their table with us, and shared their meals with us.One of the really cool stories I write about in the book was from Christian Richard, a commodity rice farmer in Louisiana—super conservative, deep south, commodity rice farmer. So I was kind of tiptoeing; I didn’t want to offend him. He started talking about the EPA and regulations, and most of the time farmers are against regulation, that’s just how it works. They don’t want anyone telling them what to do with their land or their boat. But I wanted to learn about how he grew rice. So I said, well, what about erosion? And he starts telling me about how the Gulf is eating the state of Louisiana, and how the water is rising, and essentially how climate change is real. It was not what I was expecting. It kindly and gently pointed out my own prejudice. That was a very good lesson learned on my part.Buy it: Virginia Willis' new cookbook, Secrets of the Southern Table, is $19 on Amazon.Photos excerpted from SECRETS OF THE SOUTHERN TABLE © 2018 by Virginia Willis. Photography © 2018 by Angie Mosier. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Explore Bon AppétitCookbooksSouthernRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast", "Hilary Cadigan"]}