{"id": "a7ac3f519affd70abed94092cf3731a1", "url": "https://www.bonappetit.com/recipe/kisir-spicy-bulgur-salad", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Kisir (Spicy Bulgur Salad) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueKisir (Spicy Bulgur Salad in Lettuce Cups)By Yasmin KhanApril 20, 20215.0(14)Read ReviewsTriangleEmailPinterestPrintPhotograph by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis dish is Yasmin Khan’s version of kisir, a Turkish bulgur salad that traditionally uses a hot pepper paste known as biber salçasi to add heat. In this recipe from Khan’s cookbook Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus, she recommends substituting a little extra Aleppo-style pepper if you can’t find it. Pomegranate molasses adds enough sour-sweet flavor to round out the dish. Serve it in a large salad bowl, or nestle scoops of it in lettuce leaves.Ingredients4 - 6 ServingsDressing5Tbsp. extra-virgin olive oil3Tbsp. fresh lemon juice3Tbsp. pomegranate molasses1Tbsp. plus 1½ tsp. double-concentrated tomato paste1tsp. Aleppo-style pepper1tsp. biber salçasi (Turkish hot pepper paste) or more Aleppo-style pepper to tasteKosher salt, freshly ground pepperSalad and assembly1cup bulgur½cup raw walnuts3small ripe tomatoes, cored, finely chopped1Persian cucumber, finely chopped3scallions, finely chopped1cup parsley leaves, finely chopped1cup mint leaves, finely chopped¼cup pomegranate seedsKosher salt, freshly ground pepper2heads Little Gem lettuce or romaine hearts, leaves separatedPreparationDressingStep 1Whisk oil, lemon juice, pomegranate molasses, tomato paste, Aleppo-style pepper, and biber salçasi in a small bowl to combine; season dressing with salt and black pepper.Salad and assemblyStep 2Cook bulgur according to package directions. Let cool until just warm. Transfer to a medium bowl and mix in dressing.Step 3Meanwhile, toast walnuts in a dry small skillet over medium heat, tossing often, until golden brown, about 4 minutes. Transfer to a cutting board. Let cool slightly, then finely chop.Step 4Add walnuts, tomatoes, cucumber, scallions, parsley, mint, and pomegranate seeds to bulgur and toss well; season with salt and pepper.Step 5Arrange lettuce leaves in a single layer on a platter and spoon some salad into each leaf.Adapted from \"Ripe Figs: Recipes and Stories from Turkey, Greece, and Cyprus.\" Copyright © 2021 by Yasmin Khan. With permission of the publisher, W. W. Norton & Company, Inc. All rights reserved.\n\nBuy it from Amazon or BookshopHow would you rate Kisir (Spicy Bulgur Salad in Lettuce Cups)?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleIt's a keeper!  I've shared this with others and everyone loved it.  It was fun shopping for the ingredients and the recipe was easy to make.  I couldn't find the little gem lettuce and should have bought iceberg.  The green leafy didn't support the weight, but people enjoyed eating the bulgar salad like a side.  I'm thinking about making it again and might add more pepper since it wasn't super spicy, although the flavor combination was great.AnonymousCols, OH6/25/2021Delicious and simple to prepare. Like others, I had many of the ingredients on hand. I used extra Aleppo pepper and added some diced peppadew peppers. I ate it with a spoon, rather than lettuce cups because I was making it just for myself. However, I'd love to make it again for a party and serve it in lettuce cups.Natalie MatzOmaha, Ne6/7/2021Required some extra prep on my part for pomengranate molasses.  Substituted a harissa chile paste for turkish.  The dressing was delicious  - sadly it is not pomengranate season so I used a meager and non-ripe fruit I found.  Great vegetarian small bite.  EVERYONE loved these.  So pretty. Cynthia NY, NY5/26/2021Saw the recipe this morning and realizing I had all ingredients except the pomegranate seeds, including already cooked bulgur, mixed it up for lunch - delicious and will keep in the rotation for salads.JoeRockville, MD5/20/2021This was delicious! Had fun visiting a Turkish grocer that was right in my neighborhood (love u Chicago) and was able to find biber salcasi, pom molasses and a whole bunch of different kinds of bulgur- this came together so well! The salad really pops with flavor- spice, sweet, salty, nutty, crisp - delicious! We served it like the picture with little gem leaves but you could totally eat as is or mix with some other veg, probably pop some in a pita or something for leftovers - really delicious. Made as-is, after tasting it we wanted a bit more spice so we added some extra Aleppo - we also really loved the nutty walnuts in there so toasted up a few more to toss in with leftovers. My package of bulgur had a step to toast the grains for a few minutes in 1 tbs oil and1 tbs butter before adding water and I think that step really added a nice layer of toastiness too - try it out if your package doesn't call for that. Delicious and a fun way to taste a few ingredients new to me. kmarxmarxchicago, il5/11/2021I love bulgur so I thought I would make this recipe.   It turns out I didn't have any in the pantry so I made it with some left over brown rice and some quinoa instead.  It turned out fabulous.  The mixture of sweet and spicy is spot on.  The sweet could also be because I had to substitute the pomegranate with dried cranberries.   The dressing along with the mix of toasted walnuts, mint, parsley and tomato make this  a dish I will be putting in my usual rounds.   I can't wait to try it with bulgur next time.  MicheleSan Luis Obispo5/6/2021Explore Bon AppétitSaladTurkishMiddle EasternLettuceLeafy GreensVegetableBulgurRice & GrainsPomegranateFruitQuickEasyMainStarterDairy-FreeVeganVegetarianRosh HashanahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Yasmin Khan"]}