{"id": "a7ae951afabffc3f716d84baad53f9b8", "url": "https://www.bonappetit.com/story/kiernan-shipka", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Kiernan Shipka Cooks Cacio e Pepe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe Cooked Cacio e Pepe With Kiernan Shipka and Had a Very Fun TimeAn afternoon in the kitchen with The Chilling Adventures of Sabrina star and chef Flynn McGarryBy Ali FrancisApril 5, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmail“I feel like bringing a packed lunch to set gives me a lot of peace,” Kiernan Shipka tells me from the open kitchen at Gem, a Lower East Side restaurant run by her friend Flynn McGarry. “When you eat something homemade, preferably with ferments and a tahini drizzle, for a second you just feel like you have your entire life together.”For nearly nine years, Shipka grew up playing Sally Draper, the beloved scene-stealer in Mad Men. She shared screen time with Susan Sarandon in Feud. And now she’s number one on the call sheet for Netflix’s The Chilling Adventures of Sabrina. (Think: ’90s series Sabrina the Teenage Witch, but with the same glam-noir filter as fellow Archie Comics phenomenon Riverdale.)If you follow Shipka on social media, chances are you already know she loves food. A lot. “Jonathan Gold was such an influential person in my life,” she says. “I really found my love of food through his lists.” But when Shipka’s not eating at L.A.’s Petit Trois, Bavel, or Sqirl, you’ll find her seasoning the cast iron in her kitchen. “I know what I’m doing a little bit,” she says, laughing. “I love roasting broccoli or making a nice piece of salmon; meat and vegetables are my things.”McGarry—who’s been darting back and forth between his cooks, peering into pans and adjusting knobs—joins us in his kitchen. He first arrived in New York from California a few years ago to run his pop-up eatery, Eureka, but started charging money to serve food out of his mother’s San Fernando Valley house when he was 13. The pair met in L.A. through a mutual friend (and some “aggressive Instagram stalking” on Shipka’s part), and have been close ever since.(And maybe now is the time to mention that uber-successful Shipka and McGarry are 19 and 20 respectively.)Shipka and McGarry begin cooking cacio e pepe, a favorite dish from their trip to Italy a few years ago. “We’re literally just going to watch water boil for a while,” McGarry says, filling a huge saucepan with water.McGarry peers into the bubbling pot, now filled with spaghetti. “Can you taste it please?” he asks Shipka. “I have weird pasta anxiety and I’m terrified of overcooking it.” She forks out a strand and starts chewing before pronouncing it “still a little crunchy.”While I grew up with Melissa Joan Hart, Shipka plays the streaming generation’s Sabrina—a sixteen year old mortal witch, forced to decide between the real world and the magical. “I tried to tap into that duality, sort of like being pulled in two directions,” Shipka explains, stirring the pot. “I feel like everyone can relate to that in some aspect of their lives.”Clearly, Kiernan Shipka  is an expert pasta twirler.\nPhoto by Laura MurrayMeanwhile, McGarry’s anxiety reaches breaking point. “We just have to strain this right now,” he says, laughing. Shipka reserves some water, McGarry strains the pasta, and they have it all back in a buttery saucepan before anyone knows what’s happened. Clearly they’ve done this before.Maybe it’s all the steam, but Shipka seems to me like a stick of Glossier Haloscope in human form. (She grew up in California, after all.) But she assures me it’s a different story after an intense 14-hour day on set. “I was so stressed out last season that I was getting really random hives,” she says, throwing handfuls of Grana Padano into the saucepan that McGarry’s conscientiously stirring. “And other times I’d just cry for no reason because I was so sleep-deprived.”Since then, Shipka’s turned herself into some kind of elite power-napper. Her ability to sleep anywhere—sans lavender oil, CBD, or eye masks—is enviable, and it’s how she gets through the killer days. Apart from some good shut-eye, she stress-busts with adaptogens, massages, and a quick jump on her rebounder (a kind of compact trampoline marketed to adults). “It shakes the whole trailer and everyone freaks out,” she says. “Meanwhile I’m just in there having a very fun time.”“Okay, twirl the spaghetti around the tongs,” McGarry interrupts. “And then right when you think it's twirled enough, grab it really quickly and drop it in the bowl.” A mess of creamy spaghetti slops all over the bench. “Is this...rustic?” Shipka asks. She grabs a pepper mill so large it makes her look like a stand-up paddle boarder and dusts the entire bowl.McGarry and Shipka sharing a bite.\nPhoto by Laura Murray“I think cooking and acting are kind of analogous,” Shipka says amid bites of cheesy pasta. (McGarry’s back in the kitchen briefing his cooks for a full day of prep before they open for dinner at 6 p.m.) “In a lot of ways it's a different art form, but Flynn and I definitely share that same sort of commitment and perfectionism.”Season two of The Chilling Adventures of Sabrina is set to air on April 5th, but Shipka’s already focused on filming Season 3. She says she’s proud to be in a role that she believes can be meaningful for young girls everywhere. “The show is filmed during such an influential time in Sabrina’s life,” Shipka says. “She’s so strong-willed and kind, and I think that’s really important for girls to see.”We wrap the interview in a hurry—Shipka and her mom are off to have their auras read in Chinatown. But hopefully after that comes an ashwagandha latte and good, long nap.Explore Bon AppétitHealthyishCelebritiesInterviewsRead MoreLifestyleHow PEN15’s Anna Konkle Went from Waiting Tables at Prune to Wearing Fake Leg HairBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Ali Francis"]}