{"id": "a7c421e94fc859afcc6654c845b42714", "url": "https://www.bonappetit.com/recipe/brussels-sprouts-nasi-goreng", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Brussels Sprouts Nasi Goreng Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBrussels Sprouts Nasi GorengMeera Sodha’s take on the beloved Indonesian dish nasi goreng uses shredded brussels sprouts two ways: Some are sautéed and incorporated into the rice mixture, while others are marinated and added on top for crunch and zing. Don’t skip the kecap manis—the syrupy Indonesian soy sauce is what gives nasi goreng its caramelization and depth.By Meera SodhaNovember 15, 20203.9(35)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThis take on the beloved Indonesian fried rice dish nasi goreng is from Meera Sodha’s cookbook East: 120 Easy and Delicious Asian-Inspired Vegetarian and Vegan Recipes. Kecap manis, a syrupy Indonesian soy sauce that’s sweetened with palm sugar and often infused with spices like star anise and black pepper, gives nasi goreng its characteristic caramelization and depth. Meera starts with a classic approach, smothering cooked long-grain rice in “umami-ific sauces,” and then riffs, topping her version “with shredded, marinated brussels sprouts for crunch and zing.” Kecap manis is available at large supermarkets, online, and in Southeast Asian stores—if you can’t find it, though, you can follow Meera’s approximation below. For a more traditional nasi goreng, served with a fried egg and sambal matah, check out Lara Lee’s recipe.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronChef's Knife$34.53 At AmazonTea Kettle$34 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonMesh Sieve$13 At AmazonMedium Saucepan$39 At AmazonFood Processor$49 At AmazonLarge Skillet$84 At AmazonMedium Bowl$17 At AmazonPlatter$29 At AmazonWooden Spoon$6 At AmazonIngredients4 main course servings2Tbsp. kecap manis or 3 Tbsp. agave nectar plus 1 Tbsp. dark soy sauce1¾cups white jasmine rice1¾lb. brussels sprouts1medium red onion4garlic cloves3red or green Thai chiles3Tbsp. vegetable oil2Tbsp. tomato paste1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, plus more2Tbsp. soy sauce, divided2Tbsp. (or more) white wine vinegar or apple cider vinegar, divided2Tbsp. toasted sesame oil1tsp. sugarPreparationStep 1 If you don’t have kecap manis, approximate it by stirring together  3 Tbsp. agave nectar     and  1 Tbsp. dark soy sauce   (dark soy has a much deeper molasses flavor than normal soy) in a small bowl. Set agave mixture aside.  Step 2Bring 2½ cups water to a boil in an electric kettle, teapot, or saucepan. Place 1¾ cups jasmine rice in a fine-mesh sieve and rinse under cold running water until water runs clear. Transfer rice to a medium saucepan, then pour in boiling water and return to a boil. Cover pan and reduce heat to as low as possible; cook 15 minutes. Remove from heat and let steam while you prepare the brussels sprouts.Step 3Trim bottoms and remove any tough or wilty outer leaves from 1¾ lb. brussels sprouts. Using a chef’s knife, slice sprouts as thinly as possible. (Alternatively, you can use a food processor fitted with shredding disk.) Chop 1 medium red onion, crush 4 garlic cloves under the flat side of your knife, and finely chop 3 red or green Thai chiles (remove ribs and seeds first if you prefer less heat).Step 4Heat 3 Tbsp. vegetable oil in a large skillet over medium heat. Cook onion, stirring, until starting to soften, about 5 minutes. Add garlic and two thirds of chopped chiles and cook, stirring often, until very fragrant, about 2 minutes.Step 5Set 2 large handfuls of brussels sprouts aside in a medium bowl. Add remaining brussels sprouts to skillet and cook, stirring every 2 minutes or so, until beginning to brown, about 8 minutes. Stir in 2 Tbsp. tomato paste, 2 Tbsp. kecap manis or reserved agave mixture, 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, 1 Tbsp. soy sauce, and 1 Tbsp. white wine vinegar or apple cider vinegar and cook, stirring often, 5 minutes; remove from heat.Step 6Add 2 Tbsp. toasted sesame oil, 1 tsp. sugar, remaining chopped chiles, and remaining 1 Tbsp. soy sauce, and remaining 1 Tbsp. white wine vinegar or apple cider vinegar to reserved raw brussels sprouts and toss well to coat. Taste and add more vinegar if you want more zing.Step 7To finish nasi goreng, return skillet to medium heat and add steamed rice. Cook, stirring gently, until heated through and rice is incorporated, about 5 minutes. Taste and season with more salt if needed. Transfer to a platter and scatter raw brussels sprouts over. Adapted from EAST by Meera Sodha. Copyright © 2020 by Meera Sodha. Reprinted with permission from Flatiron Books. All rights reserved.How would you rate Brussels Sprouts Nasi Goreng?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis dish is so filling without leaving you feeling gross. Fantastic flavor and texture.\nToadNorth Carolina11/7/2021I enjoyed this! Good weeknight dinner option - love the novel use for Brussels sprouts! Will be making again AnonymousToronto, Canada 2/8/2021Explore Bon AppétitIndonesianSoutheast AsianAsianBrussels SproutVegetableRiceRice & GrainsFallQuickSideDairy-FreeVegetarianVeganDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-15", "author": ["Condé Nast", "Meera Sodha"]}