{"id": "a80626a48c04414d332f1c54deda65e3", "url": "https://www.bonappetit.com/recipe/basically-black-bean-soup", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Basically Black Bean Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Black Bean SoupBy Lauren SchaeferOctober 14, 20184.3(64)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintReal talk: You don't have to soak your dried beans overnight. They'll cook faster if you do, sure, and will be less likely to break apart when they cook, but as long as you have a couple of hours to work with, you're golden. Few ingredients have such a stellar deliciousness-to-affordability ratio, and the best part about starting a soup with dried beans is that they create their own incredibly savory broth as they cook—no need to add weird, shelf-stable boxed stock to the mix. The most important thing to remember about cooking beans from scratch is that they can handle a LOT of seasoning, so don't hold back; nobody likes under-seasoned beans. And as with any simple soup, the magic is all in the garnishes. Whether you're meal prepping for the week or having people over for a casual dinner hang, a bunch of toppings—something crunchy, something creamy, something fresh and herby—makes a humble bowl of beans feel like a party.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketVegetable Peeler$10 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Pot$55 At AmazonWooden Spoon$6 At AmazonGlass Measuring Cup$19.99 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonLadle$8 At AmazonIngredients8–10 servings1medium onion1medium carrot3garlic cloves¼cup extra-virgin olive oil¼cup red wine vinegar17-oz. tin chipotle chiles in adobo, or 2 Tbsp. hot sauce1lb. dried black beans (not soaked)1½tsp. dried oregano1Tbsp. kosher salt, plus more3limes1cup whole-milk Greek yogurtCilantro, sliced avocado, crushed Fritos, finely chopped onion, lime wedges, and/or hot sauce (for serving; optional)PreparationStep 1Start by doing a little prep work. Peel and chop 1 onion and 1 carrot.Step 2Peel 3 garlic cloves by smashing each firmly with the flat side of a knife to break into smaller pieces. Discard skins. The cool thing about prepping garlic for any kind of long-cooking preparation like this is that it will have plenty of time to break down and infuse the whole soup with garlicky goodness, which means there's no need to go through the tedious process of mincing the cloves finely.Step 3Heat ¼ cup oil in a large stock pot or Dutch oven over medium. Add onion, carrot, and garlic. Cook, stirring occasionally, until onion is golden, 5–7 minutes. Don't worry if the veggies start sticking to the bottom of the pan a little bit—that's a good thing! Those little browned bits have a ton of flavor, and we'll be adding some liquid in the next step to get them up, a process that's also called \"deglazing.\" Cool, huh?Step 4Add ¼ cup red wine vinegar and cook, scraping up any brown bits from the bottom of the pot, until vinegar is reduced by about half.Step 5Add 2 Tbsp. adobo sauce from can of chiles and stir to coat. (Feel free to add more adobo sauce if you're craving more heat and smokiness; just remember: You can always add more later, but you can't take any away.)Step 6Add 1 lb. dried black beans, 1½ tsp. oregano, 1 Tbsp. salt, and 8 cups water. That's right: no boxed stock! The beans are going to create their own delicious broth as they simmer away. Bring up to a boil over high heat, then drop the heat down low so that the beans are just simmering. Cover pot with a lid.Step 7Simmer, stirring every 30 minutes to prevent sticking, until beans are tender and creamy, 1½–2 hours. How long it takes will depend entirely on how fresh your beans are—the longer they've been sitting on the shelf, the longer they're going to take to cook. That's why we try to buy dried beans from stores where we know their inventory moves. (You can't always tell, but dust on the bag is never a good sign.) As the beans cook, you may need to top off with a bit more hot water if too much of it cooks off; you want to make sure the beans are submerged.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Meanwhile, assemble your garnishes. They're going to be the difference between an extremely simple—and delicious!—pot of black bean soup and something that feels fun and kind of fancy. The first thing we're going to make is a kind of creamy lime-yogurt to dollop on top. First, place 1 cup yogurt in a small bowl. Finely grate zest from 1 lime into bowl. Cut the lime in half and squeeze in juice.Step 9Season yogurt mixture with salt. Give it a taste and add another pinch of salt if it doesn't pop. Easy, and kind of fancy, non? Cut remaining 2 limes into wedges for squeezing over the soup.Step 10Prepare any other (optional) garnishes you may like. Slice some ripe avocado. Put some Fritos or tortilla chips or corn nuts in a bowl. Pick some cilantro leaves. Chop some onion, or thinly slice some scallions. Shred some cabbage. If you ask us, the more garnishes, the better!Step 11Taste and season soup with salt, if needed. Remember: Beans can handle quite a bit of salt, so don't be afraid to add more if it tastes kind of \"meh.\" You can serve right away, but we usually like to let a bean soup like this hang out for at least a half hour after we've finished seasoning it so that the salt in the cooking liquid can work its way into the beans themselves. Ladle the soup into bowls, top with yogurt mixture, and serve with lime wedges and any other garnishes your heart desires.Step 12Do Ahead: Soup, without garnishes, can be made 1 week ahead; store in an airtight container and chill, or freeze up to 3 months.How would you rate Basically Black Bean Soup?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleThe beans in my effort were also tough after six (!!!) hours, as others have noted who started with dried beans. Mine were as fresh as possible, bought from the grocery bulk bin just days before cooking. I finished them in the pressure cooker. Properly seasoned with salt, the recipe is delicious! \n\nI strongly suspect the 1/4 C vinegar is the culprit in this recipe. (Acid is a known agent in making bean skins tough.) Next time I will either presoak the dried beans or add the vinegar later in the cooking. \n\nI hope Bon Appetit editors will take another look at this recipe and modify it to make it more fool proof.Geoff2Silicon Valley, CA1/14/2022I followed this recipe, in a very exact manner,  and the end result was not to my liking.  Even after 3 hours of cooking the beans were still hard, and the broth; although spicy-was tasteless.  I believe that the preparation of beans requires more time and attention than this recipe suggests and consequently the end result is not worth the effort.Steve L.Tustin, CA8/24/2021We loved this recipe! The Chipotle Peppers in Adobo and the limey Greek yogurt created a unique and exciting flavor. We topped the soup with the lime yogurt, crumbled tortilla chips, green onions and fresh cilantro 😋 My limes were a little dry so ended up using juice from 3 in the yogurt. Also, next time I'll add an extra dollop of the Adobo Chipotles. Will definitely make this again! DianneElloree, SC7/6/2021YUM! I made this as directed and we loved it. I didn't have all the ingredients recently and did the following after reading some of the other reviews: Instead of only onions and carrots, I used 1 container of Trader Joe's Mire Poix (abt 1 cup each celery, carrots, & onions). I used 2 tsp each of smoked paprika and cumin instead of the adobo sauce. I used 3 cans of black beans instead of the dried. I drained the the canned beans over a large measuring cup, then added 5 cups of water to this reserved bean juice. I swirled water in the empty cans to get all the flavor back into the water. I added a can of fire roasted tomatoes, for a total of about 6 cups of water.AnonymousDallas, TX6/14/2021I was not into this dish. I felt like it was bland, binging too much on adding a ton of toppings. AnonymousBrooklyn 5/18/2020I keep coming back to this recipe! It is sooooo good. AnonymousSpokane, WA4/24/2020Omg, this recipe is the bomb! It is now my go-to Black Bean Soup (okay, at least top 5)! I followed it almost to a T but ya know #quarantinecooking so I subbed the Adobo sauce with 1 T Cholula hot sauce and 1/4 tsp Berebere seasoning, because why not?! I also currently don’t have dried black beans, so subbed with canned (15 oz with juices because we like it THICC; and math lesson: 1 can beans = 1.75 cups; 1# dry beans = 2 cups cooked.) Two black bean cans of water into the pot (aka about 2 cups) and light boil or heavy simmer (tomato/tomahto) for a while and taste as it goes. Beans are already cooked so no “broth” really being made here – simmered maybe 30 minutes but tasted ready to go! I added some takii umami granules just for kicks. Anyways, like I said, pretty much exactly the same. Oh and FYI the other half of the lime goes better in a margarita than the soup. eatyourheartout_nutritionSeattle4/15/2020I've made this soup twice now and both times it's been completely delicious. It is SO easy to put together (also super cheap) and you can have a lot of fun with the toppings - I did lime, Fritos, avocado, cilantro and of course the delicious lime crema which cannot be skipped! A+++soapnanaChicago, IL4/14/2020Made this tonight and it turned out SO GOOD! I had to make some modifications due to what was in my pantry because quarantine... but I made it with canned black beans (about 3 1/2 cans) and let it simmer for about 45 minutes for the flavors to meld and the carrots to get soft. I also used hot smoked paprika because I didn't have a can of adobo around. I also used my immersion blender to partially blend the soup. Absolutely loved it and will definitely make it again! AnonymousChicago, IL4/1/2020Added two teaspoons of cumin and I soaked the beans overnight. TX2/28/2020I made this last night and simmered the soup for 3 hours. The beans didn't get totally soft, so I ended up pureeing most of the soup, which helps with the bitey beans. The flavor is still awesome!AnonymousRhode Island1/21/2020Just made it used a whole can of Adobe chiles.  Pulled out chilies in the end with some black beans. Purred this rest and put the beans back. Thumbs up from the wife who is not a high heat lover.MReverieMadison Al 1/19/2020Once again, BA nails it with a healthy, easy to make and delicious recipe. I made this on a snowy Saturday to have on hand for weekday lunches. I‘ll fully admit to licking the remnants from the pot. Yum! I did end up puréeing it. Love. Thank you!ChristaqAnn Arbor Michigan 1/18/2020Amazing! I made it twice, I added can of fire roasted tomatoes and it was perfect soup!Anonymous1/16/2020YES ABSOLUTELY! Greatest black bean soup I've had, and VERY easy to make. All the toppings go great with it. Would have added a bit more chipotle in hindsight.AnonymousColumbia, SC1/11/2020Explore Bon AppétitSoupSoups and StewsAmericanBlack BeanBeanVegetableChipotleChileOreganoHerbs & SpicesGarlicEasyOne-Pot MealsWeeknight MealsMainNut-FreeVegetarianSimmerLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-14", "author": ["Condé Nast", "Lauren Schaefer"]}