{"id": "a8089e4eb863f08c701886be2c9f8aa7", "url": "https://www.bonappetit.com/story/rent-week-white-bean-dip", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "This Rent Week White Bean Dip Is Winning the Super Bowl | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rent Week White Bean Dip Is Winning the Super BowlWhether you like football or not, white bean dip with harissa and crispy homemade pita chips is nothing to complain about.By Alex DelanyJanuary 31, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailApparently, when it comes to taking pleasure in watching the Super Bowl, I am in the minority at Bon Appétit. I love the Super Bowl. And most of my coworkers do not. We have a lot of haters running through these halls. And I don’t quite understand it.I get that football isn’t for everyone. I'm well aware that the sport and the organization that controls it have quite a few serious problems. But taking a frigid, ho-hum Sunday evening in February and deciding to drink whatever it is that you want to drink? And eat chicken wings? And hang out with your friends? And possibly catch an exceptional feat of acrobatics or strength or unity on the television? And eventually washing all of the cheese and salsa and sour cream off of your hands after deciding that you’re actually finished with the nachos? (And then going back for more?) How can you hate on that? That sounds like the ideal setup to me. If you’re hating on the Super Bowl, you’re really just hating on a good party.Why is the Super Bowl called the Super Bowl? I'm sure there's a story there, but I'm not trying to read it. I like to think the Super Bowl is called the Super Bowl because of the enormous quantity of dips consumed on a single Sunday night in February. So many dips, from so many bowls. The Super Bowl is a day of dips, just as much as it is a day of football. So for this Rent Week, we’re doing a white bean dip with harissa and homemade pita chips. Throw on this Hey. Enjoy. playlist I made you (both enjoyable and completely free of charge), get a nice stretch in, and crank your oven to 400°.Some people hate on homemade pita chips, and I get it. To be fair, I buy Stacy’s most of the time. But when you have leftover pitas, or the chips at the store aren’t the flavor you’re looking for, or you’re inviting people over to watch a football game and want to impress them, homemade pita chips are where it’s at. And they're pretty simple to make.These are what pita chips look like, incase you didn't know.\nPhoto by Chelsie CraigTake 8 pitas, and slice them in half widthwise. Then rotate 90° and cut them widthwise, perpendicular to your first cut, into four strips. You should end up with eight pieces from each pita. The edges of those pieces will still be attached to the bottom layer of the pita, so you have to separate the top and bottom layer by tearing them apart. You are strong enough to do this. I promise. Throw all of the pita pieces into a large bowl, and toss them with a couple pinches of kosher salt, ½ Tbsp. garlic powder, 1½ Tbsp. of smoked paprika, and 3 Tbsp. of olive oil. Toss the pita so every piece is coated.Spread the pita out on a rimmed sheet tray so they overlap minimally. You’ll have to do a couple batches, so don’t worry if you only have one tray or your oven is small. Throw them in the oven for about 15 minutes, until they’re brown and crispy.In the meantime, we’ll make our dip. You need white beans to make white bean dip. Yeah, the name checks out. Drain, but don’t rinse, 2 cans of cannellini beans and dump them into a blender. Add a couple pinches of kosher salt, a few cranks of black pepper, and 4 Tbsp. of olive oil, and blend the beans until they all reach the ideal dip-like texture.Don’t forget to check on the chips! They’re not there yet? Okay. Back to the dip. We need to add some more flavor to this dip to make it interesting. Add 3 cloves of grated garlic, the zest of 1 lemon, the juice of 1½ lemons, 3 Tbsp. of Greek yogurt, and a handful of finely chopped parsley. Now we’re looking at a bright, creamy dip loaded with richness, acidity, and flavor. Again, if the dip seems too thick, go ahead and add another glug of olive oil to loosen things up.Does something in this kitchen smell like toasted pita? Oh, yeah. It does. Grab those chips!Swirl it. Make it nice.\nPhoto by Chelsie CraigPour the dip from the blender into a serving bowl. Top the bowl of dip with a spoonful of harissa. You determine the spice level. I’m personally a fan of a mild harissa (because you really get the sweetness of the peppers, not just mouth-numbing spiciness), but if you want to bring the heat, go for the fiery stuff. Give the harissa a little swirl so it doesn't just look like a glop, and top the whole thing with a couple decorative drizzles of olive oil and some freshly ground black pepper.This is a recipe that’s pretty easily transportable, so if you’re headed somewhere else to watch the game or do whatever else it is that you do, it shouldn't be a problem. Once you get there, you just let the chips do what they were born (or, uh...made) to do: transport delicious bean dip from the bowl to your mouth.And remember, it doesn’t matter if you like football. Or if you know what the rules are. Or even if you can identify the teams that are playing. What makes a good Super Bowl party a good Super Bowl party (like any other party) is that you’re enjoying yourself. Drink what you like to drink. Eat what you like to eat. And dip whatever you can into whatever bowl of dip is within reach. Honor the bowl, whether it’s the one on the TV or the one in your lap.Want a beverage to go with that dip? How about Gingerade?A Rent Week Gingerade for Dry January (and All the Time, TBH)The first ever Rent Week drink recipe is here. And it's loaded with ginger.View StoryExplore Bon AppétitBasicallyRent WeekWhite BeanDipPitaChipsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-31", "author": ["Condé Nast", "Alex Delany"]}