{"id": "a80bb024e8d252fc94996c9b41e4ea94", "url": "https://www.bonappetit.com/story/redefining-healthy-eating", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "How I'm Redefining What \"Healthy Eating\" Means to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow I’m Redefining What “Healthy Eating” Means to MeAfter decades of swinging between extremes, I’m starting to seek balance. By Christina ChaeyMarch 14, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Kat BoytsovaFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.I first read Julia Turshen’s incredibly honest essay about breaking free from diet culture months ago in a galley of her newest cookbook, Simply Julia. I copied and pasted and emailed the essay to myself, highlighting the lines I related to most: “For so long, whenever I felt fat, or what I deemed fat, it was almost always a way to describe anything other than happy. Not only had I equated ‘fat’ with ‘anything other than happy,’ I had set up a tidy, miserable binary for all of my feelings to fit into.”Related: The Myth of Healthy Eating with Christina Chaey and Vanessa RissettoContentThis content can also be viewed on the site it originates from.I’m just beginning to chart a way out of my own version of that binary: the internalized belief that my value as a person should be defined by what I do or don’t eat. For decades, this belief has fueled me as I’ve oscillated between periods I’ve characterized as “extremely healthy” or “extremely unhealthy”; there has seldom been middle ground.I spent a lot of this winter living in one of my “extremely unhealthy” periods. Between the persistent isolation and the weather, I was at a low point, self-soothing with homemade cocktails and a lot of lasagna. I’d wake up every morning and make myself a half-hearted promise that today I’d go for a walk, but then the day would pass me by with no walk and I’d go to bed feeling like I had failed to “be healthy.”This week, by contrast, I’ve been in one of my “extremely healthy” periods: I’m loading up on vegetables, whole grains, and beans while barely consuming sugar, alcohol, dairy, meat, or refined carbs. I’m reading in bed with tea rather than snacking in front of the TV. I’m going for an hour-long power walk in the mornings and doing my physical therapy stretches before the very respectable bedtime of 10:45 p.m. I’ve dedicated myself singularly to a routine that has left me feeling, quite simply, elated.But as I rack up more and more days of sugar- and booze-free bliss, my feelings of elation are being steadily replaced by the dread of knowing that, sometime soon, this period will end. I don’t know whether it will happen tomorrow, next week, or next month, but at some point in the future, I will make one decision (ordering too much Shake Shack, drinking one too many martinis) that will signal my brain to kick off a chain reaction of adjacent, familiar habits. The lentil lunches, tea, and power walks will be replaced by late-night chips and too much takeout until I get fed up with all that and revert to my “healthy” self again.I re-read Julia’s essay again while writing this newsletter, and, this time, I highlighted a different section: “I am learning what it feels like to not merely accept my body, but to understand that there’s nothing wrong with it. To love it. To know that no matter how much space it takes up in the world, it’s worthy and I’m grateful to live in it.” These words are different—I don’t yet relate to them in the way I wish I could; they feel like a foreign language I can almost but not quite translate. I don’t yet know how to eat without feeling either “good” or “bad.” What I do know is that I need to reconsider what “healthy” means to me.Here’s What I’m Cooking These Days:Photo by Alex Lau, Food Styling by Susie TheodorouSoy and Ginger Steamed FishCrispy Mushrooms With Creamy White Beans and KaleBig-Flavor BroccoliFridge Clean-Out Nabe With Mushroom DashiMarinated Tofu With Brussels Sprouts and FarroWhite Bean and Spring Vegetable StewExplore Bon AppétitHealthyishessayRead MorecultureAny Other Tired Cooks Need Some Serious Lunch Inspiration?By Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-14", "author": ["Condé Nast", "Christina Chaey"]}