{"id": "a81d7cb6d5cc7e5e4f4aecd0ab65be1e", "url": "https://www.bonappetit.com/story/super-bowl-sandwich-bo-ssam-style-pulled-pork", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "A Super Bowl Masterpiece: Bo Ssam-Style Pulled Pork Sandwiches | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Super Bowl Masterpiece: Bo Ssam-Style Pulled Pork SandwichesShreddy pork stuffed between potato rolls gets the bo ssam treatment.By Emma WartzmanJanuary 26, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailOn this week's episode of the Bon Appétit Foodcast, food director Carla Lalli Music, editor in chief Adam Rapoport, and Adam's friend Gabe Tesoriero (a music exec and excellent home cook who has somewhat inexplicably become a semi-regular on the show) talk about how to create the ultimate Super Bowl menu. They are loud and opinionated in a playoff-style game, pitting specific dishes against each other in the categories of appetizers, mains, drinks, and desserts until they arrive at one winner in each (well, except for appetizers, where there are two winners, because a Super Bowl party with one appetizer is a Super Bowl party nobody wants to attend).There was queso versus pimiento cheese, chips and guacamole versus nachos, meatball subs versus cheesesteaks, cheap beer versus craft beer... The list goes on.Time to assemble.\nPhoto by Alex LauOne category, though, stumped them: bo ssam (a Korean dish of pork wrapped in lettuce leaves with rice, kimchi, and a variety of sauces) versus pulled pork sandwiches with slaw. After a bit of back-and-forth, the three decided to combine the two into one dish that can only be described as absurdly delicious. Bo ssam-style pulled pork sandwiches.\"I make bo ssam all the time as dinner party food and it always wows the guests,\" says Gabe. \"People that have never had it lose it, and people that have had it mark it in their calendar.\" But bo ssam needs a full table. You have to assemble your wraps multiple times with all the accoutrements, passing kimchi and rice and lettuce around. It's not as easy to eat on the couch, watching the Super Bowl, with a coffee table crammed with dips and chips and cans of beers. And so this bo ssam-style pulled pork sandwich was born, leaving all the other mains in the dust.Here's how to make it:Start with your pork. The recipe we love comes from Momofuku, with a glazed, little-bit-sweet, little-bit-salty outer crust and falling-apart tender meat on the inside. The process takes a couple of days because you have to salt the meat and leave it in the fridge overnight, but the beauty of it is that if you think ahead, it requires very little else—just a quick rub down of salt and sugar, and then a bunch of hands-off, hanging out time in the oven (besides the very occasional basting of the juices that slowly but surely emerge from the meat). By the time your guests come over, you'll have prepped all the other pieces of the sandwich and all that will be left to do is assemble.Speaking of all those other pieces of the sandwich, here's what else to make. First, a ginger scallion sauce, which in the case of this recipe is tossed with ramen noodles. Ignore the ramen noodle part and make it as a stand-alone condiment.Next comes a cilantro mayo, which is mayo (we like Hellman's), a bunch of chopped up cilantro, and lime juice. We like it heavy on the lime to balance out the fat, but taste as you go until it's to your liking.After that, there's kimchi slaw. We combined napa cabbage, mild chili flakes, grated ginger, grated garlic, sesame oil, seasoned rice vinegar, and fish sauce. But you can also grab a jar of kimchi at the store (or here) and your sandwiches will be no worse off for it.Speaking of the store, the rest of the ingredients are all items to purchase: bread and butter pickles, a few jalapeños that you'll slice up for people who like extra heat, sprigs of cilantro to bring brightness, and hoisin sauce for that funky, sweet, umami element. Oh, and of course, Martin's potato rolls to somehow contain the mess of glorious components going inside.Now Super Bowl party on.Listen to the full episode here, or wherever you get your podcasts:ContentThis content can also be viewed on the site it originates from.For more Super Bowl recipes, head here:1 / 50ChevronChevronChile Chicken NachosView RecipeExplore Bon AppétitSuper BowlSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-26", "author": ["Condé Nast", "Emma Wartzman"]}