{"id": "a81f4fb834afdf1606a80a87a1b1c685", "url": "https://www.bonappetit.com/recipe/grilled-scallops-with-peach-chili-sauce", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Grilled Scallops With Peach Sweet Chili Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueGrilled Scallops With Peach Sweet Chili SauceBy Leela PunyaratabandhuJuly 6, 20214.2(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Dylan + Jeni, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis dish is a nod to grilled fish-ball skewers that you can get from Bangkok street carts day and night. Instead of using store-bought fish balls or going through the arduous process of making them from scratch, cookbook author Leela Punyaratabandhu uses voluptuous sea scallops, whose texture is similar to that of Asian-style fish balls: firm with a little bit of bounce. The bright peach sauce is a summer-inspired take on the classic Thai sweet chili sauce with which grilled fish balls are usually served. Serve this as part of Leela’s summery menu for Grilled Pork Shoulder Steaks With Green Pepper Relish, Khao Niao (Thai Sticky Rice), Cantaloupe with Spicy Bacon-Cashew Crumble, Cucumber, Tomato, and Green Bean Salad, and Lime-Lemongrass Slushies. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonBlender$32 At AmazonHeat Resistant Leather Gloves$22 At AmazonBrush$7.99 At AmazonLarge Basting Spoon$16.37 At AmazonSmall Saucepan$155 At AmazonIngredients4 Servings1red Thai chile or Fresno chile,seeds removed, coarsely chopped1garlic clove, coarsely chopped½cup chopped peeled ripe peach1tsp. (or more) sugar¼tsp. kosher salt, plus more1tsp. cornstarch1Tbsp. (or more) apple cider vinegar16large sea scallops, side muscle removed, patted dryVegetable oil (for brushing)Freshly ground black pepperCilantro sprigs and lime wedges (for serving; optional)PreparationStep 1Purée chile, garlic, peach, sugar, and ¼ tsp. salt in a blender until smooth. Transfer purée to a small saucepan and cook over medium heat, whisking often, until starting to bubble around edges, about 4 minutes.Step 2Dissolve cornstarch in 1 tsp. water in a small bowl. Whisk cornstarch slurry into purée and simmer, whisking constantly, 1 minute. Stir in vinegar and let sauce cool.Step 3Prepare a grill for medium-high heat. Brush scallops lightly with oil; season with salt and pepper. Grill until charred and cooked through, about 3 minutes per side.Step 4Taste sauce and add more sugar, salt, or vinegar if needed. Spoon sauce onto a platter and arrange scallops on top. Scatter cilantro over and serve with lime wedges if using.How would you rate Grilled Scallops With Peach Sweet Chili Sauce?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangle\nMade this for a dinner w friends last night … made the sauce for a stir fry of shrimp, yellow peppers and asparagus cut diagonally at same length… served on spinach pasta, with lime wedges and basil \n\nTripled the sauce, for the pasta.   Didn’t have Thai chiles so used /puréed a sweet red pepper ( for color) and used a ton of chili flakes.\n\nAll four of us literally mopped our bowls for every lick of the sauce.  \n\nNext time will add a tad more water to thin a smidge.  Thought the purée would melt to clear in the frying pan, but it stayed opaque.  Definitely worth making .\nAnonymousWashington, DC9/18/2021Delicious with ripe summer peaches. Our peaches were sweet enough that we put in half the sugar recommended. We were glad we doubled the recipe, it is so tasty you will want more. AnonymousHouston8/28/2021super easy and an amazing blending of sweet and spicy. plus the presentation looks fancy. can't wait to make it again.princess diberkeley, CA8/27/2021This sauce is SO good. I doubled the recipe to have enough to serve it with thin rice noodles and it was delicious. Made mine with tofu and my boyfriend's with scallops and it paired really well with both. Definitely recommend!Lisha AlmeidaWashington DC8/9/2021This rating is incorrect; I give this recipe five stars.  Double the sauce recipe and add a bit more vinegar as another reviewer said. Can I’ll swap scallops for cubes of pressed, extra firm, tofu as well. Great!! ⭐️⭐️⭐️⭐️⭐️Cari-BKing George, VA8/9/2021Upped the Thai chilis and the heat is NO JOKE but it's SOooooOOOOooooo good. added extra vinegar too. and nixed the sugar. Made some miso cole slaw to go with it. YUM! \nShazzizNYC7/27/2021Delicious. This recipe is also great with apricots.AnonymousRichmond, VA.7/26/2021Explore Bon AppétitThaiSoutheast AsianAsianScallopShellfishSeafoodPeachStone FruitFruitThai ChileChileVegetableFresno ChileSummerQuickEasyWeeknight MealsMainSideStarterDairy-FreeGluten-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Leela Punyaratabandhu"]}