{"id": "a82b65e964aacb6201cf86148df9a5f5", "url": "https://www.bonappetit.com/story/chickpea-flour", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Chickpea Flour Is Your Fastest Route to Dinner Tonight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChickpea Flour Is Your Fastest Route to Dinner TonightIt's gluten-free, packed with protein, and makes the best savory pancakes around.By Aliza AbarbanelJanuary 11, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWe'll admit it: Most of the recipes in our arsenal of ultra-fast weeknight meals involve boiling water or zapping frozen dumplings in the microwave. But mixing together flour and water to make a batter? Who has time for that? Well, actually, you do...thanks to senior food editor Chris Morocco's pared-down recipe for savory chickpea pancakes that comes together faster than a bowl of pasta and can lead to infinitely customizable meals.Also called socca, cecina, and farinata, chickpea pancakes are created from a simple base of chickpea flour. And yes, the thought of adding yet another type of flour to your pantry may be daunting, but chickpea flour is worth it. It’s naturally gluten-free, packed with protein (six grams per ¼ cup!), and wonderfully nutty, plus it hydrates to create a batter in just 10 minutes. All these traits have made chickpea flour a staple around the world, from India to Italy, where it’s commonly turned into crepes, fritters, and even tofu. But what exactly is chickpea flour, and why is it worth a spot in even the most crowded pantry? Stay with us.Okay, what is it?Chickpea flour is made by blitzing down dried chickpeas (a.k.a. garbanzo beans) into a fine powder. It’s naturally dense and can be substituted at a 1:1 ratio for heavy flours like rye or buckwheat, but it won’t have the same rise that you’d get from the all-purpose stuff.Where do I find it?Chickpea flour is pretty widely available, though it's sold under a variety of names like garbanzo bean flour or besan. Find it at health food stores, Asian and Middle Eastern markets, plus online retailers like Amazon and Thrive Market. You can even make it yourself by blitzing dried chickpeas (not canned!) in a high-powered blender or food processor.How do I use it?Chickpea flour is extremely versatile. It’s commonly used in gluten-free baking and is also great for binding together fritters and thickening soups. But we love it most as a way to fast-track weeknight dinners by making thin, crepe-like pancakes and topping them with sautéed greens or mushrooms, raw fennel salads, crispy chickpeas, ground meat, eggs, lentils, and more.Our Feel Good Food Plan recipe uses just chickpea flour, olive oil, water, and salt in the batter, but be sure to let the batter sit for at least ten minutes so the flour can hydrate. Try adding eggs for a sturdier pancake that's similar to an omelet. You could also season the batter with ground turmeric, cumin, coriander, or any ground spice you’re feeling. Whatever you do, they'll come together fast, and they'll taste great—and what could be more weeknight-friendly than that?Bust out the chickpea flour:Chickpea Pancakes with Kale and FennelSavory chickpea flour pancakes, also known as socca, require just four ingredients (including water).View RecipeExplore Bon AppétitChickpeaHealthyishChickpea FlourIngredientsRead MoreLifestyleBlack Lentils Are the Best Lentil for Meal Prep, PeriodBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-11", "author": ["Condé Nast", "Aliza Abarbanel"]}