{"id": "a85a3a98b2f4fe8c7c8ea7a19b454016", "url": "https://www.bonappetit.com/story/hella-margarita-mix", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "I Fly Delta Just for the Tiny Hella Margarita Cocktail Mixers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Fly This Airline Just for the Cocktail MixersSure, it’s just a drink. But up there, it’s kind of everything.By Amiel StanekApril 23, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m aware that people have all kinds of complicated adult reasons for being loyal to one airline. Apparently there are things called “points,” and secret airport waiting rooms with free bananas, and sought-after “upgrades” of some kind or another. Boooooriiiiiiing! For me, it’s about the little things. And it doesn’t get more little than a 60-mL, 3-1-1–approved bottle of margarita mix—which, to be honest, is about 90 percent of the reason I fly Delta.I love drinking on airplanes. It steadies my nerves (I used to be terrified of flying), but more than that, there’s something incredibly novel about engaging in a perfectly normal human activity (enjoying a mixed drink) in what for much of human history was an impossible, unthinkable situation (hurtling across country in a giant metal tube at 30,000 feet). And while I have always been content with a simple gin and soda or the occasional Bloody Mary, the first time I saw Hella Margarita Mix on the Delta in-flight drink menu, I literally gasped. This changes everything! I thought to myself. (Remember: little things.) Because as much as I like a chilly marg, The Sour Family—a whole host of cocktails comprised primarily of liquor, citrus, and sugar—is my forever drink of choice. Armed with a mini-bottle of sweetened lime juice, a whole new world of cocktail possibilities revealed itself to me. Classic daiquiris! Gin sours! And my all-time favorite: The Whiskey Sour. I was in business. (Actually economy, but whatever.)“I’ll have a cup with extra ice, a bourbon, and a margarita mix, please!” This has become my cheerful, self-satisfied refrain when the drink cart comes around. I now know to be patient with the flight attendants. They will first act confused, as though they don’t know about the margarita mix. (It is also possible that I am the only person who ever orders it.) Then they will do a double take when I ask for a mini-bottle of Woodford Reserve. “Wait...you want whiskey with the margarita mix?” But I persist. Because combined, these humble ingredients make for pure mile-high pleasure. Gloriously sweet-tart and just the right amount of salty, with the perfect boozy bite, my in-flight whiskey sour is a breath of fresh (albeit, recycled) air—a spot of brightness and liberty in what is otherwise a confined, dehumanizing situation. It’s just a drink, sure. But up there, it’s kind of everything.I’m going to be real: In real life, closer to sea-level, I’m way too much of a snob to buy store-bought sour mix. I’ll squeeze my own citrus and make my own simple syrup, thank you very much. But tucked snugly into seat 27D, bingeing downloaded episodes of Billions on my iPhone and watching the drink cart start to make its way down the aisle, it’s the most special thing I can ask for. And if that doesn’t inspire loyalty, I don’t know what does.Buy It: Hella Margarita Cocktail Mixer 750 mL, $10 at reservebar.com.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCocktailHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-23", "author": ["Condé Nast", "Amiel Stanek"]}