{"id": "a85ba3d872f33ef3aa80b02014015d82", "url": "https://www.bonappetit.com/story/spontaneous-fermentation", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "What Is Spontaneous Fermentation, and How Does It Affect Wine, Beer, and Booze? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhat Is Spontaneous Fermentation, and How Does It Affect the Taste of Wine, Beer, and Booze?The hands-off fermentation method makes really interesting wine, beer, and even rum. Here’s why we’re so into it right now.By Alex DelanyAugust 16, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmail“Spontaneous fermentation” sounds like the worst two-word Instagram bio you’ve ever read. Or something terrible that would show up in an online dating profile. “Hey. I’m 23. Just moved to the city. Can’t wait to spontaneously ferment with some interesting humans!” Nope. I’m good. Thanks.But spontaneous fermentation, unlike the world of online dating, is something you should understand because the coolest beers, ciders, wines, and liquors right now are being made through this process, delivering unexpected flavors that range from ripe raspberries to fresh cane sugar to tart lemon to the juiciest of melons. “We’ve seen a huge increase in breweries starting up legitimate spontaneous programs,” says Joshua Van Horn, owner of Brooklyn’s Gold Star Beer Counter. “Seeing more breweries catching on gives me hope that we will see many more being released. We try our hardest to get those beers in our door.”Dude, that’s great. Sounds rad. I love cool beverages. So down for them. But what the hell is spontaneous fermentation? Can you explain it to me before you...say it again?Yes. Totally. Well, I’ll say it one more time, because I have to. Spontaneous fermentation is what happens when a brewer, winemaker, or distiller leaves the inoculation (the moment when yeast and bacteria come in contact with the liquid) up to whatever organisms happen to be in the air or on the fruit that they are fermenting. This is different from the process of most mass-produced booze, where industrialized, controlled yeast strains or blends are deliberately poured into a sugary liquid. Brewers don’t know exactly what’s ending up in the beer or wine or cider. All they know is that the fermentation will be, as advertised, spontaneous.This fermentation method is nothing new. In fact, it’s the oldest method of booze making there is. Before humans knew what yeast, bacteria, or ride-sharing apps were, they made party liquids by letting fruit juice or sugary water hang around in big jugs until something happened. It wasn’t until the 17th century, when a Dutch scientist named Antonie van Leeuwenhoek (great name, btw) observed microorganisms under a magnifying lens that we even knew that these little bugs existed. And it wasn’t until Louis Pasteur actually discovered how yeast works in 1859 that we realized the role it played in fermentation.There's so much life living in and on these grapes. Natural yeasts and bacteria for days!\nPhoto by Tim Graham/Getty ImagesAs we learned more about yeast, the more regulated and controlled it became. The goal of any alcohol producer was to deliver a consistent product, and the more they refined yeast strains, the easier it was to replicate the exact recipe of a beer or wine. But as any post-punk enthusiast will tell you, humans were born to rebel. After all this control in the world of fermentation, the focus has started to shift back toward the unexpected, the spontaneous. We’re embracing ancient fermentation methods, and it’s something to get excited about.Exciting is usually a meaningless word, but I will say with 100 percent certainty that exciting is the right word to describe spontaneously fermented booze. Each sip pushes you closer to the edge of your seat. There is no right or wrong flavor. There is no certainty, no clear path to perfection. A second after the glass leaves your lips and is lowered to the table, you’re already lifting it back up for clarification. What am I drinking? What was that flavor? Where can I get more?The flavor spectrum of spontaneously fermented alcohol is nothing like your gas station IPAs, grocery store Pinot Grigios, or pub ciders. Spontaneous fermentation brings tart acidity, musty barnyard funk, and bright citrus to the glass. It can smell of pure red fruit, damp basements, or moldy cantaloupe. Am I selling this well? These things sound weird, I know. Not every kind of alcoholic beverage responds the same to spontaneous fermentation, though. There’s no single flavor that the process lends to a liquid. It varies, depending on what you’re drinking, but it does lead you down a similar path. It asks you to relax, explore, and let go of preconceived expectations you have for something as ordinary as red wine.Allagash's coolship, filled with starchy wort, being inoculated by the wild yeasts in the air.\nPhoto courtesy of Allagash Brewing CompanyWhen it comes to spontaneously fermented beer, I like to think of the general flavor and smell as hay that’s been sitting in the top of a barn during a thunderstorm. But in this thunderstorm, the rain is actually cantaloupe and honeydew juice, and the lightning bolts are made of lemon peel and lemon juice. And the lightning strikes the barn, and the whole thing blows up. And when the smoke clears, there’s a bunch of spontaneously fermented beer, which tastes of a barnyard, musty and damp, with subtle hints of melon and charged with the acid of bright citrus. The way these beers taste, just like this drawn-out metaphor, is complex. There are layers, nooks, and crannies to be explored, and just because the process is generally the same doesn’t mean every spontaneously fermented beer will taste the same. The wild yeasts in Belgium differs from the wild yeasts in Maine, where American breweries like Allagash are brewing spontaneously fermented beer that is nothing short of phenomenal. “We’ve seen a huge increase in breweries starting up legitimate spontaneous programs,” says Joshua Van Horn, owner of Brooklyn’s Gold Star Beer Counter. “Seeing more breweries catching on gives me hope that we will see many more being released. We try our hardest to get those beers in our door.”In the wine world, spontaneous fermentation is everywhere. The acceptance of natural wines (you know what those are, right?) has left young wine enthusiasts guzzling juicy, acidic grape juice, but not many of these natty wine subscribers know that spontaneous fermentation is a big part of what makes those wines so delicious. The yeasts and bacteria that are responsible for turning that grape juice into wine live in and on the skins of of the grapes and in the air surrounding them. And since grapes display such a wide variety of flavors, spontaneously fermented wines can taste drastically different from one another. But the one common trait, and this might sound kind of silly, is that these wines seem downright energetic. The flavors aren’t static. The fruit radiates, dripping juice. The acidity shimmers. The slight funk or chalky minerality seems to sing. The liquid inside of the bottle is lively, sometimes to the point of effervescence. It might be subjective, but I view it as truth: Spontaneously fermented wine is more fun to drink if you’re the type of person who’s up for it.And with cider, the approach is the same as wine: Let the natural yeasts and bacteria on the fruit do the work. “A natural wine or cider maker is a shepherd of microbes,” says Jon Piana, of Vermont’s Fable Farm Fermentory, a producer of both wine and cider. Cider makers like Fable and New York’s Sundstr¨öm Cider produce spontaneously fermented ciders that showcase the tannic fruit-forward flavors of native apple varieties. The combination of local apples, with native yeasts, yields a drink that is as terroir-driven as you can get. Spontaneous fermentation gives you a real understanding of the land on which these ciders were made. And if you’ve had true Michigan cherries, Maine blueberries, or California melons, you know what kind of quality we’re talking about. “We hope that our ciders inspire a sense of curiosity and exploration,” says Piana.Spontaneously fermented liquor is seen much less frequently than cider, wine, or beer, but that scarcity is what makes spontaneously fermented liquor so special. Clairin is a spirit that has been made in Haiti for hundreds of years and recently started being imported into the United States. Clairin starts with sugar, as rum does, but the liquid is inoculated through spontaneous fermentation. The resulting spirit tastes something like drinking a plantain smoothie through a straw made from just-chopped sugar cane. The fermentation technique brings a fruity, vegetal element, part palm leaves and caramelized bananas. From a flavor standpoint, it’s the most captivating liquor I’ve ever tasted, like walking into an elevator and hearing the shriek of the B-52’s instead of whatever smooth jazz compilation we’ve come to expect. Clairin makes all other rum seem boring.But here’s why spontaneous fermentation is something to seek out right now: It’s a sign that the makers are so confident in their technique and understanding of fermentation that they’re willing to forfeit control of the most vital part of the process. And they’re having fun doing it. “I love the dedication it takes to start up a spontaneous program at a brewery,” explains Van Horn. “We’re in an age where breweries release multiple beers every week, and spontaneous fermentation is the opposite of that. The results can be so beautiful.”Spontaneous fermentation is equal parts obsessive mastery and blind trust, and it’s as much a result of the makers as it is the places, plants, and soils from which the ingredients come. It’s about getting as close to the word natural as you can.  It’s a finger in the face of an industry obsessed with control, industrialized production, and a dogmatic adherence to tradition. This is what punk rock tastes like.Read more about the 25 restaurant trends we saw in 2018Want some funky cider? Here you go:It's Hard Cider Season and There's Only 1 Bottle You NeedIt's extremely affordable and not sweet at all.View StoryExplore Bon AppétitBeerWineHot 10 2018Trends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Alex Delany"]}