{"id": "a85cbd99b2dba1cd1dbc31b46952ac76", "url": "https://www.bonappetit.com/recipe/aloo-paratha", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Aloo Paratha Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAloo ParathaBy Priya KrishnaSeptember 22, 20203.9(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrint“If making bread has long intimidated you, start here. Parathas come in many shapes, textures, and flavors across Asia—they are perfect for dipping into dals and stews or eating alongside assorted condiments,” contributing writer Priya Krishna says. “This take, which I learned from my aunt Rachna, is really simple: a basic wheat-based dough stuffed with silky spiced potatoes. What makes this particular recipe so great is the ratio of potato to bread; because it’s mostly potato with just a little bread, each paratha is soft, satin-like, and supercharged with flavor. Eat these on their own or with a side of tangy achar and yogurt for dipping. To give your aloo paratha a bit of a kick, add ¼ cup grated cheddar cheese to each potato ball before you roll them into the whole wheat dough.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Saucepan$60 At AmazonVegetable Peeler$10 At AmazonPotato Masher$10.19 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonRolling Pin$13 At AmazonMedium Skillet$60 At AmazonPastry Brush$9 At AmazonIngredientsMakes 42medium russet potatoes (10–12 oz.)1cup whole wheat flour, plus more for dusting¼tsp. plus ¼ cup vegetable oil½tsp. kosher salt, divided½tsp. fennel seeds1small handful of cilantro¼tsp. red chili powderPreparationStep 1Scrub 2 medium russet potatoes (10–12 oz.), then pat dry. Pierce each potato 5 times on each side with a fork, then microwave in a microwave-safe bowl, turning over halfway through, 10 minutes. (Alternatively, place potatoes in a large saucepan without pricking and pour in water to cover. Bring to a boil, then reduce heat to medium and cook until a fork easily pierces flesh, 20–25 minutes. Drain, rinse under cold running water, and let cool 10 minutes.)Step 2Peel potatoes (it’s best to do this when they are cool enough to handle but still fairly hot). Transfer to a medium bowl and mash with a potato masher, fork, spoon, or your hands until mostly smooth. Measure out 1½ cups and transfer to a small bowl. If you have any extra, save for filling samosas or pierogi.Step 3Mix 1 cup whole wheat flour, ¼ tsp. vegetable oil, ¼ tsp. kosher salt, and ½ cup room-temperature water in a medium bowl to combine, then knead until dough is smooth and no dry bits remain. Wrap in plastic (a bowl with a tight-fitting lid will also work) and chill 20 minutes.Step 4Meanwhile, finely crush ½ tsp. fennel seeds with a mortar and pestle or crush on a cutting board with a heavy object (like a cast-iron skillet) to as close to a powder as you can get. Chop 1 small handful of cilantro.Step 5Using a fork, mix ground fennel, ¼ tsp. red chili powder, 2 Tbsp. chopped cilantro, and remaining ¼ tsp. kosher salt into mashed potatoes in small bowl. Use fork to break up any lumps; your aim is to get potatoes really smooth. (the dough will be hard to roll if the potatoes aren’t smooth enough). Divide into 4 equal portions and roll into balls.Step 6Divide dough into 4 equal portions and roll into balls. Dust work surface with flour and coat each dough ball in flour. Roll each ball into a 6\" circle, dusting with more flour if needed.Photo by Chelsie Craig, Food Styling by Pearl JonesStep 7Working one at a time, place a potato ball in the center of a dough circle and bring sides of dough up and over ball like you’re enclosing a parcel, gathering edges at the top. Pinch together to seal. (Make sure it’s sealed well, otherwise filling will spill out during the rolling process.) Turn ball sealed side down and roll out to an 8\" circle.Photo by Chelsie Craig, Food Styling by Pearl JonesStep 8To cook paratha, pour ¼ cup vegetable oil in a small bowl. Heat a medium skillet over medium. Brush a paratha with 1½ tsp. oil and carefully place, oil side down, in the pan. (The easiest way to move parathas to the pan is to drape over your palm; this will keep them from losing their shape.) Cook 2 minutes, brush top side with 1½ tsp. oil, and turn over. Continue process of brushing and turning until both sides are golden brown, 2 or 3 more times. Repeat with remaining 3 paratha.Photo by Chelsie Craig, Food Styling by Pearl JonesHow would you rate Aloo Paratha?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleAlmost got this right the first time, probably rolled the dough a little too thin and two of the four fell apart a bit while flipping. Used more flour than I expected on the table when kneading and rolling out the dough. \n\nNext time, I will use a little more oil in the batter. Not sure why we're supposed to oil the paratha and not simply put some in the pan (?)\n\nUsed Trader Joe's Cuban Seasoning in the mashed potatoes, that worked nicely, even if it's not authentic.\n\nDan WConnecticut1/17/2021This recipe is a perfect place to start with making parathas- the dough/water/oil proportion always throws me off but this was easy and clear! Once you get the dough, go wild with fillings! This recipe is a bit under spiced than traditional parathas- usually we add finely sliced red onion, green chili (jalepenos even) and a little grated ginger. Top with LOTS of butter/ghee. AnonymousNew York, NY11/17/2020totally achievable, delicious, fun. easy to follow. and my husband loved it. served it with baked rajma. but could’ve eaten on it’s own. 10/10. Anonymouscanada10/13/2020First time making parathas. The dough became difficult to work with after wrapping it around the potato ball. It also stuck to my work surface which complicated picking them up to move to the pan. They were all broken but super tasty! I’d make sure to use good quality spices and use salt as the recipe calls for. Will make again :)  AnonymousAmsterdam10/10/2020These are delicious. I was worried about rolling out the dough with potato inside but I got the hang of it really quickly. The fennel is delicious, and I'm excited to try again and try out different flavors. Anonymousminnesota10/8/2020This is bland and microwaving a potato is just wrong.  Was this tested?AnonymousVirginia10/2/2020Excited to make this!AnonymousChicago, IL10/1/2020I found the dough difficult to work with but was able to finally wrangle it.  But, in the end, not enough flavor and too much frying/oily flavor to make it worth the trouble.  AnonymousSomerville, MA10/1/2020I’ve been making these all week since the recipe came out. I go a little heavy on the fennel and they are so so good!AnonymousLos Angeles9/26/2020super goodAnonymousDC9/24/2020Explore Bon AppétitFlatbreadBreadSouth AsianAsianPotatoVegetableWhole Wheat FlourFlourRusset PotatoSideStarterNut-FreeDairy-FreeBakingRamadanDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Priya Krishna"]}