{"id": "a85ec6273b24192527168b68868918f1", "url": "https://www.bonappetit.com/recipe/radicchio-salad-with-sour-cream-ranch", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Radicchio Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueRadicchio Salad with Sour Cream RanchBy Chris MoroccoOctober 16, 20185.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWith salty, sweet, and creamy components, this recipe is more than just a salad: It's a fully realized side dish. Pale yellowish-white Castelfranco radicchio is usually tender and mild, but Chioggia (round) or Treviso (spear-shaped) varieties also work.Ingredients8 servings⅓cup sour cream⅓cup plain whole-milk Greek yogurt1Tbsp. plus 1½ tsp. sherry vinegar or apple cider vinegar5garlic cloves, 1 finely grated, 4 crushed1tsp. honey8Tbsp. extra-virgin olive oil, dividedKosher salt2scallions, thinly sliced½cup panko (Japanese breadcrumbs)½lemon2medium radicchio, preferably Castelfranco, leaves separatedPreparationStep 1Mix sour cream, yogurt, vinegar, grated garlic, honey, and 5 Tbsp. oil in a small bowl; season dressing with salt.Step 2Heat remaining 3 Tbsp. oil in a medium skillet over medium. Add crushed garlic and scallions and cook, stirring often, until golden brown around the edges, about 4 minutes. Add panko and season with salt. Cook, stirring often, until golden brown, about 3 minutes. Finely grate lemon zest directly into pan and toss a few times to incorporate. Transfer breadcrumbs to paper towels to drain; let cool. Taste and season with more salt if needed.Step 3Place radicchio in a large bowl. Drizzle with dressing; toss gently to coat. Season with salt and scatter breadcrumbs over.Step 4Do Ahead: Dressing and breadcrumbs can be made 2 days ahead. Cover and chill dressing. Store breadcrumbs airtight at room temperature.How would you rate Radicchio Salad with Sour Cream Ranch?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI love this!Anonymous3/4/2022Sooo good!!! Love everything about it.  Do have a question though.  When the recipe asks for 4 smashed garlic, does that mean in a garlic press or smash it with the back of your knife? If you smash it with the back of your knife do you remove it once the breadcrumbs have been toasted? Clarification would be great thanks.\nAnonymousBritish Columbia7/3/2020INSANE! Will definitely be making again. That being said, I love myself a good radicchio recipe, so I'm partial, but this is the best one I've had in a long time.astoltzeLos Angeles4/2/2019Super good! I subbed endive given what was available at the grocery store and spread a little dressing and beadrumbs on each leaf, making it a finger food. This dish received the most compliments at an early Thanksgiving gathering. AnonymousHOUSTON 11/19/2018Incredible salad—I mean, it's ranch dressing. I used purple radicchio and chopped it into bite-sized pieces so it's not a fork-and-knife salad, which is pretty in the photo but not realistic in My Life. And damn, Chris Morocco, those scallion breadcrumbs! Genius!! I ate them with my hands from the bottom of the salad bowl after dinner. alexbeggsBA.com 11/19/2018Explore Bon AppétitSaladAmericanRadicchioChicoryLeafy GreensVegetableGarlicFallWinterSideNut-FreeHealthyishThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Chris Morocco"]}