{"id": "a86bc4468ca936cbe6c12da229f8f201", "url": "https://www.bonappetit.com/story/what-if-barkeepers-friend-is-my-only-friend", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Bar Keepers Friend Is My Only Friend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat If Bar Keepers Friend Is My Only Friend?Sometimes you just need to scrub until some semblance of sanity returns.By Alex BeggsNovember 16, 2020FacebookTwitterEmailPhoto by Ted + Chelsea CavanaughFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.You can clean and you can clean and you can clean, but life has a way of staying smudgy. For those smudges, you should try Bar Keepers Friend. It took me a while to come around to the powdered cleaner because I don’t like introducing new products into my life when Comet ranks so highly (“it makes your teeth turn green!”). And I was like, which Bar Keep? Do I trust this Bar Keep? Is this stuff just baking soda in disguise? (It is not.) It’s an entirely different chemical, oxalic acid, and it is hardcore. While my interactions with human beings have withered and my home bar-keeping has skyrocketed, I’m spending more and more time with Bar Keepers Friend. So maybe the name fits.With my new friend I transformed an old Lodge Dutch oven that had nasty oil splatters deeply ingrained onto the outside. Now it looks normal (not NEW; nothing will ever be NEW again, get over that), and I’m not embarrassed to see it when I open my cabinets.But beware! Bar Keepers Friend is a powerful weapon! I’ve made some mistakes and sort of defaced a pan or two in the past few weeks so I wanted to share what I learned—I even asked the experts at Bar Keepers Friend for pointers. Friendly folks, as it turns out. Before you break out the hard stuff, here’s what you need to know.What are you cleaning?Bar Keepers Friend is good for:Stainless steel pansStainless steel flatwareStainless steel sinks (or even the exterior of appliances like fridges, stoves, and dishwashers; spot check in a corner first in case it has a special coating)Sheet pansStovetopThe glass oven window (did this recently, was amazing)Glass baking dishesPorcelain (dishes or sinks)Spotty/cloudy glassware (be careful not to scratch)Enamel-coated or lacquered Dutch ovens (most people use it to clean the outside of their Dutch ovens, the BKF folks told me, which is what I did, but otherwise spot-clean it first to see how it goes on yours)Corian countersChromeFormicaCopperInstant Pot (stainless steel exterior and the pot inside too)But not for:Marble, granite, stone of any kindEnamelwareNonstick pansUncoated cast iron (lacquered or enamel-coated cast iron, like Dutch ovens, can usually take BKF)Wood and wood cutting boardsPlasticMelamine (they suggest “using extreme caution”—I cleaned oil stains on the bottom of melamine bowls with BFK and it worked but I could also tell it dulled the plastic’s shine)What’s your sponge situation?Stay AWAY from the green scour pads and definitely NO STEEL WOOL. I thought it would be extra effective to scrub with the green scour pads and that’s how I got scratch marks all over my sheet pans (oh well) and inside my pasta pot (not happy about it). Stick to the gentler blue scour pads, or the scrubby side of your sponge, or a Scrub Daddy/Mommy. If you’re super paranoid about ruining your heirloom casserole dish, go with a microfiber cloth.The gist of how you use it.Get some GLOVES ON. Sprinkle a little BKF on the troubled area or the entire surface of your nasty Dutch oven, add a few drops of water and make a paste. Let it sit for ONE minute. Scrub off. Rinse. Repeat if it’s not there yet.THE BIGGEST MISTAKE YOU CAN MAKE!We’ve been trained to think that letting things “sit”—like a pot full of spaghetti sauce remnants soaking in soapy water overnight because you don’t feel like dealing with it—makes cleaning easier. This is the DANGER ZONE with Bar Keepers Friend. The most common mistake people make is letting the product sit on too long, which will “etch” the surface you’re cleaning (a.k.a. scratch the bejesus out of it). I did that with a stainless steel saucepan. And then I made the same fatal error with an enamel pot (also a forbidden material, see list above). The BKF scrubbed through the porcelain coating and now you can see a patch of the black iron underneath. It’s rustic, I guess.Wait, what is this stuff?There are three things going on in Bar Keepers Friend. Kevin Patterson, VP of Institutional Sales, explained it this way: “The oxalic acid portion reacts with alkaline buildups like calcium, lime, rust, hard water stains like iron deposits, etc. 2) Our ‘scrubbers’ (often called mild abrasives) assist in physically removing those buildups, as well as the removal of cooking-based soils of grease, scorch marks, grime, etc. 3) Lastly, the superior detergents utilized in BKF Cleansers help two ways: they ‘soften’ the greases, soils, etc. upon contact, which helps the first two benefits work even better and they also help in the rinsing process, holding the soils in suspension for easier rinsing.”TL;DR So we’ve got the acid taking on those serious surface defects, and then a scrubby powdered soap that reacts with the acid to get all the oily grime and spaghetti sauce stains. I would have been much more attentive in chemistry if we were scrubbing old sheet pans.How is it different from baking soda exactly?“Baking soda is a ‘base,’ which means it is alkaline,” said Patterson from BKF (whereas BKF is an acid). “[Baking soda] will have little to no effect on rust, iron-based stains, mineral deposits/build-up such as lime, calcium etc.” Bar Keepers Friend has detergent in it to literally wash food/grime off pans. Baking soda is just baking soda.The truth about my sheet pans.They look much better after a good BKF session, but that outline of burnt orange oil grime cemented into the edges is never going away. Then I took a look around my home—the chair with the broken leg in need of repair, the window I can never close once it’s open, is that a dead spider?—and think oh, so this is living.Photo by Ted \\+ Chelsea CavanaughBar Keepers Friend$8 at AmazonExplore Bon AppétitShoppingCleaningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Alex Beggs"]}