{"id": "a86d101f11b4f794d2abaae6bc94413e", "url": "https://www.bonappetit.com/story/kitchen-tools-vacation-rental-cooking", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "If You’re Gonna Cook on Vacation, Bring These Kitchen Tools with You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’re Gonna Cook on Vacation, Bring These Kitchen Tools with YouGive that vacation rental (and all those lazy-day meals) a serious upgrade with BYO knives, spices, and yes, even a blender.By Carla Lalli MusicJune 28, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailYou and your family and friends are packing up the car and going away for a week to your little rental at the beach, the lake, the woods, the country spot with a swimming hole. There’s a general store, a weekly farmers’ market, and maybe a decent butcher and fishmonger, but there’s no Whole Foods, no Trader Joe’s, and definitely no Instacart. You’ll eat out a couple of times, but mostly you came to sleep in, hang out, cook meals together, swim/hike/bike, and take at least one nap a day. Here’s the kitchen tools to bring from home, how to shop like a local upon arrival, and the recipes that let you get the most out of summer. Consider it your guide to culinary survival in the not-quite-wilderness.A big plastic storage bin makes for compact transportation.\nPhoto by Alex LauPack the EssentialsDull rental-kitchen knives, cheap cookware, and musty spices can derail the best-laid vacation meal plans. Think of this checklist as your insurance policy, and bring the key equipment, kitchen tools, and pantry staples from home that will make cooking enjoyable when you’re away. Pack up everything between a big plastic storage bin and a tote that can double as a market bag.EquipmentCast-iron skilletNonstick skilletTwo rimmed baking sheetsBlenderCutting boardAirtight deli containersKitchen ToolsKnivesWooden spoonsThin metal spatulaSlotted spoonWhiskPepper millCitrus juicerFine-mesh sieveMicroplane zesterDigital thermometerPair of tongsWine keyCan openerDish towelsPantryYour top five jarred spicesOlive oil from your countertopAny nuts, grains and/or pasta, and oats you’ve gotCoffeeFlaky sea saltThree is the magic number.\nPhoto by Alex LauYes, You Want Your Own KnivesThese are the key three you want:Utility knife: for all your slicing, dicing, chopping, and general prep workParing knife: for all the tomatoes and strawberries that need coring, trimming string beans, and cutting salamiSerrated knife: for crusty bread and bursting-ripe cherry tomatoesAnd no, don’t wrap them in a dish towel secured by a rubber band. There’s a safer way: Pick up a few inexpensive blade covers, slide them onto your knives, and pack everything in a sturdy canvas pouch.Blueberry-lime-cashew smoothies are the perfect breakfast to whip up in your blender.\nPhoto by Alex Lau, food styling by Chris MoroccoNo, Really—Bring the BlenderWhen you’re trying to make the most of your mornings, keep breakfast quick but filling with frothy fruit-and-nut-filled smoothies for everyone. Still not convinced?\nHere are some other things you’ll be using the blender for on a daily basis:PestoAioliSalad dressingSalsa verdeGrated ParmChopped nutsFrozen margaritasMilkshakesMarinadesGazpachoGet the recipe: Blueberry, Lime, and Cashew SmoothiesAioli is all you need to make those farmers’ market vegetables sing.\nPhoto by Alex Lau, food styling by Chris MoroccoShop Like a LocalHit the farmers’ market for lettuces, fresh beans and greens, herbs, melons, berries, and a few good eggs. Round out things with bread and cheese and you’ll be freed up to throw together casual dishes, such as a giant salad or on-the-fly frittata, with little to no planning required. Come midday, when it’s hot and no one feels like cooking, opt for the lazy lunch: Whip up a garlicky aioli and serve it with a produce-heavy platter starring your market haul. Graze all afternoon. Nap. Repeat.Plan on serving about half a pound of veg and two to three ounces of protein per person. Try:Blanched long beans, wax beans, or sugar snap peasBoiled fingerling potatoesRadishesCherry tomatoesBaby lettucesCooked, peeled shrimpThinly sliced hamHard-boiled eggsGet the recipe: Grand AioliWho’s on dinner duty tonight?\nPhoto by Alex LauDivvy Up DutiesVacationing with extended family or a big group of friends? Meal plans save friendships and marriages. Create a shared Google doc and get pairs to sign up for dinner and clean-up duty. Do this for every night you’re planning to eat in. Seriously.Fried fish sandwiches can (and should) be made on the grill.\nPhoto by Alex Lau, food styling by Chris MoroccoUse the Grill (but Not for Grilling)When the sun goes down and the evening breezes kick up, take the kitchen outside for a full-on fish fry. Set up your cutting board on the deck table, enlist housemates to pitch in with prep and stocking the cooler with drinks, and treat the (probably propane) grill as the heat source for these insanely satisfying fish sandwiches (or fritto misto or fried chicken). The open air comes with advantages: Gas grills can be dialed into a steady temperature for frying, there won’t be oil splatters on the cabinets or lingering fish aromas, and you’ll fall even more in love with your cast-iron skillet.Get the Recipe: Fried Fish Sandwiches with Cucumbers and Tartar SauceDon’t Make PieDid we tell you to bring a rolling pin and a pie plate? No, we didn’t. Eat ice cream for dessert. Go to the cute little local shop for it, get it from the snack bar, or pick up pints and eat it at home. End the night on a sweet note while someone else does the dishes.Here’s some smoothie inspiration:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitVacationsTravelMeal PrepShoppingRead MoreFried Fish Sandwiches with Cucumbers and Tartar SaucecookingI Made This Garlicky Grand Aioli in 5 Minutes with My Trusty Immersion BlenderBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Carla Lalli Music"]}