{"id": "a88b79e7d7854909a2425474f96e58b3", "url": "https://www.bonappetit.com/story/andre-springer-hot-sauce", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "For Andre Springer, Hot Sauce Is Just One Part of a Drag Queen's Show | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFor This Drag Queen, Making Hot Sauce Is Part of the ShowAndre Springer's fiery hot sauce is increasing queer visibility on grocery store shelves.By Elazar SontagNovember 9, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn mid-October, the shared industrial kitchen and food incubator where Andre Springer produced and packaged his hot sauce was shut down without notice. His and more than 175 other businesses were left without a space to prepare their products. As Springer regroups, and puts a pause on sauce production, he's launched a crowdfunding campaign to help fund his move to a new kitchen. You can learn more, and contribute here.When Andre Springer made his first batch of hot sauce six years ago, there was some confusion. Springer, dressed as his drag alter-ego Shaquanda Coco Mulatta, was at Bushwig, Brooklyn’s annual drag festival. Beaming, curly hair tied up in a colorful bandana, nails painted cherry red, gold hoop earrings swinging, Shaquanda rolled a shopping cart full of sauce through the festival. “A lot of people there were asking me when I would perform,” Springer remembers, giggling. “I was like, ‘Right now. Open your hand, here’s a cracker.’ And I put some hot sauce on it.” And just like that, Shaquanda’s Hot Pepper Sauce was born.Springer, now 36, began working at a gay bar in his early twenties, where he became friends with the resident drag queen. One night, when she was hosting her weekly Jeopardy game, she “asked me if I wanted to do drag,” he recalls. “And I was like, ‘Oh my god yes.’” Shaquanda was his first character. With her bandana and her apron, she was an homage to Springer’s grandmother, a cook in Barbados before she moved to New York.Since then, Shaquanda has been a fixture in Brooklyn’s drag scene. She doesn’t perform on stage. Instead, she interacts with her audiences, dancing through the crowd, and pulling partygoers onto podiums to dance and sing with her. Springer first had the idea to add hot sauce to Shaquanda’s performance after a trip to Barbados six years ago. Wherever he went, he was greeted by some version of the peppery sauce, which his grandmother in New York poured over all of her food. He came back to New York with a plan to make his own sauce, one that would act as a unique expression of his identity as a queer Barbadian New Yorker.A fiery jar of Shaquanda's Hot Pepper Sauce.\nPhoto by Chelsea KyleHe proudly describes the resulting sauce—a fiery mixture of vinegar, onions, and fresh peppers—as “a drag sauce.” Each bottle, wrapped in a bright red label, is emblazoned with Shaquanda’s face and a variety of sassy slogans: “Be the queen of your kitchen” and “Willing to please, eager to burn.”“That imagery is me,” he says, picking up one of the bottles from the coffee table in his Bed-Stuy apartment. “It’s my face; it’s my history; it’s my culture. It’s who I am.” Each bottle is a way for Springer to share his Barbadian roots and bring his drag performance into spaces that often lack queer visibility. “For me, that is a performance in and of itself.”Since Springer first peddled hot sauce at Bushwig six years ago, his business has grown. Now, he makes roughly 200 bottles of sauce a week in a Brooklyn commercial kitchen and distributes it to small shops in Bushwick and several in Manhattan. Making hundreds of bottles of sauce is a labor of love, but when Springer sells a bottle to a queer kid, or meets a woman named Shaquanda at the farmers' market while he’s vending (it’s happened), it all seems worth it. “I'm a one-queen shop, and it's hard doing all of these things,” he says. “But I want to see more queer visibility on the shelf. There's so much you can do with advertising and packaging that can teach people to love each other and be accepting.”Sometimes Springer looks in a shop’s window and, caught off guard, sees Shaquanda smiling back at him on a hot sauce bottle. In those moments, all of Springer’s work feels worth it. “Hey girl,” he’ll say through the window, blowing Shaquanda a kiss. “Who you goin' home with today?”Get on the waiting list for Shaquanda's Hot Pepper Sauce here.Explore Bon AppétitHealthyishHot SauceCondiment/SpreadNew YorkprofileRead MoreLifestyleGangstas to Growers Is Changing the World, One Tasty Bottle of Hot Sauce at a TimeBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Elazar Sontag"]}