{"id": "a88dda1870dca1fbe94fe01fa49a9add", "url": "https://www.bonappetit.com/story/have-you-tried-limoncello", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Sure, Chicken Parm Is Great, But Have You Tried Limoncello? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSure, Chicken Parm Is Great, But Have You Tried Limoncello?At Frankies 457 Spuntino in Brooklyn, the real fun starts when the after-dinner drinks hit the table.By Andrew KnowltonApril 16, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.If I’m being honest, my favorite part of Italian-American restaurants isn’t the OG red-and-white-checked-tablecloth vibes. It isn’t the swan that a burly, mustachioed server would ceremoniously craft out of aluminum foil and my fettuccine Alfredo leftovers when I was a kid. It isn’t even the pound of mozzarella that smothers a breaded and fried chicken cutlet the size of my face. No, my favorite part has to be the bottle of booze casually plopped on the table post-meal.In my book, every good red-sauce feast ends with a few glasses of sambuca, grappa, amaro, or, best of all, limoncello—that Gatorade yellow, sometimes cloyingly sweet Italian liqueur made with just citrus, sugar, vodka, and water. And it doesn’t even have to be great—it just has to be free, and delivered with a wink and a smile by some gruff owner who I thought didn’t like me. Even better if the booze comes in an unmarked bottle of questionable origin, perhaps made by a distant relative named Giovanni or Sofia just outside Florence and smuggled back in a suitcase.At my favorite modern Italian-American joint, Frankies 457 Spuntino in Brooklyn, owners Frank Falcinelli and Frank Castronovo used to make their own brew out of Meyer lemons and the gnarled peel of Buddha’s hand. If I was lucky, one of the Franks would bring out a frosty reused wine bottle filled with the house-made stuff—just sweet enough with a smack of acidity, like chewing a handful of Lemonheads—and keep pouring until all the little troubles of the week faded away. But at the end of the day, it’s not so much about what it tastes like. It’s about an oddball time-honored tradition that will, on my table, never go out of style.Andrew Knowlton is the editor at large of Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceBrooklynRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Andrew Knowlton"]}