{"id": "a8a5207d971211397d22795cdac390a0", "url": "https://www.bonappetit.com/recipe/vegan-pasta-alla-vodka", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Vegan Pasta alla Vodka (Sorta) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegan Pasta alla Vodka (Sorta)By Sarah JampelMarch 15, 20224.3(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve Sheridan and Molly LongwellEmailPinterestPrintEmailPinterestPrintIf I were going to nominate one nut as vegan MVP, it would be the mighty cashew (sorry, almond). When soaked in hot water and blended at high speed, cashews lend their fattiness to make luxurious, creamy sauces that—thanks to the nut’s neutral flavor—blend into the background in the best way possible. Here that cashew cream is married with tomato (a combination of whole canned tomatoes and paste) for a fruity, tangy sauce reminiscent of pasta alla vodka. Just as in the original, the alcohol brightens the rich dish and enhances the tomatoes’ fruitiness.The key to making the smoothest sauce possible is to blend the soaked cashews with water on their own before adding the tomato mixture. While it is possible to make this sauce in a food processor, a high-powered blender is going to give you the glossiest, least-grainy sauce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonColander$11 At AmazonDutch Oven$80 At AmazonHeatproof Measuring Cup$18 At AmazonCan Opener$14 At AmazonWooden Spoon$6 At AmazonIngredients4 (very generous) servings¾cup raw cashews¼cup extra-virgin olive oil, plus more for serving1large onion, thinly sliced5garlic cloves, coarsely chopped½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more½tsp. crushed red pepper flakes14.5-oz. tube or ½ cup double-concentrated or regular tomato paste114.5-oz. can whole peeled tomatoes1lb. short, chunky pasta (such as rigatoni, conchiglie, or casarecce)¼cup vodkaTorn basil leaves (for serving)Vegan Parmesan (for serving; optional)Freshly ground black pepper1lemon, sliced into wedgesPreparationStep 1Place ¾ cup raw cashews in a blender, preferably high-powered. Pour boiling water over to cover and let soak 30 minutes. (If you set the cashews aside and then prep and measure all of the remaining ingredients, they should be ready to go right on time!)Step 2Heat ¼ cup extra-virgin olive oil in a large Dutch oven or other heavy pot over medium heat. Add 1 large onion, thinly sliced, and 5 garlic cloves, coarsely chopped, season with kosher salt, and cook, stirring often, until softened and onion is translucent, 5–7 minutes. Add ½ tsp. crushed red pepper flakes and cook, stirring to release flavor, 30 seconds. Add one 4.5-oz. tube or ½ cup double-concentrated or regular tomato paste and cook, stirring often and reducing heat if needed, until it starts to stick to bottom of pot but is still bright red in color, 3–4 minutes. Add one 14.5-oz. can whole peeled tomatoes and cook, stirring occasionally and crushing tomatoes with spoon, until thickened slightly and starting to stick to bottom of pot, about 5 minutes.Step 3When tomato sauce is nearly done, cook 1 lb. short, chunky pasta (such as rigatoni, conchiglie, or casarecce) in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1½ cups pasta cooking liquid.Step 4Drain cashews and return to blender. Add 1 cup fresh water and blend on high until smooth and creamy (you can’t overblend, so really go for it!). Add tomato sauce and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and blend until smooth. Return sauce to pot and set over low heat to keep warm.Step 5When pasta is about 2 minutes from being done, stir ¼ cup vodka into sauce. Increase heat to medium-low and bring to a simmer; cook off alcohol, about 1 minute.Step 6Transfer pasta to sauce (it’s okay if some water clings to the noodles) and add ½ cup reserved pasta cooking liquid. Reduce heat to low and cook, stirring and adding more pasta cooking liquid ¼ cup at a time as needed, until pasta is coated in sauce, about 2 minutes; season with salt. (Note: This pasta stiffens as it sits. To refresh the pot for a second—or third—helping, stir in more reserved pasta cooking liquid to loosen.)Step 7Divide pasta among bowls and top with torn basil leaves and vegan Parmesan (if using). Season with freshly ground black pepper and drizzle more oil over. Serve with lemon wedges for squeezing over.How would you rate Vegan Pasta alla Vodka (Sorta)?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleDelicious and very creamy! cashew cream is the best!!AnonymousLos Angeles 3/24/2022But but but not am 73 and still not vegan or gluten free. And feel grateful!Tonie OsborneNashville Tn3/18/2022Explore Bon AppétitDinnerMainVeganDairy-FreeHealthyishVegetarianSimmerPasta & NoodlesPastaVodkaAlcohol & Other DrinksCanned TomatoTomatoVegetableNutCashewRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Sarah Jampel"]}