{"id": "a8a920edbff8c7913a86d45130c1f545", "url": "https://www.bonappetit.com/story/best-vegan-protein-powder", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "What's the Best Vegan Protein Powder, and by \"Best,\" I Mean Tastiest? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhat Is the Best Vegan Protein Powder, and by “Best,” I Mean Tastiest?Eleven tubs of protein and one broken blender later, I have answers.By Amanda ShapiroMarch 8, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.My search for the best vegan protein powder was born out of a deep, existential question I couldn’t, ahem, shake: Do any plant-based protein powders actually taste good?You see, I am a food person who also loves to lift weights. And while there’s a lot of dubious bro-science about weightlifting and nutrition, one thing we seem to agree on is that increasing your protein intake (to around 0.8 to 1 gram per pound of body weight per day) is helpful for…the gainz. That’s kind of a lot when you consider that even protein-packed foods like chicken and fish only have around 30 grams per serving. Then there’s the convenience issue: Who has time to grill a steak after every workout?Let’s get huge.\nWhey, which contains dairy (but little to no lactose), has long dominated the protein powder market—and my kitchen. It’s popular because it has a clean, neutral flavor, and it mixes easily in milk and water. But in recent years, I’ve watched as vegan protein powders have surged onto shelves.“This stuff isn’t just for those who follow a vegan diet,” says Taylor Wolfram, MS, LDN, a registered dietitian nutritionist. “If someone’s body isn’t tolerating animal-based protein powders, trying out vegan options is a great idea. Also folks with animal welfare and environmental concerns will want to consider vegan protein powder as it’s much kinder to animals and has a gentler impact on the environment.”Vegan protein powder can be made from virtually any legume, seed, or grain, from hemp seeds to brown rice to watermelon seeds. According to Wolfram, “vegan protein powders based on legumes like soy and pea protein powder” are going to provide the most high-quality, bioavailable protein. She warns that, like any protein powder, vegan options may contain added sugar alcohols like erythritol and xylitol, which can give some people digestive issues.The one time I’d tried vegan protein powder it was from a health food co-op, and it was truly nauseating in flavor, texture, and appearance. But I wondered if, in this new era of plant-based innovation, we’d finally gotten vegan protein powder right. I was down to give it another shot, but only if I could find the best vegan protein powder out there, and by “best” I mean most delicious. (And if you’re really on that health kick, also check out our review of the best greens powders you’ll actually want to drink.)So my quest began. I lined my countertop with tubs of vanilla protein or as close to vanilla as I could get (isn’t that what they call the scientific method?), put my ancient Magic Bullet to the test,* and landed on 11 brands ranging from totally palatable to truly the best tasting plant-based protein powder I’ve tried.*I’m sad to report that the Magic Bullet subsequently died, but it had had a good life, and I replaced it with the Nutribullet Pro 1000, which, editor, I would love to review at a later date.Future Kind Organic Vegan Protein Powder This was a great entry-level vegan protein. Mild and meek and barely sweet, it embodies “vanilla” in more ways than one. One 85-calorie scoop delivers 20 grams of protein made from the humble pea. It’s sweetened with stevia but doesn’t have any of that bitter, cloying aftertaste. This was the only protein powder that mixed up great in a shaker bottle, no blender required. Did it thrill me? No. But I can get my thrills in places other than a tub of organic vegan protein.Future Kind Vegan Protein Powder$45 at Future Kind$54.99 $49.99 at AmazonKOS Organic Plant Protein Full disclosure, I did not love this USDA-certified organic protein powder, but my living companion polished it right off (he adds about half a jar of peanut butter and actual candy bars to his post-workout protein shakes, so the powder is pretty incidental). KOS is one of those Instagram brands that popped up so many times on my feed that I finally gave in and bought a tub. The branding is cute, I will say that. The taste, however, was stevia-sour on the front end and vegetal on the back, which makes sense given that it has a farmers market’s worth of produce in powdered form, including shiitake mushrooms and tomato. This might also be why it’s got a bit of a sludgy bottom when mixed with water or milk alone. Each serving has 150 calories and 20 grams of complete protein from flaxseed, quinoa, pumpkin seed, chia seed, and organic pea protein.KOS Organic Plant Based Protein Powder$45 at Amazon (39.15 oz)$20 at Target (13.05 oz)About Time Vegan Protein I’d used About Time’s whey protein powder ages ago and was excited to see that it had three vegan flavors now, all of which use a blend of pea, brown rice, and pumpkin seed protein and include a full panel of BCAAs. Stevia is the only sweetener, and there are 122 calories and 22 grams of protein in each scoop. The vanilla flavor mixed perfectly into almond milk and had a clean, neutral taste. When I stirred it into cooked oatmeal (a thing I do a lot), it incorporated nicely without clumping.About Time Vanilla Protein Supplement$39.99 at Amazon$40 at GNCGarden of Life Raw Organic Protein This is one of those proteins I’ve been seeing in health food stores for years, and I will say it fully commits to its brand. And if ~health~ is your personal brand, this is the powder for you. There’s a farmer on the packaging! And carrots! And grapes? Also this one is made from an organic plant formula, non-GMO, and raw. (I went down a rabbit hole trying to figure out why other vegan proteins were not raw and emerged confused, but do with that info what you will.) Each scoop has 130 calories and 22 grams of protein, and no, there are actually not carrots or grapes in here, but there are literally 14 protein sources, ranging from pea protein to millet sprout to adzuki bean to something called “cracked wall chlorella,” which I assume is superior to normal chlorella. Sweetness comes in the form of erythritol and stevia. Upon first sip, I thought, This tastes raw and like dirt, so there’s truth in advertising, I guess.Garden of Life Raw Organic Protein Vanilla Powder$34 at Amazon$34 at Thrive MarketPlantFusion Complete Protein This protein powder is SO FINE, and I’m not talking about looks. I’m talking about texture, baby. If I didn’t have the ingredients list in front of me, I’d swear it was made from the sands of Dune. It also tastes really good, with a creamy, rich mouthfeel and a decent amount of sweetness from a combo of stevia, monk fruit, lucuma, and yacon powders–fancy! Pea protein is the first ingredient, but there’s also quinoa, amaranth, artichoke, algae, and branch-chain amino acids, a.k.a. BCAAs (good for muscle growth). Their powers combine to provide 21 grams of protein, 120 calories, and just a liiiittle bit of a weird aftertaste. Because it’s SO FINE, there was some residue left in the bottom of the blender, but nothing too bothersome.PlantFusion Vanilla Protein Powder$40 at Amazon$51 at TargetOrgain Organic ProteinOrgain is one of the more affordable vegan proteins on the market. It is made from a protein blend of pea, brown rice, and chia and has 21 grams of protein per each 150 calorie serving. Although it’s sweetened with erythritol, a sugar alcohol, it’s got more calories and carbs than most other protein powders. It also has a surprisingly great flavor, even with water alone. It mixes up silky smooth and just thick enough, like a glass of vanilla soy milk, with no weird vegetal aftertaste. This one is the budget pick for sure.Orgain Organic Vanilla Protein Powder$27 at Amazon$32 at OrgainNo Cow Protein Powder In its silver metallic tub with its fancy metal scooper, No Cow tastes as expensive as it looks. The yellowish tint made me think I’d be getting eggy French vanilla vibes, but the flavor was balanced and not too sweet. Made from pea and brown rice protein as well as stevia and erythritol, each 130-calorie scoop of No Cow has a protein content of 22 grams. This one will mix into anything and basically disappear, which is exactly what you want from a protein powder sometimes.No Cow Vanilla Protein Powder$40 at No Cow$40 at AmazonVega Sport Premium Protein This is the Old Spice of protein powders, marketed to manly men who Lift Heavy and Eat Clean and Consume an Unholy Amount of Protein. When I opened the tub, the powder clung to the lid like it was magnetized, which was kind of creepy but also cool, like maybe you’d build muscle and become part superhero if you used it. Made from pea, pumpkin seed, sunflower seed, and alfalfa, it offers 30 big boy grams of protein in each 160-calorie scoop. Yes, the scooper is huge. It mixes up to an impossibly smooth and rich beverage, like an aged scotch or a vintage Pinot, if those things were milkshakes. Sweetened with stevia, it’s a classy choice for classy dudes…and me.Vega Sport Vanilla Protein Powder$40 at Amazon$55 at VegaBowmar Nutrition Vegan Protein Bowmar has six vegan flavors(!) but for some reason they passed on vanilla, so I went with Cookies & Cream, which tasted so incredible I wondered if maybe I was just sick of vanilla. One scoop has 100 calories and 20 grams of protein from peas as well as pumpkin, sunflower, and watermelon seeds. If that sounds gritty, it’s not. This one mixes well with just milk, retaining some pleasant chocolate cookie crumbles throughout. It is sweetened with sucralose, so if you’re not about artificial sweeteners, walk on by.Bowmar Cookies and Cream Vegan Protein Powder$50 at Campus ProteinOWYN Plant Protein Powder OWYN, which like many of the other options on this list is gluten-free, dairy-free, and soy-free, stands for Only What You Need. If what you need is a delicious egg cream–like beverage that happens to have 140 calories and 20 grams of pea, pumpkin, and chia protein, you’ll agree. You could quibble about the 4 grams of cane sugar, but maybe it’s canceled out by the “Superfood & Greens” blend of broccoli, kale, and spinach? I’ll let you do your own math, but the flavor was rich and creamy, with just a slightly chalky texture when mixed with almond milk alone. Add a frozen banana, and you’ve got a truly decadent smoothie.OWYN Vanilla Protein Powder$26 at Amazon$36 at WalmartBeam Vegan Protein I found out about Beam through an Instagram wellness influencer, and that makes sense to me because Beam is the “that girl” of vegan protein supplements, with its sleek packaging and quirky flavor lineup (also no vanilla). I wanted to hate it, but instead I loved it more than I reasonably should have. If the limited-edition Birthday Cake flavor is available (it comes and goes), buy it immediately. But Cinnamon Cereal is a close second; it tastes like cereal milk and has zero aftertaste despite blending pea, pumpkin seed, and mung bean protein with apple fiber, blueberry fiber, and red algae thrown in for good measure. One scoop is 100 calories and 20 grams of protein, and the only downside is the sucralose—artificial, but so, so good.Beam Cinnamon Cereal Protein Powder$50 at BeamExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-08", "author": ["Condé Nast", "Amanda Shapiro"]}