{"id": "a8a95b492567352bedcaf7ccedec34b0", "url": "https://www.bonappetit.com/recipe/ham-and-cheese-feuillete", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "Ham and Cheese Feuilleté Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHam and Cheese FeuilletéBy Martha StewartDecember 3, 20185.0(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThis recipe is one of our favorites from Martha Stewart’s Entertaining, our December 2018 Cookbook Club pick. These are the perfect cocktail party appetizer, but you can also cut it into larger portions and serve with a simple side salad for a satisfying yet light meal.Reprinted with permission from Entertaining by Martha Stewart, copyright © 1982. Published by Clarkson Potter Publishers, an imprint of Penguin Random House LLC.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDessert Person$16 At AmazonIngredientsMakes 60 pieces214–17-oz. packages puff pastry, thawed overnight in refrigeratorAll-purpose flour (for surface)¼cup Dijon mustard, plus more for serving8oz. cooked ham, thinly sliced4oz. Swiss cheese, thinly sliced1large egg1tsp. heavy creamPreparationStep 1Roll out 1 package of puff pastry on a floured surface to a 16x12\" rectangle. Transfer to a parchment-lined rimmed baking sheet and chill while you roll out remaining sheet of pastry. Transfer to another parchment-lined rimmed baking sheet and chill both sheets of pastry until cold, about 15 minutes.Step 2Transfer parchment with pastry to a clean surface. Spread ¼ cup mustard evenly over 1 sheet of pastry, leaving a ½\" border around the edges. Layer ham, then cheese over mustard. Fold border of pastry up over edge of filling. Brush edges lightly with water. Arrange remaining sheet of pastry on top, then trim edges with kitchen shears or a sharp knife so top layer fits over bottom with no overhang. Crimp edges with a fork. Using parchment, slide pastry back onto baking sheet. Chill, uncovered, at least 30 minutes.Step 3Preheat oven to 400°. Lightly beat egg and cream in a small bowl to blend. Brush egg wash evenly over puff pastry. Cut thin slits in a decorative pattern into top of pastry to allow steam to escape. Bake feuilleté, rotating pan halfway through, until puffed and deep golden brown, 30–35 minutes. Let cool slightly before cutting into 1½\" squares. Serve warm with additional mustard alongside.Step 4Do Ahead: Feuilleté can be assembled 12 hours ahead. Cover with plastic wrap and keep chilled.How would you rate Ham and Cheese Feuilleté?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleWhy does the recipe disappear seconds after I login?Anonymous2/17/2022Good recipe. We were just a small party (big surprise that) so I just used a part sheet and folded it over rather more filling than was specified.. There were none left.Rick BChatham, ON12/28/2021I just made these again and they didn't turn out as well as my first time.   Make sure you really let the dough defrost overnight and double up on the ham. My husband said he couldn't really taste the ham and cheese inside. Otherwise, I will continue to make these for parties. Diane OBerkeley Heights, NJ12/19/2021I made these for a large thanksgiving gathering and they were a huge hit!! Everyone kept saying how good they were and ate them all up.  The recipe was super easy to follow and make and I will be making these for parties from now on.  Thanks Martha!!Diane OBerkeley Heights, NJ11/26/2021Made these for a NYE party and they were definitely the star of the show. So simple and delicious. AnonymousBrooklyn, NY1/5/2020This was super easy and ended up being a hit at the NYE party! I also was curious about the quantity of puff pastry -- I don't know if this is technically the right way, but in order to get the 12\" x 16\" rectangles, I did need two packages of puff pastry with two sheets in each one. I kind of connected the puff pastry sheets on the short side and made a seam by pinching the edges together and it worked fine, especially since you are cutting the feuillete anyway. Super delicious and looked impressive.AnonymousDetroit, MI1/1/2020This looks fabulous and I want to make it but I’m confused by the fact that the recipe calls for two packages of puff pastry. They all come with two sheets per package so are you supposed to use two sheets on the bottom and two on top or one sheet each? Anonymous12/25/2019Brought this to game night with friends, it was a hit. Super easy to make. Only change I might make in the future is doubling the amount of ham to balance out the puff pastry/filling ratio.AnonymousMinneapolis, MN12/22/2019Wow!  this recipe was amazing!  can't wait to make it again! Anonymous11/25/2019I would make this recipe over and over again, and experiment with different fillings. It’s easy but it looks like a showstopper! It was a huge hit for a holiday gathering. AnonymousNashville 1/4/2019Explore Bon AppétitSavory Pie & TartFrenchEuropeanHamMeatSwiss CheeseCheesePuff PastryOther IngredientsStarterSnackChristmasNew Year'sDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-03", "author": ["Condé Nast", "Martha Stewart"]}