{"id": "a8aad7bc3b20d9af71f76f5ce7d7a183", "url": "https://www.bonappetit.com/story/green-onions-grow-kit", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "Get This Grow Kit, Never Run Out of Scallions Again | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingGet This Grow Kit, Never Run Out of Scallions AgainGreen onions for not-so-green thumbs.By Kate RaphaelApril 30, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!When it comes to growing edible plants, my track record isn’t the best. In the last year alone I’ve watched basil and rosemary wilt to death in front of my eyes. Then, my roommates and I naively planted celery in our lead-leached soil only to peer out the window and witness rabbits gobbling up the stalks. Finally, I lost my long-struggling tomato seedling and knew it was time to put the backyard garden I’d dreamed about to bed.Still, I yearned for fresh herbs and alliums (that wouldn’t wither in my fridge only days after bringing them home from the supermarket) to zhuzh up my tired pandemic meals. As fate would have it, the Instagram algorithm delivered in the form of this Hamama green onion grow kit. I was already a scallion devotee, and the setup seemed intuitive—hard to botch, even. Maybe, I figured, it could make a proud plant parent out of this failed gardener.You might be wondering, Why order a kit to grow green onions when a mason jar on the windowsill seems to do the trick for everyone else? Well, listed on my résumé of horticultural failures is that one too: In a glass jar, the water grew stinky in a day, the weary onions drooped dramatically, and I knocked the jar from the window’s ledge more than once, coating the floor and my feet with days-old onion water.As soon as I unboxed my Hamama kit, I was delighted by the straightforward instructions and ease of setup: The whole thing came together in five minutes. I added water to the tray’s fill line and then submerged the included coconut fiber grow mat—a sort of porous pad that optimizes the level of moisture and gives the scallion roots something to cling to. I grabbed several bunches of H-Mart scallions, chopped the green ends up to save for a batch of scallion pancakes, and slotted their white roots into the Hamama tray. I left the apparatus on the counter, where I, true to form, forgot the scallions’ very existence. Almost overnight (okay, fine, after three days), tubular green leaves rocketed up from the bulbs and tapered into delicate, fine tips. One week after planting, they were lush, verdant, and ready to “harvest.”My apartment-mates and I cooked lavishly with our haul: garnishing tacos and omelets, sautéing and blistering them in oil, and chopping them into salads with herby green goddess dressing. The Hamama kit also allows me to regrow onions multiple times from the same roots, so I’m rewarded with a constant supply of zippy flavor and the culinary freedom to experiment with the versatile scallion. Has the grow kit reinvigorated my dream of a backyard veggie patch? Not yet, but these thumbs are getting greener by the day.Green Onion Grow Kit$49 at HAMAMA$49 at Amazon$49 $39 at The GrommetExplore Bon AppétitShoppingHealthyishHealthyish Loves ItRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-30", "author": ["Condé Nast", "Kate Raphael"]}