{"id": "a8bd3462fc82868d10f9a0e728eb167e", "url": "https://www.bonappetit.com/recipe/salted-caramel-apple-cookies", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Caramel Apple Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalted Caramel Apple CookiesBy Kelly JankeOctober 1, 20214.3(189)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Jessie YuChenEmailPinterestPrintEmailPinterestPrintImagine a caramel apple and a snickerdoodle got together and created some seriously delicious magic and you'll end up with these cookies that we couldn't get enough of during recipe testing. While caramel apples are more fun to look at than actually eat, becoming a sticky mess after a bite or two, these cookies combine similar textures and flavors in an easy-to-eat package. Cooking the apple caramel to the right consistency is key here. You want to cook down the caramel and grated apple mixture until all the liquid from the apples has evaporated, leaving behind a tacky and pliable (but not wet) caramel that tastes like a mug of warm spiced cider on a crisp fall day. The cooled caramel gets gently swirled into cookie dough and topped with flaky sea salt for swirls of deep apple flavor in every salty-sweet bite. The best part about this recipe is you can use any apple you’d like—it’s a fantastic way to make the most of apple-picking season.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium #40 Cookie Scoop$16 At AmazonBox Grater$13 At AmazonGet It Right Spatula$13 At BA MarketKitchen Towels$22 At AmazonWire Rack$23 At BA MarketIngredientsMakes about 24Apple caramel3medium apples (about 1½ lb. total), peeled, cored1¼cups (250 g) granulated sugar⅛tsp. cream of tartar2Tbsp. chilled unsalted butter1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1tsp. ground cinnamon½tsp. ground cardamom¼tsp. freshly grated nutmegDough and assembly3½cups (438 g) all-purpose flour1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt1tsp. baking soda1tsp. cream of tartar1cup (2 sticks) chilled unsalted butter, cut into small pieces1cup (200 g) granulated sugar½cup (packed; 100 g) dark brown sugar2large eggs1Tbsp. vanilla extractFlaky sea saltPreparationApple caramelStep 1Grate apples on the large holes of a box grater or in a food processor with the grater attachment. Transfer grated apples to a clean kitchen towel and squeeze over a medium bowl to extract all the juice possible. Measure out ¼ cup apple juice and set aside (save any leftover apple juice for another use). Set grated apples aside (you should have about 2½ cups).Step 2Bring sugar, cream of tartar, and reserved ¼ cup apple juice to a rapid boil in a large saucepan over medium heat, stirring just to dissolve sugar. Cook, without stirring but swirling pan often, until bubbles slow and caramel turns a deep amber color, 5–7 minutes. Remove caramel from heat and stir in butter, salt, cinnamon, cardamom, and nutmeg.Step 3Set pan over medium-low heat and add reserved grated apples, stirring quickly to combine (don’t worry if the caramel mixture looks like it’s seizing at first). Cook apple caramel, stirring constantly, until the liquid from the apples has evaporated and the bubbles noticeably slow down, 9–11 minutes. (The caramel should be sticky and clump together as you stir). Scrape apple caramel onto a parchment-lined baking sheet and spread out in an even layer; let cool 30 minutes. Set ¼ cup apple caramel aside for topping cookies.Dough and assembly  Step 4Place racks in upper and lower thirds of oven and preheat to 375°. Whisk flour, salt, baking soda, and cream of tartar in a medium bowl to combine.Step 5Beat butter, granulated sugar, and brown sugar in a stand mixer fitted with the paddle attachment, starting on low speed, then increasing speed to medium, until combined, about 2 minutes total. Add eggs one at a time, incorporating thoroughly before adding the next, then add vanilla. Reduce speed to low; add dry ingredients and mix just until combined. Add apple caramel and pulse mixer two or three times to swirl caramel throughout dough or fold in caramel using a sturdy rubber spatula (take care not to overmix or else you’ll lose the swirled caramel effect as the cookies bake).Step 6Using a #20 ice cream scoop (about 3 Tbsp.), portion out 16 balls and divide between 2 parchment-lined baking sheets, spacing at least 2\" apart (you will have dough left over). Top each cookie with a few small pieces of reserved apple caramel and sprinkle with sea salt.Step 7Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until golden brown at the edges, 13–16 minutes. Let cookies cool 5 minutes on baking sheets then transfer to a wire rack and let cool completely. Let 1 baking sheet cool, then repeat process with remaining dough to make 8 more cookies (they may bake slightly faster).Do ahead: Cookies can be made 5 days ahead. Store airtight at room temperature.How would you rate Salted Caramel Apple Cookies?Leave a ReviewTell us what you thinkReviews (78)Back to TopTriangleThese were fantastic and unique.  I grated the apples by hand, by leaving them whole and holding the core, it was quick.  I loved the texture of the apple \"jam\", especially the bit that goes on top of the cookie.  It was sort of chewy, but completely delicious.  \nWhen the dough was ready, I only baked off one cookie, the rest I scooped and kept in the fridge to bake the next day.  This ended up being great for me, because the first cookie didn't spread much.  I went back and slightly flattened the rest of my cookie scoops and that helped them bake more evenly.  I do understand what people mean by the plain part of the cookie tasting flat.  This seemed odd, since the recipe has a good amount of salt in it, but I went ahead and tested another cookie the second day with fine salt sprinkled on top, in addition to the flake sea salt that is called for.  This is just what the cookie needed and the rest of the batch was incredible.Anonymous2/13/2022Think it would work with other fruit and complimentary juice? I'm specifically thinking cherry with a dark chocolate cookie and pistachios.....Jocelyn12/17/2021These are pretty good, I would totally make them again. Before I scoop my second batch I’m going to mix more of the caramel into the cookie. Definitely recommend checking out Kelly Janke’s Instagram highlight to make sure the caramel turns out properly. The caramel cooking time was pretty spot on for my stove. AnonymousSan Francisco12/6/2021Loved the cookies, though I used only 100g of sugar in the dough which is only 1/3 of the original amount, as it seemed to be way too much and I always cut down on sweetness in recipes from the US. I would also maybe add some lemon juice or apple vinegar to the apple caramel to provide a bit of a tang next time.GretaLithuania12/4/2021Great cookie!! I used 1.5 teaspoon of baking powder, instead of soda and COT in cookie dough and it turned out fine. Also, as most folks recommend, MAKE 2x or 3x the amount of caramel in recipe. The caramel is time consuming so make extra and use for another batch later, ice cream, etc... !D ThomasLondon11/29/2021These were a bit dry - more like a scone than a cookie. The sea salt flakes on top were key. I also added spices to the cookie dough as others suggested - cinnamon and ginger.Lindsay BCharlotte11/25/2021Came out BOMB!!!!! took me longer to caramalize the sugar and then cook the apples. Came out like I bought store bought cookies. Requires time and effort but totally worth it. I would make extra Caramel Apple because it's so good and would be great to add as a topping for ice cream. KashfiaRaleigh, NC11/23/2021Thanks to the other reviewers I added the spices in the cookie dough too.  Caramel came out fine for me. I went on time (10 minutes after the apples were in) and didn't wait for it to form long strands.  I'm going to make them again, but this time I'll double the apple caramel part. I wish I had more to put on as the topping before cooking. It's like an adult snickerdoodle.S ZeiglerAtlanta, GA11/22/2021Somewhat time intensive but worth it. Nancy BNY11/10/2021So the verdict is in....anyone who tried them said they were on the top 5 of the best ever cookies they had ever had.  The extra work is worth it.  ScottsRoseOntario Canada11/1/2021These are pretty good, nice change of pace from \"usual\" cookie recipes. I didn't have cream of tartar, so I used 2 tsp. baking powder and 1/2 tsp baking soda.\nIf I were to make again, I would add some spices to the dough (I'd love some ginger in this) and cut down on the sugar. Obviously, the caramel has a lot of sweetness, and I thought the dough didn't need as much. Be sure to use tart apples (or add lemon juice), to help cut some of the sweetness. These are definitely better made the day of. It says you can make 5 days ahead, but they tasted stale and cakey less than 12 hours after baking. The moisture from the caramel gets into the rest of the cookie and ruins the nice crispy outside/soft inside texture. \nThe cookies are fine, but I would definitely make the caramel again just by itself - it would be so good on yogurt or ice cream or by itself with a spoon...EmilyNew Jersey10/30/2021Decided to try this recipe out for a cookie exchange and they were a HUGE hit! Will definitely be adding this recipe to my usual cookies and making them again!!Katie K.Minneapolis, MN10/27/2021It would be great if this recipe was in grams (I love my kitchen scale) and if there was a temperature given for when to remove the caramel!MishyPanicSeattle, WA10/26/2021Too much work! My apple caramel took closer to 45 minutes and still didn't look quite right before I gave up and pulled it. I was following along with Kelly's Instagram story also and it still didn't match up. The batter was very dry and hard to mix. Cookies are good but nothing special. I would probably only try it again after buying store-bought caramel like another reviewer suggested.LaurenMoses Lake, Washington10/26/2021I was daunted by the caramel issue so tried a hack -- I bought a jar of salted caramel sauce (T Joes) and chilled it, then mixed in the grated apple.  This yielded a very thick mixture that swirled nicely through the batter.  I also put a little on top of each cookie.  They came out great -- no idea how they compare to the original, but this took little time and effort and yielded a very good caramel apple cookie!Amy C10/25/2021Explore Bon AppétitCookieDessertCaramelAppleFruitFallRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-01", "author": ["Condé Nast", "Kelly Janke"]}