{"id": "a8c0fbbe324a6be9bc40e5ac59903f10", "url": "https://www.bonappetit.com/story/berry-storage-tips", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "How to Store Strawberries, Blueberries, and Blackberries so They Stay Fresher Longer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Store Berries so They Stay Fresher LongerNo more moldy surprises.By Antara Sinha and Alex BeggsJuly 9, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.No one wants to spend their Saturday stalking the farmers market for beautiful berries that are moldy come Monday. These tips on how to store strawberries, blueberries, raspberries, and blackberries will help you to mitigate the madness of quickly perishing produce once and for all. With just a little extra effort up front, you’ll save money, prevent food waste, and keep your berries fresh long enough to enjoy them out of hand or ready to use in berry desserts and treats all season long.Select the best berries from the bunchWhether you’re purchasing them from your farmers market or local grocery store or picking them yourself, selecting the best berries is key to their longevity. Because berries are fragile fruits that are thin-skinned, one bad berry can turn the whole bunch. Pick out and discard any that are already bruised, slimy, or spoiled. If you’re noticing blackberry stains on the clamshell container, or strawberry juices pooling at the bottom of the carton, it’s a good indicator that there are a couple berries past their prime in the mix. Instead, seek out firm, plump, shiny berries. If you’ve already got some squished berries on hand, don’t waste them: Save them for smoothies, make a breezy berry compote to top pancakes, or soak and mash in rum for a tangy, syrupy ice cream topping.Don’t crowd your berries in storageCrowded berries get smushed easily, leading to speedier spoilage. Let your berries breathe by storing them in a wide, flat container lined with paper towels once you bring them home. Cover with a loose-fitting lid to let excess moisture (a breeding ground for bacteria) escape, or use produce-specific storage containers that promote airflow to help keep those summer blueberries fresher longer. Another pro tip: Avoid storing berries in the coldest corner zones of your fridge where they’re at risk of getting frostbitten. Instead, store them front and center where the temperature is less frigid. (This also helps to keep them top of mind, ensuring you remember to enjoy them sooner, rather than later.)OXO Produce Keeper$14 $13 at AmazonGive your berries a spa treatmentWashing berries before use may seem counterintuitive—we know that moisture and dampness are the enemy when storing produce—but giving them a quick bath in diluted white vinegar (3 cups water to 2 Tbsp. vinegar) as soon as you’re home from the market will kill any existing mold spores that would make them go bad faster. Rinse thoroughly to remove any lingering vinegar taste, then dry the berries gently to avoid bruising. A careful swish through a salad spinner lined with paper towels helps to speedily wick away moisture.Freeze them for laterEven when you know how to store strawberries, blueberries, and blackberries properly in the fridge, you still might find yourself overwhelmed by more fruit than you can possibly use. If you’re blessed with an abundance of peak-season berries that you absolutely know you won’t be able to enjoy before they spoil, stash them in the freezer to enjoy year-round. All the same rules apply: Select only the best berries, toss out the spoiled ones, rinse them in diluted vinegar, and carefully and thoroughly pat dry. (For strawberries, you’ll want to go the extra step and hull them, for ease of use later.) Spread out your berries into a single layer on a baking sheet and freeze until solid. They’re then ready to store in freezer bags for six months to a year—just be careful to remove as much air as possible from the bags after each use to prevent freezer burn. Use your frozen summer bounty in baked goods like muffins or quick breads, smoothies, or homemade jams and preserves.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-09", "author": ["Condé Nast", "Antara Sinha", "Alex Beggs"]}