{"id": "a8c260d98811ec5e627382664a7dea41", "url": "https://www.bonappetit.com/story/what-are-heirloom-tomatoes", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "What Are Heirloom Tomatoes, Anyway? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Are Heirloom Tomatoes, Anyway?Those colorful, strangely-shaped tomatoes are cool, sure. But what makes them the way that they are?By Alex DelanyJuly 25, 2018FacebookTwitterEmailLaura MurrayFacebookTwitterEmailBy this point, we all know that heirloom tomatoes are a thing. We’ve seen them at farmers markets and grocery stores, on restaurant menus and at that dinner party your friend just hosted. We know that sometimes they’re weirdly shaped and colorful and probably...better tasting than regular tomatoes?But are they really? And if so, why? What are heirloom tomatoes, anyway? These are the questions we ask ourselves when July gives way to August, and tomato season starts coming in hot.Despite the name, you probably won't find heirloom tomatoes at an antique store, or in your grandmother’s attic. (Well, you might, but that would be pretty weird.) The tomatoes themselves are not dusty fruits passed down from generation to generation, like old high school yearbooks and silver lockets. The tomato seeds though? Yeah, those are.The seeds are what make an heirloom tomato an heirloom tomato. They are passed down from season to season, taken by the farmers from the tomato plants that produced the best fruit. This process allows farmers to select for certain desirable traits like juiciness, size, shape, or color. Heirloom tomatoes are also often open-pollinated, which means that they are pollinated naturally, by birds, insects, wind, or human hands. No weird science-y genetic modification here.Heirloom tomatoes belong on a hoagie.\nAlex LauBasically, heirloom tomatoes have potential for greatness because their DNA hasn't been manipulated in the same way that the genetics of a lot of mass market 'maters are. Most tomatoes that we find in the grocery store have been bred to look like cartoon tomatoes: plump, red, round, and easy to store in the produce section of the supermarket. These tomatoes were created for consistency, but not necessarily flavor—good for people who sell tomatoes, not the people who buy them. We're talking about those watery, mealy, flavorless guys that get sliced up and put on fast food burgers. Hard pass.We love heirloom tomatoes for their idiosyncratic qualities. They often have have colors, textures, sizes, and flavors that vary from species to species, in the same way that apple varieties do. A Black Krim will look and taste different from an Azoychka. And that makes tomato salads all the more interesting. A classic Caprese made with a bunch of different heirlooms becomes a wild display of color and flavor.But all that said, just because a tomato is being sold with the word \"heirloom\" attached to it doesn't mean it's going to be delicious. Plenty of farms, especially big ones, market their tomatoes this way to as a cover for what are actually genetically modified seeds and/or gnarly growing practices, cashing in on the heirloom hype while selling you an inferior product that might have travelled a thousands of miles to get to you. It's an unregulated designation, like \"natural,\" so it's kind of a buyer beware sort of situation out there—calling a tomato an \"heirloom\" doesn't automatically mean that the tomatoes were grown locally, or organically, or in any way that you might associate with groovy, high-quality produce. And even the best local farms sometimes produce \"meh\" tomatoes, no matter how good their seed stock, farming practices, or intentions might be. The only way to make sure you’re getting a beautiful, delicious heirloom tomato is to buy them from someone you trust.That’s why we like buying our tomatoes at a farmers market. We can ask about the variety and how they’re grown, and often taste a sample to ensure that we're getting what we want. And you know what we want: a bright, colorful, juicy, flavorful, rebellious tomato with some history. You know: an heirloom.You're gonna want to eat those tomatoes, not just look at them:Ultimate Caprese SaladReal talk: This is a dish to make when the tomatoes are peaking—at the farmers’ market, you should be able to smell them before you see them. The moment only comes around once a year, so make the most of it (which is to say, do very little with them).View RecipeExplore Bon AppétitBasicallyTomatoSummerSaladRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-25", "author": ["Condé Nast", "Alex Delany"]}