{"id": "a8cc8d763a3874ae6bafad02f1d56598", "url": "https://www.bonappetit.com/story/malai-ice-cream", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Malai Ice Cream Is My Reward for Washing All the Dirty Dishes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMalai Ice Cream Is My Reward for Washing All the Dirty DishesI can’t get enough of the South Asian–inspired flavors.By Chris CristianoAugust 13, 2020FacebookTwitterEmailPhoto by Morgan Ione PhotographyFacebookTwitterEmailThis is Highly Recommend,a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The past few months have taught me a lot about using my freezer. I learned to slice and freeze fresh sourdough, divide ground beef into single-serving freezer packs, stash an emergency DiGiorno pizza, and keep stacks on stacks of Caramelo tortillas. But the most important thing I learned about my cold storage is ALWAYS LEAVE ROOM FOR MALAI ICE CREAM.Pooja Bavishi, Malai’s founder and CEO, creates incredible ice cream flavors by combining South Asian ingredients and spices with a creamy eggless base made from fresh New York dairy. Malai’s ice creams are churned with very little air, which results in a light, gelato-like texture. It perfectly contrasts all the mix-ins like ribbons of mango purée for the Mango & Cream and chunks of homemade baklava for the, well, Baklava.I’m lucky enough to live around the corner from Malai’s signature Brooklyn scoop shop, but that hasn’t stopped me from packing my freezer full of its colorful cartons. (Pro tip: You can also buy Malai at grocery stores along the coasts and online via Goldbelly.) Knowing I have a cold pint of peppery Masala Chai or Coconut Tahini with Date Caramel is enough to get me through washing an endless pile of dirty dishes every night. Now, just where are all the clean spoons?Go there: Malai Ice Cream & CakesExplore Bon AppétitShoppingIce CreamRead MorecultureI Make My Own Ice Cream, But I Fully Endorse Jeni’s PintsBy Sohla El-WayllyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-13", "author": ["Condé Nast", "Chris Cristiano"]}