{"id": "a8dc9aef0234c66b19e8d808b0309b8f", "url": "https://www.bonappetit.com/recipe/weve-loaded-up-these-sweet-potatoes-with-some-of-your-favorite-flavors", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "We’ve Loaded Up These Sweet Potatoes with Some of Your Favorite Flavors Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesWe’ve Loaded Up These Sweet Potatoes with Some of Your Favorite FlavorsFacebookPinterestTwitterEmail4 servingsWe’re fans of simple baked sweet potatoes in a multitude of dishes. These get the “loaded potato” treatment with roasted chickpeas, broccoli, and crumbled feta finished with a drizzle of tangy yogurt sauce made with the signature flavor of Cholula® Original Hot Sauce for just enough heat.PrintIngredients4 medium sweet potatoes1 medium head broccoli1 15-ounce can chickpeas4 garlic cloves4 tablespoons olive oil, divided1 teaspoon kosher salt, plus more1/2 cup whole milk Greek yogurt3 tablespoons Cholula® Original Hot Sauce, plus more6 ounces feta cheese, in brine, divided1 lemonRecipe PreparationPreheat oven to 425° and place racks in the upper and lower thirds. Scrub sweet potatoes under running water and poke holes all over with the tip of a paring knife. Wrap each potato tightly in aluminum foil and bake on the upper rack until a knife pierced through the foil slides easily into center of potato, 60–75 minutes.While potatoes are baking, prep your vegetables:\nCut broccoli into ½” florets and transfer to a large rimmed baking sheet (reserve stem for snacking or another use).Drain can of chickpeas into a strainer, rinse under cold water, then shake to remove excess water. Pat dry with paper towels and transfer to sheet tray with broccoli.Smash garlic on cutting board with the flat side of a knife and remove skins. Add to baking sheet.Drizzle broccoli mixture with 3 Tbsp. olive oil and sprinkle with kosher salt. Toss with clean hands to coat, then spread out in an even layer on baking sheet.Roast on lower rack along with sweet potatoes, shaking baking sheet once or twice, until chickpeas are golden and crisp and broccoli is browned, 20–25 minutes. Remove from oven and let cool.Combine yogurt, 3 Tbsp. Cholula Original, half of feta cheese, remaining 1 Tbsp. olive oil, and the roasted garlic from the baking sheet in the jar of a hand blender. Season with salt. [NOTE: This amount of Cholula will give the yogurt sauce a reddish tint.] Cut lemon into 6 wedges, remove seeds, and squeeze 2 wedges into jar with yogurt mixture. Blend until mixture is completely smooth; set aside.When sweet potatoes are tender, remove from oven and let cool slightly, then unwrap foil and discard (watch for hot liquid and steam inside foil). Make long, shallow, lengthwise cuts into tops of each potato. Squeeze sides slightly and press down to expose orange flesh. Let potatoes sit for a few minutes to allow steam to escape.Season potatoes with more salt, then dollop yogurt mixture over flesh.Squeeze two more lemon wedges over broccoli mixture, then spoon mixture over top of potatoes.Crumble remaining feta over broccoli and top with a few more shakes of Cholula Original. Serve with remaining lemon wedges.Recipe by Cholula® Hot SauceRelated VideoWe’ve Loaded Up These Sweet Potatoes with Some of Your Favorite FlavorsReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Cholula", "Hot Sauce"]}