{"id": "a8e7326e15cb0ae59e1289e9c4e50957", "url": "https://www.bonappetit.com/recipe/perfectly-roasted-potatoes", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "Oven Roasted Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPerfect Oven-Roasted PotatoesBy Claire SaffitzDecember 14, 20214.9(80)Read ReviewsTriangleEmailPinterestPrintBen DeweyEmailPinterestPrintEmailPinterestPrintThese oven roasted potatoes have a perfectly browned, crispy outside and a creamy interior, making this foolproof recipe a must-have in every cook’s arsenal. They pair seamlessly with almost any meat or vegetable main, from Brown Butter-Basted Steak to Slow-Roasted Char with Fennel Salad. And there’s a good chance you already have everything you need in your kitchen to make them.The genius steam-then-roast method is what produces perfect spuds every time. Opt for medium-small Yukon Golds (about 2\" wide), which are neither too starchy nor too waxy.If you prefer roasted sweet potatoes, this recipe has you covered, and if you’re looking for a perfectly executed baked potato, head this way. Find even more ways to cook all kinds of potatoes over here.Editor’s note: This recipe was originally published October 9, 2017.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonHeavy-Duty Aluminum Foil$10 At TargetTongs$13 At AmazonFlexible Metal Spatula$9.99 At AmazonIngredients4 servings2pounds medium Yukon Gold potatoes (about 2 inches in diameter)¼cup extra-virgin olive oilKosher salt, freshly ground pepperPreparationStep 1Place a rack in lowest position in oven and preheat to 425°. Halve 2 lb. Yukon Gold potatoes crosswise.→  Here's why yukon golds are our top choice for roasting.Step 2Arrange potatoes, cut side down, on a rimmed baking sheet, spacing evenly apart. Pour in 1½–2 cups water (it needs to cover baking sheet in a thin layer).Step 3Cover baking sheet with a double layer of foil, crimping sides very tightly to seal well. Doing this will trap in steam and prevent water from dribbling out if you tip the sheet.Step 4Bake potatoes until a fork or skewer slides easily through potatoes, 25–30 minutes. The foil will be puffed, but poke through and feel around for a potato to test. Try testing a couple to gauge doneness.Step 5Let potatoes cool about 5 minutes. Crank up oven temperature to 500° (or as high as your oven goes). Use tongs to lift up foil at 1 corner, peeling it back only about 1\". Tip open corner into the sink and pour off water.Step 6Remove foil and drizzle ¼ cup oil over potatoes; season generously with salt and pepper. Let potatoes cool to the point you can handle them, then toss with your hands to coat completely. Arrange cut side down again.Step 7Roast potatoes until tops are golden, bottoms are deeply browned and crisp, and oil around edges is sizzling and, 20–25 minutes.Step 8Let potatoes cool slightly, then use a spatula to unstick them from baking sheet.→  That brown gunk you can never get off of your sheet pans? Here's the easy way to get rid of it.How would you rate Perfect Oven-Roasted Potatoes?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangleI made these tonight to go with milk-braised pork shoulder and they were fantastic!  My husband referred to them as \"guest-worthy potatoes\".  Definitely my new favorite way to roast potatoes.Christie GPortland, OR1/29/2022Definitely worth repeating and repeating!   Simple and special.  ElaineChattanooga, TN1/23/2022This simple recipe shouldn't be so effective.  My husband now thinks I am a culinary  genius.  Also good call on the clean up link at the end!Eric ZaneHudson Valley1/8/2022This is literally the 4th time I'm using this recipe. It's my go-to for perfectly crispy and delicious roast potatoes!!Darlisa A.Los Angeles, CA12/26/2021Perfectly roasted potatoes indeed! Great, tried and true recipe. HomeChefBayAreaSan Francisco11/26/2021Since discovering this method, no other way of roasting potatoes comes close for meGarrettVirginia11/17/2021These will be my “GO TO” potatoes for the REST OF MY LIFE!\nCrispy on the outside, buttery on the inside!!! Simple and so delicious!!  Steaming under foil is genius!!!SheCooks!9/21/2021I really wanted to enjoy & like this.\nI followed recipe to the nth degree.\nI was under whelmed. They didn’t resemble the pic , I didn’t find them crispy as reviewers & pics indicated.Teri5/5/2021I can only say one thing about these potatoes. DOPE AF!!!!!! I’ll never make roasted potatoes any way ever again Kaiser SozeVancouver BC1/17/2021Literally never making any other roasted potato recipe. This is the one. Claire nailed it perfectly. I served this alongside BA's oregano - lemon chicken and it was a smash success, even more so than the main dish!AnonymousToronto, Canada9/19/2020The best potato I’ve ever put in my mouth! Wow!!!!!! AnonymousNashville 6/26/2020Will be making all potatoes using this method. I even effed up and drizzled olive oil on them before steaming. Still worked. AnonymousOlympia , WA6/20/2020These are amazing. Best way to roast potatoes. I sprinkle salt, pepper, garlic powder and Italian seasoning. There will be no left overs. MandolinhQuadra 5/17/2020I was tripping on mushrooms the first time that I made these during quarantine. I somehow followed the recipe to the letter and these came out sublime. Like, jaw on the floor levels of good. I've made them a couple of times since and they are always a winning side.broazayBushwick5/9/2020In a few words: An extremely easy method with outstanding results! I diced my potatoes, used chicken broth instead of water (per Julie Everett's suggestion), and steamed them for about 20 minutes. I then used rosemary and garlic powder in addition to the olive oil, salt, and pepper, and let those bake for 25 minutes. I am SO incredibly impressed and delighted by the results, and I will DEFINITELY be utilizing this method whenever I possibly can moving forward!talmillercalifornia4/2/2020Explore Bon AppétitPotatoVegetableYukon Gold PotatoSideBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-10-09", "author": ["Condé Nast", "Claire Saffitz"]}