{"id": "a8ebbda3098d56846b33b1f66cd5313a", "url": "https://www.bonappetit.com/story/essential-kitchen-tips", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "14 Kitchen Tips Worth Memorizing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchen14 Kitchen Tips Worth MemorizingAll the little things that keep our test kitchen running smoothly.By The Bon Appétit Test KitchenMarch 22, 2018FacebookTwitterEmailTED CAVANAUGHFacebookTwitterEmailEveryone has their own groove in the kitchen—the ingredients they reach for constantly, their methods for prepping dinner, the tools that get more use than their televisions (okay, maybe not that but, you get the idea). Having your own groove is good, because to each their own and all that. But there are some non-negotiables we live by when cooking. From how we toast our nuts and clean our greens, to the absolutely necessary gadgets, here are 14 tried-and-true kitchen rules we couldn’t cook without.1. How we measure flourUse a large spoon to fill cup measure with flour, then use a flat edge (the top edge of a chef’s knife works), flush against the rim, to scrape excess cleanly off the top.Save those parm rinds! You’re making this broth with them.\nTukka Koski2. Three things you should always have in the freezerUnsalted butter: It won’t take on fridge odors, and you'll always need backup.Parmesan rinds: Add to soups, tomato sauces, and pots of beans for rich salty goodness.Raw nuts: Toast and chop for salads, pastas, grain bowls—or deploy for making pesto.Don’t store these in the fridge, folks.\nPhoto by Ted Cavanaugh, Styling by Sue Li3. To chill or not to chill?Refrigerate: Citrus, apples, cornDon’t refrigerate: Tomatoes, garlic, stone fruitIllustration by Monica Ramos4. The three cooking oils you needNeutral: Grapeseed, vegetable, or peanut for high-heat cooking like pan-frying cutlets, frying eggs, and making stir-fries and oil-based cake batters.Olive: Everyday extra-virgin olive olive for sautéing veg, making soups, whisking into vinaigrettes, and cooking fish and steaks (spend $15 to $20 for 750 ml).Finishing: Fancy, robust, nuanced olive oil (buy in smaller bottles) for drizzling and never heating.Illustration by Monica Ramos5. Vinaigrette ratio reduxMost of us grew up eating salads dressed with Julia Child’s classic French vinaigrette, which feels a bit heavy and oily on the tongue these days. Our current go-to has a lot more puckery acidity.Then: 3 parts oil, 1 part vinegarNow: 2 parts oil, 1 part vinegar(Hint: Combine and shake in a near-empty mustard jar to emulsify.)Photo by Michael Graydon and Nikole Herriott6. How to revive stale breadFor crusty boules, sturdy sourdoughs, and other artisanal loaves, run the day- or two-day-old bread under running water for a few seconds, then reheat in 350° oven until heated through and crisp on the outside.7. Five other uses for chopsticksTester: Check doneness of a big braising cut (such as pork shoulder or leg of lamb) by pushing chopstick into it in several places, wiggling it around, and assessing if the meat is yielding all the way to the bone.Peeler: Use wide end to scrape the peel off a piece of ginger; the rounded edges allow you to get into the little corners and dimples.Turner: Turn things over while they’re deep-frying, like doughnuts.Grabber: Pluck tea bags out of a pot of tea.Flipper: Flip smashed baby potatoes or eggplant slices onto their second side when crisping in oil.Photo by Ted Cavanaugh8. How to boil a (large) eggHard-boiled: Lower into gently boiling water and cook 10 minutes. Transfer to an ice bath and let cool. This is how you make perfect hard-boiled eggs!Jammy: Lower into gently boiling water and cook 6½ minutes. Transfer to an ice bath and let cool. Read about our jammy egg math here.Poached: Crack and slip into simmering water. Cook, occasionally stirring gently, 3 minutes. It looks harder than it is—we’ve got you though.Illustration by Monica Ramos9. It’s ripe when...Artichoke: fresh at cut end; heavy for size; tight leavesAvocado: firm with just a hint of yielding when pressedEggplant: shiny, taut skin; no visible bruises or blemishesMelons: should be fragrant; a bit of give when pressed at stemPineapple: yellow, fragrant; leaf can be plucked out easilyTED CAVANAUGH10. How to clean greensTear or cut leaves from ribs, submerge in a deep bowl of very cold water, and swish to release sandy bits. Lift out (lift—don’t dump!) and place in a colander. Rub leaves between fingers and feel for grit; repeat with fresh cold water if necessary. Spin-dry and transfer to a ziptop bag. Press out air, seal bag, and store in the crisper drawer.Illustration by Monica Ramos11. How to check a steak for donenessWhy take any chances? Get a digital thermometer. Insert probe horizontally from an outside edge rather than straight down from the shallow surface.Very rare: 115°Rare: 120°Medium-rare: 130°Dry and chewy: 145°Photo by Ted Cavanaugh12. How to toast nutsSpread nuts—walnuts, almonds, cashews, hazelnuts, pistachios, pecans, peanuts—on a rimmed baking sheet and bake at 350° until evenly golden brown and fragrant, 8–10 minutes. (Set a timer; nuts are pricey.) Read more here!Illustration by Monica Ramos13. Always and forever reach forExtra virgin olive oilPure maple syrupPure vanilla extractUnbleached flourUnsalted butterWhole peppercornsIllustration by Monica Ramos14. Gadgets that aren't actually gadgets. They are kitchen essentialsUnicorn Mills Pepper Mill: Giant storage space, wide mouth for easy refills, and an exceptional, easy-to-adjust grinder that will never quit you. The best. Read more about how much we love it.Oxo Cake Tester: For checking the doneness of cakes (duh) but also the tenderness of boiled potatoes, roasted squash, and beets and for poking into fish fillets for flakiness.ThermoWorks Digital Thermometer: Hands down superb. Fast, accurate digital readout with a long, sharp probe to reach the thickest part of any cut of meat or roast.Escali Scale: If you're serious about baking you need one. Your measurements won't just be more precise, you'll never have to wash all those pesky measuring spoons again.Black & Decker Dustbuster: You know that stuff that lands at your feet while you're cooking? Garlic skins, breadcrumbs, bits of flour, rice, chopped nuts? Right. For that.Also Essential: The 29 Recipes That Define the Way We Cook NowExplore Bon AppétitTest Kitchen TipsToolsRead MorerecipesThe New Essentials: 29 Recipes That Define the Way We Cook NowGallery18 SlidesBy The Bon Appétit Test KitchencookingThe 12 Kitchen Tools You Absolutely NeedBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-22", "author": ["Condé Nast", "The Bon Appétit Test Kitchen"]}