{"id": "a8f1863a7c4ca3e9da44f28d74177be3", "url": "https://www.bonappetit.com/story/adam-rapoport-family-grilling-tradition", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "My Family’s Most Time-Honored Grilling Tradition Has Nothing to Do with the Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Family’s Most Time-Honored Grilling Tradition Has Nothing to Do with the FoodIt happens right before the grill is ready, when it’s all smoke and no fire.By Adam RapoportMay 25, 2018FacebookTwitterEmailFacebookTwitterEmailMy parents bought their place in upstate New York in 1987, and I wasn’t happy about it.As an 18-year-old, the last thing I wanted to do was come home from college to D.C. and immediately head to a country house hundreds of miles away (with my parents no less!). Funny how times change.Over the next 25 years, the house became a quick escape from New York City, where I moved after graduating; a permanent home for my parents when they relocated to East Chatham in 2007; and the place where I learned to love to grill.While up there on weekends, we’d spend our days doing this and that—tooling around nearby Hudson, running errands, maybe some yard work. But basically it was all just killing time until I could ask, “When should I start the grill?” Which, in the Rapoport house, was interpreted by those not ripping open a bag of charcoal as, “When’s cocktail hour?”At the agreed-upon time, my mom would pull a little orange wooden table from the porch to the patio. I’d fill a metal cooler with ice and a 12-pack. Snacks would be brought out: guacamole when we had time, those little sesame sticks when we didn’t. My brother and mom would pour themselves a Dewar’s on the rocks; my dad, never a big drinker, would often ask, “Maxine, what’s that drink I like again?” “Campari and soda, Dan.” When my wife, Simone, came on the scene, she’d reach for the citrus reamer and mix margaritas for herself and my sister.The best pre-dinner snack.\nPhoto by Alex LauThe backdrop was a mellowing sun over the Berkshires and that intoxicating smell of a charcoal grill just getting going, when it’s all smoke and no fire.I realize it’s at about this point in my letter that I’m supposed to talk about food. And sure, there were skirt steaks charred over a raging fire until dark and crispy; butterflied leg of lamb laced with garlic and rosemary; and racks of dry-rubbed ribs, brought to fall-apart tenderness in a low oven, then shellacked and crisped up on the Weber.But it was always that window before I threw anything on the grate that made me happiest. That moment when we’d gather by the grill like it was some grown-up campfire and just kick back and talk and drink and snack. If we played it right, we’d get about 45 choice minutes just as the sun was turning the sky into what looked like one big Italian ice.Eventually, the sun set.Start the season with Grilled Strip Steak with Blistered Tomatoes and Green Beans.\nPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonIn 2011 my father fell ill, and he fought the good fight. As is often the case with cancer, there were days and months when things looked good, like he might turn the corner.But I still remember one evening, sky aglow, plumes of smoke rising from the grill, cocktails poured, when my dad never came down to join us. I tried to pass it off as, well, maybe he’s just resting up for dinner. But in the back of my head, I knew better. You didn’t miss cocktail hour at the Rapoport house. That was our time.My dad passed away in April 2012, and a year or so later, my mom sold the house. A few years ago Simone and I got a little cabin out on the North Fork of Long Island. The view’s different, though no less mesmerizing—the cascading sun electrifies the sky as it sinks into the Long Island Sound. While I keep telling myself that one day I’m going to build one of those dream outdoor kitchens with the smoker and the beverage fridge and all that, for now we’re making do with a simple kettle grill, just like we had upstate. And I still time my day toward nailing that 45-minute window—when I’ve got my drink in hand, the charcoal going, the skirt steak marinating, and some sort of crudités set out on a wobbly little side table.I guess you could say that things haven’t changed, but that doesn’t mean they’re the same.And now if you feel like grilling, right this way...1 / 38ChevronChevronSoy Sauce–Marinated Grilled Flank Steak and ScallionsView RecipeExplore Bon AppétitGrillSummerLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-25", "author": ["Condé Nast", "Adam Rapoport"]}