{"id": "a8f6702e6d5bef97565b07957bc33cc8", "url": "https://www.bonappetit.com/recipe/ginger-scallion-tofu-scramble-with-spinach-and-chili-oil", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "Ginger-Scallion Tofu Scramble With Spinach and Chili Oil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGinger-Scallion Tofu Scramble With Spinach and Chili OilSpicy, creamy silken tofu with all of the crunchy toppings your heart desires.By Lara LeeApril 25, 20214.5(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintI’m a lover of scrambled eggs, but this tofu scramble is currently my favorite go-to. The delicate texture of silken tofu creates a creamy backdrop to crunchy garnishes like fried shallots, scallions, and crispy chili oil. And the tofu also acts as a cooling contrast to the ginger, soy, and cumin. Mirin adds sweetness and umami (but you can substitute with an equal amount of brown sugar) and turmeric lends a golden hue. If you prefer firm tofu, dry well and pan-fry crumbled chunks in the butter or plant-based butter before adding the scallions, ginger, and garlic, then continue with the remaining method as written. —Lara LeeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLee Kum Kee Chiu Chow Chili Oil$8 At AmazonLight Soy Sauce$8 At AmazonRimmed Baking Sheet$20 At Bon Appétit Market8-Inch Chef's Knife$47 At AmazonCutting Board$10 At IKEABox Grater$13 At AmazonMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonLarge Skillet$84 At AmazonWooden Spoon$6 At AmazonIngredientsMakes 4216-oz. packages silken tofu, preferably firm silken tofu4scallions15\" piece ginger4garlic cloves2Tbsp. plus 1½ tsp. light soy sauce (such as Pearl River, Lee Kum Kee, or Kikkoman)1Tbsp. plus 1½ tsp. mirin1Tbsp. plus 1½ tsp. toasted or untoasted sesame oil2tsp. ground cumin1tsp. ground turmeric¼tsp. kosher salt, plus more¼tsp. coarsely ground black pepper, plus more4Tbsp. plant-based butter or unsalted butter7oz. baby spinach (about 8 cups)¼cup store-bought or homemade fried shallotsChili oil (such as Lee Kum Kee Chiu Chow; for serving)4slices sourdough bread, toastedPreparationStep 1Line a rimmed baking sheet with several layers of paper towels or a lint-free kitchen towel. Carefully remove two 16-oz. packages silken tofu, preferably firm silken tofu, from packaging and drain as much liquid away as possible. Place tofu on prepared baking sheet and cover with several more layers of paper towels. Gently pat (don’t press; it will collapse) the tofu all over with your hands. You may need to repeat with more paper towels until it is dry. Let sit 5 minutes.→ Confused about which type of tofu to use? Start here.Step 2Trim 4 scallions and finely slice on a diagonal. Set 2 Tbsp. aside for serving.Step 3Scrape skin from one 5\" piece ginger (yes, it's a lot!) with a spoon. Slice off any exposed woody bits. Grate ginger and 4 garlic cloves on the small (shredding) holes of a box grater, then run your knife through them a couple of times to ensure no larger bits remain. (You can also use a Microplane, but a box grater is faster for this volume of aromatics.)Step 4Mix 2 Tbsp. plus 1½ tsp. light soy sauce, 1 Tbsp. plus 1½ tsp. mirin, 1 Tbsp. plus 1½ tsp. toasted or untoasted sesame oil, 2 tsp. ground cumin, 1 tsp. ground turmeric, ¼ tsp. kosher salt, and ¼ tsp. coarsely ground black pepper in a small bowl.Step 5Heat 4 Tbsp. plant-based butter or unsalted butter in a wok or large skillet over high. As soon as butter is foaming, add scallions, ginger, and garlic and cook, stirring constantly to keep from sticking, until ginger and garlic begin to soften and scallions are wilted and slightly darkened in color, about 2 minutes.Step 6Pour soy sauce mixture into pan and cook, stirring, until sauce is reduced by half, about 1 minute.Step 7Add 7 oz. baby spinach (about 8 cups) a handful at a time, letting each batch wilt slightly before adding more if needed, then cook, stirring, until all of the greens have wilted a bit, about 2 minutes.Step 8Place tofu in pan, gently breaking apart into 1\" pieces, and cook, stirring gently with a wooden spoon or heatproof rubber spatula to incorporate, until warmed through and coated in sauce, about 3 minutes. (You want to be gentle when stirring the silken tofu; otherwise, it will break into smaller and smaller pieces. The larger the pieces, the more the texture will emulate that of scrambled eggs.) Taste and season scramble with more salt and pepper if needed.Step 9Divide scramble among plates. Top with fried shallots and reserved scallions, dividing evenly, and drizzle with chili oil to taste. Serve with toast alongside.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Ginger-Scallion Tofu Scramble With Spinach and Chili Oil?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleLove this recipe. I left off the cumin (just don't like cumin) and other than that followed the recipe and plan to prepare this often. Great way to get your scrambled egg fix when you're a vegan or introduce folks who aren't to a great tofu scramble. Delicious, great assortment of flavors and wonderfully satisfying. Thanks for this great recipe!Linda UngerDallas, Texas1/15/2022So, so good. The only changes we made was using kala namak instead of kosher salt and sautéeing fresh shallots along with the other aromatics instead of frying and using them as toppings. Next time, we'll bloom the spices first instead of just adding it to the soy sauce mix. Other than that this recipe is great! Definitely going into our regular rotation!ncManila, PHL12/8/2021We really enjoyed this dish. Easy to make, flavorful but not heavy. We ate it on top of the sourdough toast to give the right balance of textures. Will definitely keep this in the recipe rotation!AnonymousLouisville, KY12/4/2021nice flavors, easy to put together - did not have shallots and it would have been a nice addition but worked out it too. cecile7/11/2021Made this as weekend brunch for my partner and we really enjoyed it! It was quick, easy, and the butter/soy sauce mixture with the tofu made it so wonderfully creamy compared to other tofu scrambles I've done. A new go-to for our recipe book. Only had extra-firm tofu so I modified the amount by feel to about 3/4 of the block for 2 people and still ended up with about 4 servings (which were great as leftovers the next day). Didn't have fried shallots so I sliced and roasted a yellow onion I had on hand.EmilySeattle, WA6/20/2021The flavor is really nice but considering how large the portion size is you get sick of it rather quickly and it lacks something to keep you eating. I served with sourdough as recommended and kimchi...next time I'd do rice as the starch so that some of the oils would as least get soaked up better...a bit too heavy if you eat a full serving, you can definitely feed 6 with this recipe! That being said it was pretty good and would be tasty for breakfast or dinner.AnonymousSeattle, Washington6/16/2021It was okay. I appreciated the bold flavors, and the chili oil really takes it to the next level. But overall I still found it to be lacking something, particularly texture. The best part of the meal for me was the buttered toast I ate it with. Not sure if I'll finish all the leftovers I have (my intention was to meal prep this for lunch for the week), but as a single meal every so often I could eat it.\n\nAlso @Dave Moore: You can't weigh down silken tofu with a can, or even a board on top of it. It will crush the tofu. Only firm or extra firm tofu can be weighed down.RachelPittsburgh5/23/2021I made this for a lunch with friends and it was good. I appreciated the strong flavors of garlic, ginger, cumin and turmeric which overcame the blandness of the tofu. I thought it might be too much but, no. Just right. I didn't do the crispy shallot topping (ran out of time to make) but that would be perfect. I will make it again.PeggyTillamook, Oregon4/30/2021Great quick breakfast for dinner after a long day of travel. Improvised with frozen spinach and it worked just fine. Wrapped in a carb friendly tortilla!\n\nI do wish that these recipes listed the nutritional values. Please consider adding!BuffnBluSeattle 4/29/2021@Dave Moore that sounds like a great idea, but how do you balance a can on top of a slanted board?MarshallRichmond, VA4/28/2021Love the recipe, but why all the paper towels? At a Japanese cooking class we were taught to drain tofu on a slanted chopping board over a sink with another board on top, weighed down by a heavy can. It took about 15 minutes but saved on all that wasteDave MooreCincinnati4/28/2021Lovely recipe. Looks delicious. \nS.k. AngSingapore 4/27/2021Explore Bon AppétitTofuOther IngredientsScallionOnionVegetableGingerHerbs & SpicesSpinachLeafy GreensShallotEasyVegetarianDairy-FreeVeganSautéBreakfastLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-25", "author": ["Condé Nast", "Lara Lee"]}