{"id": "a8fd7aa269e5c54f4e57874ae7dc6f75", "url": "https://www.bonappetit.com/recipe/bo-zai-fan-chinese-chicken-and-mushroom-clay-pot-rice", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Bo Zai Fan (Chinese Chicken and Mushroom Clay Pot Rice) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBo Zai Fan (Chinese Chicken and Mushroom Clay Pot Rice)By Diana YenMarch 1, 20214.2(41)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintThis version of Bo zai fan, or Chinese clay pot rice, combines sweet-savory Chinese sausage with steamed chicken, earthy shiitake mushrooms, and tender bok choy. It’s the ultimate one-pot comfort food and a staple in Hong Kong cuisine. Once you have the technique down, this recipe is endlessly riffable, using other combinations of meats, seafood, and vegetables. Cooking in a clay pot helps the rice develop a crunchy bottom layer. Try to resist opening the lid while cooking—you will know the rice is done when you smell the distinct nutty aroma of well-toasted rice.Cook’s Notes: If using a Dutch oven to make this dish, there may be too much liquid at the end as it’s not as porous as a clay pot. Uncover and let simmer until excess liquid evaporates, about 1 minute. Then cover and let sit as directed.To substitute dark soy sauce: Mix 1 tsp. regular soy sauce with ¼ tsp. molasses and a pinch of sugar in a small bowl.Ingredients4 servings11\" piece ginger, peeled, finely chopped2garlic cloves, finely chopped2Tbsp. soy sauce1tsp. dark soy sauce (see Cook’s note)2Tbsp. Shaoxing wine (Chinese rice wine) or dry sherry2tsp. cornstarch1tsp. oyster sauce1tsp. sugar¼tsp. freshly ground white pepper1lb. skinless, boneless chicken thighs, cut into 1½\" pieces8dried or fresh shiitake mushrooms2tsp. vegetable oil2lap cheong (Chinese sausages), casings peeled, sliced ¼\" thick1cup jasmine rice1½cups low-sodium chicken broth3small heads baby bok choy, leaves separated1scallion, thinly sliced on a diagonalPreparationStep 1Whisk together ginger, garlic, both soy sauces, wine, cornstarch, oyster sauce, sugar, and white pepper in a medium bowl. Add chicken pieces and toss to coat. Cover and chill at least 1 hour and up to 12 hours.Step 2If using dried shiitake mushrooms, place in a small bowl and pour in hot water to cover by a few inches (you can use a small plate to help them stay submerged). Let mushrooms soak until caps are tender, at least 20 minutes. Squeeze out excess water with your hands.Step 3Trim any tough stems from dried or fresh mushrooms; discard. Halve caps, or slice if large.Step 4Heat oil in a medium clay pot or Dutch oven over medium-high heat. Add Chinese sausage and cook, stirring occasionally, until browned and crispy, about 2 minutes. Using a slotted spoon, transfer to a plate. (Leave fat in pot for cooking the rice.)Step 5Pour rice into same pot and cook over medium-high heat, stirring to coat in fat, until fragrant, about 1 minute. Add broth and bring to a boil. Reduce heat to medium-low, cover, and simmer, reducing heat to low if you see a lot of steam escaping, 10 minutes.Step 6Remove lid from pot (rice will be only partially cooked) and top rice with marinated chicken along with any marinade, spreading out pieces in an even layer. Add mushrooms and cooked sausage. Cover pot, increase heat to medium, and cook until rice is tender and beginning to turn crispy and smells nutty, 8–10 minutes. Reduce heat to medium-low and continue to cook, arranging bok choy on top of rice 3 minutes before removing from heat, 5–7 minutes longer. Remove from heat and let sit (still covered) 10 minutes.Step 7Top chicken and rice with scallions and serve, scraping up some of the crispy rice with each serving.How would you rate Bo Zai Fan (Chinese Chicken and Mushroom Clay Pot Rice)?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleJust tried recipe for first time, and after reading previous comments and tweaking a bit, will cook it again!  \nHere are my tweaks to this recipe.  Cut down the cornstarch by 1/2 and decided to stir fry to brown for few minutes in a little oil after cooking the sausages and mushrooms, the cornstarch probably helped the chicken pieces not to stick.   I steamed the chicken on medium for only 8 minutes since I could hear the rice sizzling after about 6 minutes and did not want to burn it too much.\nAs for the time to cook the bok choy, just ignore the \"3 minutes before removing from heat\" and cook the bok choy for 5 minutes before removing from heat.  I enjoyed the recipe it's keeper.  But next time I'll make more marinade to pour over the rice to give more flavor and cook the bok choy only 3 minutes to have it crispier. I think whether it's 3 or 5-7 minutes longer doesn't make a difference as letting it sit an additional 10 minutes is enough to ensure the pre-browned chicken is cooked.KLTX1/11/2022To anon from CT: I think it should say:\n\nReduce heat to medium-low and continue to cook 5-7 minutes longer, arranging bok choy on top of rice 3 minutes before removing from heat.AnonymousMontréal4/24/2021The directions at step 6 when you add the bok choy is confusing. It says “ Reduce heat to medium-low and continue to cook, arranging bok choy on top of rice 3 minutes before removing from heat, 5–7 minutes longer.”. Does that mean put bok choy on for 3 minutes on the heat and then 5-7 minutes off the heat and then an additional 10 minutes off the heat?  It’s unclear the way the directions are written. AnonymousCT4/22/20213 minutes was not nearly enough for the bok choy, I'd give it closer to 10 minutes if you must cook it in the pot, I think grilling it would be a better alternative. It was delicious otherwise. Make sure to season at every step. Cody Connecticut 4/11/2021I've now made this recipe twice.  The first time was pretty much a disaster. The recipe as written has two major flaws:  Following the directions yielded almost raw chicken and  cornstarch. The following modifications made it the delicious dish that I hoped it would be. 1) I left the cornstarch out of the marinade. This cooking method does not allow the cornstarch to cook and yields a gluey, unpleasant texture. 2) There is no way that the chicken will cook in the time indicated in the recipe.  On my second try, I cut the chicken into smaller pieces and added to the pot after cooking the rice for only five minutes instead of 10. I followed the rest of the directions to a t, and the recipe is now a keeper.  Easy, quick, and tasty and beautiful enough for the happy day when we can have company again. HollyCalifornia4/8/2021can you make this with brown rice?  I want to pre-soak brown rice and try this recipeAnonymous3/3/2021Delicious and easy to make. I did it in a Dutch oven so I only got a bit of crispy rice at the bottom :( I'm sure if I'd had a clay pot I would have gotten the crisp that would have made this perfect. Jane LBrooklyn NY3/3/2021I’d love to try this in a clay pot but I thought they could only go in the oven? KipToronto ON3/2/2021这顿饭很好吃。我会再做一次。\nZhè dùn fàn hěn hào chī. Wǒ huì zài zuò yīcì.\nVery tasty. I would make it again\nAnonymousMontreal,Canada3/2/2021Explore Bon AppétitChineseEast AsianAsianShiitake MushroomMushroomVegetableBok ChoyLeafy GreensChicken ThighChickenPoultryEasyWeeknight MealsOne-Pot MealsMainDairy-FreeNut-FreeSimmerLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-01", "author": ["Condé Nast", "Diana Yen"]}