{"id": "a91aad21fca7d59b834b306cc8c59b73", "url": "https://www.bonappetit.com/recipe/steak-snap-pea-and-asparagus-stir-fry", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Steak, Snap Pea, and Asparagus Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSteak, Snap Pea, and Asparagus Stir-FryBy Claire SaffitzMay 29, 20184.7(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintStir-fry makes for a quick, satisfying meal—except for the part where you also have to get a pot of rice going to serve alongside. Our recommendation? Stop by the hot food bar at the grocery store or your local takeout place and pick up some cooked rice. The small convenience is worth the extra time and dishes in the kitchen.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAPaper Towels$13.45 At AmazonChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonTongs$13 At AmazonGlass Measuring Cup$19.99 At AmazonSpoon$24.69 At AmazonLarge Skillet$84 At AmazonFlexible Metal Spatula$9.99 At AmazonIngredients4 servings1lb. sirloin steak1Tbsp. cornstarch2Tbsp. soy sauce, divided4Tbsp. vegetable oil, divided8oz. sugar snap peas1bunch asparagus6scallions12\" piece ginger3Tbsp. mirin (Japanese rice wine)¼cup oyster sauce2Tbsp. unseasoned rice vinegarKosher salt2cups cooked white ricePreparationStep 1Place 1 lb. sirloin steak on a cutting board and pat dry with paper towels. Slice meat crosswise as thinly as possible.Step 2Transfer steak to a medium bowl and add 1 Tbsp. cornstarch, 1 Tbsp. soy sauce, and 1 Tbsp. vegetable oil. Toss with tongs until meat is evenly coated.Step 3Prep the rest of your ingredients: Trim ends of 8 oz. snap peas and remove any strings; transfer to another medium bowl. Snap woody ends off of 1 bunch asparagus and discard. Cut asparagus crosswise into 1\" pieces; transfer to bowl with snap peas. Trim both ends of 6 scallions and set aside 2 scallions for serving. Cut 4 remaining scallions crosswise into 1\" pieces and add to bowl with asparagus and snap peas. Scrub 2\" piece ginger under running water, then slice crosswise as thinly as possible; add to bowl with the other veg.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Combine 3 Tbsp. mirin, ¼ cup oyster sauce, 2 Tbsp. rice vinegar, and remaining 1 Tbsp. soy sauce in a glass measuring cup and stir with a spoon to incorporate.Step 5Heat 2 Tbsp. vegetable oil in a large skillet, preferably stainless steel, over medium-high. When oil shimmers across surface of skillet, add vegetable mixture. Cook, shaking skillet often, just until asparagus are tender but still retain a hint of crunch, about 3 minutes. Return vegetables to original bowl.Step 6Heat remaining 1 Tbsp. vegetable oil in skillet over medium-high. Add steak, arranging slices in a single layer. Cook, undisturbed, until juices start to pool on surface of meat and underside is browned, about 3 minutes. Using a thin metal spatula, scrape bottom of skillet and loosen meat.Step 7Immediately add cooked vegetables and sauce to skillet and cook, tossing constantly, until meat is fully cooked and sauce is thick and bubbling, 1–2 minutes more.Step 8Remove from heat and let cool for a minute or two. Season stir-fry lightly with salt. Divide 2 cups cooked rice among plates. Spoon stir-fry over. Thinly slice reserved 2 scallions and scatter over.How would you rate Steak, Snap Pea, and Asparagus Stir-Fry?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI've made this recipe many times. It's a go to when asparagus is in season. It's just a great starting point.  I've changed up some of the veggies.  I've subbed stir fry noodles for rice.  It's always a hit.  I love the sauce from scratch.  It lets you adjust for your taste.  AnonymousSuburban MN4/16/2021This is was delicious, everyone loved, and so easy!!  I used only a 3/4 lb piece of steak (trying to reduce our beef) and used snow peas instead of snap peas.  Threw in some mushrooms as well.  Also, after reading other comments, I used 2 tbsps mirin instead of 3 and I thought it still had plenty sweetness.  Will definitely make again!  yhillsoakland, ca3/10/2021So great. So easy. Make sure you get good quality beef. I just bought “stir fry beef” and it was tough. Didn’t have Mirin so added 3tsp. Of sugar to the 3 tablespoons of rice vinegar + the rice vinegar in the recipe sooo...was a little vinegar heavy but seriously STILL delicious. Would def make again!CovidCookingDebNYC 2/18/2021I make a lot of Chinese food and this one just didn’t live up to the mark. It was too vinegar-y and maybe a little to wine-y as well. We didn’t care for it, and wouldn’t make it again. alohalifeSan Diego CA6/5/2020Delicious and easy to make!Anonymous4/21/2020Super tasty! I've been looking for good recipes that can use cheaper cuts of meat, and this one was quick and delicious. I used asparagus, green beans, and mushrooms for the veggies because that's what I had in the fridge, and I suspect this recipe would work well with any veggies that can be quickly sautéed. Anonymous5/2/2019Let me start with an emphatic 'YES I will make this again.' I was surprised how sweet it was when I was done, however, so I'll probably reduce the mirin and add a fresno or jalapeno next time. But the sauce it quick to come together, easy to riff by adding other veg, and it was a hit overall. AnonymousSaint Louis, MO2/20/2019Easy to make, fast for me and completely delicious!\njeff_patterson4076Ankeny, IA6/15/2018HOLY SH*T this is the best stir-fry I’ve ever had! I added chili sauce for some heat and lemme tell ya— that ish was so damn good. AnonymousSan Diego6/11/2018This is everything it claims to be. Easy, fast and incredibly good. TBS of Sambal Oelek in the sauce and holy crap, amazing.AnonymousRochester, NY5/31/2018Explore Bon AppétitStir-FryChineseEast AsianAsianSteakBeefMeatSugar Snap PeaPeaVegetableAsparagusSpringEasyWeeknight MealsOne-Pot MealsMainDairy-FreeNut-FreeSautéDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-29", "author": ["Condé Nast", "Claire Saffitz"]}