{"id": "a91c97705989cb0459f5320fe36df76d", "url": "https://www.bonappetit.com/story/fatima-ali-cancer", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Chef Fatima Ali on Having Terminal Cancer and What She's Doing With the Time She Has Left | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI'm a Chef With Terminal Cancer. This Is What I'm Doing with the Time I Have Left'Top Chef' contestant Fatima Ali and her doctors thought her cancer had vanished. Then she was told she had a year to live.By  Fatima AliOctober 9, 2018FacebookTwitterEmailAlaina SullivanFacebookTwitterEmailFatima Ali is a chef in NYC and a former ‘Top Chef’ contestant. Last year, she was diagnosed with Ewings Sarcoma, a rare form of cancer. She underwent chemotherapy and surgery and wrote about how the experience changed her relationship to food. In September, Ali learned that the cancer had returned and was told she had a year to live. Here, she writes about how the terminal diagnosis is giving her a new perspective on life.Sitting in the airport lounge, I can feel her gaze locked on the back of my head before I see her. Her brows furrowed under dark bangs, small fists curled up around the sides of her princess dress. She stares at me, eyes full of curiosity and confusion. She senses that something is not quite right. It’s not just the baldness that gives it away or the sallow skin or baggy clothes. A cloud of death is following me. It’s followed me all the way to the first class lounge at LAX. I have never flown anything but basic economy on a domestic flight, but my illness has forced me to upgrade my life.The cancer cells my doctors believed had vanished are back with a vengeance in my left hip and femur bone. My oncologist has told me that I have a year to live, with or without the new chemotherapy regimen. I was looking forward to being 30, flirty, and thriving. Guess I have to step it up on the flirting. I have no time to lose.It’s funny, isn’t it? When we think we have all the time in the world to live, we forget to indulge in the experiences of living. When that choice is yanked away from us, that’s when we scramble to feel. I am desperate to overload my senses in the coming months, making reservations at the world’s best restaurants, reaching out to past lovers and friends, and smothering my family, giving them the time that I so selfishly guarded before.I hate to use my illness as a tactic, but I swallow my guilt as I slip into Noma’s DMs to see if somehow the Copenhagen restaurant can accommodate a table for two for their already booked seafood season. I’m floored when I receive a reply from chef Rene Redzepi himself. Turns out that people respond when you tell them you’re dying of cancer.In my wallet, I keep a crumpled cocktail napkin with a list of names scrawled on it. They’re people I need to make amends to before I go. I have to learn how to ask for forgiveness without expecting to receive it. It’s probably the most frightening thing I have ever had to do, and I’ve experienced some seriously terror-inducing moments.I’ve spent more time in sterile hospital rooms in the past year than I have in my own apartment. This has become my new home, and the staff a part of my family. I wonder if I’ll accidentally call my nurse “Mom” when she sneaks in to check my vital signs in the middle of the night. My blood pressure always stays on the low side of calm. Everyone’s amazed that I’m taking it so well. But when you hit rock bottom, there really is no place to go but up.An odd sense of relief has settled inside me, knowing that I can finally live for myself, even if it’s just for a few more precious months. I call a local hair stylist to come to my hospital room to dye half my hair platinum blonde and buzz the rest. He panics a little as he’s setting up, whispering to my brother in his thick Italian accent. “The dye… it won’t, uh, burn her scalp will it?” I tell him to carry on even if it does. It’s the only sense of control I feel like I have right now. I have embraced my alter ego. She doesn’t hold back.“I love your hair!” they all say when I’m done. They think I’m brave, but really, I’m not. I’m scared. I suspect I won’t last very long. There’s a faint feeling deep inside my gut like a rumble of passing air, ever expanding and filling slowly until, one day, I’ll pop.Until then, every day is an opportunity for me to experience something new. I used to dream of owning my own restaurant. Now I have an ever growing list of the ones I need to visit. From decadent uni and truffle toast at Chef’s Table at Brooklyn Fare to spice-laden Szechuan hot pot in Flushing, I’m sketching a plan to eat my way through New York and the boroughs while I can.I think back to my favorite movie of all time, American Beauty. “I don’t think that there’s anything worse than being ordinary,” Mena Suvari says as she sits with Kevin Spacey’s lecherous character. I was always deathly afraid of being average in any way, and now I desperately wish to have a simple, uneventful life.Explore Bon AppétitHealthyishessayRead Moreculture'Top Chef' Contestant Fatima Ali on How Cancer Changed the Way She CooksBy  Fatima AliRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Fatima Ali"]}