{"id": "a928fcb02569b26cf3d43aaaacb89088", "url": "https://www.bonappetit.com/story/our-place-perfect-pot-review", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "BA Reviews the Our Place Perfect Pot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingBA Reviews the Our Place Perfect PotIt’s pretty and functional—but can it really replace every pot in your kitchen?By Nico AvalleNovember 4, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When the opportunity to review the Our Place Perfect Pot popped up, I was in the middle of moving apartments, and my kitchen was a mess. Half of my belongings were in boxes, and the other half remains the subject of an ongoing custody dispute with my old roommates (if you’re reading this, Rachel, I want my pasta strainer back). While I’m generally skeptical of all-in-one cooking tools, I’m also more than willing to be convinced that one pan can truly do everything.Enter Our Place’s Perfect Pot. You may recognize its cousin, the Always Pan, the colorful fry pan that seems omnipresent on social media (or on our website) and aims to combine eight different kitchen implements into one pretty package. What the Always Pan wanted to do for pan stuff, the Perfect Pot wants to do for pot stuff. According to the Our Place website, it’s meant to replace your “stockpot, Dutch oven, saucepot, roasting rack, steamer, strainer, braiser, and spoon rest.” That was great news for me, because—although I own all of those things—I had no idea where any of them were. So I spent the past month or so cooking pretty much every meal (aside from takeout but including leftovers) in the Perfect Pot to see how it stacked up.After all that testing, I can confirm, on the record and for perpetuity, that the Perfect Pot is, in fact, a pot—but it’s not quite perfect. It’s big, it’s made of metal (mostly), it looks beautiful sitting on my stove, and it has room for a lot of ingredients and liquids inside of it. It does most pot stuff really well—you’ll have no trouble making stock, boiling pasta, cooking soups, poaching, blanching, or anything of the sort. I also liked its steaming tray, which is easier to clean and more intuitive to use than those complicated baskets that fold into themselves like the metal cities from The Legend of Korra.It’s when the Perfect Pot deviated from pot-related activities that I started running into problems. Some of the design choices that try to elevate the Perfect Pot into something beyond an attractive, functional pot actually get in the way of its core duties. It’s an undeniably pretty piece of kitchen equipment—much like the Always Pan—and there’s something to be said for good design. Still, aesthetics only matter up to a point, and whether that point is above the $165 price tag isn’t a decision I can make for you. What I can do is tell you how it fared at all of the tasks it claims to perform and point out the ways that the Perfect Pot left me wanting more, wanting less, or just wanting answers.Our Place Perfect Pot$165 at Our PlaceScore: 7/10Pros:Great for kitchens short on space thanks to its multiuse capabilities.Steaming tray is easy to use, clean, and store.Oven-to-table design and attractive colorways make for a stylish serving vessel.Cons:Nonstick coating can make some braising recipes difficult to follow.Maximum temperature of 425° is too low for some baking recipes that call for Dutch ovens—this is not your sourdough pot.Longevity concerns because of the nonstick coating and the exterior color.The BasicsThe Perfect Pot is a 5.5-quart pot with nonstick interior, solid aluminum construction, and a few bells and whistles to set it apart from a classic Dutch oven. Inside the box, you’ll find the pot itself, a notched beechwood spoon designed to rest steadily across the pot’s handle, a combination roasting/steaming rack that nestles in the bottom of the pot, and a nonstick safe dehydrated sponge that expands in water like those growing Dino-Capsules from when you were a kid (once the included scrubber gets yucky, Our Place’s website mentions that you can safely use any soft sponge on the pot’s surface).Our Place is known for their artful design skills, which definitely show in the Perfect Pot. While it doesn’t have as many color options as the flagship Always Pan, there are still six stylish hues—including the ever-popular sage green—that coordinate with Our Place’s dishware and glasses. I got mine in Blue Salt, and although the color has faded a bit in the past couple months, it’s still pretty enough in my book to place right on the dinner table when entertaining.What does the Perfect Pot do well?As a preface, I think the Perfect Pot is a solid piece of kitchen equipment. Most of the things that a good pot or Dutch oven does well are somewhat unglamorous and also nearly impossible to mess up. For example, I won’t waste time talking about how good this pot is at boiling water, simmering stock, or making pasta—because of course it can do those things.Outside of your basic pot duties, the main thing I’ve kept using my Perfect Pot for—even after I’ve finished reviewing it—is steaming. The Perfect Pot comes with a small perforated tray that functions as both a roasting rack and a steamer basket and fits snugly in its bottom without damaging the pot’s nonstick coating. While the utility of a roasting rack this small was somewhat lost on me (I could barely fit an entire sliced potato on the 8.5\"-diameter rack), it works like a charm for steaming—especially when I’m cooking for one and don’t want to deal with a full-size steamer. My Perfect Pot is a powerhouse for cooking dumplings, shellfish, veggies, you name it, with minimal stickage to boot. Once everything’s cooled down, that tiny tray is a breeze to clean and can be stored inside of the Perfect Pot to save space.I also have to compliment the design of this device. Like most Our Place gear, it’s very pretty to look at, in a hip, 2021 minimalist way, and it feels like a piece of well-oiled machinery in my hands. An incredible amount of thoughtfulness and artistry clearly went into making this pot a reality, and as someone who dropped out of engineering school after one semester, I appreciate when that much effort goes into anything. While I may balk at Our Place’s assertion that the Perfect Pot’s cleverly notched spoon—which locks onto the pot’s handle like a Lincoln Log—will “replace” your spoon rest (as if a spoon rest really takes up an inordinate amount of space), it is an incredibly convenient trick.I love the oversized pouring spout, which makes dumping leftovers into deli containers quick and easy while minimizing spillage. Its lid also has a strainer built into it, although the holes are a bit too large to catch smaller grains like quinoa. The handles are plus-size, which makes carrying the pot or pulling it from the oven a bit safer while wearing oven mitts on both hands. It’s also compatible with your induction cooktop, which could easily be the way of the future.About that nonstick coating…Like the Our Place Always Pan, the Perfect Pot is lined with a slick nonstick ceramic coating. I fried eggs, crisped up bacon, seared chicken breasts, and sautéed plenty of veggies in the bottom of my Perfect Pot to see how it would fare, and I have to say it was one of the better nonstick surfaces I’ve ever used. Our Place boasts that the lining is made “without potentially toxic materials like PFOAs, PTFEs, other PFAs, lead, cadmium, toxic metals, and nanoparticles,” which I recently learned are scary from Last Week Tonight With John Oliver, so that’s a breath of fresh air for the hypochondriac in me.But why is the Perfect Pot nonstick in the first place? When it comes to braising, which is one of my favorite things to do in a pot, sticking isn’t always a bad thing. On the contrary, many of my favorite braised recipes rely on ingredients leaving a fond (those brown crispies that get stuck to the pan) as they sear, which you deglaze later on with wine or soy sauce or stock to incorporate those caramelized flavors into your braising liquid. That process brings depth to the sauce and makes everything taste warm and cohesive and cozy and generally delicious. I would much rather be able to do that in a big, bulky stockpot than be able to fry eggs in it, an activity that—in retrospect—felt pretty ridiculous.For most tasks where I’d use a pot—simmering, steaming, boiling, poaching—a nonstick coating is pretty much irrelevant. It doesn’t hurt, but it doesn’t really help either. And given that long-term reviewers of the Always Pan have expressed concerns about the longevity of its nonstick surface, it feels like an odd and unnecessary inclusion for the Perfect Pot.Can the Our Place Perfect Pot replace my Dutch oven?The Perfect Pot looks like a Dutch oven, in many ways it acts like a Dutch oven, and Our Place claims it can replace your Dutch oven—but I wouldn’t throw out your Le Creuset just yet. Like I mentioned, the nonstick coating isn’t ideal for some braising recipes, but that’s not the only issue I’ve run into so far. If you use a Dutch oven to bake bread, for example, the Perfect Pot is only oven-safe to 425°, which is short of the 450–500° range we recommend for our BA’s Best Bread recipe. King Arthur Flour also recommends cooking sourdough at 450°, just beyond the Perfect Pot’s maximum temperature.Unlike standard Dutch ovens, which are usually made of cast iron and enamel, the Perfect Pot is made from lightweight aluminum. This means it heats up quicker than a traditional Dutch oven might, which is great for weeknight cooking or any situation where you want responsive temperature control—I made a carbonara in mine and experienced zero egg-scramblage after cutting the heat—but that comes at the cost of less heat retention and durability compared to a common Dutch oven.For comparison’s sake, the enamel-lined cast-iron Dutch oven from Lodge I normally use can safely reach 500°. It’s great for searing, baking, and braising. It’s heavy-duty too: I’ve put the enamel through some pretty serious abuse over the years, and so far it’s shown no signs of chipping. Unlike that tank of a cast-iron dish, I feel like I need to baby the Perfect Pot to preserve its nonstick coating. Our Place specifically recommends a quick wash with a soft sponge (like the one that comes included with the pot), but that leaves me worried about tougher messes and stains.Lodge 6-Quart Dutch Oven$115 $80 at Amazon$80 at TargetIs the Perfect Pot Worth It?At $165, the Perfect Pot has some pretty fierce competition. The Lodge Dutch oven mentioned above costs about half as much, leaving you with enough cash to buy a stainless-steel stockpot or a nice nonstick pan—rather than frying all of your eggs in the same eight-in-one basket, so to speak. If you bake a lot of bread or want the perfect vessel for braising and deglazing, it’s probably not the pot for you given its temperature restrictions and compromises from its non-stick coating.On the other hand, if cabinet and shelf space are major concerns in your kitchen, or you’re looking to downsize, the Perfect Pot is a strong option thanks to its multifunctional bona fides. It’s certainly capable of almost everything you would expect to use it for, and clever features like the steaming tray, plus-size pouring spout, and induction capabilities could be enough to justify the price tag. As a semi-recent grad myself, I’ll definitely say it’s a solid choice for someone building out their first kitchen—it will satisfy your needs while still leaving you with room to grow as a chef. With dinner parties on their way back, it also makes a gorgeous serving dish, competitively priced with other stylish options like the Great Jones Dutchess and the minimalist Kana Milo Dutch oven, which makes it a good pick for frequent entertainers.Milo by Kana 5.5 Quart Dutch Oven$135 at Amazon$135 at KanaNo pot will ever be everything to everyone, and nothing in this world is truly “perfect,” no matter what anyone tells you. But the Perfect Pot, imperfect as it may be, is still a brilliantly designed and unique piece of cookware with lots going for it. And even though I’ve stopped using it for everything I do, it’s earned its place on my stovetop, my dinner table, and my Instagram page—right next to my other Dutch oven.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-04", "author": ["Condé Nast", "Nico Avalle"]}