{"id": "a93b0e60d61ced87f1a274daf306c95b", "url": "https://www.bonappetit.com/recipe/mai-tai", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Mai Tai Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMai TaiBy Rachel GurjarAugust 5, 20214.6(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat Boystova, prop styling by Allie WistEmailPinterestPrintEmailPinterestPrintIn the canon of classic tiki cocktails, the Mai Tai stands out as one of the most iconic—and one of the most bastardized. At its core a Mai Tai is meant to showcase great rum. We use a combination of white and aged or dark rums—the white rum is lighter bodied and fruity, while the aged rum brings juicy banana, vanilla, and burnt sugar notes and a richer mouthfeel. High-quality orgeat is essential (we love L’Orgeat) and is worth seeking out if you’re a fan of tropical drinks. If you’re making Mai Tais for a crowd, this recipe easily scales up. Simply make a large batch in a pitcher or jar and shake 4 oz. cocktail mixture in a shaker with ice to make one drink.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Shaker$20 At AmazonCocktail Jigger$6 At AmazonHawthorne Strainer$7 At AmazonCitrus Juicer$7 At AmazonIngredientsMakes 11oz. aged rum (such as Plantation Original Dark or Denizen Merchant’s Reserve)1oz. white rum (such as Denizen aged white rum)1oz. fresh lime juice, a squeezed lime half reserved½oz. curaçao or Grand Marnier¼oz. orgeat (such as L’Orgeat, BG Reynolds, or Liber & Co.)¼oz. simple syrup1lime wedge1large mint sprigPreparationCombine both rums, lime juice, curaçao, orgeat, simple syrup, and reserved lime half in a cocktail shaker. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds. Strain into a glass filled to the brim with crushed ice. Garnish with lime wedge and mint sprig.How would you rate Mai Tai?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI'm serving them at a party this weekend. Just made a sample (single recipe) - really good!Janie MasonHouston, TX8/20/2021Please post the batch measurements if you suggest making a batch! You know, we need a pitcher. After one BA cocktail; my math gets fuzzy. I second the Trader Vic’s sentiment. ✌🏻JeanetteChicago8/15/2021I miss Trader Vic's so bad!  No one made a Mai Tai like Vic.WalterPortland-ish8/15/2021The most refreshing non sweet cocktail which suits my taste buds, I love making it as much as I love drinking it. Mr TZ13🇬🇧 UK8/6/2021Explore Bon AppétitCocktailDrinks AllPitcher DrinkCold DrinkAmericanRumAlcohol & Other DrinksLimeCitrusFruitGrand MarnierQuickEasyDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-05", "author": ["Condé Nast", "Rachel Gurjar"]}