{"id": "a94cee7d6f269a1298be40c0a48ed785", "url": "https://www.bonappetit.com/story/vintage-amaro-officina-dc", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Time Travel Is Possible When You're Drinking Vintage Amaro at Officina in D.C. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTime Travel Is Possible When You’re Drinking Vintage Amaro at Officina in D.C.On the second floor of the Italian food hub sits The Salotto, a five-seat bar with an enormous vintage amaro library.By Alex DelanyMay 17, 2019FacebookTwitterEmailFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.You know those people that say, I was born in the wrong era? The ones that wear tie-dye headbands or scratchy wool pants that they call slacks? Yeah, well they are missing out—but only if they haven’t drank vintage amaro at Officina in Washington, D.C. Because if they had, they could experience the best parts of the sixties, seventies, or eighties, all poured from bottles sitting right behind the bar.There’s a lot going on at chef Nick Stefanelli’s three-floor Officina: A café, a market, a rooftop bar, a proper restaurant. But on the second floor lives Salotto, a five-seat amaro library with a massive list that span from last year’s batches to the entire century prior.The last time I was in, I drank a Pio Cesare Barolo Chinato from 2018 next to a 1970s Barolo Chinato from now defunct producer Zabaldano. I had Campari from three separate decades, a glass of chartreuse from the 1920s (before the liqueur’s name was trademarked), a glass of Amaro 2000 from the 1980s—which was one of the most bitter things I’ve ever tasted and almost impossible to source. There was that glass of Amaro del Capo from last year alongside an Amaro del Capo from about five decades earlier. And then I had a sip of 1960s Cynar next to a sip of 1970s Cynar next to a sip of 2018 Cynar, and that pretty much blew my mind.All the herbal intricacies of each decade made it feel like I was running around on some kind of spirit-fueled time machine. I could also experience the way that time brought forth different flavors, smoothed out bitterness, and coaxed sweetness into a velvety mouthfeel. I was about six drinks deep, but even so, it became quite clear that when you’re at Officina, you don’t have to pick an era to be obsessed with. You can live them all simultaneously.Go There: The Salotto at OfficinaExplore Bon AppétitHighly RecommendCocktailWashington, D.C.RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-17", "author": ["Condé Nast", "Alex Delany"]}