{"id": "a94ef4308e8cae75766fea73531918c1", "url": "https://www.bonappetit.com/recipe/butter-free-flaky-galette-with-spicy-greens", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Olive Oil Galette With Spicy Greens Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOlive Oil Galette With Spicy GreensBy Andy BaraghaniApril 13, 20204.7(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Plates by Meilen Ceramics EmailPinterestPrintEmailPinterestPrintWhile butter is the usual choice for galette or pie dough, a combination of olive oil and yogurt gives this crust a flaky texture and a golden brown color when baked. If the dough is a little crumbly when rolling it out, don’t worry: Just patch it back up.Ingredients4 servingsDough1½cups (188 g) all-purpose flour1tsp. sugar¾tsp. kosher salt⅓cup full-fat plain yogurt (not Greek)3Tbsp. extra-virgin olive oilAssembly3Tbsp. extra-virgin olive oil1medium leek, white and pale green parts, halved lengthwise, sliced crosswise on a diagonal 1–1½”-thick, or 4 scallions, coarsely chopped2garlic cloves, thinly sliced½tsp. crushed red pepper flakes1bunch Swiss chard (about 1 lb.), ribs and stems removed, leaves torn into bite-size piecesKosher salt, freshly ground pepper1oz. Parmesan, finely grated (about 1 cup)All-purpose flour (for surface)1large egg, beaten to blendFull-fat Greek yogurt (optional) and coarsely chopped tender herbs (such as dill, parsley, and/or tarragon; for serving)1tsp. finely grated lemon zestPreparationDoughStep 1Whisk flour, sugar, and salt in a large bowl to combine. Whisk together yogurt and oil in a small bowl (it won’t be perfectly smooth). Make a well in center of dry ingredients and scrape in yogurt mixture. Using a fork, gradually incorporate dry ingredients into yogurt mixture, then use your hands to work together until a shaggy dough forms (you can also turn out onto a surface if that’s easier). If the dough doesn’t come together in 1 piece, knead in 1 Tbsp. ice water. Shape dough into a 1”-thick disk. Wrap in plastic and chill at least 2 hours and up to 12 hours.AssemblyStep 2Heat oil in a large skillet over medium. Add leek and cook, stirring, until softened and wilted (don’t let it take on any color), 6–8 minutes. Add garlic and red pepper flakes and cook, stirring, just until garlic begins to soften, about 1 minute. Add Swiss chard by the handful, letting each addition wilt slightly before adding more; cook, stirring often, just until chard is tender, about 4 minutes. Remove from heat; season with salt and pepper. Transfer Swiss chard mixture to a large bowl and let cool 20 minutes. Mix Parmesan into filling.Step 3Preheat oven to 400°. Unwrap dough and roll out on a lightly floured sheet of parchment paper to a 12” round about ⅛” thick. Slide dough and parchment onto a baking sheet. Scatter filling over dough, leaving a 1½” border. Bring edges of dough up and over filling, overlapping as needed; brush dough with egg. Chill in freezer 10 minutes.Step 4Bake galette, rotating front to back halfway through, until crust is golden brown and cooked through, 40–50 minutes. Let cool slightly on baking sheet.Step 5To serve, dollop filling with yogurt if desired and top with herbs and lemon zest.How would you rate Olive Oil Galette With Spicy Greens?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThis is definitely a plan ahead recipe, I was caught off guard by the long rest time for the dough (I know, I know, it's important to read the entire recipe). It was worth the wait. For our family's taste it needed more chile and garlic but the dough was perfect (the crust needed tenting to prevent burning, an easy fix) Definitely a keeper.Team BosqueLos Ranchos, New Mexico3/12/2022The filling was great! I used chard from my garden and was delish. However, the pastry was disappointing. It was tough and hard with the texture of a stale pretzel. It would be useful if you were preparing backpacking turnovers but that’s the limit for this dish unfortunately. AnonymousSanta Cruz, ca8/21/2021So, I think my subpar-ish results are mostly user error. I chilled my dough for several days in the fridge (rather than the 2-12 hours as called for) and I think that probably messed with the flakiness and texture of the final crust (whoops).\nThe filling itself was delicious and the spice level was just right out of the pan, but when added to the galette it got lost on me. If I were to make again I'd really up the pepper flakes. I also turned the garnishes of yogurt, dill, parsley, tarragon, and lemon zest into a side serving dip, just because. \nAll in all, it was fun to make something out of my wheelhouse! I would try this recipe again, mostly to actually see how the yogurt crust would handle when chilled for the proper time.Sarah A.Arlington, VA6/11/2021This was so good! Baking doesn’t always spark joy for me the way it does for some but making this was really fun. My one note is I feel like the filling is crying out for a bit of crunch. Water chestnuts maybe? Am I nuts? AnonymousChicago2/5/2021Very good! I also used the stems and added them with the leaks. The crust was a little bit dry.katiarodriguez21Bogotá, Colombia7/20/2020Made this lovely galette for dinner tonight! I diced up my chard stems/ribs and threw them in the pan with the leeks at the beginning as I didn't want to toss them, and I supplemented my parm with a bit of left-over feta that was hanging around my fridge. Turned out perfect! I think I need a bit more practice with this kind of crust, but it still turned out great and I will be making this again. Served this with a sunny-side-up egg for each plate to make it a meal, would have been equally lovely with a piece of fish.jonathancurtisCarlsbad, CA6/6/2020I used this recipe as a healthier (wayyy less butter) alternative to the triple threat onion galette, and though I loved the crispness and slight tanginess of the crust, the filling was slightly bitter to my taste, but still tasted great with good garlic flavournav02CHICAGO, IL6/5/2020So much love for Andy's recipes. This one's amazingly good and easy. Prepped the dough and filling the night before, assembled/cooked it for brunch the next day. Everybody loved it, def making it again and again AnonymousQuebec5/10/2020Such an amazing recipe. Substituting the leek with caramelized shallots worked out pretty well! The parm was also omitted, and it still worked out perfectly! Was a hit for mother’s day brunch. Will definitely be making more of these!AnonymousOttawa, ON5/10/2020Delicious!! Had to sub chard for bok choi leaves and added a bit more red pepper flakes. So delicious!! I've never made a pastry with yogurt and oil. A lot healthier than butter ( I think ;) ). \nThank you bon appetit ! Everyone loved it so much we should have made double!\nWill definitely make again. I'm all about a galette. LmsmithyVancouver, BC5/8/2020This is really really delicious5/6/2020Delicious!\nSlight alterations; I used 3% yogurt for the dough and I added some kale to the greens AyeletIsrael4/26/2020The flavors were great! :) Crust was hard. :/AnonymousSacramento4/22/2020Had to do a few coronavirus subs (spinach and kale for the chard, Aleppo pepper for the red pepper, Greek yogurt) but it still turned out really well! Cooking the scallions on medium was way too hot for me- they took on color in seconds. Not sure if I did something wrong but had to cook over low. Otherwise it was great, still tasted fine even with my browned scallions. Thinking I might use this crust as a healthier sub for other galettes.Anonymous4/21/2020My boyfriend called it “phenomenal” - I’ll take it! This one was so delicious. Definitely going to put this one on regular rotation. So bright and delish!AnonymousSan Francisco 4/20/2020Explore Bon AppétitGaletteDessertSwiss ChardLeafy GreensVegetableYogurtOther IngredientsNut-FreeVegetarianHealthyishBakingBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-13", "author": ["Condé Nast", "Andy Baraghani"]}