{"id": "a9531f05ca5d66a18b77c57fdf5dbbfa", "url": "https://www.bonappetit.com/recipe/cast-iron-pizza-with-fennel-and-sausage", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Cast-Iron Pizza with Fennel and Sausage Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueCast-Iron Pizza with Fennel and SausageBy Claire SaffitzMarch 20, 20184.9(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintPizza dough is usually sold as a 1-lb. ball. You only need 12 oz. for this cast-iron pizza recipe; tear off 4 oz. for making garlic knots. We used a 10\" pan, so if yours is bigger, use a bit more dough. Cooking sausage in the pan before adding the dough infuses the crust with porky flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronJumbo Silpat Roul'pat$65 At Food5210.25\" Cast Iron Skillet$18 At AmazonSmall Offset Spatula$6 At AmazonLadle$27 At AmazonIngredients2 servings 12oz. store-bought pizza dough, room temperature5Tbsp. extra-virgin olive oil, divided8oz. sweet Italian sausage, casings removedKosher salt⅓cup prepared marinara¾cup coarsely grated low-moisture mozzarella½small fennel bulb, very thinly sliced3garlic cloves, very thinly slicedCrushed red pepper flakes and torn basil leaves (for serving)PreparationStep 1Place a rack in top-most position of oven; preheat to 475°. Place dough on a work surface; drizzle with 1 Tbsp. oil, turning to coat. Stretch out to a 10\" round and cover loosely with plastic wrap.Step 2Heat 1 Tbsp. oil in a large cast-iron skillet over medium. Cook sausage, breaking up into small pieces with a wooden spoon, until browned in spots and cooked though, 5–8 minutes. Transfer sausage to a small bowl.Step 3Remove skillet from heat and carefully lay dough inside (use spoon to help you extend dough all the way to the edges). Season with salt, then spread marinara over entire surface of dough. Top with mozzarella, then fennel, garlic, and cooked sausage. Drizzle with another 2 Tbsp. oil. Peek underneath the crust—the bottom should be golden brown and crisp from residual heat in the skillet. If it’s not, set over medium-low and cook until crust is golden brown, about 3 minutes.Step 4Transfer skillet to oven and bake pizza on top rack until crust is golden brown around the edges and cheese is browned in spots and bubbling all over, 10–14 minutes. Let cool 5 minutes, then top with red pepper flakes and basil. Sprinkle with more salt and drizzle with remaining 1 Tbsp. oil.How would you rate Cast-Iron Pizza with Fennel and Sausage?Leave a ReviewTell us what you thinkReviews (27)Back to TopTriangleThe concept is great and the pizza was flavorful and a hit at home.  So why am I complaining?  First of all, if a 12\" pan is the size that fits 1lb. of dough (how it is usually sold) then let's specify a 12\" pan.  Secondly, why are we coating the dough with olive oil and rolling it around rather than just brushing olive oil on it once it's in the pan?  Any split in the dough cannot be pressed back together if it's covered with olive oil.  Thirdly, it's hard to \"peek under\" dough in a flaming hot cast iron skillet.  And lastly, it stuck to the pan.  Badly.  A dusting of cornmeal under the crust would easily solve that.   Anyway, it tasted good!  Surprisingly my teenagers liked the fennel and the recipe could be customized with any topping you wish.Bain MarieSan Francisco10/3/2021This is the best pizza ever! This pizza is the most requested dish from my family! Love the fennel…..cast iron skillet is an absolute must.Kristi TChattanooga6/13/2021Adore this pizza!! So so delicious, so easy, and so few dishes that have to be washed. My go-to is usually new recipes, but I have made this pizza literally 4 times in the past 2 weeks.OliviaRochester, NY12/10/2020I cannot say enough good things about this pizza! First of all, making pizza in a cast iron skillet has been an absolute game changer for me, the crust comes out so crispy and light it's amazing. This was my first time using fresh fennel bulb on anything and I have to say I was skeptical it would be a little too licorice-y tasting, but I will say this has converted me to a fennel lover! It compliments the sausage perfectly. This pizza is flavorful and delicious! Definitely make this as soon as you can!! AnonymousRockville, MD11/9/2020This was excellent. We usually make pizza in a wood-fired oven, and this was our first time using cast iron. We made the recipe exactly to spec and served with a green salad. AnonymousSt. Petersburg, Florida11/3/202010/10 would definitely make again, like maybe tomorrow. We were almost done with the first piece before I realized I forgot the basil. It made it so much better. I also topped with raw honey, it was a perfect balance. hriley613Sahuarita, AZ6/20/2020Claire: This pizza was surprisingly wonderful, my wife , Tina, actually is the cook who followed the recipe. We were very happy with the results, the fennel bulb added the perfect partner in this recipe. Tina says (and I whole hardily agree) we will use this recipe again and again.AnonymousBainbridge Island, WA6/10/2020Fabulous and so easy it’s ridiculous. I believe I will make most of my pizzas like this from now on!AnonymousPortland, OR6/8/2020I made this with a sourdough crust using King Arthur’s sourdough pizza crust recipe. I only used a 1/4 pound of or really good heritage pork spicy Italian sausage, along with Some wild mushrooms, onions and red peppers since I had no fennel. I sautéed the vegetables with the sausage first, both to get rid of some of the moisture and to ensure they get fully cooked. The first time I made it it was really good. The second time was even better because I put the pan in the oven with everything but the cheese and baked it at 500 degrees for eight minutes to drive off even more moisture. Then I lowered the temperature to 450, added the cheese and finished it in eight minutes. I’m glad I didn’t use a half pound of sausage or it would have been overwhelming.capemaycook6/5/2020I love this method of cooking pizza. \nI use it more as a suggestion as here in NZ it's hard to get nice Italian sausage. I make this with pepperoni or whatever I want on my pizza. Just be careful your pan isn't too hot and burns the base. AnonymousNew Zealand5/18/2020I took some liberties with this one and used a combo of spicy pepper spread and marinara sauce along with a big ball of burrata, and I cannot recommend this recipe enough. The cast-iron skillet really helps make a golden, crispy crust, and the combo of sliced garlic and fennel adds a great bite.mrbernardiniNew York, NY4/27/2020I've made this twice. The flavors are delicious but the amount of oil it calls for is very unnecessary. Sausage releases so much oil on its own. The oil in the pan to cook the sausage and drizzle of oil over the top of the pizza prior to baking just make it a greasy mess. My crust didn't brown at all from placing it in the hot pan so I had to put it over medium heat for about 5-6 minutes prior to sticking it in the oven. AnonymousSan Francisco, CA4/15/2020This is one of my go-to recipes. I make this ALL. THE. TIME. I like thin pizza with no crust so I use a 14inch pan with 8oz of dough. Once the sausage is done, I turn the stove down to low and then lay the dough in there (lots of good evoo is OK). Use a spoon to push the dough against the wall of the cast iron and then spread the sauce to the edge so there is no crust. 14 minutes exactly in the oven. It's helpful to have an extra set of hands to tip the cast iron while you use a spatula to lift it out onto the serving plate. Watch out if you use wetter ingredients (like mushrooms or extra sauce), the dough might not cook through so you'll need to put it on the stove a little longer before putting it in the oven. AnonymousSF Bay Area4/7/2020Love this pizza! We used homemade sourdough dough, spicy italian chicken sausage and finished with a hot honey drizzle (brush it on the crust right out of the oven, it'll turn into a lacquer while it rests for 5 min... pizza game changer!!)\n\nPersonally, I think the amount of oil this recipe calls for is a little insane. We use flour to stretch our dough, about a 1/2 tbsp to cook the sausage (but would not have used any if it were pork sausage as the fat would render out of that,) we didn't add any on top to bake (I know she says in the video that the oil will help the fennel cook, but the residual oil from the sausage definitely worked here,) and only a tiny drizzle to finish at the end. I don't think we even used a full tablespoon, so I'd recommend using your discretion here. We still had perfectly crispy, tasty pizza without all the added oil. I feel like 5 tbsp would result in a nearly deep fried 'za!zoebermanLong Beach, CA4/6/2020This recipe is FANTASTIC! I never thought pizza made at home could be so good. Followed the recipe as is- and turned out perfectly (more than once...). Make it. AnonymousNYC1/23/2020Explore Bon AppétitPizzaSausageMeatFennelVegetableMainNut-FreeSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Claire Saffitz"]}