{"id": "a95475a8233bf0fe817686cc75ae54b3", "url": "https://www.bonappetit.com/story/vitamin-c-mask", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Vitamin C Mask Changes Colors on Your Face But It's Not All Instagram Bait | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Color-Changing Vitamin C Mask Is More Than Just Instagram BaitFarmacy’s Bright On Vitamin C Mask brightens and exfoliates for 10 minutes of your time.By Deanna PaiNovember 7, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailI remember when I was young and innocent enough to think that Queen Helene could solve all my problems.If you’ve never tried to extinguish a breakout by covering it with an entire tube of Queen Helene’s Mint Julep masque, an appropriately mint-green goop that promises to vacuum-clean your pores with kaolin and bentonite clay, then fortune is on your side. I bet your boyfriend didn’t even dump you the day after prom!But in high school, I had no such luck. I dealt with hormonal breakouts, the occasional monster zit, and pores as perennially clogged as a Taco Bell bathroom. My skin, while not terrible, was definitely not by any means good, so I was a sucker for words like “clarifying,” “detoxing,” and “pore-clearing.” You know: Like a clay mask. Like Queen Helene. And like my first boyfriend, the mask didn’t even do all that much for me, but I kept falling for it anyway.Old habits die hard, and though both my skin and taste in men has greatly improved in the 10 years since I was a teenager, I still can’t help but feel seduced by the promises of a good clay mask. And Farmacy’s Bright On Massage-Activated Vitamin C Mask makes a lot of bold promises: The clay-based formula claims to brighten, exfoliate, and detoxify skin in exchange for a mere $38 and 10 minutes of your time.It also requires some elbow grease, because the “massage-activated” portion of the product name isn’t just there for kicks. The mask starts out lavender and transforms into a pale green shade as you massage it in. Although this sounds like Instagram bait, which is something I think about now, both the massage step and color transformation are essential steps.“Vitamin C is inherently unstable and will lose its potency and efficacy if not protected,” explains Kseniya Popova, associate director of innovation at Farmacy. For that reason, the vitamin C is stored in microcapsules to protect it from breaking down; by massaging it in, you burst the capsules, thereby releasing the vitamin C. Through some mechanism—sorry, I dropped organic chemistry after one semester—the mask then turns green, which is your indication to stop massaging.In addition to vitamin C, which does all the work of brightening, the mask also gently exfoliates with alpha hydroxy acids and detoxifies with a blend of clays. And while they had me at “detoxify,” I’m also an acid proselytizer (as you may know), so I’m sold. Really, it’s like a clay mask, antioxidant serum, and gentle peel in one. The combo will work for any skin type, but benefits dull, congested skin the most.Before I even put the mask on my face, I like it for a few reasons. First, it comes in a tube, which is both more hygienic and less messy than a jar. Then, the texture is more creamy than claylike, which makes the application easier. And finally, the bright, herbaceous scent is just…relaxing. I can’t tell what, exactly, it is—the rosemary oil, the lavender oil, the peppermint oil, unlisted chloroform, who knows—but I love it.I massage it in. I know that this step is technically for the purpose of releasing vitamin C, but it also does the same for my tension: It feels very calming, like a mental time-out. After all, how often do you take the time to massage skincare products into your skin? Sure, it’s not the same as having a licensed aesthetician doing it for you, but I also don’t have to tip, so.The mask eventually turns green and begins to dry. In the 10 minutes or so that it’s on, it never feels tight or painful. I actually forget it’s there altogether. And when I rinse it off, the mask melts off quickly—a plus. Most clay masks require a power-washer to remove, and I usually give up and learn to live with swipes of dried clay around my neck and hairline.While the experience itself earns five stars, the results get four. My skin tone looks slightly more even and a bit brighter, and my skin definitely feels smoother. I don’t notice much of an improvement in my pores, though, and it does nothing for a blackhead I keep fixating on.Still, it’s a mask, not a miracle worker, and it does what it promises by giving my skin a refreshed glow. Whether it’s the 10 minutes of zen or vitamin C, I’ll never know—but either way, it’s still better than what clay masks used to be.Buy it: Farmacy’s Bright On Vitamin C Mask, $38All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyTrendsRead MoreLifestyleDrunk Elephant’s D-Bronzi Serum Works Great As Long As You Mix It RightBy Deanna PaiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-07", "author": ["Condé Nast", "Deanna Pai"]}