{"id": "a955a96ea80dfe7088c32dace77f579b", "url": "https://www.bonappetit.com/story/best-cookbook-gifts-holiday-2020", "year": 2020.0, "month": 11.0, "day": 3.0, "content": "Best Cookbooks 2020 for Holiday Gifts | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseThe Cookbook Gift Guide That Covers EVERYONE You Know: 2020 EditionShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopUnder $35Under $100 (And a Few Splurges!)CookbooksRestaurant MerchHealthyish FavesMarcus's PicksGift Guide 2020The Cookbook Gift Guide That Covers EVERYONE You Know: 2020 EditionThe year’s best cookbooks also make the best gifts.By Alex BeggsNovember 17, 2020FacebookTwitterEmailPhoto by Laura Murray, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Cookbook gifts never get old, and neither does writing this guide. This is my third time gathering the year’s best cookbooks that also make fantastic gifts. I think really hard about it, trying to pair each book with the range of personalities out there. Even the grumps! Each pick answers “yes” to the question: Will they cook from it? But if, in the SLIM case this list didn’t cover that person you’re shopping for, whatever their deal is, get them Yossy Arefi’s Snacking Cakes. The title alone brings me happiness, but so does the fact that there are multiple peanut butter cakes. The recipes are easy, and they all result in cake. Now who else are you shopping for?For the friend who memorized their grandmother’s recipesOne of the year’s best cookbooks is In Bibi’s Kitchen, by BA contributor Hawa Hassan and Julia Turshen, a collection of grandmother-sourced recipes from eight African countries. The recipes are uncomplicated, comforting, and timeless, and the photos make them irresistible—you can almost smell the peanutty kunde (stewed black-eyed peas) on sight alone. The photos make a point to show the arms and hands of the women who have held much more—in their arms, and hearts—than just the bowl of stew you see. Each recipe has an interview with the grandmother behind it, which makes the act of reading this cookbook like an intimate conversation around the kitchen table. What a beautiful feat.In Bibi’s Kitchen$22 at Amazon$32 at BookshopFor the person who got into cooking this yearThey used to go out to eat three times a week, but during the pandemic they finally made their first banana bread (we all know at LEAST one person). Where do they go from here? Nik Sharma’s The Flavor Equation, that’s where. I don’t want to call it part textbook because the word textbook makes it seem boring, when it is not. Sharma writes like the friend you text while you’re cooking to ask, “If the shallots are black and disintegrating, is this ‘burnt’?” and the friend replies back and calmly explains the Maillard reaction, the different smoke points of oils, without making fun of your pan of charred shallots. Plus, the recipes are fantastic with plenty of technique photos. I made the lamb kofta with almond gravy, and the hazelnut flan is next.The Flavor Equation$32 at Amazon$32 at BookshopFor the vegetarian, or the person who tries to live by the “mostly plants” ruleMeera Sodha’s East is one of my favorite new cookbooks, and I’m ordering a handful of copies to give out to friends, family, and my neighbor Michelle who I once chatted with while she grilled a spaghetti squash. WHY: The range of recipes, based on Sodha’s travels around the globe, hop from a Sri Lankan cake here to an Indian curry there to a Japanese okonomiyaki over there. There are so many flavors at your fingertips. And the recipes are EASY. Every recipe is weeknight dinner material that happens to be vegetarian. I made the squash malai kari and a crispy Indonesian coconut-peanut condiment, serundeng, to top some brussels sprouts for dinner last week. Love, love, love this cookbook.East$29 at Amazon$32 at BookshopFor the cousin who sleeps with a Thermapen under their pillowYou know this nerd. Big fans of liquid nitrogen. They worship Harold McGee (get them Nose Dive, his new book on scent, too) and like to plan vacations around visiting molecular gastronomy restaurants. In Science and Cooking, they can read about the science behind some of those famous dishes as well as everyday dishes like macaroni and cheese (three Harvard professors explaining how mac and cheese works is my kind of dinner party). The reader can even perform mac and cheese experiments included in the book—and make grape spheres and cigar ice cream, if the mood strikes.Science and Cooking$32 at Amazon$32 at BookshopFor the coworker who named their stand mixerBuy The Good Book of Southern Baking for the cornbread recipe alone. Okay, maybe also the cornbread madeleines, banana pudding, and buttermilk pie. Those are the first things I plan to bake from this buttery cookbook by Kelly Fields, the baker-owner behind New Orleans’s Willa Jean, and Kate Heddings. It’s a great gift for me, or anyone who has a collection of cake stands, pie dough in their freezer at all times, and a Southern accent when they drink too much tequila.The Good Book of Southern Baking$26 at Amazon$32 at BookshopAnother winning cookbook for bakers is Snacking Cakes—whose recipes for peanut butter cakes I mentioned earlier. These are birthday cakes and midafternoon cakes that come together quickly and stressless. A friendly, fun cookbook for bakers of all experiences. Hel-lo, powdered donut cake!Snacking Cakes$17 at Amazon$22 at BookshopFor kids with elaborate play kitchensThey can’t be trusted with knives yet, so buy them Fry Bread. This award-winning picture book, written by Kevin Noble Maillard and illustrated by Juana Martinez-Neal, centers around the Native American dish fry bread—a puffy yeasted bread—and ends with a recipe. Kids and a big bowl full of dough do mix. It’s a beautiful book with a universal message about passing down recipes and culture through generations. (Fry bread has roots in American colonialism, but the kids will learn about that later.)Fry Bread$13 at Amazon$18 at BookshopFor my dad, or anyone looking for healthy dinner ideasMy dad is into cookbooks with a healthy focus, and I’m glad because heart health is no joke. He loved Bobby Flay Fit so much I’m not sure any cookbook will ever top it, but this year I’ll try with Skinnytaste Meal Prep. He’s currently on a gluten-free kick (daaad!), and there are plenty of GF recipes here to fit the bill, an entire freezer section, and a decent showing of brisket (brisket and barley soup, yum). I can see him getting excited about a lot of these recipes, from the turkey taquitos to the almond flour banana muffins.Skinnytaste Meal Prep$20 at Amazon$30 at BookshopFor the person who might already have all of these other cookbooksYou have to seek out an indie bookstore to find Jennifer McLagan’s latest book, BLOOD, a cookbook of just what it sounds like: blood recipes. Like blood brownies and blood meringues and blood buckwheat crepes. McLagan—whose books Fat and Bitter won James Beard awards—had trouble finding a publisher due to the taboo around blood, which is crazy to me. It’s a joy to read (“My supplier likens [blood] to orange juice; ‘don’t forget to give it a good shake before you use it,’ he tells me every time I buy it.”), and even if you’re not in a rush to make blood pasta anytime soon, you will learn a thing or two about the history of cooking with viscous, iron-rich blood and and actually cook with it. It’s a brilliant swap for egg whites in marshmallows, apparently. Definitely a unique gift.Blood$20 at Good Egg BooksFor the neighbor with backup tahini in their pantryI gushed over Falastin, a Palestinian cookbook by Ottolenghi right-hand man Sami Tamimi, in our spring cookbook roundup. And I stand by it—I’ve already given a copy to my friend who has never made the same hummus recipe twice (always in search of chickpea greatness). I look through Falastin for recipes I can marathon on a Saturday, a layered fish kofta casserole, doughy tahini buns, maybe I’ll do a shawarma spread for a football game—stuff that might take more time than I’m willing to commit to after work. It’s vegetarian-friendly too!Falastin$22 at Amazon$32 at BookshopFor the person who had to cancel a vacation this yearRosa Cienfuegos’s Comida Mexicana is a much-needed vacation to Mexico, or the closest you’ll get to one right now. It’s not region-specific (Cienfuegos actually lives in Australia now, where she has a Mexican tamaleria and deli); it’s more of an overview of Mexican street food favorites, from esquites to mangonadas. Cienfuegos’s enthusiasm pops off the colorful pages with help from avocado-slinging lucha libre characters. You can sense a hint of homesickness, but she knows that the best cure for it is to bring Mexico wherever you are—in your kitchen.Comida Mexicana$28 at Amazon$25 at BookshopLara Lee also has the cure for anyone homesick, or just deeply craving nasi goreng, in Coconut & Sambal, which centers around Indonesian food (Lee is half-Australian, half-Indonesian, living in London). It was just what I needed to get out of a cooking rut this fall. Think bright red, crispy-skinned, sambal-coated fish; kecap manis–glazed pork belly; and all kinds of super textured salads (we have a few recipes from Lee here to give you a preview). An absolutely immersive, mouthwatering cookbook.Coconut & Sambal$32 at Amazon$32 at BookshopFor the person who needs to relax their Spindrift intakeJulia Bainbridge, who has contributed to BA, has written THE cookbook of coincidentally alcohol-free drink recipes. And our former staff photographer Alex Lau has made them look so frosty I thought they were condensing on the page. Get this for the person who makes the cocktails in your life; they have the cute bar cart, the fancy cherries. The fact that these recipes are nonalcoholic is beside the point—this is a collection, as the title says, of GOOD DRINKS. A sour and sparkly grapefruit soda with pickle brine will put your flavored seltzer days behind you.Good Drinks$21 at Amazon$21 at BookshopFor the wannabe winoHow to Drink Wine is a fun read you can breeze through in one-to-three glasses of Chenin Blanc, depending on how heavy your pour is. It’s a great gift for the person who gets excited when you bring a new wine over but is unsure how to explore on their own and how exactly do you say “Sauvignon?” It’s not a giant wine encyclopedia but a book you’ll return to when you’re like, “What’s the deal with tannins again?” Each grape varietal discussed has a list of “If you like ____, try ____” that I’ve used over and over. I’m into Aligote now!How to Drink Wine$13 at Amazon$16 at BookshopThe shameless plug sectionSure, I’m biased because Claire Saffitz worked at Bon Appétit and I cross-tested a couple of recipes, but her cookbook, Dessert Person, is gorgeous, and get this: not entirely desserts. I made the mushroom galette with crispy breadcrumbs and have seen too many pigs-in-brioche blankets on Instagram to count. But the desserts are showstoppers of all difficulties, from pretty little marcona almond cookies to colossal French pastry creations. Get this for the “dessert person” in your life, obviously!Dessert Person$16 at Amazon$32 at BookshopThen we’ve got Serving New York, which BA senior designer Bryan Fountain cocreated with writer Kristin Tice Studeman. This is the arty-cool New York City–centric cookbook for the diner who mourned the day Uncle Boons closed and doesn’t want any other beloved restaurants to shutter during this ongoing pandemic—100 PERCENT of the profits go to ROAR, a nonprofit that gives aid to restaurants and their workers. This cookbook is for anyone who also wants to make Momofuku’s kimchi rice cake stew (me again).Serving New York$35 at Serving New YorkAnd yes! Our global brand ambassador Marcus Samuelsson has a new cookbook this year with coauthor Osayi Endolyn, The Rise, which you can also get in this *extreme shameless plug voice* holiday gift box that comes with a new BA tote and subscription. In The Rise, you can cook through recipes shaping Black American cuisine today, yesterday, and tomorrow, and read engaging profiles of chefs, including Mashama Bailey, BJ Dennis, and food scholar Michael W. Twitty. It’s a piece of in-depth food journalism in cookbook form, a hell of a combination.The Rise$34 at Amazon$35 at BookshopExplore Bon AppétitGift GuidesShoppingCookbooksHoliday 2020Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-16", "author": ["Condé Nast", "Alex Beggs"]}