{"id": "a95e9da6e79c5ccc980e1dc49b5f1506", "url": "https://www.bonappetit.com/recipe/giardiniera-antipasto-platter", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Antipasto Platter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueGiardiniera Antipasto PlatterBy Janice TiefenbachNovember 19, 20193.3(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA generous squeeze of lemon and a sprinkle of salt is what distinguishes good crudités from bad. (That, and no baby carrots.) The pickles and raw vegetables here keep things light before a heavy meal (as in, this pork roast, polenta, and red wine spaghetti), but feel free to mix and match depending on whatever’s your favorite. Serve with this creamy Pine Nut and White Bean Dip and zippy Pistachio and Mint Pesto. These recipes are all from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8–10 servings2–3lb. mixed raw vegetables (such as endive, cauliflower, carrots, radishes, and/or fennel), cut into bite-size pieces1–2lb. mixed pickled vegetables8oz. mortadella or other pork charcuterie, thinly slicedGrissini breadsticks, olives, and/or almonds (for serving)½lemonFlaky sea saltPistachio and Mint PestoPine Nut and White Bean DipPreparationArrange raw and pickled vegetables, mortadella, and breadsticks on a large platter in an aesthetically pleasing way. Squeeze lemon over raw vegetables; season with sea salt. Serve with dips.How would you rate Giardiniera Antipasto Platter?Leave a ReviewTell us what you thinkExplore Bon AppétitItalian AmericanAmericanSpringSummerStarterDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}