{"id": "a9693b4a139bbd2d19f7dc350b9219e1", "url": "https://www.bonappetit.com/recipe/lamb-chops-in-tomato-sauce", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Lamb Chops in Tomato Sauce Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDLamb Chops in Tomato SauceSponsored by FarmToForkFacebookPinterestTwitterEmailServes 4Cool yogurt sauce and a crispy cucumber salad complement richly spiced lamb chops and warm flavorful tomato basil sauce in this dish.PrintIngredients6 tbsp. extra-virgin olive oil1/2 cup finely chopped parsley leaves and thin stems, plus 2 tbsp. roughly chopped leaves3 garlic cloves, minced2 tsp. finely grated lemon zest3/4 tsp. Aleppo pepper flakes or substitute 1/4 tsp. red pepper flakes, plus more from serving1/2 tsp. tumeric1/4 tsp. ground cinnamonKosher salt and freshly ground black pepper8 Frenched lamb rib chops, (about 1 1/2 lb.)1  small shallot, halved and thinly sliced1 tbsp., plus 2 tsp. red wine vinegar1 cup FarmToFork Tomato Basil Sauce2 cucumbers, halved lengthwise and thinly sliced crosswise into half moons1 cup Greek yogurtRecipe PreparationIn a large bowl, stir 2 tbsp. of the oil with the finely chopped parsley, garlic, lemon zest, Aleppo pepper, turmeric, and cinnamon. Season lamb chops with salt and pepper, and rub marinade all over chops. Let sit 15 minutes at room temperature.Meanwhile, in a medium bowl, combine the shallots and 1 tbsp. of the red wine vinegar. Let shallots marinate at least 10 minutes and up to 30 minutes.In a large high-sided skillet, heat two tbsp. of the oil over medium-high and add the lamb chops in a single layer. Cook, turning halfway through, until the lamb is golden on both sides and medium-rare, about 2 to 3 minutes per side. Transfer to a plate. Drain fat from skillet and wipe skillet clean.Add the tomato sauce to the skillet and return to medium heat. Bring the tomato sauce to a simmer, stirring a few times, then remove from the heat and keep warm.Toss the cucumbers and remaining roughly chopped parsley into the shallot mixture and stir in the remaining 2 tbsp. of oil. Season with salt.Stir the yogurt with the remaining 2 tsp. of red wine vinegar. Season with salt.Dollop yogurt and warm tomato sauce on bottom of 4 plates. Top with cucumber salad and lamb. Drizzle any extra dressing in cucumber salad bowl over lamb and sprinkle with more Aleppo. Serve immediately.Sponsored by FarmToForkGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredFarmToFork™More from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}