{"id": "a96b2369ecfcd5def5dd853436623596", "url": "https://www.bonappetit.com/story/lunchtime-nachos", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "This Freestyle Nachos Recipe Is My Winning Lunch Strategy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Freestyle Nachos Recipe Is My Winning Lunch StrategyA kid-friendly route to eating vegetables.By Chris MoroccoFebruary 9, 2021FacebookTwitterEmailPhoto by Laura Murray, food styling by Susie TheodorouFacebookTwitterEmailI live on a lonely culinary island, built on (very thin) bedrock consisting of things I know, or believe, my family will eat. It is a small island. Fortunately, nachos are on that island with me, and nothing gets my family fired up like nachos for lunch.The key is never to mess with what my own kids believe to be the most important pieces of nachos, which are refried beans and sharp cheddar cheese. (They are wrong, but that doesn’t stop them from having opinions.) Working with that foundation, I can adapt my approach to whatever else happens to be in the fridge—using leftover sliced or shredded meat and topping them with salsa, yogurt, and/or herbs, depending on what I have.Watch the nachos come to life!\nHere is where I get my revenge. My base nachos recipe is so simple and relies on so many store-bought, ready-to-go products, that I still have time to work in a fresh vegetable. All I need is to follow this simple formula: slice, sear, and sprinkle. Thinly slicing even the bulkiest vegetables, like cauliflower, broccoli, brussels sprouts, or cabbage, then aggressively cooking them in a hot skillet and finishing with a shower of spices means they cook and develop flavor super quickly. This method is orders of magnitude faster than roasting in the oven and completely transforms the vegetables in the process. So much so that my kids don’t even protest.Cauliflower is a standout in this role, becoming vaguely shreddy like carnitas when tender and soaking up tons of flavor for similar intensity. Layered into the nachos during assembly, that spiced cauliflower adds balance to all the other intense flavors and textures going on. Also, let’s face it, if you work some veg into those nachos, you might feel perfectly justified in eating them at least once a week. As far as islands go, that sounds a lot like paradise.Get the Recipe:Lunch Nachos With Spiced CauliflowerTwo words: Lunch nachos!!!!View RecipeExplore Bon AppétitNachosLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Chris Morocco"]}