{"id": "a96e30b3ed7590ee2bb9ee254ff27354", "url": "https://www.bonappetit.com/story/old-el-paso-taco-seasoning", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Old El Paso Taco Seasoning Packets Are Wildly Inauthentic. I Love Them Anyway | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureOld El Paso Taco Seasoning Packets Are Wildly Inauthentic. I Love Them AnywayThere were no fresh tortillas or taco carts in our new town, so my mom did what she could with the Global Flavors section of the grocery store.By Amanda ShapiroFebruary 13, 2020FacebookTwitterEmailPhoto by Emma Fishman, food styling  by Pearl JonesFacebookTwitterEmailOn the shelf next to cans of black beans (low-sodium) and boxes of tacos (hard-shell), in yellow packets so slim you’d miss them if they weren’t so school-bus-bright, Old El Paso Taco Seasoning Mix had a permanent residence in my mother’s kitchen.We were white New Englanders with roots in Northern Europe via the Midwest. In other words, we were the poster family for mass-market taco mix. But there’s a little more to the story than that.My parents moved from New York to San Francisco as newlyweds and lived in and around the Mission, where my mom first fell in love with Mexican food. She’d buy fresh, cotton-soft corn tortillas and eat them with peanut butter. She loved the chorizo tacos dripping with fluorescent grease from the taqueria on her corner, the burritos as warm and hefty as the newborn (me!) strapped to her chest.She might’ve never left the Mission, but money and marriage troubles brought us back East soon after I was born. Our little family shrunk from three to two when my dad moved out; a year and a half later it grew to three again when my mom remarried. Five-year-old me wasn’t ready to share her mom with someone else, but I did like being the flower girl at their wedding. “Mom, can we do that again?” I asked when it was over, on our way to our new home.My stepdad had never been a parent; when he met my mom, he was a 40-something bachelor who ate pita sandwiches heated in a toaster oven for dinner most nights. The first time he made me breakfast, I had to talk him through the instructions on the instant oatmeal packet. (I was four.) Meanwhile I was used to my mom getting everything right: how hot to make the bathwater, which Baby-Sitters Club book to check out of the library, where my favorite ballet leotard was (the laundry, always). I had very little patience for training someone new.So, for many years, my stepdad and I were two separate planets, both orbiting my mother, the sun. He’d leave for work as I was getting up for school, and I’d be at rehearsals or choir practice or in my room with the door closed when he’d get home. We might go days without really looking each other in the eye.What’s better than build-your-own-taco night?\nPhoto by Emma Fishman, food styling  by Pearl JonesOur newly re-formed family had landed in a Connecticut town peppered with Italian-American restaurants, Irish pubs, and families who’d been there for generations. The only Mexican restaurant was called Aunt Chilada’s (it only took me two decades to get the pun), had a mariachi band wearing fake moustaches, and served hot dogs. So, to satisfy her cravings for rice, beans, and tortillas, my mom ventured into the Global Flavors aisle of our local Stop & Shop.She traded fresh salsa for the jars with the dead white actor in a sombrero, lard-cooked beans for the ones in blue cans, and hand-pressed tortillas for the hard-shell variety that came in a box. Those yellow packets of Old El Paso weren’t supposed to replace chorizo, but they could at least re-create the saucy meatiness she craved.The “recipe” on the back of the Old El Paso mix has you start by browning ground beef in a skillet. Let’s forgive my mom for swapping 99-percent fat-free ground turkey; it was the ’90s and fat was public enemy number one. After browning, you’d drain the fat (because evil) and dump in two-thirds cup water and the seasoning, “stirring often, until thickened.” This was my favorite part to watch: the watery mess becoming a glossy, spoonable filling thanks to the power duo of maltodextrin and corn starch.While the meat cooked, my mom would shred cheddar, chop tomatoes and onions, and make guacamole, the one thing she insisted on making from scratch. Then she’d call downstairs to my stepdad, who was probably finishing his 30 minutes on the NordicTrack, and we’d line up at the kitchen counter to build our tacos, racing back for extra scoops of guacamole until the bowl was wiped clean.It wasn’t until I spent four years in L.A.—and road-tripped all over California and Baja—during college that I understood the size of the divide between the “Mexican” food I grew up eating and the cuisine that inspired it. But even as I got older and became a fussier, snobbier eater, whenever I went home to see my parents, taco night still tasted good to me. That’s also when I started to see my stepdad differently: not as a surrogate father or an inconvenient houseguest, but as my family—as someone I loved, someone who had a weird quiet sense of humor, strong opinions, and some wild stories to tell.They were two impossible tasks my mom had taken on: conjuring up the Mission in her Anglo kitchen in our red-sauce town, and conjuring up a new family from scratch. I don’t know that she could’ve succeeded at either, but what she did give us was a dinner ritual. And at a time when we were adrift in so many ways, that was worth a lot.Amanda Shapiro is the editor of Healthyish.Want More Stories From Taco Nation? Right This Way...Sorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoCooking in the Midst of a Border Crisis Is About More Than SurvivalWhy Are H-E-B’s Flour Tortillas So Dang Good?And so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Amanda Shapiro"]}