{"id": "a97216e088fa10c785a13796542af061", "url": "https://www.bonappetit.com/story/cherry-biscuit-cobbler", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "I Was a Diehard Pie Person—Until I Made This Cobbler | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Was a Diehard Pie Person—Until I Made This CobblerLeave it to Claire Saffitz to make a dessert that’s easier, faster, and more foolproof than pie—and, oh yeah, just as delicious.By Claire SaffitzMay 23, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailI thought no summer dessert was more quintessential than a golden, crispy-lidded pie, bubbling with juices. But that was before I tackled this cherry biscuit cobbler. I was thinking—really, hoping—that a great summer fruit dessert that didn’t require all the chilling, rolling, and assembly of pie must exist. After a couple of trials, I landed on a recipe that has it all: equal parts juicy cherries and fluffy, easy-to-assemble biscuits; plus tastes just as good fresh from the oven for dessert as it is cold for breakfast the next morning.I was skeptical at first because I never really liked cobbler. So often I found the topping soggy and wan and the fruit lacking in real flavor. But using cherries as the fruit base gave me a significant advantage: Because cherries take longer to release their juices than do larger stone fruits like peaches, the biscuits have time to begin cooking through before the filling drowns them in liquid. Sog problem, solved. (And if the idea of pitting two pounds of cherries bums you out, you can use frozen cherries, which perform beautifully.)To amp up the filling’s flavor—and keep it from being overly sweet—I added a full a quarter cup of lemon juice. For symmetry and balance (and because no part of the lemon should go to waste), I mixed the zest into the biscuits for a whiff of lemony essence.The biscuits should fit tightly together.\nPhoto by Alex Lau, Food Styling by Sue LiThe biscuit dough itself is dead simple. Whereas finicky pie pastry fights an uphill battle against heat and humidity, this dough is extremely forgiving: Many biscuits use a mix of buttermilk and butter or heavy cream alone, but this recipe calls for a combination of butter *and* heavy cream. All that dairy fat coats the flour and inhibits gluten production. (Gluten is that stretchy stuff that makes bread chewy, so less gluten equals more tender biscuits.)Once the dough is rolled into a slab (pro tip: the colder the ingredients, the easier it will be to handle), it’s cut into four quadrants, stacked, and then rolled out again before being punched out, just like in BA’s best buttermilk biscuits. This is a crucial step for tall, light biscuits because the butter pieces flatten into thin sheets; in the oven, those sheets release steam, forming flaky, separated layers. The final step is to arrange the smaller-than-normal biscuits tightly in the baking dish, which also helps them rise upward rather than outward. The result is a cobbler with light, tender, moist biscuits that look downright adorable.For those who don’t want to bother with pie pastry, or just for those who’d rather not spend their time in the kitchen, this is your dessert of the summer. It’s so delicious, and so fantastically easy, it might just take the place of pie in my summer dessert repertoire.Get the recipe:Cherry Biscuit CobblerWhy choose between shortcakes and cobbler when you can have one dessert that combines the best of both?View RecipeExplore Bon AppétitCobblerCherryDessertRead MorecookingBerries and Cream: The Best Summer Dessert to Make NowBy Carla Lalli MusicStone Fruit CobblercookingGet Lost In the Swirls of This Strawberry-Coconut Ice Cream PieBy Alex BeggscookingEton Mess Is Summer’s Easiest DessertBy Carey PolisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-23", "author": ["Condé Nast", "Claire Saffitz"]}