{"id": "a97461418d5ba236cff54ebb52b1140a", "url": "https://www.bonappetit.com/story/peter-glatz-65-year-old-line-cook", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "This 65-Year-Old Dentist Left It All Behind to Work the Line at America’s Best New Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI’m a 65-Year-Old Dentist Who Left It All Behind to Work at America’s Best New RestaurantDr. Peter Glatz gave up his four-decade-long career to work 12-hour days as a line cook. Now, he’s never been happier.By Peter Glatz, as told to Elyse InamineMay 14, 2019FacebookTwitterEmailPhoto by Rachel MaucieriFacebookTwitterEmailA couple weeks ago, we spotted an unfamiliar—albeit friendly—face on Nonesuch’s Instagram feed. It belonged to 65-year-old Peter Glatz, who, we learned from the post, had recently sold his dental practice of 40 years to embark on a new career in the kitchen. We were charmed and curious by the new addition to the OKC restaurant’s team, so I hopped on the phone with Peter to learn more about how he ended up on the line at the place we named America’s Best New Restaurant in 2018. Turns out his journey is far more engaging than we could have predicted. I’ll let Peter take the story from here. —Elyse InamineChapter 1: The Two-Dish CookI started cooking to impress girls. I was in high school and I had two dishes in my repertoire: chicken Parmesan and a Chinese tomato and beef dish, both from the Antoinette Pope School Cookbook I found lying around my house in Arlington Heights, a suburb of Chicago. I remember thumbing through the yellow book, seeing those recipes, and thinking they looked easy. I worked at a grocery store with older kids who had apartments, which they let me use for my dinner dates. I’ve always been real methodical and detail-oriented, so I’d bring over little containers of ingredients I prepped at home to cook there. I probably made these dishes half a dozen times. They were pretty good, and I developed a reputation for knowing how to cook.When I went to the University of Illinois to study art, I added bread baking to my repertoire. I’d get into the dorm kitchenette on a Friday night and bake as I studied. The aroma would bring everyone in. That was my way to meet new people. It’s how I met my late wife in the middle of my freshman year. I was smitten, and I decided that if this leads to family, then I better do something that would lead to income. That was my father’s influence. He told me, “Don’t be in the arts. You won’t make any money. Be a dentist.” He was an art major too, but never pursued the career and ended up being a salesman for washer machine labels. We got married after my sophomore year, and I went to dental school right after we graduated.But I always tried to find ways to bring art into dentistry. During dental school in Chicago, I apprenticed at a lab and learned how to make crowns out of cast metal and porcelain. It was like making little sculptures. When I finished school, I moved to my wife’s hometown of Springfield, Illinois, and started my own practice. I would make my own crowns while I waited for the phone to ring.Chapter 2: Cooking for Dead HeadsDentistry was good, but I’m a thin-skinned person. Most people in the chair would rather not be there. Patients would express emotions, and I would take it personally. But cooking brought me a lot of pleasure; to cook for someone and make them happy made me happy.My wife was always into food too. She started a catering business, converting our farm house into a commercial kitchen to teach cooking classes. Then she developed mobility problems and started writing a cooking column for the local alt weekly, the Illinois Times.Home was her domain; she did all the cooking and I did all the dishwashing. But the outdoors were mine. I’m a longtime Grateful Dead fan, so I’d go to summer festivals, camp out of my van, and cook for whoever passed by. I made big paellas, pad thai, steak, gumbo. I was socially awkward back then, and even now I’m not someone who can walk up to a group of strangers and strike up a conversation. But at a music festival, I’d be by myself, cooking some garlic in olive oil, and people would walk by and say, “Boy, that smells good. What are you doing? Can I watch?” You meet people that way and they hang around.Six years ago, I got a bus after my wife totalled the van. We took everything out and built cabinets, bunks, and a kitchen. I just loved it. I sleep so well in there. When bands came by at festivals, I started cooking for them. One time, I got a call to cook for Johnny Cash’s team outside of Nashville. I was like, Oh, maybe I can do this for a living.Chapter 3: Staging Everywhere and AnywhereI first learned about stages while reading Bill Buford’s Heat about six years ago. I thought it would be cool to go into a restaurant kitchen without having a culinary degree. That prompted me to reach out to chef Iliana Regan of Elizabeth in Chicago. I’d read in one of the city’s local magazines that she started doing dinners at her apartment on the weekends and developed such a following that she opened her own brick and mortar. That sounded so cool to me. So I contacted her, told her who I was, what interested me, and asked if she would consider letting me come in. She said yes. So over the next few years, I’d drive from Indianapolis to Chicago every weekend to stage at the restaurant.I liked prep. I liked doing detailed work. I liked working with a knife. During service, I just liked the way things flowed, the energy. Iliana was the best teacher, mentor, and supporter. We’ve become very close. She even invited me to her wedding at a summer camp she rented out, and I jumped into the dining hall kitchen to help out. She looked at me and said, “You really are at home in the kitchen, aren’t you?”Three years ago, my wife passed away. Her editor asked me to take over her column. At that point, I was pretty numb. I had a hip replacement the month before she passed. I was struggling to rehabilitate. But if you ask me to do something, I’ll do my best. I had to dig deep to write the column, since I wasn’t a trained chef and didn’t consider myself a highly experienced home cook. That’s when cooking went from being a casual hobby to something I wanted to study and learn.Once I realized that this was what I really wanted to do in life—and I’m getting such a late start—I pushed harder. I put up my dental practice for sale, and as part of the purchasing agreement, I worked for two days a week for two years. But the rest of the time, I wrote and cooked.I staged at La Petite Grocery in New Orleans, worked the line the first time at Zingerman’s Roadhouse in Ann Arbor, Michigan, and interned at Vicia in St. Louis, Missouri. Anytime I was traveling and eating at restaurants, I asked to work in the kitchen. When my son, who lives in Vermont, and I met at Joe Beef in Montreal a couple years ago, I asked the bartender if I could stage for the week. They put me outside, on this beautiful patio, to shell fava beans. I enjoyed being there but didn’t really learn much until David McMillan, the chef, saw me. He was like, “What the fuck, you came all this way to shell fava beans?” We talked all afternoon and became good friends by the end of it. I’m even in the cookbook.Chapter 4: Nonesuch, the Dream JobLast December, I finally retired my dental practice. I worked at a more high-volume restaurant in Indianapolis to get more experience, helped here and there at Elizabeth, and got engaged to my current wife. She was an old family friend who was going through a divorce and living with relatives. I had this big empty house, so I gave her some space. I was sleeping in the bus anyway because it was more comfortable than being in that house full of so many memories. One night, we had dinner together in the house. I didn’t return to the bus that evening.After we got married, we thought we’d just get rid of everything, jump in the bus, and take it on a road trip, hosting pop-ups along the way. Kind of like how Iliana got started. Then, earlier this year, I saw that Nonesuch was looking for line cooks on Instagram.I first heard about Nonesuch last August, when I came across the Bon Appétit video announcing it as 2018’s best new restaurant in America. I forwarded it to my fiancé and said, “I want to work here some day.” I started following them on Instagram right after.I never seriously thought I would move to OKC, but I still applied for the job. I sent my CV, with all 40 years of my dental experience, thinking I wouldn’t hear back. Then I got an email from the general manager to do a working interview, so I drove over.I was there for two days last February. I had a strong feeling that this is a really interesting place and there was no way in hell they were going to hire me. Just the precision, the standards, the decorum, the environment are so elevated. At Nonesuch, it’s a super dynamic kitchen. To do a 10-course tasting menu, you need to be organized, and everyone needs to multi-task and communicate clearly. It’s amazing to watch.My first day, I made a few mistakes during service, but I never got yelled at. Everyone was very calm. I was on the hot side and I was responsible for the bison testicles, dropping them in tempura batter and deep-frying them. When it was time to fire, I got flustered and forgot to batter them. I ruined six of them. After service, I remember calling my fiancé and telling her I screwed up and that they wouldn’t offer me the job.The second day, I felt like I was no longer under the microscope—that I should just relax, do the best I could, and learn what I could from the experience. By 11 p.m., I found out I got the job. I was shocked, and I was elated. But then I remembered my fiancé and realized I’m not the only person affected—that we wanted to be these wandering cooking nomads. So I told Colin Stringer, the chef, that I needed to discuss it with her. Her immediate response was that this is too good to pass up. So we got married at Elizabeth—I even helped cook—and two weeks later, we loaded up the bus and moved to Oklahoma City.Chapter 5: Life as a Line CookI just completed my third week as a line cook. It’s been challenging, exciting, and physically demanding. I work 12-hour days, four days a week. Work, come home, sleep, repeat. But I feel like I’ve just turned a corner. I don’t need other chefs to help me finish up a project or plate a dish. I can pull my own weight. After a really good service last week, the energy was high and the staff wanted to go out for drinks. I told them my wife was at home and didn’t want to go out, but they said, “We’re family now,” that they wanted to get to know her better. So she joined us.Retiring and playing golf all day has zero appeal to me. In my mind, I want to hit it really hard for five years and see where I land. I would like to work at Joe Beef or maybe Iliana’s new place, Milkweed Inn, in Michigan’s Upper Peninsula. I want to maximize my opportunities for the next five years. I’ll be 70 by then. I don’t know if it’s a restless spirit, but I’m just someone who needs to keep creating and feeding people. I derive a lot of satisfaction from that.For people my age or in the middle of their working lives, it takes courage to pursue a passion, to reinvent yourself. It’s scary to go out into the unknown. But making this decision to finally do it has been so beautiful, exciting, and fulfilling for me—a 65-year-old man with a background in dentistry. I guess it’s been helpful, at least, that I was already pretty good with a tweezer.Explore Bon AppétitFirst PersonRead Morebest-new-restaurantsNonesuch in Oklahoma City Is the #1 Best New Restaurant in America 2018By Andrew KnowltonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-14", "author": ["Condé Nast", "Peter Glatz", "As Told To Elyse Inamine"]}