{"id": "a983ea20ceff44d6d4222388e49c5a3e", "url": "https://www.bonappetit.com/recipe/marranitos-enfiestados", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Marranitos Enfiestados Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueMarranitos EnfiestadosBy Rick MartinezDecember 1, 20204.2(28)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“Mexican food is not subtle,” says Rick Martinez. “But the popular pig-shaped cookies known as marranitos (or puerquitos, or chochitos, or cochis, depending on what part of the country you’re in), showcase the beauty of one ingredient: piloncillo, an unrefined dark cane sugar with a smoky molasses-caramel flavor. I love these cookies just as they are and have eaten them in almost every state in Mexico (seriously: 26 of 31, plus CDMX). But for the holidays I’m giving them my personal Sugarman touch. You know, a ‘these are gonna win the swap and then break Instagram’ kind of touch. So obviously they’re done in Beyoncé-inspired cow print with two ginger-spiced doughs—the darker one with traditional piloncillo and the lighter one with agave syrup. Plus an outline of colorful sprinkles or sanding sugar, because these piggies came to party.”Ingredients1½cups (210 g) whole wheat flour1Tbsp. ground cinnamon1Tbsp. ground ginger1tsp. ground allspice¼tsp. ground cloves1tsp. baking powder½tsp. baking soda3¾cups (469 g) all-purpose flour, plus more for dusting12Tbsp. (1½ sticks) unsalted butter, room temperature, divided½cup (100 g) plus 1 tsp. granulated sugar1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided3large eggs, room temperature2tsp. vanilla extract, divided⅓cup light agave syrup (nectar), honey, or light corn syrup½cup (100 g) grated or granulated piloncillo or (packed) dark brown sugar⅓cup robust-flavored (dark) molassesNonstick vegetable oil spraySanding sugar or sprinkles (for decorating)Special equipmentA 4\" pig-shaped cookie cutterPreparationStep 1Whisk whole wheat flour, cinnamon, ginger, allspice, cloves, baking powder, baking soda, and 3¾ cups (469 g) all-purpose flour in a medium bowl. Using an electric mixer on medium-high speed, beat 6 Tbsp. butter, ½ cup (100 g) granulated sugar, and half of salt in a large bowl, scraping down sides of bowl as needed, until light and creamy, about 3 minutes. Add 1 egg and 1 tsp. vanilla; beat to combine. Add agave and beat just until smooth. Reduce speed to low, add half of dry ingredients (if you have a scale, use it!), and beat to combine, scraping down sides of bowl as needed. Dough will be slightly sticky. Wrap in plastic; pat into a square about ¾\" thick. Chill at least 3 hours and up to 1 day.Step 2Clean bowl and beaters. With mixer on medium-high speed, beat piloncillo, remaining salt, and remaining 6 Tbsp. butter, scraping down sides of bowl as needed, until light and creamy, about 3 minutes. Add 1 egg and remaining 1 tsp. vanilla; beat until combined. Add molasses and beat until smooth. Reduce speed to low; beat in remaining dry ingredients, scraping down sides of bowl as needed. Wrap in plastic; pat into a square about ¾\" thick. Chill at least 3 hours and up to 1 day.Step 3Place racks in upper and lower thirds of oven; preheat to 350°. Line 3 baking sheets with parchment paper and lightly coat with nonstick spray. Cut both doughs into about ¾\" pieces. (Don’t worry about being super precise; spots will look better if pieces are different shapes and sizes.) Arrange about half of brown and white dough pieces, touching and alternating colors, in an even layer on a lightly floured piece of parchment. (Chill remaining dough while you work.) Roll out ¼\" thick. Punch out cookies with lightly floured cutter and transfer to prepared baking sheets, spacing ¾\" apart. Arrange scraps in a single layer so they are touching and cover with plastic; chill 10 minutes if soft. Roll out scraps and cut out more pigs. Repeat with remaining dough and scraps.Step 4Beat remaining egg and remaining 1 tsp. granulated sugar in a small bowl. Using your finger, rub egg on brown spots only (egg will darken the spots) and along edges of cookies. Sprinkle sanding sugar or sprinkles along the edges of cookies, gently pressing into dough to adhere. Chill 10 minutes.Step 5Working in batches, bake cookies, rotating baking sheets top to bottom and front to back halfway through, until puffed and light spots are golden, 10–12 minutes. Let cookies cool 10 minutes on baking sheets, then transfer to a wire rack. Let cool completely.Do ahead: Cookies can be made 2 days ahead. Store airtight at room temperature.How would you rate Marranitos Enfiestados?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleReally nice cookie for the Christmas dessert table! Spiced but not overly so, just the right amount of sweetness, plus the checkerboard-like pattern made them look way more professional than they would have otherwise. Would definitely make these again!SarahIN12/31/2020Love the cute little piggies! Having a scale has changed my baking life! Both of the doughs were just right.  Used the piloncillo and agave. Great color and flavor differences between the two doughs. Punched out plugs of dough with a donut hole cutter and switched the colors that way; it worked easier for me than chopping and trying to get the cold dough to reform to roll out. Got rave reviews from family. AnonymousRenton Washington 12/26/2020A lot of effort that turned out completely disappointing. The lighter dough was too dry and the darker one too wet. They didn't roll out easily. While the final cookie presented nicely, the flavor was so subtle that it was almost non existent. The cookies were dry and bland.  Threw out the remainder of the dough and started over on a different cookie recipe. AnonymousLA,CA12/25/2020It’s a good cookie, but the hassle isn’t worth it. I followed the directions exactly as they are and came out with soft, dual-colored ginger bread cookies. It’s good, but I could also follow a simpler recipe. AnonymousNebraska 12/24/2020Just finished making these and they're as close to the real deal as I've ever gotten. I like them because most panaderias only have the one color and no sprinkles, so these were very festive!  I made sure to get the piloncillo from my local hispanic supermarket (note: If you're like me and tried grating the piloncillo, just use a molcajete (mortar & pestel) to break it up into a granulated form and save some time.) Looking at the other comments, the piloncillo and the dark (robust) molasses is what should give you that darker color.  If you can't get piloncillo, the molasses with dark brown sugar should give you that darker color, it'll just be a different flavor. If you use light brown sugar, odds are it won't be any different than honey or agave. When it comes to arranging the dough, set up it up like a checkerboard and then roll it out. For people who were saying they're dough was dry--like Rick says, if you have a scale, use it. If you go based on cup measurements, you'll likely use more flour than necessary. I started out using cups, but weighed out all my flour to be sure and had to take some out. The only other thing I would add is don't forget to chill the dough at the appropriate times and to keep an eye on the cookies. Mine cooked faster than the 10 minutes recommended. Erica EMilwaukee, WI12/22/2020Cute cookies but mine came out very dry. The dough was so dry that I ended up having to put extra liquid (maybe I should have added extra fat?). It ended up affecting the texture when baked. Its a lot of work for a dry cookie. Bummer Sophia Colorado12/18/2020This recipe wants a video.JessicaToronto 12/17/2020These turned out delicious and subtle, I've never had the original style so I don't know how they measure up. My dough was definitely all the same color, so that whole bit was a little silly. They are just brown cookies. I used honey instead of agave nectar, and light brown sugar instead of dark, but otherwise went by the recipe exactly. Idk what ingredient was supposed to change the color. I appreciate the spirit of the the thing though. And the sprinkles were a great addition! Thanks for the recipe!EllenLos Angeles12/16/2020These cookies smell divine but the dough was dry and never came together - both the lighter and the darker dough. Was it much flour in the recipe? The whole wheat? I added some water, which helped, but I don’t think I’ll be remaking this recipe anytime soon.AnonymousSeattle 12/7/2020This is a great recipe! These are one of my friends' favorite Mexican desserts and I always wanted to make them myself. Rosa CastilloGreensboro, NC12/3/2020Explore Bon AppétitCookieDessertMexicanLatin AmericanSnackNut-FreeBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Rick Martinez"]}