{"id": "a9a03fa8685d9ee5aaada96d310e6f09", "url": "https://www.bonappetit.com/story/trader-joes-december-2021-reviews", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "Trader Joe's December Product Reviews Are in and Apparently It's Supersized-Everything Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Supersized-Everything Season at Trader Joe’s Right NowLarge fusilli and foot-long chocolate bars are making the case for more is more.By Alex BeggsDecember 22, 2021FacebookTwitterEmailFacebookTwitterEmailLike most people, I wanted to end the year spooning an entire tub of Trader Joe’s truffle burrata into my mouth in a bubble bath of sparkling cranberry cocktail, but the commerce gods had other things in mind for me. Beef things. Pumpkin things. LARGE things. The burrata was sold out. At least I got the Truffle Cream Filled Gnocchi, though. (I guess it’s truffle season???) There are a few good new finds this December, but before we get to those, let’s look back on yet another topsy-turvy year reviewing as many new Trader Joe’s products I could get my hands on in the state of Michigan. My 10 favorites, with an extreme bias toward snacks, were:Breaded Fried RavioliSesame Crusted Hardwood Smoke Ahi TunaCrispy Jalapeño PiecesMatcha NoodlesVanilla Bean PasteUbe Ice CreamAlmond Butter Filled Pretzel NuggetsHot Cocoa SnowmanSpicy Mango LemonadeCheesy Seasoning BlendOkay, onto the new stuff!Truffle StuffTruffle Cream Filled GnocchiLittle puff balls of potato dough filled with oozy truffle cream. Fry these up, douse them in brown butter, and pop them one by one into your mouth until you feel content and clogged. The truffle extract flavor reminds me that this is the closest thing I have to shaving real truffles on my omelets like Martha Stewart. It’s middle-class fancy. And I’ll take it.Mushroom & Truffle Flavored PestoUnpleasantly and distractingly oily. The truffle extract is intense, and after two crackers’ worth I’d had enough. But I’ve also had worse. So there’s always that.Beefy BitesPorcini Boneless Beef Loin RoastI like the way that it looks like a bloody, severed shin when you take it out of its plastic body bag. And while the packet does not instruct you to brown the loin before roasting it, this cooked up nice and pink. The porcini crust brings a hint of umami, which is why, I’m guessing, this is $30.Beef en Croute BitesI’m here for the flaky “en croute” (puff pastry) but not so much the beef (a mix of mushrooms and minced meat), which is gray and crumbly. I think they should have made these all mushroom, cranked up the seasoning, added some Gruyère, and everybody goes home happy with their appy.In the Holiday Spirit or WhateverLight Egg NogDiet egg nog is an oxymoron, but I’ll try anything once if the company’s reimbursing me for it. They go hard with the food coloring so this is as yellow as reindeer piss and it tastes just as astringent. Poured down the drain. Sticking with my Uncle Bud’s homemade SwaugNog (a story for another time; there’s an ex-wife involved, a secret recipe, and 72 eggs), which he mails across the country every holiday. Just got the 2021 vintage today!Roasted Cauliflower and OrzoLumpy and bland.Cornbread StuffingMushy and tanned.Seasonally Depressing (Well, Some of Them)Peppermint BrowniesThese are so toothpaste-y that I’m going to swish them in my mouth and spit them out before bed every night until Santa brings me a brand new box of Sensodyne.Pumpkin BagelsIf you like cinnamon raisin bagels (*all of New York City logs off*), you’ll like these because that’s what they taste like. Smash them with butter and salt, or with cream cheese, or with cinnamon sugar, or peanut butter, or allergen-free granola butter. Lotta options.Gluten Free Pumpkin Spice BagelsStrong clove comin’ through, and the rice flour isn’t bouncy as much as it is chewy. Hopefully they break down more in my compost than they did in my mouth.Spiced Pumpkin Goat CheeseI asked my friends to taste this and guess what flavor they thought it was. First, they had to knife the sticky, paste-like cheese on crackers and it broke every single one. This stuff could caulk your bathroom tile. Everyone closed their eyes and said, “Raisin?”Stocking Stuffer WinesWhat these wines lack in quality they make up for in adorable packaging and you know what? They’re the perfect size to cook with. When a recipe calls for ¼ cup of wine and you don’t want to open a full-size bottle you intended on savoring every last drop of, grab one of these from your stocking instead.For the PantryPesto RossoThis cashew and tomato paste pesto reminds me of Molly Baz’s red pesto, though it’s milder and less complex. I liked it with the World’s Largest Fusilli but, then again, everything tastes better on a comically huge corkscrew.Quite Possibly the World’s Largest FusilliLarge and IN CHARGE. You know how, with most pastas, you can get like 4–17 noodles in your mouth with every bite? These supersized fusilli, crazy bastards, are so big that it’s a one-per-bite kinda night. When I saw my dining companion cutting his in half, I shrieked, “WHAT ARE YOU DOING? EAT IT WHOLE, YOU COWARD!” As I shoved three fusilli in my mouth, choking, eyes bulging, wondering if this is how I die.Entertaining Crackers DuoThey should have called this The Odd Couple o’ Crackers, because half of the crackers are seedy edible coasters and the other are papery holy wafers. There’s no middle ground, and it’s absolute CHAOS. Get the Scalloped Cracker Trio instead. They look like flowers.Pound Plus Milk Chocolate Bar with Caramel, Pretzel Bits & Sea SaltA huge, computer keyboard-size bar of chocolate with pretzels and caramel and milk solids. The squares are as big as a Mr. Goodbar, and I’m not sure what to do with myself around this thing. It’s milk chocolate with prizes—it’s fantastic. But every day I come downstairs and see it on my table and I swear it’s getting larger. Soon it’s going to swallow my house whole and I’ll be crushed within the giant milk chocolate squares. And then a “snarky” and “jaded” food writer will taste it and write: “It has a bitter, bony aftertaste, but I just can’t put my finger on the source.”Vegan Buttery SpreadHere’s what I’m wondering: At what point is vegan butter just margarine? This is made from a blend of several oils, and it spreads on toast just fine, just fine indeed.Organic Split Pea SoupA rerelease that has presumably been improved since it was last on shelves, this is puréed, barely seasoned soup and I don’t have much more to say about the matter.Indian Fare KitchariThey threw every grain and lentil and chia seeds and two types of millet in this pouch full o’ kitchari so the texture is pebbly like the shores of distant seas. I prefer the fresh brightness of spices bloomed in oil or ghee when you make it at home, plus, so easy!Freezer TalkSouthwest Style Chicken QuesadillasIf you’re cooking a quesadilla for 15 to 30 minutes, something is very, very wrong. You could buy all the components of a damn good quesadilla at Trader Joe’s: chicken, Cowboy Caviar corn salsa, shredded cheese, some spices, and even guacamole on the side, and it would come together faster and tastier than this frozen one. I liked the chicken and cheese mush inside of it, but I was mad that I had to roast a quesadilla for 30 minutes.A Dozen MacaronsThe mini macaron was a little too gritty and didn’t dissolve in the satisfying way a fresh one does. But they sure look cute.Chocolate Bundt Cake with Butter Cream FrostingI cut into this defrosted chocolate cake and microwaved the packet of frosting while watching Spencer with my family, which is the opposite of a food movie (lots of puking). “It’s as bad as this movie!” everyone declared. The buttercream solidified and cracked like a dried booger on your winter parka arm sleeve, and the cake itself was crumbly and lacking in, um, flavor. Not nearly as good as Trader Joe’s Dark Chocolate Ganache Mini Sheet Cake, or my favorites, the little mousse cakes in various seasonal shapes (right now they’re presents).Corn & Cheese ArepasA little sweet, very cheesy, and immensely comforting.Vegan Thai Green CurryGreat! Though skimpy. There’s maybe a ½ cup of spicy green curry and two pieces of tofu in the package, a ton of sticky rice, and, like most of my taste-tests of Trader Joe’s new foods, I was left wanting more, more, more!See you in January.Explore Bon AppétitCultureTrader Joe'sRead MorecultureTrader Joe’s Did the Oat Milk Ice Cream ThingBy Alex BeggscultureTrader Joe’s Green Bean Casserole Bites and Other New Stuff, ReviewedBy Alex BeggscultureWhat’s New at Trader Joe’s: Pumpkin Stuff, DuhBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-22", "author": ["Condé Nast", "Alex Beggs"]}