{"id": "a9adc6e3895e54249219a78428c0879c", "url": "https://www.bonappetit.com/story/8arm-fried-oyster-mushroom-taco", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Atlanta’s Most Exciting Taco Doesn’t Come From a Taqueria | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorerestaurantsAtlanta’s Most Exciting Taco Doesn’t Come From a TaqueriaGeorgia-based, California-born, Mexico-rooted chef Maricela Vega can sum up her complicated identity in one dish: the fried oyster mushroom tacos she serves at Atlanta’s 8Arm.By Elyse InamineFebruary 13, 2020FacebookTwitterEmailPhoto by Rinne AllenFacebookTwitterEmailIn Dish Decoded, we break down all the components, stories, and techniques behind a restaurant’s... well... dish that we’re obsessed with right now.“This tastes like Atlanta.” That’s what diners tell chef Maricela Vega when they try the crispy mushroom taco at her restaurant, 8Arm in, yes, Atlanta. Maybe it’s because of the intensely hyper local sourcing of the ingredients. Or maybe it’s because the flaky texture reminds them of the pride of the ATL: wings! But one thing is certain: This is a taco that bridges both the flavors of Mexico and the South.Inside the wonderful world that is 8arm\nPhoto by Kevin BrownThe MushroomsFor this dish, Vega draws inspiration from the family fish fries her Uncle Jose hosted in Guanajuato. But while he hauled coolers full of shrimp and oysters, Vega goes vegetarian with fat oyster mushrooms from Qihe Mushroom Farm in Newnan, Georgia. She dunks the shrooms in aji-pepper-spiked coconut milk before dredging them in locally milled cornmeal—a sweet blue variety from South Carolina’s Anson Mills or vibrant red bollito from Buckeye Creek Farm just north of Atlanta—then fries them till they crackle.The RajasThis year, Vega was blessed (or cursed) with a surplus of aji peppers, as in 250 pounds of them. That’s the nature of working with local farms, but she isn’t complaining. She’s turning them into rajas, a chile-based condiment that “hits you immediately, like a jab.” To make it, she starts with acid—maybe leftover chamomile vinegar or apple cider vinegar with a bit of lime juice—then layers sliced garlic and onion, salted and dried aji, and Greek oregano, hotter and earthier than the Mexican kind. The result is spicy, tangy—and gone within a few days.The FrijolesVega tried black beans for the requisite frijoles, but they didn’t compare to Anson Mills’s nutty, creamy Sea Island red peas. One of her old chefs introduced her to the Low Country gem—a staple in Hoppin’ Johns and Gullah “reezy peezy”—and since then she’s been cooking them down with aji, onions, preserved tomatoes, and her mom’s smoky chile negros for a guisado-style mash. “It makes this taco feel Southern,” she says, “without compromising.”The SalsaWhen tomato season’s long gone, Vega conjures up chile tamulado, a Yucatan-style salsa of charred habaneros, garlic, and sour orange juice that gets its name from the Mayan word for mortar and pestle. She roasts habaneros from Mena’s Farm on Atlanta’s Westside, then blends them with local garlic and citrus. Finished with a little salt, the salsa is so sweet and smoky that you won’t miss the tomatoes.The TortillaFifty percent Oaxacan yellow corn, 50 percent Georgian yellow corn—that’s the masa blend Vega works with for her lithe tortillas. She picks it up from Minero, chef Sean Brock’s Mexican spot across the street, and mixes it with a little water to shape the tortillas so they’re pliable, not crumbly, and hefty enough to support sauce. “The salsa and rajas release liquid, so the tortilla needs to be thick, like a folder,” Vega says. Once flattened in her tortilla press, she cooks the tortillas in a hot cast-iron pan—no oil, just pure sweet corn flavor.The ToppingsTo balance out all the smoky, spicy, and fermented flavors, Vega crowns her taco with what she calls “palate cleansers”: thin rounds of crunchy Easter radishes, intensely grassy cilantro from local urban farming collective Grow Where You Are, and ribbons of raw kale. “Is it still in fashion? I’m not sure!” she jokes. “But it’s a good winter green that adds a bit of freshness.”Chef Maricela Vega\nPhoto by Ryan FleisherWant More Stories From Taco Nation? Right This Way...Why Are H-E-B’s Flour Tortillas So Dang Good?It’s Time We Give the Mexican Combo Platter the Credit It DeservesCooking in the Midst of a Border Crisis Is About More Than SurvivalSandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceSorry But Taco Bell’s Crunchwrap Supreme Is a Gift From the Fast-Food GodsAnd so much more!Explore Bon AppétitTaco NationAtlantaRestaurantsMexicanDish DecodedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Elyse Inamine"]}