{"id": "a9b3c474a1812364175af8d745381cfa", "url": "https://www.bonappetit.com/recipe/warm-chickpea-bowls-with-lemony-yogurt", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Warm Chickpea Bowls with Lemony Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWarm Chickpea Bowls with Lemony YogurtBy Andy BaraghaniDecember 26, 20184.8(101)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintHere’s a low-effort dinner bowl that comes together in less than 30 minutes. Feel free to swap out the cauliflower for broccoli, brussels sprouts, or your favorite root vegetable. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servings1garlic clove, finely grated1½tsp. ground coriander1½tsp. ground cumin3Tbsp. extra-virgin olive oil, plus more for drizzling½medium head of cauliflower (about ¾ lb.), broken into large florets, sliced ¼\" thick115-oz. can chickpeas, rinsedKosher salt, freshly ground pepper¾cup whole-milk Greek yogurt4Tbsp. fresh lemon juice, divided1medium fennel bulb, halved lengthwise, very thinly sliced crosswise1small chile (such as serrano, Fresno, or jalapeño; optional), thinly sliced1cup very coarsely chopped parsley1Tbsp. toasted sesame seedsPreparationStep 1Preheat oven to 400°. Mix garlic, coriander, cumin, and 3 Tbsp. oil in a large bowl. Add cauliflower and chickpeas; season with salt and pepper. Toss to coat.Step 2Transfer cauliflower mixture to a parchment-lined rimmed baking sheet. Wipe out bowl; reserve. Bake, tossing halfway through, until chickpeas and cauliflower are golden brown and cauliflower is tender, 18–22 minutes.Step 3Meanwhile, mix yogurt, 1 Tbsp. lemon juice, and a big pinch of salt in a small bowl.Step 4Toss fennel, chile (if using), parsley, sesame seeds, and remaining 3 Tbsp. lemon juice in reserved bowl; season with salt.Step 5Spread yogurt mixture in serving bowls. Top with spiced chickpea mixture. Scatter fennel salad over, then drizzle with oil.How would you rate Warm Chickpea Bowls with Lemony Yogurt?Leave a ReviewTell us what you thinkReviews (58)Back to TopTriangleLove this recipe! I really like how the warmth of the roasted chickpeas and cauliflower (and their spices) balances the cool crispness of the fennel salad, and how the lemony yoghurt brings everything together. \n\nI made the recipe as written, though I seeded the jalapeño, because otherwise there’s a bit too much heat for me. Another reviewer mentioned serving this with rice and bread; I can’t really recommend that. Husband and I enjoy this, just as is, as our entire dinner. It’s healthy, tasty, filling, and easy to make. What more could you want?Anonymous1/27/2022delicious - I personally like fennel cooked, so i cooked it w a tsp of oil for a few mins. Anonymous1/18/2022Wonderful! I just made this for the first time. I've never used fennel in a dish, and I was initially put off by the licoricey taste. But, tossed in the lemon with parsley and chili, it was transformative in this dish. The lemony yogurt was a great addition. I ended up finishing the cauliflower and chickpeas in the broiler for a few minutes to get a nice crisp, but other than that I made no adjustments. This is a very healthy, feel-good dish that doesn't compromise on flavor or texture. This will definitely be on my regular work lunch rotations! AnnelisaChicago, IL1/17/2022As written, this recipe is somewhat bland.  The reviews are very good, but you’ll notice that almost all reviewers report having modified the recipe— in some cases pretty significantly.  I liked the idea of this recipe, but as written, it is lacking.  It screamed out for some sort of sauce.  The yogurt is nice, but overall the meal felt dry and bland.  I served it with basmati rice and flatbread.  I ended up increasing the salt and spices quite a bit to try to liven it up Maybe some chutney on the side would have helped, because to me it really needed a sweet element.  I would not make this again.Anonymous1/10/2022This dish makes my heart sing! It's just fantastic. I live in spicy chile pepper land, NM, so next time I will keep the jalapeño seeds or upgrade to a hotter variety. Looking forward to sharing it with more friends!\nKathleen B.Albuquerque, NM6/3/2021Delicious!\n\nThe warm cauliflower and the chickpeas, together with the cold sour salty yogurt and the warm spices.. OH MAMA! it's SO GOOD!\nHere's what I added/changed: I threw my chopped fennel slices with some olive oil in a pan, medium-high heat, give it a couple minutes. It brings out a nice and subtle sweetness from the fennel. If you don't have fresh chili, this is a great time to add some chili flakes to the fennel, I feel like the heat helps to increase the chili flavor and not the hotness (Maybe I'm wrong but eh). And I added some sumac to the yogurt, too (making Brad proud!). If you have sumac, add a little bit less lemon juice and add some sumac instead! You can add lime juice, too! This dish is so versatile yet so simple, and I love it!\n\nGreat stuff Andy, your recipes rock!Maciej M.Austria2/18/2021This was so delicious. Like other commenters, I'd never cooked with fennel before, but it totally mellows out with the lemon juice and other flavors. Really lovely light and tasty dish. Looks so beautiful on the plate too. Thanks Andy!EmilyNorth Carolina11/9/2020Delicious, light, quick/easy to make, and even better on flatbread!! I subbed broccoli for cauliflower, used a whole head and used double the cumin-coriander. It was so surprisingly delicious I almost shed a tear? Don’t knock the fennel before you try it- this combination is genius.  AnonymousTexas10/23/2020Let me start off by saying I do not care for anise flavor - no black liquorice, no sambuca, no fennel. Why I chose this recipe is a mystery but I can say now my taste for anise may have been changed. Maybe it was the chili/lemon marinade or the tart lemon yogurt but the recipe turned our delicious. My wife, also not a big anise fan, loved it too. My 11yr old daughter, not so much; though she did eat up the spiced cauliflower & chickpeas. fitzrobAustin, TX8/6/2020This is delicious! We added a little mango chutney to the yoghurt, and in lieu of sesame seeds used pine nuts instead. Served with some toasted pitta for dinner, otherwise it may have been a little too light for us. Still well under 500kcals. Definitely will make again, perhaps with some shredded chicken or roasted squash to bulk it out.ScotLondLondon6/16/2020This is delicious and healthy. I make this every few weeks to balance out all the carbs that have been getting me through the quarantine. It's very filling! Anonymous5/26/2020This was so good! Very easy to make and healthy. I will definitely make this again. Hannah_RosalieThe Netherlands5/25/2020This is in my heavy rotation. The concept of this dish lends itself well to modifications depending on what is in your fridge. Adding lemon and salt to the yogurt is surprisingly transformative...I really like it. Go wild with the spices and oil on the vegetables and chickpeas if you want a really flavorful and textured crust on the chickpeas. I was sad I didn't have fennel this last time I made it. Instead I had to used radishes, jalapeno, green onion, parsley, lemon and sesame oil, to make the salad. It did it's job of brightening up the dish. Thank you for this recipe!Anonymouslos angeles, CA5/9/2020I make this dish a couple times a month now, it is amazing. You can sub out any sweet veggie that roasts well in place of the cauliflower, too.\n\nWhen I'm not trying to be healthyish, I really enjoy putting these toppings on a toasted flatbread!!hamsliceMKE4/25/2020excellent dish! I didn't have all of the correct ingredients on hand, so subbed some out and it was still a nice fresh, light meal. jolieangelineaustin, texas4/8/2020Explore Bon AppétitRice and Grain BowlChickpeaBeanVegetableCauliflowerFennelFallWinterQuickEasyWeeknight MealsMainGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Andy Baraghani"]}