{"id": "a9b729f44cac6c755a384537b363cf22", "url": "https://www.bonappetit.com/recipe/watermelon-endive-and-fig-salad", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Watermelon, Endive, and Fig Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueWatermelon, Endive, and Fig SaladBy Anna StockwellMay 21, 20195.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintLess of a recipe and more of a serving suggestion, this combination of sweet and salty flavors and crunchy and juicy textures is the perfect side salad or a cocktail hour snack platter. The contrasting ingredients are united by a super simple lemon vinaigrette and, of course, a sprinkle of flaky salt.Ingredients4–6 servings ¼cup fresh lemon juice3Tbsp. extra-virgin olive oil1Tbsp. honeyKosher salt, freshly ground pepper½baby seedless watermelon (about 2½ lb.), sliced into 3\" triangles (rind left on)3red endive, leaves separated8oz. fresh Mission figs, halved lengthwise1cup Castelvetrano olivesFlaky sea saltPreparationStep 1Whisk lemon juice, oil, and honey in a small bowl to combine; season with kosher salt and pepper.Step 2Arrange watermelon, endive, figs, and olives on a platter in sections. Drizzle dressing over and sprinkle with sea salt.How would you rate Watermelon, Endive, and Fig Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladWatermelonMelonFruitEndiveChicoryLeafy GreensVegetableFigOliveOther IngredientsSummerStarterSideNut-FreeDairy-FreeGluten-FreeVegetarianRawHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}