{"id": "a9c2296cd0ddd31415488dbb1814b16d", "url": "https://www.bonappetit.com/story/rent-week-rice-noodle-crispy-pork", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "This Rent Week Rice Noodle Recipe Makes Me Feel Alive | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rent Week Rice Noodle Recipe Makes Me Feel AliveMy checking account is looking bleak, but my bowl of spicy rice noodles is not.By Alex DelanySeptember 28, 2018FacebookTwitterEmailFacebookTwitterEmailThree days ago I was holding more cash than I’d ever held in my life. And then I gave it to someone else. I’m never going to get it back.This sacrifice was not in vain. While it was undeniably idiotic, I did it for a reason: I just signed a new apartment lease in Manhattan. After having a dusty bedroom without any windows (or air conditioning) for the last four years of my life, I’d decided it was time to find a new spot to call home. Which also meant that it was time to pay the first month of my new rent. And the last month of my old rent. And a security deposit. And a broker’s fee. And an application fee. And a building fee. All at the same time. In cash.To say that I am currently broke would be an understatement. My first few weeks living in my new apartment will be filled with Rent Week dinners. If there wasn’t a spot that served 10 dumplings for three dollars and two-dollar bowls of rice noodles on my new block, we’d probably be calling this Rent Month.But speaking of rice noodles, let’s get to this month’s recipe. We’re going to be making a simple rice noodle recipe with crispy ground pork and chiles. And yes, I have an Apartment Warming Party Playlist (completely free of charge and good for apartments old and new) for you to cook to. As the kids on the internet these days are saying, This is it, Chief. Let’s start cooking.We’ll start with the pork. In order to properly brown ground meat, it has to actually become brown. That sad, spongey, gray ground beef or pork your parents made for taco night is not browned. It’s...grayed. We want this pork to get crispy—we want to render a lot of the fat so it collects at the bottom of the pan, and the meat is going to sizzle and crisp in that. Pat dry 1 lb. ground pork with paper towels (moisture is the enemy of browning, after all) and spread it out in a lightly-oiled skillet over medium heat. Do. Not. Touch. It. Let it stay there, getting crispy, until you see the edges start to brown. Give it a flip and let it sit on the other side, again until deeply browned. Then break it up into smaller pieces in the pan—a fish spatula works great for this. For an in-depth tutorial on browning, click here.Let's not jump the gun, but these are some A+ noodle toppings.\nOnce the pork is nice and crispy, turn off the heat and, using a slotted spoon or a fish spatula, transfer the pork to a bowl, leaving the rendered fat in the skillet. We’re going to cook some things in there. Thinly slice 4 garlic cloves and 1 medium red chile. Slice 8 scallions lengthwise, into quarters, so you have 32 long pieces of scallion. This seems like a lot of scallion. It is. But that’s fine.Add an additional glug of oil to the fat in the pan and turn the heat to medium, and once it gets shiny again add the garlic, chile, and about  ⅔ of the scallions. Toss them all in the oil, and season with a few glugs of soy sauce, unseasoned rice vinegar, and a hefty dose of Szechuan peppercorns. (Okay. It might seem a little annoying that I’m calling for Szechuan peppercorns. It probably is. But if you have them, use them. The numbing sensation they give to this dish is fantastic. If you don’t have Szechuan peppercorns, go ahead and use lots of freshly cracked black pepper. The effect won’t be the same, but they’re better than no peppercorns at all.)My preferred rice noodles.\nPhoto by Chelsie CraigWhile that’s cooking, toast a few big pinches of sesame seeds in a non-stick skillet. Remove them once they’ve turned a deep shade of brown, and put them in a small bowl for serving. The flavors that we're building for this dish were inspired by some recent trips to Flushing Queens and the Chengdu-style noodle dishes (like Liang Mian and Dan Dan Mian) that I eat and love when I'm there. My interpretation isn't exactly any of these dishes, since we’re not using any fermented pastes for deep, finessed flavors, but the effect is similar: a filling rice noodle dish that’s packed with spice and flavor. This is the closest I can get at home during Rent Week, with the things I have in my pantry. Now, back to cooking the noodles.For this recipe we need about 5 ounces of flat rice noodles. I like a medium-sized noodle, like the ones pictured above. Here’s how I cook rice noodles so they’re less likely to stick together: First I season water heavily with kosher salt. Bland rice noodles are not an enjoyable thing to eat (much like bland pasta). Then I bring that water to a boil. You might be thinking, But Alex, this sounds like how everyone makes noodles. What makes this so special? Well, here’s what makes it different: When the water reaches a rolling boil, I turn off the heat and drop my noodles in the water. They cook more gradually and are less likely to develop that slimy coating and mushy texture. Make sure you stir them every minute or so to avoid clumping, and give them a rinse in cold water, after they’ve reached a pleasantly chewy, tender texture. That will take about 4-5 minutes.There they are. Your rice noodles. Well, these are actually mine. But you get the idea.\nOnce you’ve rinsed the noodles, turn up the heat under that pan with the oil and aromatics—medium heat should do it—and once it's sizzling again, add the pork and noodles and toss, toss, toss. This is kind of like how we finish pasta in the pan. Once all the ingredients have gotten a chance to get to know each other, spoon some out onto a plate, and top with toasted sesame seeds and some of the raw scallions (which you can slice into smaller pieces). If you have some roasted peanuts lying around, you could crush them and add a sprinkle for some added texture—not essential, but also not bad.The simplicity, comfort, and affordability of these noodles are all important qualities. But the real reason I love this rice noodle recipe is that the heat of the chiles and peppercorns makes me feel alive, which helps when my credit card statement makes me feel the opposite. I really hope my new roommate Greg likes spicy rice noodles. These would be even better if someone else paid for half of the groceries.Want more noodles? How about Garage Noodles?Garage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyKale, mushrooms, onions, and a beautifully bold sauce make instant ramen noodles something to be excited about.View StoryExplore Bon AppétitBasicallyRent WeekRice NoodlesPorkGreen Onion ScallionChile PepperRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-28", "author": ["Condé Nast", "Alex Delany"]}