{"id": "a9ca951fbdde95421481ae09d126d17e", "url": "https://www.bonappetit.com/story/charcoal-toothpaste", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Is Charcoal Toothpaste Safe to Use? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleShould We Be Brushing Our Teeth With Charcoal?I got my sink really dirty and talked to a dentist to find out.By Shaena MontanariDecember 21, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWhile I’m trying to be more mindful of the ingredients in my beauty products, I must admit that the last thing on my mind is toothpaste. I’ve never read the ingredients on the back of the tube, nor have I thought twice about buying a drugstore brand—but should I? Some mainstream toothpastes contain controversial ingredients, like the antibacterial agent triclosan, which which can disrupt hormones and promote drug resistant infections. Yet again, Instagram presented me with a well-branded alternative: Hello charcoal toothpaste. Yes, black toothpaste made with the stuff you might barbeque a hamburger on. It promised to be “detoxifying” and “whitening,” so I decided to give it a try.Hello’s toothpaste, like many of these alternative charcoal toothpastes, are vegan and free of dyes and artificial sweeteners. Some are also fluoride-free, but I wanted to try a version with fluoride because research has shown that brushing with fluoride makes a big difference for cavity formation, and I don’t want to mess with that. The verdict? It was definitely different from the stuff I’ve been using since I was brushing my baby teeth. The flavor was familiarly minty, but it made a huge mess in my sink because it really is pitch-black. And while the charcoal seemed like it was buffing out surface stains because of its abrasive nature, according to the Mayo Clinic, extreme whitening can be difficult to get without peroxide.I liked using this toothpaste for the flavor and because it made my teeth feel super clean but I did have some concerns about the safety of consuming activated charcoal, an ingredient I don’t usually put in my mouth. So I asked Dr. John K. Brooks, a clinical professor at the University of Maryland School of Dentistry, what he thought about the trend of charcoal toothpaste. I say trend, but he notes in a recent academic publication that charcoal has been used for oral hygiene for thousands of years—Hippocrates (yes, ancient Greece Hippocrates) even wrote about it.Looking at the charcoal toothpaste brands on the market, Dr. Brooks discovered that most do not release their abrasiveness scores, which are required to be under a specific value to get an American Dental Association (ADA) seal of approval. This makes it difficult to know how tough they are on enamel long-term. Two of Hello’s toothpastes are ADA approved, but not the ones containing activated charcoal.“There is not a body of research to support the effectiveness or safety [of charcoal toothpaste]” Dr. Brooks says. Studies done on charcoal and dental care to this point have been about the use of raw charcoal in indigenous populations around the world. In these cases, overuse of charcoal actually made teeth look more yellow once the outer layer of enamel was scraped away.Dr. Brooks also notes that Hello’s and other brand’s claims that charcoal toothpastes are detoxifying are not backed up by research. “Show me the evidence there,” Dr. Brooks says, pointing out that charcoal compounds do have viable medical uses, but their antibiotic properties in oral care remains uninvestigated. He recommends that consumers look for the ADA seal of approval when deciding on a toothpaste.“I’m not saying don’t use these products, but you should have a conversation with your dentist,” Dr. Brooks says. For me, the fact the abrasiveness of activated charcoal toothpaste hasn’t been rigorously tested yet means I’m going to be sticking with my old standard toothpaste for now. It doesn’t look as pretty on social media, but it makes my sink look a whole lot better. And why are we ’gramming our toothpaste, anyway?Buy it: Hello Activated Charcoal Toothpaste, 4 for $18.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishTrendsRead MoreLifestyleWhat Is Activated Charcoal, and Is It Really Safe?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Shaena Montanari"]}