{"id": "a9fa4d7c3f41f3f896481a0c7d948b76", "url": "https://www.bonappetit.com/story/diy-vanilla-extract", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "How to Make Vanilla Extract at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingListen Up, Bakers: You Could Be Saving Lots of Money With DIY Vanilla ExtractMake a never-ending jar of vanilla extract and save yourself a pretty penny.By Courtney SprewerAugust 14, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailIn Basically on a Budget, we'll talk tips, ingredients, and recipes that'll help you save money and eat well.I cook a lot, bake a fair amount, and drink more flavored coffee beverages than I care to admit. Between testing recipes for my food and drink blog, EatDrinkDoWear, freelance projects, and keeping myself fed and caffeinated, I found myself running through, and running up a bill for, vanilla. Any time a recipe called for more than a scant teaspoon, I’d walk away feeling guilty—those tiny bottles are expensive, not to mention hit-or-miss in terms of flavor and quality.One day I was searching for how to get the best bang for my buck after buying some VERY expensive Nielsen-Massey vanilla beans with a discount from my kitchen job. I settled on making homemade vanilla extract when I realized that with a few fresh vanilla beans, some cheap vodka, an airtight container, and a lot of patience, I could produce a never-ending jar of vanilla suitable for all my baking, cooking, and beverage needs. All I had to do was keep adding vodka and my vanilla supply would replenish before my eyes—a total game changer for me. Seriously, DIY vanilla is the gift that keeps on giving, and the method is pretty simple:Cut 4–6 fresh vanilla beans open lengthwise, scooping out the seeds (or vanilla caviar, if you want to feel fancy) into an airtight container—I used a big 16-ounce mason jar so there was enough room for my vanilla experiment to grow over time. Add the bean hulls to your jar. For a decorative touch, you can use a tall glass bottle that showcases the whole bean, but chopping the beans and muddling them inside your jar actually speeds up the extraction process—ugly, but effective.Pour enough vodka over the beans and seeds to cover them. Feel free to use the cheapest vodka you can find—all the flavor comes from the vanilla anyway. You can also substitute bourbon or rum, but I find that vodka, since it’s flavorless, offers the cleanest flavor. Whichever spirit you choose, use approximately 8 ounces of at least 70-proof alcohol per 4–6 vanilla beans (the same standards issued by the FDA).Photo by Chelsie Craig, Food Styling by Pearl Jones Secure the lid on the jar and shake vigorously. Store in a cool, dark place, like a cabinet, for as few as two months, shaking daily for the first week or two and then occasionally after that, until the alcohol turns a rich brown color and smells of fragrant vanilla. For the best, most potent final product, you can let your extract bloom for up to six–12 months before using it.As you use it up, you can just keep adding vodka to the bean hulls and bottom-of-the-jar-seeds to keep the extraction process going. If you notice that the flavor is getting less intense, which it will as you keep re-upping the alcohol, you can always replace a couple of the spent beans with fresh ones to bolster the flavor.I’ve had my personal jar of homemade vanilla extract going on five years now and it hasn't let me down yet. But because I am a novice baker, I wanted a pro to test out my DIY vanilla and see if it passed muster. So I gave a tiny vial to Lara Adekoya, founder of boutique baking company Fleurs et Sel. Lara uses vanilla in virtually every one of her recipes—she probably goes through more vanilla in one day than I do in a month.Fleurs et Sel is a relatively new venture for Lara—she popped up with pickup and delivery services in the L.A. area shortly after she was furloughed from her fashion job due to COVID.As a new business owner, Lara got a quick lesson in scaling up. She quickly went from baking for her family and boyfriend as a hobby, to accepting orders, buying in bulk, and making the most of every dollar and ingredient. Vanilla is one of the most expensive products on her grocery list. Even though she buys in bulk from Costco at $50 for 32 ounces, it still gets pricey.A bit of simple math reveals that DIY vanilla is the more economical choice. In five years I would likely have gone through at least 10 bottles of vanilla extract—if each jar is $12, that’s $120. But with my homemade jar, which has lasted me as long, I spent $30 on four beans and $6 on cheap vodka, then maybe another $5 for the jar. Even if you’re an average Joe like me and not a pro baker, the homemade stuff pays for itself pretty quickly.After trying my homemade version, Lara was a believer. She was pleasantly surprised by how potent and fragrant the extract was. That said, I made sure to add a bunch of seeds and a couple of pieces of the vanilla hull to her bottle, and I’m sure the constant shaking during the delivery process helped draw out some good flavor. But as it turns out, Lara has a ton of fresh vanilla bean hulls from her popular vanilla bean sugar cookie recipe, and with this newly acquired life hack, she expects to have her own vanilla extract just in time for holiday cookie season. Start your jar today and you can too.Courtney Sprewer is a freelance writer based in Chicago, where she runs the blog EatDrinkDoWear.Explore Bon AppétitBasically on a BudgetRead Morecooking6 Delicious Ways to Bulk Up Instant NoodlesBy Hetty McKinnoncookingThe Secret to My Award-Winning Bread is a $4 Foil Roasting PanBy Emma BarkerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-14", "author": ["Condé Nast", "Courtney Sprewer"]}