{"id": "aa39505b3cf4de2ad974db1daa52f49f", "url": "https://www.bonappetit.com/story/omas-takeaway-restaurant-opening", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "How Our Pandemic Plan Became Our New Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow Our Pandemic Plan Became Our New RestaurantChef-owners Tom and Mariah Pisha-Duffly loved Oma’s Takeaway, their PDX restaurant’s rebrand in response to COVID-19, so much they gave it its own permanent brick-and-mortar location.By Tom and Mariah Pisha-Duffly, as told to Woesha Hampson-MedinaSeptember 30, 2020FacebookTwitterEmailPhoto by Mariah Pisha-DufflyFacebookTwitterEmailThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.In mid-March, restaurants were forced to close their dining rooms in Portland, Oregon. For Tom and Mariah Pisha-Duffly, the chef-owners behind Gado Gado, they decided that instead of trying to translate their restaurant for takeout and delivery, they’d create a completely new concept. Enter Oma’s Takeaway, a pop-up inside Gado Gado with a daily changing menu based on the team’s whims: KFC-style bowls with mashed potatoes and fried chicken one day, noodles with blood sausage the next. It ended up being so successful (and soul-satisfying) for everyone that the Pisha-Dufflies decided to turn Oma’s Takeaway into its own brick-and-mortar restaurant, which they shared with us in our Restaurant Diaries. The restaurant debuted in late August, and here the two talk about what it’s been like to open a restaurant in a pandemic and how it’s keeping them going. —Elyse InamineAfter weeks of pushing, last-minute appliance repairing, and menu reengineering, we finally opened Oma’s Takeaway. Our first day was awesome: Service was smooth, the food was great, and people seemed to enjoy it. But a week and a half later, the fires started in Oregon. It looked like a wasteland outside. We don’t offer indoor dining at Oma’s Takeaway (or Gado Gado), and the air quality was so bad that we couldn’t ask people to come for outdoor dining. So, everything had to be to-go for a bit.It feels like we’ve been coming up with creative solutions that work well, but the never-ending problem-solving, no matter how big or small the issue, is getting exhausting. Each situation feels like another drop on a huge roller coaster, and it causes us to doubt ourselves. We constantly have impostor syndrome; we have only been restaurant owners for a little over a year and there are so many responsibilities that come with ownership that you don’t understand until you are in the role. You have to balance maintaining your passion for the food, putting together a team that works well, making sure you can offer health insurance, and yes, pivoting in the midst of a pandemic. We also feel out of place because the incredible restaurant owners and chefs we looked up to are now our peers, and it is hard to think of ourselves as equals. But fighting and winning some of these uphill battles, like opening Oma’s Takeaway during a global health crisis, have given us confidence. There is a rush and a sense of relief when we are able to work around the curveballs that are thrown at us.We can’t really comprehend our accomplishments because we have talked about opening a restaurant since our first date, 13 years ago, and it is wild that we own not one but two restaurants. We have always been invigorated by working in restaurants; however, it is different now because these restaurants are much more personal. It seemed inevitable that we would open a restaurant, since cooking and entertaining are our ways of enduring. Our focus has always been to put together dishes that we would want to eat and host entertaining events that we would want to attend. We have a colorful, quirky, abstract style, and it is so humbling to have people respond to our art and connect with it. There are also all these aspects of restaurant ownership that we didn’t expect to feel such a sense of pride in, like facilitating the growth of our employees. It is so satisfying to watch people step into their role and make it their own. Hospitality is the best way we can express ourselves—it’s our language.That is probably why we added more to our plate by starting a new pop-up series during the pandemic and two weeks after opening a second restaurant. The first dinner was a grilled lamb feast with char kway teow, pea tips and yam leaves, shrimp krupuk, sambal, our signature Oma’s aromatic rice, and cookies and milk for dessert. When customers come to pick up their meal, we get the vibes going, playing Missy Elliott and turning on our disco lights. We try to stay on our toes and make sure our customers stay on theirs by keeping things interesting. We don’t know any other way to live but to keep putting what we love out there in whatever way we can.Explore Bon AppétitChefsRestaurantsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Tom", "Mariah Pisha-Duffly", "As Told To Woesha Hampson-Medina"]}