{"id": "aa3df9473a74b8d63fc5323782f65c78", "url": "https://www.bonappetit.com/story/how-to-whip-egg-whites-like-some-sort-of-magician", "year": 2021.0, "month": 5.0, "day": 1.0, "content": "How to Whip Egg Whites Like Some Sort of Magician | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Whip Egg Whites Like Some Sort of MagicianTurn ordinary egg whites into delightful fluff.By Sarah JampelMay 7, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailIt's magic, really. When whisked vigorously, the proteins in egg whites denature and form new bonds, creating a tight network where air is trapped. These bubbles bring lift and lightness to mousses, sponge cakes, and meringues. But it’s not all fancy desserts: Whipped whites offer height to pancakes and waffles and can turn a regular omelet into an omelet soufflé. To whip whites successfully, follow these tips.1. Get set for successStart with room-temp eggs (cold whites don't incorporate air nearly as well) and a totally clean large bowl— even a drop of fat will interfere. Some people add a pinch of cream of tartar before they start, which prevents over-whipping and helps the whites reach a greater volume.2. Start slowStart at low speed in order to break up the proteins in the egg whites, which will allow them to become more elastic. Once they're loose (you'll notice that they're more foamy—see below—and homogenous-looking), begin beating more quickly to incorporate air.3. Know the stagesWhen you start beating, your whites will look foamy, like sudsy soap. Next, they’ll reach soft peaks, where they briefly hold their shape before sinking into the bowl. Keep beating (this is when a recipe for sweetened egg whites might have you slowly add sugar) and you’ll get to medium peaks, which keep their shape but bend at the top like a witch’s hat or, as the French call it, bec d’oiseau (bird’s beak). Finally, you’ll reach stiff peaks, which stand tall and straight. At this point, your mixture will be fluffy and voluminous, like marshmallow fluff or shaving cream.4. Stop at stiffDon’t be tempted to continue: Go too far and the meringue will start to weep (a.k.a. release water) and form clumps that can't be easily incorporated into a batter. To fix broken, over-beaten egg whites, you can add an additional white and whisk briefly, just to incorporate its moisture into the original group. But don't take it too far or you'll be back where you started.Whip egg whites, eat like an angel:BA's Best Angel Food CakeAngel food cake is so simple, but the specific ingredients and equipment matter.View RecipeExplore Bon AppétitEggEgg WhitesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-06", "author": ["Condé Nast", "Sarah Jampel"]}