{"id": "aa3fd5e71c08e0236ead214d08e151d3", "url": "https://www.bonappetit.com/recipe/la-kalbi", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "L.A. Kalbi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesL.A. KalbiBy Irene YooAugust 26, 20214.7(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Kat BoystovaEmailPinterestPrintEmailPinterestPrintL.A. kalbi is a uniquely Korean-American dish that uses flanken-style short ribs rather than the butterflied English-style ribs traditionally used in kalbi in Korea. It’s widely accepted that L.A. kalbi originated in the Korean immigrant community in Los Angeles, where home cooks turned to the cheaper flanken-style ribs that were readily available at local Mexican markets. These short ribs, which are thinly cut across multiple ribs so each strip of meat has three little bones along one edge, are perfect for marinating and quickly grilling and result in tender meat that’s sweet, salty, and well-caramelized all over.The marinade usually has some combination of soy sauce, toasted sesame oil, garlic, ginger, and a sweetener, but every restaurant (and Korean mom) has a different variation. Here grated Asian pear and granulated sugar add sweetness, but you’ll find recipes that call for grated apple or kiwi, honey, brown sugar, and even lemon-lime soda, a sneaky pantry substitute for fruit. Feel free to make substitutions in your own marinade—use apple cider vinegar in place of rice vinegar, an Anjou pear if you can’t find Asian pear, and so on—depending on your taste preferences. Grilling the ribs over charcoal results in the best flavor, as it adds smokiness to the caramelized meat. But you’ll also get good results if you cook them on a gas grill, in a grill pan on the stovetop, or broil them in the oven.While L.A. kalbi can shine just fine on its own with a simple bowl of rice and some kimchi, this recipe goes all-out with everything you need to enjoy the kalbi in ssam (lettuce wraps): fresh leaf lettuce and perilla leaves for wrapping; pa muchim, a fresh, lightly dressed scallion salad that cuts through the ribs’ meaty sweetness; and hot, cooked short-grain rice. Use a pair of kitchen scissors—a staple in Korean cooking—at the table to cut the three-boned ribs into single-serving pieces, or cut the meat off the bones for easy ssam wrapping. Wash it all down with an ice-cold beer and you’ll be licking your fingers, and the bones, clean. —Irene YooAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCharcoal Grill$98 $82 At AmazonScissors$17.95 At AmazonFood Processor$49 At AmazonWhisk$10 At AmazonIngredients4–6 servingsKalbi8garlic cloves½large or 1 medium Asian pear, peeled, cored, cut into large chunks11” piece ginger, peeled, coarsely chopped½cup mirin (sweet Japanese rice wine)½cup soy sauce (not low-sodium)½cup sugar¼cup toasted sesame oil½tsp. freshly ground black pepper2½lb. ¼\"–½\"-thick crosscut bone-in beef short ribs (flanken-style; about 12 three-bone strips)Scallion Salad and Assembly2bunches scallions, cut into 3\" pieces1Tbsp. apple cider vinegar1Tbsp. mirin (sweet Japanese rice wine)1tsp. gochugaru (coarse Korean red pepper powder)½tsp. sugarKosher saltVegetable oil (for grill)Toasted sesame seeds and thinly sliced scallions (for serving)1large head of green leaf, red leaf, or Bibb lettuce, leaves separated, torn if large30perilla leaves (optional)Cooked short-grain rice (for serving)PreparationKalbiStep 1Blitz garlic, Asian pear, and ginger to a smooth purée in a food processor or blender. (Or, finely grate garlic and ginger; grate Asian pear on large holes of a box grater.) Transfer purée to a medium bowl. Whisk in mirin, soy sauce, sugar, sesame oil, black pepper, and ½ cup water until sugar is dissolved.Step 2Arrange short ribs in a resealable plastic bag or baking dish. Pour marinade over and turn ribs to coat. Seal or cover and chill at least 4 hours and up to 12 hours.\\Do Ahead: Freeze ribs in marinade for up to 1 month.Pa Muchim and AssemblyStep 3Slice scallion pieces lengthwise into thin strips. Soak in a mesh strainer set inside a large bowl of ice water 10 minutes to remove some sharp bite and allow time to curl slightly. Swish scallions around with your hands to remove any sliminess, then drain well and pat dry. Wipe out bowl; return scallions to bowl.Step 4Whisk vinegar, mirin, gochugaru, and sugar in a small bowl until sugar is dissolved; season with salt. Add dressing to scallions and toss to coat.Step 5Prepare a grill for medium-high heat; oil grate. Remove short ribs from marinade and grill until well browned and slightly charred around edges, about 3 minutes per side. Transfer to a platter and top with sesame seeds and sliced scallions. Let rest 5 minutes, then cut meat into bite-size pieces with kitchen shears.Step 6Arrange lettuce and perilla leaves (if using) on a second platter. Scoop rice into individual bowls.Step 7To eat, stack a palm-size lettuce leaf and a perilla leaf in your hand. Top with rice, meat, and scallion salad and wrap into a tight bundle. Eat in one bite and repeat!How would you rate L.A. Kalbi?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleEdit on last review: also pro tip; take the leftover sauce that you have and bring it to a rolling boil in a saucepan for 5 min. Skim off the top and the sauce is now safe to eat. For dipping it was so amazing! IBECOOKINGSOMETIMESLong Beach, CA9/28/2021This recipe was pretty good. What really got me to do it was the picture and boy did it not disappoint in the appetizing fished look. I however would suggest adding a cup of fresh cut green onions. It would really take the marinade up a notch. just add it in straight to the finished marinade. Also using 1/3 cup of sugar and another 1/3 cup of brown sugar. Came out amazing the second time. IBeCookinSometimesLong Beach, CA9/28/2021Meh, I found the rib sauce/marinade a little bland. It lacked punch. CarswellCanada9/7/2021Explore Bon AppétitBarbecueKoreanEast AsianAsianGrillgochugaruBeefMeatSummerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-26", "author": ["Condé Nast", "Irene Yoo"]}