{"id": "aa5ca417e4d08a0e121382ce90162892", "url": "https://www.bonappetit.com/recipe/camouflage-chocolate-fudge-brownies", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Camouflage Chocolate Fudge Brownies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCamouflage Chocolate Fudge BrowniesBy Sarah JampelMarch 8, 20204.4(108)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura MurrayEmailPinterestPrintEmailPinterestPrintTo develop the fifth recipe in the Basically Guide to Better Baking, we went back and forth for weeks debating the merits of a chewy brownie versus a fudgy one (no, we did not entertain \"cakey\" as an option). This is where we landed. It's pretty dang fudgy, thanks to cocoa powder (we worked off Alice Medrich's famous recipe), but a tangy layer of cream cheese offers sweet relief from the richness—and produces a very ‘70s-chic pattern. Make sure you're using large (not extra-large or jumbo eggs) so that the cream cheese batters don't turn out too thin. And don’t stress about your camo design: It’s meant to be random and the brownies will look even better after you slice them. Questions as you bake? Head to our forum for answers!All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronEscali Primo Digital Scale$23 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit Market8\" Baking Pan$25 At AmazonParchment Paper$3 At AmazonMedium Saucepan$39 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonSpatula$12.99 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonWire Rack$23 At BA MarketSpoon$24.69 At AmazonIngredientsMakes 16Nonstick cooking oil spray or room-temperature unsalted butter (for pan)8oz. cream cheese (not low-fat)3large eggs, chilled1⅓cups (266 g) sugar, divided1tsp. vanilla extract, divided¾tsp. kosher salt, divided1½tsp. plus ¾ cup plus 2 Tbsp. unsweetened cocoa powder, preferably Dutch-process10Tbsp. unsalted butter (142 grams)1tsp. instant espresso powder (optional)½cup (63 g) all-purpose flourPreparationStep 1Place a rack in middle of oven; preheat to 325°. Lightly coat a 9x9\" baking pan, preferably metal, with nonstick cooking oil spray or room-temperature unsalted butter. Line with parchment paper, leaving a handle on all sides. (If you have a precut sheet of parchment, simply slice it in half crosswise, then overlap the halves to line the pan.) Lightly coat parchment with nonstick spray.Step 2Assemble your makeshift double boiler (this is a method for gently cooking sensitive ingredients). Gather a medium saucepan and 2 medium heatproof bowls that can sit over the saucepan without dipping too far into it. Pour water into saucepan to come 1\" up the sides (there should be a gap between the water and bowl so check it before the water gets hot!) and bring to a simmer over medium heat. Cut 8 oz. cream cheese (not low-fat) into 1\" pieces and place in one of the medium bowls; set over saucepan. Heat cream cheese, stirring occasionally, until very soft, about 5 minutes. You want it to be soft enough that you can easily mix it with a heatproof rubber spatula or wooden spoon.Step 3Remove bowl from heat (leave water simmering). Mix cream cheese until smooth. Add 1 chilled large egg, ⅓ cup (66 g) sugar, ½ tsp. vanilla extract, and ¼ tsp. kosher salt and whisk until very smooth. Transfer about half of cream cheese mixture to a small bowl (it’s fine to eyeball it) and whisk in 1½ tsp. unsweetened cocoa powder.  (Both Dutch-process and natural cocoa powder will work in this recipe, but the former will provide a deeper color and a smoother, richer flavor.) Set both bowls of cream cheese mixture aside.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Cut 10 Tbsp. unsalted butter (142 grams) into 1\" pieces. Place in the remaining medium heatproof bowl. Add 1 tsp. instant espresso powder (if using) and remaining 1 cup (200 g) sugar, ¾ cup plus 2 Tbsp. cocoa powder (80 g—break up big lumps before measuring as they will throw off your weight and you want to be as precise as possible here), and ½ tsp. kosher salt.Step 5Place bowl over saucepan of still simmering water and cook, stirring occasionally once the butter starts to melt, until mixture is homogeneous and too hot to leave your finger in it, 7–9 minutes. Let cool 5 minutes. Don't panic if your batter looks stiff or otherwise wrong at this point—once you do the next step, it'll return to a glossy, beautiful mixture.Step 6Add remaining 2 chilled large eggs and remaining ½ tsp. vanilla extract to butter mixture one at a time, whisking vigorously after each addition until smooth and glossy (the mixture will look curdled and broken until you add the second egg). Add ½ cup (63 g) all-purpose flour and mix with spatula or spoon until no longer visible, then vigorously mix another 30 strokes. Consider this recipe your arm workout! Why are the eggs chilled? Because it helps the batter to emulsify, ensuring the fat doesn't separate.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Scoop out ½ cup brownie batter and set aside (place near a warm spot, like the oven, to keep it loose). Scrape remaining batter into prepared pan and spread into an even layer. Working quickly, spoon alternating dollops of cocoa–cream cheese mixture and cream cheese mixture over batter. Dollop reserved brownie batter on top (it will be quite thick). Don’t worry if your design looks random and spotted.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Bake brownies until center is set and no longer looks wet (the chocolate blobs will change from glossy and shiny to matte), 22–25 minutes. (If you're using a glass pan, this might take significantly longer, so use a toothpick to check that only a few moist crumbs are pulled out.) Brownies may have puffed—they'll deflate as the cool. Transfer pan to a wire rack and let cool completely. Using parchment paper overhang, lift brownies out of pan and transfer to a cutting board. Remove parchment paper and cut brownies into sixteen 2¼\" squares, wiping knife clean with a damp rag between slices. To easily cut even squares, cut the brownies into four quadrants, then slice each quadrant in four.How would you rate Camouflage Chocolate Fudge Brownies?Leave a ReviewTell us what you thinkReviews (77)Back to TopTriangleThese are my fave! I've been making them throughout the past year and they're always a hit. I find that they're better after one day in the refrigerator - makes them more fudgy and delicious.Anonymous4/3/2021These brownies are so fun to make and taste great! Such a satisfying and balanced brownie, and they look great also. If you're looking for a project of moderate length and difficulty, with high reward, this is it! Happy baking :) Clodagh Dublin, Ireland3/20/2021Made these over the weekend and everyone enjoyed them. Yea, there are a few more steps than normal, no “one bowl” recipe here! However, they were worth the effort. The only reason I gave one less star is because they came out so moist and fudgey, they almost didn’t resemble brownies in my opinion. While I love a gooey, moist brownie, these were a little too far moist for me. Don’t get me wrong, they were all gobbled up! But I probably won’t make them again. I did follow the instructions exactly. Marci TLong Beach, CA2/18/2021Perhaps because I've made Alice Medrich's master recipe on many occasions, I didn't find this adaptation overly complicated. But, I also use a microwave instead of a double boiler. We found nuking the cream cheese for 30 seconds was perfect! The brownie mixture we nuke for 30 seconds at a time and it usually takes about 5 zap & stirs to get hot. With this short cut everything comes together in 15 minutes and you're off to the races. We liked the cream cheese version enough that I'm sure we'll make this recipe again and again. I used 1/2 cream cheese and half mascarpone,  because that's what I had. The mascarpone is softer than the cream cheese and so I ended up over baking them a touch in my worry that they were under done. Next time I'll pull them even if the center still seems a little wet. AnonymousSeattle, WA10/19/2020I really loved the end result of these brownies. They taste and look great. This is a project, like so many people have said. And, yes, lots of dishes to clean. I used regular cocoa powder (not dutch) and did not add any espresso. Also, I didn't use a double broiler and cheated with the microwave. Worked great!AnonymousLos Angeles10/12/2020I’m a fan of many of the Basically recipes. That being said, I was disappointed with this one. I like bitter notes in desserts, but this was overwhelmingly bitter. I don’t think I’ll ever make brownies with this much cocoa powder again.  I tossed the pan after a few nauseating bites.  The cream cheese topping was great, however, and ALMOST redeemed the time and effort!AnonymousCalifornia 8/24/2020Out of this world, Sarah, loving this basically guide to better cooking. These brownies cake out exactly as I like them, slightly gooey and fudgy, I will be making this again!AnonymousVictoria, Australia 8/22/2020These are so delicious. I have made them about 5 times now and while a bit labor intensive they are worth it. I highly recommend making them with dark chocolate cocoa powder if you can’t find Dutch cocoa. AnonymousBuffalo,NY8/14/2020mine totally suck :/KatiehwalshAustin8/7/2020a good recipe if you like a challenge. and if you like brownies. neither of which i particularly like. they still look pretty and taste good, i made them for a family gathering and they liked them (or at least they said they did after i told them how hard they were to make). i won't make again just because i'd rather make something more simple. definitely better texture after a night in the fridge. honestly, they just taste like brownie batter.livgrassonew jersey, usa6/20/2020Do you want to clean up 4 bowls and spend 3 hours to make 1 small pan of brownies? If so, then this recipe is for you. Sure, they may look neat on this glossy website. But is it worth your time to sit around eating spite brownies, muttering to yourself that it wasn't worth it? You could make an entire multi-layer chocolate cake in 3 hours. And eat it too. I'm just saying. There are definitely better ways to spend your time. Or you could make Alice Medrich's brownie recipe, which this BA brownie recipe is basically a rip-off of, just with 3 less bowls and no spite involved. But now that BA's been in lockdown for 3 months, they are *just now* realizing how much time it takes to wash dishes at home. Neat.Anonymous6/19/2020AMAZING! If you like brownies this is a ridiculous recipe and you must try it. bakerjcNew Jersey 6/13/2020Very rich, had a problem with UK cream cheese—not as tangy as US, so not as strong a contrast in flavor, and texture a bit funny from only being able to find tubbed Philadelphia, think it's made to be more spreadable than block, so quite liquid when melted. Top tip: read a suggestion in the comments to do all the double boiler steps in the microwave, can confirm this is an excellent option. Did all melting on half heat at 30-second intervals in the microwave, saved myself a headache for sure, would recommend. Although cream cheese portions very sloppy when arranging, went ahead and baked for 25 minutes and had no problem with set. Kept overnight in fridge, very fudgy and a mousse-like texture in the cream cheese zones. DEFINITELY GREASE YOUR PARCHMENT PAPER ON BATTER LEVEL—didn't think this would be necessary and my brownie level is half-melded to the paper. robot_gurlLondon, UK6/9/2020Dear god were these deliciously rich. Definitely a longer bake time than recommended but otherwise found the recipe easy to follow. Finagled a little marble design with a toothpick before they went in the oven and it turned out beautiful. haleyfreedlundSeattle, WA5/30/2020Yes this is a process (the cleaning up took the time it took to bake the brownies!) but accept it and embrace. I love the tanginess of the cream cheese - it really cuts through the density of the brownie batter itself. As with others, I had to cook it roughly 10 minutes more than the recipe time and they tasted even better after being refrigerated. ellashteinLos Angeles5/26/2020Explore Bon AppétitBrownieBar CookieCookieDessertAmericanCocoaOther IngredientsCream CheeseCheeseNut-FreeBakingSuper BowlBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-08", "author": ["Condé Nast", "Sarah Jampel"]}