{"id": "aa629e9d31440f18893096334374af18", "url": "https://www.bonappetit.com/story/torrey-peters-last-meal", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Over Fried Fish, I Said Goodbye to My Wife—And to a Version of Myself | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOver Fried Fish, I Said Goodbye to My Wife—And to a Version of MyselfI thought I could save my marriage by repressing my transness. I couldn’t.By Torrey PetersJanuary 4, 2022FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Micah MortonFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community. This month, we're joined by Torrey Peters, author of Detransition, Baby.The last thing I ate as a husband—and arguably, as a man—was a fried tilapia. The fish had been caught from a skiff on the shore of Lake Victoria and only an hour or two later dredged in flour, fried to a golden crisp in a vat of vegetable oil over a wood fire, and served to me with lime and piri-piri sauce. I could still taste the green flavor of algae in the flaky white flesh. My senses all registered that I had before me a truly excellent meal, but I ate it glumly across from my then wife, Olive, who picked at a matching fish.We sat on plastic chairs at a wood table banged together with pegs. It was the rainy season: low skies reflected in the puddles that pooled in the ruts of red dirt roads leading up to the shore. Huge marabou storks—known as the undertaker bird on account of their haunted movements, leprous pink skin, and dark wings that hang like cloaks—slipped and flapped through the grasses around us, contributing to the funeral mood of our meal.Olive and I had lived in Kampala for almost a year by then. She was a graduate student and had received a National Science Foundation grant to write an ethnography of Uganda’s only lesbian bar. From appearances, a lesbian bar was an odd choice of study for an American woman in a heterosexual marriage. But it had happened organically. Three years before I’d come out to Olive as transgender but told her—or rather, told myself and her by extension—that I’d never transition. My mind turned constantly, thrillingly, to the idea of myself as a woman, but I loved Olive and didn’t want to mess up our relationship by transitioning. I assured her that I could manage as a man just fine.The author, then and now\nIllustration by: Arsh Raziuddin The summer that I came out to Olive, she traveled to Uganda as a doctoral student to work with an NGO. But newly curious about trans people, she ended up meeting and befriending members of a nascent trans movement in Kampala.In 2009, urged on by members of the American evangelical movement, the Ugandan government considered a bill to strengthen laws against homosexuality (making no distinction between it and trans identities). Proposed punishments included imprisonment or possibly even death. And yet, in the midst of this, a group of trans men and lesbians kept the bar open—packing it every night of the week despite harassment, police raids, and daily hateful screeds in the local tabloids. Olive had returned that summer, and there, under the shadow of the anti-homosexuality bill, she and her friends came up with the idea: She’d write a yearlong ethnography of the bar and its patrons. As her husband and a nominal trans person, I went with her.In the U.S. I’d been experimenting with gender presentation: pierced ears, eyeliner, tighter shirts. I’d watch RuPaul and be inspired to try out a full drag look—which led to a desperate euphoria for days after, a wild-eyed happiness that I’ve since encountered in other trans people and understand can be both annoying and alarming. I reasoned that it worked like a safety valve—give me a day of gender obsession every few months and I’d be a good husband the rest of the time.I put my gender on hold in Uganda. In truth, because I’m white and American, it’s not like I was risking arrest or the death penalty like queer Ugandans were. Two Ugandan trans women I knew there had each been arrested multiple times. What they suffered in an Idi Amin–era bunker isn’t mine to recount, but suffice to say, it was horrific. By contrast I couldn’t even be honest with my wife about my own gender. I might’ve been ashamed of this, but that’s the whole point of repression: to remain unconscious of one’s own cowardice.In high school my friend’s dad caught him smoking and did that legendary dad thing where he then made my friend smoke an entire pack of Marlboro Reds. My time in Uganda was the masculinity equivalent of smoking an entire pack of cigarettes. I bought a 4x4 truck and drove it around dusty roads. Hot water was unreliable, so I rarely shaved and grew constant stubble. People told me T-shirts were disrespectful and slovenly, so I took to wearing button-down shirts and ties. I spent evenings grilling steaks in a simple pizza oven I’d made of mud and straw like some wayward suburban dad. The cows of Uganda grazed on anything green so that grass and floral flavors marbled the meat and only the simplest marinade was needed. I learned a few phrases of Luganda, but generally, I couldn’t follow conversations. So I came to speak even English in a terse, clipped manner—to avoid letting my confusion or helplessness show. It was effective. I made friends easily. People thought I was competent. But the more I leaned into masculinity, the more opaque I became to myself. My internal landscape desaturated. Sussing my own emotions was like feeling for lost objects on the bottom of a murky pond. Affection withered before I could express it. I stopped touching Olive. Couldn’t express any kind of sexual desire. At night I’d catch her watching me, the brief gleam of her sad eyes in the dark as she contemplated why this man she married no longer wanted her. Rather than face those eyes, I’d roll over and away. In the morning neither of us could talk about it.All day long Olive spoke with queer activists—everyone wanted to tell the American ethnographer of furtive hookups made hotter by danger, of the dish-shattering drama of breakups and cheating, of clothing and bodies pressed close to late-night beats, of slipping away with your crush to the back of a broken-down ’80s Corolla imported from Dubai. Olive and I would laugh along and perform that same open exuberance—but alone, under the mosquito net in our rented room, we suffocated on humid air and unsaid words. By the winter of 2010, it became clear that a proxy culture war was being waged by the West in Uganda. The religious right—especially the Americans—were losing the battle of gay marriage at home, so they turned to the global South in search of new fronts and alit on Uganda, a country with policies unusually open to foreign organizations. Money from U.S. churches was pouring into the accounts of right-wing politicians, and European NGOs and LGBTQ+ organizations were funding counteractions.The atmosphere grew increasingly hostile. Olive’s friends found their pictures printed daily in the tabloids along with unfounded accusations. Long nights of flirting over roasted maize, sambusa, and Nile brand beers turned into survival-strategy sessions.I awoke one morning to Olive crying. A friend of hers and prominent LGBTQ activist, David Kato, had been killed with a hammer. Within hours Hillary Clinton had denounced the murder and the anti-homosexuality bill. Later that day Barack Obama. Right-wing politicians saw this as foreign intervention in Ugandan affairs. They turned Kato’s death into a political flashpoint to rile up followers and defended his killer, who in court employed “gay panic” as a justification for the murder. Olive spent a month helping out during the funeral and its aftermath: a descent into fear and paranoia that swept over Uganda’s queer and trans activists; the sudden hunt for asylum applications, safe houses, European sponsors.While she worked, I stayed home, read novels, failed to write my own novel, worried about my truck, and occasionally drove it out to the countryside. I bought enough 3G internet credit to browse faraway trans websites—extremely slowly—on my third-generation iPhone. Olive and I went days without seeing each other.It was during this era that we sat down to that dinner of fried fish at a place we’d been to a few times before—a grassy field that ran into a muddy shore north of Ggaba beach. On weekends people rented it out for weddings, but on weeknights a group of women brought tilapia and lake perch to fry in open vats for passersby picnicking on the grass. That night, because of the intermittent rain, we were the only customers.Tilapia can be a maligned fish—freezer-bitten, bland, often ending up breaded in tacos. But fresh from the water of its native lake, it rivals red snapper for flavor. And I wanted to eat something worthy of a last meal because I knew something Olive didn’t: I was leaving.Maybe I wanted her to plead with me to stay. But she didn’t. She just asked me if I would please sell the truck because she didn’t want to deal with it. I gazed out at Lake Victoria. A few men were casting nets into an algae bloom offshore. The evening was so still that the sound of their grunts carried over the water. “When you finish here, will you come home to me?” She didn’t respond. After a while she picked off the tail fin of her fish, sucked at it, and threw the bones to one of the marabou storks that peered at us from a dead tree. It did a macabre dance of delight, opened its cloak, and descended upon us.Get the recipe:Fried Fish With Piri-Piri SauceWhen it comes to frying fish, a whole fish is a whole lot more forgiving than fillets and easier to cook. And did we mention that crispy, flaky skin?View RecipeExplore Bon AppétitCultureAll on the TableRead MorecultureDespite the Heaviness I Carried, I Kept StirringBy Elizabeth AcevedocultureTwo Strangers With a Stunningly Intimate Connection Walk Into a Restaurant...By Dani ShapirocultureMy Mother's Fried Chicken Was a Link to My Past—and My Daughter's FutureBy Kwame AlexanderRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Torrey Peters"]}