{"id": "aa64b73c769d716dd44b12984f3fca83", "url": "https://www.bonappetit.com/story/coffee-jelly", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Coffee Jelly Is My Favorite Caffeinated Dessert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCoffee Jelly Is My Favorite Caffeinated Dessert A cup of jiggly coffee jelly is the perfect boost for when it’s too hot for drip and cold brew isn’t extra enough.By Jarrett MelendezJune 22, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Years ago, when I was living in Japan, I became obsessed with a dessert called コーヒーゼリー(coffee jelly). My friend Yuko ordered it for me at a small café that specialized in trendy desserts, and I was delighted when our server brought it to the table: a glass dessert cup filled with jiggly cubes of sweetened, gelatinized coffee topped with a dollop of soft whipped cream. It was love at first spoonful. The coffee taste was surprisingly strong, complex, and natural, as if someone had taken a particularly well-brewed cup of rich, chocolaty dark roast coffee and turned it into Jell-O (not terribly far from the truth!). Each cube was surprisingly firm with just a little chew. My favorite way to eat it is to let each block melt in my mouth so that the coffee flavor gradually washes over my palate. (Fun fact: While I’ve always considered coffee jelly a Japanese dessert, I learned that it actually originated in England in the early 19th century.)After spending too much money trying as many versions as I could, I eventually learned how to make it at home with hot canned coffee and agar-agar. It wasn’t quite as good as that first taste, but 21-year-old me was very proud of himself for figuring it out.When I was developing dessert recipes for my cookbook, The Comic Kitchen, I really wanted to include a version of coffee jelly. Since canned coffee isn’t as ubiquitous in the U.S. as it is in Japan, my old recipe wouldn’t do. After a couple of very caffeinated weeks testing various brewing methods, I decided that cold brew was my favorite. It brings out the more subtle tasting notes in the coffee while allowing me to use less sugar, as I’m not fighting the bitterness that comes with most hot-brewing methods. The end result: Coffee jelly that’s complex and not too sweet with big coffee flavor.I make my own cold-brew concentrate at home (any kind of coffee will do—rich, toasty dark roasts, fruity and floral light roasts), but store-bought concentrate works just as well. Most commercially available brands use a 1:1 ratio of concentrate to water, so that’s what I use here. Not all brands are the same, though, so check the serving instructions and adjust as necessary.Here’s how to make it:Bring 1 cup water to a boil in a small saucepan. Add 2 tsp. agar-agar, 1 Tbsp. granulated sugar, and 1 pinch kosher salt, whisking until dissolved. (I’ve also tested this with gelatin, but I personally much prefer the texture with agar-agar, which turns out firmer and more substantial. Many Asian markets carry agar-agar, but if you have trouble finding it near you, you can always order it online.) Remove from heat, let cool slightly, then stir in 1 cup cold-brew concentrate.Pour mixture into an 8x8\" baking dish, then chill in the fridge until set, at least 2 hours.Meanwhile, beat 1 cup heavy cream and 1 Tbsp. granulated sugar in a medium bowl with a handheld mixer or whisk until soft peaks just begin to form. Cover and chill until ready to serve.When you’re ready to serve, cut the coffee jelly into a grid of roughly ½\"–¾\" cubes. Divide into four dessert cups and dollop with the prepared whipped cream. Garnish with chocolate shavings, a dusting of ground cinnamon or sifted unsweetened cocoa powder.Coffee jelly has been part of my repertoire for almost 15 years, generally as a refreshing summer dessert, but sometimes with breakfast or brunch for a more playful caffeine delivery. Every now and then, I’ll have it as an afternoon pick-me-up. It’s delicious anytime of day, but don’t forget it’s caffeinated. Otherwise, you’ll be up all night, dreaming of, what else, coffee jelly.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-22", "author": ["Condé Nast", "Jarrett Melendez"]}