{"id": "aa7519b743a682a5ae68805a3e169cca", "url": "https://www.bonappetit.com/story/what-are-adaptogens", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "What Are Adaptogenic Herbs, and Why Is Everyone Talking About Them? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Are Adaptogens, and Why Is Everyone Talking About Them?You've heard the word, but do you really know what an adaptogen is and which one is right for you?By Aliza AbarbanelMarch 6, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.If you've ever chilled in a salt cave or stockpiled supplement powders, you've definitely heard about adaptogens. They're the supposed panacea for anxiety, depression, insomnia, hormonal issues, sex drive, skin conditions, gut health, and the list goes on. But do you really know what an adaptogen is? And, more importantly, do you know how to use them?Okay, what’s an adaptogen?Adaptogens are a class of plants that are thought to fight stress and balance the body. While many adaptogens have been used for hundreds of years in a variety of cultures, from Chinese and Russian to Indian and Scandinavian, the term was coined by Soviet toxicologist N. V. Lazarev in 1947 to describe a substance with “non-specific” resistance to adverse influences like stress. The concept drew from a Hungarian-Canadian endocrinologist named Hans Selye, who broke down humans' stress response into three phases: alarm, resistance, and exhaustion. Adaptogens are thought to decrease our sensitivity to outside stress, keeping us in the resistance phase, i.e., keeping us calm. Some adaptogens are commonly found in ayurveda, a medical system that originated in India over 3,000 years ago, but not all adaptogens are ayurvedic.What are the benefits of adaptogens?Generally, adaptogens help the body cope with physical and mental stress. “This class of herbs, and ashwagandha specifically, I think really matches our lifestyles right now,” says Grace Galanti, a trained herbalist who grows adaptogens like ashwagandha root and tulsi holy basil at Furnace Creek Farm in Berks County, Pennsylvania. “I see the classic busy working person in New York City, but I also see elderly people needing energy and endurance athletes using ashwagandha tea as part of their training regime.”Photo by Alex LauHow can you take adaptogens?“I think it’s become fashionable to add adaptogens to your drink, and you might get minimal effects from that, but you’re not going to see those benefits from a one time use,” says Dr. Amy Shah, M.D.” Instead, she recommends consuming adaptogen powder or pills daily over a period of several months.Moon Juice and Sun Potion are two of the biggest names in the adaptogen game right now, flanked by a variety of new and well-established companies around the world. They offer a multitude of ways to incorporate adaptogens into your lifestyle, from liquid elixirs and powders to coffee mixes and tea blends. “I tend to prefer liquid extracts because they pre-digest the herb and pull out some of the important constituents that your body will use,” says Galanti.What you should know before buying“There are so many interactions between supplements and medication, so if you’re someone under the care of a medical doctor, it goes without saying that you should be talking to them about any new supplements you’re going to try, especially adaptogens,” says Dr. Shah. “Especially if you’re on thyroid hormones, you should let your doctor know, because adaptogens might change things.”In addition to speaking with your doctor, it’s important to make sure any product is sourced safely. “These products aren’t required to prove that they work, that they contain what they say on the ingredients list—or even that they’re safe—before they can be sold,” says Ali Webster, PhD, RD, Associate Director for Nutrition Communications at the International Food Information Council. “Look for the USP seal on any bottle or jar of supplements, which indicates that the supplement was verified by the United States Pharmacopeia, or the NSF international dietary supplement certification.”With your adaptogens in hand, Galanti recommends starting out by making a tea. “Having a connection between your life habits and the plant that you’re taking is really important, just like a meal,” she says. “It’s not just the fact that you’re consuming the herb—it’s a ritual that’s calming, centering and also a part of self care.”Some adaptogens and what they're commonly used for:Adaptogens can generally be classified as stress busters, but things get more complicated when broken down to an individual plant level. Scientific studies don't always back up individual experiences, but the two adaptogenic herbs most widely studied in Western medicine are ashwagandha and rhodiola. Still, a variety of adaptogens have been embraced worldwide. Here are some key ones to know:Ashwagandha: Ashwagandha is an ayurvedic herb used to combat stress for centuries, and modern studies reinforce ashwagandha’s potential to reduce stress and anxiety in adults.  The gnarled root has also been embraced in the food world—it’s a common ingredient in moon milk and used by chefs like Angela Dimaguya, the former executive chef at Mission Chinese, to imbue dishes like steamed fish in a clay pot with a deep, earthy flavor.Rhodiola: Rhodiola has been used as a source of energy for centuries. Vikings downed rhodiola before raids, and cosmonauts aboard the Russian Space Station used the yellow flowered succulent to elevate their moods while floating through space. More recently, a 2013 study published in the Journal of Strength and Conditioning Research found that amateur cyclists given rhodiola were able to complete a timed six-mile ride faster than the placebo group, and finished their pre-race warm-up with lower heart rates.Cordyceps: Cordyceps, reishi, and chaga are some of the many antioxidant-rich functional mushrooms with the potential to increase energy, boost the immune system, and reduce stress. In fact, Healthyish contributors Dr. Tiffany Lester and chef Seamus Mullen both reach for mushrooms to combat fatigue. Cordyceps are particularly known to have energizing effects, due to its beta-glucans, which are thought to have anti-inflammatory properties.Reishi: In addition to its antioxidant properties, reishi mushrooms may be able to enhance immune response and keep skin looking young by reducing dermal oxidation.Chaga: These mushrooms are a core part of natural medicine across northern Europe. Chaga mushrooms are one of the richest sources of antioxidants in nature, and are commonly used to reduce inflammation and boost immunity.Mucuna Pruriens: Billed as a \"dopamine bean,\" mucuna pruriens are a legume native to Africa and tropical Asia. Its seeds contain about 3.1–6.1% L-DOPA, the precursor to neurotransmitters like dopamine and adrenaline. While more research is needed, it is thought to be of therapeutic value, particularly in reducing psychological stress.Tocos: A powder derived from rice bran, tocos is high in Vitamin E and thus lauded as a shortcut to better skin (and as a non-dairy creamer!).Tulsi Holy Basil: While it looks similar to the basil found on your pasta, Tulsi holy basil is widely used as a calming herbal tea in Ayurvedic medicine. “I make a point to eat some when I’m in the field because I can fall asleep more easily and feel rested the next day,” says Galanti. “Tulsi has more of a mental component helping with frazzled energy, and I think of ashwagandha as a physical strength and endurance—I pair them together a lot.”Chill out and cook with adaptogens:Moon MilkSleepy? This warm milk recipe will help usher you off to dreamland.View RecipeSteamed Fish in Clay PotAngela Dimayuga of Mission Chinese Food likes using whole dried ashwagandha root in this clay pot dinner.View RecipeExplore Bon AppétitHealthyishRead MoreLifestyleWhat Is CBD, and Why Is It in Everything Right Now?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Aliza Abarbanel"]}