{"id": "aa87c8388b72b14f01d0d863382cad9e", "url": "https://www.bonappetit.com/recipe/beluga-lentil-and-root-vegetable-slaw", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Beluga Lentil and Root Vegetable Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueBeluga Lentil and Root Vegetable SlawBy Sophia RoeDecember 1, 20204.5(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintAny crunchy vegetable or fruit can live in this colorful slaw from chef Sophia Roe, the host of Counter Space on Vice. Try fennel, small turnips, or Asian pear, shaved or cut into matchsticks. Black lentils, sometimes called beluga or caviar lentils, are great in salads because they keep their shape well once they’re cooked. Check on them often while they boil as they can overcook quickly.Ingredients4 Servings1½cups black beluga lentils, rinsedKosher salt2lemons1shallot, thinly sliced1garlic clove, finely grated¼cup coarsely chopped parsley2Tbsp. sherry vinegar or red wine vinegar1Tbsp. pure maple syrup½tsp. crushed red pepper flakes3Tbsp. extra-virgin olive oil, plus more for drizzling2red beets, peeled, sliced into matchsticks2medium carrots, peeled, sliced into matchsticks (optional)1green apple, sliced into matchsticks½cup very thinly sliced red cabbagePlain whole-milk Greek yogurt (for serving)PreparationStep 1Cook lentils in a large pot of boiling salted water until tender but still firm, 20–25 minutes. Drain and let cool 10 minutes.Step 2Finely grate zest of both lemons into a large bowl. Cut 1 lemon in half and squeeze juice from both halves into bowl; reserve remaining lemon for another use. Add shallot, garlic, parsley, vinegar, maple syrup, red pepper flakes, and 3 Tbsp. oil and whisk to combine; season with salt. Add lentils and toss to coat. Add beets, carrots (if using), apple, and cabbage and toss again. Divide among bowls; top each with a dollop of yogurt and drizzle with more oil.How would you rate Beluga Lentil and Root Vegetable Slaw?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleWonderful- a great hearty but light dish- added dried cranberries and chopped pistachios the next day!Aag721Nyc12/14/2020Delicious!  Used canned black lentils, worked well and cut prep time down significantlyAnonymousOakland, CA12/9/2020It was a dish I didn’t know I needed. Great flavor and yes checking the lentils is a must. I understand now. It’s a hearty  dish with flavor infusions all over. I can see this being summery too. Emikoftokyo NYC12/8/2020Nice, fresh, easy recipe for early winter. Omitted the garlic and shallot due to allergies in the house, and it was still very delicious. Also added an egg for some extra protein and calories. Ate leftovers a day later, and the salad was still crisp and fresh.AnonymousDenver, CO12/6/2020Explore Bon AppétitSlawSaladBeetVegetableBlack LentilLentilRed CabbageCabbageLeafy GreensCarrotEasyQuickSideNut-FreeGluten-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sophia Roe"]}