{"id": "aa99f9212e736a5d08c912e1a876ad26", "url": "https://www.bonappetit.com/story/potato-rosti-beats-latkes", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "This Potato Rösti Beats Making Latkes for Hanukkah | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSomeone Else Can Make the Latkes—I’m Doing RöstiThe large-format, no-fry potato fritter beats latkes in every way, shape, and form. By Sarah JampelDecember 20, 2019FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailRiddle me this: If latkes are so great, why do we only eat them once a year? (What’s that, pumpkin pie? You have an answer?) When Hanukkah does come around, I dread the obligation to make them—and the guilt of putting it off until zero of eight nights remain. Don’t get me wrong: I appreciate a fried potato as much as the next human with a pulse, but I won’t be making latkes in my kitchen this year (or any year until the end of time until I have an oven with a hood).You know what I will make? Rösti. A dish of Swiss origin made with grated potatoes and sometimes the addition of cheese, onions, herbs, and even (don’t be offended) bacon, it’s essentially...a giant latke, albeit with a creamier, taller interior. Just like our food editor at large Carla Lalli Music solved the age-old problem of pancakes for a crowd with this No-Flip Blueberry Oven Pancake, I look to rösti as an easier, large-format, no-fry latke. The outside is as crisp as the outermost frills of a latke, the inside is as lush as a hot baked potato. It’s a party-size hashbrown!So you get that rösti are larger than latkes, but what makes them better? First, most latkes are just plain bad. There are so many ways to go wrong, and they never turn out as you’ve envisioned. Maybe they’ll fall apart. Maybe they’ll be mushy. Maybe they’ll be bland or crazy salty. Maybe they’ll all sog. Or maybe the first ones will sog and the rest will burn. Maybe they’ll be all crispy edges with no tender middles. Maybe sour cream and applesauce will be their only salvation. Yes, worse things have happened, but I’d rather have rösti, which never needs a cover-up.And even when latkes do go well (a real Hanukkah miracle), your kitchen is done for. You might as well start looking for a new place now. There will be splatters of oil everywhere, in places you’ll never be able to clean. Your pans will need to be scrubbed inside and out (some will never recover). Any item of clothing that you were wearing will have to be washed immediately. If you’re me, you’ll consider having your apartment fumigated.Then there’s the problem of making latkes for a crowd. Crisp latkes, like all fried foods and all human beings, are dying slowly—every tick of the clock is one second closer to demise. Sure, you can keep them warm in a low-temperature oven, but nothing beats the texture straight from the skillet. Are you going to knowingly feed your guests sub-par latkes? Or are you going to stand at the stove like a short-order line cook? (Boy do I sound like my mother.)For contributor Claire Saffitz’s salt-and-vinegar rösti, there’s hardly any stove supervision required. Par-boiled potatoes are grated, mixed with vinegar-soaked onions, and baked for 45-60 minutes, after which the cakes are broiled on both sides—crispiness insurance! Think about everything you could do while the rösti bakes. You could cook something to complete your meal, so that you’re not only eating potatoes for dinner. You could play a rousing game of dreidel or eat your weight in gelt. You could fall asleep (set a timer though) or fall down an internet rabbithole.I’d make rösti on Hanukkah and on any of the other 357 days of the year because there’s no fry oil to filter and there’s no grease-covered cooling racks to attempt to clean. Can latkes do that?Get the recipe:Salt-and-Vinegar RöstiView RecipeExplore Bon AppétitHanukkahHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-20", "author": ["Condé Nast", "Sarah Jampel"]}