{"id": "aa9d0ec12f316717c8b3446fd085f730", "url": "https://www.bonappetit.com/story/spring-chicken-meatballs", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "This Chicken Meatballs Recipe Is Totally Appropriate for Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Recipe Wants You to Know That Meatballs Are Totally Appropriate for SpringA little bit lighter and a whole lot greener than your average meatballBy Amanda ShapiroApril 24, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by LauFacebookTwitterEmailWhen I think of meatballs, I think of cold winter nights and roasting pans. I think of spaghetti. Or lamb and raisin-y pesto, chicken with salty feta, or hoisin-laced turkey. I definitely do not think of spring. Then, on an almost warm April night, I made these chicken meatballs floating in a broth of barely cooked snow peas and celery, and I realized that a spring meatball is a real and wonderful thing.If anyone can get away with a meatball soup recipe in late April, it’s Andy Baraghani, the man responsible for that lamb version as well as this little vegetarian number. He excels at lightening up classic recipes in ways that never feel diet-y (see: Spring Minestrone, Mushroom Larb), and by this point I’ve figured out a few of his tricks. In this one, the meatballs are poached in broth rather than browned in oil in a skillet or sheet pan. He doesn’t use bread crumbs, which means the whole recipe is gluten-free. And there’s so much ginger, scallion, and fresh veg going on in this recipe that it’s basically a salad in a bowl.The meatballs come together with ginger, scallions, soy sauce, coriander, and a whole egg plus a yolk to bind the mixture. Mine were pretty wet, but they held together after about ten minutes in the fridge. While the meatballs chill, you lightly brown garlic and ginger in your stock pot, then add about six cups of water and bring everything to a simmer. (You already know how we feel about store-bought stock: If you use the right seasonings and ingredients, you don’t need it.) Drop in the meatballs and let them cook through, then toss in the sliced vegetables in the final minutes. I added a liberal handful of cilantro and a drizzle of olive oil to my bowl, but you could use any herb you like or none at all.I could see myself eating these meatballs over chilled rice noodles, or adding other varieties of veg as they come into season, like fresh corn and long beans. It’s good to have a spring meatball you can love all year round.Get the recipe:Chicken Meatballs in Spring Vegetable BrothFor this soup recipe, we skipped browning the meatballs and poached them instead. This will keep them very tender and their flavor light, which is ideal for this seasonal dish.View RecipeExplore Bon AppétitHealthyishSoupMeatballChickenSpringRead MoreLifestyleGreen Minestrone Is Here to Justify Your Spring Farmers' Market SplurgeBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-24", "author": ["Condé Nast", "Amanda Shapiro"]}