{"id": "aa9f692acd0095e6b5d04efa139152f7", "url": "https://www.bonappetit.com/recipe/apple-cheddar-pie", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Apple Cheddar Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueApple-Cheddar PieBy Molly BazOctober 4, 20184.0(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintA slice of apple pie with a slab of sharp cheddar on it is one of life’s great gastronomical treasures. We took pains to bring every element—the flaky, cheesy dough, the spice-enriched filling, the fat slices of cheese—to their natural, excellent heights.Ingredients8 servingsDough2½cups all-purpose flour2Tbsp. granulated sugar1tsp. kosher salt5oz. sharp cheddar cheese, finely grated (about 1¼ cups)¾cup plus 2 Tbsp. (1¾ sticks) chilled unsalted butter, cut into pieces¼cup chilled whiskeyFilling and Assembly3.5 lb. Granny Smith or other sweet-tart firm baking apples (about 7), peeled, cored, thinly sliced¾cup (packed) dark brown sugar¼cup whiskey1tsp. finely grated lemon zest2Tbsp. fresh lemon juice2tsp. ground cinnamon¼tsp. ground allspice¼tsp. ground cloves½tsp. kosher salt3Tbsp. unsalted butter1Tbsp. plus 1 tsp. cornstarchAll-purpose flour (for surface)1large egg1Tbsp demerara sugar8¼\"-thick slices sharp cheddar cheese (about 8 oz. total)Special EquipmentA 9\"-diameter pie dish (not deep dish)PreparationDoughStep 1Pulse flour, granulated sugar, and salt in a food processor to combine. Add cheese and butter and process until pea-size pieces of butter remain, about 15 seconds. Transfer to a large bowl. Drizzle whiskey and ¼ cup ice water over. Using a fork, mix thoroughly until larger clumps form and dough stays together when pressed with your fingertips. Using your hands, knead dough until no dry spots remain (you may need to add 1–2 Tbsp. ice water if dough is too dry). Do not overwork!Step 2Divide dough in half. Press into 2 disks about 1\" thick. Smooth out any cracks around perimeter of disks, then wrap tightly in plastic wrap. Chill at least 1 hour.Step 3Do Ahead: Dough can be made 5 days ahead. Keep chilled.Filling and AssemblyStep 4Place apples, brown sugar, whiskey, lemon zest and juice, cinnamon, allspice, cloves, and salt in a large resealable plastic bag. Seal and toss to evenly coat. Let chill at least 1 hour or up to overnight, tossing bag occasionally to make sure apples are evenly coated in liquid.Step 5Preheat oven to 400°. Cook butter in a medium saucepan over medium heat, stirring often, until it foams, then browns, 3–4 minutes.Step 6Transfer apple mixture along with juices to a large bowl. Add brown butter and cornstarch and toss to coat.Step 7Line a rimmed baking sheet with parchment paper. Let dough sit at room temperature 5 minutes, then roll out 1 disk on a lightly floured surface to a 12\" round. Carefully transfer round to pie dish. Lift up edges and allow dough to slump down into dish, then press dough firmly against sides and bottom of dish. Trim, leaving about a ½\" overhang.Step 8Beat egg with 1 tsp. water in a small bowl and brush around edge of dough. Chill while you roll out remaining disk of dough to a 12\" round. Carefully transfer to prepared baking sheet and chill until ready to use.Step 9Arrange apple mixture in pie dish, creating rough concentric circles and nestling together so there aren’t gaps. (Don’t go too crazy here, but nestle them in enough so that they’re tightly packed—a lot of extra space can lead to a sunken top crust.) Pour any remaining juices from apple mixture over.Step 10Place second round over filling. Trim edges of top round, leaving a 1\" overhang. Fold edge of top round up under bottom edge; press together to seal. Crimp edge and brush whole top with remaining egg wash. Sprinkle with demerara sugar. Cut a few 3\" slits in top to let steam escape. Place pie dish on a foil-lined rimmed baking sheet and chill 20 minutes.Step 11Bake pie until crust is beginning to take on color, 15–20 minutes. Reduce oven temperature to 350° and continue to bake, tenting with foil if crust is getting too dark, until crust is deep golden brown and juices are thick and bubbling, 85-100 minutes longer. Note: It is difficult to overbake this pie. Make sure the juices are really bubbling and the bottom crust is well browned. That’s key for a crisp crust and a well-set filling. If you take the pie out too soon, you could have underdone apples and a soggy bottom!Step 12Transfer pie to a wire rack and let cool at least 4 hours before serving. Serve with cheese slices alongside.Photo by Chelsie Craig, Food Styling by Kate BuckensStep 13Do Ahead: Pie can be made 1 day ahead. Let cool; store covered with foil at room temperature.How would you rate Apple-Cheddar Pie?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI really appreciate the concept of this recipe, but I definitely want to try it again tweaking a few things. Firstly the crust NEEDS more salt, the taste of the oils of the unsalted butter, and the cheese are too similar to really appreciate the cheese in the crust, I think this will be remedied by adding a dash more salt or maybe even using salted butter?? and a stronger cheese maybe extra sharp cheddar cheese. Also to really create a contrast between the expectedly sweet filling of the pie with the more savory crust I will be adding a cup of just regular cane sugar to the filling and decreasing the amt of brown sugar to 1/2 cup. Hoping to try this soon! Overall love the concept and excited to keep baking!swampkweenSan Francisco, CA12/4/2019I made this recipe for thanksgiving and it was a HUGE hit! I was a little nervous to make it on a big day after reading all the reviews about how people got a soggy bottom and undercooked apples, but it was perfection! I used 8 Granny Smiths and cut them a little thicker, used apple cider for the filling and the whiskey for the crust. I also let the apples marinate for an hour, added one teaspoon extra of cornstarch (just in case) and put all the marinade in the pie except for about 1/4 cup of it. This pie turned out great, super crispy bottom, the filling was goopy and bubbling, and the apples supremely tasty. I would definitely make this again!AnonymousBoulder, CO11/22/2018Confirming that its doesnt acctually take 85-100 minutes...?\n\n\"Reduce oven temperature to 350° and continue to bake, tenting with foil if crust is getting too dark, until crust is deep golden brown and juices are thick and bubbling, 85-100 minutes longer.\"AnonymousNeo Yoko11/10/2018Recipe lists 1/4c whiskey as part of the filling ingredients.  However, in both preparation of dough, and filling, it calls for whiskey?  Please clarifyAnonymousCA11/7/2018Great crust! \n\nNote: I really wasn't sure what the concentric circles of the apples was all about. I also used organic apples and sliced them very thinly, which I would keep in larger chunks. AnonymousMilwaukee, WI11/5/2018Love this pie! Granny smith are the perfect apple for this autumnal treat. I let it sit the full time Molly said to in the recipe and it came out perfect! No sogg at all.\nThanks Molly and BA!!!Anonymous10/29/2018This is a really good pie. I used Granny Smiths and did not have soggy bottom nor was it too sweet. I'd even say I could have added a bit more sugar in mine as it came out a bit too tangy which is probably due to the specific Granny Smiths I used. I sliced the apples quite thin with a mandoline, which allowed them to get super soft when baked. Mine was ready in 70 minutes, with a fully browned crispy bottom. I let it rest for 3 hours before consuming. We really enjoyed the spices in it. AnonymousIthaca, NY10/28/2018You need to change this recipe to discard the marinade or to pour up to 1/4 cup of the marinade over the apples. I used Granny Smith as the recipe indicated and its so soggy I had to pour out tons of juice from pie as other reviews said. The taste of the pie and the crust is excellent though and I’ll make it again without the juices of the marinade.RCathcartWASHINGTON. DC10/20/2018I agree with the others, the crust was amazing!  I used Granny Smith apples and didn’t have any problems with the juices or ‘mushy soup’ \nI would however cut back on the sugar a bit too if I made it again. I made some not so sweet whipped cream to serve with it which balanced the sweetness. nallseMissoula,MT 10/18/2018Hey @anonymous, thanks so much for your feedback on the pie. The mushy soupy apple syndrome could have been a result of the type of apple you used. We tested this with a firm tart Pink Lady apple, which stands up to the marinade and doesn't break down during cooking. So sorry it didn't work out! Let us know if you try it again.Bon_AppetitNew York, NY10/18/2018We wanted to LOVE this recipe. We went out and picked fresh apples so we could celebrate with this pie. The crust is phenomenal and I'll be making it for other pies. The filling tastes great raw (I dare you to try to not just nibble away) and smells wonderful. But adding the juices from the apples into the pie like the recipe suggests is an epic mistake. We waited by the oven most of the evening for this pie and ended up with too sweet mushy apple soup inside a great crust. We waited about 3 hours (Also... who can wait 4 hours to eat a fresh pie? ) before we caved and cut into it. And then we poured over 2 cups of apple liquid out from the pie before we could eat it. That quantity of juice won't thicken with the little bit of cornstarch. We I'll make it again but I certainly won't let the apples sit to marinate ...they don't need it...and I definitely suggest leaving the extra juices out of your pie if you do decide to let em sit. The sugar in the recipe needs to be cut back- it overpowers the apples. I'm sure with these edits that it'll be great. We are still a bit sour over all the effort and the soup pie so it'll be a while. AnonymousNC10/18/2018Really good!   Crust was awesome..   The recipe was a bit ambiguous about the juices that emerged from the apples sitting in the ziplock bag, whether they should be in the pie or not.  We opt'ed not..  and still had plenty of juice in the pie.   We were supposed to wait 4 hours after baking before eating, yeah, we didn't do that.   Next time -- we'll make it earlier in the day so that it naturally has time to rest.  I thought the baked apple filling was a tad sweet, others did not - so if I made it for myself, I'd cut back on the brown sugar.    For family, it looks like the recipe is good the way it is!wburosAustin, Tx10/8/2018Explore Bon AppétitFruit DessertDessertPieAmericanAppleFruitCinnamonHerbs & SpicesCheddarCheeseFallBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Molly Baz"]}