{"id": "aaa722a49dbd0f937cb2dda17ff9398e", "url": "https://www.bonappetit.com/story/italian-hero-hoagie-grinder-sub", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Master the Italian Hero and Be the Hero of Every Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaster the Italian Hero and Be the Hero of Every PartyHere’s how to make the classic stacked Italian sandwich at home, courtesy of our editor in chief Adam Rapoport, the hero of heros.By Adam RapoportJanuary 8, 2019FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A hero, a hoagie, a grinder, a subOver the years, I’ve used the NFL playoffs as an excuse to turn my apartment into an Italian hero shop.I run to a nearby Italian market for the meats—pistachio-flecked rounds of mortadella, fat-marbled discs of coppa, thinly shaved sheets of prosciutto cotta (cooked ham; the pricey prosciutto di Parma is too chewy for hoagies, IMHO), and maybe a dried finocchiona sausage for a bit of garlicky bite.I then head to my local grocery store for the basics. First, a bunch of those simple sub rolls from the plastic bin—cottony soft in the middle, a little crackly on the outside.Iceberg, which I slice into thin ribbons, or what we at BA refer to as shrettuce.A red onion that I slice super thin on a mandoline and then quick pickle them with some rice wine vinegar, a pinch of salt and sugar and a splash of water.And then I set up shop and invite whoever is around.The more I’ve done it, the more I’ve learned. When I first started assembling homemade heroes, I delicately stacked the meats and fixings like a deck of cards. And, don’t get me wrong, it was tasty. It allowed the ribbons of meat and confetti of shrettuce to breathe a bit.Ted CavanaughBut a concerned, sub-obsessed reader DMed me after watching a video of me making these heros. He pointed out that the proper way to make an Italian hero was to employ what I’ll call the horseshoe method.First, slice the roll, but not all the way through, so it lies flat. Then you lay the various, thinly sliced meats like you’re tiling a floor. Then comes equally thinly-sliced provolone cheese, layered with the meats. (Although, as one of my Instagram followers pointed out, I should place the cheese on the outside so it doesn’t get bunched up in the middle.) You pile on the shrettuce and shaved onions and douse them with some oil and red wine vinegar (don’t be stingy), and hit ‘em with a shake or two of dried oregano.Then you fold the whole thing over onto itself so it creates a horseshoe shape, the fixings on the inside so they don’t make the bread all soggy, the meats on the outside so they don’t form into a dense ball in the interior. And, oh yeah, I do like a slick of mayo with some Calabrian chile spread or chopped pickled peppers on either side of the roll. I know, I know—mayo.Photo by Adam RapoportEach time I make the heros, they turn out differently. Sometimes I feel like I should’ve splashed them with more vinegar. Sometimes I get the meat-to-bread ratio just right; sometimes I lean too carby.However they turn out, they’re inevitably some degree of delicious. And, as a finishing touch, I’ll wrap each one in wax or parchment paper before slicing it and handing it to one of my “customers.” It’s a mostly-unnecessary step but it makes the sandwiches look great. And, really, what’s better than a good-looking Italian hero?Get the recipe:Party-Ready Italian HerosExplore Bon AppétitAdam NewsletterItalianSandwichRead MorecultureRob Corddry Ate This Italian Sandwich Every Week for DecadesBy Alyse WhitneycookingThe Very Important Italian Cold-Cut Sandwich RulesBy Adam Rapoport and Vincent CrosscookingThese Quick Lime-Pickled Onions Taste Like SummerBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Adam Rapoport", "Vincent Cross"]}