{"id": "aab3dbf62b371db18fe19fba96f1b329", "url": "https://www.bonappetit.com/story/this-wedding-cookie-recipe-is-the-only-married-thing-about-me", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "This Wedding Cookie Recipe Is the Only Married Thing About Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Wedding Cookie Recipe Is the Only Married Thing About MeIf you love cookies so much why don’t you make these brown butter wedding cookies?By Alex BeggsDecember 5, 2018FacebookTwitterEmailFacebookTwitterEmailAbout seven years into my partnered unmarried life, I made these brown butter wedding cookies. It’s the closest I’ll ever get to a Zola registry, and for that, I’m relieved. I like to keep my distance. From institutions, not cookies! I like to be close to cookies. Very close.In the powdered sugar-strewn timeline of desserts, there have been many variations on these cookies: Mexican wedding cakes, Italian wedding cookies, butterballs, Russian tea cakes…Regina Schrambling at the Los Angeles Times traces the buttery trail here. But the common link is this: a melt-in-your-mouth cookie made with a shocking amount of butter, powdered sugar, nuts, flour, and vanilla. A double layer of powdered sugar gives them a velvet coating that dissolves on the tongue like a freshly fallen snowflake. Scenic much?Because this is Basically, our recipe is a pared-down, simple version that doesn’t tinker and tweak with added extracts, zests, or alt-flours. However, we do start with brown butter instead of normal butter, which adds a caramel-y, nutty flavor to the already-nutty cookie. Double nut fun! If you’ve never made brown butter, now's your chance to learn and have a whole cookie universe opened up to you. (It’s a game-changer in chocolate chip cookies too.)Brown butter looks like this, if ya wanna know.\nPhoto by Alex Lau, Food Styling by Judy ManciniOnce you’ve made the brown butter (TWO STICKS, BABY!), you chill it ‘til it’s solid, then cream it with powdered sugar using an electric mixer until it’s all fluffy. After that you mix in the flour, and fold in chopped walnuts and vanilla. That’s your cookie dough—pause to lick spatula clean. After that you MUST chill the dough. Two hours-ish. This cookie dough is pretty much sugared butter and we need that fat to solidify so that when the cookie balls hit the oven, they don’t spread and lose their snowball shape.Powdered sugar bath.\nRoll the cold dough into balls, or shape them gently with your fingers (what I did because my were pretty crumbly and not so easy to roll, Play-Doh style). They bake for 20-25 minutes depending on your oven sitch, but what’s tricky is knowing when they’re done, because we don’t want them browned and golden like choc chips. Notice how doughy, soft, and sticky the raw dough looks, and then keep an eye out to see them firm up and almost look dried out. When they’re still warm, roll them in a powdered sugar bath, let them fully cool, and roll one more time before serving—or stashing, because they’re even better the next day.My cookies came out looking less like perfect snowballs and more like prehistoric rocks, but that’s really the story of my life. The final texture was spot-on, though, with that soft sugar blanket giving way to smooth, shortbread butterballs with crunchy walnut specks. I’d take a bite of cookie, sip of coffee, bite of cookie—and then next thing you know, seven years have gone by and people have finally stopped asking me if I’m just going to marry the cookies already. Nah, we’re good. We’re very happy like this.Get the recipe:Brown Butter Wedding CookiesSix-ingredient cookies for people who don't think they can bake cookies.View RecipeExplore Bon AppétitCookieholiday2018Holiday CookiesBrown ButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-05", "author": ["Condé Nast", "Alex Beggs"]}