{"id": "aab47b587d8040fe2c45efe837ceabbd", "url": "https://www.bonappetit.com/story/that-carb-life", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Are We Only Eating Carbs Right Now, Or Is It Just Me? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAre We Only Eating Carbs Right Now, Or Is It Just Me?My current crew: pasta, pizza, bread.By Sarah JampelApril 29, 2020FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hey Basically readers,It’s probably because I just listened to the New York Times’ Sam Anderson read his essay about Weird Al Yankovic, but this week the phrase “all she wants to eat is carbs” to the tune of Don Henley’s “All She Wants to Do is Dance” is running through my brain. She wants potatoes! Ooh! She wants focaccia! Ooh! All she wants to eat is… all she wants to eat is carbs!It’s true and I’m not fighting it. In an alternate universe, I’d “use” this “time” at home to expand my palate and my skills, attempting new dishes every night of the week. And while I’m doing some of that, I’m also giving myself permission to eat the foods that feel comforting and nourishing to me, even if I’ve already had pasta three of the last four meals. Speaking of which...Want this letter before it hits the website? Sign up for our newsletter!Photo and Food Styling by Sarah Jampel The Best Thing I Ate Last WeekA Lotta RicottaSome of the BA editors have been taking photos for upcoming articles at home, and I was lucky enough to photograph Alex Delany’s “signature side”—a heap of ricotta surrounded by a moat of garlicky broccoli rabe. But because I wanted it as dinner, not as a side, I boiled some linguine, saved a cup or so of the pasta water, then scooted the cheese into the hot pasta and used that starchy liquid to make a very fast, very simple sauce. No cream or butter or emulsifying necessary. I chopped the broccoli rabe into bite-sized pieces and added it to the pot along with lemon juice and zest.And with the extra ricotta, I’m going to make a half-batch of ricotta gnocchi to save in the freezer.Photo and Food Styling by Sarah JampelAn “Assignment”Should You Choose to Accept ItMy mom recently told me she had given my dad an “assignment.” While she was at work (doctor-mom!), my dad’s task was to pick out a dinner recipe that used only ingredients in the house. He chose Andy Baraghani’s Grilled Salmon with Whole Lemon Sauce. They subbed in white sesame seeds for the black ones, and it was a great success. I want to implement this same assignment in my household of two—you pick it, I make it.When the hardest part of making dinner is choosing what to make, outsource that job. Maybe text a friend a few ingredients you’re trying to use up and have them send you a couple recipe options back? Is that annoying? Personally, I’m on a text thread where we compare crispy brussels sprouts recipes, troubleshoot flan, and bat around ideas about what to do with an excess of dried chickpeas (uh, 10 pounds) and I’ve never felt so useful.Photo and Food Styling by Sarah JampelMoment of AppreciationPB&J, Hip Hip Hooray“No more dishes, I beg of you!” That’s what my husband says to me every single time I even think about entering the kitchen. So for lunch this week I had peanut butter (Maranatha forever) and jelly. I always do it open-faced so that I can more fully control the ratio of bread to smears and continue applying PB as I see fit. It was fast and delicious and there were no pots or pans to clean.This Week I’m Going To…Listen to “Staying In With Kumail and Emily,” a truly delightful podcast from Kumail Nanjiani and Emily V. Gordon; I’m saving the episodes—an hour of silly but thoughtful banter—to listen to during long walks as a form of motivation; all proceeds go to coronavirus researchPlay “rank your cousins” as a form of entertainment suggested by aforementioned Kumail and Emily; just kidding—I could never...Make a smoothie for second breakfast (my entire freezer is filled with bananas)Eat Molly Baz’s Smashed Chickpeas on Toast with Harissa YogurtSee you here next week!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-29", "author": ["Condé Nast", "Sarah Jampel"]}