{"id": "aac34756208b5c46e078be90cc9b278e", "url": "https://www.bonappetit.com/recipe/chile-garlic-cucumbers", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Chile-Garlic Cucumbers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueChile-Garlic CucumbersBy Kat BoytsovaFebruary 12, 20194.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintLess sharp than regular pickles, these cucumbers are a punchy addition to any sandwich, salad, or grain bowl. Use with Chicken and Cucumber Rice Bowls and/or Greens-and-Beans Sandwiches.IngredientsMakes about 2½ cups4Persian cucumbers, halved, thinly sliced on a diagonalKosher salt1serrano chile, thinly sliced1garlic clove, finely grated½cup unseasoned rice vinegar1Tbsp. honeyPreparationStep 1Toss cucumbers and a large pinch of salt in a medium bowl. Let sit at room temperature, tossing every 5 minutes or so, until cucumbers release some liquid and begin to soften, about 15 minutes.Step 2Meanwhile, whisk chile, garlic, vinegar, honey, and a large pinch of salt in an airtight container large enough to contain the cucumbers.Step 3Squeeze as much liquid from cucumbers as possible and add to vinegar mixture. Toss to coat. Let sit at least 30 minutes before serving.Step 4Do Ahead: Cucumbers can be marinated 1 week ahead. Cover and chill.How would you rate Chile-Garlic Cucumbers?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleI've made these two weeks in a row - for grain bowls last week, and for everything else this week! So good. I wouldn't add more garlic, I think the flavor is balanced as is.AnonymousRichmond, VA3/5/2019Tasty but not very garlicky at all -- I would use 1 or 2 more cloves in the future.AnonymousBrooklyn, NY2/26/2019Explore Bon AppétitCondimentCucumberVegetableEasySnackStarterDairy-FreeNut-FreeVegetarianGluten-FreeHealthyishPickle and PreserveRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Kat Boytsova"]}