{"id": "aacbf193c152622cfe093fc3db0e80fe", "url": "https://www.bonappetit.com/recipe/beet-halwa-with-pistachios", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Beet Halwa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBeet Halwa With PistachiosBy Preeti MistryMarch 16, 20213.7(7)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“In a lot of Indian sweets, the base technique is cooking something down in lots of milk,” chef Preeti Mistry says. “I don’t make a lot of desserts, and what I love about this one is that it’s really easy for non-bakers to make.” This vibrantly hued halwa consists of grated beets cooked down in the milk, giving the beets a surprising richness. Fold in pistachios for texture and crunch, and serve this warm or chilled. If warm, you can scoop ice cream on top. If chilling, halwa can be set in a 9x9\" baking pan if you don’t have ramekins.The spices in this recipe are the same ratio Mistry uses in their masala chai, so reserve any extra for use in tea.Find more of chef Preeti Mistry’s Holi party recipes here.Ingredients8 Servings½cup raw pistachios12\" cinnamon stick1Tbsp. plus 1½ tsp. green cardamom pods2tsp. black peppercorns2tsp. whole cloves5medium red beets (about 2 lb.), trimmed, scrubbed4cups whole milk4Tbsp. unsalted butter½cup (packed) light brown sugar1tsp. vanilla extractspecial equipmentA spice mill or mortar and pestlePreparationStep 1Preheat oven to 400°. Toast pistachios on a rimmed baking sheet, tossing halfway through, until golden brown, about 4 minutes. Let cool; coarsely chop.Step 2Meanwhile, crush cinnamon stick with the side of a chef’s knife to break into pieces. Toast cinnamon, cardamom, peppercorns, and cloves in a medium skillet, stirring occasionally, until slightly darkened and very fragrant, about 4 minutes. Transfer to spice mill or mortar and pestle and let cool; finely grind.Step 3Grate beets on the large holes of a box grater. (You should get 4 heaping cups.) Transfer beets to a medium saucepan and add milk and butter. Cook over medium heat, stirring often, until thickened, 16–20 minutes. Stir in brown sugar, vanilla, and 4 tsp. spice mixture (use the leftover spice mixture in other desserts, hot chocolate, or to make chai). Reduce heat to low; cook, stirring, until liquid is almost completely evaporated, 15–20 minutes.Step 4Stir half of the pistachios into beet mixture and divide among 8 small ramekins or small bowls.Step 5Top halwa with remaining pistachios just before serving.Do ahead: Halwa can be made 3 days ahead. Cover and chill.How would you rate Beet Halwa With Pistachios?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleFlavor is perfect, but per other commenters it needs MUCH longer than 20 minutes to cook down.  Maybe an hour+ on medium-low heat?  But it was pretty hands-off so it was easy to let it take the time it needed as I was working on other things in the kitchen.EmilyPittsburgh, PA10/14/2021Can you do a more keto version by using monk fruit sweetener instead of all that sugar.\nI never use sugar in anything now but do love halvah as I recalled it from childhood when we\nwere given lots of sweets.TamarqueNew Paltz, NY6/15/2021Same as the review below -- this took me about two hours total to get the milk to evaporate. It was worth it. I am East Indian and grew up with sweeter halwa, so next time I'd double, maybe triple the amount of sugar. But the spices are sublime and work really well with the beets, and the colors of the scarlet beets contrasted with the bright green of the pistachios are really spectacular.Anonymous3/28/2021I'm cooking this right now.  i'm not sure anyone tested this recipe as it's impossible to have 4 cups of a liquid and to cook it of in 15-20 minutes to it almost being completely evaporated.  I've been cooking mine for at least an hour and it's not done.  I even poured off some of the liquid and it's still not done.  \n\nOtherwise, it smells amazing and tastes so good.  I used a mix of beets and carrots.  I really like the earthiness of the vegies with the spices.  Nancy ISanta Barbara, CA3/22/2021Explore Bon AppétitDessertIndianSouth AsianAsianBeetVegetableEasyGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}