{"id": "aad08aa3172877c005b6c36ea2726d06", "url": "https://www.bonappetit.com/recipe/winter-crunch-salad", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "Winter Crunch Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWinter Crunch SaladBy Claire SaffitzJanuary 2, 20184.7(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's Bridge, styling by Molly BazEmailPinterestPrintEmailPinterestPrintDidn’t think you could eat brussels sprouts raw? Well you can, especially when they’re thinly sliced and tossed in a tangy, mustardy vinaigrette. Add a mess of kale, salty cheese, sweet-tart apple, and crunchy seeds, and you get a borderline addictive salad.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Rimmed Baking Sheet$28 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAForkMicroplane$16 At AmazonWhisk$10 At AmazonPaper Towels$13.45 At AmazonLarge Bowl$18 At AmazonBox Grater$13 At AmazonIngredients4 servings¼cup raw sunflower seeds1teaspoon plus ⅓ cup extra-virgin olive oilKosher saltFreshly ground black pepper½small shallot½large lemon1small garlic clove2tablespoons Dijon mustard1large bunch Tuscan kale (about ¾ pound)6ounces brussels sprouts2ounces Parmesan1Pink Lady applePreparationStep 1Preheat oven to 350°. Toss ¼ cup sunflower seeds and 1 tsp. oil on a small rimmed baking sheet. Season with salt and pepper. Roast until darkened and very fragrant, 7–10 minutes. Let cool.Step 2Meanwhile, start to build vinaigrette in a medium bowl. Finely chop shallot half and transfer to bowl. Using the tines of a fork or a reamer, juice lemon half over bowl. Discard seeds; you should have about 2 Tbsp. juice. Using a microplane, finely rate 1 garlic clove into bowl. Whisk in 2 Tbsp. Dijon mustard; season with salt and pepper.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Wash and dry 1 bunch kale, then pat leaves dry with a clean towel. Strip leaves from thick stems, discarding stems, then thinly slice leaves. Transfer to a large bowl.Step 4Trim knobby end of 6 oz. brussels sprouts and pull off any dried or gnarly outer leaves. Cut all brussels in half lengthwise, then arrange halves cut side down on board and very thinly slice. Add to bowl with kale.Step 5Grate 2 oz. Parmesan on the small holes of a box grater.Step 6Slice 1 apple in half, cut out core and seeds, then thinly slice. Add to bowl with kale. Snack on remaining apple.Step 7Whisk remaining ⅓ cup oil into bowl with lemon mixture.Step 8Drizzle dressing over kale mixture; season with salt and pepper. Toss with your hands to coat.Step 9Add cheese and sunflower seeds and toss lightly to incorporate.Step 10Do Ahead: Dressing, kale mixture, and toasted sunflower seeds can be prepared 8 hours ahead. Cover dressing and kale mixture separately and chill. Cover sunflower seeds and store at room temperature.How would you rate Winter Crunch Salad?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleHusband and I love this salad. I generally add a splash of apple cider vinegar to the dressing, as per another reviewer’s suggestion, and I put the garlic through a press instead of grating it, but otherwise follow the recipe exactly most of the time (though at various times I have made this without Brussels sprouts, with curly kale, with Fuji and Gala apples. Always delicious).\n\nA half recipe is a nice lunch for two; this is filling enough that we don’t feel we need to have bread or soup along with.\n\nHighly recommend!Anonymous2/1/2022Unbelievably good! I subbed toasted walnuts for the sunflower seeds (evan more crunch!!)and added the dried cranberries as suggested by another reviewer.\n and added I made the vinaigrette ahead- so great! I actually weighed the brussel sprouts to try and get the correct proportions.\n\nI can't wait to make it again- as soon as I get more brussel sprouts :) Jhawkm84Oregon 1/10/2022My favorite new salad.  Made it true to the recipe but have modified it after so many times. No parmesan cheese. Bought roasted sunflower seeds for convenience.  More lemon and mustard and less oil. Added dried cranberries. Used a bag of trader Joe's cruciferous blend. Perfect and fast. This salad will keep for a day or 2.AnonymousCherry Hill NJ12/8/2021Great fall/winter salad!! Made for a Friendsgiving and everyone loved it. The acid and greens really helped cut through all the heavy thanksgiving dishes. Added some apple cider vinegar to the dressing to amp up the acid, and left out the parmesan. AnonymousFort Worth, TX11/14/2021So... I think this has the potential to be good. I found grating the garlic to be too sharp. I want to make again with modifications; just need to think about how to balance things out a bit better for my tastes.JSChicago, IL4/19/2021Delicious! I added a little tahini, full lemon juice and it is crunchy, salty and nutty. Bees in the Gardenmidcoast Maine 3/28/2021My favorite kale salad. I prefer to shave the parm with a veg peeler. MJDallas, TX3/28/2021Love this salad - it's on my rotation! Perfect for lunches and versatile AliceToronto, Canada1/19/2021This was good, but I don't know about magical. Definitely is better dressed ahead of time and chilled in the fridge for a while, but the dressing didn't have the bite I was looking for. I may make again and up the mustard a bit, maybe add a dash of apple cider vinegar like someone else mentioned. Love the apple and toasted sunflower seed going on, but I'm the odd man out here and think the brussels would add more flavor roasted. Good base recipe, though, I'll make again and tweak.AbbyT1/6/2021Absolute perfection - we made this for thanksgiving and I made it again just now in an effort to kick into January slimming mode. Great kale salad recipe if you don't consider yourself a kale salad lover.Catherine A.Hoboken, NJ1/5/2021this recipe looks great!  I'm going to try it.  Any information about the nutrients i.e. calcium, etc.?ChristineNew Jersey1/4/2021OMG.  This is totally addictive.  I have made this salad three times in less than 2 weeks.  I can eat 1/3 of the salad at one setting--so good.JoAnnKansas City1/2/2021This recipe changed my life. NicToronto, on12/16/2020Ok this salad was delicious! Made for Thanksgiving and everyone was a huge fan. And was yummy the next day too!!EmilyAtlanta11/27/2020Absolutely delicious. Made with pre-roasted pepitas.  Next time I'll dress just a little bit lighter and throw in more of the apple. Salad sat for several hours chilled before eating and held up well. May make a second time with the rest of the Brussels Sprouts - it's that good.julesMinneapolis 11/27/2020Explore Bon AppétitSaladKaleLeafy GreensVegetableBrussels SproutAppleFruitWinterQuickEasyWeeknight MealsSideGluten-FreeVegetarianRosh HashanahLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Claire Saffitz"]}