{"id": "aada258106d295f7e6a82ca42b664567", "url": "https://www.bonappetit.com/recipe/conchas-de-vainilla", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "Conchas de Vainilla Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesConchas de Vainilla (Vanilla Conchas)By Rick MartinezMarch 10, 20205.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWhen Rick Martinez was a kid growing up in Texas, white conchas—the classic Mexican sweet bread with a shell-shaped sugar topping—were the most boring ones. “Why would you want white when you could have pink or yellow?” he asks. Especially, he says, when they never really tasted like anything. But once Rick tried proper conchas de vanilla from southern Mexico, he understood how flavorful the plain-seeming white concha could be. That experience is what he tried to replicate with this recipe, the key to which lies in the quality of the vanilla. If you can find Mexican paste, beans, or extract, use those. But if you can’t, use paste (we like this one from Heilala), which holds onto its flavor when heated better than extract or beans.IngredientsMakes 12Dough1¼-oz. envelope active dry yeast (about 2¼ tsp.)½cup warm whole milk (about 110°)3large eggs, room temperature6Tbsp. (75 g) granulated sugar2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt3Tbsp. nonfat dry milk powder3cups (375 g) bread flour, plus more for surface10Tbsp. unsalted butter, cut into 10 even pieces, room temperatureTopping and assembly1cup plus 1 Tbsp. (133 g) all-purpose flour⅔cup (73 g) powdered sugar½cup ghee, refined coconut oil, or vegetable shortening, melted and cooled1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1tsp. vanilla paste or extract1large eggPreparationDoughStep 1Whisk yeast and milk in the bowl of a stand mixer to combine. Let sit 10 minutes for yeast to dissolve.Step 2Whisk eggs, granulated sugar, and salt in a small bowl. Add egg mixture, milk powder, and 3 cups bread flour to yeast mixture. Stir with a wooden spoon until a shaggy dough forms. Fit bowl onto stand mixer fitted with dough hook and mix on medium speed until dough comes together but is still slightly tough, about 3 minutes. Increase speed to medium high and beat, adding butter a piece at a time and waiting until absorbed before adding the next piece, until dough is smooth, elastic, and very tacky but pulls away from sides of bowl (dough will look broken as you add the butter, but don’t worry; it will eventually come together), about 15 minutes. This may seem like a long knead time, but it will improve the final texture of the bread.Step 3Cover bowl tightly and chill until doubled in volume, at least 12 hours. Letting dough rise in the fridge for a longer period of time will produce a dough with the best flavor, but if you don’t have the time, cover dough and let rise in a warm (about 80° is ideal), draft-free spot until doubled in volume, 35–50 minutes. The visual cue is more important here than the time. How long your dough takes to proof will depend on how warm your kitchen is. You don’t want to overproof the dough, so check it at 35 minutes. Finished dough will smell buttery and yeasty and have doubled in size. If it is not there, check again in 10 minutes.Step 4Gently deflate dough by pressing it down and folding it over onto itself. Repeat until completely deflated.Step 5Do ahead: Dough can be made 3 days ahead. Keep chilled (do not deflate until ready to form into rolls).Topping and AssemblyStep 6Line 2 baking sheets with parchment paper. Beat flour, powdered sugar, ghee, salt, and vanilla in the bowl of a stand mixer fitted with the paddle attachment until combined and smooth. Divide sugar topping into 12 equal pieces (about 30 g each) and transfer to a plate. Cover loosely and let sit until ready to use.Step 7Turn out dough onto a work surface and divide into 12 equal pieces (about 80 g each). Working one at time, rest a cupped hand over dough so your palm and fingers enclose it and vigorously work your hand in a circular motion on the counter to shape dough into a smooth, round ball (the friction between the dough and the work surface will create tension, stretching dough into a taut dome). Transfer to prepared baking sheets. Arrange 6 balls on each, spacing evenly apart.Step 8Beat egg with 1 Tbsp. water in a small bowl to blend and brush 1 dough ball with egg wash. Using kitchen shears, cut open the sides of a small resealable plastic bag so that it opens up like a book. Place 1 piece of sugar topping on 1 side of open bag and fold other side over to cover. Using a small skillet or saucepan, press down on ball to flatten into a 4\"-diameter disk. Carefully peel open bag and invert disk onto dough ball; fit it to the dough so it covers the top and sides of ball completely without overlaps. Carefully remove bag. Using a rubber spatula, scrape off any topping stuck to bag and repeat process with remaining egg wash, dough balls, and sugar topping. Let conchas rise in a warm, draft-free spot until almost doubled in size, 1½–2 hours (if dough was proofed at room temperature, this may only take 1 hour).Step 9Place a rack in middle of oven; preheat to 325°. Select a starting point on left side of dough, and, using a razor or sharp paring knife, very lightly score half-moon lines into topping so they radiate out across topping, starting from the same point and spacing about ⅓\" apart. You want to be careful not to deflate the dough, so don’t press down and let the weight of the knife do the cutting (you don’t need to cut through the topping).Step 10Place 1 baking sheet of conchas in the fridge and bake the other sheet until dough is golden brown, topping is very lightly darkened, and an instant-read thermometer inserted into the center registers 195°, 20–30 minutes. Let cool 10 minutes on baking sheet, then transfer to a wire rack and let cool completely. Repeat with remaining baking sheet of conchas.Step 11Do ahead: Conchas can be baked 3 days ahead. Store tightly wrapped at room temperature.How would you rate Conchas de Vainilla (Vanilla Conchas)?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWhat motivated me to try this recipe is how much it reminded me of the Chinese Bolo Bao, more commonly known as the pineapple topping bun. The ingredients are almost identical with the exception of sweetened condensed milk in the bolo and the dry milk powder in the conchas. In comparison, vanilla conchas are a lot lighter in flavor and sweetness. However, both the Bolo and the Conchas are equally soft and airy. \n\nThis recipe is so detailed that it is incredible easy to follow. For example, Rick calls out the exact weight of each dough ball to the gram, taking out the guesswork. \n\nModifications made: \n1. The recipe calls for \"melted and cooled shortening\" but to achieve the best play dough-like texture for the raw topping, I recommend keeping the shortening solidified straight out of the refrigerator. I used Crisco All-Vegetable Shortening Baking Sticks. \n2. I doubled the recipe and the buns baked beautifully\n3. The recipe calls for a total chilled proofing time of 12 hours. The buns baked without an issue chilled  for 9 hours. \n4. I used steam to achieve a faster second proof. If you do not have a proofing box, you can make one by using a microwave. I placed 3 quarts of boiled water and transferred it into a loaf pan. I placed six  fully assembled raw buns on a baking sheet with parchment paper. Place both the pan and baking sheet into the microwave and close the microwave door. The objective is to prevent the steam from escaping, therefore, refrain from opening the door until at least twenty minutes have elapsed. I baked the dough when it doubled in size. \n\nLessons learned:\n1. To achieve a vanilla flavor that is more detectable, layer the vanilla with bean scraped from the pod or paste in addition to the liquid extract New York11/4/2020Used vegetable shortening instead of ghee as recommended and the topping kept getting stuck to the bag. Couldn’t get it onto the bun without it coming apart. \n\nAlso not sure why we’re putting the topping on before the dough rises. The topping also has a weird gritty texture and flavour. Not sure what I’m doing wrong :(Anonymous4/30/2020Explore Bon AppétitBreadMexicanLatin AmericanBread FlourFlourVanillaHerbs & SpicesYeastOther IngredientsSnackNut-FreeBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-10", "author": ["Condé Nast", "Rick Martinez"]}