{"id": "aaef0dc5d418e092ade74f755aa53845", "url": "https://www.bonappetit.com/recipe/pad-see-ew", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "Pad See Ew (Thai Stir-Fried Rice Noodles with Chicken) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChicken Pad See EwBy Leela PunyaratabandhuApril 9, 20214.2(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintPad see ew (officially Romanized phat si-io) is one of the most loved one-plate dishes in Thailand, especially Bangkok where it’s a staple at shophouse eateries specializing in Chinese-influenced stir-fried noodles. It may not look like there’s anything to this dish—the ingredient list is short and the cooking method straightforward—but a good plate of pad see ew takes some skills to create. As I explain in my book, Simple Thai Food: Classic Recipes from the Thai Home Kitchen, from which this recipe is adapted, the key is using good-quality fresh rice noodles or rehydrated dried rice noodles with plenty of chew left in them so they don’t turn mushy when cooked quickly in a hot wok, which can involve constantly controlling the heat. The goal is to get the delicate noodles to absorb the seasoning before they get soggy and for the dish to take on the charred aroma associated with wok cooking.Ingredients2 ServingsPickled chiles3long Thai chiles or 6 red Thai chiles, sliced crosswise ¼\" thick2cups distilled white vinegarChile powder2cups dried bird chilesNoodles and assembly1lb. fresh wide rice noodles or 8 oz. dried wide rice noodles12oz. Chinese broccoli or broccoli2Tbsp. vegetable oil2large eggs2large garlic cloves, finely chopped8oz. skinless, boneless chicken thighs or breasts, cut into 1\" pieces3Tbsp. dark sweet soy sauce (preferably Healthy Boy)2Tbsp. thin soy sauce (preferably Healthy Boy)2tsp. distilled white vinegar or apple cider vinegar2tsp. salted soybean paste (preferably Healthy Boy; optional)½tsp. granulated sugar, plus more for servingFreshly ground white pepperFish sauce (for serving)Special equipmentA glass jar with a lidA spice mill or mortar and pestlePreparationPickled chilesStep 1Combine chiles and vinegar in a glass jar, cover tightly, and chill at least 2 day before using.Do ahead: Chiles can be pickled 2 months ahead. Keep chilled.Chile powderStep 2Toast chiles in a dry small skillet over low heat until brittle and slightly darker in color but not browned and blistered, about 4 minutes. Transfer to a plate and let cool. Grind in spice mill or with mortar and pestle to the consistency of coarse cornmeal.Do ahead: Chiles can be ground 6 months ahead. Store airtight in a cool, dry place.Noodles and assemblyStep 3If using dried rice noodles, bring a large pot of water to a boil. Add noodles and stir to separate and prevent sticking, then remove pot from heat. Let noodles sit until cooked through and no hard center remains, 8–10 minutes. Drain in a colander and rinse under cold running water until cool. Drain well again; set aside.Step 4Trim about 1\" off bottom of each broccoli stem. Remove stalks from tops and slice on a diagonal ¼\" thick; set aside. If using chinese broccoli, cut tops into 2\" pieces. If using broccoli, cut into 2\" florets. Set aside, keeping separate from stalks.Step 5Heat oil in a wok or a large nonstick skillet over high until shimmering. Crack eggs into pan; add garlic and cook, stirring, until eggs are almost set. Add broccoli stalks and chicken and cook, tossing often, until chicken is cooked through, about 2 minutes.Step 6Add dark sweet soy sauce, thin soy sauce, vinegar, soy bean paste, ½ tsp. sugar, reserved noodles, and reserved broccoli florets, if using regular broccoli, and cook, stirring, until noodles absorb some of the sauce and are softened, about 1 minute. Continue to cook, undisturbed, until underside starts to brown and more sauce has been absorbed, about 1 minute. Turn noodles over and cook, undisturbed, until underside is browned, about 2 minutes. Add Chinese broccoli, if using, and cook, tossing, until bright green, about 2 minutes.Step 7Divide noodles among plates and season with white pepper. Serve with fish sauce, pickled chiles, chile powder, and more sugar alongside for topping as desired.Reprinted with permission from Simple Thai Food by Leela Punyaratabandhu, copyright (c) 2014. Published by Ten Speed Press, a division of Penguin Random House, Inc. Photography (c) 2014 by Erin Kunkel.\n\nBuy it on Amazon or BookshopHow would you rate Chicken Pad See Ew?Leave a ReviewTell us what you thinkExplore Bon AppétitThaiSoutheast AsianAsianRice NoodleNoodlePasta & NoodlesChicken ThighChickenPoultryWeeknight MealsMainNut-FreeDairy-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-09", "author": ["Condé Nast", "Leela Punyaratabandhu"]}