{"id": "aaf5851bbad3e690c755bee8cfc8e105", "url": "https://www.bonappetit.com/recipe/giant-no-flip-blueberry-pancake", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "No-Flip Blueberry Oven Pancake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGiant No-Flip Blueberry PancakeBy Carla Lalli MusicJuly 14, 20194.8(110)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintWhile we love the concept of making pancakes for a crowd, we don't love the reality of standing over the stove, dishing out pancakes to guests like a short-order cook (and we definitely don't love relegating the early batches of pancakes to the oven, where their texture will surely suffer). And so this crowd-feeding \"oven pancake\" was born: Making one giant pancake instead of a bunch of smaller ones means that everyone will sit down to pancake breakfast at the same time. And because it's no flip, you don't have to worry about your spatula \"skills.\" Use the 10 minutes when the pancake is in the oven to locate your maple syrup and butter and get plates onto the table.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketWhisk$10 At AmazonSmall Bowl$13 At AmazonMedium Bowl$17 At AmazonWooden Spoon$6 At AmazonLarge Skillet$84 At AmazonPlate$55 At Bon Appétit MarketIngredients6 servings1cup all-purpose flour⅓cup cornmeal (not coarse, medium- or fine-grind works)2large eggs¼cup sugar1Tbsp. baking powder½tsp. baking soda2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt1½cups buttermilk, divided4Tbsp. unsalted butter, melted, divided, plus more room temperature for serving1cup fresh blueberries1Tbsp. vegetable oilPure maple syrup (for serving)PreparationStep 1Preheat oven to 375°. Whisk 1 cup all-purpose flour and ⅓ cup cornmeal in a small bowl.Step 2Whisk 2 large eggs, ¼ cup sugar, 1 Tbsp. baking powder, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and ½ tsp. baking soda in a medium bowl until eggs are lightened and smooth, about 30 seconds.Step 3Add ¾ cup buttermilk and half of the dry ingredients and whisk very gently just to barely combine.Step 4Add 2 Tbsp. melted butter, remaining ¾ cup buttermilk, and remaining dry ingredients and whisk just to combine (some lumps are okay). Adding the dry ingredients in two batches, rather than all at once, lessens the risk of over-mixing (which would deflate and toughen the batter).Step 5Using a wooden spoon, fold in 1 cup fresh blueberries. We're using conventional blueberries—the kind you pick up at the grocery store—because they're so easy to find. But if you have access to those teeny-tiny, burst-in-your-mouth wild blueberries (what, are you in Maine or something?), by all means, use those.Step 6Heat 1 Tbsp. vegetable oil and 2 Tbsp. melted butter in a large oven-safe nonstick skillet (make sure it's at least 8 inches in diameter) over medium-high. We're using a combination of oil and butter because butter adds a lot of flavor but has a low smoke point (which means that it burns easily); mixing it with oil raises that smoke point so that we can have the best of both worlds.Step 7When foaming subsides, scrape in batter and use the back of a spoon to gently nudge it all the way to the edges.Step 8Reduce heat to medium and cook, shaking pan back and forth occasionally to ensure pancake will eventually slide out freely, until bubbles appear across surface of pancake, 5–6 minutes (it will still look quite wet and uncooked in the center, but you should see some browning around the outer edge).Step 9Transfer pan to oven and cook until pancake is puffed and set, 10–12 minutes. Invert pancake onto a large plate or platter. Admire the crispy, burnished top—its pock-marked surface contains all of your lacey-edged pancake fantasies.Step 10Cut into wedges and serve with room-temperature butter and maple syrup.How would you rate Giant No-Flip Blueberry Pancake?Leave a ReviewTell us what you thinkReviews (62)Back to TopTriangleI have made this multiple times and always fallow the recipe aa written. It has (more than) fed our small family on a nice relaxing weekend and also fed an entire group of hikers renting a cabin outside of a National Park. I am considering halving it today to feed just hubby and I because I want it but don’t need to waste half. Wish me luck! Marci TNashville, TN3/12/2022I've made this the past two weekends.   Worked perfectly each time...  great texture, perfect blend of savory and sweet, and it came out of the skillet perfectly.  Even my finicky grandson loved it!  It's going to be a permanent fixture every weekend for breakfast.CracarSpringville UT1/27/2022Yummy!! I followed the recipe with a few exceptions…I added lemon zest and since I didn’t have buttermilk a added a couple tablespoons of lemon juice to the milk and let it sit for few minutes. I ended up using frozen wild Maine blueberries. I rinsed them with cool water and patted them dry as much as possible. I then added them on top of the batter after I poured it into the pan. My family and I did not prefer the lemon flavor and will not use lemon zest next time. I will stick with the recipe as is and I prob should have from the start. ;) Great recipe Carla! Super easy and definitely a keeper! Thanks for sharing. <3Maria S.Reading, MA1/1/2022Very good! Made for a Christmas weekend  breakfast for 5 adults but would be enough for 6.\nUsed gluten free flour mix and masa flour. Forgot the buttermilk so used whole milk mixed with 3 tablespoons lemon juice. Cooked in oven for 18 minutes. Will make again and was asked for the recipe. Yum!heatherooWest Suffield, CT12/26/2021I made this with gluten free cup4cup flour and it turned out yummy.  Added a little vanilla per the other reviews and sprinkled powdered sugar on top.  I will definitely make again.  AnonymousInverness, Fl12/12/2021Can I make this in my cast iron?AnonymousAustin, Texas12/10/2021My pancake is cooking now, but the batter, made from recipe-as-written, was not as thick as was shown here.  Any thoughts?jessicaeast hampton, ny12/8/2021SO GOOD.  will make again multiple times, i can feel it. Some lemon zest and a little juice really took it all the way.AmandoBrooklyn, NY7/4/2021This has been my go-to pancake recipe for the last 18 months. I will never flip a pancake again. 🙃 I half the recipe to make for my small family and it always works perfectly. Question for the group: has anyone successfully tried any add-ins that would make it wetter. I am thinking of adding puréed pumpkin and pecans (instead of blueberries) and wonder if it would work? Would I just cook it a bit longer? Test the centre to ensure it’s cooked through?LisMToronto, ON5/9/2021I’ve just tried a savory version of this recipe omitting the sugar and using ramps and fiddleheads for the filling with very satisfactory results. My mind is now going to other combinations and the possibilities are endless-ham and pineapple, spicy sausage and apple, mushroom and gruyere, asparagus and lox just to name a few. In future I would halve the amount of salt. Now I look forward to trying this as written with blueberries or maybe rhubarb. Anonymous5/3/2021Truly one of my favorite pancake recipes! I subbed in1/2 cup whole wheat flour, 1/2 cup AP instead of full cup of AP and added about 1/2 cup extra blueberries- oven time was about 18 minutes for my middle to stop jiggling but turned out delicious! The bottom/crust was perfectly browned but not burnt, even with the extended bake time. The texture that the cornmeal brings to it is so satisfying. Highly recommend making this!Jamie SChicago, IL4/6/2021AMAZING. Changes: brown > white sugar. Added: cinnamon, vanilla, 1/4 extra cup of flour. I'm never going back to flipping individual pancakes. Anna StamborskiMilwaukee, Wi3/24/2021I made this last weekend for my girlfriend and I and it was super easy- I was able to throw it together as she was doing other stuff in the kitchen- a very low stress recipe. \nRe: other reviews, we had the idea to make homemade lemon whipped cream to top it. Any lemon element I think is key for rounding out this wonderful recipe (also don't skimp on the butter on top). \nGoing to make it for Christmas brunch for my family!Molly-Margaret JohnsonNYC11/12/2020Oh, this is sooooo good. Will definitely be making for guests and for just us regularly. Made with frozen blueberries which got a bit soggy, so I'll go for fresh next time. Also, made with Bob's Red Mill Gluten-Free 1-to-1 flour. I needed to cook it a little longer than the 12 minutes (about 14, I think) to fully set. And it was delicious!!!Cathedral City, CA9/19/2020This is the perfect brunch hack.  Fried a pound of bacon and whipped this big guy up, had brunch for 5 in less than an hour. Used White Lily self-rising flour and Alabama fine ground corn meal. Just added the baking soda and salt. Used regular milk too. I was concerned about the bottom (top) burning, so for the last 5 mins, I switched to the broiler heating element (left the rack where it was). It came out perfectly. A little burnished like it says, but not bitter. Texture was prob different than Carla intended because I didn’t  have buttermilk, but it was fantastic nonetheless. SernaramaPaso Robles, CA8/23/2020Explore Bon AppétitPancakeBlueberryBerryFruitCornmealFlourButtermilkOther IngredientsQuickEasyOne-Pot MealsNut-FreeVegetarianBakingBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-14", "author": ["Condé Nast", "Carla Lalli Music"]}