{"id": "aaf550d122c9e1f7e63918fbc39da397", "url": "https://www.bonappetit.com/story/toni-morrison", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "I Remember What Toni Morrison’s House Smelled Like | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Remember What Toni Morrison's House Smelled LikeLike peppers, like onions, like tomatoes, like home.By Sarah Ladipo ManyikaAugust 17, 2021FacebookTwitterEmailToni Morrison at the Grande Hotel et Milan in 1994Photo by Leonardo Cendamo/Getty ImagesFacebookTwitterEmailJollof[jaw-lawf]noun: a West African one-pot dish made with onions, peppers, tomatoes, tomato paste, palm oil, vegetable stock, rice, cooking oil, salt; tastiest when cooked over firewoodverb: to party, make merry, live it up, enjoy, celebrate, bacchanal, celebrate good timesSeptember 6, 2019—District Six, Cape Town“What did Toni Morrison’s house smell like?”The question comes from someone in the audience who has followed me after the plenary session of the Open Book Festival. I had just been on stage along with a few fellow contributors to New Daughters of Africa: An International Anthology of Writing by Women of African Descent. Our panel represented the rich diversity of the landmark anthology—a spicy mix of writers of different literary genres, generations, and nationalities, brought together in a place with its own complicated racial history. On the panel, I had spoken about Toni Morrison. Now, standing in the foyer of the District Six Museum, surrounded by festival attendees, this question surprises and delights me.April 15, 2017—Grand View-on-Hudson, Rockland County, New YorkNadine, Toni Morrison’s housekeeper, opens the door and lets us in. Morrison is not yet ready to receive us, so we wait upstairs in the living room, where Morrison has said, “make yourselves at home.” Nadine is in the kitchen chopping vegetables. Soon, there’s a loud sizzle and I catch the sharp bite of onion and peppers, turning sweet as they fry. I can smell tomato in there, too. It smells like home, like jollof. Back in Nigeria, we used to eat jollof on Sundays, after church services, and when celebrating Eid with friends at the end of Ramadan. The best part, if you could get to it, were the crackly bits of rice stuck to the bottom of the pan. Jollof is both everyday and party food, but no celebration is complete without it and when served with fried plantains, it’s heaven. “Fish,” says Nadine, when I walk over to ask what she’s preparing. “Something healthy for Mrs. Morrison,” she adds, her words lightly seasoned with the flavor of Jamaica.The aroma has me thinking about the one-pot dishes Morrison writes about in her works—a pot of turnips or maws—often simple, meager meals to stave off hunger or to soothe. And fish . . . I remember the “crisp sea bass” with its “tiny flakes of white” in Miss Marie’s daydreaming of a meal shared with a past love. I remember the precious piece of eel that ferryman Stamp Paid feeds Sethe in her escape from slavery. And what jollofing on the page when Morrison uses food in the naming of her characters—Plum, Meringue Pie, Sweetness, Chicken and Pie, and Milkman—or in describing skin tones from cream to licorice, lemonade, milk, and whey. And there is something about berries—the temptation of them, as in a deep-dish berry cobbler, toppled by inquisitively hungry children, or those other berries that “tasted like church”—“just one of those berries and you felt anointed”—delivered to one who is so close to being free of her slave masters. And when Morrison uses food as metaphor for sex, she’s at her tantalizing best. From the sexual suggestiveness in the eating of an ear of corn: “How loose the silk. How fine and loose and free,” to a woman’s naked body “moist and crumbly as unbleached sugar,” Morrison’s word work is sublime. Every mention of food hints at a longing that simmers just beneath the surface.Nadine cuts short my reverie; Mrs. Morrison is now ready. As we walk downstairs to her study, the smell of lunch accompanies us. She says to call her Toni, and in turn she calls us her friends, which feels so warm and delicious.It’s Easter Saturday, and Toni’s friends and family drop by unannounced, just as I remembered it from my childhood. No invitations, but you never arrived empty-handed. We would take cakes, fruits, or vegetables when visiting. “Whadya bring me?” Toni teases her son, Ford, who is the first to arrive. “A sam-wich?” she asks. Not a sandwich, he says, but books. Something to satisfy a different hunger. Toni’s neighbor Ned is the next to arrive, bearing an eye-popping floral arrangement as large as his hug. After an exchange of pleasantries, Toni asks Ned if he might bring her some food from his brother’s restaurant.“Seafood? You want seafood with pasta?” Ned is happy to oblige.“Yes!” says Toni.“Okay. Some pasta, some seafood?”“Yes, yes, yes!” Toni enthuses.“And a little dessert?”“Yes!”“Just for one? You’re not having a dinner party, are you?” Ned checks.And here is where I join in, playfully suggesting that we stay for dinner. I tell her I had planned on bringing a chocolate cake. “Hey!” says Toni with excitement at the mention of cake. “Whadya-do!” she adds, feigning indignation, when I confess to only having brought chocolates.August 6, 2019—Peckham, LondonOn the day Toni Morrison dies, I am in London. When I hear the news, I immediately set out on a walk, looking for a quiet place to process the shock. I find a church and sit outside on an empty bench. At the foot of the bench, I see a slice of fried plantain. Two days earlier, friends and I had shared jollof rice and plantain from a nearby Nigerian takeout, I Go Chop. Perhaps the plantain came from there and here it lies like an offering—a libation for the ancestors. I close my eyes and return to that afternoon when we had jollofed at Toni’s house, which had smelled, quite simply, of home.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-17", "author": ["Condé Nast", "Sarah Ladipo Manyika"]}