{"id": "aafc22114c3f7a2bc187d26b3a952d3a", "url": "https://www.bonappetit.com/story/tips-for-stay-in-date-night", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "The Fork Goes on the Left: 12 Tips for Stay-In Date Night Greatness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Fork Goes on the Left: 12 Tips for Stay-In Date Night GreatnessThe right snack. The right cocktail. Embracing mistakes. And having a damn good time. Everything you need to know to have a date night at home that's better than any meal out.By Alex DelanyFebruary 12, 2018FacebookTwitterEmailGentl & HyersFacebookTwitterEmailWhoa. It’s the fifth date. With that person that you, like, really like. You already took them to your favorite dive bar, strolled through an unfamiliar part of town, spent too much money on movie theater snacks, and ate at that cool new restaurant in that neighborhood you can't afford to live in. Which can mean only one thing: It’s time to cook for your potential life partner at home. It’s date night. At your place. Things are about to get real.Don't freak! We got you. Follow these tips for hosting a fun, impressive-but-not-too-impressive date night at home and you're as good as gold. And if this happens to be your 427th date, not your fifth, you should read this too. Because we could all do better, couldn't we? Here's what you need to know.Please, Clean UpNo, I’m not your mom, but yeah, I am asking you to clean up your space. I'm not saying you have to Marie Kondo your whole apartment, but you should wipe down all the surfaces in your bathroom, tidy up wherever you're going to be eating, and maybe even clean your fridge so that when you ask your date to grab that chilled bottle of wine their first thought is \"adult\" and not \"dumpster behind the dining hall.\" And definitely take out the garbage. You know what people are attracted to? Places that don’t smell like garbage.Food First, AlwaysYou should have something out or almost finished when your date arrives. Think about what would make you happier: Hearing someone say, “There will be something for you to eat in 20 minutes,” or, “Here is a very delicious snack for you to eat right now, and wow, you are super cute. Can’t wait to spend the evening talking, laughing, and exploring all of our common interests.” Yeah, the second one sounds better to me too.Photo by Heidi's Bridge, styling by Molly BazWhat’s That Snack Though?Your first course should involve a little more effort than opening a tub of hummus. Which doesn't mean that you have to make pâté from scratch, but it should feel like there is some intention behind it. Warm, marinated olives with feta? Perfect. A nicely-arranged but affordable charcuterie plate? Sign me up. Cold, crisp crudités with homemade Greek yogurt dip. Now you're talking! Whatever you serve should be snack-able and easy to eat with your hands, and ideally won't require separate plates or sitting down because you’re about to start cooking.Have a Drink on Deck (If That’s Your Thing)If alcohol is in the cards, have something you know you'll both like to drink ready to go. Chilled bubbly wine is never a bad idea, but mixing a dead-simple cocktail like a negroni or a boulevardier is a strong move as well. And by \"simple\" I mean siiiiiiimple—as in, you should be able to make it without looking at a recipe on your phone. If you do go the cocktail route, keep it to one per person and follow it up with some easy-drinking wine or beer to go along with the meal. Pick something you can talk about, like a tart, bready, barrel-aged saison, a dry, funky Basque cider, or a juicy, gulp-able bottle of Beaujolais (French for berries and sunshine, probably). Just make sure it's low enough alcohol that you don't accidentally get nervous-drunk and that you have another bottle to linger over, just in case.Pump the JamsIt’s nice to have silence during a tennis match or your mad dash to watch all those nominated films before the Oscars. But during date night? No, absolutely not. You should be talking and vibe-ing and cooking alongside perfectly-curated tunes. No jumping up to change the song or asking your date to chose the next track, just a playlist that you can play all the way through. Oh. You need such a playlist? We got you. This should work. Or this. Or this.TeamworkCooking together builds chemistry. It shows that you’re willing to let the other person into your zone, that you can work as a team, and you can both enjoy the benefits. (Kitchen Control Freak is not a cute look, no matter how good you think you are.) Plus, it lifts a little stress from your shoulders. Just make sure that you've got a plan, and that you're calling the shots; this is still your show. Ask your date to chop herbs, mix a vinaigrette, or dress a salad. Then, eight years down the line, you can be like, “OMG, babe, remember that time we made that salad together?” as a way of diffusing the argument you're having about whose family you're spending Thanksgiving with this year.You don't really need all this stuff. Just remember: Fork on the left. Knife, spoon, and glass on the right.\nPhoto courtesy of Image SourceSet the Table (For Real)It doesn’t matter what kind of table you’re setting: Whether it’s the kitchen counter, the coffee table, or the ping pong table your roommate convinced you was a suitable replacement for your kitchen table, it should be set properly. Plate, water glass, wine/beer/cocktail glass, napkin, fork, knife, and (maybe) spoon all laid out. (Don’t set the tables with utensils you won’t use, natch.) This is a little thing that shows you’re a human being that cares about stuff from time to time. Psst. The fork goes on the left, and the glass and knife go with the spoon on the right, because the spoon was lonely.When it Comes to Food, Keep it EasyTonight is not the night to make lasagna with homemade noodles. Or learn how to make soup dumplings by hand. The meal you make should be both delicious and attainable, something that you can cook confidently while also carrying on a conversation. A crispy pork chop with a simple endive salad is the archetype—an impressive but manageable cut of meat paired with an “Oh, this? I just threw it together. No big deal,” kind of salad. No recreating chef-y dishes or throwing in fancy ingredients just so you can say their names—remember, you're not at a restaurant for a reason.This Isn’t an Eating MarathonSnacks. Main Course. Dessert. You should impress your date with the tasty food (and the ease at which you pulled it off), not a ridiculous quantity. It’s a three-course meal, with an extra seven courses of vibes. Whatever you serve should leave you feeling good for...whatever you get into after dinner. Like, you know...bowling. Or whatever.Dessert Should be Simple and IndulgentBut not before dessert. This is a wide field. I understand, but it gets significantly more narrow when I tell you that dessert should be both warm and quickly assembled. A chocolate Dutch baby is perfect, as is a fruit cobbler or some berry bars with ice cream. Hell, you could even pull some of that defrosted pinwheel cookie dough you have in the fridge, slice a dozen up, and throw them in the oven. Whatever you serve, make sure it inspires something along the lines of, “Ohhh. Wow. I am feeling all kinds of emotions.”Embrace Your MistakesIt’s fine. You’re fine. Nobody's perfect, not even me, the person writing this article, telling you what to do. I’ve messed up dinner plenty of times, and it’s always ended better when I just rolled with it instead of stressing. You're not on a cooking reality show right now—you're having fun. And being the kind of person who flies into a rage or over-apologizes when something doesn't go exactly how you planned isn't exactly the look you're going for, is it? If you drop those perfectly-cooked pork chops on the floor right before dinner, you can always order pizza.Remember What’s Really ImportantAt the end of the day, this date isn’t about the food. It's about warmly welcoming someone into your home and cooking dinner for them. It’s about the fact that you liked them enough to do that. That person isn’t at your place because they’re expecting the best meal of their life; they're there because they like you. The meal, the music, and the little extra efforts only add to your already extraordinary appeal.Looking for some menu inspo? We've got you:How to Cook a Valentine's Day Dinner That Shows You Care, but Not Like in a Really Over-the-Top WayOur step-by-step guide to making a three-course meal that might get you off Tinder for good.View RecipeExplore Bon AppétitBasicallyValentines DayDateMenusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-12", "author": ["Condé Nast", "Alex Delany"]}