{"id": "aafdab40b05b32fed331519e6d643a93", "url": "https://www.bonappetit.com/recipe/masala-fried-chicken", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Masala Fried Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2020 IssueMasala Fried ChickenBy Chintan PandyaJanuary 20, 20204.6(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintThe vibrant flavor and color of this spicy, finger-licking-good fried chicken comes from an abundance of ground dried spices, so be sure to use the freshest ones you can find. If a jar has been sitting in your cabinet for more than six months, it’s probably time to re-up. Trust us, it’ll make all the difference in the world. This recipe is from Chintan Pandya, executive chef of Adda in New York.Ingredients4–6 servingsMarinade13\" piece ginger, peeled, coarsely chopped4garlic cloves¼cup distilled white vinegar¾cup whole-milk Greek yogurt¼cup Kashmiri red chili powder1Tbsp. garam masala2½tsp. kosher salt1tsp. ground turmeric2lb. skinless, boneless chicken thighs (about 10), cut into 1\" stripsFrying and Assembly3Tbsp. Kashmiri red chili powder1Tbsp. chaat masala2½tsp. amchur powder1½tsp. freshly ground black pepperCanola oil (for frying; about 8 cups)2¼cups potato starch1¼cup all-purpose flourSpecial EquipmentA deep-fry thermometerPreparationMarinadeStep 1Blend ginger, garlic, vinegar, and ¼ cup water in a blender on high speed until very smooth. Transfer purée to a large bowl. Whisk in yogurt, chili powder, garam masala, salt, and turmeric until well combined.Step 2Add chicken to marinade and mix well to completely coat. Cover and chill at least 4 hours or (preferably) overnight.Frying and AssemblyStep 3Mix chili powder, chaat masala, amchur powder, and pepper with your hands in a small bowl to thoroughly combine. Set spice mixture aside.Step 4Pour oil into a large pot fitted with deep-fry thermometer to a depth of 3\". Heat over medium until thermometer registers 375°.Step 5Whisk potato starch and flour in a large bowl. Using tongs and working in batches if needed, transfer chicken from marinade to flour dredge and toss well to coat. Fry chicken, turning occasionally, until lightly golden brown and crisp, about 5 minutes. Using a slotted spoon, transfer chicken to a wire rack set in a rimmed baking sheet.Step 6Transfer fried chicken to a large bowl. Generously sprinkle reserved spice mixture over, tossing constantly, until well coated.Step 7Transfer to a platter and serve.How would you rate Masala Fried Chicken?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleThis looks amazing, we are super excited to try this!Moji MasalaNew York, NY2/8/2021The best! I simply have never had better fried chicken and I consider myself a fried chicken connoisseur.  Loved the spice, divine.  brushjlsolon, oh1/23/2021Amaze. Start to end. The marinade itself is so delicious and aromatic and spicy. I fried it without potato starch and it came out just fine. Will be making oftennyancatIndia6/20/2020Substitution help: During a pandemic, you work with what you have, I hope this helps you too:\nChaat Masala substitute: combine cumin, coriander finely crushed with sandwich bag and rolling pin.  Ajwain,  I used zaatar, Hing I used onion powder, amchur I used Lemon pepper which gave me the salt and black pepper I also needed.  \nKashmiri substitute: 3 parts paprika 1 part cayenne but we like it spicy so we did half and half.  \nOf course, you taste everything as you go.  It all tastes like a taquitos chips.  My husband loved it.STEFHANNARChicago4/16/2020Made this the other night and it was delicious! One comment though, if you fry in smaller batches (about 3-4 pieces at a time) then the amount of dredge is completely excessive as I ended up throwing out at leave 3-4 cups of it.AnonymousDurham, NC3/29/2020Ohh, we love ADDA and Chicken Masala ( and Fried Chicken, of course). Super excited to make this super delicious recipe this weekend!Moji MasalaNew York, NY3/12/2020This recipe had BOMB flavor! I actually used bone-in chicken, which just makes the cooking time a bit longer, but I found this recipe easier than expected to execute. I was able to find the spices at my local Indian grocery store, and I was surprised the Kashmiri chili powder I used did taste pretty spicy on it's own, so I backed off a bit from what the recipe recommended, however when these were finished, they were the perfect level of spice for me personally. The amchur and yogurt gives a nice tang to balance out the flavors. I don't think this recipe is suitable for baking (to the below poster) because the batter is far too thick for it to crisp up in the oven. AnonymousClevealnd, Ohio3/3/2020Definitely will do this recipe next weekend. But wondering...Why not mix the amchur, chaat masla, chili and pepper directly into the flour mixture?1/28/2020Would be nice to know how long to bake the chicken in the oven....AnonymousVienna1/27/2020Explore Bon AppétitFried ChickenIndianSouth AsianAsianChicken ThighChickenPoultryMainNut-FreeDeep-fryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-20", "author": ["Condé Nast", "Chintan Pandya"]}