{"id": "aafdbf277129cc60195f75499d2118e5", "url": "https://www.bonappetit.com/story/best-sous-vide-machine-chefsteps-joule", "year": 2021.0, "month": 4.0, "day": 5.0, "content": "The Breville Joule Sous Vide Is The Best Sous Vide Machine on the Market | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Joule Is the Best Sous Vide Machine We’ve Ever UsedIf you’re into science-y food stuff, you need this.By Brad LeoneApril 30, 2021FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I went through a phase where I was cooking everything sous vide. That’s not an exaggeration. Everything. Pork belly. Chicken breast. Beef short ribs. Salmon fillets. I couldn’t be stopped! Sous vide cooking scratched the same itch as home-brewing, baking sourdough, and pickling chile peppers—all that science-y food stuff that I love. And what made it all possible was the best sous vide machine in the game, the Breville Joule Sous Vide.Breville Joule Sous Vide Machine$250 $160 at AmazonHow does it work?The Joule is a slim cylinder about the size of a relay baton. Lower it into a pot of water, and the Joule will heat that water to a specified temperature and hold it there indefinitely. Whatever is hanging out in that precisely heated water—a bag of halibut steaks, eggs, potatoes, you name it—will cook at that exact temperature but never past it.Ever worry about slicing into that expensive cut of meat you purchased for a dinner party, only to find it dry and well-done? With sous vide, that’ll never happen. Instead of subjecting a thick-cut rib eye to the uneven heat of open flame, you’re gently babying it in a bath of warm water, which means it will never overcook. Concerned that without the browning brought on by high heat your steak won’t taste like a steak? Not an issue. After I sous vide my protein, I quickly sear it on a griddle or in a cast-iron pan. Like this pork belly:Instagram contentThis content can also be viewed on the site it originates from.Why is the Breville Joule the best sous vide machine in my book?I’ve used a few sous vide machines in my day, and none are quite as good as the Joule. First off, the price point is great. Sure, there are cheaper options, but a couple hundred bucks is actually a hell of a deal for a piece of equipment this advanced.And when I say advanced, I mean there’s truly some next-level tech going on here. There aren’t any analog controls, which I was kind of hesitant about at first. You control the Joule completely through Bluetooth using an app on your phone, which also gives you cooking temperatures and guidelines for doneness. Technology—so crazy, right? But it’s easy to control and not at all confusing. I mean, this guy figured it out.Start your steak in the sous vide machine and finish it in the cast iron.\nPhoto by Peden + MunkThere are also a ton of physical attributes that make the Joule a superior sous vide machine. Because there are no buttons or screens or other interfaces, the Joule is small. Like, throw-it-in-your-drawer-and-forget-about-it small. A lot of Joule’s competitors are clunky and bulky, and do you really want to have to clear off shelf space for a new piece of kitchen equipment? The Joule is also totally waterproof (some sous vide machines aren’t, which is stupid) and has a magnetic bottom, so it sticks right to the bottom of your metal pot. With most other sous vide cookers, you have to attach them to the side of the pot with a clamp. One more thing to lose.But more important, the Joule heats a pot of water—even a big one—quickly, and it keeps the temperature consistent. That’s what you need from a sous vide machine.So, set it and forget it?Clearly, I like to spend time in the kitchen, but I got other things going on too. I’m a man of many interests. With the Breville Joule Sous Vide, I just plug it in, drop it into a pot of water along with a bagged pork chop, and get on with my life. The app does all the monitoring for me. You don’t even need to be in the kitchen. As long as there’s an outlet, you can sous vide on a bookshelf, on your desk, on your nightstand. Hell, you can cook in the bathroom, if that’s your thing.Instead of boiling them, sous vide the spuds in this chorizo and potato salad.\nPhoto by Alex LauWhat about the bags?Any sturdy freezer bag will do the trick (don’t forget to pop in some aromatics to infuse your protein with flavor), just be sure to squeeze out as much air as possible before sealing it up. While a vacuum sealer isn’t completely necessary, let me say for the record that it will give you the best results. I’m partial to the FoodSaver Vacuum Sealer. Your vacuum-sealed food will keep in the fridge for about a month once cooked. Just bring it to room temp and give it a sear when you’re ready to serve.FoodSaver FM2435 Vacuum Sealer$140 $100 at AmazonThe Breville Joule Sous Vide is an impressive tool for anyone who likes perfectly cooked food (everyone) or is curious about exploring a new way to cook proteins or vegetables in the kitchen. And I wasn’t kidding when I said you can make just about anything (sous vide potatoes are great in potato salad; ditto shrimp for shrimp cocktail) with the Joule.Well, almost anything. Don’t go making an apple pie in there. I’m not going to come over and clean up that mess for you.Breville Joule Sous Vide Machine$250 $160 at AmazonYour Sous Vide EssentialsFind out what even is sous vide, anyway?See how to sous vide anything with step-by-step photos hereRead about how sous vide cooking will overhaul your meal prep gameGet the RecipesSous Vide Salmon with Lemon and DillSit back and let the sous vide do the work—this salmon will come out perfectly tender, never dry.View RecipeSous Vide Chicken with PestoSous vide chicken has the silky texture of poached, and you can throw it on anything—tacos, salad, soups, sandwiches.View RecipeSimple Sous Vide SteakThe sous vide steak is great for parties since you can cook the steak to the ideal temperature (way) ahead of time and quickly sear it before serving.View RecipeSous Vide Sweet and Spicy Pork BellyAdd honey, soy sauce, and sambal oelek to your bag of pork belly and watch sous vide magic happen.View RecipeEditor’s note: This article was originally published July 16, 2018.Explore Bon AppétitGift GuidesToolsTechnologyHoliday GiftsSous VideShoppingBA RecommendsStaff PicksAmazon Prime DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-11-20", "author": ["Condé Nast", "Brad Leone"]}