{"id": "ab06d52cb006a3d239361705fc659288", "url": "https://www.bonappetit.com/story/salt-cave-review", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "Visiting a Salt Cave Eased My Anxiety, Boosted My Energy, and Generally Made Life Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleVisiting a Salt Cave Eased My Anxiety, Boosted My Energy, and Generally Made Life BetterThis holistic treatment is said to detoxify, improve your skin, fight allergies, and totally zen you out.By Sunny MontefioreFebruary 26, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI’ve got a pocketful of mindfulness apps. I once meditated my way towards a healthier relationship with food. I’ve taken more yoga classes than a Santa Monica juice shop owner. Still, “serenity” is a word that exists only in the dictionary for me.Which is why, when my friend Scarlett and I ended up at a place called Tranquility Salt Cave on a recent trip to Columbus, Ohio, I didn’t expect much. As I slipped off my shoes and got ready for my 45-minute session, I did a quick Google search on my phone to determine what the hell, exactly, I was doing.Halotherapy, or salt therapy, is based on the theory that dry salt particles can help with breathing issues, allergies, skin conditions, stress, and more because of their natural anti-inflammatory properties. Natural salt caves date back to Medieval times in Europe, and they’ve regained popularity there since the 1980s. More recently, man-made caves are appearing Stateside. As a 2017 article on the topic in The New York Times put it, “Salt spas seem to be sprouting in pockets of the United States that attract the rich,” but you can now find them in cities ranging from Asheville, North Carolina to Denver, Colorado. In these caves, the walls are made of, or at least covered with, Himalayan salt; the floors are topped with a generous layer of more salt, and there’s even something called a halogenerator, which turns salt into a dry aerosol spray intended to imitate the conditions of a natural cave.Well, it appears this won’t kill me, I thought, so off came my shoes (remember, the floor is covered in salt) and on came my blanket as I settled into my zero-gravity chair (basically a minimalist recliner). There were only two others in the room, a cozily lit space with blankets perched on each chair (to increase your relaxation, guests are invited to throw a blanket over themselves). The attendant closes the door, and you’re left to relax in silence while the salt does its magic.Nearly an hour later, I emerged ecstatic. Oddly, I felt a palpable rearrangement in my body’s spiritual energy—chakras, if you will—and my brain felt wiped of tension. This sharpness of focus and relaxed state lasted for about two days, conveniently long enough to allow me to float through traffic sans anxiety on my return to NYC. Also, I’ve always suffered from constantly having to clear my throat, and allergists have done nothing other than give me a vague diagnosis and a nasal spray. After leaving the salt cave, I noticed that my throat tickle had vanished. The effect was more powerful than the $500 humidifier I’d tried.The scene at Breathe Salt Rooms in NYC\nPhoto by Alex LauI asked neuroscientist and holistic wellness expert Leigh Winters to explain why my lungs felt so good. “It’s possible that inhaling small salt particles in these rooms actually draws water into the lung airways, which thins mucus and makes it easier to cough up,” she told me. She pointed to studies showing that children with asthma who underwent halotherapy saw significant improvement in their bronchial spasms, and similarly, those with chronic bronchial conditions benefited from halotherapy with an anti-inflammatory reaction that helped alleviate their symptoms.“There is some preliminary evidence that halotherapy may ease symptoms of COPD (Chronic obstructive pulmonary disease) and other respiratory ailments, like asthma, but there is great need for higher quality studies in order to deduce the true effectiveness of the therapy,” Winters said. “While it seems like a nice idea, salt caves are not a magical cure-all.”At the very least, salt caves provide the therapeutic benefits of unplugging and recharging. \"Visiting a salt cave can be tacked onto any self-care routine,\" said Winters. \"It's an ideal venue for relaxing and engaging in contemplative practices, like meditation and yoga.”Back home in New York City, I decided to venture to Breathe Salt Rooms to make sure my first experience wasn’t a fluke. As soon as I entered the treatment room, I felt the orange-and-purple glow coax me into a state of transcendental consciousness. With the same reclining chairs, blankets and salt-covered floor as Columbus, the setup and vibe was essentially the same, plus or minus a few mood lighting fixtures.  Again, all my senses were clearer when I left. As I walked along 5th Avenue by Central Park West, storefronts popped in the fading daylight of a winter afternoon. I fell asleep at 9:30 p.m. and woke up before my alarm clock for the first time I can remember in a long while.It turns out, halotherapy can make even the most high-strung of us relax. “We are constantly surrounded by electronic devices that produce positive ions and make us all a little positively charged and on edge. Negative ions produced by the heated salt produce negative ions which counterbalance the positively charged ions helping us relax and heal,” said Marta Dulaba, the regional manager of Breathe Salt Rooms. And according to Zinia Thomas, M.D., Chief Healing Officer, Radiance Float + Wellness in St.Louis, “salt can trigger a chemical reaction that boosts serotonin levels which produces relaxing, uplifting effects.”  (Think about how you feel after a dip in the ocean or simply breathing the air at the beach; that’s salt at work, too.)Chilling in a salt room may also improve your complexion and overall skin. “Skin conditions such as acne, eczema, and psoriasis can be calmed and hydrated with halotherapy,” said Dr. Thomas. “It also helps balance the pH of the skin which prevents overgrowth of bacteria,” said Dulaba.A single session at Breathe only runs about $35 (you can buy a monthly unlimited pass for as little as $135), which is about what you’ll pay for a yoga class in NYC. I won’t ever be that enlightened Santa Monica juice shop owner, but thanks to a few more salt cave sessions, I’m already feeling more balanced.Explore Bon AppétitHealthyishSaltTrendsRead MoreWhere to eatI Took a Sound Bath in the Desert and It Was Only Sort of AbsurdBy Marian BullRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "Sunny Montefiore"]}