{"id": "ab132f4ec6d31427b3b5615bf3e58078", "url": "https://www.bonappetit.com/story/never-fail-kinda-healthy-pasta", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "The Kinda-Healthy Kale Pasta I Can Always Count On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Kinda-Healthy Kale Pasta I Can Always Count OnYou can't go wrong with spaghetti tossed with olive oil, plenty of parm, and more than a pound of kale.By Elyse InamineJune 7, 2019FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.At this point in my adult life, my body tells me, often, how it’s doing. Headache in the morning: Drink more water! Yoga struggles: You’re not 25 anymore! A perpetually sore lower back: No more cute mules for you! And after a whirlwind trip to Asia, eating my weight in Korean barbecue in Seoul and roast goose in Hong Kong, my body is telling me one thing loud and clear: Eat some vegetables!But my brain is saying something else: I. Want. Pasta. Thick and toothsome strands made from wheat, completely unlike the thinner, chewier rice ones I ate all over Asia—and under a mound of parm, please. Also, who isn’t craving pasta all the time? Thankfully, there is a solution that pleases both my brain and my overall health: Carla Lalli Music’s spaghetti aglio e oil with lots of kale.I am by no means a nutritionist, but if there’s about a pound and a half of kale in this pasta, then it’s just as healthy as eating a salad, right? But twirling up forkfuls of this verdant aglio e olio into my mouth is so much more enjoyable than poking at a kale salad. It’s literally lip-smacking. The spaghetti is saturated in olive oil, which pulls in the red pepper flakes, caramelized flecks of garlic, and tiny parm curls into every bite. The kale, blanched until bright green, is soft and supple, absorbing all that spicy, cheesy, olive oil-y goodness. And did I mention it’s a breeze to pull together when you’re brain is still jet-lagged and you’re craving a light dinner at 5 a.m.?All you need to do tear up a lot of kale into large shards and boil it for a couple minutes in salted water (and later on, the pasta, too, so don’t throw it out!). Smash some garlic cloves and brown them in a good amount of olive oil, some salt, and pepper in a Dutch oven while you cook the pasta until just shy of al dente. Gingerly transfer the pasta to the Dutch oven, along with some pasta water, and toss with the kale until a beautiful, glossy sauce suddenly appears. Then, hurriedly throw the kale-strewn pasta into a bowl, microplane some parm, and sprinkle in some flaky salt, more pepper, and a bit of red pepper flakes—and slurp, slurp, slurp. This dish is the one thing I’ve looked forward to since I got back from my vacation, not so much all the soreness after trying to work out again and refusing to relinquish my beloved mules.My body may not be happy with all of my choices, but it certainly is with this one.Get the recipe:Spaghetti Aglio e Olio with Lots of KaleYou will think this pasta recipe calls for an absurd amount of kale, but it will shrink a ton when cooked.View RecipeExplore Bon AppétitNever FailPastaBasicallyKaleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-07", "author": ["Condé Nast", "Elyse Inamine"]}