{"id": "ab174e81e37de5582fb4cf05287a5c94", "url": "https://www.bonappetit.com/story/nina-compton-new-orleans", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "Nina Compton's New Orleans Travel Guide | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatNina Compton’s Guide to New OrleansThe chef’s cross-city crawl, with stops for po’boys, drinks, and dancingBy Nina Compton, as told to Chelsea BrastedJuly 14, 2021FacebookTwitterEmailPhoto by Denny CulbertFacebookTwitterEmailIf you’re going out with Nina Compton, the chef and owner of Compère Lapin and Bywater American Bistro, we have some advice: Bring your dancing shoes. The Frenchmen Street bars are the last stop on her freewheeling guide to NOLA, but before all that, she’s got recs for solid po’boys, cocktails, and museums and parks for a little breather. This is how she shows friends around her chosen city, and now you’re getting the full introduction.Check out more food-focused itineraries from our favorite food people here.Inside Paladar 511Photo by Denny CulbertCocktail in hand at Cane & TablePhoto by Denny CulbertNew OrleansIf you’ve got just a single day in New Orleans, you have two challenges: deciding which corner of the city to get lost in and pacing yourself between each delicious stop. Tackle both with my guide.I don’t usually eat big breakfasts, but I’ll make an exception at the Orange Couch. I love to kick-start my morning there with coffee and whatever pastry catches my eye.From there, head over to The National WW II Museum for a grounding education in global history. There’s never enough time to see everything, so choose any exhibition and dive into the details.For lunch, we’re zipping over to Parkway Bakery & Tavern in Mid City for po’boys (the restaurant calls them poor boys). I love a good po’boy, and nobody does it like we do in New Orleans. I’m always craving roast beef, catfish, or oyster, but no matter what, I ask for it dressed. Around here, that means with mayo, lettuce, and tomatoes.Then it’s back downtown to walk it all off at Crescent Park for unparalleled views of the Mississippi River before stopping at Bacchanal for a bottle of wine. If you’re lucky, Raphaël Bas is onstage cranking out cheerful tunes from his electric guitar.For dinner, it’s gotta be Paladar 511. Anyone who knows me knows I love Italian food, and everything here is fresh and flavorful. Order the pizzas, but don’t skip the squid ink pasta or the agnolotti.After dinner, grab drinks at Cane & Table. Trust the bartenders’ recommendations, or try mine: the Jamaica Queens, scented with cardamom that reminds me of home on St. Lucia.We’ll follow our ears into the late night, dancing at any of the Frenchmen Street bars with their doors flung open, before landing at Dat Dog, exhausted, happy—and hungry. It’s open late, and the hot dogs are perfect to soak up the night.WHERE TO STAY:The Old No. 77, a funky hotel in the center of thingsWHAT TO BRING BACK: Le Grand Coq Rouge beans from French Truck CoffeeExplore Bon AppétitRestaurantsTravelNew OrleansRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Nina Compton", "As Told To Chelsea Brasted"]}