{"id": "ab18fc6457361b741660c7df8a7683ef", "url": "https://www.bonappetit.com/story/how-to-swap-whole-spices-for-ground", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "How to Use Ground Spices Instead of Whole Spices  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan You Use Ground Spices When a Recipe Calls for Whole?Or is swapping sacrilegious?By Sarah JampelMay 21, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.So you’re making Sohla El-Waylly's Paneer With Burst Cherry Tomato Sauce (you've made an excellent choice!), but you've noticed that the recipe calls for whole coriander, cumin, and black mustard seeds. Well, drat! All you've got is the ground stuff. What's a hungry, spice-loving person to do?Spot those coriander seeds!\nPhoto and Food Styling by Sohla El-Waylly First, you're not alone. It's common to find yourself in this conundrum! Often, you'll see that a recipe calls for whole spices—usually to be toasted and crushed, crushed and bloomed, or perhaps added straight to a stock/soup/braise/stew/cooking liquid. But, for sake of convenience and to consolidate your spice cabinet, many of us only have the powdery counterparts. Don't lose hope. In general, it's better to use the ground spice than no spice at all. (You know that expression \"don't let the perfect be the enemy of the good\"? That applies here.) And yet... there are few things to keep in mind when you're going with ground. Let's review the dos and don'ts:DOCut the volume by 25% (so 3/4 tsp. ground coriander for every 1 tsp. whole). Why? Ground spices—at least when they're fresh and high-quality—have a more concentrated and immediate taste than whole because all of their flavor compounds have been brought to the surface, ready to hit your taste buds. This means that they're often more potent, and so you'll want to compensate by holding a little back.Remember that ground spices will change the color of the finished dish—no biggie for lentil soup but not ideal for clear chicken stock.DON’TAdd ground spices straight to a liquid, like a stock or braise, without blooming or toasting them first. Otherwise, their flavor might be muted and raw.Go with ground when the spice is intended to be a subtle infusion.  Think of chile crisp, which is infused with a warmth from a couple of cinnamon sticks, or a pot of basmati rice that's steamed with whole cloves and cardamom pods. In both of these cases, the spices offer a sweet aroma without imparting any color or bitterness. Ground spices won’t achieve the same effect. If you want to use them, start with just a tiny bit—it's easy to add more but impossible to take it back.Use ground where the texture of whole or crushed is imperative, as in a spiced oil, seeded flatbread, or crunchy dry rub.Now that we've got the ground rules (...get it?), let's get back to Sohla's paneer. In this case, yes, ground spices are better than no spices at all. But you'll want to use ¾ tsp. ground cumin and ground coriander and a generous ¼ tsp. ground black mustard (though, TBH, ground black mustard is less common, so you'll likely need to skip it). Still, if you're looking to up your spice game, we strongly recommend stocking up on the whole versions: Not only are they usually fresher (because they have a longer shelf-life), but they offer great pops of texture in every bite.Next time, huh?Get the recipe:Paneer With Burst Cherry Tomato SauceThis dish of saucy, seared paneer channels the flavors traditionally found in matar paneer—coriander, cumin, chile, and ginger—into a quick-cooking cherry tomato sauce that's packed with bright spring-y sugar snap peas. If you can’t find paneer, give this a try with another sturdy non-melty cheese like Halloumi or queso fresco. Or think of it as a simple sauce you can serve over any protein, like a crispy-skinned salmon fillet, seared shell-on shrimp, sliced feta, or even just a bed of salted yogurt. View RecipeExplore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-21", "author": ["Condé Nast", "Sarah Jampel"]}