{"id": "ab233b59dc2c9ca04848cb7b5eeacc03", "url": "https://www.bonappetit.com/recipe/baked-pasta-and-leeks-with-anchovy-cream", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Baked Pasta and Leeks With Anchovy Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBaked Pasta and Leeks With Anchovy CreamBy Chris MoroccoMarch 16, 20214.2(101)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca Jurkevich, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintYes, you are going to use a whole tin of anchovies here (Test Kitchen director Chris Morocco suggests Cento or Roland). No, it won’t be too much. Anchovies, cream, leeks, and Parmesan do magical things when baked with pasta. Anchovies bring more than just salt to the table; they add loads of umami to this rich and creamy dish.Ingredients4 - 6 Servings1lb. short pasta (such as rigatoni, penne, or conchiglie)Kosher salt¼cup extra-virgin olive oil3large leeks (about 1½ lb.),  white and pale green parts only, trimmed, sliced ½\" thick15oil-packed anchovies, drained (from a 1.5-oz. tin)6garlic cloves, thinly sliced1tsp. mild red pepper flakes or ½ tsp. crushed red pepper flakesFreshly ground black pepper2cups heavy cream3oz. Parmesan, finely grated,  plus more for serving110-oz. bag frozen baby peas, thawed in warm water, drainedPreparationStep 1Preheat oven to 400°. Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions. Drain and set aside.Step 2Meanwhile, heat oil in a large Dutch oven or large high-sided skillet over medium. Add leeks; season with a couple pinches of salt. Cover and cook, stirring occasionally, until tender and golden around the edges, 6–8 minutes. Uncover and add anchovies, garlic, red pepper flakes, and several grinds of black pepper. Cook, stirring occasionally, until anchovies are disintegrated and garlic is tender, about 5 minutes.Step 3Add cream and 3 oz. Parmesan. Bring to a simmer; season with salt and black pepper (it should taste a bit salty because the pasta will absorb some seasoning as it bakes). Add peas and reserved pasta and toss gently to coat; top with more Parmesan. Transfer pasta to oven; bake until top is crisp and cream is bubbling around the edges, 25–30 minutes. Let cool slightly before serving.How would you rate Baked Pasta and Leeks With Anchovy Cream?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleThis was a relatively easy weeknight meal. I made it exactly as written, and it turned out tasty and very hearty. I would liken it to an upscale tune noodle casserole.Josie L.New Orleans, LA3/4/2022Made this the other day but instead of pasta, I poured the sauce into cross-cut cooked spaghetti squash and stuck it under the broiler. Didn't have anchovies so I used a couple lil glugs of fish sauce where the anchovies would have been added in. I was worried the fish sauce might end up overpowering the dish but, just as I imagine it would with anchovies, the sauce mellowed out nicely! Still riding the high of how good it was.  Sadie2/24/2022Just made it tonight for my family. My husband loved it and so did my two year old. I did add mild Italian sausage to it,  but love the cream sauce with the anchovies. My husband has requested that I make this again. (I don't think the picture is the correct representation of this recipe, this recipe uses a white sauce.)AnonymousDallas, Texas1/21/2022Jill, I would suggest capers (if your daughter already likes/is open to trying them) as a substitute for anchovies. The result will certainly be delicious! Gianfranco CasaleBrooklyn, New York 1/11/2022Great recipe! Instead of anchovies, I substituted octopus and instead of parmesan, I used goat cheese. Rather than pasta, I thought lentils would be a good choice. I didn't have any cream, so I used some homemade chicken broth. I would definitely make this recipe again.Janice P.Chicago1/10/2022Jill, anchovies are seasoning not meatAnonymousNew Jersey, Albania12/19/2021Ok - I bet the rave reviews have a lot to do with the anchovies. I have a vegetarian daughter who loves pasta, leeks and cream ... is there any anchovy sub that would do the dish justice?Jill DonatyLos Angeles, CA9/14/2021I've made this twice and exactly as written. I LOVE this recipe, especially the crunchy bits on top! I didn't think it was overly salty at all. In fact, I'm having the leftovers for breakfast!Mary KayPrairie Village, KS8/31/2021So I didn’t have everything at hand we are in a big lockdown here in Sydney Australia, so I just made do with what I had.\nI followed everything as said and took heed to people’s comments and added my own thing also\nNo leeks - I used 2 very large onions \nAnchovies we’re awesome as is \nDidn’t have the big pasta on hand I used a packet of linguine which halved the baking time and I also put one cup of reserved pasta water and abit of extra chicken stock as we love a saucy dish \nAlso not much Parmasen I had Romano cheese thankfully and it was amazing together \nThe dish was awesome the flavour was fantastic and something I would definitely cook again \nThank you \nBellaAustralia, Sydney 8/25/2021Rinse your anchovies in a mesh strainer. It’ll reduce your salt content without sacrificing flavor.  Anonymous5/11/2021Just as delicious with just a dash of cream, 1/2 lemon juice, lemon zest, and 1/2 amount of anchovy!Anonymous5/4/2021I mean yum, but why the hell does the pic look more red sauce when this is a v white sauce pasta? Y’all got me confused looking at my dish like... where did I miss the mark?\n\nAnonymousChicago, IL5/2/2021This was so so good. Added some sausage cause we could. Insane. Great leftovers for lunch.  SofieSan Francisco, CA4/27/2021I took the suggestion to add pasta water due to the 'dry' comments. Added 1c to the sauce and baked for 15' covered. It was fantastic! Not dry at all and pasta still had tooth feel. I also added a little lemon zest, which was nice. Lemon juice is probably a good idea, or something acidic to cut the richness. Definitely will make it again.KGChicago4/25/2021Absolutely delicious but needs a healthy squeeze of lemon before serving. Other than that A+.ceciliaminneapolis4/18/2021Explore Bon AppétitPastaAnchovyFishSeafoodLeekVegetableRigatoniPasta & NoodlesPenneEasyMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Chris Morocco"]}