{"id": "ab3e973fd70c10aa9b88980cefb0cf6d", "url": "https://www.bonappetit.com/recipe/spicy-cheddar-cheese-spread", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Spicy Cheese Spread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSpicy Cheddar Cheese SpreadBy Kat BoytsovaJanuary 25, 20184.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis cheesy dip is made for our Pretzel Bites, but you can also serve this with store-bought pretzels, your favorite kind of crackers, or a platter of crudités.IngredientsMakes about 2½ cups8ounces cheddar, grated (about 2 cups)2ounces cream cheese, softened½cup mayonnaise¼cup sour cream1small garlic clove, finely grated¼teaspoon smoked paprika¼teaspoon cayenne pepper, plus morePreparationStep 1Blend cheddar, cream cheese, mayonnaise, sour cream, garlic, paprika, and ¼ tsp. cayenne in a food processor until smooth, 3–4 minutes. Transfer to a medium bowl; season with more cayenne.Step 2Do Ahead: Cheese spread can be made 3 days ahead. Cover and chill.How would you rate Spicy Cheddar Cheese Spread?Leave a ReviewTell us what you thinkReviews (4)Back to TopTrianglePlease give us a way to print your recipes!!!TigerMOMissouri, USA12/27/2020Please credit the recipe writers. Hope Brooklyn12/27/2020I have made this for many events and it's fabulous every time. It's so easy! I typically add more garlic for extra zing (having dragon breath for the rest of the evening is worth it). It's great on everything: crackers, bread, soft pretzels, raw vegetables - I have one friend who will even  add a little to her scrambled eggs. Suggestion: if you make it ahead of time and store it in the fridge I recommend letting it sit out a bit before so it softens up and is more easily spread/dipped. AnonymousAustin, Tx4/30/2020I found this too be a bit too thick to be considered a dip. However, it is the perfect consistency to spread on a hearty bread (I spread mine on pretzel focaccia). You can definitely up the amount of cayenne if you want any spice at all. AnonymousOhio, USA4/7/2020Explore Bon AppétitSpreadsDipCheddarCheeseCream CheeseQuickEasySnackStarterGluten-FreeNut-FreeVegetarianKetoSuper BowlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Kat Boytsova"]}