{"id": "ab3e434fd21384b947e9798f723ba166", "url": "https://www.bonappetit.com/story/freeze-your-tofu", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "How to Freeze Tofu and Why You Should Do It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Firmer, Chewier, More Absorbent Tofu, Freeze It“The freezer changed me.” —Your tofuBy Jessie YuChenFebruary 19, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Susan OttavianoFacebookTwitterEmailI used to buy bags of frozen tofu from the grocery store because I loved its satisfyingly chewy, spongy texture and its ability to soak up flavorful liquids like a sponge. I thought of it as a special tofu product—that is, until I learned that it is actually just…tofu that has been frozen. D’oh! Don’t get me wrong, frozen tofu is still a very special tofu product, just know that you can make it in your kitchen with almost no effort, no special trip to the freezer aisle required. Here’s how (and why) to freeze your tofu.The freezer changes tofu.When frozen, tofu magically transforms—its texture becomes denser and spongier, with tons of little coral reef–like holes. While I hate to spoil the fun, this magic is actually simple science: The water in tofu expands when it’s frozen, thereby destroying the original structure. When the ice crystals thaws, they seep out in the form of water, leaving the holes they formed behind. A star different tofu product with an entirely distinct consistency is born.What’s good about frozen tofu?This change in consistency makes the tofu simultaneously stronger, firmer, and spongier. It holds its shape better when cooked in stir-fries, hot pots, or soups, and loses its tendency to fall apart. Because the tofu has lost water and gained tons of little holes in its place, its mouthfeel is denser with a pleasant bite—some would say it has a meat-like consistency. The holes are also perfect pockets for absorbing and storing flavor—like a sponge, frozen tofu is fantastic at soaking up sauces and broths. And, as with anything you freeze, you also extend your tofu’s shelf life—while tofu lasts for weeks unopened in the fridge, it will last for much, much longer in the freezer.How do you freeze tofu?It’s super easy to make frozen tofu at home. Simply cut whole blocks of tofu (any kind works, but be gentle with the silken stuff) into whatever size you plan on using (big or small cubes, thick or thin planks). Carefully place them on a sheet tray or in a freezer-safe container or bag. If you don’t plan on using all of the tofu at once, you’ll want to separate it into portions (use different bags or containers or layer with plastic wrap) so that you can defrost one helping at a time. After your pieces are frozen solid, about 4–6 hours, it’s done! Don’t worry if they’ve turned yellow—that’s completely normal. If you froze the tofu on a baking sheet, transfer it to a sealed container—it will last in the freezer for up to one year.Since your frozen tofu is already cut into pieces, you can either throw the cubes or planks directly into what you’re cooking or, if you don’t want excess moisture (say you’re planning to pan-fry, sear, or grill, or you’re simply wary of diluting a broth), you can thaw them before using. There’s no one right way to thaw—either transfer the tofu to the fridge overnight or run the pieces under water.Frozen tofu is great for braising, marinating, or simply adding to soups. And, in my humble opinion, a hot pot spread is simply incomplete without it. Speaking of which…Hot pot time!Everything You Need to Know to Make Hot Pot At HomeThe method (and the madness) behind our favorite way communal, choose-your-own-adventure meal.View StoryExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-19", "author": ["Condé Nast", "Jessie Yuchen"]}