{"id": "ab4b1160ba988fa03603ae944e1375fd", "url": "https://www.bonappetit.com/story/taco-truck-saved-my-marriage", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "The Taco Truck That Saved My Marriage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureThe Taco Truck That Saved My MarriageIs a love story even a love story if it doesn’t feature tacos?By Ada LimónFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel ShepardFacebookTwitterEmailMy husband would love to cook. If he had the time. Or the right recipes. Or the right ingredients. Or…well, you get the idea. He very rarely cooks.Both of us work from home; I’m a writer and he runs a marketing company. And because we are child-free and have flexible schedules, either one of us could easily fix dinner. But for two rather nontraditional people, we fall into embarrassingly traditional roles when it comes to the kitchen. Picture me in an apron making a pot of posole rojo while he does the yard work (and yes, he does the dishes, but that’s not the point).When we first started dating a decade ago, back in New York City, my husband would try. He’d come to Brooklyn to stay with me and say, “Should I pick us up some wraps?” No, I did not want him to pick us up some wraps. What even is a wrap, and why are they so terrible? A stale, cold flour tortilla stuffed with something equally stale and cold. It’s like eating sadness. Or fear.Later, when we moved south to Lexington, Kentucky, and I started working from my home office, he’d ask me if I wanted fast food on his way home, but I never wanted fast food either. The only time I ate fast food as a kid was during my parents’ divorce. For better or worse, fast food will always and forever remind me of divorce proceedings. Soggy fries of separation. Greasy nuggets of joint custody agreements. I’m particular, but I have my reasons.Tacos Guerrero knows a thing or two about romance.\nPhoto by Brian KaiserMy husband is a doer, a shower-upper. He’s the guy who loaded every overpacked box of books into the moving truck and then drove us 12 hours in the snow and fog without so much as a minor complaint. He reads all my first drafts (and his printer always works)! We are constantly laughing as we move through the house, his dry humor punctuating the day’s otherwise dreary tasks. He walks the dog in cold weather and lets me sleep in till the heat comes on. All of this makes me want to avoid being the pouting partner who says, “Do I really seem like someone who would eat a wrap to you?”For years these roles meant that if I wanted a night off from cooking, we’d head downtown to a restaurant. No soft pants and couch time, no snuggling with the dog, no binge-watching old episodes of Veronica Mars, but grown-up going-out time. Committing to a time and a place, making reservations, getting gussied up, not to mention the expense of it all. So if I didn’t feel like cooking—or fast food, or a dreaded wrap—I had better feel like leaving the house.Then one busy spring when I was just about to put away my pots for good and see how long it would take one of us to cave or starve, the taco truck appeared on our corner and everything changed.It’s not just about my Mexican heritage; it’s about what I consider good food. It’s about eating things that bring satisfaction, and for me that means tacos. Tacos are my family food. Tacos remind me of my father, dropping his much-loved carne asada into corn tortillas, smothering it with homemade guacamole and toasted cumin seeds. I’d eat a taco for every meal. In fact, I have eaten a taco for every meal. That one broke summer during graduate school when I thought if I kept putting random ingredients in warm corn tortillas, I might just outrun my own ill-advised relationship choices and their accompanying hangovers. Not once did I suffer taco burnout.Our taco truck, Tacos Guerrero, is parked on the corner of Russell Cave Road just past New Circle in Lexington’s Northside. It has swirling multicolored disco lights, drive-up ordering, folding tables and chairs, and a faux brick façade that makes it look like an actual outdoor café (albeit a café in a gas station parking lot). My husband and I will roll up after long days for warm paper bags stuffed to the brim with tacos al pastor layered under piping hot chunks of pineapple, or tinga de pollo topped with diced onions and fresh cilantro and a choice of green or red salsa that are both so picante they make my eyes sting. We bring them home, pair them with red wine and quality couch time and Veronica Mars. There are no frills, no extras, no unnecessary accoutrements, just good solid tacos wrapped in wax paper, dripping with flavor, and served with a bag of quartered limes to squeeze on top. All they demand of us is that we eat them while they’re still warm.Tacos, a love language.\nPhoto by Brian KaiserDo you know what sentence makes me unbelievably giddy? “Should I just pick us up some tacos on the way home?” Yes, yes you should. You should always and forever pick me up tacos on the way home. And I will pick up tacos for you. And we shall live in harmony.I like to joke that Tacos Guerrero saved our marriage, but after it came along, I realized tacos have always infiltrated all aspects of our relationship. When we decided to get hitched, we knew we’d serve tacos at the wedding. No fancy plated meal or upscale menu. Just tacos. We still laugh that everyone kept telling us to eat because apparently no one eats at their own wedding. Rest assured, we ate. We ate full plates of tinga de pollo and went back for seconds, form-fitting wedding wear be damned. Even our dog pilfered a taco that day. And further back? The very first real meal I made for him in my tiny Brooklyn kitchen? Ground turkey tacos I made from ingredients at a local bodega that never had much but always carried good avocados. Tacos, you see, are my love language.Then, just a few days ago, a funny thing happened. It was a soggy gray day and both my husband and I had deadlines to meet. The dog was snoring loudly. The rain on the roof was making the house feel like a bright port in the storm. Then, suddenly, from the kitchen, I heard…wait, was that the sound of chopping? Of a tortilla smacking the skillet, of an avocado being halved? Was that the smell of onions simmering?Be still my heart; my man was cooking. My man was cooking tacos.Ada Limón is the author of five books of poetry, including 2019’s National Book Critic's Circle Award winner, The Carrying. She lives in Lexington, KY.Want More Stories From Taco Nation? Right This Way...Why Korean Tacos Are Margaret Cho’s American DreamWhy Are H-E-B’s Flour Tortillas So Dang Good?Danny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Sandra Cisneros’s Greatest Inheritance? A Peanut Butter TacoHow the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Cooking in the Midst of a Border Crisis Is About More Than SurvivalThere’s Nothing Authentic About Old El Paso Taco Seasoning Packets, But Amanda Shapiro Loves Them AnywayAnd so much more!Explore Bon AppétitTaco NationMexicanKentuckyFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Ada Limón"]}