{"id": "ab7026d935d3a6ad45794edd6b75ff67", "url": "https://www.bonappetit.com/recipe/parsnip-confit-with-pickled-currants", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Parsnip Confit with Pickled Currants Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueParsnip Confit with Pickled CurrantsBy Molly BazOctober 16, 20185.0(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintWelcome to root vegetables reinvented. Sturdy parsnips soften in a warm bath of olive oil, then get seared and bejeweled with pickled currants. It’s hard to know if a parsnip will have a woody core, but generally speaking, small ones are tender throughout. Worst case scenario? Trim the tough centers before cooking.Ingredients8 servings2½lb. parsnips, peeled, halved lengthwise, quartered if large, woody core removed if large2heads of garlic, halved crosswise14\" piece ginger, scrubbed, sliced lengthwise into ⅛\"-thick planks3large sprigs rosemary, divided, plus 1 Tbsp. rosemary leaves for serving1Tbsp. plus 1 tsp. kosher salt3cups extra-virgin olive oil½cup dried currants¼cup sugar½cup plus 1 Tbsp. apple cider vinegar2tsp. Aleppo-style pepperPreparationStep 1Preheat oven to 300°. Combine parsnips, garlic, ginger, 2 rosemary sprigs, and 1 Tbsp. salt in a rectangular 3-qt. baking dish; turn garlic cut side down. Pour oil over.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Roast 35 minutes. Remove from oven; turn parsnips over. Return to oven and roast until a knife easily slides through flesh, 30–40 minutes. Let cool slightly.Step 3Meanwhile, bring currants, sugar, ½ cup vinegar, remaining 1 tsp. salt, remaining rosemary sprig, and ¼ cup water to a boil in a small saucepan over medium-high heat. Reduce heat and simmer, swirling pan occasionally, until reduced by three-quarters. Transfer to a small bowl and stir in Aleppo-style pepper, 1 Tbsp. parsnip confit oil, and remaining 1 Tbsp. vinegar.Step 4Remove parsnips from oil, letting excess drip back into baking dish, and place on a rimmed baking sheet. Pluck out garlic and set aside for serving. Strain oil through a fine-mesh sieve into an airtight container; discard aromatics. Cover and reserve oil for another use.Step 5Heat a large skillet, preferably cast iron, over medium-high. Working in batches, arrange parsnips in skillet in a single layer and cook, turning occasionally, until golden brown and charred in spots, about 4 minutes per batch. (Alternatively, you can broil them, turning halfway through, 10–12 minutes.)Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 6Transfer to a platter and spoon currant sauce over. Top with reserved garlic and rosemary leaves.Step 7Do Ahead: Parsnips can be cooked in oil 1 week ahead. Let cool completely; cover and chill. Reheat in oil in a 300° oven before browning. Currants can be pickled 1 week ahead; cover and chill.How would you rate Parsnip Confit with Pickled Currants?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleThis is A Great Side Dish,Vegan and Vegetarian,I would Pair it with Any kind of Protien.RONALD MASSENBURG N.J 1/6/2022I cannot stress how amazing this dish is. Was a hit at Thanksgiving and I can't wait to make it again for Christmas. I've always been a fan of roast parsnips and honestly didn't think they could get any better but this dish took the cake. I couldn't find dried currants where I live so I had to resort to cranberries, which actually worked pretty nicely. Bravo, Molly! Katya USA 12/17/2021Fabulous. Was a winning dish at a family Christmas and may have even outshone the meat mains! I followed the recipe exactly and found I didn't really need quite as much olive oil as stated, so I think you could eyeball it (or use the remaining olive oil to cook something else if you're doing a big feast) Also even though there are a few more steps than your average, bang-in-the-oven roast veg, it's very simple and totally worth it. A true revival of the humble parsnip. A new festive staple. AnonymousPerth, Australia 3/18/2020Does this really require 3 cups of EVOO?  What would one do with the reserved oil after the fact?Anonymous12/25/2019Probably the best dish at the table this thanksgiving, even if it was out of my comfort zone of a simple chop and roast. I couldn't get Aleppo-style pepper so I used 1.5t paprika, .25t smoked paprika, and .25t cayenne. It brought something exciting to the currants even if it wasn't exact what was called for.Anonymous11/29/2019Wow - this turned out to be the star side dish on our Christmas table. Everyone loved it. I made the currants a day before, minus the extra vinegar,oil and Aleppo pepper. Once the parsnips were done the day of, I stirred the rest in. It was easy to confit first, then let sit while other items (at different oven temps) baked, then threw them under the broiler to finish. Leftovers were good the next day. I've been asked to make these a tradition and plan to do so! TXHuskerTexas12/29/2018The winner at my table last night for Thanksgiving!AnonymousPhiladelphia11/23/2018Explore Bon AppétitAmericanCalifornia CuisineParsnipVegetableGingerHerbs & SpicesRosemaryDried CurrantDried FruitFruitAleppo-Style PepperFallSideVegetarianVeganDairy-FreeNut-FreeGluten-FreeHealthyishRoastThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}