{"id": "ab78d80c4f6254921ad764766beb6939", "url": "https://www.bonappetit.com/recipe/chicory-bacon-and-poached-egg-salad", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Chicory, Bacon, and Poached Egg Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2018 IssueChicory, Bacon, and Poached Egg SaladBy Molly BazNovember 20, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintDinner salad shouldn’t feel ascetic. That’s why we called up bacon, cheese, and crispy mushrooms.Ingredients4 servings4oz. Parmesan1medium shallot, finely chopped¼cup sherry vinegar or red wine vinegar1Tbsp. honey7Tbsp. extra-virgin olive oil, dividedKosher salt, freshly ground pepper8oz. slab or thick-cut bacon, cut into ½\" pieces28\"-long sprigs rosemary1lb. mixed wild mushrooms (such as shiitake, maitake, and/or oyster), woody stems removed1lb. chicory (such as radicchio, escarole, and/or frisée), leaves torn into 3\" pieces4large eggsPreparationStep 1Finely grate half of the Parmesan into a large bowl. Add shallot, vinegar, honey, and 5 Tbsp. oil and whisk well; season dressing with salt and pepper.Step 2Cook bacon in a large skillet over medium-high heat, stirring occasionally, until brown and beginning to crisp, about 5 minutes. Add rosemary and cook, turning once, until crisp, about 2 minutes (fresh rosemary can be intense; frying the sprigs mellows their flavor and creates a crisp salad topper). Using a slotted spoon, transfer bacon and rosemary to paper towels.Step 3Add remaining 2 Tbsp. oil to skillet and heat over medium-high. Arrange mushrooms in pan in a single layer and cook, undisturbed, until golden brown underneath, about 3 minutes. Season with salt and pepper, toss, and continue to cook, tossing often, until golden brown all over, about 5 minutes. Transfer to bowl with dressing, but don’t toss. Strip rosemary leaves off stems into bowl and add chicory.Step 4Meanwhile, bring a large pot of water to a boil. Reduce heat so water is at a bare simmer. Crack an egg into a small bowl; gently slide egg into water. Quickly repeat with remaining eggs. Poach, rotating eggs gently with a large slotted spoon, until whites are set but yolks are still runny, about 3 minutes. Using spoon, transfer eggs to paper towels. Season with salt and pepper.Step 5Toss salad to coat leaves; season with salt and divide among plates. Shave remaining Parmesan over and top with bacon and poached eggs.How would you rate Chicory, Bacon, and Poached Egg Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladRadicchioChicoryLeafy GreensVegetableEscaroleFriséeEggBaconCured MeatMeatMushroomWinterMainNut-FreeGluten-FreeKetoHealthyishFrySimmerLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Molly Baz"]}