{"id": "ab8814429b3da755ac17fb57a11ff4b0", "url": "https://www.bonappetit.com/recipe/peanutty-noodles-with-tempeh-crumbles", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Peanutty Noodles with Tempeh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPeanutty Noodles with Tempeh CrumblesBy Sarah JampelApril 3, 20194.6(51)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue LiEmailPinterestPrintEmailPinterestPrintTempeh skeptics, this recipe will make a convert of you: Crumbling tempeh into ripping-hot oil makes for odd-size bits and pieces that are crispy, golden brown, and­—especially when glazed with a spicy-sticky sambal sauce—addictive. You can make the crumbles on their own for topping salads and stir-fries, but we recommend you incorporate them into these peanutty, soy-spiked noodles, where they add flavor and texture.Ingredients4 servings3Persian cucumbers, halved lengthwise, thinly sliced into half moonsKosher salt4Tbsp. fresh lime juice, divided¼cup vegetable, grapeseed, or other neutral oil, divided11½\" piece ginger, peeled, finely chopped2garlic cloves, finely chopped½cup creamy peanut butter (natural is fine as long as it’s well stirred)2Tbsp. plus 2 tsp. soy sauce, divided1Tbsp. sambal oelek or Sriracha, divided2tsp. honey, divided8oz. tempeh, crumbled into walnut- to chickpea-size pieces10oz. ramen noodles2scallions, thinly sliced on a diagonalTorn cilantro leaves and lime wedges (for serving)PreparationStep 1Place cucumbers in a small bowl. Add several pinches of salt. Massage cucumbers with your hands, gently at first, then squeezing more firmly as they become more pliable. Pour off any liquid they release, then add 1 Tbsp. lime juice and toss to coat. Season with salt, if needed.Step 2Heat 2 tsp. oil in a large skillet over medium. Cook ginger and garlic, stirring constantly, until softened, 1–2 minutes. Transfer to a large bowl and add peanut butter, 2 Tbsp. lime juice, 2 Tbsp. soy sauce, 2 tsp. sambal oelek, 1 tsp. honey, and ⅓ cup hot water. Whisk to combine, adding 1 Tbsp. hot water at a time if needed, until a thin sauce forms. Season with salt.Step 3Heat 2 Tbsp. oil in same skillet over medium-high until shimmering. Add tempeh in a single layer, season with salt, and cook, undisturbed, until deeply browned, about 2 minutes. Toss, add 1 Tbsp. oil, and continue to cook, stirring occasionally, until browned all over, 3–5 minutes.Step 4Stir remaining 1 Tbsp. lime juice, 2 tsp. soy sauce, 1 tsp. sambal oelek, 1 tsp. honey, and 1 Tbsp. water in a small bowl. Reduce heat to low, add lime juice mixture to pan, and cook, stirring occasionally, until liquid is evaporated, 1–2 minutes. Transfer tempeh to a plate; season with salt.Step 5Meanwhile, cook noodles in a large pot of boiling salted water, stirring occasionally, until chewy but not squishy (taste for doneness), 5–6 minutes. Drain, then rinse with warm water. Drain well again and toss with remaining 1 tsp. oil in colander. Add noodles to bowl with peanut dressing and toss to coat, adding more hot water to thin sauce if needed.Step 6Divide noodle mixture among bowls. Top with tempeh crumbles, cucumbers, scallions, and cilantro. Serve with lime wedges for squeezing alongside.How would you rate Peanutty Noodles with Tempeh Crumbles?Leave a ReviewTell us what you thinkReviews (28)Back to TopTriangleThis was tasty for sure but I could have made something just as good without the crazy recipe to follow on a weeknight. I also would have added more veggies had I done my own thing, but when I make a recipe for the first time I follow it to a T and trust it, it did not pay off this time. Will not make this again.AnonymousNew Orleans 10/26/2021OMG.  This is so delicious. And exotic. What a find. Even my non-vegetarian husband asked to have it again the next night.  Just spicy enough, not too peanutty.  The toppings are perfect and not just for show - whoever thought cucumbers could add so much to a dish? The recipe looks complicated the first time around, but it's actually pretty easy and not that time consuming. Next time I plan to make both sauces at the same time, while I'm in measuring mode. I will be making this often and forever.  Thank you so much, Sarah!LynneOakland, CA5/21/2021YUM. I'm trying to lower carbs so I had it over stir fried zucchini and snap peas. It was absolutely delicious. PeanutsoSeattle2/25/2021I added a lot more water into the sauce but it was still too thick, sickly thick.\nI also used udon noodles instead, I think it would be weird with ramen noodles given how thick the sauce is.\nThe recipe for the tempeh is good though.AnonymousSingapore1/14/2021Fantastic recipe, I often sub the Tempe for cauliflower and charr it up in the skillet before adding the sauce. Has become a winter staple for all its warm soothing peanuty vibes. AnonymousBrooklyn12/11/2020My main problem with this recipe is that it felt very disorganized. To aid with mise en place—or just situational awareness! so I know when to expect to be whipping up various sauces vs. making sure the noodles don't overcook—I wish the ingredients were separated into \"Peanut Sauce\"/\"Tempeh Crumbles\" sections. Flavor-wise, we really enjoyed this and it was fun to experiment with another source of vegan protein that I don't use often! Will certainly try again and I think it will be easier the second time to keep track of everything.kendall.eatsSeattle8/11/2020I normally opt for an easy stirfry by throwing veggies, noodles & soy sauce into a pan but I'm so glad I tried this instead! The long prep time was 100% worth it. I'm not a huge peanut butter fan but it's perfect in this recipe. As for the tempeh, I'd never prepared it before but I'm definitely going to be using it far more often. I love how crispy it turned out. It's easy enough to make vegan too by foregoing the honey. I can't wait to play around with this some more soon :)AnonymousNew York7/25/2020Definitely will make again, loved the sauce and will definitely try adding different veggies as some other reviewers have said. Even went down well with a picky eater who I convinced to try it by saying it was peanut butter pasta, eight year olds am I right! LolENVConnecticut 7/8/2020Um wat? This was amazing. Didn't have cucumber so I subbed radish. I also used red lentil spaghetti instead of the ramen (sue me) and the taste and texture held up really nicely in this dish. I'll def be making this again and if nothing else will use the peanut sauce for other applications too.uslandercChicago5/28/2020I've had peanutty noodles that were TOO peanutty before but this recipe turned out incredible! I use it for meal-prepped lunches for the week. Super easy and I like to add in extra veggies in the stir fry too to add some color. 100% recommend - and you can eat hot or cold!cecebuckNew Jersey5/26/2020Definitely a fan of cooking tempeh this way! I used about half of the amount of peanut butter since it's all I had and the noodles turned out great regardless. Added a stir fried bell pepper as extra veg. Delicious! A perfect lazy dinner and a satisfying leftover lunch.AnonymousBrussels, Belgium5/25/2020This was pretty good, though quite a bit of prep so not quite the first choice for our weeknight dinners. If you're not already a fan of peanutty-noodles, this is probably not for you. Anonymous5/25/2020Crispy, delicious with none of the bitterness you sometimes get with tempeh. Also great over brown rice. We also swap out a few TBs of the peanut butter for GoChujang for added depth.\nAnonymousVermont5/22/2020Absolutely delicious. Easy enough and I love that it uses ramen noodles. I bought a bunch in a panic because of the virus but now I know what to do with it. Just because the toppings are pretty doesn't mean they are optional. They add the complexity of flavor and texture. I thought the cucumbers were going to be way too salty but it was very nice with the dish. Next time I will just cube the tempeh because the jagged edges were very hard to brown evenly. I will make this again soon. AnonymousColorado5/11/2020This was pretty good, however, I did have to add just a bit more sambal and soy sauce to the peanut sauce to get it as salty/spicy as I'd like.Erin5dUSA5/5/2020Explore Bon AppétitRamen NoodleNoodlePasta & NoodlesPeanut ButterCondiments, Sauces & PastesCucumberVegetableTempehOther IngredientsMainVegetarianDairy-FreeHealthyishFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-03", "author": ["Condé Nast", "Sarah Jampel"]}