{"id": "ab89ec5f71b9823b2bfe1b4497b0263a", "url": "https://www.bonappetit.com/story/lote-23", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "How Lote 23 Became a Community Wellness Space after Hurricane Maria | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Hurricane Maria Transformed a Food Park Into a Community Wellness Space in Puerto RicoAlmost a year after Hurricane Maria, San Juan's Lote 23 has become a support network and a gathering place.By  Ligaya MalonesAugust 21, 2018FacebookTwitterEmailPhoto by Juanky AlvarezFacebookTwitterEmailLote 23 was meant to be a trendy outdoor food park, one of the first attempts to remake a long-ignored space on the island of Puerto Rico. “We wanted it to be a place where people could enjoy good food in a casual setting,” says Cristina Sumaza, Lote 23’s co-founder, who opened the space in late 2016 in the Santurce neighborhood of San Juan. The empty lot set among looming condominiums and corporate offices became home to 16 food vendors serving both international and Caribbean food, prepared by some of the island’s most celebrated chefs and rising stars.Then, less than a year after the park opened, Hurricane Maria transformed the space again.Compared to much of the island, the food park weathered Maria well and emerged from the Category 4 storm with mere landscaping damage. Equipped with a generator to power the kioscos during intermittent outages, Lote reopened within two weeks. “Everyone was trying to understand what was happening, and people were still struggling with basic needs, but we thought, ‘What can we do to disconnect for a moment, what can we give people during this crisis so they don’t leave the island, like many did,” Sumaza says.Lote 23 had already offered weekly yoga classes before Maria. Now, Sumaza and her team were seeing upwards of 60 people show up for each class, nearly double the attendance before.“Yoga worked as an excellent tool to take people's minds away from the disaster and focus on the positive,” explained Valerie Santiago in an email. Santiago is the owner of El Estudio, Yoga I Love you, whose instructors volunteer every Sunday to teach an open-air class at Lote 23. “People felt the need to open up to new spaces and experiences.”Drinks from Caneca, a cocktail bar housed inside an Airstream trailer at Lote 23.\nPhoto by Juanky AlvarezMeanwhile a collaboration with local booking platform Stageboom and musical acts including Émina, Beto Torrens, and Roots Ensemble gave residents an opportunity to unwind between hours spent lining up for gasoline and searching for cell service. “Having things to do and a place to be was important at that time. Lote felt homey, and, for Puerto Ricans, music is essential,” Santiago adds.Lote’s chefs, many of whom relied on the island’s local produce, “had to adapt their menus to whatever they could get,” says Sumaza. The space also served as a lifeline for chefs like Carlos Portela, whose restaurant 20 miles from San Juan, Orujo, lost power for six months. Portela operated a pop-up kiosk serving mac and cheese variations during this time to keep himself financially afloat.“Our people are eager to help,” says Crystal Díaz, Marketing Director for Cinco Sentidos, the culinary group that operates Croquetería, another Lote kiosk. “We like to make people feel at home.”As Puerto Rico gradually recovers and approaches Maria’s one-year anniversary, Lote pulses with convivial energy. Lately, they’ve hosted afternoon markets showcasing local designers and artisanal producers, and themed weekend dinners. Six days a week, locals and tourists collect around picnic tables and bar tops. They dip handmade queso manchego and ham croquetas in tomato chutney, sip crafted concoctions with names like Missionary’s Downfall and Ticket to Austin, and contemplate paleta flavors (Mango chile? Strawberry cheesecake?). Occasionally there’s a collective yelp from the middle of the lot as another giant Jenga game ends.Sumaza describes all this as the “new normal.” “You never know when the electricity is going to be out,” she says. On the surface, Lote feels like the typical, hip hangout; colorful murals splashed on walls, strung lights twinkle overhead when the sun goes down. Generators remain close by.Explore Bon AppétitHealthyishPuerto RicoPuerto RicanRead MorecultureWhat Will Puerto Rican Food Look Like After Hurricane Maria?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Ligaya Malones"]}