{"id": "ab934c0b6d869bc054c9317385521e49", "url": "https://www.bonappetit.com/story/popoca-salvadoran-recipes-redirect", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "\"There's More to Salvadoran Food Than Pupusas\" | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants\"There's More to Salvadoran Food Than Pupusas\"Anthony Salguero, chef-owner of Popoca in Oakland, is spreading the gospel of Salvadoran cuisine.By Anthony Salguero, as told to Amiel StanekSeptember 30, 2020FacebookTwitterPinterestPhoto by Andria Lo, prop styling by Jillian KnoxFacebookTwitterPinterestThis article is part of our series on how restaurants changed in 2020, and why we've never loved them more. Click to see all the stories.One of the big reasons I started Popoca was to show people that Salvadoran food is unique, that there’s more to it than pupusas. I had always cooked progressive American food, but I never felt like the food was mine. I began spending more time in El Salvador visiting family there, and every time I would try a new dish I was amazed. Finally, I was like, “I’m Salvadoran, this is what I should be doing.” Once I started studying and staging and exploring more, I knew this was what I wanted to do for the rest of my life. The recipes and techniques in this story are versions of the ones that drew me into this world of cooking, modified first for my restaurant and then again for the home cook. They’re the ones that made me want to dig deeper, and I think that they can do that for you too.Here are the recipes, techniques, and ingredients that drew Salguero in:All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Photo by Andria Lo, prop styling by Jillian Knox1/11Chimol Makes It Better“If you’re eating at Mercado Central in El Salvador, you’ll likely get your steak with a side of chimol. It’s basically a radish pico de gallo. The combination of radish and chile delivers two kinds of heat: The radish gives that peppery, nose-clearing spice while the chile gets your tongue tingling. Crunchy, spicy, and acidic, it’s exactly what you want with steak.”View RecipePhoto by Andria Lo, prop styling by Jillian Knox2/11Super-Fry Your Beans“There are lots of different kinds of refried beans throughout the country, but in some mountain towns, you’ll get these amazing, really dense beans. My cousin calls them triple-fried, but it’s more like a thousand times fried. You just keep adding fat until the beans are thick enough to stand up on a plate, which is very common as part of a Salvadoran breakfast, with tortillas, eggs, fried plantains, avocado, and queso. They’re often made with lard, but I make mine with olive oil. It’s a little healthier, plus I’m cooking in California, so I try to be respectful of vegetarians who come in.”View RecipePhoto by Andria Lo3/11Expand Your Tortilla Horizons“Salvadoran tortillas are really different from Mexican ones. They’re still made with masa but formed by hand, never pressed, and thicker—basically a pupusa with no filling. They’re perfect for sopping up flavorful sauces and stews. The thing is, you can’t really get them in stores. But if you don’t want to make them, a soft baguette like the kind used for banh mi is the best (and most common) substitute.”Photo by Andria Lo, prop styling by Jillian Knox4/11Make It Rain Relajo All Over Crispy Shrimp“Relajo is the foundation of so many Salvadoran dishes, but the spice mix varies depending on the dish or the cook. There are certain consistent elements—bay leaves, achiote, chiles, cumin seeds, sesame seeds, pumpkin seeds—and then more idiosyncratic additions like peanuts. It hits my palate like a Mexican mole and adds complexity to even simple dishes like this quick sautéed shrimp.”View RecipePhoto by Andria Lo, prop styling by Jillian Knox5/11More Ways to Use It Enhance your braises: “When I’m almost done sweating aromatics, I stir in a couple spoonfuls of relajo, then add liquid and whatever meat I want to cook low and slow.”Turn it into a rub: “I season pork chops with relajo and a little salt, then grill. A squeeze of lime afterward is essential.”Toss with fried potatoes: “I add a few big pinches while the potatoes are hot, which brings out their flavor.”View RecipePhotographs by Andria Lo, prop styling by Jillian Knox6/11Warm Up With Chilate“I gravitate to hot drinks on a menu—eggnog, hot buttered rum, you name it. I love feeling cozy, and chilate, a spiced masa-and-milk-based drink, is the epitome of cozy beverages. I learned about this version, which swaps cashews for masa, at a restaurant that let me crash its kitchen for a couple weeks. I like that it’s easy to make, and that you don’t need great masa.”View RecipePhoto by Andria Lo, prop styling by Jillian Knox7/11Add a Pinch of Alguashte to Brothy Clams“Squash and pumpkins are huge crops in El Salvador, and the seeds never go to waste—they get toasted and ground to create alguashte. At the restaurant I stir it into a seafood stew that’s typically made with baby crabs, though here I’ve done it with clams. The alguashte adds a deep nuttiness and crunchy texture.”View RecipePhoto by Andria Lo, prop styling by Jillian Knox8/11Alguashte All the WaysPair it with fruit: “Alguashte often tops fresh fruit along with lime and hot sauce. It’s amazing on pineapple and mango, but also with plums, pears, and citrus.”Add it to a broth: “I’m into making the same alguashte-enriched broth for the clams but using other proteins like shrimp, black cod, even chicken.”Finish everything with it: “I sprinkle the powder on scrambled eggs, vanilla ice cream, buttered popcorn—anything that wants a little toasty flavor and salt.”View Recipe9/11Needs More Worcestershire SauceIn El Salvador, Worcestershire sauce—or salsa inglesa as it’s called there—is everywhere. It’s always on the table when you’re eating hanger steak or other grilled meats, but it’s also a central ingredient in a lot of ceviches and the Salvadoran version of a michelada. People add it to club soda, which kind of reminds me of the salted lime sodas you get at Vietnamese restaurants, really refreshing. I love that it’s not only salty but super savory, kind of like soy sauce, and lends an intense hit of umami to whatever you’re eating or drinking.$15 at AmazonPhoto by Andria Lo, prop styling by Jillian Knox10/11Let Them Eat Quesadilla“Not to be confused with the Mexican dish by the same name, Salvadoran quesadilla is a sweet-salty cheesecake that’s often eaten for breakfast with coffee, but at the restaurant I serve it as dessert. I’m not a huge dessert person, so it’s perfect for me—the Cotija adds a distinct salty funk that really balances all that sugar. I also like that it incorporates sesame seeds, which some people associate with Asian food but are actually a huge part of Salvadoran cuisine.”View RecipePhoto by Andria Lo, prop styling by Jillian Knox11/11Pair Chicha With Chicken“Gallo en chicha is traditionally made with rooster that’s braised in a pineapple-skin chicha, which brings these incredible sweet-sour notes. The first time I tried it, I was like, ‘Holy s**t, why haven’t I ever had this in the States?!’ For this recipe I use chicken, which is why it’s called pollo en chicha. I usually make chicha from scratch, but don’t worry, I’ve got you: A combination of pineapple juice and apple cider vinegar is a great substitute.”View RecipeExplore Bon AppétitRestaurantsFirst PersonChefsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Anthony Salguero", "As Told To Amiel Stanek"]}