{"id": "aba910c0f88fbebeeffadec7b19cc629", "url": "https://www.bonappetit.com/story/mushy-vegetables-in-soup", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "How to Add Vegetables to Soup Without Having Them Turn Mushy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGet Those Mushy Vegetables Out of My SoupOut of my way, soggy carrots. By Sarah JampelJanuary 8, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailYou know how some people dread finding a raisin in their chocolate chip cookie or a Jerusalem artichoke on their plate of roasted fingerling potatoes? (Just me?) Well, I also dread encountering a chunk of cooked-to-death carrot bobbing in my bowl of soup, especially when I think it might be a gently yielding sweet potato.It's the perennial soup problem: Vegetables infuse broth with great flavor (the sweetness of carrots, the sharpness of onions, the fresh vegetal quality of celery), but by the time the long-simmering soup is ready, they're bland, bloated, and overcooked. Molded baby food.Molly Baz's recipe for Classic Chicken Noodle Soup presents a solution to the conundrum: Instead of adding all of the vegetables at the beginning, she staggers it like a relay race. The first set of veg—a quartered onion plus roughly chopped carrots and celery—goes in at the beginning, their flavors seeping into the soup as the chicken cooks. They're cut into big pieces and act as part of the foundational stock.But once those vegetables are exhausted, they're strained and switched out for a fresh set of thinly sliced celery and carrot. These are added for the final 4–5 minutes of cooking so that they're tender but nowhere near mushy. You get the sweet luxury of long-cooked vegetables and the freshness of crisp-tender ones.It's good advice not only for quick-cooking veg but also for herbs: Molly starts with 2 whole sprigs of dill, but then—because the only thing worse than a soggy piece of celery is a strand of slimy herbs—fishes them out and adds a heap of chopped dill as the last step.But how can you apply this information if you're going off-recipe at home? First, if you're making stock from scratch, set aside some of the vegetables  so that you can add texture and freshness to the final product. (A very different but just as good option? Blend up those stock veg! That's what Carla Lalli Music does to give her Hammy Chickpea Soup a creamy—rather than brothy—consistency.)Or, if you're just thinking about when to add what, consider approximately how long an ingredient takes to cook before you toss it in the pot. Potatoes, sweet potatoes, winter squash, kale/chard/broccoli rabe stems, broccoli stalks, cabbage—can get added early: They take a while to lose their bite. But quick-cooking things—asparagus, peas, thinly sliced carrots and celery, leaves, small florets—should be saved for the end.Unless of course, you like a mushy carrot. In which case I do not understand you, but I still respect you.Get the recipe:Classic Chicken Noodle SoupThis chicken noodle soup recipe is about as comforting as they come. View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-08", "author": ["Condé Nast", "Sarah Jampel"]}