{"id": "abaad55bf3ec9c8316e0c0e5984d8eae", "url": "https://www.bonappetit.com/recipe/turkish-style-poached-eggs", "year": 2022.0, "month": 3.0, "day": 2.0, "content": "Turkish-Style Poached Eggs With Brown Butter Garlic Chips Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurkish-Style Poached Eggs With Brown Butter Garlic ChipsBy Mehreen KarimMarch 8, 20224.5(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Susan Ottaviano.  Prop Styling by Maeve SheridanEmailPinterestPrintEmailPinterestPrintInspired by cilbir, Turkish poached eggs on a bed of creamy yogurt, this dish is a garlic lover’s dream. Typically, raw garlic is grated directly into the yogurt, but in this version we fry thinly sliced garlic in the spiced brown butter that gets drizzled over the entire dish. The resulting crunchy, golden brown garlic chips and the crisped-up torn bread lend textural balance to the soft eggs. Use the bread to sop up every last bit of runny yolk and creamy yogurt—it’s your side of toast built right in! —Mehreen KarimIf this is your first time dropping eggs into simmering water, our guide to poaching eggs can help take out the intimidation factor. Click here for more of our favorite brunch recipes.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSlotted Spoon$13 $10 At AmazonMesh Sieve$13 At AmazonMedium Skillet$60 At AmazonMedium Saucepan$39 At AmazonIngredients2 servings1cup plain whole-milk Greek yogurtKosher salt5Tbsp. unsalted butter, divided2½cups bite-size pieces country-style bread4large eggs, room temperature5garlic cloves, thinly sliced1tsp. Aleppo-style pepper½tsp. smoked paprikaChopped tender herbs (such as parsley or dill; for serving)PreparationStep 1Season 1 cup plain whole-milk Greek yogurt well with kosher salt and stir to combine. Set aside for serving.Step 2Heat 1 Tbsp. unsalted butter in a medium skillet over medium. Arrange 2½ cups bite-size pieces country-style bread (from about ¼ loaf) in an even layer in skillet and cook, undisturbed, until golden and crisp, 3–4 minutes. Continue to cook, stirring occasionally, until crisp on all sides, about 2 minutes more. Transfer to a plate.Step 3Fill a medium saucepan three-quarters full with water and bring to a bare simmer.Step 4Meanwhile, crack 1 of 4 large eggs, room temperature, into a fine-mesh sieve set over a small bowl, letting more liquid part of egg white drain off (this step eliminates the strands of egg white that can form when the egg hits the hot water). Transfer egg to another small bowl. Repeat with a second egg.Step 5Gently slide each egg into water in saucepan and cook, stirring occasionally and swirling eggs around in pan, until whites are opaque and set but yolks are still runny, about 2 minutes. Using a slotted spoon, transfer eggs to another plate. Repeat process with remaining 2 eggs.Step 6Rinse and wipe out saucepan. Combine 5 garlic cloves, thinly sliced, and remaining 4 Tbsp. unsalted butter in pan and cook over medium heat, swirling pan occasionally, until butter melts, foams, and is just starting to brown and garlic is golden, about 5 minutes. Add 1 tsp. Aleppo-style pepper, ½ tsp. smoked paprika, and a big pinch of salt. Cook, swirling pan often, until spices are fragrant and garlic is golden brown and crisp, about 1 minute. Remove garlicky spiced butter from heat.Step 7Divide reserved yogurt between 2 plates and spread into an even layer. Top with bread and poached eggs, dividing evenly. Drizzle garlicky spiced butter over and scatter chopped tender herbs (such as parsley or dill) on top.How would you rate Turkish-Style Poached Eggs With Brown Butter Garlic Chips?Leave a ReviewTell us what you thinkReviews (4)Back to TopTrianglewhat is the reviewer below going on about... it calls for frying the bread and everything before the eggs so the eggs are warm. and if you use full fat like it says, the yogurt is not wateryAnonymous3/15/2022You need to do the other components and then the eggs.  Cold eggs are no Bueno, cold bread pieces not so much.  I think straining the yogurt for a few minutes it will be more spreadable and not get watery in this mixture.Adobe Bluealpharetta ga3/13/2022I would have my toast and all other components ready before I cook the eggs.  Cold eggs could ruin the whole thing.  Also if you drain your yogurt in a strainer with a paper towel between the yogurt and the stainer, your yogurt texture will be thicker and not get so watery with your toast.Adobe Bluealpharetta ga3/13/2022This is a delicious recipe, I followed it to the letter except did not have any fresh herbs for garnish. My wife and I loved this dish.Kent NickellShelbyville, IN3/12/2022Explore Bon AppétitBreakfastLunchQuickWeeknight MealsEggYogurtOther IngredientsGarlicVegetableTurkishMiddle EasternSautéSimmerPoachAleppo-Style PepperHerbs & SpicesNut-FreeVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-08", "author": ["Condé Nast", "Mehreen Karim"]}