{"id": "abae87dea66fb2c1778c03084dd0148a", "url": "https://www.bonappetit.com/story/sweet-potato-feud", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Shrimp Scampi Pasta for the Hesitant Home Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureShrimp Scampi Pasta for the Hesitant Home CookA recipe you can’t mess up, the end of milk, and more news from the week.By Alex BeggsNovember 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Beginner’s luckMy friend Patrick is a grown man who went to one of England’s fanciest universities—who just bought his first microplane to make Basically’s Shrimp Scampi Pasta. The last time he cooked for me, Patrick boiled water in a Breville electric kettle and then added it to a pot, into which he dropped the pasta. “It worked, Cookie,” is his defense. (I am Cookie.) But this time he wanted to make a real recipe and I told him “anyone” could make this shrimp scampi pasta. When I showed up he was sweating, but the bowls of parsley, onion, and garlic were prepped. Panko was browning in a nonstick pan. “This is a LOT of cooking, Cookie,” Patrick complained. But water was boiling in a pot on the stove, and everything worked out, even when we realized he didn’t have any kind of strainer so we drained the pasta with the lid on. It worked, Cookie.Get the recipe: Shrimp Scampi PastaDanny KimDo no parmWhat I love about this article on how single New York men love chicken parm is how every time I think it’s about to end, it keeps going. Because there’s so much to say! The men, they love the fried chicken cutlet with cheese and sauce! They proclaim it on their dating profiles! “Interests: Chicken parm” might be as revealing as finding out someone “loves coffee.” But that’s what the date is for, right? Getting to the heart of the matter, like does your love for chicken parm stand in for some unresolved mommy issues, or represent the comfort you are unable to give yourself, or worse—reveal that you still talk with your mouth full of food.The article continues: “The frustrated single lady—who prefers eggplant parm, by the way—wishes dudes would find something more interesting to focus on.” Like...puffy vests? Be careful what you wish for, lady.Making it at home might be even more romantic: Pietro’s Chicken ParmesanWant this letter before it hits the website? Sign up for our newsletter!Photo by Chelsie CraigBucket full of BjornQornThis week on the BA Foodcast I awkwardly debuted a little segment called “Cook Marry Kill”—listen! Tell me what you thought, but only if it’s nice! I’m working on my podcast voice, okay? So I talked about the thrilling news of this holiday bucket of BjornQorn, a.k.a. everyone at BA’s favorite hippie popcorn. It’s solar-popped (okay!) and coated in nutritional yeast (fake cheese!) and we go crazy for it. The holiday bucket will be a way to go crazy for a bucket full of it.Read more: BjornQorn Is the Reigning King of BA’s Office Snack TablePhoto by Alex LauWoe is milkThe milk company Dean Foods filed for bankruptcy protection this week, because the end of milk is nigh. Somewhere an executive is wringing their fist to the sky and growling, “Oat miiiiiiilk!!!!” After I read that story, I dove into this joy-jolting profile of Tom Hanks in light of his new Mister Rogers movie, A Beautiful Day in the Neighborhood, which takes place in that era when men in sweaters drank pint glasses of whole milk. They’re both so wholesome. But now we’re skeptical of nice old men and swear our skin is clearer when we’re off dairy. We move forward, and the past becomes a selective retreat into nostalgia. “Remember milk?” We’ll say at dinner parties over almond milk panna cotta (which is just a puddle of gray water). I want to see the Mister Rogers movie and go out for ice cream after.Me neitherReader comment of the weekPhoto by Emma Fishman, food styling by Pearl JonesAdrienne C. wrote in about Adam’s pumpkin chiffon pie to share: “My very Southern grandmother made a pumpkin chiffon pie for Thanksgiving, but hers had a gingersnap crust (those rock-hard conventional grocery store ones) that added spice and offset the sweetness. She used slightly sweetened whipped cream on top and sprinkled a bit of chopped crystallized ginger on it. Delicious! It even won over confirmed pumpkin pie haters. The best part: anytime someone said they couldn’t possibly have room for dessert, she’d say, ‘Well honey, it’s just air!’”Get the recipe: Pumpkin Chiffon Pie**See the comments there about people fearing raw egg? According to Dr. Aaron Carroll’s wonderful book The Bad Food Bible, the risk of an egg containing salmonella is 0.012 percent. “You could eat one raw egg every week for one hundred years and still have a good chance of never eating an egg with salmonella.” Now give me that raw cookie dough.Photo by Alex LauHappy BirthdaySpeaking of Adam Rapoport, FRIDAY WAS HIS BIRTHDAY. Of course he’s a Scorpio! On Thursday, we surprised him with some custom, vodka-based cocktails (thanks Al!), a song about all of his ...qualities… by Julia Kramer to the tune of Neil Young’s “Old Man,” and a giant cake made by Sohla El-Waylly. It was RIDICULOUS. She made a parsley cake (as in the herb), dehydrated it, and processed it into crumbs to create a golf course grass topping. I mean come on! The cake inside is hazelnut praline and chocolate. Salted caramel buttercream frosting. And there’s a layer of crunchy hazelnut cookies for texture. “I don’t even know if he likes cake,” said Sohla. Happy birthday, Boss!Unnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaWe published a new sweet potato recipe with cute crunchies on Basically this week, which prompted the question: Why do we like sweet potatoes so much? Aren’t potato-potatoes better?“People pretend they like sweet potatoes more because ‘health,’” said Christina Chaey who simultaneously rolled her eyes and did air quotes. “Sweet!” said Amanda Shapiro and Sarah Jampel.“100 to 1 people want potatoes over sweet potatoes,” said the numerically dubious birthday boy. “And don’t even say sweet potato fries—I don’t need to take a time machine to 1980.”“I eat more sweet potatoes because they’re better for me,” said self-knowing Andy Baraghani, “but potato-potatoes are better. I like them boiled, scalloped, creamed, smashed crispy, french fries, potato puffs, chips…”“Sweet pota-” began Priya Krishna before she interrupted herself. “HOW COULD I SAY THAT. TATER TOTS.”“Beggs, what kind of potato-potato?” demanded Carla Lalli Music. “I’d have a sweet P over a russet. Russets are kinda dry and floury. Only good for a baked potato. But I wouldn’t choose a sweet potato over a fingerling, which has so much to offer. You can fry it. Roast it. Chip it. Confit it. Now that’s a potato [Italian hand gesture]. Frankly, some sweet potatoes are better than others. Is there anything better than a Japanese sweet potato? No! A garnet yam plays second fiddle.”Explore Bon AppétitBeggs NewsletterRead MorecookingMake Me This Shrimp Scampi Recipe and I'll Help You Move Into Your Six-Floor Walk-UpBy Alex DelanyrestaurantsChicken Parm Is My Self-CareBy Carey PoliscookingThe Lightest, Creamiest Pumpkin Chiffon PieBy Adam RapoportcookingPut Down Your Knife and Tear Up Your Food By Hand By Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-16", "author": ["Condé Nast", "Alex Beggs"]}