{"id": "abb584d82b702628dff2747bf2e781ad", "url": "https://www.bonappetit.com/story/chicken-kale-rice-recipe", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "This Chicken Recipe Changed the Way I Feel About Restaurant Chicken | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Recipe Changed the Way I Feel About Restaurant ChickenFancy Nancy's roast chicken with schmaltzy rice and kale is irresistible—and surprisingly simple to make at home.By Amanda GabrieleApril 12, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailI don’t often order the roast chicken when eating out. But every now and then, a restaurant menu describes a chicken in a way I can’t resist, and I go for it. That’s what happened in January when I popped into the neighborhoody Brooklyn restaurant Fancy Nancy.There it was on the menu—Nancy’s Roast Chicken, served with kale pan rice and ginger-scallion sauce. It sounded light and healthy, like just what the doctor ordered after a month of holiday meals. My partner and I ordered it to share, and Kris Walker, one of the owners, asked if we’d like to double our helping of kale pan rice. Apparently, this is the move for Fancy Nancy customers in the know.Kris couldn’t have been more right. We devoured the half chicken and every last morsel of that savory, schmaltzy, gingery kale pan rice, and I haven’t been able to stop thinking about it since.The inspiration for this dish came from Jay’s mom Nancy, who used to eat chicken almost every day when she was pregnant. One of her favorite condiments to pair with the bird is a traditional Cantonese ginger scallion sauce, which is punchy and savory and pretty much the perfect complement to the crispy-skinned bird. “She's always been an inspiration for me to become a better cook and a better business owner,” Jay says. “The brick chicken at Fancy Nancy is my way of high fiving my mom.”When Jay makes this roast chicken at Fancy Nancy, he uses a whole spatchcocked bird to get the skin extra browned and crispy. But if you don’t feel like removing the bird’s backbone, chicken legs work just fine. A cast iron pan is your best friend because it delivers even heat and moves seamlessly from stovetop to oven. Jay uses a brick to get an even sear, but it’s not necessary when you’re making this at home. “If you have another skillet or pot, that’s plenty good,” says senior food editor Chris Morocco.While the chicken is resting, the flavor magic begins. Scallions and ginger are cooked with the chicken pan drippings to recreate the Cantonese-inspired condiment that makes this dish so lip-smackingly good. As the sauce cools, the kale and rice go into the pan to soak up the brown bits and remaining saucy liquid. The recipe calls for fresh rice, but if you have the day-old stuff sitting in the fridge, it will heat up great and absorb all the gingery, chickeny goodness too. Morocco also reduced the amount of rice and upped the amount of greens slightly to give the dish a little more green goodness.This dish is easy enough to make on a weeknight, but it’s an equally impressive dish to serve at a dinner party. Best of all, it happens all in one pan, meaning less cleanup and more time to gobble up every last gingery, garlicky bite.Get the chicken:Chicken with Schmaltzy Rice and KaleThe scallion-ginger oil served alongside the chicken and rice puts this recipe over the top.View RecipeExplore Bon AppétitHealthyishroast chickenKaleRiceRead MoreLifestyleThese Braisey Chicken Legs in Coconut Milk Are Almost Too Easy to MakeBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-12", "author": ["Condé Nast", "Amanda Gabriele"]}