{"id": "abba8f1d9516265a93759d300516d6f7", "url": "https://www.bonappetit.com/story/celebrating-spring-with-preeti-mistry", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "How I'm Celebrating Spring | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow I’m Celebrating SpringI’m thinking about my restaurant bucket list and my favorite new recipes from Oakland chef Preeti Mistry.By Sonia ChopraApril 1, 2021FacebookTwitterEmailPhoto by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Hi everyone,Are there restaurants you keep tabs on even though they’re not in your city? Given the nature of my job, it’s probably not surprising that I do this constantly, obsessing over cafés and bakeries, brunch spots, bars, and fine-dining restaurants across the country (and world!). It’s helpful for our work—to give context, to find sources, to tell the best stories possible—but it also means my dining bucket list gets really, really long. For years, Juhu Beach Club, chef Preeti Mistry’s bright, street food-style restaurant in Oakland, topped the list. From the other side of the country, I ogled the menu: pavs and sliders, smoky Negronis made with black cardamom, and a whole section of dosa waffles. Preeti also threw an all-out bash every year for the restaurant’s anniversary, which coincided with the Hindu holiday Holi, and I’d always wanted to go to the party. When the restaurant closed in 2018, I thought I’d missed my chance. Which is why I’m so excited that Mistry agreed to develop a menu of fun and snacky Holi recipes for our April issue, out now on newsstands. (Subscribe to get future issues here!)In normal years, chef Preeti Mistry is known to throw a banging Holi party.\nPhoto by Alanna HaleHoli, known as the festival of colors, spring, and love, is about getting together with friends and family and your wider community. Normally, when there isn’t a global pandemic, people gather in the streets, parks, and other outdoor spaces to play the game of colors, smearing vibrant powder or water on each other. It’s an old and evolving tradition, but Juhu’s Holi parties, to me, always felt like the best of what the festival could be. “As a queer-owned business, we basically co-opted the word love,” Preeti told me when we talked for the story. “Love wins. Love is love. It’s ours. So we get the festival of love.”Below, you can find the recipes Preeti developed for the story. I didn’t get to do a big blowout for Holi this year, but these recipes are ideal for safely celebrating the coming of spring at home.  I’m talking about my new favorite Bombay sandwich, complete with jammy onions and a punchy green chutney (seriously, it’s SO good). The roast chicken wings with an extremely cool burnt masala that replicates a smoky tandoor flavor. And the mango lassi I know I’ll be drinking whenever I can get my hands on ripe mangoes (or canned pulp). They’re spring-y and bright, and I hope they bring you joy this season.Let me know if you try any of them, or if you and your family have your own traditions for celebrating spring. I’m sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorSpringRead Morerecipes7 Holi Recipes to Celebrate the Coming of SpringGallery8 SlidesBy Sonia ChopraRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-01", "author": ["Condé Nast", "Sonia Chopra"]}