{"id": "abc0fbc0602c8ebb08dff2e493b2f90a", "url": "https://www.bonappetit.com/recipe/red-wine-and-soybraised-short-ribs", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Red Wine and Soy–Braised Short Ribs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueRed Wine and Soy–Braised Short RibsBy Sohui KimJune 1, 20194.5(62)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Ayesha PatelEmailPinterestPrintEmailPinterestPrintThese richly flavored ribs are a riff on kalbi jjim, a traditional special-occasion dish. Red wine adds depth and complements the soy and mirin.Ingredients6–8 servings4lb. 2\"-thick boneless beef short ribs or 5 lb. 2\"-thick crosscut bone-in short ribs (flanken style), cut into 2x2\" piecesKosher salt2Tbsp. plus 1 tsp. grapeseed or extra-virgin olive oil1large onion, chopped8garlic cloves, crushed12\" piece ginger, peeled, sliced ⅛\" thick2cups dry red wine½cup mirin (sweet Japanese rice wine)⅓cup soy sauce¼cup (packed) light brown sugar¼mu radish or daikon (about 8 oz.), peeled, cut into 1\" pieces1large egg, beaten to blendShilgochu or gochugaru (coarse Korean hot pepper flakes), sliced scallions, and cooked rice (for serving)PreparationStep 1Season short ribs all over with salt. Heat 2 Tbsp. oil in a small pot over medium-high. Working in 2 batches, cook ribs, turning occasionally and reducing heat if needed to prevent scorching, until browned all over, 10–12 minutes per batch. Transfer to a plate.Step 2Add onion, garlic, and ginger to same pot and cook, stirring often, until softened and lightly browned, 6–8 minutes. Add wine; bring to a boil. Reduce heat and simmer until liquid is reduced by half, 8–10 minutes. Add mirin, soy sauce, brown sugar, and 2 cups water. Return ribs to pot and bring liquid to a simmer. Partially cover pot and cook, reducing heat to maintain a very gentle simmer and adding splashes of water as needed, until ribs are very tender (they should shred easily) and sauce is thick enough to coat meat, 3–3½ hours. Add radish about 1 hour before ribs are done. Remove from heat.Step 3Heat remaining 1 tsp. oil in a large nonstick skillet over medium. Add egg, tilting pan to create a very thin 6–8\" circle. Cook just until set, about 1 minute, then roll up egg into a cylinder; transfer to a cutting board. Thinly slice into ribbons.Step 4Top ribs with egg, shilgochu, and scallions. Serve with rice alongside.Step 5Do Ahead: Short ribs can be made 3 days ahead. Let cool; cover and chill.How would you rate Red Wine and Soy–Braised Short Ribs?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleVery good.  Substituted sake for mirin and increased sugar slightly to maintain sweetness.  Added 2 tablespoons of hot pepper paste for some heat. Also braised in the oven for 3 hours rather than on stovetop (300 degrees).  Removed meat after braising and thickened slightly  sauce using cornstarch.  Then reassembled for the finish.  Great on on basmati rice. AnonymousChampaign, ul2/7/2022Control and P keys will allow you to print.  Getting ready to try today!\nAnonymousLos Angeles1/18/2022Wonderful! This was our second time making the dish and we made some modifications which might be useful :\nSlow cooked in the oven until tender\nSkimmed a lot of the fat\nAdded some balsamic vinegar to increase acidity\nAdded crushed red chilli to provide heat\nThickened with cornflour to make a thicker \nStuart and LouiseMaine11/28/2021This recipe was perfect. I will make it over and over and over again. I halved the recipe for 2 people but I can’t wait to share with friends. ZoeBarcelona, Spain10/6/2021This recipe is absolutely delicious! I recommend doing story fry so the flavor of the beef isn't needing to bring up the flavor of plain rice, but the meat is deliciously tender and juicy, the sauce has a nice thickness for the time they say, and the toppings add a nice pop of color. I would greatly recommend this recipe, as long as you don't mind needing to take a bit of time cooking!Alana V.Glendale, AZ7/20/2021Fantastic recipes. Has become a go to when we have guests over.  Very little on the night preparation, which allows for time with guests. Cannot fail recipe. It has everything. Combines classic French recipe (like the boeuf bourguignon) to some asian flavours.TutFrance4/30/2021Absolutely delicious! Not difficult to prepare, although it is time-consuming (I started prep around 1:30pm and wasn't eating until 6), but the results are so totally worth the effort. Very rich flavor, so I'll save this as more of a special occasion dish, but I will most definitely be making it again.ChristianAkron, OH4/12/2021This is delicious. You can use sherry instead of mirin. Even dry sherry is sweet. And it's what Irma Rombauer used in Joy of Cooking for her sweet and sour ribs. I like this method of cooking better and all round better recipe. But the grocery in my small New Mexican town carries sherry. And it is yummy in recipes. I'm sure it's the flavor the recipe wants. Elvis ErpRuidoso, NM4/7/2021I know it's not obvious but there is a print button that appears on the left side of the window as you scroll down. It's one of three white icons in the small black rectangle. When you position your cursor over one of the three icons, the icon turns yellow. L BodifordAlabama3/16/2021Yes - way past time for BA to add a print button on all recipes. Really!AnonymousLos Angeles, CA3/14/2021Really good! Leave lots of time - I started at 5:30 and we didn't eat till after 9. I had bone in short ribs so I cut them off the bone and used my Le Creuset - didn't have the Korean seasonings so used pepper flakes and sesame seeds at the end and served over linguine mixed with some of the sauce and pasta water. Huge family hit. AnonymousSan Francisco, CA2/2/2021AMEN!!! to below commentDebi RankinMemphis, TN1/12/2021For heaven's sake BA.  Will you please put a print button on all recipes!!??  It's impossible to cut and paste as the BA banner Always ends up in the middle of the recipe.  I am a paid subscriber yet find the web access TERRIBLE to use.\n\nCan you please fix this?  It's been too long waiting...PaulRSan Francisco1/6/2021I’m hoping to make the recipe this week but wondering if there are vegetables and noodles in the photo?SueNorfolk UK12/28/2020Absolutely delicious. Carla MMiami 11/7/2020Explore Bon AppétitRibsKoreanEast AsianAsianShort RibBeefMeatGingerHerbs & SpicesWinterOne-Pot MealsMainDairy-FreeNut-FreeBraiseLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Sohui Kim"]}