{"id": "abc425794b8e97853ba5a43ddd10bea5", "url": "https://www.bonappetit.com/recipe/pine-nut-and-white-bean-dip", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Pine Nut and Bean Dip Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssuePine Nut and White Bean DipBy Janice TiefenbachNovember 19, 20194.2(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintA velvety, light and fluffy white bean dip with sizzled garlic oil on top. Toasting the pine nuts until they’re properly golden brown to the center and not just on the surface is key in coaxing out maximum flavor. That said, pine nuts are expensive and can burn, so keep a close eye on them as they cook. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena, and goes great with this Giardiniera Antipasto Platter.IngredientsMakes about 1 cup¼cup pine nuts¼cup grapeseed or vegetable oil1garlic clove115-oz. can cannellini (white kidney) beans, rinsed1½tsp. kosher salt¼tsp. freshly ground black pepperPreparationStep 1Set a mesh sieve over a small bowl. Heat a small saucepan over medium-low. Combine nuts and oil in pan and cook, swirling often, until nuts are golden brown, about 5 minutes (cut 1 in half to check doneness in the center). Scrape into sieve and let drain. Transfer nuts to paper towels to drain further. Finely grate garlic into oil.Step 2Blend beans, salt, pepper, three-fourths of nuts, and ½ cup water in a blender until very smooth. With motor running, gradually stream in garlic oil; blend until combined.Step 3Transfer dip to a small bowl and spoon remaining nuts over.Step 4Do Ahead: Dip can be made 2 days ahead. Cover and chill. Let come to room temperature before serving.How would you rate Pine Nut and White Bean Dip?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleLove this recipe—I'd recommend not adding the water until you've blended everything once and then check the consistency, if too thick, add water a tablespoon at a time. And not to be THAT commenter, but I swapped the garlic for red chile flakes, fried them in hot oil for 30 seconds or so, and that flavored the dip with a little toasty heat. So easy! Alex BeggsBon Appétit 11/12/2021I wish to respond to the Anonymous 4/11 post. I have found that pine nuts go rancid much more quickly than other nuts. They are both delicate and delicious. How long had those pine nuts been in your cupboard? My instincts tell me they were old and would have tasted awful in any recipe. AnonymousChadds Ford , PA4/25/2021Omg this was SO good! The 1/2 cup water was a tiny bit too much- it made the dip more loose than I wanted.  I also have used this recipe as a pasta sauce, and it was delicious. So easy, fast, delicious, and with minimal ingredients. AnonymousOntario, Canada6/12/2020Not sure what the other reviewers are talking about as this is so delish. It is garicky and nutty and just a great alternative to hummus. To save time, I put the garlic in with the pine nuts. And start with a cold pan with the ingredients to they all warm together. Made this many times and my entire family loves it!AnonymousDC6/12/2020This just tastes bad! \n\nI had some pine nuts and white beans in the cabinet and thought I might give this a try. The result: a dip with a strong acrid, raw garlicky, bitter aftertaste. Disappointed. A waste of time!Anonymous4/11/2020Great smell, but the taste gives up after the first taste. Diced seeded tomato? Oregano? (Pecorino) Romano cheese?acookfromdetroit1/3/2020Explore Bon AppétitDipItalianEuropeanBeanVegetableCannellini BeanWhite BeanPine NutNutEasyQuickStarterSnackVeganVegetarianDairy-FreeGluten-FreeHealthyishSuper BowlDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}