{"id": "abd11c293ec9c0ab2a22641e75304c07", "url": "https://www.bonappetit.com/story/natural-bug-spray", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "This Natural Bug Spray Actually Works | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingHear Me Out: This Natural Bug Spray Actually WorksIt keeps me bite-free wherever I am.By Aliza AbarbanelJuly 23, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I'm always the person in the group that gets eaten alive by mosquitoes, whether I'm hiking in the woods or outdoor dining in the city. The red bites inevitably appear in the most inconvenient spots: fingers, ankles, that one part of my back that I can’t reach. After returning home from a few long picnics and patio dinners with more than my fair share of itchy souvenirs, I made a midsummer resolution to apply bug spray as I do SPF: every time I leave my apartment. But first, I had to stock up.Luckily, an internet friend told me about Kinfield’s Golden Hour, a DEET-free bug spray that uses Indonesian citronella to keep mosquitos away. I’ll be honest: I dabble in natural skincare, but the idea of using natural bug spray had me unconvinced. Avoiding mosquitos, I figured after years of being personally targeted by them, was a job for chemicals. But my DEET-heavy repellent felt too intense for daily use in the city. (DEET, which was developed by the US Army in 1946, is generally harmless, but it can cause skin irritation in high doses and is toxic when swallowed.) The scent alone was strong enough that I didn’t want to apply it indoors, and I don’t have a balcony or patio to pop onto for a quick spray.Thanks to the addition of vanillin and cloves, Golden Hour actually smells good. I’ve even had strangers ask what scent I’m wearing. But more importantly: It works. I’ve tested Golden Hour both in the city and countryside, and so far I’m happily bite-free. (The one day I forgot to apply some while barbecuing upstate, I definitely reaped the itchy consequences.) I spritz my knees, ankles, and other most-bitten areas before leaving the house, and carry the 0.8 oz travel spray in my bag to reapply in case I’m out around dusk. I’ll probably still pack the DEET for serious camping, but now I'm never left in the park after dark without protection. My ankles are grateful.Photo by Emma FishmanKinfield Golden Hour Natural Bug Spray$22 at Grove Collaborative$22 at Thrive MarketExplore Bon AppétitShoppingPicnicSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-23", "author": ["Condé Nast", "Aliza Abarbanel"]}