{"id": "abd22a8ed797e53941e2c45857cfa6ed", "url": "https://www.bonappetit.com/story/samantha-fore-tuk-tuk-sri-lankan-bites", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Samantha Fore’s Roving Pop-Up Is Hooking Americans on Sri Lankan Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSamantha Fore’s Roving Pop-Up Is Hooking Americans on Sri Lankan FoodWith her pop-up Tuk Tuk Sri Lankan Bites, she’s working to make sambol as common as salsa. By  Khushbu ShahNovember 7, 2019FacebookTwitterEmailPhoto by Brian KaiserFacebookTwitterEmailWhen Samantha Fore told me she would pick me up in a silver Honda, I thought I knew what to expect: a comfortable four-door sedan with safety ratings so high that it’s beloved by South Asians across America. Instead, a pickup truck appears curbside at the Bluegrass Airport in Lexington, Kentucky. Sure, it is silver, and it is a Honda, but it’s also a full-blown pickup truck. The kind you see wobbling over rough terrain in television commercials, driven by burly men. Fore, noticing the surprise on my face, shrugs her shoulders and starts laughing. “I am a Southern girl at heart, what can I say?”Fore, 36, is the chef and force behind the popular pop-up Tuk Tuk Sri Lankan Bites. She is based in Kentucky but travels around the country putting on dinners that showcase her upbringing as a child of both the American South and Sri Lankan immigrants. As an adult, certain terms slip out in Sinhalese first, English second, but get her excited and the thicker the gentle Southern drawl that punctuates her sentences becomes. Duke’s mayonnaise and Crystal hot sauce are just as at home in her cupboard as spices like turmeric, cinnamon, pandan leaf, and cardamom.Sam Fore, in her home kitchen.\nPhoto by Brian KaiserThese two identities are the basis for Fore’s pop-up concept, which serves a Sri Lankan menu cooked through a Southern lens. Curried deviled eggs, tomato pie made with a turmeric-spiked crust and tamarind onions, curry meatball sandwiches on Hawaiian rolls topped with onion chutney and coconut gravy are all staples of her menu. Her fried chicken comes with a buttermilk brine but also curry leaf salt. Shrimp spiced with turmeric and goraka (a sour fruit) powder are piled high on a base of coconut-milk-simmered grits for her riff on the classic combo.“If you think about the traditions of Southern cooking and the Southern table, they are very similar to Sri Lankan culture and the Sri Lankan table,” she says of the combination. “Southern cooking is meant for large groups of people. Same with Sri Lankan food. These aren’t just meant for one person.” Fore is also quick to point out that there isn’t just a cultural overlap, but shared ingredients and cooking techniques as well. “Okra was one of my favorite vegetables growing up,” she says. “Whether that was okra curry or Southern fried okra.” Beets and sorghum are common in both pantries too. She even mixes the stark white batter for appam, a fermented rice and coconut milk crepe, with the same technique that she uses to bring together pancake batter.“Most people here aren’t familiar with Sri Lankan food, and I want to change that,” Fore says. “What people really want from a culinary point of view is a common ground. So if I can relate my food to where I grew up, it’s easier for people to accept. You have to give them a gateway.” For Fore, her mission will be accomplished the day that sambol is as common as salsa.Chicken curry\nPhoto by Brian KaiserYou would never guess that Fore has zero professional culinary training, given the confidence and tranquility with which she cooks. I’ve been sitting at the kitchen counter in the home she shares with her husband, Chris, and their brigade of pets (three dogs and two cats) for 30 minutes watching her calmly start on a fragrant pineapple curry—only the second of a long list of dishes she’ll be serving in just two hours. The rest of the menu is no less ambitious: Appam, which she will make to order; a jackfruit dish known as polos; chicken curry; a couple of sambols; and the same tomato pie that often shows up at her pop-up. She is also debating making ice cream, but luckily a dinner guest has offered to bring dessert.Dinner parties like this one, and the brunches she hosted too, are the foundation of her pop-up concept. When Fore moved back to Lexington from Boston in 2012, she whipped up epic monthly Sri Lankan spreads “as a way to make friends,” she admits with a laugh.Her mother FaceTimes in, scolding her for starting so late and reminding her to put salt in the appam batter. Fore rolls her eyes and hangs up, returning to her kitchen, which one could generously describe as “chaotic.” Fore is in the middle of packing up their current house before they move into a bigger space with her dream kitchen (in which she hopes to shoot Sri Lankan cooking videos), and shouts for Chris, asking him if he knows where the lid to the food processor is. Could it be in the garage? Or maybe they accidentally put it in storage. He eventually finds it in a corner cabinet. Fore has prepped nothing the day before, including the appam batter, which needs time to ferment. She throws the chicken she just diced into a crowded pan, even though she knows she “isn’t supposed to do that.” “It just keeps the meat moist,” she says with a sheepish grin.On the phone with Mom.\nPhoto by Brian KaiserHer methods would probably give any classically trained chef an aneurysm, but Fore’s lack of formal training is actually a boon. It has allowed her to become a fearless cook, unafraid of bending tradition and unencumbered by stiff French culinary guidelines. “She doesn’t have any preconceived notions of what food is supposed to look like,” says chef Meherwan Irani. Irani, who owns restaurants in Asheville (Buxton Hall, Chai Pani) and Atlanta (Botiwalla) is a member, alongside Fore, of Brown in the South, a roving dinner series that brings together South Asian chefs cooking in the southeastern United States. “She cooks without those restrictions. Her cooking is honest and homely—not in a bad sense. She has elevated that to something I think a lot of food is going to move towards.”Fore’s entry into the culinary world is atypical to say the least. She spent her college years in Boston, eventually getting a Masters of the Arts in Management from Harvard University Extension School. She graduated in 2010 at the height of the recession, making it practically impossible to get a job.One day she came across an article in the Boston Globe about how much chefs Jamie Bissonnette and Ken Oringer hated the website for their restaurant, Coppa. Though she had no experience building a website before, Fore and Chris (a web engineer and developer) won the bid to redo their site, which launched the couple’s restaurant website building business—something they still do for a handful of clients today.It was during this time that she realized that, while she had taught herself to cook everything from French to Italian food post-college, she didn’t know how to cook the Sri Lankan dishes her mother made for her growing up, the dishes she really craved. So she decided to follow her mother around with a camera phone to capture her recipes, eventually writing them down for herself. Fore started to bat around the idea of opening a short eats place serving Sri Lankan drinking snacks, but it was far too expensive of an endeavor in Boston.Whipping up some sautéd greens\nPhoto by Brian KaiserFore and Chris relocated to Kentucky and continued with their website business, while Fore threw regular dinner parties and brunches. But their routine came to a pause when Chris was diagnosed with stage 3 colorectal cancer. “I stopped cooking for other people and started cooking for him more—curries packed with turmeric and other spices—because I really believe in the combination of Western and Eastern medicine,” she says quietly. It’s the rare moment where her energy feels depleted, as if her blood is actually made of plasma and platelets and not Red Bull. “I could have been a widow at 31.”In the spring of 2016, friends who owned a bar in Lexington but struggled to get a food truck to partner with them, approached Fore and asked if she could cook at the bar for an upcoming event, now that Chris was in full remission. She calculated the costs to purchase the three-sided tent and the ingredients she needed, and threw her first Tuk Tuk Sri Lankan Bites pop-up for a mere $572. She managed to make $750 that night, serving an affordable menu of Sri Lanka-meets-the-South bowls and snacks. (Dishes are rarely over $10 at her concept.)  “I was like, Okay, this must be a one time thing,” she recalls. “But then I did it again, and I made over $700 again.” Soon after, she got a call from chef Edward Lee (on the recommendation of Jamie Bissonette) who invited her to come up to Louisville and do a pop-up at his restaurant 610 Magnolia. From there, Tuk Tuk Sri Lankan Bites took off.Fore has since cooked everywhere from the Atlanta Food & Wine Festival to a takeover event at Chinese-American restaurant Mei Mei in Boston. She can now count everyone from food writer and editor John T. Edge to Padma Lakshmi as fans. Fore is also a regular fixture at the aforementioned popular Brown in the South dinners, which she says is integral to her success. “I found a family,” Fore says. “They are people who get my experiences.” The dinner series has also allowed her to cook in places like Nashville, Raleigh, and Asheville, adding to her list of American cities getting access to Sri Lankan cuisine. Though for Fore, this is just the tip of the iceberg: She hopes to bring her pop-up to every corner of the country.Cashew curry\nPhoto by Brian KaiserFore’s Lexington home is never empty, nor quiet. The door is open to the entire city, it seems, as if she were its culinary mayor. As she starts cooking the appam, her guests start to filter in: a local chef, a tattoo artist, a bartender, members of the tourism board. Also among them is fellow Lexington resident and popular cookbook author Stella Parks. “Sam knows everyone,” she says with a laugh. Parks first met Fore through one of her famed dinner parties, which was also the first time she’d tried Sri Lankan food. “I had one bite and couldn’t believe how delicious the flavors were,” Parks said. In fact, for everyone attending, Fore’s cooking was their introduction to Sri Lankan cooking.Nothing seems to faze Fore, whether it’s the pressure of satisfying a room full of hungry people or her own experience of excruciating physical pain. The first couple of pop-up events took such a physical toll on her that she developed exertional compartment syndrome—an exercise-induced muscle and nerve condition—that required surgery. She has since healed, but even that couldn’t slow her down on her mission to get America to fall in love with the flavors of her heritage.Can’t make her beet curry without turmeric.\nPhoto by Brian KaiserLooking ahead, she hopes to host more Tuk Tuk Lex pop-ups around the country and aspires to write a cookbook and perhaps even host a television show. Fore is also looking for a more permanent spot in Lexington, though she has no plans to open a traditional restaurant. “I never want a restaurant to be my full-time gig,” she admits. “There is just too much out there for me.”Ideally, it would be more like a bar, where she could pop up whenever she wants and serve a menu that costs less than $30 to eat through. “I want everyone to be able to come and try out my food,” she says.She also wants the bar to have a space where other local cooks can incubate new and diverse ideas—affordably. “I would have killed for a space like this when I was first starting up,” she says. At the end of the day, she wants to build an inclusive community, something she hasn’t always been able to find. “Inclusion means not just having a seat at the table, but flipping the table itself,” she says. “To have a seat, you have to fit yourself into molds, and play by the rules. I will always refuse to do that.”Explore Bon AppétitChefsRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Khushbu Shah"]}