{"id": "abd9ee65eb097cd0fa155130a1d8e161", "url": "https://www.bonappetit.com/story/buying-clothes", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "A Shopping Addiction Was How I Escaped Problems Until It Became My Biggest Problem of All | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Escaped My Problems By Buying Clothes Until It Became My Biggest Problem of AllI dealt with stress by compulsively buying clothes. Here’s how I broke the habit. By Alejandra BorundaJanuary 14, 2020FacebookTwitterEmailIllustration by Rachel JoFacebookTwitterEmailOne day in September, just barely past sunrise, I found myself cold and alone on a slate patio in Vermont, staring at my computer screen, obsessing over a $500 pair of boots.It was the morning of a dear friend’s wedding, and my mental state was somewhere south of distraught. There were plenty of healthy, emotionally restorative things I could have done: go for a run in the leafy trees that were staring me in the face; fix breakfast for my friends, still asleep upstairs; write the bride a letter. Instead, I scrolled down a Google search page, my anxious brain fixated on boots I could in no way afford from a shop on the other side of the world.I had endless justifications for exactly why I was about to spend an amount of money that I was pretty sure I didn’t have (not that I was going to look at my banking app to check): I needed to get my fall wardrobe in order; I owned only black boots, so brown ones would be useful; I’d been searching for lace-ups for a year and these were perfect; etc, etc, etc.But the justifications were all cover. The reality was that my life felt completely out of my control. My love life was in shambles; I’d broken up with my long-term partner and fiancé a few months before, and the reality of that loss was only now starting to feel real. I’d worked doubletime for the past year, starting a new career in a new city while simultaneously finishing a PhD that’d dragged on for far too long, and I was exhausted, near the edge of collapse. Simple tasks like feeding myself and sleeping and keeping my clothes clean and the dishwasher emptied felt like weights too heavy to lift. But the boots? They were there for the taking, if only I would enter my credit card number. This one simple, dumb thing I could do. I knew this because I had done it many, many times before, buying beautiful thing after beautiful thing in an attempt to paper over the disintegrating walls of my life with lovely clothes.Putting together an outfit is a concrete project that I can complete even when I can’t manage to feed myself a real meal or sleep anywhere close to eight hours.A few clicks, some auto-filled details, and the boots were bought. I looked up and saw the rustling leaves, the egg-yolk yellow sun. For a moment, I felt the familiar fizzle of success. And, just as quickly, that feeling ebbed as it always did, leaving behind the same despair and panic and loss and fear, like a line of tidal detritus stranded midway up a beach.I looked at the sky and cried—for the science career I’d never have, the city I’d been forced to leave for a different job, for my fiancé. “I can’t keep doing this,” I think I actually said out loud. There had to be something I could grab onto to drag myself up and out of the emotional slosh, to build up some sense of control over my own life. The obvious place to start was to finally, once and for all, escape the shopping habit that had held me hostage for years.For as long as I can remember, I’ve used clothes to smooth the buffeting of the outside world. They’re a tactile thing to care about in the face of despair, panic, loss, or fear—a way to focus my attention away from my spinning brain and back on the physical world. Putting together an outfit is a concrete project that I can complete even when I can’t manage to feed myself a real meal or sleep anywhere close to eight hours. It’s a project I can do well, even when I can’t do anything else to satisfaction. I can build a small, careful message about how I want the world to see me on any given day into an outfit: with a certain sweater/skirt combo I can be graceful and aloof. With a certain pair of boots I go hard and impervious, like I’m wearing a beetle’s shiny carapace. A colorblocked turtleneck and black jeans can work like an invisibility cloak, prompting people’s eyes to skim straight past me—useful in many circumstances.I’ve loved beautiful, and often expensive, clothes since I was a teenager, well before my aesthetic had coalesced (plaid men’s trousers and J.Crew broadcloth coats? Sure, 16-year-old me). I loved them the year after I graduated from college, when I worked a minimum-wage job at a parking lot in Portland. I’d go finger the silky dresses at Frances May on my lunch break, and eventually the gentle-eyed owner sold me a sun-stained frock that had been hanging in the window for 70 percent off. I still wear it.I loved clothes through the post-2008 recession era, when I was in graduate school in New York and discovered sample sales. I’d gleefully dig through the waist-high piles of Demylee sweaters and silk Tucker party dresses and Rachel Comey clogs and Ilana Kohn jumpsuits, swimming in the smorgasbord of cut-rate indie designer goods available everywhere in the city in those grim days. (I was vaguely aware that all these beautiful clothes piled in dusty warehouses represented the disintegration of the economy, but I was too blinded by desire to understand that small businesses, garment workers, and retailers were paying the price). These clothes mostly sat in my closet while I was getting my PhD because acids that splashed all over everything my lab coat didn’t protect.There was a very particular feeling of accomplishment that coursed through me the moment I bought a beautiful thing, a feeling in short supply in my high-pressure, competitive science graduate program. I found this perfect item in the vast sea of the city, I’d think. I didn’t do my chemistry right today, or I did a bad job explaining that calculus concept to my student, but at the very least I could find the most exquisite version of a thing I’d been looking for. That lacy lingerie set from Journelle, bought after I’d made almost enough money tutoring to cover the price? I could wear that, hidden under my clothes, in the lab, and maybe it would give me the hit of adrenalin I’d need to finish that experiment I’d been delaying.I grew up in a family that always had enough, and I got myself to adulthood with only the sketchiest sense of how money really worked. Throughout most of my years of loving clothes, I kept my compulsive spending habits afloat with a combination of side hustles, lucky rent breaks, and a solid cushion of family support, while a grad school stipend covered my baseline needs.Sometimes I’d look at my account balances and get a jolt of stomach-wrenching anxiety. I’d promise myself I’d change. I’d spend a week or two carefully tracking my grocery spending and walking to avoid swiping my Metrocard. But, inevitably, all the tiny scrimping was negated by a dip into the shop next to my train stop after a long, terrible day in the lab, where I’d hunt for a dopamine hit to soothe my jangly brain.Over time, without my really noticing, the stuff I bought got more expensive. The sample sales started to dry up—a signal, sort of, that the industry was getting its production more in line with demand, which is fundamentally a good thing. But it was bad news for someone like me who by that point had spent years living in luxurious fabrics for a discount. And so, thoughtlessly, I kept buying the things I wanted—now more or less at full price.Slowly, then all at once, my cash buffer disappeared.By early last summer, I was exhausted, disoriented, and completely drained of whatever willpower had kept my impulsive buying in check in the past. I was in the new city with that new job, but I’d left behind a mortgage on an apartment in New York, which meant that my new life was financially constrained, to say the least. I lived in a cheap, pee-yellow room in an old, creaky, dilapidated house, furnished with mismatched, ugly-but-functional pieces I’d gotten for free. I had only a suitcase or two worth of clothes. Nothing worked; nothing was comfortable; nothing was beautiful; nothing was stable.The momentary balm of buying stuff smoothed over the existential panic simmering, barely hidden, in my cantering heart.I dove into a pleasure-seeking, experience-thirsty, borderline-manic summer. I bought the things and I did the stuff: back and forth to New York to dance with my best friend until 4 a.m. then bike home in the fluttering dawn light and wake up a few hours later to meet more friends at the beach to surf. A party or an adventure every night in DC. Skateboarding deep into night and waking up to run miles in the hot morning sun.  Waltzing into stores and buying overalls and sparkly bodysuits and beach umbrellas and crop tops and leopard print slip dresses and whatever I wanted because fuck it, I wanted to build a wardrobe as wild and summery and brand new as I felt. The momentary balm of buying stuff smoothed over the existential panic simmering, barely hidden, in my cantering heart.Falling, delirious with exhaustion and desire, into the arms of a rock climber who would lift me into the air like I was nothing, whose body fit around mine like it had been tailored to it, like the single best piece of clothing I could have found at a sample sale: the thing I didn’t know I was looking for but fit me perfectly.The rock climber gave me a tee shirt to wear to work one day after I’d stayed over. Oversized, thick cotton, a cream color I’d never have bought for myself. I found myself wearing it as soon as I could wash it again. I’d wear it with my mustard-yellow Jesse Kamm Rangers, and feel like the me I’d always wanted to be, never mind that last night’s makeup was still smudged around my eyes.Summer was vivid; it was perfect; and by September, on that patio in Vermont, I was drained.I had also built up an amount of credit card debt that made me want to puke.I knew there would be no way out of the mess without a brutal, honest reckoning. So I did the most banal thing on Earth: I made myself a budget.I downloaded an app and imported the last few months of my bank data. As the fields populated, the summer bloomed in front of my eyes: the sweatshirt I bought on a lightning-quick trip to Assateague, the crop top that had prompted the climber to lift me onto his kitchen counter and kiss me urgently. A new pair of pale pink Vans to replace my old pair, their soles worn through by a summer of 2 a.m. insomniac skateboarding sessions.It took me two full days to dig through the financial detritus of the past few months. At the end, I had a line of red numbers telling me that I couldn’t spend money on anything but absolute essentials for the foreseeable future. I also had a sense of clarity that I had never experienced before. This was, I realized, a way to feel in control—the same feeling I’d been looking for while hunting for the perfect sweater, but via saving instead of spending. I check my budget every day. I enter every purchase into the app. I know exactly where every dollar coming into my account is going and when. All this tracking and not-buying doesn’t feel like deprivation or a chore: it feels like focus. The exercise restructures the experience of desire, separating it from the panicky feelings that bubble up in moments of insecurity or stress. What’s left behind is a deeper sense of what I truly want, why, and how badly. I got another pair of those Jesse Kamm pants in a different color, but secondhand, and only after setting aside money for three careful months. My eyes still get starry over swoopy drapes of silk or wool, but the anxious hunger to buy is gone.Budgeting won't stop my mortgage payments from accumulating. It won't make my healthcare premiums any lower. It definitely won't make the industry I'm in any less volatile. But it gives me a tiny amount of actual control—not just the illusion of control I got from shopping.There’s also this: I may regret a lot of the money I’ve spent over the last few years, but I love the things I’ve bought. The bobbles on a heavy merino sweater bring me great joy. The silky lycra of the swimsuit I wear to surf sits smooth and reassuring and unbudging when I jump into the water. Even the most impulsive, impractical summer purchases, the sparkly bodysuit and the white overalls shorts and the socks with pineapples on them, give me a fizz when I see them in the corner of my drawer.Because clothes are about protection and expression, but they’re also my aide-memoires. I met my fiancé wearing a Liberty-print, pastel, flowered jumpsuit. The legs were too long and the waist too short, but it didn’t matter as late afternoon sun flitted across our faces that first day on the teak wood patio outside the lab. The first pair of jeans I ever truly loved (8th grade, Seven for All Mankind, now living in my wardrobe as cutoffs) send me back to Vermont, sitting on a splintery dock on Lake Champlain with my best friend, stars splayed overhead and boats creaking.I especially love those boots. I’ve worn them nearly every day since they arrived. And I don’t regret buying them—not that it wasn’t dumb as hell to do so. They brought about a profound change, and, when I wear them, I remember that.Explore Bon AppétitHealthyishessayRead MoreLifestyleBefore I Could Get Over My Anxiety, I Had to Admit It Was RealBy Kyle BeecheyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-14", "author": ["Condé Nast", "Alejandra Borunda"]}