{"id": "abe33b01613ac5ab80b401453d0dc045", "url": "https://www.bonappetit.com/recipe/grilled-turbot-with-celery-leaf-salsa-verde", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Grilled Turbot with Salsa Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueGrilled Turbot with Celery Leaf Salsa VerdeBy Ignacio MattosApril 17, 2018EmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis recipe originally called for enveloping the fish in fig leaves. They permeate the flesh, giving it a nutty flavor, and serve as both a shield to protect the flesh and a beautiful platter. But we've simplified things so you can grill the fish in a foil packet. Don’t fret if you can’t find turbot. Look out for other flatfish such as Dover sole or flounder. For a long, lazy lunch menu serve this fish alongside sea bream crudo, tomatoes and haricots verts, handmade malfatti, and tiramisù with cookies.Ingredients8 servings 2whole turbot (about 3 lb. each), heads and fins removed, split in half along the backbone1¼cups extra-virgin olive oil, dividedKosher salt8sprigs rosemary, divided1½cups finely chopped parsley½cup finely chopped celery leaves1garlic clove, finely grated½lemon½tsp. Aleppo-style or other mild red pepper flakesFreshly ground black pepperAioli or store-bought mayonnaise (for serving)PreparationStep 1Prepare a grill for medium-low indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side of grill). Tear off 4 large sheets of foil. Rub fish with ½ cup oil (2 Tbsp. per piece) and season with salt. Working one at a time, place a fillet in the center of a sheet of foil and top with 2 rosemary sprigs. Fold in short sides of foil over fish, then fold in long sides and roll edges together to seal.Step 2Place pouches on cool side of grill, cover grill, and cook fish, turning once, 20–25 minutes. Open a pouch to check fish. Flesh should be slightly opaque and the tip of a knife should slide through easily. Grill a little longer if needed.Step 3Meanwhile, combine parsley, celery leaves, and garlic in a medium bowl. Finely zest lemon into bowl, then squeeze in juice. Add red pepper flakes and mix in remaining ¾ cup oil; season with salt and black pepper. Let salsa verde sit 10 minutes for flavors to come together.Step 4Transfer fish to a platter and serve with salsa verde and aioli.How would you rate Grilled Turbot with Celery Leaf Salsa Verde?Leave a ReviewTell us what you thinkExplore Bon AppétitFishSeafoodSoleFlounderCeleryVegetableEasyMainGluten-FreeNut-FreeKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}