{"id": "abe514f76777d637db7e6af38b17c808", "url": "https://www.bonappetit.com/recipe/grilled-mushroom-antipasto-salad", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Grilled Mushroom  Antipasto Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueGrilled Mushroom  Antipasto SaladBy Brad LeoneJune 2, 20205.0(12)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrint“Mushrooms turn into crispy, smoky flavor bombs on the grill,” says Brad Leone. “I keep them in big pieces so they don’t fall between the grates. This dish is basically grilled antipasto. Easy, hearty, and it can stand up to the hot weather if you make it ahead and it’s sitting there on the picnic table or whatever.”Ingredients4–6 servings2lb. assorted mushrooms (such as crimini, shiitake, and/or maitake), wiped clean, trimmed, torn into big pieces if large7Tbsp. extra-virgin olive oil, dividedKosher salt2Tbsp. Champagne vinegar or white wine vinegar1tsp. Aleppo-style pepper1tsp. dried oregano1garlic clove, finely grated2oz. Parmesan, shaved½cup Castelvetrano olives, coarsely chopped¼cup drained Peppadew peppers in brine, coarsely choppedPreparationStep 1Prepare a grill for high heat. Toss mushrooms and 3 Tbsp. oil in a large bowl to coat. Grill, turning occasionally with tongs, until lightly charred, 2–6 minutes (depending on size and type). Return to bowl; season with salt.Step 2Whisk vinegar, Aleppo-style pepper, oregano, garlic, and remaining 4 Tbsp. oil in a small bowl to combine; season vinaigrette with salt and black pepper. Pour over mushrooms and toss to coat. Add Parmesan, olives, and Peppadew peppers; gently toss to combine.How would you rate Grilled Mushroom  Antipasto Salad?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleWe loved this so much as a summer side dish that we could have made it our meal. Great flavors. We live in rural America and couldn't find an Aleppo pepper and it was still excellent.JAHSturgeon Bay, WI7/14/2021So good. We have made it a few times already. Yum.AnonymousGlenville8/26/2020Successfully roasted these in an oven when propane tank out last minute!   Also subbed 1 lb of baby Yukon gold potatoes for mushrooms as I didn’t feel like spending $50 on mushrooms!   Excellent flavor and tastes even better day after. AnonymousWarwick, NY8/5/2020This is an amazing recipe that we have served both as a salad and on grilled bread as an appetizer.  We have used multiple different kinds of mushrooms, but always a base of Cremini, Shitake and Oyster.  We've added Lion's Mane and others, but they tend to disappear.  Regardless it's a HIT!AnonymousSimsbury, Connecticut8/2/2020An excellent recipe that will hold up to bold main dishes. I grilled the mushrooms on a Traeger pellet grill and think the wood smoke added a very nice flavor! I did add a splash more of champagne vinegar to balance it out to my taste.\n\nWill definitely use as a base recipe to pivot off of!PTW90Virginia7/12/2020This was great. Try not to make it in a pan as I did bc the mushrooms will get watery. Vinaigrette spice plus parmesan with peppers - lots of flavour!mumslittlehelper6/25/2020Oh my goodness-another fabulous not-too-fussy vegetarian side dish-thank you Brad! This dish packs in all the tangy, smokey and spicy flavors that make you want to savor every bite. Perfect for an outdoor summer gathering. This, along with Brad's Miso-y Grilled Potatoes recipe has made it into my family's favorite side dishes.gpinczowKirkland, WA6/19/2020Explore Bon AppétitSaladItalianEuropeanMushroomVegetableOliveOther IngredientsAleppo-Style PepperHerbs & SpicesParmesanCheeseSummerSideNut-FreeGluten-FreeVegetarianKetoHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}