{"id": "ac0e682085b289cc151a96d952a628c1", "url": "https://www.bonappetit.com/story/mothers-day-masala-chai", "year": 2019.0, "month": 5.0, "day": 2.0, "content": "All I Really Want for Mother’s Day Is to Be Alone With This Masala Chai | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll I Really Want for Mother’s Day Is to Be Alone With This Masala ChaiMake me a cup, then please leave.By Carla Lalli MusicMay 9, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.A wise man (I mean, my therapist) once told me that Mother’s Day is not a day when I’m supposed to make my mom feel special. It’s actually a holiday designed for my husband to make ME feel special. I feel less guilty already!That said, Dear Husband, the rules for this Sunday are simple. Don’t wake me up. Don’t make me go to brunch. Don’t watch me eat breakfast in bed. Instead, the minute my eyes delicately flutter open on their own, bring me a cup of my own recipe for masala chai tea. And then leave, because I would like to enjoy the quiet time.Want this letter before it hits the website? Sign up for our newsletter!I’d also like to be alone with the tea because I actually don’t really enjoy sharing. I think that most mothers—after sacrificing their bodies, their sleeping hours, and their sanity—will agree that sharing, in general, is overrated. So just put the tea down on the bedside table and walk backward out of the room. Quietly.This masala chai has intense nostalgic value for me, but all mothers will love it. It is richly caffeinated—moms love caffeine. It is sweetened, but not too much, and it’s spicy from fresh ginger—a reminder that life as a mom is sweet but there’s also a kick. Or actually there’s a catch, which is that being a mother means being plagued by worry and having to accept the fact that the people you created may sneeze directly into your mouth when they’re sick. Spicy indeed!Making the masala chai takes 15 minutes, so the mother in your life will know that you made an effort, which is a thoughtful acknowledgement of her work. It would be nice if the children prepared cards expressing adoration, but it is more important that you preheat the cup by rinsing it with hot water so that the tea stays hot longer. When she’s finished with her tea, she’ll let you know. Until then: volume down please. It’s the mother’s day.Get the recipe:BA's Best Masala ChaiView RecipeExplore Bon AppétitCarla NewsletterMother's DayRead MorecookingMake This Strawberry-Granola Crisp for Mother’s DayBy Deb PerelmancookingThe Mother’s Day Steak I’m Making My Mom, the Only Gift That MattersBy Christina ChaeycultureIt Never Occurred to Me to Have Cooking Shoes, Now I Can’t Cook Without ThemBy Alex BeggscookingWhite Pesto Is The Easiest Dinner You Will Make This WeekBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-09", "author": ["Condé Nast", "Carla Lalli Music"]}