{"id": "ac1c3789349d7013dac7cd99c2132caf", "url": "https://www.bonappetit.com/story/vaquero-taquero-quesadilla", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "I’m From Texas and The Best Quesadilla I’ve Ever Had Is at Vaquero Taquero | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI’m From Texas and This Is the Best Quesadilla I’ve Ever HadWe can all thank Vaquero Taquero in Austin.By Priya KrishnaJanuary 27, 2020FacebookTwitterEmailPhoto by Hayden SpearsFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Imagine a quesadilla that’s more like a taco with an armor of cracker-crisp golden Oaxaca cheese welded around it. This kind of quesadilla is called a costra de queso, and it’s now the only way I want to eat quesadillas (and I’m from Texas!). You can find it at Vaquero Taquero, a popular food truck turned brick and mortar spot in Austin.Owners (and brothers) Daniel and Miguel Cobos borrowed the technique from taquerias in Monterrey, Mexico—the two grew up in the Rio Grande Valley, right along the border. Their quesadillas give you both a hard and soft shell taco in one. You can choose from a variety of meaty fillings, from al pastor to steak (please appreciate the cartoonish animal heads that illustrate these options on the menu), but the pro move is to get the nopales. The nubs of cactus are sautéed with smoky salsa macha on the griddle to give them heat and crunch and depth without any of that gooeyness often associated with the vegetable. Then the nopales-salsa mixture is punched up with some sweet corn before going into the quesadilla.No matter which filling you go for, get your order “con todo,” with a tangy, Frank’s Red Hot-esque salsa roja; avocado crema; cilantro; onions; and—because why not?—even more cheese.Go there: Vaquero TaqueroExplore Bon AppétitHighly RecommendRestaurantsAustinRead MorerestaurantsMy Favorite Tacos in Mexico City Come Out of a Meat JacuzziBy Rachel KartenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-27", "author": ["Condé Nast", "Priya Krishna"]}