{"id": "ac217993c8c56427962561e19053bba9", "url": "https://www.bonappetit.com/story/promises-and-perils-of-popups", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "The Promise and Perils of Running a Pop Up Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Promise and Perils of Running a Pop-Up RestaurantThe pandemic has led to a boom in creative and deeply personal pop-ups. But they’re more complicated than they seem.By Mahira RiversOctober 18, 2021FacebookTwitterEmailIllustration By Allegra LockstadtFacebookTwitterEmailOn February 14, around 5 p.m., Brian Bornemann was finally ready to plate the vegan Caesar salad in his five-course Valentine’s Day dinner menu. Presale tickets for the event had sold out, plus the host for the night saved some tables for walk-ins. Bornemann nervously eyed the wood for the grill and counted the boules of crusty bread again, hoping that he and his partner, Leena Culhane, had brought enough. When he reached for the garnish—an umami-rich furikake that’s an integral part of the salad—Bornemann realized that he forgot to pack it. So he quickly hopped in a car to pick it up. This never would have happened if he was cooking out of his own kitchen space instead of popping up on a friend’s patio. As the former executive chef of Michael’s in Los Angeles, Bornemann never thought he’d be drifting from one venue to another with a cooler of ingredients—and only a weekend to get it right.But when the pandemic put Bornemann out of work, that’s exactly what he did, with the help of Culhane. The couple created a concept grounded in high-quality raw fish preparations and called it Crudo e Nudo. They knew it would be hard work, but any work was welcome at the time. “We just saw an opportunity,” Bornemann says. The low barrier to entry and the appealing limited nature of the pop-up model has been a gift to enterprising restaurateurs over the past year, but the fast and loose circumstances that are so conducive to pop-ups can also leave them vulnerable. “Every pop-up we did…was a handshake and a look in the eye and you just had to hope for the best,” Bornemann says. “It is a very precarious thing.” For every consideration that might make a pop-up successful, from choosing a partner to negotiating the contracts and managing logistics, there is an equal share of risk.One of the most consequential decisions for a pop-up vendor is finding a host for the event. These collaborations work best when they are mutually beneficial, and the pandemic presented an abundance of such circumstances: Some bars, for example, couldn’t stay open as essential businesses in cities like Los Angeles unless they offered food, which was the perfect opening for a roving operation like Crudo e Nudo. But despite even the best intentions, and because the rationale to establish a pop-up is sometimes rooted in necessity, there can be an unsettling power dynamic.This is perhaps most apparent when a pop-up vendor partners with a landlord, who may have different objectives in the outcome of a pop-up. “At the end of the day, a landlord’s business model is centered on getting maximum revenue from their space,” says Nick Wiseman, who ran a Middle Eastern rotisserie chicken pop-up, Little Sesame, in Washington D.C.; it was an extension of the existing fast-casual concept by the same name. Wiseman and his business partners chose to collaborate with a friend in the industry and fellow business owner specifically because both sides understood the challenges of running a food business. “If there were scheduling issues or things happening in the city out of our control, we both shared that downside together.”In some cases, the host, landlord or not, might not have the relevant knowledge to be an effective partner. Nobody can know the ins and outs of operating, say, a transient raw fish bar like Crudo e Nudo better than the ones doing the work. Which is why having conversations up front to lay out the terms is crucial. “Some hosts wanted all the control,” Bornemann says. “They wanted to be involved in the pricing, the size of certain dishes, and even the ability to critique dishes.” In those cases, Bornemann and Culhane decided to walk away from those deals rather than risk a contentious partnership. The pair also kept a full calendar of events as a general safety net in case an event didn’t turn a profit. “If anything ever went south, we knew we had another pop-up booked in a day or two.”It’s not just a question of being successful but being able to do it at our pace in terms of life balance.Food halls are a useful comparison because they are similarly structured as a host and vendor partnership and because a restaurant’s best practices don’t always line up with the requirements of running a stall. Margaret Pak and Vinod Kalathil started their South Indian pop-up Thattu as a stall at the Politan Row food hall in Chicago. The gig was great for brand-building, but the amount of work didn’t justify the profits in the end. Pak and Kalathil were obligated to staff the stall all day, even though the bulk of their sales were made in quick bursts at lunch and dinner. They also had to stick to the same menu, which would provide consistency for customers but was creatively stifling. Ultimately, the experience made the flexibility of a pop-up model that much more appealing. After just nine events, they have earned almost as much as they did over 10 months of full-time food hall vending. “It’s not just a question of being successful but being able to do it at our pace in terms of life balance,” Kalathil says.Managing liability is another important part of running a pop-up, whether it’s specifying payment terms after an event or planning for worst-case scenarios like property damage or personal injury. “There are always risks that carry financial implications in any type of startup business,” says Michael Farhi, a partner at the law firm Kates Nussman Ellis Farhi & Earle, LLP, who practices business law. “Laying out the basic terms in writing in the beginning is always the best protection.” And yet, most pop-up partnerships are actually formed over handshake deals. For Pak and Kalathil, everything was done verbally, but working with friends in the industry was the surest way to minimize the risk of a bad deal. Bornemann and Culhane made up for the lack of a contract by showing up to each event with a valid food handler’s license and general liability insurance.Informal agreements are ubiquitous in part because pop-ups are so swift and scrappy, but also, contracts are an imperfect tool that require time and money to enforce—scarce resources for vendors. Yana Gilbuena started out as a pop-up vendor in 2013 when she famously staged 50 Filipino kamayan dinners in 50 states for an event called SALO Series. At one dinner, Gilbuena recalls paying out of pocket to cover a slew of unexpected charges from the host, like payment processing fees, plus food costs for a number of unplanned guests. The unexpected charges went against the contract Gilbuena had for that event, but rather than hire a lawyer, she decided to just move on. “I had a choice to expend the energy and time or I could just focus on learning from my mistakes.” Ultimately, the evening cost her more money than she made.Over the past year, countless hosts have opened their spaces to brand new pop-up concepts in support of the many restaurant workers who lost their jobs in the pandemic. This proliferation of impromptu cottage businesses and ever-changing rules increased the risk of being shut down by health inspection officials. Sara Valdes has been hosting pop-ups at her eponymous corner store, Sara’s Market, in East Los Angeles since 2017. But last summer, two pop-ups at Sara’s were shut down by the Department of Public Health for the apparent violation of local vending laws. In both cases, all the food from the event was trashed. “We try to do as much as we can to help them,” Valdes says. “We’re just trying to survive during the pandemic.”Hosts themselves have a unique set of risks to consider as well. Tommy York is the owner of a specialty food store and café in Ann Arbor, Michigan, called York, which has hosted close to 100 pandemic pop-ups. Recently, someone working on a pop-up was injured while breaking down equipment from an event. Fortunately, it wasn’t a major accident, but there was emergency medical care involved and no concrete plan. “If someone gets hurt, who’s on the hook?” York says. Because of that incident, he is working on the terms of a contract that would address this kind of situation. York has also had to deal with the messier aspects of crowd control as people wander around at night with drinks in hand onto parts of his property that aren’t covered by the liquor license. “We’ve had the neighbors get a little cranky, and I have to go over and say, ‘Sorry about that.’”After a tough year like the last one, the associated risks of a pop-up clearly couldn’t deter from the benefits: the freedom to pursue a passion project, stay working and earn some money, and cultivate a community—all mostly on one’s own terms. Plus, it could be a launchpad for something bigger. Bornemann and Culhane recently opened Crudo e Nudo as a full-service restaurant and seafood market on Main Street in Santa Monica. They now have the luxury of full-size refrigerators and kitchen prep space, control over the customer experience, and a much-needed liquor license. Starting out as a roving pop-up concept was an integral part of the journey and a fast-track to building a business, but settling down has its benefits too. “Honestly, we don’t miss much about pop-ups—we have so much more control in our own space,” Bornemann says. But there were invaluable lessons learned along the way. For Culhane, the process highlighted just how rewarding it is to build a community. “This is all about connecting, that’s why we do what we do.” Now, the couple are able to welcome their guests with the assured hospitality and consistency of a traditional restaurant. And the furikake is always within arm’s reach.Explore Bon AppétitRestaurantsRead MorerestaurantsMy Career in Restaurants Taught Me What Local Government Really NeedsBy Francesca Hong cultureWant to Join These Dinner Clubs? Slide Into the Chefs’ DMsBy Bettina Makalintalculture9/11 Brought NYC Restaurants to Their Knees. 20 Years Later, They Face a Different CrisisBy  Peter KaminskyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-18", "author": ["Condé Nast", "Mahira Rivers"]}