{"id": "ac23d14934b472cd6d4bdd4afd1aad21", "url": "https://www.bonappetit.com/story/keto-diet-lessons", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "The Keto Diet Crushed My Soul But Taught Me One Good Thing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Keto Diet Crushed My Soul But Taught Me One Good ThingIt was extreme, socially alienating, and challenged a long-held fear of mine: eating fat.By Molly Guinn BradleyOctober 29, 2018FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailLast fall, without warning, I announced to my boyfriend three words that no one wants to hear: “I’m going keto.”I’d been feeling sluggish, lumpy, and generally out of sorts. I’d put on the requisite few pounds you do in the first giddy year or so of dating, and while the power of love is such that you don’t really mind, the power of oppressive body norms is such that you also kind of do. Moreover, I was woefully aware that woman cannot live on Indian takeout alone.I remembered that a friend of mine had once sung the praises of keto for a couple reasons: (1) it made him feel a hell of a lot better, and (2) he lost unwanted weight in the process. And so, lying in bed, polishing off a pint of ice cream I figured I’d better get rid of before I made any moves toward better health, I began my research.Introduced in the 1920s as a treatment for epilepsy and currently used as a means of establishing dietary superiority over everyone you know, the ketogenic diet is a way to force your body to burn fat instead of carbohydrates, ordinarily its go-to source, as fuel. In theory, the benefits include more plentiful and stable energy throughout the day, a more satisfying fullness after each meal, and a merciful escape from the blood-sugar rollercoaster that many people—myself included—typically ride on a sugar-rich diet.To get your body into ketosis, you cut your carbs down to a maximum of 20-25 grams per day, filling out the rest of your daily calories with a little bit of protein and a lot of fat. Carb-wise, that means about a slice of bread at most—and frankly, if you’re looking to make it as painless as possible, you’ll omit the bread and save your carbs for those that come with vegetables, nuts, and seeds. The rest of your meals will be composed of fat-rich foods: eggs, cheese, butter, bacon, steak, you name it. If you’re vegetarian, as I am, you’re looking at mostly eggs, oils, and cheese. If you’re vegan, I’m so sorry.The diet is extreme, strict, and socially alienating. It would be a significant lifestyle change, and it would mean challenging a long-held fear of mine: eating fat. As a woman—specifically, an American woman raised in a world where the only acceptable body to inhabit is one that is slim and well-dressed—I’ve been programmed from girlhood to fear rich, fat-laden foods almost as much as I’ve been conditioned to love exercises that tone my muscles without making them bulky.But, for better or worse, when it comes to personal challenges, I behave the way Marty McFly does when anyone calls him chicken: I take the bait.NovemberConveniently, the day I begin my keto journey is a week before Thanksgiving, which I am to spend with my family in Massachusetts.My dad is vegan and my sister doesn’t eat meat. My mother, an omnivore, has always been gracious and flexible, cooking alternatives for my father or eating whatever bean-based concoction my dad has made. Family dining has never been anything but harmonious.And then I ruin everything.I call my mom to tell her about my dietary restrictions. “Let me get this straight,” she says. “No sugar. No carbs. No potatoes?”“Tragically, no.”“How about sweet potatoes?”“Those are also potatoes.”“But meat is okay?”“I’m vegetarian, Mom.”There’s a weighty pause. “I’ll figure it out,” she says, all business, and hangs up.And she does. We have walnut and beet dumplings, puréed cauliflower masquerading as mashed potatoes, something that is probably tofu?, an improbable amount of mushrooms. For dessert, I make a lemon-almond cake with almond and coconut flours that, despite its approximately twelve whipped egg whites, refuses to rise, devastated by the absence of glutinous flour. Flat as it is, it tastes fairly good. It’s the most bizarre Thanksgiving we’ve ever had.DecemberFor almost a month, I’ve managed to skirt invitations to dinners (famed Roberta’s pizza, pasta temple Lilia, arepa joint Caracas) and resist ordering takeout from my go-to spots (Agra Taj Mahal, M. Noodle Shop, Oasis Falafel). I’ve cobbled together a wide variety of meals: broccoli and tofu with peanut sauce, peppers and tofu with peanut sauce, zucchini and tofu with peanut sauce. I’ve even figured out how to make a mushy yet delicious cauliflower-crusted pizza. And when I’m too tired to cook, there’s always the option of just setting a block of cheese on a plate and going to town. Finally, I have permission to eat what everyone truly wants: literally as much cheese as my stomach will hold down. I feel liberated.There’s one big problem though: Running sucks.I have been a regular runner since I was seventeen—not competitively, but my routine is what’s held my sanity in place in the toughest of times. On keto, sans carbs, my muscles are groggy and leaden, pleading with me to stop every step of the way.“I thought my body was supposed to become an ultra-efficient fat-burning machine,” I say through a mouthful of flaccid zucchini noodles to the few friends I’ve told about my endeavor. “What gives?”“I don’t think I could even get out of bed without carbs,” says one friend.“Yeah, I think I’d just die,” says another.I swallow my mouthful of carbless noodles and thank my friends for their helpful advice.Over Christmas, I rediscover full-fat cottage cheese. “This is so exciting!” I exclaim to my parents. “I can eat as much of it as I want!”They exchange a look.“You’re an adult,” my mom says simply.“I can’t stop you,” says my dad.I take this as their blessing.Cottage cheese becomes my always breakfast, and my occasional dinner. I take a subtle litmus test of my colleagues’ feelings about it becoming my lunch too. “Hey, would it be weird if I ate straight from a tub of cottage cheese at lunch?” I ask. The vote is a unanimous Yes and please don’t.JanuaryI head to Vermont for a weeklong writing residency. I haven’t yet decided whether I’ll cheat on keto while I’m up there, but what I do know is that I do not want to discuss this regime with any of the people I’m about to meet for the first time and to whom I would like to come across as a very Chill and Normal Human Being, rather than an unnecessarily high-maintenance dining companion.It goes well—until we discover that the cafeteria serves local homemade ice cream. I look on sadly as my new friends load their bowls. “Want some?” someone asks, proffering their bowl. “It’s too cold for ice cream,” I reply, fooling no one.The truth, actually, is that for the past month or so that I’ve been keto, my body has felt like it’s burning up. Which must, I think, be good—except that as a person with a natural complexion already on the pinkish side, I am now consistently vaguely red-faced and a little sweatier than usual. This is not even to mention the nights, during which I seem to be performing Pilates in my sleep, waking up consistently on soaked sheets.My boyfriend seems to have resigned himself to having a small blast furnace for a girlfriend, probably because he is verbally contractually obligated to love me.In the meantime, I’m beginning to feel like my sacrifice is for naught. My food pyramid is now more of a blob. I still feel like I’m dragging a toddler by each ankle when I go for a run. I wonder how long you can go without fruit before you get scurvy.At the end of January, my boyfriend and I travel to Asheville for his birthday. We’ve got one night in this town brimming with good food, and we want to spend it well.“I think I want to cheat tonight,” I say, and when evening rolls around, we make a beeline to a well-reviewed pizza parlor.I am trembling with excitement as we order and wait for our pies to arrive. And then they do.I don’t know how to adequately describe what it’s like to sink your teeth into a soft, yeasty hunk of pizza crust after three months without eating any kind of bread. What I can say is that it is in this very moment—with the crust just beginning to dissolve into sweet, sweet glucose on my tongue—that I know in my heart of hearts that I am done with keto.I begin a “gentle” reintroduction to the world of carbs. I eat a huge bowl of granola and yogurt. I buy a sandwich at lunch. For dinner, I have the first taste of pasta I’ve had in three months, in a heaping bowlful.My stomach churns and burns after meals my first week post-keto. I start to worry that I’ve permanently altered my gut’s digestive abilities The thought makes me panic. I see a lifetime flash before my eyes, a future of having to covertly tug at someone’s sleeve at restaurants and gatherings and dinner parties and whisper, “Excuse me, are there carbs in this?” I picture my last meal: my boyfriend spooning soggy cauliflower pizza into my mouth as I lie on my deathbed, too weak to protest. (A word of hard-earned wisdom: if you can eat it with a spoon, it is decidedly not pizza.)And then, after a week, everything goes back to normal, and it’s almost like I did not spend the last few months systematically polishing off dozens of tubs of cottage cheese.But going keto did give me one thing: It made me eat almost exclusively the very foods I used to fear and in doing so it healed my relationship with fat. That is to say, it healed my relationship with delicious, nutrient-rich foods that are integral to a healthy and well-rounded diet. Even if you’re not burning it as your primary source of fuel, as you do in ketogenesis, your body needs dietary fat: it provides you with essential fatty acids that allow you to store energy, insulate yourself, and protect your vital organs. Your body can’t do it alone.Now that I have resumed non-restrictive eating habits, I find I’m so much more relaxed around food in general: less wary of what effect certain ingredients might have on my body; less anxious about making food choices; and less withholding toward my body, and myself. I will not be going keto again, but I’m actually glad I did.Explore Bon AppétitHealthyishLifestyleTrendsRead MoreLifestyleWhat Is This Keto Diet You Keep Hearing About, and Is It Healthy?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-29", "author": ["Condé Nast", "Molly Guinn Bradley"]}