{"id": "ac2777f96ddd72875f94429cbebb263b", "url": "https://www.bonappetit.com/recipe/lamb-keema-tacos", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Lamb Keema Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueLamb Keema TacosBy Rachel GurjarAugust 10, 20214.6(33)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintKeema, a ground meat stew originating on the Indian subcontinent, is traditionally served solo or used to stuff samosas and naan. Here, associate food editor Rachel Gurjar uses it as a taco filling, fragrant with ground lamb, tomatoes, onions, garlic, and spices. You can make the keema a day in advance and save any leftovers to spread between buns for a sloppy Joe–style sandwich or serve with rice for another quick weeknight meal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonCitrus Juicer$7 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients8 Servings3Tbsp. extra-virgin olive oil4garlic cloves, finely chopped12\" piece ginger, peeled, finely chopped2bay leaves2tsp. cumin seeds1medium white onion, finely chopped, plus more for serving2Tbsp. ground coriander1Tbsp. plus 1½ tsp. garam masala1Tbsp. paprika½tsp. ground cloves½tsp. turmeric powder1cup tomato purée2lb. ground lambKosher saltJuice of ½ lime1Tbsp. finely chopped mint½cup finely chopped cilantro, plus sprigs for servingWarm small corn or flour tortillas, crema fresca or sour cream, and lime wedges (for serving)PreparationStep 1Heat oil in a medium Dutch oven or other heavy pot over medium. Cook garlic, ginger, bay leaves, cumin seeds, and 1 onion, stirring occasionally, until onion is translucent and edges are golden brown and spices are fragrant, about 5 minutes. Add coriander, garam masala, paprika, cloves, and turmeric and cook, stirring often, until spices are fragrant, about 2 minutes.Step 2Mix in tomato purée and cook, stirring occasionally to keep from burning, until thickened and starting to stick to bottom of pot. Add lamb and break into small pieces, then add 1 cup water. Season with salt and stir to combine. Cover pot and cook until lamb is cooked through and tender, about 20 minutes (some of liquid will have evaporated).Step 3Stir lime juice, mint, and ½ cup cilantro into lamb mixture. Build tacos with keema, tortillas, crema, cilantro sprigs, and more onion; serve with lime wedges for squeezing over.Do ahead: Keema can be made 1 day ahead. Transfer to an airtight container and chill.How would you rate Lamb Keema Tacos?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI've made this keema recipe twice now, and really love it. It's pretty easy, and packs a flavor punch (if you make it right). I do think that some of the quantities are off in the recipe here -- as some have noted, the recipe in the magazine said 1 lb of lamb, while this says 2. I've made it both ways now and 100% recommend either using 1 lb lamb or *doubling* the spice mixture. Some have also said double the onion and it makes it sweeter. I also don't use corn tortillas, but rather make Andy's super easy flatbreads and use it more like I would naan. Erin L.Brooklyn, NY12/3/2021So incredibly tasty, and a ton of flavor. They definitely are sloppy joes on a tortilla, so the second round I just put it in a bowl and dipped a rolled tortilla with it. It was quick, easy, and everything I wanted out of this meal.MeghanHouston, TX11/7/2021Very good flavors. This is a keeper\n\nFollowing are the recipe changes I made; a number of them were suggested in other comments:\nUsed 1 lb ground lamb instead of 2 (note that I DID NOT half other ingredients)\n6 cloves garlic instead of 4\nChicken broth instead of water\nCooked lamb ahead, drained, and reserved grease\nUsed lamb grease instead of EVOO to cook onions, garlic, etc\nAdded 4 diced Calabria chiles (from jar)\nReduced on simmer for 20-25 minutes to thicken\nWe added shredded lettuce in addition to raw onions and Greek yogurt for serving.\n\nThe only other change I would make is to 1/2 the cumin seeds, as cumin flavor dominates a bit.MarkOlmsted Falls, OH10/22/2021Wonderful flavors just as is. We ate it just like chili with yogurt and cheddar cheese on top!LynneMorgantown WV10/7/2021Delicious, but kind of a mess.\n\nThe keema was pretty simple to whip up without too much effort and tasted great. But it has the consistency of sloppy joe filling, and putting that into a soft taco shell just did not work. The tortilla just isn't absorbant or watertight enough to hold the fillings.\n\nDoing it again, I'd season it a little more heavily and either serve over rice, or if I was committed to the fusion thing I'd put it into a burrito with rice.AnonymousSeattle, WA10/7/2021The flavor was great.  Love the mix of spices.  But next time I will cook the the ground lamb separately and drain its fat before mixing it with the rest.  I also didn't love the taco and wonder what else I could have put it on.  AnonymousNew Canaan, Ct10/5/2021Super delicious and easy. I couldn't get lamb and used a combo of ground beef and pork. Go slow browning the aromatics and spices. Made a huge vat that will be even better tomorrow.Anonymous9/15/2021BA is 2/2 for great surprises on this meal prep day. My local TJ's didn't have lamb so I got pork instead, and stuck to 1 lb. This worked out well as with less meat, the spice ratio seemed to be perfect. I did use all the herbs as other commenters have suggested, and used veggie broth instead of water. Because there was less meat it only needed to sit on the stove for about 10 minutes rather than 20. Beautifully flavored end result. BilliePittsburgh, PA9/5/2021Wasn't for us - the crema was the best part which says a lot. I could see where we were going with this, but the texture / lack of punch makes it blandAnonymousChicago9/4/2021This is a keeper. As others have stated, do not skimp on the herbs, and I would actually add some more onion to make it a little sweeter. This is the same as the magazine version (that I followed), but for this recipe adds mint (which I did), and doubles the rest of the ingredients. Frankly, it was so good that I wish I would have used this version rather than the magazine version to have plenty of leftovers. :)ShawnIndian Beach, NC9/2/2021This recipe is different than what was in the magazine (1 lb of lamb instead of 2)- any rec as to which I should use?MaddieWashington, DC9/1/2021This was so easy and delicious. Don’t skimp on the herbs and lime juice at the end. We had it with Greek yogurt and pickled onions on corn tortillas. It would make a great lettuce wrap on warm evenings. AmyNapa8/19/2021quick and easy packed full of flavor! homemade tortillas is key.Lassenorway8/14/2021Explore Bon AppétitTacoIndianSouth AsianAsianGround LambLambMeatGingerHerbs & SpicesCanned TomatoTomatoVegetableCilantroEasyWeeknight MealsMainNut-FreeGluten-FreeSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Rachel Gurjar"]}