{"id": "ac32e20fc7eca7e4e9592b7846eeb78d", "url": "https://www.bonappetit.com/story/ingredients-instead-of-salt", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "5 Salty Ingredients You Can Use Instead of Salt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Salty Ingredients You Can Use Instead of SaltWhy add salt when you can add salt AND flavor?By Alex DelanyApril 3, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailSalt is probably the most important ingredient in your kitchen. When used properly, it makes food taste, well, more—more like itself, more like it was meant to be, more like something outrageously delicious that you actually want to eat. And, contrary to what your parents might say, it belongs in and on just about everything you cook, from salads and sandwiches to ice cream and margaritas.And while you can always rely on a pinch of tried-and-true kosher salt or a finishing sprinkle of flaky Maldon to get you where you're going, when it comes to seasoning, you've got options. There are so many salt-adjacent ingredients and condiments out there that not only help to bring out the best in the foods they're being added to, but have their own unique flavors to offer, too. Whether we're using them in addition to or straight up instead of salt, these flavor boosters are an indispensable part of our kitchen arsenal. And once you learn how to use them, we're pretty sure they'll be a part of yours, too. Here are a few of our faves.Make Soy Sauce Your Secret WeaponIf you're only using that bottle of soy sauce for your takeout sushi, you're missing out—this umami-powerhouse makes just about everything taste better.View StorySoy SauceYeah, yeah. You know the stuff. You probably even have some in your pantry right now. (Or at least a couple little plastic pouches of it in your junk drawer from the last time you ordered takeout.) Soy sauce, made from fermented soybeans, is packed with salt and deep, dark umami flavor; it lends an unmistakable depth to basically anything it touches, from fried rice to marinated chicken skewers. But just because the sauce is Asian in origin doesn't mean it isn't just as versatile as kosher salt. We love rubbing some over a roast chicken before popping it into the oven, adding a dash or two to a pile of roasted vegetables, or even using some to season the braising liquid for short ribs.Why Anchovies Should Be on Every PizzaThe simplest of all toppings adds the biggest flavor.View StoryCured FishSalt-cured fish—think anchovies and sardines—are packed with umami flavor, and can actually be pretty mild in both the fishiness and saltiness departments, depending on what kind (and brand) you're using. They add a distinctive mouthwatering quality to all kinds of dishes, whether they're draped whole over pieces of buttered toast, chopped into pieces and tossed with pasta, or mashed into a paste and incorporated into a salad dressing. The cool thing about cured fish is that, unlike some of the saucier items on this list, you can control their saltiness somewhat; rinsing them under the tap or letting them soak in a few changes of cold water will take out some of the sharpness.Wait, What Is Fish Sauce, Anyway?That sweet, salty, funky, fishy umami bomb takes dinner from 0-100 real quick.View StoryFish SauceThis funky elixir is like a cross between soy sauce and cured fish, but with bigger, brassier party vibes. Fish sauce is made from salted and fermented fish, and brings a bright, almost ocean-like salinity, along with lots of fishy, caramel-y flavors to the table. And while it's classic in a green papaya salad or Thai-style larb, we often use a splash of it anywhere we might use fishy-fish like anchovies—think Caesar salad dressing, simple pasta dishes, and even in pizza sauce. This is especially true in situations where we want a little bit of salty, fishy flavor, but don't feel like opening up a whole tin—or are just too lazy to. (It's also the secret ingredient in this 5-ingredient onion dip. Don't knock it 'til you've tried it!)5 Ways to Use Miso That Don't Involve SoupThere's more to miso than soup. A tub of the good stuff can upgrade most weeknight dinners instantly.View StoryMisoWe’re big on miso in these parts. Miso is a fermented mixture of soy beans (usually, but other grains and beans are used too) and koji (a totally safe type of mold that grows on rice) that can be diluted and spread onto meats, mixed into marinades and sauces, or swirled into dressings and dips. We manage to sneak a spoonful or two into almost every soup or stew we come across, from classic chicken noodle to French onion to beef chili. And since there are so many different kinds to choose from, with flavor profiles ranging from mild and sweet to dark and bitter, we're able to pick one that fits best with whatever we're seasoning.We Dry Brine Chicken, and So Should YouWe season our chicken well before cooking it, and yes, it makes chicken that much better.View StoryFermented Vegetables (and Their Brines)Most fermented vegetables—think dill pickles, sauerkraut, and kimchi—are packed in a mixture of salt, water, and spices while they undergo their transformation, meaning both the veggies and the liquid they're hanging out in are preeeeeetty salty. Chopping up the solid parts and tossing them into a grain salad or stirring them into a soup is a great way to add not only brightness and seasoning, but a bit of pickle-y funk as well. And once all of the pickles are gone from that jar, don't throw out that brine! Use it like any of the liquid seasonings we discussed above; any marinade, salad dressing, or stew you incorporate it into will thank you.But you have to keep something in mind when using ingredients like this: They contain salt. Duh. That’s why we reached for them, right? Right.\nJust remember that if you're using any of the above ingredients, make sure to add them gradually, taste as you go, and don't season with actual salt as compulsively as you usually do (or ought to do, at least). If you season your stir fry with soy sauce, hold back on the salt. If you season your broth with miso, hold back on the salt. Salt is an amazing thing, but too much of it can turn you into a raisin. We like you better when you’re not a raisin.Soy sauce! With mussels!Mussels in Spicy Tomato BrothPlus mayo bread, because we can.View RecipeExplore Bon AppétitBasicallySea SaltSoy SauceFish SauceMisoSauerkrautKimchiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-03", "author": ["Condé Nast", "Alex Delany"]}