{"id": "ac3359c15b06b251e8ece920f366a796", "url": "https://www.bonappetit.com/story/a-skeptic-tries-dairy-queen", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "A Skeptic Tries: Dairy Queen's Dipped Cone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Skeptic Tries: Dairy Queen's Dipped ConeI’d been so focused on finding 'authentic' restaurants that I ignored one of the most American foods of them all.By Ali FrancisSeptember 28, 2021FacebookTwitterEmailIllustration By Alexis MontoyaFacebookTwitterEmail‘A Skeptic Tries’ is a series examining our food resistances and what happens when we try them anyway. Next up, associate editor Ali Francis reluctantly dallies with Dairy Queen.A few months ago, in an attempt to combat the existential disorientation of a life spent working from my mustard couch in Brooklyn, my boyfriend and I bought a 2011 Subaru Forester, with literal wads of 20s, from a burly Russian in upstate New York, stuffed it full of CamelBaks, aspirational yoga mats, trail mix, and a first aid kit and drove due south.The days were long. My boyfriend queued various economics podcasts that debated the merits of investment apps while I spent hours staring comatose out the window. My body was heavy, but my mind raced: about variants; inferno climates; cultural and civic decay; what life would be like if we all had to live on Mars; when, if ever, I’d make it home to see my Australian parents; when, if ever, I’d achieve the dreams I’d shoved under the rug of corporate stability. Here’s the thing about road trips, popular as they are: Given hours alone with your brainhole and an endless stretch of warbling asphalt, there’s ample time to spiral.Every few hours we’d stop for food and fuel (tip: don’t buy a decade-old SUV unless you love paying for gasoline). Being Australian I wanted to sample off-the-beaten-track America, unlike my boyfriend, who would spend miles talking up the merits of one big-chain fried chicken sandwich over the other. Each time we stopped we’d respectfully part ways, him returning with Coke and dunking shoestring fries with joyful abandon while I painstakingly trawled Google Maps for family-run burrito joints, dimly lit red sauce restaurants, and fancy farm-to-table salad bars. More often than not I would become overwhelmed by choice—or lack thereof—and gorge on a sad melange of the aforementioned nuts and seeds.On a two week stopover in Dallas to visit my boyfriend's parents, I was taken off guard by a group decision to stop for chocolate-dipped cones at Dairy Queen after dinner. The enthusiasm spread like a party wave, but it ended at me. “You’ve never tried DQ?!” my boyfriend’s stepmom said.I shook my head—Nope, never.“Oh, you’re gonna love it!” his dad said.Doubtful, I thought. I knew enough about fast food joints to assume I was in for a long list of spine-tingling ingredients that would lead to disappointment and dental decay. Places like DQ were the physical manifestations of everything I believed was wrong with the American food system: predatory marketing campaigns, industrialization, and highly processed everything.But I didn’t want to be that girl in front of my boyfriend’s parents, the “I don’t eat that stuff” girl. So I agreed to try the dipped cone.After breaking its seal, the chocolate condensed in the humid air, and like a breached levee, soft serve started flooding out. Dairy Queen was founded in Joliet, Illinois, in 1940 and now serves an estimated 750,000 dipped cones weekly. Despite DQ's clear popularity as an American soft serve icon, the store I visited in Dallas—thanks to shrinking profit margins—is one of the state’s precious holdouts. Cone in hand, I sat in a hair-dryer-like breeze at a gummy table under one of the shop’s distinct red umbrellas. The building, like most in Dallas, was well air conditioned but ubiquitous in that 1980s suburbia way: boxy, beige, and generally reminiscent of a cardboard box.I eyed the lopsided elfin-looking cone. And immediately I softened. What I felt toward my ice cream was something bordering on tenderness. It seemed equal parts earnest, like a chubby baby, and familiarly trashy, like your wino aunt who moved to Miami and always smells of self-tanner. And the tiered chocolate shell gave it the gestalt of a neat little dog shit.With its “Happy Tastes Good” slogan wrapper, the DQ dipped cone would be right at home on a budget cruise—there for a good time, not a long time.If I'm being honest, the first bite was kind of sexual. A satisfying crunch of chocolate, like the stiff clunk of a belt buckle, revealed a lush ripple of vanilla soft serve. The flavor pairing was entirely expected—boring, the haters might say. Fine by me; everything is too something these days anyway.After breaking its seal, the chocolate condensed in the humid air, and like a breached levee, soft serve started flooding out. Vanilla tributaries snaked down my arms; drops hitting the tabletop in a tinny staccato-like rain on a windowsill—fast and infinite. Fun and games were over: time to focus. It was all I could do to keep up, licking and biting the sweet, sticky mess.I twisted and twisted the cone like a potter would a lump of clay, shaping it with my tongue, filling my mouth with cool, floral sweetness. And I was taken on the next phase of the journey, through happy vanilla-scented childhood memories in my far-off home: Watching the first Harry Potter movie on the big screen, eating our once-a-year McFlurries on beach vacays with my brother, sitting around the dining room table with my parents waiting for Magic Shell to harden over little mounds of store bought choc chip.The cone was there to be eaten, so I ate it.To be clear, the Dairy Queen dipped cone isn’t good the way handmade Italian gelato is good. It doesn’t have to be. A transcendent mix of artificial ingredients (and a surprising amount of...air?), the ice cream made me forget the noxious waft of thoughts streaming through my psyche, the chaotic mess of tabs open on my computer, the injustices that abound in the cursed world outside. As I walked toward the car, all that remained were the slimy soft serve tracks, like little snail trails, running up my arms.It’s silly, but now I feel an unmistakable fondness whenever I spot a bright red roof from the highway. For a brief moment at least, Dairy Queen was a cool relief. I stopped moralizing, leaned in, took a lick of the American fast food experience—and let it be good.Explore Bon AppétitCultureA Skeptic TriesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-28", "author": ["Condé Nast", "Ali Francis"]}