{"id": "ac35f0a785a6c610edb1719b20d66507", "url": "https://www.bonappetit.com/story/halo-top-seven-new-vegan-dairy-free-flavors", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Halo Top Introduces Seven New Vegan, Dairy-Free Flavors of Its Low-Cal Ice Cream | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHalo Top Introduces Seven New Vegan, Dairy-Free Flavors of Its Low-Cal Ice CreamThe coconut milk-based desserts will hit grocery stores in February.By Andrea ParkJanuary 30, 2018FacebookTwitterEmailCourtesy of Halo TopFacebookTwitterEmailAfter completely revolutionizing the world of low-calorie ice cream in the span of just a few short years, Halo Top's next goal appears to be a total takeover of the vegan dessert market. The brand released its first seven soy- and dairy-free flavors last fall, and, this week, the brand announced that it's doubling its vegan-friendly options. The seven new pints, all of which start with a coconut milk base, include five vegan-ized versions of fan favorite Halo Top flavors—Pancakes & Waffles, Birthday Cake, Candy Bar, Chocolate Almond Crunch, and Chocolate Chip Cookie Dough—plus two brand-new flavors: Toasted Coconut and Vanilla Maple.According to a press release, Toasted Coconut features real flakes of—you guessed it—toasted coconut that \"add a sweet surprise to this creamy coconut pint, serving up tropical vibes,\" while Vanilla Maple is a classic vanilla ice cream with just a \"hint of maple\" added in to kick it up a notch. Each of the seven new flavors clocks in at somewhere between 280 to 360 calories and 16 to 24 grams of sugar per pint. They'll be available in grocery stores nationwide in February, but if you just can't wait (and have $29.42 to spare for shipping costs), the vegan treats, as well as the rest of the Halo Top collection, can be ordered online at Ice Cream Source.Courtesy of Halo TopHalo Top first introduced vegan-friendly options to its line of low-cal desserts in September 2017. Those first seven soy-free, dairy-free options were, like several of the new options, altered versions of existing Halo Top flavors: Peanut Butter Cup, Chocolate, Oatmeal Cookie, Sea Salt Caramel, Caramel Macchiato, Cinnamon Roll, and Chocolate Covered Banana. \"The number one request that we get from our fans is to make a non-dairy and vegan-friendly version of Halo Top. Whether you have to or choose to restrict dairy—or only eat vegan—we always want to make sure we listen to our fans,\" Justin Woolverton, Halo Top's founder and CEO, said in a statement at the time. \"It took a long time to 'get it right,' but we're absolutely thrilled with the outcome and can't wait for our fans to try these flavors.\"If the company's past success is any indication, its newly expanded vegan selection will soon be the belle of the dairy-free ball. Last July, Halo Top became the bestselling pint of ice cream in America, and by September, the company had become the bestselling ice cream brand, regardless of carton size, in the country. On top of that, in December, Time named the brand one of the 25 best inventions of 2017—and you'd be hard-pressed to find someone who disagrees.Explore Bon AppétitIce CreamVeganTrendsRead MoreLifestyleHalo Top Is the Most Popular Ice Cream in America, and We're Not MadBy Molly YoungRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Andrea Park"]}