{"id": "ac49b9543a2ee4f7acb79d2c335c6839", "url": "https://www.bonappetit.com/recipe/classic-martini-2", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Classic Martini Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2015 IssueClassic MartiniBy Audrey Saunders, Pegu Club, New York CityMarch 10, 20213.8(65)Read ReviewsTriangleEmailPinterestPrintMichael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintEven if you’re thinking to yourself, but I already know how to make a martini, you may want to keep reading anyway. This martini recipe is proof that sometimes the simplest things are actually the hardest to master. It might only need three ingredients—gin, vermouth, and a lemon twist—but fewer variables means that each one is very important to the final result. Technique is everything here.Speaking of, we suggest stirring this martini 50 times in a rapid circular motion (preferably with a bar spoon) before straining it into your cup. Sounds specific, but we’re aiming for three things here: cohesion of ingredients; proper dilution; and a perfectly chilly temperature—all of which lead to a better, more nuanced flavor profile overall and consistency between batches. Why not shake it? Because we’re only mixing spirit-based ingredients (gin and vermouth), you don’t “need” the force of the shake to integrate them the way you would if other non-booze-based elements (such as citrus, egg white, etc.) were present, and it gives you more control over the temperature and dilution. But if it’s still your preference, by all means, shake away! Oh, and if olives are more your speed, try this recipe instead.Editor’s note: This recipe was originally published March 24, 2015.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Mixing Glass$40 $18 At AmazonBar Spoon$10 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonSerrated Knife$14.99 At AmazonIngredientsMakes 1  Servings4ounces Beefeater gin¾ounce Noilly Prat dry vermouth1lemonPreparationStep 1Holding a large (preferably 1\") cube of ice in the palm of your hand, use the back of a stirring spoon to crack it into large pieces; place in a mixing glass. Repeat with enough ice to fill glass. Add gin and vermouth and, using a bar spoon, rapidly stir 50 times in a circular motion (the outside of the glass will become very cold and frosty).Step 2Strain martini through a Hawthorne strainer (or a large slotted spoon) into a chilled Nick and Nora glass. Strain any excess cocktail into a sidecar set over ice (or a small glass in a bowl of ice).Step 3Using a small serrated knife, remove a 1\" piece of peel from lemon; it should be stiff enough to provide some resistance (some white pith is okay). Twist peel over drink to express oils, then rub around rim of glass. Float peel, yellow side up, in martini.How would you rate Classic Martini?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleReasonable recipe although I prefer shaking. The suggestion is that the NP vermouth is essential is discouraging. Try Dolin dry and you’ll never go back. Norman SilvermanDallas 10/22/20211.  Put the gin in the freezer.  It will become syrupy in a couple of hours.\nBetter yet, just keep a pint of gin in the freezer.\n2. Olive, not lemon peel.  Lemon peel is something else.  The little pimento stuffed olives.\n2 or 3 if you're feeling expansive.\n3. Use tiny pickled onions and it's a GIBSON!\nVIOLA!\n😁\nP.S. The frozen gin will freeze the olives and make them crunchy.AV8Rcoastal Alabama6/15/2021finally, some recognition that olives, like vodka, are an abomination in a martini. I also appreciate the instruction to put the rocks on the side. I always ask for that when I order and people look at me like I have 3 heads.nkbMA4/26/2021This feels overly fussy. I know this isn't the drink for lazy or cheap people. But like... that ice cracking method..? Really? SarahBaltimore3/12/20211. You have to chill the gin for one hour in the freezer;\n2. The bottle has to be stored upside down;\n3. At minimum, you must be prepared to make at least four martinis per batch to allow the flavors of the vermouth and gin to mix properly; and\n4. If you do end up using olives for garnish - remember to dry each olive with a linen free towel so that they can properly macerate. JordbærtUpsalla2/27/2020Putting the gin in the freezer is a nice idea if you’re working with low quality ice that’s small or has a lot of surface area for melting, as it would dilute too fast with room temperature gin. \n\nWhat I suggest for party martinis, is making them in a larger batch, Diluting to taste not temperature, and putting the diluted Martini in a bottle in the freezer for an hour or so before you plan on serving them. Then you can pour into chilled glasses and it will be ice cold for your guests, who can garnish them however they’d like!Hannah C12/31/2019For the person who suggested putting gin in the freezer; this would prevent proper dilution when stirring in ice.  So no it shouldn’t go in the freezer unless you’re making a cold cocktail that doesn’t require dilution.AnonymousUSA9/27/2019What ? A lemon twist and no olive ? You lost me.Bruno123Earth8/24/2019Put the gin in the freezer.Anonymous365356/17/2018Explore Bon AppétitCocktailDrinks AllMartiniGinAlcohol & Other DrinksVermouth5 Ingredients or FewerDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2015-03-24", "author": ["Condé Nast", "Audrey Saunders", "Pegu Club", "New York City"]}