{"id": "ac595b4c8633395218a4777ec8ede409", "url": "https://www.bonappetit.com/recipe/pumpkin-bread-with-salted-maple-butter", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "Pumpkin Bread with Maple Butter Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPumpkin Bread with Salted Maple ButterBy Molly BazOctober 12, 20184.7(149)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintPumpkin Spice Bread gets all grown up thanks to the addition of fresh ginger in this super-moist no-fuss bread with a crunchy pumpkin seed topping.IngredientsMakes one 9x5\" loafBreadNonstick vegetable oil spray2½cups all-purpose flour2tsp. ground cinnamon2tsp. kosher salt1tsp. baking powder½tsp. baking soda½tsp. freshly grated nutmeg⅛tsp. ground cloves2large eggs115-oz. can pumpkin purée1Tbsp. plus 1 tsp finely grated ginger (from about one 3\" piece fresh ginger)1½cups plus 1 Tbsp. sugar1cup extra-virgin olive oil½cup raw pumpkin seedsMaple Butter1½sticks (¾ cup) unsalted butter, room temperature¼cup pure maple syrup¾tsp. flaky sea salt, plus more for servingPreparationBreadStep 1Preheat oven to 325°. Lightly coat a 9x5\" loaf pan with nonstick spray. Line bottom of pan with parchment, leaving a generous overhang on both long sides.Step 2Whisk flour, cinnamon, kosher salt, baking powder, baking soda, nutmeg, and cloves in a medium bowl.Step 3Whisk eggs, pumpkin purée, ginger, and 1½ cups sugar in a large bowl. Stream in oil, whisking constantly until mixture is homogeneous. Gently fold half of dry ingredients into egg mixture until no dry spots remain. Repeat with remaining dry ingredients, stirring to combine but being careful not to overmix.Step 4Transfer batter to prepared pan; smooth top with a spatula. Scatter pumpkin seeds over batter, pressing lightly to adhere. Sprinkle seeds with remaining 1 Tbsp. sugar. Bake bread, rotating pan once halfway through, until a tester inserted into the center comes out clean, 80–90 minutes.Step 5Let cool slightly, then run a knife or small offset spatula around pan to help loosen bread. Using overhang, transfer bread to a wire rack and let cool.Step 6Do Ahead: Bread can be baked 4 days ahead. Cover tightly with plastic wrap and keep at room temperature.Maple ButterStep 7Using an electric mixer on medium-high speed, beat butter in a large bowl, scraping down sides, until light and fluffy, 5–6 minutes. Add maple syrup and ¾ tsp. sea salt and beat, scraping down sides of bowl once more, just until incorporated.Step 8Transfer maple butter to a small bowl; season with more sea salt.Step 9Do Ahead: Maple butter can be made 5 days ahead. Cover tightly with plastic wrap and chill. Let come to room temperature before using.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Pumpkin Bread with Salted Maple Butter?Leave a ReviewTell us what you thinkReviews (95)Back to TopTrianglePretty great with a few simple tweaks: l often leave out the fresh ginger because I don’t have it, but I replace it with 3 teaspoons ground ginger, and I double the amount on the rest (the cinnamon, the nutmeg, and the clove), otherwise the spice flavor is lackluster. Half olive oil and half vegetable oil works better for me. Replace the tbsp of regular sugar with coarse turbinado sugar and you’ve got a bit more texture on top. Thumbs up with these slight mods! Suzy Orange County CA1/13/2022Excellent! Won a pumpkin bread \"bake-off\" last weekend and it was quick to make. Really flavorful with the fresh gingerLindsayHouston, TX11/8/2021Amazing recipe, would make a again and amp up the ginger - both fresh and powder. I used a teaspoon of Maldon salt in the batter and it has the perfect salty / sweet ratio.ZeusFromTheCongoToronto, ON, Canada11/2/2021BEST pumpkin bread ever. love how it uses olive oil, not sure why John from FL said hes using canola. its delicious and Molly is a genius as always! love love love this recipe so much I make it even in non-fall... you won't overbake it its so moist, dont underbake!Anna WardSan Clemente CA10/28/2021I wish she had specified what brand of kosher salt she used! I used Windsor (same sodium content/saltiness as Morton) and it was WAY too salty. I'm usually on board for Molly's saltier dishes, but this was inedible – I ended up having to throw most of it out because no one in my family could eat it. I'm assuming she probably used Diamond Crystal, and if she'd specified that, I would've cut my salt in half. Also, even after my cake tester came out clean, it was partly undercooked inside and super mushy. I think there's too much of the wet ingredients – I'm all for a moist cake, but the texture of this was gross, and the sugar on top didn't caramelize so it was just super weird having that sprinkled on top. (My oven was definitely hot enough – I used a thermometer.)\n\nI really wanted to like this, so I'm going to try again with a few alterations. I'd definitely recommend cutting back on the salt (if using Morton or similar), oil, and sugar topping, and making sure you bake it at LEAST 90 min, even if you think it's done before then.AnonymousOttawa, ON9/30/2021I was underwhelmed at first, but the more I ate it, the more I liked it. I will skip the olive oil next time and use canola; I feel like the evoo made the bread taste stale much sooner. This loaf will last me a week or longer. I used one half a cup of oil. I prefer a drier crumb and knew 1 cup would be way too much for me. I used 1 cup of sugar and it was sweet enough for me. (I actually used half white/brown sugar, and a tablespoon of molasses). I added a minced apple which contributed moistness and added some 'acid'/tartness. I'll repeat the apple next time, I could definitely taste what it added. I used 3 eggs instead of 2; the eggs I had were small + I wanted a bit more nutrition in the loaf. I also added toasted walnuts.JohnFlorida2/25/2021This is the best Pumpkin Bread! This is the third year making it and it is perfect every time I bake it. I have made some tweeks, I chop up candied ginger, use 1/4 C. I also add pecans to it, it makes for a lovely bite. Do not pass on the Maple Butter, it is wonderful. I have used the butter to glaze cook carrots, there are endless possibilities!AnonymousDallas, TX12/24/2020Unbelievable!! I’ve made this 5-6 times and it always comes out amazing and people beg me for the recipe. I don’t find the olive oil flavor overpowering at all. The only change I make (and I know it’s gonna sound crazy) is I add a ton more of each spice- like 3tsp cinnamon, 1/2tsp cloves, 2-3tbsp ginger, etc. I love a super pumpkin spice-y flavor and with the increase, this delivers. Also, the seeds on top add the perfect crunch- don’t skip them! LinNew York 12/17/2020Not only was this super easy and quick to make, it was also fantastically delicious. I didn't have any olive oil, so I used coconut instead. Also, I didn't have any pumpkin seeds so I used chopped pecans on top. It's a tad on the sweet side, so cutting the sugar down to 1 cup may be a good idea based on your preference. 10/10!AnonymousMadison, WI12/1/2020The only adjustment I made to the recipe was using 1 cup instead of 1 1/2 cups of sugar since I read reviews that it was very sweet. The bread came out perfect! I was hesitant to use the olive oil, but I use a good quality one and it wasn't overpowering. The maple butter went well with the bread too. Anonymous11/25/2020This was really good. I just followed the directions without making any omissions or substitutions and it turned out perfect.AnonymousAnn Arbor, MI11/20/2020Delicious! Extremely moist but not too crumbly - perfect texture really. Very sweet, but great if you're looking for more of a dessert. I was afraid the olive oil flavor would be too strong, so I used a neutral oil. It's a very soft, wet dough, not very sticky. I also cooked it in a muffin tin instead of loaf pan and they made great \"muffins.\" Super yum.KatDenver, CO11/10/2020Made this yesterday and love it!! The only variance I made was to add nuts and seeds to the mix. I toasted walnuts, pecans and pumpkin seeds and then chopped them to a rough chop. I also sprinkled in some flax and chia seed. It did not affect the cooking time at all. I also skipped the maple butter. No bad olive oil after taste either. It is sweet, I made this to have for breakfast this week and think next time I will cut down on the sugar. It is a little too sweet for breakfast. Sabra ReddenAnna, Texas 11/9/2020I made this pumpkin bread without the maple butter and it was amazing. I shared it with friends and family and everyone was very impressed. I then decided to try and make banana bread with the same recipe. (I used 4 over ripe bananas instead of pumpkin purée & slivered almonds instead of pumpkin seeds) This was by far the best banana bread I have ever made. I will be sharing this recipe with friends and family! Thank you! AnonymousPA11/8/2020So delicious! I skipped the maple butter because it's plenty sweet on its own, very good with a little regular salted butter. Next time I might try cutting down the sugar just a bit so I can taste the pumpkin more. Definitely very moist, the olive oil is perfect. callasliliesSan Francisco11/5/2020Explore Bon AppétitLoaf CakeCakeDessertBreadAmericanPumpkinSquashVegetableGingerHerbs & SpicesCinnamonNutmegFallSnackVegetarianBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-11", "author": ["Condé Nast", "Molly Baz"]}