{"id": "ac5a51c9082b0cb76eeba32ba985c78a", "url": "https://www.bonappetit.com/recipe/crunchy-greens-with-fat-choy-ranch", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Crunchy Greens With Fat Choy Ranch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueCrunchy Greens With Fat Choy RanchBy Justin LeeApril 20, 20214.4(18)Read ReviewsTriangleEmailPinterestPrintPhotograph by Frank Frances, food styling by Lillian Chou, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrintOne of the few vegetables Fat Choy chef and owner Justin Lee would eat as a kid was romaine lettuce—but only when it was served with ranch dressing. (“To be honest, it was mostly ranch with a touch of lettuce,” he says.) With vibrant herbs and peppery watercress, this salad is a grown-up version of that childhood favorite.Ingredients4 ServingsDressing1small shallot, coarsely chopped3garlic cloves, crushed1small jalapeño, halved lengthwise, seeds removed, coarsely chopped⅓cup coarsely chopped dill¼cup extra-virgin olive oil3Tbsp. tahini2Tbsp. fresh lime juice1Tbsp. unseasoned rice vinegar1Tbsp. chopped bread-and-butter picklesKosher saltSalad and assembly½head of romaine lettuce or 1 romaine heart, quartered lengthwise, cut crosswise 1\" thick2baby bok choy, coarsely chopped1cup watercressKosher salt1cup coarsely chopped cilantro, dill, Thai basil, and/or chivesPreparationDressingStep 1Purée shallot, garlic, jalapeño, dill, oil, tahini, lime juice, vinegar, pickles, and ¼ cup water in a blender until smooth; season dressing with salt.Salad and assemblyStep 2Combine romaine, bok choy, and watercress in a large bowl. Drizzle dressing over and toss to coat; season salad with salt. Scatter herbs on top.How would you rate Crunchy Greens With Fat Choy Ranch?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was really nice. I'm always looking for new flavor combinations for salads and this was a great one. I turned it into a whole meal by adding shelled edamame and avocado to the salad and then a piece of fish on top. I couldn't get watercress at the store, but I'm sure that would have made it even better. CJSan Diego11/24/2021This is a delicious, very easy salad. Because jalapeños' heat varies so wildly, I'd just say to taste as you go. For me, a whole one was too much.BarryKansas City8/27/2021So, I just made this.  I made it exactly as written.  Having tasted the Bok Choy and the Watercress separately as I was preparing the salad, I was ready for this to taste strange.  However, when it all came together I couldn't stop eating it. The more I ate, the more I liked it!  My husband really enjoyed it as well. Avocado may have been a nice addition but really it's just a nice herbal mix of greens which don't need to be messed with. I feel healthy after eating 2 portions of this! DeniseCalifornia4/28/2021Such a versatile salad! Rebecca Scotland 4/22/2021Explore Bon AppétitSaladTahiniCondiments, Sauces & PastesRomaineLettuceLeafy GreensVegetableBok ChoyWatercressQuickEasySideGluten-FreeDairy-FreeRawVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Justin Lee"]}