{"id": "ac78d26f8110b64770c05694079439e0", "url": "https://www.bonappetit.com/story/miso-pesto-ramen", "year": 2018.0, "month": 2.0, "day": 3.0, "content": "Miso Pesto Is the Velvety, Veg-Packed Sauce Your Pasta NEEDS Tonight | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMiso Pesto Is the Velvety, Veg-Packed Sauce Your Pasta NEEDS TonightSpringy ramen noodles and a vegetable-packed miso pesto have us itching for pasta night.By Andy BaraghaniFebruary 21, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Andy BaraghaniFacebookTwitterEmailPesto is an insanely flexible and delicious condiment. I've tweaked the traditional Italian recipe before, but this miso pesto with ramen opened up a whole new world for me. Pesto is traditionally made of pine nuts, Parmesan, basil, olive oil, and garlic in the Liguria region of Italy. In this recipe, I add in four cups of spinach, two cups of cilantro, and some delicate white miso for an intensely vibrant, smooth pesto that coats each strand of ramen. It's a dinner that feels like comfort food while still being nourishing and fresh.You start by puréeing spinach, cilantro, white miso, garlic, grapeseed oil, sesame oil, and lemon juice in a blender until mixture is smooth and very green. Pesto is traditionally made in a food processor and tends to be speckly, but I used a blender to make a velvety, smooth sauce that would really coat the noodles. I also used a neutral oil, which really lets the greens, miso, and garlic shine. The spinach emulsifies with the cilantro and oil to create an incredibly silky sauce that drapes over the pasta.I knew I wanted to keep the noodles simple because the sauce is so great. You can find fresh ramen noodles at Asian grocery stores and some Whole Foods—we like the Sun Noodle brand. If fresh ramen isn't available, udon and soba noodles will work just fine. Once cooked, I tossed these noodles with the pesto in a bowl off heat, to keep the pesto from discoloring or cooking. It gets warmed through by the residual heat of the noodles, and that’s better for the miso, too. Add in a nob of butter for that velvety texture, toss until coated, and top with fresh sesame seeds. It's really fast and really green—and really delicious.Pesto and pasta are a match made in heaven, but this pesto is equally dreamy when spread onto sandwiches or drizzled over roasted vegetables and whole grains. Use it right away, or pop it in the freezer to instantly upgrade anything in need of a vegetal, umami punch.Make some miso pesto:Ramen Noodles with Miso PestoThis cilantro-miso pesto is bright and delicious on springy ramen noodles.View RecipeExplore Bon AppétitHealthyishRamenMisoPestoherbRead MorecookingWhat Is Miso, the Secret Weapon in Every Healthyish Pantry?By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-21", "author": ["Condé Nast", "Andy Baraghani"]}