{"id": "ac7c8b2364c7fe10ea99fdfa99b282c0", "url": "https://www.bonappetit.com/story/socca-chickpea-flour-pancakes", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "These Chickpea Flour Pancakes Calm My Weeknight Dinner Woes  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Say Dinner, I Say SoccaThe weeknight power of chickpea flour.By Carla Lalli MusicMay 16, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Here’s what I should do when I get home, hungry, after a long day at work: Make this socca recipe.Here’s what usually happens: I open the front door and my cat, Peggy, runs past me into the freedom of the great Brooklyn outdoors. I shut the door behind me, then yell for my children. I literally yell: “Children!” I rarely get a response, and neither of them appear. I kick off my shoes. That’s a signal for my other cat, King Jeffrey, to jump onto the counter, gaze purposefully at me with his spooky lizard-snake eyes, and telepathically message that he would like his dinner now.Want this letter before it hits the website? Sign up for our newsletter!Before I can even pour myself a tumbler of vino, I’m fork-deep in wet food. That’s Peggy’s cue to jump back into the kitchen through the front window. My own children have no incentive to join us. They’ve already been fed—thanks to a meal plan I work out with our sitter. But what about my dinner?I’ll be real. Sometimes my husband and I eat what is known as a “snack-around plate.” This is cheese, nuts, dried fruit, some salumi (if we have it), and a cut-up apple. Great stuff, if you’re a toddler. There are nights when I eat the kid’s leftovers, and nights when my husband and I talk about ordering in for so long that by the time we decide where to order from, I don’t want dinner anymore. There are nights, Dear Reader, when I eat cereal for dinner.Pancakes in no time.\nPhoto by Chelsie CraigSomehow, being the food director of Bon Appétit has equipped me with the knowledge of how to put together a great weeknight dinner but without the wherewithal to actually execute. I mean, once in a while I come up with a life-altering invention like Broccoli Delight, but the bulk of the time it’s Refrigerator Blues. If I had my druthers, my dinner would be a quick-cooking something that goes from raw to perfection while I stand at the cutting board prepping a vegetable to go with it.That’s where the chickpea flour pancake called socca comes in. It is protein-rich and filling, but unlike a pork chop or a salmon fillet, you don’t have to remember to stop off at the store to buy it on the way home (except, of course, for the first time you purchase the flour). It turns into a batter with the addition of salt, olive oil, and water—no eggs, even! And while that sits for 10 minutes hydrating, you can prepare any raw or cooked vegetable component your heart desires (or that your crisper drawer hasn’t wilted yet).And there it is. A hot dinner, a quick dinner, a pantry-friendly dinner, the actual dinner I deserve. When my meal is ready, that’s when the children appear, sniffing around to figure out the source of the enticing food smells they’re smelling. “Oh,” they say, “can we have our second dinner now?”Get the recipe:Chickpea Pancakes with Kale and FennelSavory chickpea flour pancakes, also known as socca, require just four ingredients (including water).View RecipeExplore Bon AppétitCarla NewsletterChickpeaWeeknightRead MoreLifestyleChickpea Flour Is Your Fastest Route to Dinner TonightBy Aliza Abarbanelcooking4 Ways to Use Chickpea Flour, the Protein-Packed WonderBy Rick MartinezChickpea Pancakes with Leeks, Squash, and YogurtRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-16", "author": ["Condé Nast", "Carla Lalli Music"]}