{"id": "ac9b93eac7cab05f4340c6772c35ed26", "url": "https://www.bonappetit.com/story/perfect-caramelized-onions", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "The Best Caramelized Onions are Silky, Sweet, and Never Burnt  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Tricks for Perfect, Never-Burnt, Caramelized OnionsYou only need onions, oil, and a whole lot of patience. By Sarah JampelDecember 4, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailCaramelizing onions is an art, not a science, which is essentially the same argument I make in any instance where there’s more than one right way to do something. (Picture me retorting my mom, who is still correcting my driving: “It’s an art!”)But no matter how you do it, the number one objective (and number one challenge) is to brown the onions without burning them: You want them to be sweet and silky. While some crispy frizzled edges are desired, any excessively blackened bits will taste bitter.Achieving this end requires, above all else, patience: From start to finish, the process will take about an hour, and any recipe that quotes you 20 minutes is lying. So put on a podcast, buckle up for the ride, and use these three tricks to ensure that your time spent is worthwhile:First, use a wide skillet as opposed to a narrower, taller saucepan. This gives the onion slices more room to breathe, meaning that the water they release can evaporate more quickly. (It’s the same principle as when you’re roasting vegetables: Pile them on a baking sheet and they’ll steam in their own moisture; spread them out and they’ll char and brown.)Second, cover the pan for the first 15 minutes of cooking, during which the onions will soften in their own moisture. Because the onions are now equally tender on the exterior and interior, they’ll cook more evenly in the next stage, when you uncover the pan, turn the heat to medium, and start cooking off all of the liquid they’ve released.Third, help things along with a little bit of sugar. In science speak, caramelization is the oxidation of sugars. Here, those sugars are the natural sugars in the onions, but the addition of a small amount of white sugar adds an extra caramelization boost.Once your pan is uncovered and your sugar incorporated, increase the heat to medium and cook, stirring often and lowering the heat if you notice the onions taking on color too quickly. This stage takes between 30 and 45 minutes, depending on how many onions you’re dealing with.You’ll know you’re finished when the onions have reduced by about two-thirds and turned a deep, almost chocolatey brown. If your onions are sticking to the pan, threatening to give you grief when you’re doing the dishes, add a little bit of water (or broth! or cooking wine!), then use a wooden spoon to scrape up the brown bits, which are full of flavor. (This is the elusive “deglazing”!)Taste the onions for salt and add a hit of acid—a squeeze of lemon juice, a splash of sherry vinegar—and then put them to use. Mix them into cooked rice and lentils for mujadara, chop them up and mix them into Greek yogurt for a dip, use as a base for a comforting soup, fold them into scrambled eggs, or melt in some butter and make a pasta sauce.You’ve sacrificed an hour of your evening—but look how much you’ve gained! You’re a real artist now.Get the recipe:Lemony Lentils and Rice With Caramelized OnionsThis recipe is inspired by mujadara, a simple combination of lentils, rice, and onions that exists in various forms across the Middle East. It's comforting but not too rich, and it's fresh and vegetarian without relying on many perishable ingredients. In other words, it's the perfect meal for the nights in between holiday parties.View RecipeExplore Bon AppétitOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-04", "author": ["Condé Nast", "Sarah Jampel"]}