{"id": "aca2e708e15fcc62e786f5bc571f2607", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-5", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "The 'Healthyish' Podcast Episode 5: The Snack Queens with Alex Beggs and Andrea Hernandez | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Snack Queens With Alex Beggs and Andrea HernandezOn the newest episode of the Healthyish podcast, we talk about how snacks are taking over the wellness industry…and our bellies.By Bon AppétitJuly 15, 2021FacebookTwitterEmailFacebookTwitterEmailIf you’re anything like us, it’s been a year of heavy snacking, and TBH we’re not mad about it. Snacks are one of life’s greatest joys, and despite what your health teacher may have told you, eating between meals can be a perfectly healthy habit. But as the “functional snack” industry booms, how do we know what’s deliciously healthyish and what’s B.S.? On this episode of the Healthyish podcast, Amanda Shapiro brings in Andrea Henandez, the mind behind the cult-favorite “Snaxshot” newsletter, and BA senior staff writer and in-house snack expert Alex Beggs to talk about how snacking is taking over our diets and what they’ve been loving and tossing from the snack aisle these days. There may even be some on-mic taste-testing.ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episode:Alex’s story on the science and marketing of crispinessAlex’s latest Trader Joe’s ReviewsAndrea’s Snaxshot NewsletterAndrea on TwitterAlex on InstagramHow to ListenListen to this episode through the audio player on this page or subscribe via Apple Podcasts, Spotify, or wherever you get your podcasts to get all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitPodcastsCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-15", "author": ["Condé Nast", "Bon Appétit"]}