{"id": "acc315ff673b5b6850fd4008a46058ad", "url": "https://www.bonappetit.com/story/well-crafted-kitchen-frenchette-nyc", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "The Well-Crafted Kitchen: Inside the Whimsical, Dreamy World of Frenchette | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Well-Crafted Kitchen: Inside the Whimsical, Dreamy World of FrenchetteWhy we want to spend all night at Frenchette, chefs Riad Nasr and Lee Hanson’s new wave French brasserie.By Elyse InamineMay 31, 2018FacebookTwitterEmailPhoto by Heidi's BridgeFacebookTwitterEmailStep into any trendy restaurant at 6 or 7 p.m. in New York City and you’re probably already number seven on the list of walk-in reservations. You might spend the wait time shuffling around the constantly opening door or squeezed into a corner of the bar scrolling through Reddit. Restaurants like these are not built for the luxury of lingering.But at Frenchette, the latest arrival to the city’s buzzy restaurant scene, the wait is—stay with me—the best part. It gives you the greatest introduction to the magical French-ish world chefs Riad Nasr and Lee Hanson have created with the help of their design-minded friends. You can hang out in the entrance corridor, a narrow space lined with wide white tile right in front of the host stand and next to the bustling bar. You’ll wait there for your always-late friends, leaning on the mahogany-like sapele-wood bannister and absorbing all the energy of a bistro in motion, and before you know it, your table’s ready. From that vantage, you also get a front-row seat to the kitchen as the chefs send out lacquered duck frites. That’s the beauty of just being inside Frenchette, whether it’s 20 or 120 minutes. So I spoke to the chefs and design team to find out how they crafted their own little world and brought new life to the old-school French brasserie—without turning it into Disneyland.After taking the wall down twice, the team decided to keep it to maintain the different energies of the rooms.\nPhoto by Heidi's BridgeFor 16 years Nasr and Hanson set the tone for French food done right in New York City; they were the dynamic duo powering restaurateur Keith McNally’s mostly French empire (Balthazar, Minetta Tavern, Pastis, Schiller’s). So five years ago, when the two decided to leave the McNally realm and do their own thing, it was big news. What would they do next?It seemed a no-brainer: French food with a capital F—and all the pomp and circumstance that came with it. As they started working on Frenchette about two years ago, Nasr and Hanson picked up vintage silver-plated water pitchers from the Waldorf-Astoria auction, dreaming of a grand water-refilling moment. They flirted with the idea of tablecloths because what is a French restaurant without the flourish of unfurling starched white linens?“Then someone builds this,” Hanson says, gesturing at the sapele wood table where we’re sitting, the sound of construction hammering along outside. It seems plain and sturdy enough at first look, but then you notice the dark, barely veiny grain, feel its heft and ridged sides, all indicating that someone put a lot of effort into this table. You wouldn’t hide it under a white tablecloth.“And you want to create a vibe that’s less stuffy,” Nasr says, completing Hanson’s sentence.Jeff Ford’s wood mirror on top of the mirrored wall is a throwback to the classic French bistro with layers of mirrors on mirrors.\nPhoto by Heidi's BridgeThat’s the mission of Frenchette. Wander in on any given weekday, and you’ll (probably) find someone on our staff drinking natural wine at the bar. (Come say hi!) It’s a slight departure from the classic French food Nasr and Hanson are known for but just as luxurious. \"We didn’t want to bludgeon people with French food,” Nasr says with a laugh. Here, frites come with crispy-skinned duck instead of steak, funky wines from small producers dominate the menu instead of Bordeaux, and the check is presented with a guitar pick inscribed with Frenchette’s script logo. It’s whimsical and romantic, and something about the 100 seats makes you want to stay for hours, trying more and more of those crazy wines.Nasr and Hanson opt for these pretty serving pieces: fire-engine-red Le Creuset covers and cream-hued Staub tagines.\nPhoto by Heidi's BridgeFor decor inspiration, Nasr and Hanson took excursions to formal flower-vase-filled Le Grenouille and preppy Polo Bar. They shared countless late-night texts with the friends they recruited to design the restaurant: Sam Buffa, owner and designer of Vinegar Hill House and Fellow Barber; Amy Butchko, an interior designer behind hospitality projects like Sushi Ganso and VHH Foods; and Zeb Stewart, the restaurateur of Hotel Delmano, Cafe Colette, and Union Pool. They call themselves the Springs Collective, and the goal was to push the chefs out of their comfort zones and the big-box brasseries they were so used to working in. “This is our night job,” Stewart jokes.There are few things in the restaurant the customer actually gets to touch, Hanson notes. So they invested in leather and the custom sapele tables for a more luxurious experience. Erika Langstroth’s flower sketches on the plaster walls balance the masculinity of the bistro wood-heavy space.\nPhoto by Heidi's BridgeNow those old, ornate Waldorf-Astoria pitchers are stacked by the espresso maker and destined for holding plants. But those aren’t the only things the Springs Collective sought to switch up. They found inspiration in the Vienna Secession, an Austrian art movement that started in 1897 with the Secession and is known for its art deco and art nouveau vibes. Instead of one big restaurant space, they broke it into two distinct sections. At the front, there’s the entrance and the bar, separated by the sapele bannister; a wall in the middle; and at the back, the dining room and semi-open kitchen. The wall went up and came down twice—first as a mocked-up wood frame and finally staying put as a real wall after the designers and chefs saw eye to eye on the differences between the sections.“The intimate bar forces interaction in a way that feels alive and convivial,” Butchko says, “while the more formal dining room with comfortable booths is an invitation for a more extended stay.”The American Bar in Vienna was a constant source of inspiration, and these chairs came from overseas, new productions of designs by Austrian architect Josef Hoffmann.\nPhoto by Heidi's BridgeThe constraints of the space also allowed for an ebb and flow with the design and, in turn, many happy accidents. The Springs Collective studied the layouts of sailboats and train cars to figure out how to maximize the long, narrow space with that fickle wall. There were specific fire codes for the entrance that pushed the team to create an almost dramatic corridor with accidental sightlines leading to the open kitchen. And they continued to get crafty with the rest of the space: They hired Erika Langstroth of Erilan Design to paint flowers on the plaster, adding a feminine touch to the typically masculine brasserie. They commissioned local woodworker Jeff Ford of Lucky Rabbit Brand Design to make the tables; large rectangular mirrors that echo the brasserie hue; rounded door frames that have a softening, warming effect on the space; and shelves at the bar and into the dining room. Nasr’s stepfather made the ceramic vases that resemble Japanese Iga-style ones (and egg holders that will debut with the brunch menu). The Springs Collective also lowered the ceiling so it mimicked the curved edges of the space and made the space feel cozier. They stuck an arched takeaway window right behind the long pewter bar because why not?“As restaurant owners ourselves, we hate stuff like that, but as designers we thought it was so exciting to have drinks passed to you,” Stewart says.“It adds a sense of mystery. Where does that go?” Nasr says.Instead of pricey zinc, pewter makes this stunning bar. On your way down to the bathroom, you can peek through the takeaway window to get in on the bar action.\nPhoto by Heidi's BridgeWhen they started construction on Frenchette in October 2016, the first thing the Springs Collective bought for the restaurant were 12 clear Italian light fixtures that hang throughout the restaurant, by the glasses stand in the bar area, and also by the open kitchen. It washes everything in a slight glow, maintaining an almost otherworldly effect that sets the stage for the kitchen.“We’re not open-kitchen guys,” Nasr says with a laugh. But the idea of putting in swinging doors seemed like a nuisance, so he and Hanson gave into Stewart’s urging. The result?The very slim kitchen needs this French cooktop, where three cooks can man each side and slide dishes through the oven if needed.\nPhoto by Heidi's BridgeRed and black tiles line the kitchen floors, creating an almost undulating look that mimics the constant movement in the kitchen. The tiles dance along as food runners come in and out and cooks pass dishes from stovetop to the expediting table. A striking Athanor cooktop anchors the kitchen, an unusual appliance you don’t see often in restaurants. The reason is because most kitchens can’t have stand-alone stovetops and ovens; they’re typically anchored to the wall. The Athanor stands alone, allowing three cooks on each side, cooking face-to-face and sliding braised dishes from side to side through the tunnel-like oven. Red Le Creuset gratin covers sit beneath the expo station, where you’ll find Nasr and Hanson most nights. You can see them the moment you enter, like red treasure boxes filled with stewy, meaty gems.Unintentionally, the team made the kitchen the focal point of the restaurant and put the chefs in the spotlight. It’s almost cinematic, a straight line from the kitchen to the front door and a dramatic, frenetic, exhilarating scene. And it comes free with the wait.Made by Nasr’s stepfather, these large vases bring life to the room.\nPhoto by Heidi's BridgeKeep the French alive by making these cream puffs:Explore Bon AppétitRestaurants + TravelNew York CityFrenchRead Moreculture10 Cult Nordic Design Brands That Will Transform Your KitchenBy Julia BlackcultureThis Designer's the Reason You're Seeing Mangosteens on the RunwayBy Ali FrancissponsoredWhat We Learned About Home Design From Sunday Suppers with NestBy NESTRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "Elyse Inamine"]}