{"id": "acc4bd610e7b945525b8f78f5d41ad2f", "url": "https://www.bonappetit.com/story/lemon-meringue-pie-thanksgiving-dessert", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "Lemon Meringue Pie Is the Only Thing on the Thanksgiving Table I Care About | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingLemon Meringue Pie Is the Only Thing on the Thanksgiving Table I Care AboutTurkey whomst? By Sarah JampelNovember 5, 2019FacebookTwitterEmailPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailTurkey has the monopoly on “Thanksgiving showstopper”—special tools, photo opps, a carving moment, leftovers to spar over. But for a proud Dessert Person with approximately 0 percent interest in the bird, I’m laser-focused on the sugar course (and yes, I always save room).When I’m brainstorming what to bake—something that will say “Notice me (but not too much)” and “Compliment me (but not excessively)” and “Don’t you dare say ‘only a sliver’”—there are some desserts I immediately rule out: Pumpkin and pecan pie put me to sleep upon sight, but anything too far removed from the holiday repertoire (butterscotch trifle, baked Alaska, Devil’s food cake, that weird pear custard pie I made one year…) might be met with protests.It’s a tricky game, trying to pick one dessert that can stand up to the turkey without calling too much attention to itself—but I believe that lemon meringue pie is the perfect candidate: It’s impressive but familiar, it’s refreshing after a heavy meal but not austere, and you get to set the whole thing on fire (well, almost).Chris Morocco’s new recipe is, of course, flawless: velvety, pucker-inducing lemon filling, gooey billows of sweet meringue, and a golden-brown blind-baked pie crust. Unlike most other pie doughs, this one calls for squishing ½-inch chunks between your fingers. Not only is this immensely satisfying, but it also makes for huge butter splotches, leading to an extra-flaky crust. Chris also gives us an exact amount of ice water (⅔ cup), so there’s don’t need to guess whether the dough is hydrated (hallelujah). Smash the dough together, cut it into quarters, stack those up, and press them down (the same way you’d make BA’s Best Biscuits)—this makes even more layers. It’s fun! It’s wild! Throw your other pie dough recipes away!Heads up: This recipe makes two pie crusts. And while you can halve the quantities and go your merry way, why not make a second disc of dough to keep in your freezer? Your hands are already covered in butter at this point.Bye bye pumpkin pie.\nPhoto by Ted + Chelsea Cavanaugh, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiOkay, once your pie crust is fully baked (meaning that it’s brown all over—this pup doesn’t get baked again), start your filling. It all happens on the stove, an easy exercise in stirring together sugar, water, cornstarch, eggs and yolks, and lemon juice and zest. You’ll do a fair amount of frequent and constant stirring—but that’s what streaming a Podcast is for. Pour the filling into the crust and chill for two hours, by which point your curd will have set into something silky yet sliceable.You can do this whole process a couple of days in advance, thereby freeing up your oven and stove for what some might deem “the main event” (turkey and gravy). But when you set your pie in the middle of the table, pipe (or plop) the meringue over the top, and brûlée the whole number (if you were looking for an excuse to buy a kitchen torch, now’s your time), no one will be thinking about that turkey or how full they are. They’ll be too busy calculating whether they can beat cousin Eileen to that last remaining slice. Dessert folks, rejoice.Get the recipe:Lemon Meringue PieA sky-high pie with sharp lemon filling, sweet-and-salty meringue, and shatteringly crisp crust.View RecipeExplore Bon AppétitThanksgivingPieDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Sarah Jampel"]}