{"id": "acc9535928db23f6630f4afefc4acb78", "url": "https://www.bonappetit.com/story/beer-pairings-with-summer-recipes", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Perfect Beer Pairings for 12 of Our Favorite Summer Recipes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPerfect Beer Pairings for 12 of Our Favorite Summer RecipesWe asked a brewer, a bar owner, and a chef to pair beers with some prime summer recipes. They did not disappoint.By Alex DelanyJuly 27, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailHaving a spread of grilled summer masterpieces? That’s nice. Having a beer to pair with each expertly grilled dish? That’s the mark of a true enthusiast. And yes, we’re true enthusiasts—for both beer and grilled things. While pairing usually insinuates wine, the diverse range of flavors found in beer can take smoky, charred meats and acidic salads filled with peak-season produce to whole new worlds. Plus, beer has that casual summer attitude that avoids any food-pairing pretension. We matched up some of our favorite new summer recipes with common beer styles, so that we can all jump into this pairing thing together.And here’s where it gets better. To really nail these pairings, we enlisted the help of beer professionals: Averie Swanson is the head brewer at  Jester King, a brewery known for their wild and spontaneously-fermented ales in Austin, Texas. Brittanny Anderson is the chef and co-owner of both Metzger and Brenner Pass in Richmond, VA, where she pairs local and European beer with her German and Alpine-influenced food. And Benjamin Pratt is the co-owner of New York City’s As Is (the best beer bar in the city).A brewer, a chef, and a bar owner. That’s the kind of crew you want suggesting your beers. And we asked them to pair each dish to a style of beer, not a specific beer. This way, you can pick up something from your local brewery that fits the style, instead of searching for a beer you might not be able to find. Let’s get started.Grilled Corn Salad with Hot Honey–Lime DressingBright and light, this grilled corn salad with avocado will go with everything else at your summer barbecue.View Recipe“The tart acidity from a gose, as well as the slight saltiness, will cut through the heat and sweetness of the hot honey and enhance the natural sweetness of corn. The combination of sweet, spicy and tart is making my mouth water thinking about this pairing.”  — Benjamin PrattFried Fish Sandwiches with Cucumbers and Tartar SauceFrying at home is a drag, unless you happen to be outdoors, holding a beer, and not worrying about spills or smelling up the house.View Recipe“Like everyone else in the world, I love fried stuff. At Metzger we make a lot of schnitzel and I always pair it with a super crisp German Pilsner. The crisp bitterness of the pilsner really bites through the crunchy fried fish and creamy, tangy sauce. It’s the perfect lunch beer to go with fried anything.”— Brittanny Anderson__Charred Bean and Pea SaladA riff on a three-bean salad with a garlic-chile-maple-lime dressing that we can’t quit.View Recipe“This is a bold and summery dish [there are a few chiles in the dressing], and a smoked beer like a Rauchbier would be super tight with it. The smokiness of the beer would complement the cumin in this dish, as well as making the acidity from the lime juice really pop.” __— B.A.Strawberry and Watercress SaladWe paired peppery watercress with bright rhubarb and sweet berries in an unexpected, delightful spring salad.View Recipe“This dish would pair well with the contrasting black pepper notes and the dry, crisp character of a table saison. Something low in ABV.” — Averie SwansonSpicy Kimchi SlawWe traded the goopy sweet mayo dressing in your typical cole slaw for a whipped, airy kimchi dressing. Cabbage two ways!View Recipe“I would pair a big, sweet IPA with this. Sometimes those big double IPAs can be overwhelming without food, but if you stack ‘em up against something spicy and crunchy and cold, that sticky sweetness just rounds out the whole bite.” — B.A.Grilled Spiced Snapper with Mango and Red Onion SaladGrilling a whole fish doesn’t have to be daunting, we’re here to show you how it’s done (simply!).View Recipe“I’d do a Belgian witbier here, a low-ABV beer brewed with wheat. The subtle citrus and fruit character of a witbier would complement the mango salad nicely, and the fluffy texture of the wheat would hold space for the delicate flavors of the snapper, while cooling whatever spiciness is present.” — A.S.Sticky-Sweet Grilled Pork ShoulderBarbecue god Aaron Franklin and his team came up with the recipe for this sticky-sweet pork shoulder you’ll want to make all summer.View Recipe“I’d eat this massive pork with a helles lager or pilsner, something light and crushable. The complexity of the sweet and savory glaze could easily get muddled by a more aggressive beer style. The basic biscuity flavors of an easy-drinking lager enhance the experience of the pork and help produce overall balance.” — B.P.Lemon-Pepper ChickenA summer grilling recipe from B’s Cracklin’ BBQ in Georgia, where juicy lemon-pepper chicken is a culinary tradition.View Recipe“The light acidity of a gose will definitely highlight the lemon in this dish, and the subtle salt presence in a gose will help create a seamless flavor experience, especially with a savory dish like this.” — A.S.Grilled Rosemary Lamb with Juicy TomatoesLamb shoulder: Not just for braising! We’ve got a brilliant, delicious marinade that makes it heaven on the grill.View Recipe“Witbier makes for great food beer all around. It has enough natural complexity to complement a wide range of food flavors while still being quaffable enough to be thirst quenching and refreshing, especially with something as savory as lamb. The combination of the rosemary with the spices in a witbier (coriander, grains of paradise, etc.) should complement the gaminess/minerality of the lamb.” — B.P.Spicy Grilled Chicken with Crunchy Fennel SaladThis grilled chicken packs some heat, which is why we paired it with a cooling and crisp fennel salad.View Recipe“Grilled chicken with chiles and anchovy is going to be super earthy and funky, so let’s pair like-with-like and go with a wild ale, one with lots of big, fruity, barnyard-ish flavors from a wild yeast called Brettanomyces. Wild ales can also have tartness too. The funk and acidity of the style is going to blend with those rich, salty flavors of the anchovy and it will be a big umami bomb for sure. I need that right now.” — B.A.Grilled Short Ribs with Pickled DaikonIf you’ve ever had kalbi at a Korean barbecue restaurant, you’ve had grilled flanken-style short ribs, and you can definitely make them at home.View Recipe“For short rib, we’re going to need a beer that can stand its ground. The sweet juiciness of the New England IPA contrasts the savory fattiness of the short rib and the spice of the red curry. While it may not contribute anything obvious in terms of flavor interplay, it sounds damn satisfying to me.” — B.P.Cinnamon-Oat Peach CrispThis dead-simple oat topping can be repurposed for ANY fruit. All of the fruit! Any ol’ fruit!View Recipe“The bready wheat character of a beer like an American wheat ale will resonate with the crust of a crisp. And the soft stone fruit character of this style of beer will pair perfectly with the peaches in this dish, a true summer pairing.” — A.S.And you better be drinking your beer out of the right glass:Beer Tastes Better in a Teku GlassBecause good beer deserves something better than a Solo cupView StoryExplore Bon AppétitBeerGrillSummerSummer DrinksAlcohol & Other DrinksFishChickenLambBeefSaladDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-27", "author": ["Condé Nast", "Alex Delany"]}