{"id": "accc8cfc8e145098124a2c709c5053c8", "url": "https://www.bonappetit.com/recipe/rice-porridge-with-dashi", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Rice Porridge With Dashi Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueRice Porridge With DashiBy The Wolf's Tailor, Denver, COSeptember 17, 20195.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintIt will feel like you’re putting too much bonito in the dashi, but trust—it’s what gives the porridge its savory depth of flavor. Serve with Miso Pork Ribs With Chile-Honey Glaze and Sake-Braised Mustard Greens With Sesame, all from Wolf’s Tailor in Denver, No. 10 on our 2019 Hot Ten list.Ingredients8 servings Dashi9dried shiitake mushrooms1sheet dried kombu8cups (very loosely packed) bonito flakesPorridge2Tbsp. sunflower oil4garlic cloves, thinly sliced2cups short-grain white riceKosher saltChopped kimchi, sliced scallions, red-skin Spanish peanuts, and crispy fried shallots (for serving; optional)PreparationDashiStep 1Combine shiitake and 8 cups cold water in a large saucepan. Cover and let soak at least 1 hour and up to 12 hours to rehydrate the mushrooms.Step 2Add kombu and bring to a simmer over medium heat. Reduce heat to low and cook at a very low simmer 10 minutes. Add bonito, stir lightly, and remove from heat. Let sit until bonito sinks to the bottom of the pan, about 5 minutes. Strain and discard solids.Step 3Do Ahead: Dashi can be made 5 days ahead. Let cool; cover and chill.PorridgeStep 4Cook oil and garlic in a large, heavy pot over medium heat until garlic is light golden around the edges, about 2 minutes. Immediately add rice and stir until coated with oil and fragrant, about 1 minute. Add 3 cups dashi, increase heat to medium-high, and bring to a boil, stirring often. Reduce heat to medium-low and continue to cook, adding 1 cup water at a time as liquid is absorbed so that rice is always covered by at least 1” liquid (about 12 cups total) and stirring constantly to keep rice from sticking to the bottom of pot, until rice is tender and mixture is the consistency of loose oatmeal (rice will begin to break down and become creamy after about 30 minutes). Taste and season porridge with salt and any reserved dashi if it is too bland. Porridge will thicken as it sits—add more water or dashi to thin if needed.Step 5Divide porridge among bowls and top with kimchi, scallions, peanuts, and shallots if desired.How would you rate Rice Porridge With Dashi?Leave a ReviewTell us what you thinkExplore Bon AppétitPorridgeJapaneseEast AsianAsianRiceRice & GrainsSideDairy-FreeGluten-FreeHealthyishSimmerBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "The Wolf'S Tailor", "Denver"]}