{"id": "acce72e36a0b41d8d3ed55c93eecd866", "url": "https://www.bonappetit.com/recipe/tomato-salad-with-blue-cheese-and-crispy-shallots", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Tomato Salad With Blue Cheese and Crispy Shallots Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueTomato Salad With Blue Cheese and Crispy ShallotsBy Dani ShapiroAugust 10, 20214.3(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah MortonEmailPinterestPrintEmailPinterestPrintThis recipe is an adaptation of the Mayflower Inn’s house specialty—a specialty so special that regulars of the Washington, Connecticut, restaurant have been known to revolt when it’s not on the menu, according to author (and avowed Mayflower regular) Dani Shapiro. The restaurant tops tender Bibb lettuce with blue cheese, fresh tomatoes, and house-frizzled shallots, but we make things easier with store-bought fried shallots or onions, which add the same crucial texture and depth. We love Lars Own crispy onions and Maesri fried shallots.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronShallow Serving Bowl$26.99 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonIngredients4 Servings⅓cup extra-virgin olive oil3Tbsp. sherry vinegar or red wine vinegar1tsp. Dijon mustard1tsp. honeyKosher salt, freshly ground pepper8cups Bibb lettuce leaves12oz. mixed tomatoes, halved, quartered if large3oz. blue cheese, crumbled½cup store-bought fried shallots or onionsPreparationStep 1Whisk oil, vinegar, mustard, and honey in a small bowl until smooth. Season vinaigrette with salt and pepper.Step 2Arrange lettuce and tomatoes in shallow bowls or on plates and drizzle vinaigrette over; season with salt. Top with blue cheese and fried shallots.Do ahead: Vinaigrette can be made 1 week ahead. Cover and chill. Bring to room temperature and whisk before using.How would you rate Tomato Salad With Blue Cheese and Crispy Shallots?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleOutrageously rich and delish. The dressing is perfect and the cheese was a perfect counterpoint to the tomatoes. I made my own crispy shallots since there is no chance that our little local grocery carries them. This will be a rare indulgence, prob for guests. Jkeva410Shenandoah Valley, VA8/25/2021Divine. My local (rural) grocery store does not carry crispy shallots, so made my own from our recent shallot harvest. Will make again and again, and would serve to the Queen of England.jkeva410Quicksburg, VA8/24/2021Explore Bon AppétitSaladTomatoVegetableBlue CheeseCheeseShallotOnionLettuceLeafy GreensSummerQuickEasySideGluten-FreeVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Dani Shapiro"]}