{"id": "acd697f2b626839d4dd2ab788b4a4de6", "url": "https://www.bonappetit.com/story/trader-joes-july-2021", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Trader Joe’s New Items: They Did the Oat Milk Ice Cream Thing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Did the Oat Milk Ice Cream ThingIt also did the onion chips thing, the spicy lemonade thing, and the elote dip thing.By Alex BeggsJuly 28, 2021FacebookTwitterEmailFacebookTwitterEmailThis month at Trader Joe’s, the ice cream aisle was crammed with 20-somethings wondering whether or not to get the boba coffee ice cream (answer: yes) and I had to shove myself through the crowds to grab EVEN MORE new ice cream. I nabbed one featuring not-Oatly-but-suspiciously-similar strawberry oat milk and another featuring frozen chunks of cheesecake. At the checkout aisle, a chatty cashier looked me and my partner up and down and asked, “you guys headed to the beach?” and I had to reply, “no, we just dress like this.” In the summer, everywhere is the beach if you wish it so.Here are sweltering reviews of my latest TJ’s haul, written beneath my brand-new, worth-every-penny ceiling fan:SnaaaaacksCrispy Onion ChipsIncredible. The texture is foamy and light, with sweet onion flavor and nothing else in the way. I like them crumbled on top of things, but you’ll want to eat them straight out of the bag while the Pythagorean Theorem and the division symbol and a bunch of numbers hover around your head as you try to figure out….how. They must dehydrate the onions before frying, right? How do they do it?? I’d say these are Funyuns’s hip, younger cousins who squeal in horror at dextrose and whatever else puts the Fun in Funyun (ahem, MSG). These are just onions, rice bran oil, and salt. HOW?Spicy Porkless Plant-Based Snack RindsThese pea and puffed rice “rinds” look like prehistoric falcon claws excavated from a cave of barbecue-chip seasoning. I’ve called a million snacks styrofoam-y at this point, but I’m bringing the word up again because it’s accurate. If you associate barbecue-chip flavors with pork, then sure, these are “porkless pork rinds,” but that’s a poetic stretch if you ask me. And yet no one, no one has asked at all, have they?Strawberry & Jalapeño CrispsWhoooooweeee these have some heat. And then a chewy, weirdly sweet strawberry aftertaste. Dissonance, cacophony, a baby screaming at a Metallica concert. Adding a cheese—like brie—calms down the chaos, but only slightly.Key Lime Kettle PopcornThis isn’t sitting right with me, but I keep going for another handful. If you like Froot Loops, that same not-quite-lime flavor really comes through. It’s tart and sour in a way no one invited popcorn to be. So I appreciate its nerve. How about toasted coconut kettle corn instead? Hot honey kettle corn? I have ideas. Joe, call me.Hatch Chile and Cheddar Seasoned PopcornFor the fact checkers among us: This came out last year but I never got my paws on it, okay? The popcorn has that industrialized pop look: Each kernel is super big and airy and resembles a recently unearthed skull. Trader Yorick! The heat is warming but not HOT, and that’s about my passion level for this popcorn.Canned BoozPiña Colada SmoojSpiked! Seltzer! Smoothie! The new 3 S’s. I’m in Michigan, where Smooj—oh yeaaa—is based, so I found this at my local TJ’s and had to pick it up. In writing, it’s the worst idea. Carbonated...smoothie? But I’m telling you, it works, baby. The fizzy, creamy drink tastes like a piña colada and has the fat content to match. Not fat-shaming, just letting you know that unlike other spiked seltzers full of nothingness and stevia, this is carbonated coconut cream with real sugar and everything. Love ya, Smooj.Yes Way Rosé Pink Lemonade SpritzOnce my mother-out-of-law bought a bottle of Yes Way Rosé from Whole Foods and I was like, “Yeah, I like that.” Every time I’ve gone over to her place since, she’s bought another bottle. That’s love. But this spritz is entering a competitive field. I got a chance to taste an Aussie rosé-lemonade and I liked that muuuch better—check it out. The balance here was off, the lemonade flavor muted, and the “French rosé” hitting like a wine left out on the picnic blanket too long. Needs an extra squeeze of lemon on top to revive.JuiceSpicy Mango LemonadeHere’s what I do. Cold brew some hibiscus tea by filling a little tea bag or ball with a tablespoon of hibiscus I bought in bulk last year, put it in a mason jar, fill with water, and let steep an hour or more in the fridge(it won’t oversteep). Then I fill a glass with ice, fill ¾ with the hibiscus tea, and top it off with this spicy lemonade. The first sip is spicy, but the rest is less spicy, sweet, and tart from the hibiscus. This lemonade is the BEST mixer at Trader Joe’s right now, especially if you’re the chick who always orders the spicy margarita on the menu. You know who you are. Sarah.Chocolaty ThingsOrganic Sea Salt & Nibs 63% Dark Chocolate BarThe nibs are so broken up that they give this bar a great sparkly crunch, which is fun to eat. And at 63% cacao, it’s not too bitter. Could even be fun to chop this up for fancy chocolate chip cookies.Dark Chocolate Coffee Buzz BarsThe dark chocolate is so intense I could only eat one square of the 70 gram caffeine bar, about the equivalent of four sips of coffee. It left a bitter aftertaste, like when you’ve got coffee breath five hours after breakfast and should really brush your teeth already, or get some gum, sheesh. If you love chocolate and need to stay awake at the wheel, go for it.Chocolate & Peanut Butter Joe Joe’s Sandwich CookiesPicture a Girl Scout Tagalong that’s swallowed a peanut butter-filled Oreo—sorry, Joe-Joe—and that’s what we’re dealing with here. Double-decker decadence. The peanut butter-powdered sugar frosting instantly smushes, smears, and stains every fabric you encounter the second you grab one. Or again, maybe that’s the heat.Amped-Up AlmondsReally confused why these don’t have espresso or Adderall in the coating. Misnomer! The chocolate is thick and chalky, hiding a tiny, flavorless almond underneath.Candy Coated Chocolate PeanutsNot sure if it’s the heat or a candyman with an artistic vision, but the color on the shell was speckled and faded, like Cracker Barrel decor. The green was a calming, sage green, which I hear is on trend. Otherwise, these dusty-looking, wannabe peanut M&M’s are doing exactly what they’re trying to.In the Freezer AisleBranzino Fillets European Sea BassAh yes...the European...Sea. Origins aside, inside this bag are four roof shingles of branzino, which I made into a decent curry. You could do the same.Mini French BaguettesChewy breadsticks win the award for being the second-most phallic food at TJ’s, but soy chorizo won’t be beaten! These are all texture and otherwise flavorless. Crisp exterior, chewy inside, ready for soup season.Wildberry Cheesecake Ice CreamBig blueberry flavor with chunks of cheesecake folded in. Dairy upon dairy. This has an element of something dreamed up in a bathtub, and I like that about it.Strawberry Non-Dairy Oat Frozen DessertPeople are fawning over Oatly’s new strawberry ice cream and whaddya know, TJ’s has one too! It’s good. Flecks of supposed almond brittle in the cream taste soft and dry and not sweet or brittle-like—could do without them. The oat milk ice cream base is great, though.Cheeses and NEW! DIP!Kerrygold Irish Cheddar with Chili PeppersMild cheese, mild pepper, mild thoughts.Beemster Hatch Pepper GoudaThis is spicier than the Kerrygold (but not thaaaat hot) and very creamy. I shredded it and made wonderful nachos. Different TJ’s have different cheese offerings, but if you can get your hands on this, buyyyy.Everything And the Elote Greek Style Yogurt Dip“And the elote” means we’ve got little bits of corn in this dip, which was controversial among my taste-testing buddies because it adds a touch of sweetness (and slightly slimy texture). I liked the pops of kernel, see y’all tomorrow! We’ve got Greek yogurt as the base (fine), some parm (yess), and TJ’s everything-but-the-elote spice mix, which relies mostly on chipotle, cumin, and chile powder. Demolished this dip with TJ’s ridged not-Ruffles.Pantry ItemsCassava Cauliflower Blend Baking MixRight off the bat, I could smell the cauliflower and I DON’T LIKE THAT. I thought making Rick’s sugar cookies would be a good test of the flavor/composition of this gluten-free flour blend. The cookie texture was great, soft and tender, but you could definitely taste the cauliflower. Faces were made. Yucks were yucked. Cookies were literally tossed. Structurally, the gluten-free flour works and that’s cool, but the taste...no. I think a simple rebrand, labelling it “Savory Baking Mix” and giving people recipes for pizza dough and zucchini bread, not PANCAKES and COOKIES, would fix the potentially hazardous results made with this flour.Organic Canola Oil SprayHow many spray oils does a person need? This one would come in handy when your niece gets her head stuck in the railing of the front porch. Nice n’ greasy.Mexican Cowboy Pinto BeansThese charro beans are great. Big fan. Creamy pinto beans, decent jalapeño presence, and a hint of smokiness. The seasoning’s strong without being killer salty. Now I’m excited to try more from this new brand.Peri-Peri SauceHOT. Sauce. Fermented chiles give it that funky, hint-of-yeast taste, which I love—but every so often you also get a chile pepper sliver. A good amount of lemon juice makes the sauce very acidic and bright. A little goes a LOUD way. I’ll mix it with mayo for sandwiches, tacos, and roasted vegetables.Organic Peach Fruit SpreadOpened this up and saw a perfect peach slice on top, which surprised me because so many Trader Joe’s “fruit spreads” are so far from jam they have to call them “fruit spreads.” Peaches, sugar, pectin, not much else in here. A keeper.Explore Bon AppétitTrader Joe'sLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-28", "author": ["Condé Nast", "Alex Beggs"]}