{"id": "acdba1a5939888f940621ea9e17bbf2d", "url": "https://www.bonappetit.com/story/maine-fourth-of-july", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Maine Is the Best-Ever Vacation Spot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaine Is the Best-Ever Vacation SpotCue the lobsters, crabs, and soft serve.By Adam RapoportJuly 9, 2019FacebookTwitterEmailPhoto by Adam RapoportFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“Wait, you’re going to Maine, too?”That was a common refrain in the halls of BA last week, as more than a few of us editors discovered that we had all basically planned the same 4th of July escape.You could attribute this coincidence to the fact that we named Portland our Restaurant City of the Year in 2018—a walkable town, rife with top-notch oyster joints, fragrant bakeries, and the requisite number of Bon App-endorsed breweries and natural wine shops.Want this letter before it hits the website? Sign up for our newsletter!Not that any of our editors would own up to this bias. Alex Delany pointed out that he’s been journeying to Sullivan, Maine—and his beloved Finelli Pizzeria —for some 15 years. Julia Kramer and her husband Zach have spent the past 10 summers at his aunt’s in Round Pond, a decidedly quaint WiFi-free zone (don’t look for any food pics on Julia’s Instagram ). Emma Wartzman and her BF hoofed it to their friend’s in Castine, where she said “he’s been coming since he was very young.”Yes, it's about the fish. But it's also about the hot dogs.\nPhoto by Adam RapoportA swirl at Beal's is the only way to go.\nPhoto by Adam RapoportWhatever. I was happy to admit that I was a Maine noob (as my 11-year-old would call me) and that I wanted to see what all the hype was about. So Marlon, Simone, and I checked as many boxes as possible, while staying with (long-time Mainer) Andrew Knowlton and family in Rockport.We caffeinated (and biscuited) at Hot 10 winner Tandem Bakery upon landing in Portland. We oystered and munched on Fox Family potato chips on the deck at The Shop on a sunny 86-degree afternoon (not what we expected) and then enjoyed a kid-friendly 5 p.m. dinner at 2018 Hot 10 winner Drifter’s Wife (order any seasonal salad on the menu, and don’t miss the supremely crispy brick chicken.)I was almost Instagram jealous of what Delany, Rachel Karten, and Co. were up to in Sullivan, but honestly, I was too busy eating lobster (and crab) rolls at McLoon’s, soft serve at Beal's, monkfish nuggets (imagine if Popeye’s opened a seafood chain) at Rhumb Line, and Sarah Jenkins’ pasta al limone with crab at Nīna June.Meet the ultra-chewy chocolate chip cookie from Tandem Bakery.\nPhoto by Adam RapoportA very summer slice from Belleville in Portland.\nPhoto by Rachel KartenAmid all that eating, we did manage to do some cooking on July 4th, firing up split-grilled lobsters and, of course, BA’s Best-Ever Barbecued Ribs.It was almost the perfect family vacation. But as anyone who’s ever been on a family vacation knows, those don’t exist. Just as we were set to jet home from Portland, we got word that our flight was delayed. And delayed again. Cue the thunderstorms. And delayed again. And eventually cancelled. Cue the 8 p.m. rental car and six-hour drive back to NYC.Cue my friend Jason Gay (longtime New Englander) DM’ing me: “Who flies to Maine?”Lesson learned. Next summer we drive.Go there: Portland, Maine, Is the 2018 Restaurant City of the YearExplore Bon AppétitMainePortland MaineSummerRead MorerestaurantsForget the Solstice, Only Tandem Bakery’s Loaded Biscuit Tells Me It’s SummerBy Alex DelanycultureWhat Does Your Restaurant Tote Say About You?By Alex DelanycookingThe Secret to the Drifters Wife's Crispy-Skinned Roast Chicken Involves Salt and... Scuba DivingBy Molly BazcookingI’m a Panzanella Skeptic, But This Fried-Bread Version Changed MeBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Adam Rapoport"]}