{"id": "ace0028b116285d24573118eece8bf74", "url": "https://www.bonappetit.com/story/rum-punch", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "A Rum Punch Recipe That's Too Good to Save For Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rum Punch Is Too Good To Save For SummerRum punch is anytime punch.By Bryan FountainSeptember 27, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where our staffers talk you through the process of making the dishes and drinks that they can make with their eyes closed.When it comes to alcohol, people have strong preferences and fierce brand loyalty. Since my grandfather was a Bacardi bigwig— you know, flying down to Puerto Rico in the 70s and 80s, wearing a linen suit and carrying a briefcase full of cigars—you might think that I’m a Bacardi diehard. Wrong. When it comes to rum, I'm generous with my love: I appreciate a nice bottle of Mount Gay, warm, brown, and mellow; other times, I’m in the mood for some high-proof white Wray and Nephew (strong! flammable! delicious!). A dark rum like Goslings? Great!That’s the beauty of this rum punch: You can use whatever bottles you’ve got knocking around. You're free to substitute rums interchangeably—mix together what you have, or maybe even use other liquors in its place (a bottle of warm tequila on the table from this past Saturday? Fine!). You could pretty much use any base spirit here and it will taste perfect each time.Maybe you’re thinking, “Earth to Bryan: It’s the last weekend in September. What am I supposed to do with this refreshing, seemingly summertime cocktail?” Well, so what if you’re gearing up for mulled wine and spiked cider? I promise this can be enjoyed any time of year! I make this for punch for every occasion: a party with friends, Thanksgiving dinner, a beach day, an afternoon park hang, or when it’s just me home alone on a Friday night because a party for one is better than no party at all. Who wouldn't want a refreshingly sweet-tart-citrusy tropical delight in the middle of fall—or winter, for that matter? Keep this one in your arsenal.Let me walk you through how it's made. I typically eyeball everything—call me a bartender—but I've also listed quantities for you precise types:First, gather your ingredients.Juices: Since you can use nearly any kind of rum you can find, splurge a little on the juice—it’s make a difference. You’ll need four kinds. First, 1 oz. fresh-squeezed orange juice (the bottled stuff will not compare). Second, 1/2 oz. fancy cranberry juice, the kind that comes in a glass bottle at Whole Foods-y places. Yes it’s pricey but it’s worth it—and so are you. Third,  2 oz. pineapple juice. I always use the one in a can—Dole is great for this. And, finally, the juice of half a lime.Grenadine: This is key! You can buy a bottle, but my good friend Al Culliton has made grenadine a whole lot better with this DIY recipe. Either way, you need 1/4 oz. grenadine.Flavorings: Orgeat (a floral syrup made from almonds), vanilla or almond extract, or Angostura bitters. A dash of any of these ingredients will elevate your punch to a whole new level.Rum: You want 3 oz. total, and I usually do 50/50 mix of light to dark (but you can do whatever combination you please—see rant above)Now onto the process.Shake: Load up your cocktail shaker with ice, fill it up with the four juices, grenadine, flavorings, and rum, and shake until you feel dizzy—30 seconds. You want the outside of the shaker to frost. It should be so cold it almost hurts. By doing this, you’re diluting the booze and combining all of the tropical flavors.Present: This is your time to be creative. I am a nerd who collects vintage tiki glassware, so I love to get fancy here. I like to make it look cute with a little lime wheel and a maraschino cherry or a pineapple wedge. Do not feel pressured to do as I do. You can put this in your fave Garfield mug and call it a day. Do make sure you use fresh ice. The rocks, as we \"bartenders\" say, are very important!!!You also can—and absolutely should—batch for a group. Make this large format by scaling up (some good old-fashioned multiplication), then throw a big ice ring in your favorite bowl and pour the punch over top. Make sure to dilute it with some water if you plan on letting folks scoop in their own cups and go on their merry way. You might be throwing a seasonal curveball by hosting a tiki party when it's cider season. So be it. With this punch, you’ll always keep your friends on their toes.Ready to rum?Rum + Sugar + Lime = 3 Perfect Summer CocktailsWhen the summer heat won't stop, it's time for rum.View StoryExplore Bon AppétitIt's That SimplePunchCocktailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-27", "author": ["Condé Nast", "Bryan Fountain"]}