{"id": "ace365d4881eb3ff0af4cfc3002f3637", "url": "https://www.bonappetit.com/story/migas-tacos", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Migas Tacos, Tex-Mex Style, with Tortillas and Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI've Been Thinking About These Spicy Migas Tacos For Two Years StraightSince I can't go to the spicy migas tacos, the spicy migas tacos came to me.By Alex DelanyMay 8, 2020FacebookTwitterEmailPhoto and Food Styling by Sarah JampelFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Over the last several weeks I’ve spent a lot of time thinking about the meals I loved back when we were all out freely roaming the world.One dish I can’t get out of my mind is the spicy migas taco from Tamale House East in Austin, TX. I ate it over two years ago but the memory has endured. I miss the feeling of traveling and going to restaurants. And even though we hardly got to know each other, I miss that taco, too.But luckily for me, migas is a dish that’s all about using what you have on-hand to make a delicious meal. And that, my friends, falls into my use-everything/waste-nothing cooking approach that’s critical to cooking during self-isolation. So really, what I’m trying to say, is that you can make Austin-style migas tacos, whether you’re in Austin or suburban New Jersey.Now, before we start, a quick note: There are a million ways to make migas. The Tex-Mex version—packed with ingredients like onions and salsa—grew from the stale-tortilla-based Mexican dish, which itself grew from the classic Spanish version of migas, made from eggs and old, crumbled bread. And when it comes to what you put in your migas, well, everyone has their preferences. (Luckily, Austinite and contributing food editor Rick Martinez and I are pretty much on the same page.) So here we go. Migas, engage. (This will make about 6 tacos, in case you’re wondering.)Cover the bottom of a cast-iron skillet with ½\" neutral oil and heat over medium-high. As it heats, cut 4 corn tortillas (though flour would work, too) into eighths and fry until deep golden brown and crispy. Transfer to a paper towel, season with kosher salt, and save for later. Not that much later. Just, like, seven minutes from now.If you don’t have tortillas but you do have a bag of tortilla chips, you can totally use those instead. I prefer frying my own because they have a better texture and you get to use up old tortillas, but use whatever you have.Next, finely chop ½ white onion, thinly slice 2 cloves garlic, and finely chop 1 of the chiles from a can of chipotles in adobo. Remove 4 whole peeled tomatoes from a can. Heat a glug or two of neutral oil in a nonstick skillet over medium-high and add the onions, garlic, chipotle, and the tomatoes, crushing them with your hands as you add them to the skillet. Season with salt. You can also use old salsa, pico de gallo, or roasted peppers here. Don't be afraid to deviate from the migas path I’m laying down for you. It’s safe to wander as long as we meet at the end.Sear the tomato mixture hard for about 5 minutes, stirring a few times in between. You want to develop some color on everything to intensify the flavor. While the tomato mixture cooks, crack 8 eggs into a small bowl and whisk them until the whites and yolks are incorporated. Season with kosher salt. Now add your fried tortillas into the skillet and toss them until coated in the tomato mixture. Add the eggs into the skillet and stir in long strokes, until the eggs are set throughout.Now, you can eat migas straight-up, but if you really want to go Austin-style and you’ve got more flour tortillas on hand, you can eat migas as tacos.To do that, heat a cast-iron skillet over high heat. (You can use that same one you fried in.) Throw one flour tortilla in the skillet and heat for 30 seconds. Flip the tortilla and add a sprinkle of meltable shredded cheese (jack, cheddar, American, muenster, or whatever you have). Heat until the tortilla has taken on color and the cheese has softened a bit, about 1 minute. Remove the tortilla from the pan, and top it with warm migas to continue melting the cheese.Then use whatever you have to top the damn thing. Maybe avocado or sour cream? A little cilantro? A spritz of lime juice? Really, whatever the hell you have or want. What matters is that you’re using what’s in your fridge. And thinking about me thinking about that spicy migas taco I had at Tamale House East. Because I am. I promise.Explore Bon AppétitIt's That SimpleTex-MexTacoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-08", "author": ["Condé Nast", "Alex Delany"]}