{"id": "acea5333bb553a18e3b4b804121e101a", "url": "https://www.bonappetit.com/story/cooking-with-wine-can-you-use-cheap-stuff", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Cooking with Wine: Can You Use the Really Cheap Stuff, or Nah? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCooking with Wine: Can You Use the Really Cheap Stuff, or Nah?It's always tempting to reach for the Two Buck Chuck. Does quality really make a difference when you're cooking with wine?By Alex DelanyDecember 12, 2018FacebookTwitterEmailFacebookTwitterEmailI love cooking with wine. But whenever a recipe calls for wine, I’m confronted with an inevitable internal debate. It happens every single time. This is how it goes:Me: Oh, we need to add wine to this recipe.Also Me: Cool, let’s look at what we have.Me (opening fridge): Well, we have this bottle of really cheap wine that’s been sitting open in this fridge for two weeks. That will work, right? I’m not going to drink it, so we can just use it and be budget conscious and everything will be great, right?Also Me: Ummm, I don’t know dude. Isn’t that bottle of wine kind of gnarly at this point?Me: Yeah, probably. Good call. So we can just run out and grab cheap wine, right? Like a three dollar bottle? And use that?Also Me: But isn’t that also pretty gnarly? Three dollars for a bottle of wine? What’s even in that stuff? What about that decent bottle of wine you have on the counter over there. I’m sure that would be great!Me: Yeah, but I kinda wanted to drink that...not pour it into my Dutch oven.That’s how it goes, without fail, and now, I’m writing this article to remind myself that there is a winner in this debate. There is a correct answer. Also Me was right: The cheapest wine available shouldn’t be your first choice when it comes to braising short ribs or adding flavor to scampi.I obviously get the appeal of that Two Buck Chuck. It’s affordable. It’s there. It might already be open. Why would you open another bottle of perfectly good wine when you could just use what’s around? In short, it’s because bad wine will make good food taste bad.When you cook with wine, you’re burning off the alcohol to get rid of that sharp flavor (and so your pasta doesn’t get you buzzed). But the rest of the flavors will remain intact, which means that if you’re using an old, oxidized bottle of not-delicious wine, all your food will taste like, well, an old, oxidized bottle of not-delicious wine. The flavors will not be pleasant, and that’s something that I can’t get down with. It’s a sure-fire way to make sure your food falls short of its potential.If your sauce is mostly wine, don't use something you wouldn't drink a glass of.\nEspecially if you’re using high-quality meat or seafood or organic vegetables in your dinner. That whole thing about not putting a bumper sticker on a Ferrari? Yeah, same thing here. Spending money on responsibly-farmed meat and produce is something we should all be doing, but pouring cheap-o wine on top of those ingredients is doing them a disservice.I’m not saying that you have to go and buy an expensive bottle of wine every time you have meat to braise. Or to open the bottle you’ve been saving for your birthday. I certainly can’t afford that. What I’m saying is that you shouldn’t use the swill. When you open a bottle of wine to cook with, just pick one that you'd want to drink a glass of, and feel good about using the rest for whatever you’re making.And that glass you drink is crucial, because it will give you an idea of what your food is going to taste like. Was the wine acidic? Your food will probably taste more acidic. Was it tannic? That bitterness will show up in your sauce. Sweet? Fruity? Earthy? All those flavors will come through in your dish. That glass you drink while cooking is nice to relax with, but it’s also a barometer, telling you what other flavors and seasonings your food will need.At the end of the day, you should buy the best wine you can afford to cook with. Maybe it’s organic. Maybe it’s not. Maybe it’s $7.00 a bottle. Maybe it’s $12.00. But you should always keep the quality of the bottle you’re using in mind, so when you get into an internal debate, you can emerge the undisputed winner.Make some wine-braised beef and see for yourself:Beef and Bacon StewYou can call it beef bourguignon if you want to sound fancy—nobody has to know how much easier it is than the French classic.View RecipeExplore Bon AppétitWineBasicallyBraiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Alex Delany"]}