{"id": "acef38d65e99ec0cb2d18d9d30c56685", "url": "https://www.bonappetit.com/story/red-sauce-shout-it-from-rooftops", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "The Aspirational Food World Tried (and Failed) to Shame My Love of Red Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Aspirational Food World Tried (and Failed) to Shame My Love of Red SauceHow Alex Pemoulie of Mean Sandwich rediscovered her favorite cuisine at Restaurant Machiavelli in Seattle.By Alex PemoulieApril 16, 2019FacebookTwitterEmailPhoto by Audrey KellyFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.As a teenager growing up in Seattle, I understood three things about Italian culture. 1. I knew to be mortified that my dad pronounced it “Eye-talian.” 2. It was actually fine that our family yelled at each other loudly because according to my mother, “In Italy they speak like that to each other all the time.” And 3. I had Italians to thank for my favorite dish: spaghetti with meat sauce, covered in a pile of fake Parmesan cheese from the cardboard tube my parents kept in the fridge.Italians we were not.It wasn’t until I dated an Italian guy during my senior year of college in Chicago that I was introduced to the world of aromatic olive oils, homemade pasta, and thinly sliced prosciutto. Our apartment always smelled vaguely of soffritto, which cooked perpetually on our ancient electric stovetop. This was real Italian cuisine, I learned—nothing like that pasteurized gloppy sweet stuff I had loved when I was younger. It was my first experience with transcendent food. Aspirational food even. The kind of food that the person who I wanted to be would eat.I would have been content to stuff my face with bread and olive oil.\nPhoto by Audrey KellyAfter college I moved to New York City and began working in restaurants. They became not just my comfort zone but my career. I worked my way up from assisting chefs to running the books to overseeing the finances for one of the largest restaurant groups in the city. All my friends were other industry people, and we constantly went to the nicest and newest restaurants, critiquing and ranking them against each other. I believed that “authenticity” in food was almost always good, that innovation was sometimes good, and that imitation was always bad. I became jealous of friends who were raised in families that ate good, authentic food, and ashamed of how I had eaten as a child. The things I’d loved—fettuccine Alfredo, unlimited breadsticks, and my absolute favorite, a spaghetti covered in butter and salty grated Greek Mizithra cheese from Old Spaghetti Factory—no longer had a place in my new life.I met my husband Kevin the day I started at that large restaurant group. I was 23, and he had recently been promoted to chef de cuisine at one of the group’s restaurants. I thought he was charming and funny. Plus, he knew how to cook, and he liked the restaurant industry as much as if not more than I did. We even shared a dream of opening one of our own one day. We fell in love, moved in together, and began planning our future while learning about each others’ pasts.Kevin grew up in a suburb of New Jersey on a 90 percent Italian American diet, and from the get-go, he was on a mission to indoctrinate me into New Jersey culture. He took me down the shore for lobsters and a swim. His family took me to restaurants like Rita & Joe’s (R.I.P.) in Jersey City, where they gave you a side of penne with your stuffed shells. For the first birthday of his that we celebrated together, he asked for a giant cannoli filled with smaller cannoli instead of a cake. Although he rarely put any Italian American food on his menus, it was always what he wanted to eat on his days off. There was never any shame in how he liked to eat.It didn’t take long before I fell in love with it all. (I even agreed to move to Jersey and open that restaurant we’d always talked about.) After years of eating at the nicest restaurants in New York City, it felt like a relief to eat food that wasn’t trying to impress anyone. It was just delicious. I found myself starting to use Italian American food pronunciations: Mutz-ah-del. Gavadeel. Brajole. Madinad. I knew my transformation was complete when I got pregnant and my natural body odor shifted to the pungent aroma of raw onions, olive oil, and vinegar—just like an Italian sub. My husband says I’ve never smelled more delicious.When I spoke about New Jersey and its foods to my friends, they thought I was either crazy or being facetious. Was I pretending to love it as much as I said I did? Did I really eat that many cold cuts? (I did, and I was proud of it.) What I had once been ashamed to admit I liked I began proselytizing to anyone who would listen. Hi, my name is Alex, and I love penne alla vodka.Then our daughter was born. After four years of running our restaurant in Jersey City, a space stocked with all the kitchen supplies we’d requested instead of wedding gifts, we made the difficult decision to sell and move to Seattle.If you’re not having the house red, a martini will do.\nPhoto by Audrey KellyI immediately missed the Italian American food of New Jersey. Where was I to get a perfect East Coast–style sub? Or stuffed shells? Or sausage and peppers?! We tried to find this food, but it was never right. We ordered chicken parm from a food truck and found it topped with only a few sad tablespoons of marinara as opposed to the mess we craved. We found several delicious Italian restaurants, but they only served traditional, aspirational Italian fare. I wanted to eat somewhere that didn’t care how Italy did it.And so, out of desperation, I tried to bring New Jersey to me. I forced my parents and sisters to turn Christmas into an Italian American affair, with a huge tray of baked ziti (which my dad pronounced zi-TEE) and Caesar salad. Kevin and I opened Mean Sandwich and launched “Jersey Night,” where we’d make all of our favorites: fried calamari with marinara, funnel cake, subs (using banh mi buns because we couldn’t find the real thing), whole lobsters, the works.East Coast transplants would flock and gush about how they couldn’t find this kind of food in Seattle. It’s true, we’d say. We miss it too. Eventually we added a traditional Italian sub to our menu full-time. We still get customers who order it and say, “I’m from New Jersey, and I’m here because I heard you guys make the real deal.” It seemed we were the only ones.Three-and-a-half years later, on a family walk around our neighborhood, I saw something incredible: Ristorante Machiavelli. I had seen it before, of course. It was directly across the street from the now-closed café where I had spent nearly all my afternoons during high school. This restaurant, the very one that my teenage friends and I joked about being mafia-run, that we never knew a single person to try, appeared like a mirage—a place I’d always seen but never really seen. Suddenly I knew what I was looking at.There it was, Ristorante Machiavelli—exactly the red sauce joint I had been looking for.\nPhoto by Audrey KellyIt was still early and the sun was out, but Machiavelli was dark inside and already filled with people waiting for tables. It was loud and smelled intensely of garlic and onions. A single bartender stirred a martini with a twist. A server left a heaping bowl of Parmesan with a solo diner. We looked at the menu, and there were all our old friends: bresaola alla Valtellinese, conchiglie della casa, tiramisù. I started laughing. It was almost too familiar. Was this real? Did we step into some vortex that delivered us back to New Jersey, Chianti bottles with melted wax and all?When our name was called, we went up the tiny flight of stairs into a small dining room, lit mostly by the streetlights coming in through the windows. A bread basket and bowl of oil and balsamic vinegar appeared. As I sat and dipped, I wondered what 20-year-old me would think of current me, sitting fewer than 50 feet from where I'd spent all those teenage afternoons, eating penne alla vodka with bowls of Parmesan. I probably would have been disappointed in myself. Back where I started, eating the food I ate as a kid, at a restaurant that isn’t on anyone’s list. It was the opposite of aspirational.Little would I have known, sitting there with my East Coast–born husband and daughter, it was also the most at home I’ve ever felt.Alex Pemoulie is the co-owner and operator of Mean Sandwich and director of finance at Sea Creatures restaurant group, both in Seattle.Explore Bon AppétitRed SauceItalian AmericanRestaurantsSeattleRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Alex Pemoulie"]}