{"id": "acfbad4dad98a601d79ce8cfd2ad0558", "url": "https://www.bonappetit.com/recipe/charred-asparagus-and-dates-with-goat-cheese", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Charred Asparagus and Dates With Goat Cheese Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueCharred Asparagus and Dates With Goat CheeseBy Mehreen KarimMarch 15, 20225.0(3)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Summer MooreEmailPinterestPrintEmailPinterestPrintIt will take you 15 minutes (or less) to prepare this textural masterpiece: snappy asparagus, creamy goat cheese, crunchy radishes, and—the star of the show—chewy charred dates. Because dates are full of natural sugars, they caramelize and char quickly in a hot skillet, turning gooey on the inside and crisp on the outside. Our new favorite topping on any plate of vegetables, they make an especially wonderful counterpart to crunchy spring produce.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Nonstick Skillet$50 At AmazonCitrus Juicer$7 At AmazonSilicone Spatula$13 At BA MarketIngredients4 servings2watermelon radishes or 3 red radishes, trimmed, thinly slicedZest and juice of 1 lemon½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, plus more2Tbsp. extra-virgin olive oil, divided, plus more for drizzling1bunch asparagus (about 1 lb.), trimmed1tsp. freshly ground black pepper¼tsp. crushed red pepper flakes8Medjool dates, pitted, halved lengthwise3oz. fresh goat cheese2Tbsp. coarsely chopped mintPreparationStep 1Toss radishes, lemon zest and juice, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a small bowl; set aside.Step 2Heat 1 Tbsp. oil in a large nonstick skillet over medium-high. Working in batches if needed, cook asparagus in a single layer, undisturbed, until slightly charred underneath, about 2 minutes. Shake pan to turn asparagus and cook, shaking pan occasionally, until asparagus is crisp-tender and charred in spots, about 4 minutes. Sprinkle with black pepper and red pepper flakes; season with salt. Transfer asparagus to a platter.Step 3Wipe out skillet. Heat remaining 1 Tbsp. oil over medium. Cook dates, stirring occasionally, until charred in spots and beginning to stick to pan, about 3 minutes.Step 4Scatter dates over asparagus, then crumble goat cheese over. Top with mint and reserved radishes, then drizzle with oil and any liquid from radish bowl.How would you rate Charred Asparagus and Dates With Goat Cheese?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI didn't have goat cheese and used Feta instead. Excellent flavor mix. AnaBananaNY, NY3/21/2022Explore Bon AppétitDinnerSideWeeknightEasyQuickHealthyishGluten-FreeNut-FreeVegetarianSaladSautéDateDried FruitFruitAsparagusVegetableRadishGoat CheeseCheeseRamadanSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Mehreen Karim"]}