{"id": "acfe799658b998473079d795466d6778", "url": "https://www.bonappetit.com/story/refuge-app", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "When I Have to Use Public Restrooms, This App Is My Refuge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen I Have to Use Public Restrooms, This App Is My RefugeWhenever I have to navigate spaces like airports and restaurants and rest stops, I’m forced to contend with gendered restrooms. By Sandy AllenNovember 6, 2019FacebookTwitterEmailIllustration by Egle ZvirblyteFacebookTwitterEmailThis piece is part of This Is Why We Travel, a hyper-specific travel guide from Healthyish and Women Who Travel.Recently in Buffalo for a reporting trip, I got up early on a Saturday and drove a little out of my way to a sight I’d seen on screens my whole life but never firsthand: Niagara Falls. The falls do stun the soul. They defy language. It is impossible to convey their thunder, the palpable rattling power of the water as it reaches this climax. You feel real small. I stood on the platform, my skin dewy. Gulls darted in and out of the mist and rainbows threatened. Friends had told me to buy a ticket to ride the boat, the Maid of the Mist. But I couldn’t do it; the line seemed slow and I was already contending with the very real problem of how I was going to pee.This is the reality of what being in public is like for me now, a big reason I seldom go anywhere if I can avoid it: Whenever I have to navigate spaces like airports and restaurants and rest stops, I’m forced to contend with gendered restrooms. That day in Niagara, I opened an app that I’ve come to rely on whenever I leave the house, called Refuge Restrooms. It’s a crowdsourced database of bathrooms that are safe(r) for folks such as myself. In any given location, you can browse the map, and up will pop purple pins denoting bathrooms previously users have added. At Niagara Falls, I browsed the app for anywhere to go nearby and, as can happen, came up with squat.I’ve known I wasn’t cisgendered for forever. But it was only a few years ago, in my early thirties, that I admitted to myself, then others, that a word for what I am is nonbinary; another is trans. At this point I don’t sufficiently pass as either “man” or “woman,” so I can go in neither a women’s restroom nor a men’s. Women give me big dramatic double takes and make snide, shitty comments. Men are scary. Either way, in a segregated restroom, supposing I could even get inside a stall, my anxiety will be so high I won’t be able to physically pee. The few times in recent years when I’ve willed myself into a women’s room, I haven’t been able to do anything except try and try and try and then sit and sweat and wait until a quiet moment when I could dart free.Especially since I’ve begun to come out, my desire to travel, to go anywhere for curiosity or pleasure, has atrophied so greatly I can’t tell if it’s gone for good.As a young person, I traveled incessantly, said yes to every opportunity to go anywhere I possibly could—I joined groups and activities so I could go on their trips abroad; I managed to get invited along on friends’ family reunions overseas. I backpacked and I road tripped. I’ve been to six continents, something like 40 countries, and all but a few of the American states. And yet, especially since I’ve begun to come out, my desire to travel, to go anywhere for curiosity or pleasure, has atrophied so greatly I can’t tell if it’s gone for good.I’m not sure the last time I took “a vacation.” I’ve planned several such trips over the last few years but cancelled them all for one reason or another. I still browse flight prices and write itineraries in my mind, but I have no plans to go anywhere. I am fortunate to live in a place I love and often tell myself there’s nowhere I’d rather go. Over the last few years, my work as a journalist and author has also necessitated a fair amount of travel. Hence, if I’m somewhere for work, I try to tack on some sightseeing.The area around Niagara Falls reminded me of the tourist sites I grew up closest to: Muir Woods, Fisherman’s Wharf. It felt like every nation of the world was there with their kids, their grandmother, their strollers and bags. A gaggle of one language and garb, and another. I walked around, scouting for a gender-neutral restroom, vaguely hoping the app just lacked data. But the restrooms were separate annexes with big signs saying WOMEN’S and MEN’S, people streaming in and out like worker bees at the mouth of a colony.Refuge Restroom’s logo features a white figure like you’d see on any bathroom sign, but rather than wearing just a dress or pants, it’s sporting a half-dress, half-pants look, on a purple background. Whenever I see this logo, I reflect on how it’s both nothing like me and everything like me, this half-pants, half-dress figure. I do hope that someday, maybe even in my lifetime, such bathroom signs will look as silly to everyone else as they do to me—signs that signify “toilet” but depict humans of binary gender.The Refuge app’s closest bathroom suggestions were an LGBTQ center and a Dunkin’ Donuts a half hour back out of my way. As often happens, I found myself daydreaming about whoever entered these data—the Dunkin’ patron, for example. I wondered about their life. I felt gratitude toward them. I’ll sometimes open the Refuge app just to be reminded that there have been other trans and gender-nonconforming people where I am, that I am not totally alone. It is such a dangerously tempting myth, when you are trans, that you are totally alone.Leaving Niagara Falls, now in some pain, I had an epiphany: I had previously seen Trader Joe’s on Refuge. I wondered if there was a Trader Joe’s nearby. Indeed, only a little off the highway, I found one. Inside, to the back, was a row of a single-use restrooms. I cannot tell you the relief.Before I got back on the road, I of course bought some peanut-butter-filled pretzels and dried pineapple and other such glorious snacks. And I opened the app and added the datapoint of this restroom, for anyone else who might need it.Explore Bon AppétitGo Here NowHealthyishessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Sandy Allen"]}