{"id": "ad0a53778e0073ec327283a4aa73619e", "url": "https://www.bonappetit.com/story/radicchio-salad-with-sour-cream-ranch", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Radicchio Salad with Sour Cream Ranch Will Change Your Winter Salad Game | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen Wilty Mixed Greens Just Won‘t Cut It, Go for Radicchio Salad With Sour Cream RanchBitter lettuce, crunchy breadcrumbs, and creamy dressing form the ultimate winter salad trifecta.By Emma WartzmanNovember 26, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailTo borrow the words of my colleague, senior editor Amiel Stanek, “There is literally not a single person on God’s Green Earth that does not like the taste of ranch dressing.” There is no greater truth than this, and I stand by it. It’s creamy. It’s tangy. It can be spiffed up in endless ways: tahini ranch, Gochujang ranch, miso-tofu ranch, yogurt ranch. And, it goes with everything—from hot wings to chicken Milanesa—as a dip and as a dressing. What’s not to love?Thankfully, Chris Morocco made up a new excuse for us to eat the stuff all winter long with the standing ovation–worthy Radicchio Salad with Sour Cream Ranch, a swoon-worthy trifecta of bitter radicchio, creamy dressing, and crunchy breadcrumbs. It’s easy, it’s satisfying, it’s everything you want when the rest of the produce on the shelf has taken a turn for the worse.Let’s start with the dressing. It is made up of equal parts whole-milk Greek yogurt and sour cream, along with sherry or apple cider vinegar for tartness, one grated raw garlic clove for some spiciness, a small amount of honey to cut through the garlic, and finally some olive oil to round the whole thing out. It is an exemplar in balanced flavors that honestly deserves to be eaten straight-up with a spoon.Everything is coming together.\nPHOTO BY MICHAEL GRAYDON + NIKOLE HERRIOTT, FOOD STYLING BY REBECCA JURKEVICH, PROP STYLING BY KALEN KAMINSKIAs for the lettuce, Chris recommends Castelfranco radicchio for both its taste and looks. “It tends to be more tender and mild than Chioggia (the round one) or Treviso (the spear-shaped one),” he says. “Plus, everyone has seen red varieties before. The white is more dramatic.” I couldn’t find Castelfranco at my grocery store, so I ended up using all Chiogga. The result was a bit too bitter for me, but Chris recommended subbing in one of the two heads of lettuce for endive, which isn’t quite so biting. And, for what it’s worth, another sturdy lettuce like Romaine or even raw kale would work, too.The final step is making the breadcrumbs, which offer a textural diversion of the best kind: crunchy! Chris calls for Panko, the Japanese breadcrumbs that are in slightly bigger pieces than those fine Italian-style breadcrumbs. You sauté them in olive oil along with a couple of thinly sliced scallions. “When alliums are caramelized, they have a bit of sweetness in them, too, which helps pull the whole dish together,” Chris says. “It complements the toasty-ness quite nicely.”So next time you’re planning dinner, leave the sad Mesclun mix at the grocery store, forget your simple lemon vinaigrette, and make this showstopper instead.Get the recipe:Radicchio Salad with Sour Cream RanchWith salty, sweet, and creamy components, this recipe is more than just a salad: It's a fully realized side dish.View RecipeExplore Bon AppétitSaladRadicchioBreadcrumbsSalad DressingWinterRead MorecookingHow to Make a Thanksgiving Salad That Everyone Will Actually EatBy Sarah JampelLifestyleThe Pizza Place We Can't Stop Going To...For the SaladBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-26", "author": ["Condé Nast", "Emma Wartzman"]}