{"id": "ad11fb387bef41b2a4d860c00ec0b0c0", "url": "https://www.bonappetit.com/story/tropical-cognac-swizzle", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "This Tropical Cognac Punch Will Warm Even the Wintriest Holiday Parties | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tropical Cognac Punch Will Warm Even the Wintriest Holiday PartiesA complex and historic spirit, Cognac is the ideal base for big-batch cocktails.By Shyretha SheatsDecember 3, 2021FacebookTwitterEmailPhotograph by: Emma Fishman Food Styling by: Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I had my first taste of cognac with friends at a long-ago pregame. The grape-distilled spirit was disguised in a sugary green mixed drink that seasoned millennials may know as the Incredible Hulk—equal parts Hennessy and Hpnotiq, famed at P. Diddy’s erstwhile Justin’s Restaurant in Atlanta. From the first sip the essence of prunes took over my senses. I declared then and there that I was not a cognac lover.Once I became a bartender, I learned about rancio, a chemical process that occurs naturally as cognac ages in oak barrels—and creates that dried fruit flavor I initially disliked. But the more I experimented, the more fascinated I became with how cognac’s aromas and flavors would change depending on whether I mixed it with other ingredients or poured it over ice.A type of brandy that comes only from the Cognac region of France, cognac is classified based on how long it spends in those oak barrels: VS (Very Special), at least two years; VSOP (Very Superior Old Pale), at least four years; and XO (Extra Old), at least 10. A young cognac might have accents of red roses, underripe bananas, and stone fruit, making it perfect for cocktails, but age mellows it into a smooth, dark, deeply flavored sipper.Cognac has been popular in sweet punches since the 18th century; the key is finding harmonious ingredients that accent the spirit’s complexity rather than masking it. In this recipe, that means fresh lemon juice and a creamy herb-kissed pineapple syrup that’ll transport you somewhere warm and tropical, which is ideal for the holidays—no matter where you actually are. Which cognac should you use for cocktails?Pierre Ferrand is unparalleled for its quality and price point. Try the fruity 1840 Original Formula, developed especially for mixing, or choose the Ambré, which at 10 years old could be labeled an XO, for a smoother, richer cocktail.Ferrand 1840 Original Formula Cognac$50 at Reserve BarFerrand Ambré Cognac$50 at Reserve BarMix it Up:Cognac Punch SwizzleCognac doesn’t deserve to gather dust in the back of your liquor cabinet. Here it fits seamlessly into a tropical punch with the help of a creamy condensed milk and pineapple syrup.View RecipeExplore Bon AppétitThe PourcookingShoppingRead Moreculture33 Punch Recipes to Get the Party StartedGallery33 SlidesBy Bon Appétitrecipes22 Amazing Whiskey Cocktail RecipesGallery22 SlidesBy Bon AppétitcookingA French 75 Will Make New Year's Feel Fancy, Even If You're Wearing Pajamas By Al CullitonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-03", "author": ["Condé Nast", "Shyretha Sheats"]}