{"id": "ad16fe3af033083cca9666251280b65f", "url": "https://www.bonappetit.com/story/cheese-plate-party", "year": 2021.0, "month": 10.0, "day": 2.0, "content": "How to Turn a Snack Board Into a Dinner Feast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Turn a Snack Board Into a Dinner FeastTips for creating a snack board that’s fun, filling, and stress-free from Katherine Lewin, owner of the dinner party essentials store, Big Night.By Tiffany HopkinsOctober 14, 2021FacebookTwitterEmailClockwise: Bleu des Basques, Cantal, Capriole Dairy Wabash CannonballPhoto by Alex Lau, Food Styling by Anna Billingskog, Prop Styling Astrid ChastkaFacebookTwitterEmailThis story about snack boards is part of The New Rules of Dinner Parties, a new collection of advice, recipes, and perspectives on one of the things we’ve missed the most. Read all the stories here.I usually don’t like rules. But whenever my friends and I decide to hang out in one another’s living rooms past 4 p.m. to eat good food, drink a gallon of boxed wine, and laugh (and cry) about everything going on in our lives, we abide by a single rule: Don’t call it a dinner party. The term dinner party adds an unnecessary layer of stress. It makes me think of Martha Stewart’s kitchen in the early ’90s—no shade, I love Martha and her flower-embellished frozen vodka—but I am not her. And the thought of hosting, or even attending, an extravagantly dazzling dinner party makes me sweat.Get even more dinner party rules:ContentThis content can also be viewed on the site it originates from.My favorite get-togethers are always the ones that satisfy everyone’s appetite, exude a chill vibe, and induce zero pressure to impress others. Katherine Lewin, owner of the Brooklyn-based dinner party essentials shop, Big Night, agrees. That’s why she recommends skipping the “dinner” part of dinner parties altogether—and unleashing the potential of an epic cheese plate. “I think there’s something about dinner parties that feels constraining and somewhat theatrical,” Lewin says. As a host, you’re stressed about creating a menu and having everyone move through the meal at the same time. And as a guest, you’re worried about saying all the right things, not lingering too long over each course, and whether or not you should assert your dietary preferences. Lewin argues that “the idea of a snack table, or a format that isn’t a three-course dinner, gives people freedom and creates a relaxed environment so everyone can eat what and how they want.”As temperatures drop and cozy nights creep up on our social calendars, Lewin explains how she takes a simple cheese board from appetizer to main event. Here are her five best tips for creating a convention-defying snack table that is varied, delicious, and fun.Cheese, duh—but also dips and a huge tin of fishObviously, cheese is a big component of any snack platter. When it comes to which varieties you should buy, Lewin loves the classic sweet and savory combo. Think red pepper jam with goat cheese, cherry jam with blue cheese, or strawberry jam with cheddar. But don’t stop there. A charcuterie-esque dinner party is an opportunity to go beyond cured meats and cheeses and serve a bunch of items that are snacky and fun, but also filling. “I like serving a great dip that can be used in multiple ways on the same table—like a fresh green goddess for dunking crudités, roasted veg, or potato chips,” she says. “Then I mix that same dip into something like tinned tuna that people can then spread on bread or crackers.”Canned seafood is definitely having a moment. Lewin suggests serving a variety of not-too-fancy-but-still-very-chic tins of sliced octopus, calamari, or codfish. “It’s an experience in and of itself that’s perfect for a dinner party,” she says, “because people get to taste their way through them and pick out their favorites. It’s also a great way to add protein to the table.”Don’t have guests bring a dish. Do have them bring a condiment they’d like everyone to try.Asking guests to bring an entire dish puts a lot of pressure on them—which is not very chill unless it’s a potluck and they know what they’re getting into—but serving all the food in a snack format allows everyone to bring a stand-alone item that they’re passionate about and want to share with the group. We’re talking cool condiments, like strawberry fig and chipotle jam, orange blossom honey, or French churned butter. “It becomes this fun show-and-tell thing where everyone’s contributing to the table, thanking one another, and saying, ‘OMG, what is this thing? I have to know more about it. I’m gonna go out and buy it tomorrow,’” Lewin says. “It turns the dinner into a real conversation starter.”Embrace your random, mismatched dinnerwareThe thought of making a perfectly manicured, IG-worthy cheeseboard can feel intimidating. The portions! The placements! The symmetry! But it doesn’t have to be complicated. Lewin advocates for using a hodgepodge of serving vessels and materials. “Wood and resin with different colors, textures, and styles can bring personality to each thing you’re eating,” she says. “The snack table wants that!” On a purely aesthetic level, a unique vessel can go a long way in making anything look good—even if it happens to be a plate of beige store-bought crackers. (If you’re keen on a matching set, though, we’ve got you covered too.)Practice on a Tuesday nightI can’t think of one good reason to save your snack plate for a dinner party. Who doesn’t want to chow on cheese and crackers in front of the TV on a weeknight? Plus, practice enough and snack-platter mastery will be second nature and stress-free when it comes time to host. “Cheese pairings tend to stress people out,” Lewin says. “I think that’s because no one thinks about them until they’re about to host 10 people.” Then the panic sets in. What is Butterkäse cheese?! How do I know if it's gonna be good?! You can avoid the meltdown by treating yourself to different cheeses and new flavors regularly.Lewin finds her own inspiration via customers who come into Big Night and buy a bunch of different cheeses, crackers, jams, and honeys. “I ask them if they have a big party coming up, and they’re [often] like, ‘No, I’m just having this for dinner,’” she says. “It becomes a zero-pressure situation when you’re eating alone in your pajamas at your kitchen counter at 9 p.m.”Explore Bon AppétitPartiesDinner PartiesCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-14", "author": ["Condé Nast", "Tiffany Hopkins"]}