{"id": "ad2b9d02399d79dd14719bd9e58e0979", "url": "https://www.bonappetit.com/story/fire-island-rustic-bakeshop-alaskan-winter", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Fire Island Rustic Bakeshop Gets Me Through the Long Alaskan Winter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsFire Island Rustic Bakeshop Gets Me Through the Long Alaskan WinterIt takes about .01 seconds inside the bakery to understand just how seriously these people take bread.By Genevieve RothJune 6, 2018FacebookTwitterEmailPhoto by Merrik BrownFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Everyone who grows up somewhere people like to vacation knows about two kinds of places in their town. The places “for them” and the places “for us.” Times Square is for them; Riverside Park is for us. Pink Taco on Sunset Strip—them; Gjelina on Abbot Kinney—us. This distinction isn’t necessarily about quality—there are plenty of good meals to be had at places for them (see Café du Monde in New Orleans, Joe’s Stone Crab in Miami Beach). Nor is it another rendition of the “Oh, the locals love this place” line that tour bus operators like to whisper in the ears of their patrons. This “for us” is about intent. It’s about a business built by and for local people, by someone who loves their town enough to want to make the act of living in it a littler sweeter and more delicious.Fire Island Rustic Bakeshop in Anchorage, Alaska, is a place “for us.” Housed in a nothing-special building in a residential part of Anchorage with lousy parking and a checkered past (chosen by the founders in the hopes of improving the neighborhood, a plan that appears to have worked), the bakery wasn’t opened with the intention to serve the legion of tourists who flock to Anchorage every summer to take selfies against the backdrop of Mount Susitna. Fire Island was established by lifelong Alaskans Janis Fleischman and Jerry Lewanski, a retired school assistant principal and her husband who hired their daughter and son-in-law as their first bakers. This place was  built for actual Alaskans, the kind who know that June is a prize won only by wresting victory over February, a month so dark and relentless that its pain could only be salved by a raspberry scone the size of a rugby ball.Fire Island is an altar to bread, with classics like Alaska whole wheat and Fire Island sourdough turned out daily and specials like challah, plum flax, and sprouted grain offered on specific weekdays. It takes about .01 seconds inside the bakery to understand just how seriously these people take bread. It’s everywhere, taking pride of place on the biggest counter in the shop, stacked on baking racks in the open kitchen, sketched in chalk on the daily menu. The current baker, Carlyle Watt, was was named by the James Beard Foundation as an \"outstanding baker” semi-finalist in 2017. And outstanding he is. Give anyone behind the counter half a chance, and they will gladly recount the story of their sourdough starter or outline every seed used in their Vollkornbrot, a dense pumpernickel that is as proud a home for smoked salmon and dill as any bagel from Manhattan. (If you still question the Fire Island loyalty to a good loaf, know this: An entire section of the company website is dedicated to its storage, complete with recommendations for auxiliary reading.)A spread of options from Fire Island.\nPhoto by Linda MurphyThe pastry case offers a disorienting, fine-boned selection of cakes and tarts more likely to be associated with French accents and pastry obsessives than the ruddy-cheeked and bearded clan you’ll typically find behind the counter at Fire Island. Think polenta cakes topped with chubby blackberries baked with flecks of Earl Grey and lemon tarts drizzled with tiny threads of dark chocolate. Between the delta of sourdough and galettes runs a trail of classics: chunky chocolate chip cookies; massive, flaky scones in flavors like blackberry-rhubarb and ham, cheddar, and chive; and a cupcake selection that my picky sugar-obsessed fiancé has deemed G.O.A.T. And I promise you, he’s consumed enough cupcakes in his lifetime to be considered an authority.But I dare say the food isn’t even the most special thing about Fire Island. Three summers ago, the caterer for my brother’s wedding dropped out of his family brunch less than 24 hours out. I called Fire Island. The next morning, a shopgirl greeted me with a tower of boxes full of enough warm scones, pastries, and bread to feed our army, and a hot cup of coffee and a cookie for the road, which she rightly guessed I could use.It’s an early stop on any trip home, and I know that once I’m inside I’ll be greeted by the familiar smells of bread and cooked fruit as well as my high school running coach or the woman from my mother’s book club, whose name I never quite remember but whose face I am always happy to see. It’s a place where people stop in daily for coffee and a morning bun after they’ve dug out their tires from the snowfall the night before, or take the soccer team postgame in the summer months for cupcakes. It’s the perfect spot for nourishment or just company, the highest quality of both are always on offer. My friend Elizabeth, who has lived a few blocks from the flagship shop since it was established (the owners added a second store two years ago and another one is set to open in just a few months), says one of the few things she appreciates about Anchorage in January is that it’s when the Fire Island staff goes on a several-week hiatus, which means she loses weight and saves money.This is what defines a place “for us.” It’s a place that weaves its way into the fabric of your daily life—and leaves you better for it. Sure, visitors flock to Fire Island in the summer months now, and as well they should—the owners and staff deserve every good thing, including the success that comes with making the guidebooks. So please, come check it out on your trip up north and tell your friends. Just know that while it may seem like it’s for you, the good people of Anchorage, Alaska, are only sharing.Genevieve Roth is a fellow at the Harvard Kennedy School.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsBreadRead MorecultureLove Is a Cold Cocktail in the Middle of Frigid AlaskaBy Maya WilsonrestaurantsBull Moose and Canned Everything: Growing up on an Alaskan DietBy Alexis M. SmithWhere to eatAsk a Local: An Insider's Guide to Anchorage, AlaskaBy Elyssa GoldbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Genevieve Roth"]}