{"id": "ad3843563aaf8e30ca953051bb95b8ad", "url": "https://www.bonappetit.com/story/mindful-eating", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Mindful Eating Is Possible: Here's How to Put Down Your Phone and Give it a Try | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Put Down Your Phone and Give Mindful Eating a TryMindful eating sounds great, but how do you resist distraction and actually make it work?By Natalie ZisesSeptember 17, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailI get asked a lot how I went from being a line cook, urgently prepping and tasting hundreds of dishes a night, to an eating psychology coach, helping people have a mindful, energizing, and pleasurable relationship with food and their bodies.Here’s the summary: After three years as a line cook, blasting my gut with nightly sequences of melted ricotta, pork belly, chocolate torte, citrus vinaigrette, ragu, more vinaigrette, and finally a burger and a beer, I (not surprisingly) developed severe digestive and autoimmune issues. I left the restaurant industry and set out to heal myself through food. But, four months in, I was dismayed when my new diet of green smoothies and quinoa bowls wasn’t doing the wonders I had expected. I mean, I was following the same diet as all those cheerful, svelte, dewey-skinned health bloggers, so...what was I missing?While I was no longer stuffing my face with a merry-go-round of fatty, salty, acidic bites each night, the method was all too similar: I often ate rushed, standing up, and distracted. Over time, and lots of trial and error, I began to figure out that the way I was eating was at the root of my digestive issues.In my new career as an eating psychology coach, almost all my clients suffer from digestive issues, whether they know it or not. Fatigue, eczema, food allergies, acne, asthma, and even brain fog are all signs of a struggling gut. We all know the saying, “You are what you eat,” but what’s maybe more relevant to our generation is “you are how you eat.” We’ve all heard about mindful eating, but what about mindful anticipation? So much of our ability to digest our food (a.k.a. absorb nutrients and burn calories) comes from a phase of digestion called the “cephalic phase”. This is the part of eating where—get this—we are excited about our food: meal foreplay, if you will.When our mind is excited and anticipating the delicious meal coming our way, our body has time to produce digestive enzymes, send blood flow back to our digestive center, and get our digestive juices flowing. In the days before smart phones and TV screens, we spent a lot more time mentally prepping ourselves for what we were about to eat. Now, it’s a fraction of that time. We decide we’re hungry, we make or order our food, and more often than not we scarf it down before even realizing what just happened. Sound familiar? Well, without this crucial phase of acknowledging and anticipating a meal, our brain has trouble telling the body: “Hey, food’s on the way.”But don’t think you’re off the hook when it comes to the actual eating part: paying attention to your food while you’re eating it keeps this phase going and helps signal to your pleasure and satiety center, “Hey! I received this...I’m done!” Without that awareness, they don’t receive the message (or receive it too late), which may cause you to overeat, binge-eat, and experience general feelings of blech.Here are some of my favorite tips for both mindful food foreplay and eating that I’ve found help improve digestion for both me and my clients:1. There’s An App For That!Insight Timer and Headspace are apps with meditation programs that specifically target mindful and emotional eating. With meditations as short as one minute, you'll always have time for a quick breath before breakfast! I find the more regularly I do it, the more my body craves it. I even notice a difference when I take 60 seconds to breathe before my meal. It's a small but powerful shift.2. The Four QuestionsIf you’re not into the apps, asking yourself these four questions can help transport you from a stress-filled mind to the less anxious present:What do I see?What do I taste?What do I hear?What do I smell?Engaging your senses is one of the most foolproof ways to lower stress, as it forces you to be present and maybe forget for a few minutes about that big presentation or your rising inbox. Plus, it’s free, quick, and doesn’t require technology.3. Count Your ChewsThis one I find to be the hardest, but I’m working on it! Experts say you should chew each bite 10-30 times before swallowing, depending on the texture. I noticed I probably chew about five times, so I started aiming for at least 10. The mechanical digestion of  teeth and the chemical digestion of saliva are the first in the line of digestive defense. Without them you’re missing out on a whole lot of digestive power!4. Say AnythingThe tradition of saying grace or blessing our meal actually serves a physiological purpose. By verbally acknowledging what's in front of you and the food you're about to eat, it helps your brain signal your body to start producing digestive enzymes and get ready to receive some food! And get this—some cultures believe that blessed food changes its chemical structure to be healthier for your body. Even if you're not religious or spiritual, think about a little mantra you could say to yourself pre-eating. For example, \"Thank you body for enjoying and absorbing this delicious food.\"5. Change Up Your ViewThis one can be the hardest habit to break...and it’s not your fault! Breakfast while you scroll through Insta, lunch doing work at the computer, and dinner watching The Bachelor can easily become routine. Yes, sometimes screens can seem relaxing, but they’re also totally distracting your mind from the fact that you’re eating, and you end up craving even more food. To help myself temper this, well, addiction, I like to make a screen-free date with myself 2 or 3 times a week—even once is great! Take yourself out to a meal. Let your mind wander, brainstorm what color to paint your living room, what restaurant you want to visit next, or just focus on the delicious breakfast taco in front of you. Notice how you feel afterward. Notice your stress level. Then go from there.Explore Bon AppétitHealthyishHealthyTrendsRead MorecultureWhat a Group of Progressive Nuns Taught Me About Mindful EatingBy  Gina CilibertoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-12", "author": ["Condé Nast", "Natalie Zises"]}