{"id": "ad3c397fa38507f4995fa1720957c02a", "url": "https://www.bonappetit.com/story/cooking-lessons-i-learned", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Oh, I Work at a Food Magazine Now? Guess It’s Time to Learn to Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOh, I Work at a Food Magazine Now? Guess It’s Time to Learn to CookThis year, I got over my fear of cooking. Here are the six biggest things I learned...the hard way.By Hilary CadiganDecember 27, 2018FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailIn case we’re meeting for the first time here, let me start with a confession: I work at a food magazine, yet I am a terrible cook.Why? Not sure. Perhaps it's because my greatest childhood food memories are tied to branded shortcuts: Pillsbury Funfetti cupcakes slathered with Duncan Hines frosting straight from the tub; pre-cut broccoli baked beneath a bubbling blanket of Sargento shredded cheddar; the indubitably excellent mouthfeel of dinosaur-shaped Perdue chicken nuggets sidled up next to Nickelodeon-orange piles of Kraft mac and cheese that my brothers squeezed honey into for a gourmet twist. Perhaps it's because I'm afraid of failure. Perhaps it's because I am very lazy. Whatever the case, I've always enjoyed eating very much. I just never got into the cooking part.But since I started working at Bon Appétit back in April, a large part of my job became: getting into the cooking part. Or at least not having a panic attack every time I'm asked to cook through a recipe. And thus, I have dedicated the last eight months to learning my way around a kitchen, that room I’ve always had in my house but mostly used for storing alcohol and making salads from a bag. Recipe by recipe, food fail by food fail, unfollowed piece of Test Kitchen advice by unfollowed piece of Test Kitchen advice, I have grown. And now, as I prepare to enter 2019, I know one thing for sure: I’m no longer afraid of cooking. No, I’m not a master yet—not even really at the level of first-kid-to-get-kicked-off-MasterChef Junior. But I’m learning, and actually...kind of...enjoying it! So here, to round out the year, a look back at some of the biggest kitchen lessons I’ve picked up so far. And with them, a vow: In 2019, I will officially stop calling myself a terrible cook.1. Always be salting. I grew up in the ’90s, when salt was the devil and margarine was something people actually paid money for—instead of throwing it into a dumpster where it belongs. Which means I always had this scary little voice in the back of my head screaming “NOOOOO” when my hands reached for the shaker (funny enough, these were the same hands that often shoveled entire not-individual-sized bags of Goldfish into my mouth in one sitting). But as I cooked through recipe after recipe, I realized that salting properly means going about 75 percent beyond your comfort zone, and building as you go. At no moment did this lesson become clearer than when I was making Basically’s Spaghetti Pomodoro, which instructed me to make my pasta-boiling water AS SALTY AS THE DAMN OCEAN. Surely that’s insane?? thought I. But I took a deep breath, closed my eyes, reached for the Morton canister, and poured. And you know what? It was the tastiest pasta I've ever made.2. Read the whole recipe BEFORE you start cooking. File this one under lessons learned the hard way. The hard way being me going home starving at 7 p.m. to make a stew that ended up requiring not just about three hours of cook time but an additional 12 hours of chill time before it was actually ready to consume. I would have known this had I spent the literal two minutes it would have taken to read through the instructions before I flounced off to the grocery store to buy my chicken. But I did not. It was a disaster, and the next day on office Slack no one even felt sorry for me. “READ THE RECIPE ALL THE WAY THROUGH BEFORE YOU COOK, CADIGAN. RULE NUMBER ONE.” Oh.3. Don’t use crappy equipment. For more years than I care to admit, I cooked my scrambled eggs in a scratched-up mini frying pan I’m pretty sure my ex-roommate purchased at the Dollar Store in 2010. My eggs never cooked right—and often had a kind of weird chemical-y aftertaste that I still fear has shortened my life by several years. But it’s not that I was bad at cooking eggs—it was that I was desperately in need of a new pan. Once I upgraded (my colleagues recommended this tried-and-true yet not-that-expensive Zwilling non-stick), everything changed. Now my eggs are fluffy and my heart soars free. The lesson? You don’t need to go out and blow all your money on top-of-the-line everything. But flimsy knives and too-small cutting boards are a form of masochism neither you nor I should abide, and this entire list of kitchen essentials costs less than $250.4. Browning butter makes it better. As anyone who knows me knows, I love butter. Like, a lot. I slather it onto breads with a thickness most reserve for cheese (butter is better than cheese; fight me) and bury half a stick inside my mashed potatoes so I can tap into it later and watch it flow out like lava. Butter makes everything better. But until I made Chris Morocco’s famous Snickerdoodle Party Cookies, I’d never embarked on the adventure that is browning butter. The first time you try it, it may seem like something bad has happened, like maybe your Dollar Store pan is decomposing into itself and shedding poisonous faux metal bits into your melted butter pool, but no, those are the milk solids (milk solids! Look at me now!), and when browned on the stove they suddenly taste like your wildest, smokiest, nuttiest, fattiest dreams.5. Cook to the indicator, not the time. One of the crappy equipment issues I can’t solve is the crappiness of my oven, because it is not technically my oven but my landlord’s and I cannot afford to buy one of my own. Which means the fact that the thing lies to me every day is beyond my control. “Four hundred degrees!” she says, and we both know it’s not true, because I was told to cook that chicken at 400 degrees for 35 minutes and it’s been 51 minutes and the thing will definitely poison us all if I take it out now. And therein lies this very important lesson: When you’re cooking, DO NOT rely on the cook time the recipe gives you. Instead, use the helpful indicators it provides right afterwards: “until golden,” “until the meat is almost falling off the bone,” “until the rice begins to crisp.” The indicators are your friends, even when your lying sack of shit oven is not.6. Lock your cats in the bathroom while you cook. Otherwise, they will lick all the chicken and you’ll admit you ate it anyway and people will destroy you on Twitter. But like, at least I salted it.Explore Bon Appétitholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-27", "author": ["Condé Nast", "Hilary Cadigan"]}