{"id": "ad50f878d4428031d49d010bd55767bf", "url": "https://www.bonappetit.com/story/cooking-obsessive-compulsive-disorder", "year": 2019.0, "month": 2.0, "day": 1.0, "content": "Obsessive Compulsive Disorder Made Cooking a Compulsion. Then It Was My Cure. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCooking Every Day Was a Compulsion. Then It Was My Cure.It’s difficult to pinpoint the moment when I became so crazed that I essentially started living in my kitchen full time.By David TamarkinFebruary 6, 2019FacebookTwitterEmailIllustration by Daniel SalmieriFacebookTwitterEmailWhen I was eight or nine or ten years old, I found a daddy long legs layered in the sheets of my bed. I tossed it to the floor, crushed it with a book, and thought about it every night for the next 20 years.I shook my sheets. Every evening I stripped my bed and whipped the sheets like you would a picnic blanket before laying it in the park. I lifted the mattress. I shined a light into the corners of the bed frame.In college there was a boy in the bed. That didn’t stop me. He’d lay there, his arms at his sides or wrapped around himself to stay warm, and tell me what I was doing was insane. Can you please not?It was a different boy that finally, at age 30, got me to stop. He was my live-in med-student boyfriend, and he went to bed before me. I’d stay up hours later and sneak into bed quietly, unable to slip off the sheets that were tightly wrapped around him. I learned to silently slide into bed next to him, feeling I was risking something each time but also feeling relief.That relief stayed with me. After the doctor and I broke up, I did not shake the sheets. After I moved to a new city, to a new apartment, to a new bed, I did not shake the sheets.So, several years later, when I found a bedbug squirming among the dirty socks in my hamper, I was able to hold myself together. I called my landlord, took some deep breaths, and eventually got into bed.I lay there, resisting in the dark. But I knew what I would do, what I would not be able not to do. I stood up. I turned on the light.And then I shook the sheets.It’s difficult to remember when my reaction to the bedbugs slid from measured to maniacal, to pinpoint the moment when I became so crazed that I essentially started living in my kitchen full time. Within a week of seeing that bedbug (and, finally, after much searching, snatching a second one off the floor), every piece of clothing I owned had been either lugged to the laundromat and heat-treated in those loud commercial dryers or sent off to a special dry cleaner that specializes in bedbug infestations (one of many bedbug-related businesses that prey on people in a panic). I’d opened every drawer and wiped it down with alcohol. I’d sprinkled my bed frame and floor with diatomaceous earth.I spent hours in front of the mirror, inspecting every burst blood vessel and freckle on my body.All of this is normal bedbug procedure. You do all this, the exterminator visits, you wait two weeks—living out of plastic bags—and the exterminator comes again. Then you unpack and get back to normal.Except that the exterminators who came to spray my walls with poison could not find an infestation. They were not in my bed, they were not in the floorboards. I showed them the specimen I had found (I’d trapped it in a plastic bag, where it still squirmed occasionally); they agreed it was a bedbug but told me maybe I’d only had one.I told them to keep looking. I felt itchy all the time. I spent hours in front of the mirror, inspecting every burst blood vessel and freckle on my body. I took pictures—of my skin, of my sheets—and actually sent these pictures to my landlord as proof, limp as it was, that I needed the exterminator to come back. The landlord complied. When I demanded he fire an exterminator I deemed incompetent, he sent another.Many months of this exhausted my landlord’s patience. When he told me they were done sending exterminators—\"They never find anything, David\"—I spent $350 to hire my own.When that exterminator came into my apartment, the first thing he said was “Damn. You don’t have to keep your clothes out like this, you know.” My bags of clothes, which I continued to drag to the laundromat every week to heat-treat, just in case, were piled on my couch, on my chair, on every sitting surface. I hadn’t sat down in my apartment for months.“But there’s an infestation,” I told him. I showed him the bedbug I had found many months ago, now finally starved and dead in the plastic bag. Then I handed him a second bag, this one with the bedbug I’d found on the floor.He took off his glasses, peered at the bug, shook his head, and handed the bag back to me. “That,” he said, “is a tomato seed.”Throughout all of this there was labored breathing. There were regular night terrors, when I’d shoot up from sleep, choking on air. There was a panic attack that started in the backseat of my parents’ car and ended in the emergency room. There was the diagnosis from my therapist: obsessive, compulsive, and, looking back, probably OCD for my entire life. And there were more hours than I had ever spent before at the countertop in my kitchen.Bedbugs prefer to luxuriate in mattresses and comforters. They can give or take a bathroom, and they don’t care about the open bag of graham crackers in the kitchen. So those were the places I stayed.Already used to cooking most of my meals at home, I suddenly became a project cook. I boiled dough for bagels, braised hulking chunks of pork shoulder, steamed pounds and pounds of mussels, griddled more pancakes than I could eat. Sometimes I just stood there. I had a counter made of thick, cold marble; when I pressed my hand into it I felt the cool spread throughout my body and open up my lungs.My therapist had given me rules to follow: Stop checking your skin for spots. Sit on the couch. Unpack every single item of clothing, and throw the plastic bags away. My obsession was the fear of bugs; the compulsion was my avoidance. “Compulsions feed obsessions,” my therapist told me. I had to starve one to starve the other.But there was no rule about leaving the kitchen. So while I slowly followed through on the other stuff—it took weeks for me to sit on the couch and watch a television show—I still spent most of my time at the marble counter.A few months later I went a step further: I decided my New Year’s resolution would be to cook every meal, every day, for the entire month of January. By this time my clothes had been unpacked for months, I was sitting on my couch again, and 95 percent of the time, when I went to bed at night, I slid in without so much as looking under the covers. (I winced as I did it, as if I was lowering myself into a hot bath. Of acid. But still.)\"Compulsions feed obsessions,” my therapist told me. I had to starve one to starve the other.But what’s obvious to me now—but I did not admit to myself then—is that my resolution was not a salve for my compulsions, but instead a compulsion of its own. My urge to repeat behaviors, to do irrational things in the name of staying safe, is a craving that runs deep. Staying in my kitchen for an entire month satisfied it.I loved my month in the kitchen. I loved all the money I saved not eating out, all the terrible cafeteria breakfasts I avoided by packing my own. I loved being in the rhythm of daily home cooking and figuring out how to turn Sunday’s lunch into Monday’s dinner. So much cooking felt good—I felt healthy and centered and calm. And I was not the only one. As the month of cooking (which I called COOK90) marched on, strangers from Instagram joined me. Soon there were thousands of us, an army of home cooks taking control of their kitchens and their diets and their pantries and their time. Four years later COOK90 is something we do on Epicurious every year, and it’s a brand-new book. Over 150,000 people use it as a sort of cure; none of them know that, for me, it was a cure and a compulsion at the same time.One of my exterminators—who can say which one?—had set out sticky traps all around my apartment as a way to monitor the bedbug problem that you and I both know by now was nonexistent.The traps caught no bedbugs. They caught no more tomato seeds. But occasionally they would catch something else. One morning I woke up to the squeaks of a mouse whose feet were glued to the board. Another morning I encountered a horrifying satanic four-inch-long roach. Both were caught in the kitchen.I brushed these off as one-time murders. But a few days later, I caught another roach. And then another. Finally, one night, frying chicken cutlets, a particularly ballsy roach appeared from under the stove, ran between my legs, across the room, and under the fridge. I froze, unable to move, until the roach made its return trip. This time I attacked. I stomped but missed. Stomped again, missed again. The terrified roach swerved and spun. Finally, I killed the thing.My new boyfriend, who was in the kitchen with me, laughed. But I was now convinced that a hive of roaches lived under the floorboards. And like that, the kitchen and the bedroom switched places: The kitchen became the room to fear, and the triple-exterminated bedroom became the refuge.Except that this time I knew the score. I knew that the fear—the obsession—of being eaten alive by roaches was illogical. I knew that avoiding the kitchen—the compulsion—fed the obsession.Fear is familiar, a security blanket that does not work but that I want to hold on to anyway.So there was only one solution. If COOK90 started as a compulsion that fed an obsession, now it would have to be the opposite. It would have to be the behavior that fought the compulsion and chipped away at the fear.In other words, I had to cook. Oh, I looked for ways to get around it: cheese and crackers instead of a proper dinner, last-minute decisions to eat a burger at a bar. Every time I caught myself avoiding the kitchen, I’d tell myself to reverse course. It was not easy. I flinched, gasped, paced, winced, wrapped my arms around myself, tapped my foot, said “Jesus f*#%ing Christ!” out loud for no reason. And that was all before I started chopping.Then I’d turn on a flame, and that would help. My attention would shift to the shallots sizzling in olive oil, the skin-down chicken in the cast-iron pan. The longer they cooked, the fainter my fear. I was reluctant to let the fear go because fear is familiar, a security blanket that does not work but that I want to hold on to anyway. But the smell of frying onions sparked chemical reactions in my brain. It calmed me, even when I didn’t want to be calm.It was not magic. It was the science of distraction and the power of hunger. And it didn’t cure me, because nothing can cure me. A couple years later, I moved to another apartment, and in my first year saw nothing so much as a fly. I thanked God for my bug-free apartment, and then, one night when I was alone—of course I was alone—I saw it: a roach on the counter, sniffing the olive oil like a dog about to piss on a hydrant.A familiar tension seized my body. All I could do was stare. When the bug ran behind a wall, to a place where I would never reach it, I silently screamed. Then I flipped on a burner and forced myself to keep cooking.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureI Run to Silence My DemonsBy Sandy AllenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-06", "author": ["Condé Nast", "David Tamarkin"]}