{"id": "ad52351c39b7f9652d41c6617d05519f", "url": "https://www.bonappetit.com/recipe/rustic-leek-and-potato-soup-with-fried-herb-gremolata", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Rustic Leek and Potato Soup With Fried Herb Gremolata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRustic Leek and Potato Soup With Fried Herb GremolataA creamy potato soup without the puréeing, plus a crunchy, fresh topping you'll want to scatter on everything.By Christian David ReynosoMarch 14, 20214.4(39)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrintI started making this soup after learning the hard way that puréeing potatoes with a blender yields a gummy texture. Instead of fussily using a food mill, I asked myself, Why am I making a pureéd soup in the first place? Instead, I slice the potatoes, so that they turn tender and creamy. The fried herb gremolata is a simple lesson that adds a crispy, bright punch. You’ll have more than you need, which is okay because it’s good in sour cream to make a ranch-style dip, tossed with roasted root vegetables, or on braised chicken, seared salmon, fried eggs, popcorn—almost anything, really. Store in an airtight container lined with paper towels with the lid left slightly open (airflow will help it stay crisp). Gently reheating the gremolata on the stovetop can help it recover some crispiness too. If you have a deep-fry, candy, or probe thermometer, this is the time to break it out—frying the herbs at just the right temp ensures crispiness without burning (or smoking oil). Look for small to medium leeks and use potatoes like fingerlings or small Yukon Golds—you want them to fit in your soup spoon when sliced into rounds. When it comes to vegetable stock, I prefer homemade or store-bought from a market that has earned my trust. If neither is an option, Better Than Bouillon paste is a good option. —Christian David Reynoso All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketThermoWorks DOT Thermometer$45 At ThermoWorks8-Inch Chef's Knife$47 At AmazonDutch Oven$80 At AmazonSmall Saucepan$155 At AmazonMicroplane$16 At AmazonMedium Bowl$17 At AmazonMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMesh Sieve$13 At AmazonLarge Bowl$18 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients4 Servings1large lemon7garlic cloves, dividedExtra-virgin olive oil1cup (loosely packed) sage leaves½cup (loosely packed) rosemary leaves10sprigs thyme13.5-oz.-jar capers (⅓ cup plus 1 Tbsp. packed)1large bunch parsley1Tbsp. plus 1¼ tsp. Diamond Crystal or 2½ tsp. Morton kosher salt, divided, plus more2½lb. small or medium leeks (6–8)3celery stalks1¼lb. small fingerling or Yukon Gold potatoes2quarts vegetable stock, divided½cup heavy creamPreparationStep 1Line a baking sheet with a single layer of paper towels. Finely grate zest from 1 large lemon into a medium bowl; cut lemon into wedges and set aside for serving. Finely chop 2 garlic cloves and add to bowl with lemon zest.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Pour extra-virgin olive oil into a small saucepan to come ½\" up sides; clip a deep-fry thermometer to sides of pan. Heat oil over medium until thermometer registers 225°–250°. Working in 2 batches and returning oil to 225° between batches, fry 1 cup (loosely packed) sage leaves (make sure you’re wearing an apron) until oil stops bubbling and sage is crisp but still fairly green, about 2 minutes per batch. Using a slotted spoon, transfer to prepared baking sheet. Repeat with ½ cup (loosely packed) rosemary leaves, then 10 sprigs thyme, returning oil to 225°–250° between batches and transferring to same baking sheet.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Next, set a fine-mesh sieve over a medium Dutch oven. Drain one 3.5-oz.-jar capers (⅓ cup plus 1 Tbsp. packed) and pat dry. Fry, stirring occasionally, until they burst open and are crisp and darkened to a deep green (the oil will bubble steadily at first but should be bubbling less frequently by the time capers are ready), about 5 minutes. Remove from heat and strain through prepared sieve. Let oil cool. You should have 2–3 Tbsp.; if you have more than that, pour off excess and reserve for another use (like frying toast or making a vinaigrette). Transfer capers to baking sheet with herbs.Step 4Pluck leaves off 1 large bunch parsley until you have 2 (loosely packed) cups; discard stems (or save for another use). Coarsely chop parsley leaves. Chop fried thyme into pieces about the same size as the parsley and add both to bowl with garlic and zest, then add sage, rosemary, and capers. Season gremolata with kosher salt and gently toss to combine.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Trim dark green tops off 2½ lb. small or medium leeks (6–8); discard. Slice white and pale green parts into ¼\"-thick rounds and rinse in a large bowl of water, swishing around to loosen any dirt. Drain and repeat as needed. Wipe out bowl and return leeks to bowl. Slice 3 celery stalks on a slight diagonal crosswise ¼\" thick, then thinly slice remaining 5 garlic cloves. Add both to bowl with leeks along with 1¼ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Heat oil in reserved Dutch oven over medium. While the oil is heating up, slice 1¼ lb. small fingerling or Yukon Gold potatoes into ¼\"-thick disks.Step 7Once oil is hot, add leek mixture and stir to coat with slotted spoon; reserve bowl. Cover with a lid and cook until vegetables are tender but not mushy, about 5 minutes. Transfer vegetables back to reserved bowl.Step 8Transfer potatoes to pot and add 1 quart vegetable stock and remaining 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt. Heat over medium-high until rapidly simmering but not boiling, partially cover, and cook until potatoes are tender but not falling apart, 15–20 minutes. Return leek mixture to pot and add remaining 1 quart vegetable stock and ½ cup heavy cream; cook until just starting to simmer again. Remove from heat; taste and season with more salt if needed.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 9Ladle soup into bowls; spoon a generous amount of gremolata on top and stir in. Serve with reserved lemon wedges for squeezing over.How would you rate Rustic Leek and Potato Soup With Fried Herb Gremolata?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThis recipe took some time to prepare and was worth every minute. I switched it up a bit using cilantro instead of parsley and homemade chicken broth instead of veggie broth. And yes, the Gremolata goes well with all kinds of things, as well as straight!DsrtgrlSanta Fe, NM3/3/2022This is not a quick and easy week night dinner. It’s an exacting, complicated and time consuming ordeal. And it is delicious. Worth it to me as a Sunday special soup. My only real change was to replace one of the quarts with chicken stock instead of veggie all around. And I halved the celery. Other than that, I stuck true and no regrets. I could eat the gremolata straight.Sahjo BPortland OR1/30/2022Thinking all this measuring for soup was ridiculous, I made this recipe as directed. The basic components of the soup work really well here. The gremolata? Not worth the effort in my opinion. Next time I will add just enough of each fresh herb to the leek and celery mixture, along with the garlic and capers. Getting a base of those flavors going at once is important for good soup. After that, I’ll just work with the rest of the ingredients to get the right texture. Also, I suggest using a hand potato masher to break up the potatoes a little (and yes, I peeled them first, and any Gold potato will work). This recipe is overwrought. Simplify, simplify, simplify. It’s always better.Kevin R.Atlanta1/19/2022I thought it was fun to make and had interesting flavors. It is pretty labor intensive as others have said. \n\nI would use less celery - I'm not a fan of it myself and I found that every bite contained a piece of crunchy celery which stood in contrast to the other textures. \n\nNice with some toasted bread. Enjoy!KonstantinDurham, NC12/12/2021This recipe is insane - delicious beyond compare.  Make sure you use the light green of the leeks (see video) as you could leave a lot of leek out.  The lemon squeeze prior to serving is over the moon.  The complexity of the flavors is divine.  Next time, I think I'll add mushrooms and tarot root, as tarot is (in my opinion) more substantial than potatoes.  I'll still use the potatoes, but a bit of tarot root would be nice.\nI totally recommend this!Diane K.Bakersfield, CA11/15/2021This recipe is a WIN. I’d agree that the herbs could have been fried at a higher temp and I added in a bit more cream + black pepper, but damn with fresh baked bread this is going to be on my fall sunday supper repeat list. Also, don’t skip out on the lemon!ErinAustin, TX11/8/2021\"Store in an airtight container lined with paper towels with the lid left slightly open\" he he he!Anonymous4/12/2021This soup was a celebration of springtime. I feel rejuvenated. Joan HLos Angeles, Ca4/1/2021Made this recipe exactly as it was written and it was great.  I’ll make the gremolata again for all kinds of things.  A squeeze of lemon is mandatory when serving. RaynHi Dez, CA 4/1/2021Too much salt!! Anonymous3/23/2021If you can't print a recipe save it to Pinterest then printDigtheislandFlamingo Heights, CA3/23/2021This recipe was more work than it was worth. Perhaps my thermometer was off, but the gremolata ended up very oily and the soup just didn’t have as much flavor as I was expecting. I also would have sautéed the leek mixture, coaxing out a little more complex flavor instead of basically steaming it. It was just a bit of a miss for me.AnonymousNC3/19/2021I am constantly left bitterly disappointed in these recipes.  WHERE IS THE PRINT BUTTON FOR THE RECIPE???????????????prUNGEsAN fRANCISCO3/17/2021This was a lot of work but ultimately really tasty.  I used better than bullion veg stock which made everything really brown and really salty so I would add less salt next time.  Wouldn't make it again on a work nightallisonillinois3/16/2021Explore Bon AppétitSoupSoups and StewsPotatoVegetableLeek Fingerling PotatoYukon Gold PotatoMainNut-FreeGluten-FreeVegetarianDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-14", "author": ["Condé Nast", "Christian David Reynoso"]}