{"id": "ad545ea1b9b74f0b713ef9bd6c2ea2a1", "url": "https://www.bonappetit.com/story/11-things-to-do-right-now", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "11 Things to Do Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle11 Things to Do Right NowRecipe recommendations and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 14, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Kat BoytsovaFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last weekend I finally did the thing that I procrastinate doing every fall: I unearthed the bags of sweaters, tights, mittens, and boots from under my bed and tearfully buried my tank tops and sundresses in their place. RIP until next year, summer friends.Then I braised some chicken and danced up a sweat and felt better. More on that chicken later.If you live in a seasonal place, clothes-swapping is one of those mundane tasks, like sealing windows, turning on radiators, and cleaning the chimney flue, that marks the passage of time. I used to hate it, but now it makes me feel productive, like I’ve prepared myself for the hard times ahead. I’m no Laura Ingalls, I have no root cellar stocked with...roots? But at least my knits are easily accessible.If you haven’t swapped your clothes yet, do it! And do this other stuff too:Watch all nine episodes of Couples Therapy, which I did this weekend between clothes swapping and dancing and chicken braising, and which made me simultaneously depressed about how messed up we all are and in awe of our abilities to love and forgive.Maybe don’t listen to the new season of Esther Perel’s similarly themed podcast in the same weekend, but do listen at some point.Make Big-Flavor Broccoli. Anchovies. Parmesan. Jammy red onion. I made this recipe three times in a week and am entirely capable of eating the whole skillet myself.Read this to-the-point article about how the diet that was supposed to feed the world (and that we tried earlier this year) is unaffordable for most of the world’s poor.Listen to this song (maybe you remember it from the end credits of La Grande Belleza) on a crowded subway or sitting in traffic or whatever hellscape constitutes your morning commute. Pretend you’re on a bridge overlooking the Tiber in Rome.Make Caesar salad with tahini instead of egg yolks. Earthy, creamy, nutty, mmmm.Read Kirstin Slyter’s great essay about how she’s managing her endometriosis—a little-understood reproductive disorder that’s been called a “disease of theories”—one avocado at a time.I probably don’t have to tell you to cook from Alison Roman’s new cookbook, Nothing Fancy, but I will anyway: Make the coconut-braised chicken with chickpeas and lime. Sure, you could make it for a crowd, but this really simple, super-hearty recipe worked just as well as dinner for two with plenty of leftovers for the week.Read Carmen Maria Machado’s In the Dream House. If you found The Cut’s excerpt hot as hell, the rest of the book won’t let you down. (It’s also deeply funny, deeply upsetting, and all-around beautifully written.)Get something new for your Thanksgiving table to balance out all that dusty china (or, um, mismatched Ikea plates). I’m eyeing the table runner, which I think could double as a Twister board after everyone’s had a few Fall Spritzes.Follow along on Healthyish this weekend as we head to LA for Mercado Sagrado. Guess I better pull some warm-weather clothes back out from under the bed.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThe Problem Isn’t Drinking Culture, It’s Just Culture.By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-14", "author": ["Condé Nast", "Amanda Shapiro"]}