{"id": "ad565a9797d9a97439a481a121c8e69c", "url": "https://www.bonappetit.com/story/cook-rice-in-the-oven", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "How to Cook Rice in the Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingIf You’ve Failed at Cooking Rice on the Stove, Try Your OvenThe hands-off, no-stress route to fluffy grains. By Kristine WhiteJanuary 11, 2021FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailGrowing up in a Filipino household, our method for a perfect everyday rice recipe was simple: Use a rice cooker. But if you don’t have a rice cooker, cooking rice in the oven, rather than on the stove, may actually be the next best thing.I was skeptical at first. Rice on the stovetop was one of the first recipes I ever learned, and there’s no reason to mess with something so tried-and-true. Tender fluffy rice, however, can be deceptively complicated to achieve if you haven’t had some practice. Use a heat that’s too high and you can burn the bottom layer. Lift the lid too soon (or too often) and you may end up with a mushy mess. The consistent and gentle heat of the oven, however, is similar to the environment of a rice cooker, removing many of the variables that can lead to burnt, mushy, or gummy rice. Because the rice is in the oven, there’s no temptation to lift the lid and release steam, or to (heaven forbid) stir the pot. The oven method is also ideal for when you need to free up stovetop space or are looking for a hands-off method. “It’s practically foolproof,” says Ali Slagle, a recipe developer who’s tested a handful of rice-cooking methods.Here’s how to cook rice in the oven:To begin, you’ll need an ovenproof pot with a tight lid such as a Dutch oven or even a casserole dish tightly fitted with aluminum foil. While the oven heats to 400°, rinse the rice two to three times until the water runs clear. I like to use jasmine rice as an easy side to any meal, but you can cook any type of medium- or long-grain rice in the oven. (Short-grain rice varieties such as sushi rice aren’t suited for the oven.) Then, add the rice to the pot along with water: The ratio is the same as if you were cooking on the stovetop—for every cup of rice, I use 1¼ cups of water. Other varieties of rice, such as brown rice, may need slightly more water, but for most kinds of white rice, this is my surefire ratio.As you become more familiar with the perfect rice-to-water ratio, it’s not always necessary to measure the water volume exactly. Instead, I use a classic finger technique. I add enough water to just cover the rice, and then lightly shake the pot to level the grains. Then here’s the magic part: I dip my fingers straight down into the pot until they just touch the top of rice. You know you have the right amount of water when the water reaches the first joint of your middle finger, right above your fingernail. This trick works whether I’m cooking enough rice for myself or my entire family.Ottolenghi’s baked minty rice is made entirely in the oven, no stovetop required.\nChristopher TestaniOn the stovetop, bring the water to a boil over medium heat. Once it’s boiling, put the lid on and let the rice finish cooking in the oven for 17–20 minutes depending on the rice variety. Let the rice rest for 5–10 minutes, lift the lid, fluff, and serve. Unlike with rice cooked on the stovetop, there’s never a pesky layer of rice stuck on the bottom or sides of the pot.Of course, making rice in the oven comes with a similar set of challenges as rice made on the stovetop: To keep the heat consistent and trap as much steam as possible, you’ll want to avoid frequently checking how much water has been absorbed. I recommend using a glass casserole dish to eliminate uncertainty—you can easily see how much water remains without removing the foil and releasing steam.While I prefer starting on the stovetop to ensure that the water reaches the right temperature (and to speed up the process!), you can cook rice entirely in the oven, like in Yotam Ottolenghi’s Baked Minty Rice with Feta and Pomegranate Relish. If you’re not starting the rice on the stovetop, you’ll want to increase the oven temperature to 450° and let it cook for 30–35 minutes. Once you’ve mastered the basic oven rice recipe, branch out into other dishes like pilafs and layered casseroles.Perfect rice requires less work than it seems—actually, the less you bother the rice during the cooking process, the better it turns out. And with this method, there’s no excuse for making undercooked (or overcooked) rice again.And now that you have rice…Green Seasoning Baked CodHerbaceous, aromatic, fresh, and—maybe most importantly—simple, this Trini-inspired recipe from Brigid Washington is just the cure for those January blues.View RecipeExplore Bon AppétitRiceRead MorecookingHow to Cook Brown Rice Like a ProBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-11", "author": ["Condé Nast", "Kristine White"]}