{"id": "ad568a4da34b86f4519507545362f2d8", "url": "https://www.bonappetit.com/story/rent-week-stir-fry-ramen-noodle", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Garage Noodles Are the Rent Week Stir Fry Recipe That's Here to Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGarage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyKale, mushrooms, onions, and a beautifully bold sauce make instant ramen noodles something to be excited about.By Alex DelanyMarch 1, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailI don’t formally endorse walking into a stranger’s garage. But you know how the preachers preach: do as I say, not as I do.I was recently walking through Philadelphia’s Fishtown neighborhood with some friends, blindly following the sound of a live band a few blocks away. We ended up in front of a commercial garage, the epicenter of the guitar wails and cymbal smashes. We walked into this unfamiliar garage, and the result was a ramen stir-fry recipe. So...yeah, bear with me for a second.Everyone in the large space was facing the band, which sounded like it was playing underwater (read: not great). An actual helicopter hung from the ceiling (seriously), and motorcycles lined massive shelves behind the band from the floor to the roof. Silhouettes swayed and jumped in front of an amateur laser display. There were stacks of Solo cups scattered around three kegs, which, according to the guy standing next to them, contained, “Just beer.” Maybe there were fog machines, or maybe we’d stumbled into a support group for the American cigarette industry. The music stopped, and the dude behind the microphone screamed, “Pretty good for never having played together, huh?” It seemed close enough to the truth, and everyone, including us, clapped and hooted.The whole scene was...bizarre. And absolutely amazing.That’s what I think Rent Week cooking is all about. That vibe is what I want in a Rent Week recipe. Your kitchen during Rent Week is that garage. It’s filled with a bunch of ingredients that might not be first round picks on their own, but Rent Week cooking is about embracing the lo-fi vibe and making the whole better than the sum of its parts. Which brings me back to this ramen noodle stir-fry. At it's core, it's as lo-fi as it gets, but the sweet, salty, tangy flavors provide a resounding declaration of satisfaction. It's quick, easy, and turned all the way up to 11. It's more than its ingredients suggest. It rules.So throw on this In Your Cousin’s Garage playlist (filled with lo-fi garage tunes and free of charge), forget about your rent check, and get ready to party in a garage (yours, hopefully). Let’s make some noodles.Dried ramen noodles are actually kind of beautiful.\nPhoto by Alex LauStart by washing and de-stemming 1 bunch of Tuscan kale. Yeah, it’s Rent Week, but we still need to give our bodies a vitamin or two. Cut the tip and the root end off of 2 medium onions and peel off the exterior. Cut each onion in half lengthwise and then into wedges, so you have six wedges of onions, with the layers separated. Slice 5-6 oz. of shiitake mushrooms (with stems removed) across the cap. (You can also go for cremini mushrooms here if you want to save a buck or two. You’ll get a lot more earthy flavor from a shiitake though.)Having all of your stir-fry ingredients prepped is important, because kale and mushrooms cook very quickly, you’ll be running and gunning once stuff starts happening in your skillet. Fill a pot with salted water and bring it to a boil. While waiting for the water to boil, heat some neutral oil over medium heat in a large skillet, and throw your chopped onions in there. Stir them occasionally as they start to get tender. Oh, your water is boiling. Throw 4 packs of dried ramen noodles in there.When I say ramen noodles, I don’t mean the fresh, fancy stuff. I’m talking college dorm room, shedding little noodle crumbs everywhere, flavor pack that will probably kill you, cheaper-than-cheap ramen noodles. The stuff you can buy at stores that don’t even sell food. This probably goes without saying, but throw the flavor pack in the general direction of your trash can, out the window (into the dumpster below), or into any kind of live fire. Destroy it.Like we do with pasta, we’re going to undercook our noodles a little bit, so they can finish to the proper texture in the pan. I like to cook dried ramen noodles for about 3 minutes, before transferring them to the skillet (and saving a scoop of the cooking liquid, as you would pasta water). In those three minutes, add your sliced mushrooms and kale to the skillet, with a bit of kosher salt and a splash more oil. Again, things happen fast here, so be ready to go, go go.A topographical view of your Rent Week stir fry.\nPhoto by Alex LauThe kale and mushrooms will cook almost all the way as you stir them around in the skillet. When you add your undercooked ramen noodles, the vegetables will finish with that residual heat. Make sure to leave the heat on under your skillet. We’re adding our real flavor enhancers now, which also create our sauce. Add a splash of reserved ramen noodle water, ⅓ cup mirin, ⅓ cup soy sauce, 2 Tbsp. oil, 1 Tbsp. toasted sesame seeds, and ¼ cup rice vinegar to the pan, pouring over the noodles and vegetables. Toss everything in the skillet for a couple minutes, so the sauce gets all up in the noodle’s business. You don’t want any sauceless noodles. The noodles should get lost in the sauce.And now, you plate. Make a nice little mountain of stir-fried noodles on your plate or in your bowl. Make sure you get plenty of kale and mushrooms. Top it with more toasted sesame seeds, some hot sauce, flaky sea salt, or chile flakes. This is your stir-fry mountain. Cultivate the landscape in any way you wish.Cheap ramen. Vegetable oil. Cheap soy sauce. Mediocre mushrooms. Onions. All this lo-fi stuff can be killer, if you just embrace the vibe that comes with it. When my 13-minute experience in that surreal Philadelphia garage ended, I walked out thinking, Fuck, that was awesome. I want to cook food that tastes like that garage felt. I want a recipe that recreates that \"Yeah, so what?\" mentality. I want to make Garage Noodles.Which, by the way, sounds like a pretty great name for the pop-punk band you've been thinking about starting.Garage Note: The garage I found myself in is actually somewhat of a motorcycle museum, owned by Fishtown resident Adam Cramer. You can read about the garage here. It's extremely rad.In more of a chicken thigh mood? We can do that too:These Crispy Chicken Thighs Are the Only Way to Start the YearChicken thighs, with garlic-honey, are here for the first Rent Week of the year. Breathe. You're in a space now.View StoryExplore Bon AppétitBasicallyRent WeekNoodleStir-FryKaleMushroomSoy SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Alex Delany"]}