{"id": "ad7e9e1a3c9f6fb04379b603d5b4c0a3", "url": "https://www.bonappetit.com/story/cold-udon-with-grapefruit-ponzu", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "This Cold Udon Noodle Recipe with Grapefruit Ponzu Is the Only Thing I’ll Eat Until October | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Cold Udon with Grapefruit Ponzu Is the Only Thing I’ll Eat Until OctoberWhen summer is technically over but it's still pretty hot outside, I'll be here eating chilled noodles.By Aliza AbarbanelSeptember 3, 2018FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Andy BaraghaniFacebookTwitterEmailIf March is the cruelest month, September is the strangest. The back-to-school commercials will have you believe that fall leaves and cozy sweaters are just around the corner, while the August heat and late-summer produce lingers. Stuck in the seasonal shift, what feels right for dinner? Raw radish salads and tomato toasts aren't calling my name anymore, but this cold udon bowl is.Senior food editor Andy Baraghani's recipe comes together in just 15 minutes or so, using a smartly deployed bit of broiling to create jammy, semi-charred cherry tomatoes that play off fresh herbs and cooling chunks of cucumber. Plus spiking ponzu with grapefruit juice creates a multi-layered sauce that coats every last slippery noodle. Here’s how it comes together.First heat your broiler so it's good to go. Place a fine-mesh sieve over a large bowl and juice the grapefruit and lemon over it to prevent your ponzu from getting pulpy. When you have a little over ½ cup juice,  mix in a finely chopped chile, grated ginger, rice wine vinegar, soy sauce, and a little sugar. Give it a stir, then go ahead and throw that in the fridge while you get the cherry tomatoes going. Toss them with grated garlic, olive oil, and salt on a rimmed baking sheet and broil them until they’re soft and lightly charred. It should take about ten minutes, and you can rotate the tray halfway through to promote even charring.Finally, cook your udon according to the package instructions. It should only take a minute or two because most frozen udon noodles are fully cooked and just need to be thawed. When they’re warmed and slightly al dente, drain and immediately rinse under cold water to stop the cooking. Add your udon to the bowl with the ponzu dressing and toss to ensure the noodles are fully coated. Dole out the udon and ponzu and top with charred tomatoes, cucumbers, and cilantro, then garnish with crumbled nori and sesame seeds. To cut cukes as pretty as the ones in the recipe photo, check out this video.Yes, the final composed bowl is beautiful, but it’s also perfect for early fall. Salty, earthy crumbled nori plays off the citrusy-sweet grapefruit ponzu, and the hearty noodles are compulsively slurpable. It’s the kind of dinner that accidentally disappears in minutes, leaving behind dreams of seconds and a pool of ponzu—and that kind of pool is open year round.Get the recipe:Cold Udon with Grapefruit PonzuCold noodles are the ideal canvas for jammy roasted tomatoes in this light summer dish.View RecipeExplore Bon AppétitHealthyishNoodleGrapefruit UdonCherry TomatoCucumberNoriSesame SeedCilantroRead MorecookingMiso Pesto Is the Velvety, Veg-Packed Sauce Your Pasta NEEDS TonightBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-03", "author": ["Condé Nast", "Aliza Abarbanel"]}