{"id": "ad815b79ee1ad6b45079ffc0406b2be8", "url": "https://www.bonappetit.com/recipe/spicy-pork-bowl-with-greens-and-carrots", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Spicy Pork Tenderloin Bowl Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Pork Bowl With Greens and CarrotsBy Chris MoroccoMay 30, 20184.7(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintPork tenderloin is inexpensive and widely available. Giving it a bulgogi-influenced makeover makes it flavorful, fast-cooking, and weeknight-friendly.Ingredients4 servings11¼-lb. pork tenderloin3Tbsp. hot chili paste (such as sambal oelek)2Tbsp. light brown sugar11\" piece ginger, peeled, finely grated1garlic clove, finely grated3Tbsp. soy sauce, divided2¼tsp. toasted sesame oil, divided3Tbsp. vegetable oil, dividedKosher salt2medium carrots, peeled, thinly sliced1bunch collard greens or Tuscan kale, ribs and stems removed, leaves sliced1Tbsp. seasoned rice vinegarSteamed white rice, thinly sliced scallions, and gochujang (Korean hot pepper paste; for serving)Ingredient InfoGochujang, a mixture of miso and hot chiles, is available at Korean markets and online.PreparationStep 1Freeze pork tenderloin until firm around the edges, 30–45 minutes.Step 2Combine chili paste, brown sugar, ginger, garlic, 2 Tbsp. soy sauce, and 2 tsp. sesame oil in a resealable plastic bag (or medium bowl if you aren’t feeling the plastic). Thinly slice pork with a long sharp knife. Add to marinade, seal bag, and knead to thoroughly coat. Let sit at least 10 minutes and up to 2 hours.Step 3Heat 1 Tbsp. vegetable oil in a large nonstick skillet over medium-high. When oil is very hot, add half of pork in a single layer; season very lightly with salt. Cook, undisturbed, increasing heat to high if needed, until dark brown underneath, about 1 minute. Toss pork, breaking up with tongs or a wooden spoon, and continue to cook, tossing, until cooked through, about 1 minute more. Transfer to a plate. Repeat with another 1 Tbsp. vegetable oil and remaining pork (you may want to briefly remove skillet from heat when adding more oil so it doesn’t spatter). Wipe out skillet.Step 4Heat remaining 1 Tbsp. vegetable oil in skillet over medium-high. Add carrots and cook in a single layer, undisturbed, until beginning to soften and brown underneath, about 2 minutes. Add collard greens and toss to wilt. Cook, tossing occasionally, until vegetables are crisp-tender, about 2 minutes.Step 5Combine vinegar and remaining 1 Tbsp. soy sauce and ¼ tsp. sesame oil in a small bowl.Step 6To serve, divide rice among bowls and arrange pork and vegetables over. Top each with some scallions and a spoonful of gochujang; drizzle with dressing.How would you rate Spicy Pork Bowl With Greens and Carrots?Leave a ReviewTell us what you thinkReviews (26)Back to TopTriangleSo tasty and easy. Will definitely be making this again. I used a cast iron skillet and had no issues with the carrots burning.AnonymousSan Francisco, CA1/29/2022This was very good and I will definitely make it again. The pork was so tender and very flavorful. I was worried about adding three tablespoons of chili paste so I used two. Sorry I did as it was not spicy at all. Next time I will use three. I cooked the carrots first and removed them from the pan and then cooked the kale. It was good that I did as the kale needs to be cooked longer and the carrots would have burned to a crisp. Just remove them from the pan and keep them covered so they stay hot. The dressing is really good and I will double the amount like some other reviewers said. BabyRose Centereach, N.Y.1/20/2022love the recipes, please try to get them on 1 page for printing~\nkathrynnew bern nc12/9/2021This fantastic recipe was a big hit in our family. I’ll definitely add it to my regular repertoire!Sarah GVermont2/19/2021If I wasn't working from home, I'm not sure I'd call this a weeknight meal, what with the 45 minutes of freezing and 2 hours of marinating, however it was DELICIOUS! I would make double the veg next time. :) I did not top with gochujang or sriracha - just used the sambal oelek in the marinate and I thought the flavor and spice was perfect! As a point of contrast from another reviewer, I really liked the collards in this - I thought the slight bitterness was a good contrast to the spice. Try it, you'll like it. AnneSacramento, CA1/5/2021This was such a great weeknight meal! I used rainbow chard instead of collard greens and it turned out great. I chopped the stems of the chard and sautéed them with the carrots. Definitely is spicy , so next time I think I’ll tone down to 2 tablespoons of chili sauce instead. Will for sure make again! It’s such a perfect and unique use of pork tenderloin and came out much more tender than I expected Emily JDenver, CO12/21/2020This was so good and easy! I used Siracha for the hot chili paste and marinated the pork according to the recipe and some tofu for the vegetarian in the family. My daughter literally ate the entire block of tofu. Everyone loved it. I bought some greens for this but ended up throwing whatever veggies I had in the fridge in with it and all came out great. We will make this again.  Audrey in ManchesterManchester, England, United Kingdom6/4/2020Just made this for dinner and LOVED it. I had to use spinach but no problem there. The pork tasted great, love the spiciness. Definitely worth adding the extra gochujang on the side. Will make again. adamleclairOsaka, Japan5/14/2020Delicious and fairly quick weeknight meal, can easily adjust the level of spice depending on preferences. Perfect for a weeknight family meal or lunch prep! AnonymousOntario, Canada4/1/2020Wow, this was delicious. The sauce totally makes it!! When you're cooking the carrots, don't leave them in the pan for too long before adding the kale - the kale takes a while to wilt so your carrots might end up a little burnt.AnonymousNYC3/20/2020Wow, this is HOT. I toned it back to 2 tablespoons of sambal, and added more ginger & a little extra sugar. Excellent flavor. Will make it again.AnonymousVail, CO1/6/2020I love this recipe. I made it as is the first time. Since then I make extra marinade and set about 2tbsp aside and mix with rice vinegar to brighten it up and then drizzle on top. I use kale and a smaller amount of book Choi. AnonymousCHICAGO 12/22/2019SO good. Made exactly as stated here with a little extra ging and garlic. Also doubled the marinade to drizzle over the top (careful, it's spicy - pare down the sambal oelek if you're sensitive to heat), which just made it extra delicious. If you don't eat pork, I think this would be just as good with chicken, steak, or even seared tofu. Awesome recipe! AnonymousNew Jersey10/25/2019Collard greens are NOT great here. I would make this again but 💯 use ANY other green veggie. No way my child is eating this. Lol.  Spicy pork is yummy (I went with only 2T of Sambal oelek and it is quite spicy) alohalifeNew Braunfels, TX10/17/2019As someone cooking for one, this made a great Sunday night dinner. And I just packed lunches for the next few days too. In the future, I'll double the marinade, reserving half of it for serving on top.Anonymous6/24/2019Explore Bon AppétitRice and Grain BowlKoreanEast AsianAsianPork TenderloinPorkMeatCarrotVegetableEasyWeeknight MealsOne-Pot MealsMainDairy-FreeHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-30", "author": ["Condé Nast", "Chris Morocco"]}