{"id": "ad89d6192e919b3cc08b5b9e97b9befc", "url": "https://www.bonappetit.com/story/crispy-fish-cold-nonstick-pan-rule", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "This Simple Fish-Cooking Method Rules the School | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Simple Fish-Cooking Method Rules the SchoolNot using a cold non-stick pan? Let us help you out.By Carla Lalli MusicSeptember 25, 2019FacebookTwitterEmailPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.On the way home from work last night, I did a thing I do frequently, which is figure out what I’m having for dinner while standing in front of the butcher/fish counter at my neighborhood store. There was an especially sparkly black sea bass resting on ice, and after a few seconds of sustained fish eye contact, it came to me: “Seared fish tacos,” I hollered (not really). While the nice monger filleted my fish, I dug around in the produce bin for ripe avocados, grabbed tortillas, cilantro, and limes, and circled back to get my fish and check out.Want this letter before it hits the website? Sign up for our newsletter!So far, I was doing everything right. But when it came time to cook the fish, the first mistake I made was ignoring food editor Chris Morocco’s expert advice. He says using a cold nonstick pan is the most reliable and easiest way to cook skin-on fish with an even, crisp layer of skin atop a juicy, not-overcooked fillet. I should have poured a little bit of vegetable oil into my nonstick, salted the fish, and placed it into the cold pan. But, no. I got out my stainless skillet and got it ripping hot. My fillet shrank and buckled the second it hit the incendiary surface, curling the flesh so that the outside edge was still making contact, but the center had bowed away from the pan. In Morocco’s world, as the pan heats over medium, the skin slowly renders and crisps, requiring only a couple of gentle presses to lie flat. Over in my world, I was exerting brute force with a fish spatula to get the skin back in contact with the pan, steam hissing all over the place.My family-style fish taco inspo, right here.\nPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolA fillet cooked Morocco’s way stays skin-side-down for 90 percent of the cooking time, so all you have to do is keep an eye on the flesh as it gradually turns from raw and translucent to just-cooked and barely opaque. That was happening for me—all too quickly, I may add—and I was dealing with smoking oil, almost-burned edges, and a fillet that had decided to adhere itself to the pan.With some wrestling, I got my fillets out before they overcooked, and the nontraditional tacos we made with them were good, but I did sacrifice some precious strips of skin to the pan. Chris Morocco would have elegantly, effortlessly turned his fillets over at the last minute before sliding them out of the pan so everyone could behold the shattering layer of seared skin he had achieved.I wish I could say I didn’t know any better, but I knew. I made these mistakes so you won’t have to. Don’t be like me, be like Chris.Get the recipeCrispy-Skinned Fish with Herb SauceYou don’t need a culinary school degree to cook fish with skin as crunchy as a potato chip.View RecipeExplore Bon AppétitCarla NewsletterFishRead MorecookingCan You Actually Swap Fish In a Recipe?By Emma WartzmancookingThis Fish Cooking Method Won't Stink Up Your House, and Is Pretty Much FoolproofBy Molly BazcookingAll of Your Questions About Thawing Fish, AnsweredBy Emma WartzmancookingThis Poached Fish in Tomato Curry Got Me Out of My Salmon RutBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-25", "author": ["Condé Nast", "Carla Lalli Music"]}