{"id": "ad919e1de8c54d23ebf5a42035133a5a", "url": "https://www.bonappetit.com/story/goldune-sale", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Sustainable Black Friday Sales I Can Get Behind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe One Black Friday Sale I Can Get BehindShopping small and sustainably just got waaay easier.By Aliza AbarbanelNovember 27, 2020FacebookTwitterEmailCourtesy of GolduneFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!If you’ve been thinking about reducing waste in your home, now is the perfect time to make the plunge. Goldune, a new virtual hub for sustainable home goods, is running some unmissable seasonal deals like free shipping (details below). Founder Azora Paknad’s curated selection aims to help people navigate the dearth of paper towel alternatives and bamboo-everything items on the market by highlighting personally vetted products, with a focus on smaller women-of-color-owned brands. “I wanted to build a solution for people like my friends and family—working moms or super busy people or people with chronic illnesses—who don’t have time to get into cleaning reusable toilet paper,” says Paknad. (Instead, try this unbleached, tree-free toilet paper.)I usually avoid participating in holidays invented to get people to shop, but this sale is a good opportunity to invest in a few product swaps that, when combined, add up to a bigger lifestyle shift (and cut down on shipping in the process). Right now I’m focusing on making my kitchen sink a no-single-use-plastics zone, starting with this bamboo and melamine counter caddy to store the dish-washing essentials currently languishing on my damp counter. Holes at the bottom provide drainage for drippy sponges, and it splits into two pieces to make it easy to clean—or shapeshift to best fit your space. I’m filling my caddy with items like biodegradable pop-up sponges, sturdy scrubbing brushes, and blocks of dish soap to replace those plastic bottles.And if you're pursuing sustainability beyond the kitchen sink, Goldune has plenty of composters, reusable bowl covers, and recycled, tie-dyed textiles to shop too.Free shipping on every order. $10 off orders of $150+ (code: ISHOPPEDSMALL) $25 off orders of $250+ (code: RAINBOW), and $50 off orders of $350+ (code: YOURETHEBEST).Counter Caddy$24 at GoldunePlastic-Free Pop Up Sponge 3-Pack$18 at GolduneExplore Bon AppétitShoppingHealthyish Loves Itblack fridayHealthyishRead MoreLifestyleThis Storage Bowl Is Like a Hot Lifeguard... For Your FruitBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-27", "author": ["Condé Nast", "Aliza Abarbanel"]}