{"id": "ada075bde742abe52ef53fbdea171a5b", "url": "https://www.bonappetit.com/recipe/rosemary-mezcal-fizz", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Rosemary Mezcal Fizz Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueRosemary Mezcal FizzBy Maggie HoffmanApril 20, 20214.3(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintEpicurious’ cocktail expert, Maggie Hoffman, created a drink that captures the flavors and nuances of acclaimed author Dawnie Walton’s favorite pre-pandemic bar cocktails, as outlined in this essay about the evolution of her drinking tastes. For the most luscious froth, serve fizzes in tall glasses without ice. Make sure your soda and glasses are well chilled before starting, either by chilling in the fridge an hour or more beforehand or filling with ice water and letting them sit while you make the drink.*Raw egg is not recommended for the elderly, people with weakened immune systems…or people who don’t like raw egg.IngredientsMakes 240rosemary leaves (from 1 sprig)Pinch of kosher salt1large egg white*13\"-long strip lemon zest4½oz. mezcal2¾oz. fresh lemon juice1½oz. light agave nectar6oz. chilled club soda2sprigs rosemary, briefly singed over flame of a gas burner if desiredPreparationStep 1Chill 2 Collins glasses. Combine rosemary leaves and salt in a cocktail shaker and gently press out oils with a muddler, about 45 seconds. Add egg white, lemon zest, mezcal, lemon juice, and agave nectar. Cover cocktail shaker; shake vigorously (without ice) until egg white is emulsified, about 20 seconds. Carefully uncover (shaker will be quite full) and add ice just to fill. Cover and shake until egg white is very frothy and cocktail is cold, about 30 seconds.Step 2Set chilled glasses next to each other and double-strain cocktail into glasses, dividing evenly. Top off each drink with 3 oz. club soda and garnish with a rosemary sprig.How would you rate Rosemary Mezcal Fizz?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis was a fantastic celebratory cocktail for Thanksgiving weekend. I didn’t have any idea how the rosemary and mezcal would pair, but it was lovely and warm for a winter celebration. Easy to make for 4-6 folks as well. AnonymousAlexandria, VA12/29/2021Delish! The smokiness of the mezcal and the piney Rosemary work really well together. I used El Jolgorio Barril Mezcal and fresh Rosemary from my garden. I substituted an amber agave nectar and think it added a little more color and richness. I really enjoyed this cocktail. \nAhem- For previous reviewers, this ingredients list makes two drinks (2 ¼ ounces of Mezcal per drink). Cheers! Rob T. Seattle7/2/2021I don't understand the formatting of the ingredients–is it 4.5 oz of mezcal or 4x 0.5 ox of Mezcal (so 2 oz)?ABGlasgow, Scotland5/21/2021How is .5 oz of Mezcal a drink? \n...Asking for a friend. \nAlso, add 2.5 more oz. od boozeShazzizNYC5/19/2021Explore Bon AppétitCocktailDrinks AllRosemaryHerbs & SpicesMezcalAlcohol & Other DrinksDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Maggie Hoffman"]}