{"id": "adbae96cbeb74575eea6895874293db0", "url": "https://www.bonappetit.com/story/rent-week-ginger-scallion-noodles", "year": 2019.0, "month": 12.0, "day": 1.0, "content": "Rent Week Ginger-Scallion Noodles With Tahini and Sesame Seeds | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGinger Scallion Noodles Are the Only Gift I'll Accept For My BirthdayBy “my birthday” I mean Rent Week's birthday. By Alex DelanyDecember 6, 2019FacebookTwitterEmailPhoto by Laura Murray FacebookTwitterEmailIf Rent Week were a column in a publication based on Jupiter, it would be a quarter of a year old. If it were written on the significantly smaller, less gaseous planet of Mercury, it would be about 12½. But as I’m sure you are well aware of at this point, Rent Week is not written by an extraterrestrial being on a planet far far away. It is written by me. And I live on Earth. And here, Rent Week is officially three years old.That’s right: This is the 36th installment of Rent Week. Once a month for the past three years we’ve cooked a delicious, budget-friendly recipe that we don’t take too seriously. And to celebrate this anniversary, we’re going to do exactly the same thing: We’re going to make an extremely Rent Week-ish Rent Week recipe, something that tastes so damn good we forget about the large sum of cash that just vanished from our checking accounts.And because it also happens to be the end of the decade (haha, uh, what?!), this month’s playlist is comprised of my 50 Favorite Songs From the 2010s (and as always, is completely free of charge). So smash the play button and get ready to make a noodle-based, toasted sesame-topped, flavor-blasted recipe that’s as Rent Week as they get. We’re making tahini-ginger-scallion noodles. Let’s get to it.To start, toast about ⅓ cup raw white sesame seeds in a nonstick skillet over medium-high heat. Toast them until they take on a deep brown color, about 3–5 minutes, shaking the pan every minute or so.This is really a recipe for sauce—tahini-ginger-scallion sauce to be exact. But while I do think this sauce is delicious, I wouldn't eat a bowl of it and call it dinner. You can eat this with rice or roasted vegetables or crispy seared meat. But I like it best on ramen noodles. So we’ll use those. You’ll want about 16 oz. fresh or 10 oz. dried (sans flavor packet) noodles. Heat a pot of salted water over high heat to cook them.While that comes to a boil, use a microplane to grate 4 garlic cloves and 3 2”x1” pieces of ginger (or one really big piece!) into a large heat proof mixing bowl. Trim the root ends of 8 large scallions and thinly slice the entire scallions from root to tip. Separate the green parts from the white parts. Mix the garlic, scallion whites, ½ the scallion greens, and ginger in the bowl. Reserve the other half of the scallion greens for later.Who needs a birthday present when they've got noodles? \nPhoto by Laura Murray Pour ½ cup canola oil into a skillet and heat over high, until the oil shimmers on the surface and the air above the pan feels pretty damn hot, about 3–4 minutes. Pour the oil directly from the pan into the bowl. The scallions will sizzle. Don’t be alarmed. That’s what's supposed to happen. Stir the contents of the bowl. The scallions' green color should intensify as they cook.Now comes the second wave of flavor. Add a few cranks of black pepper, 2 Tbsp. soy sauce, 1 Tbsp. sambal oelek, 2 Tbsp. tahini, 1 tsp. sugar, ¾ of your sesame seeds, and 2 Tbsp. unseasoned rice vinegar to the bowl and stir. Let the sauce sit for as long as it takes for your noodles to cook.Oh, you didn’t drop in your noodles? Go ahead and do that. Cook them according to the package instructions and strain them, reserving ¼ cup cooking water for the sauce.Stir the reserved water and scallion greens into your sauce and stir, then add in the cooked noodles. Toss them to coat and serve them up. Top each plate with another hit of those toasted sesame seeds, just in case there isn't already enough sesame happening in there for your liking.And now you have dinner. And now Rent Week is three. Think of all the fond memories you’ve had with this column, the delicious bites you took and the new techniques you’ve learned. Think of the dollars you’ve spent and the experiences that have shaped us into...meh, never mind. Just eat the tahini-ginger-scallion noodles. We’re not going anywhere. We’re only three.Or have eggs for dinner!Not to Brag But This Rent Week Omelet Rivals Any Diner'sDiners are great! But this diner omelet is better!View StoryExplore Bon AppétitRent WeekRamenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-06", "author": ["Condé Nast", "Alex Delany"]}