{"id": "adc230acee16134852c442112f486847", "url": "https://www.bonappetit.com/story/common-grilled-cheese-mistakes", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "6 Rules for a Perfect Grilled Cheese, Every Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking6 Rules for a Perfect Grilled Cheese, Every TimeBurnt bread? Unmelted cheese? Maybe you could use some help.By Emma WartzmanSeptember 24, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailThere are two types of grilled cheeses in this world. First, there’s the kind you make when you come home at 3 A.M. after a bit too much to drink, when all rules fly out the window and pretty much anything tastes delicious—including burnt bread surrounding unmelted cheese.And then there’s the grilled cheese you should be making at all other times: perfectly golden-brown bread, melty cheese, supreme satisfaction. To get this sort of sandwich, the rules are strict but justified. Because when it comes to something so simple, there's not a ton of wiggle room between perfect sandwich creation and sub-par, time-of-desperation snack.This is where we come in. Look no further for the rules of perfect grilled cheese.1. Be patient.Two things can happen if you rush the grilled-cheese-making process. In one scenario, you quite literally take the sandwich off the of the pan before the bread reaches a deep golden-brown. You may be hungry and tired, but accept that it takes a bit of time to get optimally toasted bread. We’re also not that sorry, because it doesn’t take too much time (5–7 minutes).But more often, you toast (or worse, burn!) the bread before the cheese melts. This happens when your heat is too high and your pan is too hot: Before the inside gets gooey, the outside blackens.Here’s the right way to do it: Start in a cold pan (same as you would if you were trying to get crispy skin on a filet of fish or chicken thighs). This allows for the pan to heat up slowly, ensuring that the heat is evenly distributed as the cheese gently but surely melts and the bread develops the ideal crunch and color.2. Use mayo.We know, we know: There are some butter people out there. But here at BA, we’re team mayo. First of all, it’s perfectly spreadable right out of the jar, making it easy to get a smooth layer all the way across all of your pieces of bread. Two, it has a higher smoke point than butter, meaning it won’t start to burn on your way to golden-brown. But hey, if you insist on using butter, at least make sure it’s room temperature for optimal spreadability. Which brings us to our next point...3. Spread your spread to the very edges.This one is pretty self-explanatory, but good coverage is key to every bite being as delicious as the next.4. Use a melting cheese.We love parm, Manchego, and feta as much as the next person, but no way are we using those in a grilled cheese recipe. Some cheeses are born to melt; others not so much. Our recipe uses a combo of American (nothing beats its creamy consistency) and, to balance all that mildness, sharp cheddar. That’s a fail-proof combo, but if you want to play around, feel free. As long as your cheeses are in the melting family, you’ll be alright.5. Use bread with a tight crumb.Meaning: no hole-ridden sourdoughs or airy focaccia here. You don’t want your cheese spilling out onto the bottom of your pan and burning, now do you? We generally prefer white bread—leaving grainy loaves, ryes, and whole-wheats for other days and other sandwiches—but the choice is yours.6. Carefully consider your fillings.Full disclosure: There was a fair amount of discussion about whether we should add fillings to our grilled cheese at all This is a sandwich that doesn’t need fillings—but it certainly likes them. Not just any filling, though. You'll need to be smart about what you choose. Stay away from anything watery (unless it’s a peak-season summer tomato) so that your sandwich doesn’t get soggy. And remember: Anything that you wouldn’t want to eat raw on its own (mushrooms, yellow onion, bacon) won’t cook in the sandwich—you’re going to need to cook it ahead of time. Lastly, think about balance of flavor: Balance the fatty cheese and buttery bread with something bright and sharp. Before Molly Baz landed on her final recipe, we tossed around lots of ideas—like pickled red onions, kimchi, spicy tomato jam, sauerkraut, cilantro chutney. But it was the combination of sweet-toasty charred scallions and fiery-fresh spicy pickled jalapeños that won our hearts.So make your late-night, five-minute grilled cheese as many times as you'd like. We're not stopping you. But in the light of day, when you've got ten minutes, a jar of mayo, and the desire to treat yourself to a little something extra, this recipe's here for you.Get the recipe:Added-Value Grilled CheeseStarting your grilled cheese (slathered in mayo, obviously) in a cold nonstick skillet, then slowly and gently heating it up is the trick to achieving evenly golden brown, supremely crisp exteriors, with molten cheesy interiors.View RecipeExplore Bon AppétitSandwichGrilled CheeseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-24", "author": ["Condé Nast", "Emma Wartzman"]}