{"id": "adda826b4124c72cd5ccc3177f2500f7", "url": "https://www.bonappetit.com/recipe/charred-tomato-salsa", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Charred Tomato Salsa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCharred Tomato SalsaBy Miguel VidalMay 22, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintNothing beats serving this salsa still warm and freshly blended. The bright lime juice and herbaceous cilantro are most bracing straight out of the blender. This recipe is from Valentina’s Tex Mex BBQ in Austin, TX.Ingredients4 servings2Tbsp. extra-virgin olive oil6plum tomatoes (about 2 lb.), cut into 1½\" pieces¼small onion, chopped1garlic clove1serrano chile, coarsely chopped½cup cilantro leaves with tender stems1Tbsp. fresh lime juiceKosher saltPreparationStep 1Heat oil in a medium skillet over medium-high. Cook tomatoes, stirring occasionally, until slightly charred, 7–10 minutes. Reduce heat to medium-low and continue to cook, stirring occasionally, until saucy and juices are thickened, 6–8 minutes. Let cool slightly.Step 2Transfer tomatoes to a blender and add onion, garlic, chile, cilantro, and lime juice. Purée on high until mostly smooth but still with some texture; season salsa with salt.Step 3Do Ahead: Salsa can be made 2 days ahead. Cover and chill.How would you rate Charred Tomato Salsa?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleChared salsa close but A friend from Mexico taught me the best salsa, how she makes it. Everyday. Simple. In a large frying pan blacken the outside of your tomatoes onion garlic and sorrano peppers over high heat. Flipping them to blacked at least two sides. Throw in in food process with salt to taste 1/2 to whole line squeezed and fresh cilantro. I like it fairly chunky so lightly process. Fantastic such fresh flavors taste like it’s picked straight out of a summer field AnonymousOregon Coast1/23/2021Explore Bon AppétitSalsaCondimentTex-MexAmericanPlum TomatoTomatoVegetableCilantroHerbs & SpicesLimeCitrusFruitSummerQuickEasyStarterSnackDairy-FreeGluten-FreeNut-FreeVeganVegetarianHealthyishSearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Miguel Vidal"]}