{"id": "ade4335c66dd3e1720715d1c17e8fa9c", "url": "https://www.bonappetit.com/story/dinner-is-best-served-cold", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "4 Make-Ahead Meals for Summer Dinner Parties  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDinner Is Best Served Cold: 4 Complete Menus You Can Make in AdvanceThese make-ahead, family-style menus are here to help you host a summer dinner party while staying as cool and relaxed as that cocktail in your hand.By Anna StockwellJuly 13, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailLate summer is the easiest time of year to throw a dinner party. The produce is so good you hardly have to do anything to it to serve it—a platter of sliced tomatoes simply drizzled in olive oil and sprinkled in salt becomes a desirable side dish. Plus it’s so hot out that no one wants to eat anything fresh off the skillet anyway so you can put aside any worries of trying to cook and host at the same time. Instead, grill or roast your meat or fish meat in advance and serve it cold or at room temperature with homemade sauce on the side. And I’ve found that something about the fact that we all know summer is coming to an end makes people more willing to stay up past bedtime lingering over the table long after the dishes have been cleared, especially if that table is set out in the backyard or under the stars on the deck or patio and lit only by candles.Late summer has also always been my season of family vacations, weekends away with big groups of friends, and birthday dinners. All of which means I’m cooking lots of big celebratory group dinners, some of them cooked in unfamiliar kitchens, and most of them served on tables we’ve dragged outside. So I’ve had a lot of chances to find a menu template that works just as well for me as the cook as it does for everyone who eats it. And no one, myself included, is sick of it yet.Cold Roast Salmon with Smashed Green Bean SaladRoasting salmon low and slow yields fish that stays moist and tender even when served chilled.View RecipeMy template goes like this: one large platter of cold roasted or grilled meat, fish, or chicken, one large platter of a cold seasonal vegetable salad, one or two sauces that work on everything on the table, lots of cold wine (I especially love to serve a chilled red wine like a dolcetto), and then maybe I’ll add an extra green salad or a basket of fresh sliced crusty bread for mopping up those sauces and rounding out the meal. (And some ice cream and fresh fruit for dessert.) It’s exactly what I want to eat on a hot summer night, and it couldn’t be easier to cook for a crowd. Here’s how I do it.Cold Beef Tenderloin with Tomatoes and CucumbersFor this dinner-served-cold recipe, sear beef tenderloin on the grill, and then toss with juicy tomatoes and cucumbers.View RecipeCook Your Entrée Well in AdvanceI get all my shopping done for my dinner party one or two days in advance, and then I start my cooking the day before. Not because these things necessarily take a long time to cook, but because I want to give the food, and myself, plenty of time to chill between cooking and serving. Standing over a hot grill or having my oven blasting on a hot summer night while I’m trying to be hostess with the mostess and sweating through my dress does not feel great. Instead, I get all my grilling and roasting done in the cool of the night before the party if I can, or the morning of the party in a pinch.A whole boneless roasted leg of lamb is one of my favorite things to serve cold in the summer: I rub the lamb with a paste of garlic, rosemary, and cumin before roasting, then wrap it up tightly once it’s cooled and tuck it in the fridge overnight. Another favorite is a whole side of salmon, which only needs a dousing of olive oil and a sprinkling of salt, pepper, and crushed red pepper flakes and about 20 minutes in a low oven before it’s perfectly tender and ready to chill. If I want to fire up the grill outside, which has the added benefit of keeping the house cool outside, I’ll toss a bunch of smoked paprika-rubbed chicken parts on the grill then let them cool to room temperature before packing them away for the night. Or for the ultimate summer grilled decadence, I’ll rub a whole beef tenderloin in lots of cracked pepper and salt and quickly sear it on the hottest part of my grill then move it over to a lower temperature to gently cook it to a consistently tender medium-rare. Whichever main I choose, by the time it’s time to serve dinner, my hair doesn’t smell like smoke, I’m not sweating, and my kitchen is nice and cool.Cold Roast Lamb with Marinated EggplantPop the garlic-and-rosemary-rubbed leg of lamb and the eggplant into the oven together and they’ll be done at the same time.View RecipeIf You’re Turning on The Oven or The Grill, Make it Work Double for YouIf I’m roasting my entrée in the oven, there’s a whole second rack that’s going unused. And if I’m heating up my kitchen with my oven on, I want it to be really worth it. So maybe I’ll bake something to serve for dessert too. Or while that lamb roasts, I’ll slide a tray of sliced eggplant and whole shallots in to roast at the same time. And if I’m grilling my main, I’m going to get a little extra out of that grill too, even if it means just throwing a few serrano peppers on there to char to use for my salsa verde. Or I’ll throw a bunch of bell peppers on to char before I start my chicken to turn into the side.Master Vegetable MarinadeTurn any roasted or grilled vegetable into a picnic-ready cold salad by marinating it for a few hours in this sweet-tart vinaigrette.View RecipeEmbrace Marinating VegetablesThe nice thing about cooking dinner in advance is that you have lots of time to let time itself do some heavy lifting for you in terms of developing the flavor of your meal. My master roasted vegetable marinade is simply a mix of equal parts sherry or red wine vinegar and extra virgin olive oil seasoned with a bit of honey and salt. Toss those roasted eggplants and shallots in it and let them sit overnight and the flavor that develops is pure magic. Or those charred bell peppers you grilled to go with the chicken: toss them in the same mixture with some fresh oregano and they’ll turn more silky and irresistibly sweet-tart than you can imagine. You could use the same formula on grilled zucchini or summer squash or corn or even roasted carrots.Sometimes I want to keep the vegetables raw, but a marinade can still be useful. For my whole roasted side of salmon, I make a smashed raw green bean salad (yes, you can eat green beans raw—especially this time of year when they’re so fresh and sweet) and let it marinate overnight in a lemon juice dressing to help further tenderize the green beans and infuse them with flavor.Cold Paprika-Grilled Chicken with Marinated Bell PeppersThis dinner is bet served cold—yep, we said it. The juices from the marinated peppers glaze the chicken too.View RecipeTwo Sauces are Better Than One, and One Sauce is Better Than NoneI’ve found that nothing delights guests more than playing choose-your-own sauce adventure with two different sauces that both work equally well with all parts of the meal, so I always make two: one creamy and tart, one herby and a little bit spicy. Both of these sauces pair well with every single recipe in all four menus here. And they both make enough that you won’t run out—because there’s nothing sadder than running out of sauce. During one such dinner party last summer when my friends were mopping up the last of the sauces, one friend posed a thought experiment to the table: “if you had to give up either sauce or sex, which would you choose?” I’ll just say that some marriages were put to the test in the discussion that ensued. I don’t necessarily recommend that thought experiment, but I do recommend my sauces, both of which you can make up to a day in advance of serving.Lemony Yogurt SauceA creamy citrus sauce that pairs well with any protein you’re grilling this summer.View RecipeMind Your Timing When Removing Things From The FridgeThe only slightly complicated thing about my cold dinner entertaining strategy is remembering when to remove each thing from the fridge before serving. Because some dishes are better served more cold than others. Most everything benefits from a bit of tempering out of the fridge before serving except for the beef tenderloin, which I like to slice and serve directly from the fridge so it’s as firm and cold as possible. I’ve included the timing of when to remove each item from the fridge in each of my recipes, so know that that’s there for a reason—the marinated vegetables especially need time to soften and warm to room temperature before serving so they don’t have bits of solidified olive oil all over them. Set a timer on your phone if you need to: letting things sit out longer than they need to before serving is generally better than not letting them sit out long enough.Grilled Serrano Salsa VerdeThis smoky sauce goes well\nwith any grilled meat or fish. The grill tames the heat, don’t worry.View RecipeSpruce Things Up Before ServingTo make sure your dishes still feel fresh even though you’re serving them cold, you want to save a few steps for the last minute—none of which should make you break a sweat. If you’re slicing meat, it should be done as close to serving as possible, and of course the raw tomatoes and cucumbers should be sliced then too. Add any fresh herbs, like the parsley in the marinated eggplant salad or the basil on the tomatoes at the last minute, and then give every single dish a fresh sheen of your best extra virgin olive oil and a sprinkling of flaky sea salt before you bring it out to the table—it’ll make everything taste better, and make it all sparkle and shine, just like the night.Explore Bon AppétitBeef TenderloinLambSalmonChickenGrillSummerDinnerRead Morerecipes4 Lettuce Wrap Recipes to Assemble, Eat, and RepeatGallery4 SlidesBy Molly Bazrecipes18 Easy Rice Noodle Recipes to MakeGallery18 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-13", "author": ["Condé Nast", "Anna Stockwell"]}