{"id": "adeb7f6584152ebd96656792a5fa36bb", "url": "https://www.bonappetit.com/recipe/smashed-and-loaded-crispy-potatoes", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Smashed Crispy Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSmashed and Loaded Crispy PotatoesBy Molly BazDecember 23, 20184.8(24)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintCooking potatoes twice—once in water, and a second time in hot oil—is hands-down the best way to achieve extra-crispy potatoes at home. And while there's nothing wrong with a plate of crunchy, well-seasoned spuds, smothering them in all of the best parts of a baked potato—helloooooo, bacon and sour cream!—takes the whole situation to the next level. Serve these alongside a big ol' steak for a real at-home chophouse experience, or just eat them all by yourself on the couch.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLarge Pot$55 At AmazonMicroplane$16 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonPlate$55 At Bon Appétit MarketPaper Towels$13.45 At AmazonCast Iron Skillet$30 At AmazonForkParing Knife$10 At AmazonColander$11 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketFlexible Metal Spatula$9.99 At AmazonIngredients4 servings2lb. fingerling or other small (1½\"-diameter) potatoesKosher salt12-oz. piece Parmesan1large bunch chives½cup sour cream2Tbsp. hot sauce5oz. bacon4Tbsp. extra-virgin olive oil, dividedFreshly ground black pepperPreparationStep 1Place 2 lb. potatoes in a large pot and cover with water by 2\". Add 3 large fistfuls of salt and heat over medium-high. Taste the water! It should be real salty, almost like seawater. If not, add more. Bring to a simmer. While you're waiting for the water to simmer, go ahead and get some prep work out of the way.Step 2Finely grate 2 oz. Parmesan with a Microplane into a medium bowl.Step 3Thinly slice 1 large bunch chives and transfer to a small bowl.Step 4Combine ½ cup sour cream and 2 Tbsp. hot sauce in another small bowl. Add a teaspoon or two of water to thin it out to drizzlable consistency.Step 5Line a plate with paper towels. Place 5 oz. bacon in a large 12\" cast-iron skillet in as even a layer as possible and heat over medium. (We like starting bacon in a cold pan and gradually heating it—less sputtering, more crispy.) Cook until crispy on one side, 3–4 minutes. Turn with a fork and continue to cook until very crisp, 3–4 minutes more. Transfer to paper towel-lined plate to drain. Reserve the bacon-y skillet—and all of that fat!—for cooking the potatoes later on.Step 6It’s time to check on those potatoes. Once the potatoes come to a simmer, they need to cook until a fork or paring knife easily slides into one without much resistance, 6–10 minutes. This will really vary depending on what size and type of potato you're cooking, so keep checking them periodically for doneness. (When in doubt, cut one open and give it a taste!) Be sure not to cook them too long or they will get logged with water and fall apart. Drain potatoes and transfer to a large rimmed baking sheet or a cutting board. Let cool slightly, about 3 minutes.Step 7Using the bottom of a measuring cup or flat bottomed mug, smash each one gently by pressing down evenly—you want them to have flat surfaces so they'll crisp nicely, but you want them to remain mostly intact. (Some will break into more than one piece; don't worry about it!)Step 8Heat reserved bacon skillet over medium. If the pan isn't fully coated with bacon fat, add a good drizzle of oil—you want to make sure that there's enough fat in the pan at all times so that each potato gets a piece of the action. Arrange half of potatoes in a single layer in skillet. Season with salt and cook, undisturbed, until golden brown and crisp underneath, 6–7 minutes. Flip with a metal spatula, add 2 Tbsp. oil, and continue to cook on opposite side until golden brown and edges are crisp, 5–6 minutes more. Transfer to a platter. Heat remaining potatoes and 2 Tbsp. oil in skillet over medium. Season with salt and repeat browning and flipping process, adding more oil if the pan gets dry.Step 9While second batch cooks, you can begin loading your potatoes. Crumble bacon with your fingers and scatter half over potatoes. Sprinkle half of Parmesan over. Drizzle sour cream sauce over. Sprinkle half of chives evenly over.Step 10When second batch of potatoes is finished cooking, transfer to platter and repeat loading process with remaining bacon, Parmesan, sour cream, and chives. Season with pepper and serve.How would you rate Smashed and Loaded Crispy Potatoes?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThese were a fantastic switch from our traditional side dishes. Enjoyed by everyone and we got lots of ideas on how we can make them with different ingredients. KayMenomonee Falls, Wisconsin 12/2/2021To die for. Would love to see nutritional stats because I plan to use this recipe to blow my diet at least once a month, and need to know how much tofu and cucumbers to stock up on to balance my numbers!marcilouannPhiladelphia 11/14/2021Anonymous MD, try adding AdBlock to your computer.  Works great and you can disable and enable for specific websites because some will ask you to disable.  Free for Firefox, Chrome, Safari, Android and iOS.AnonymousSan Ramon, CA11/14/2021Unfortunately, it was very difficult to read the text because there were ads all over the page. I missed at least 1/4 of the piece, including the recipe itself.  I couldn't see how to remove them. Very annoying. Maybe you can tell me how to get rid of them; I'd appreciate it. AnonymousMD11/14/2021This is a go-to recipe for when I need an appetizer to share! Everyone I’ve ever made this for has fallen in love with it! I leave out the raisins and use plain Greek yogurt instead of sour cream. These potatoes are the best!! AnonymousArizona5/26/2020This was incredibly tasty. Lid slipped on my Texas Pete and ended up with extra hot sauce in the mix. Resulted in a delicious spicy food loop - eat, heat, go back for more. Will absolutely make again.AnonymousBrooklyn, NY5/11/2020Simply put, this recipe slaps. I replaced some of the oil in the sauce with two tablespoons of brown butter to up the nutty, rich flavor. One of the best things about this recipe is that it's so easy to riff on. Anonymous12/17/2019This was really good, but maybe one of those reviews I shouldn't leave because I changed the recipes so dramatically. Will definitely make again as written, but wanted to use up some stuff I had in the house. Obviously a recipe you can riff on! This is what I did:\nDo the potatoes as written. Though I did just one batch of potatoes, enough to fit, when smashed, in the cast iron pan. While they were boiling, I cooked up (in the cast iron pan), some Italian-style chicken sausage disks and a medium onion, adding some leftover broccoli at the end, just to warm it up. Put them aside, crisped the potatoes (using oil since there was no bacon fat) and when they were almost done on the second side, put the chicken/veggies on top and covered for a few minutes to get them hot again. Oddly good with ketchup…\nacseligm11/16/2019This is the best way to make potatoes!  I used this recipe as a guide, and added additional garnishes like butter and garlic and rosemary to make it more fragrant.  I don't regret that second serving of potatoes.  It's such a guilty pleasure, that I want to keep for dinner, and not make for anyone else.AnonymousHouston, TX11/5/2019I was hoping to save a printable copy in my favorites. The recipe looks really good, I'm drooling! ;) Allison MacKayMichigan9/10/2019yummy.  i'll use green onions instead of chives, and some schmaltz or lard to fry up that second batch of smashed taters.  i have Tabasco Scorpion Sauce, and it's hotter than a blast furnace -- maybe 1/4 tsp. of that, and then add some regular Tabasco.  mine will definitely need more bacon, i'm thinking.  and Parm instead of shredded Cheddar?  idk about that.hollis5Vero Beach, FL2/2/2019Great recipe! Made a few adjustments, kept  half of bacon  fat  for second batch and did not add more salt as Bacon and parmesan already salty. AnonymousMontreal1/6/2019Explore Bon AppétitPotatoVegetableBaconCured MeatMeat Fingerling PotatoSnackStarterSideGluten-FreeNut-FreeSimmerFryFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-23", "author": ["Condé Nast", "Molly Baz"]}