{"id": "adfeaeef71ada782b7a3ef3a4437dac9", "url": "https://www.bonappetit.com/story/cook-out-watermelon-milkshake", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Cook Out’s Watermelon Milkshake Gets Me Through the Southern Summers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Milkshake That Gets Me Through the Southern SummersFind it at Cook Out, the Southeast's cult-favorite fast-food chain.By Amanda ShapiroJuly 10, 2019FacebookTwitterEmailPhoto by Rinne AllenFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There are only a few reasons I’ll brave the South’s sky-high humidity levels in the summertime, and the watermelon milkshake at Cook Out is one of them. The cult-favorite fast-food chain with locations across the Southeast is centered on burgers (which you can get as part of a combo tray at 3 a.m. with a corn dog and a chicken quesadilla on the side, if you’re into that).But there are also more than 40 shakes on Cook Out’s menu, including flavors like fresh banana and peach cobbler. I’ve never tried one I didn’t like. However, the flavor I look forward to all year long is watermelon, made with the creamiest vanilla ice cream and bite-size chunks of real fruit. It’s only available in July and August, a.k.a. the two most sweltering months of summer, but that’s part of what makes it so craveable: You gotta strike while the temps are hot. And you’ll keep going back until September hits because this thing is like air-conditioning you can drink.Go there: Cook OutExplore Bon AppétitHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-10", "author": ["Condé Nast", "Amanda Shapiro"]}