{"id": "adff393ea7b22dd95ff050f145baa3ac", "url": "https://www.bonappetit.com/recipe/sesame-creme", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Sesame Crème Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueSesame CrèmeBy Maricela VegaJanuary 12, 20215.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jessica Pettway, Food Styling by Sue Li, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis creamy vegan sauce comes from Maricela Vega, the chef at Atlanta restaurant 8ARM and founder of Chicomecóatl, an organization centering the foodways of Indigenous Mexican diaspora. Cashews are often used to create dairy-free condiments, but Vega's desire to work with regional harvests inspired her to use locally-grown sesame seeds instead. You can adapt this dairy-free recipe to use just about any seed or nut you have. Use it on its own as a savory dressing or blend it with Dijon mustard for a vegan aioli that’s good on everything from fried potatoes and sandwiches to burgers and fish.IngredientsMakes about 3 cups¼cup grapeseed oil1½cups sesame seeds, divided1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt4garlic cloves¼cup fresh lemon juice1cup Allium ConfitPreparationStep 1Bring oil and ½ cup sesame seeds to a simmer in a small saucepan over medium heat. Cook, swirling pan constantly, until seeds are golden, about 2 minutes. Transfer oil and seeds to a small bowl and let cool; reserve saucepan.Step 2Bring remaining 1 cup sesame seeds, salt, and 1 cup water to a boil in reserved saucepan over medium heat; cook 2 minutes. Drain seeds in a fine-mesh sieve; let cool.Step 3Combine garlic, lemon juice, and boiled sesame seeds in a blender and blend on high speed until a coarse purée forms. Add sesame seeds in oil, Allium Confit, and 1 cup ice water and blend on high speed, adding more ice water a little at a time if needed, until very smooth and thick. Season Sesame Crème with salt and pepper.Step 4Do ahead: Sesame Crème can be made 3 days ahead. Cover and chill.How would you rate Sesame Crème?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis recipe is so delicious. We used it as a healthy alternative to dip carrots, radish, etc. into. My husband said it was his favorite dip I've made. It is a lot of steps but worth it.  JaclynAtlanta, GA2/14/2021Explore Bon AppétitSauceCondimentEasyQuickGluten-FreeVeganVegetarianDairy-FreeHealthyishSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Maricela Vega"]}