{"id": "ae0139438d33fb239eb4016e89934288", "url": "https://www.bonappetit.com/story/the-egg-house-pop-up", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "The Egg House Pop-Up Is an Interactive Experience for People Who Really Love Eggs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Egg House Pop-Up Is an Interactive Experience for People Who Really Love EggsWho was the (marketing) genius behind this one?By Chelsea StoneMarch 12, 2018FacebookTwitterEmailCourtesy of The Egg HouseFacebookTwitterEmailEgg enthusiasts, this is no time for yolking around: The glorious, versatile egg is finally getting the tribute it deserves in the form of an interactive pop-up in New York City’s Lower East Side. The Egg House, set to open on April 7, allows egg lovers to immerse themselves in multisensory installations dedicated to everyone’s favorite oval ingredient.The exhibit implores visitors to imagine the home of a fictional personified egg character named Ellis, who just so happens to have built his nest in New York City. Each of the exhibit’s rooms in the house—including The Foyer, The Kitchen, The Hallway, The Pool, and The Garden—is meant to be a different part of this egghead’s home. (The Egg House’s Instagram account tells Ellis’s life story more in-depth.) But even if contemplating the life of a young eggling taking on the big city seems like a tough egg to crack, fans of other food-themed pop-ups, like the Museum of Ice Cream or the upcoming Museum of Candy, will certainly enjoy walking (on eggshells, perhaps) through the six themed rooms, which will feature a pool filled with caviar-shaped balls, a human-sized egg crate, an egg-shell swing suspended from the ceiling, along with a scrambling of other breakfast-centric surprises.The Egg House was conceived by an anonymous founder looking to create a fantastical escape from the real world, and it was brought to life by a group of young talents who graduated from NYU, Parsons, SVA, and Pratt Institute with backgrounds in art, interior design, and marketing (clearly), according to a press release. The founder says she choose to focus the space on the egg “because it’s universal. It can be seen in almost every cuisine. Although each culture interprets it differently, it’s so versatile that everyone can relate to. That’s why we included the egg in different shapes and forms—it creates a familiarity. Eggs also represent breakfast and therefore mornings and energy—everything that is great in this world.”And, naturally, a trip to the Egg House would not be complete without dozens upon dozens of actual eggs. Vendors such as Egg Shop and Eggloo will be on hand to satisfy egg cravings both savory and sweet, and the Egg House team will also hand out complimentary breakfast items with coffee in the mornings and tastes of eggnog in the afternoon as a \"pick me up moment.\" Not to mention, the gift shop will be stocked with “eggcessories” (ugh) aplenty.Tickets to the sunny side-up experience, located at 195 Chrystie St., go on sale March 15 at noon, and can be purchased here for $18 per person ($12 for senior citizens and children under 10). Looks like it will be a shell of a time.Courtesy of The Egg HouseCourtesy of The Egg HouseCourtesy of The Egg HouseCourtesy of The Egg HouseCourtesy of The Egg HouseCourtesy of The Egg HouseCourtesy of The Egg HouseExplore Bon AppétitTrends + NewsEggNew YorkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Chelsea Stone"]}