{"id": "ae12e64ae96c0df272c88c2f9c34a4fd", "url": "https://www.bonappetit.com/story/fell-in-love-red-sauce-new-orleans", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Red Sauce Heaven Is a Place...in New Orleans | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRed Sauce Heaven Is a Place...in New OrleansYeah, I grew up in Brooklyn, the epicenter of Italian-American food. But it wasn’t until I moved down South that I learned to truly appreciate the stuff.By Brett MartinApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I grew up in red-sauce heaven: a largely Italian-American neighborhood in Brooklyn, where pizzerias and pasta joints were everywhere. Meatballs, ziti, calzones, and parms of every variety were staples of my young diet. Then, as happens, I started to get ideas. First there was a new restaurant my family referred to simply as the “Northern Italian place”; it offered strange dishes like risotto and veal Milanese that were decidedly not red. (My concept of sophistication in those days was entirely color-based.) Then came the dining revolution that put all the diverse regional cuisines of Italy front and center in America’s restaurant culture. This, I thought, was real Italian: no red-checked tablecloths, no dusty bottles of Chianti, no tomato sauce. I had left such childish things behind.But as they say, “Just when I thought I was out….”Joe Marcel a.k.a. ”Mr. Joe” eats at the bar and sips a Sazerac several nights a week at Mandina’s.\nPhoto by Alex LauEight years ago I moved to New Orleans. Of all the dishes I anticipated stuffing myself with in my new home—po’boys, crawfish, beignets, speckled trout—Italian ones didn’t even cross my mind. This turned out to be a major blind spot: The influence of Southern Italian food on New Orleans cuisine is as overlooked by outsiders as its supposed French influences are vastly overstated. (Similarly, the distinctive look of the French Quarter is actually largely a remnant of a brief period of Spanish rule.) Sicilians began arriving in New Orleans as early as the 1830s, and continued to flood in well into the beginning of the 20th century—part of the same melange of immigrants that makes the New Orleans accent sound strikingly like it’s been imported from the Bronx.Their legacy is hiding in plain sight, broadcast in the names of some of the city’s most iconic neighborhood food businesses: Domilise’s Po-Boys, Casamento’s, John Gendusa Bakery, Angelo Brocato Italian Ice Cream and Pastry. The highest profile Southern Italian specialty in town is probably the muffuletta—a sandwich of salamis, hams, and cheeses, slicked with a layer of briny olive salad and pressed between the horizontally split halves of a large spongy Sicilian loaf—but there are dozens of other delicacies as integral to the New Orleans foodscape. I’m thinking of fat artichokes, laboriously stuffed with breadcrumbs and seasoning until they are more bread than vegetable. Of the anise-scented pine nut cookies you find on St. Joseph’s Day altars every March. Of iceberg lettuce, covered in olives, anchovies, and asparagus, drowning in a sea of vinaigrette—a dish that until shockingly recently was still often referred to on many menus with an ethnic slur but now mostly appears simply as “Italian Salad.”Mosca's vintage jukebox\nPhoto by Alex LauAdolfo’s Veal Ocean\nPhoto by Alex LauI’m thinking of the pilgrimage to Mosca’s, the legendary outpost and reputed mob hangout, way out across the river in Westwego, for chicken à la grande, swimming in olive oil, rosemary, and garlic. Or to the shore of Lake Pont­chartrain for R&O Restaurant’s Italian special—a combo meatball and sausage  po’boy. Of eggplant Tina, a square of thin layered eggplant and cheese once served at the late, lamented Tony Angello’s and now revived at Nephew’s, opened by a relative in the suburb of Metaire. Of Veal Ocean, a pounded cutlet striped like a slab of Napoleon ice cream with crab, shrimp, and crawfish sauces at Adolfo’s, perched over crowds of concertgoers on Frenchmen Street. All of these fall under the umbrella label “Creole Italian”—though the degree of Creole can wax and wane: a touch of extra spice in the sauce, a drop of Pernod in the baked oysters, the use of Gulf fish and shrimp. As in many aspects of New Orleans culture, sorting out who influenced who in what proportions, and vice versa, can be a futile endeavor. Ultimately, you throw up your hands and eat.Above all (and often literally on top of all), there’s red gravy—the local version of what New Yorkers know as “the sauce.” It tends to be sweeter here, brighter red, and more one-dimensional if truth be told, but perfect for its highest purpose, which is dressing a plate of noodles topped with meatballs. For me, the Platonic ideal is served at Mandina’s—the garlicky meatballs roughly the size of tennis balls, the sauce a shade of red in which you might order a convertible. This is my heart’s emoji of “Italian food.”Chef Robert Jackson serves up Mosca’s chicken à la grande\nPhoto by Alex LauI’ve eaten twice as many meatballs in the eight years I’ve lived in New Orleans than I did in the previous 30 I spent in Brooklyn. Part of it is simply the pleasure of meeting an old friend in a different context. Part is growing up and shedding youthful pretensions. But maybe, like so many things, red sauce is just easier in New Orleans than it is in New York. It’s not a class-signifier. It’s not trendy or untrendy. Not cool or uncool, ironic or referential like the spate of expensive neo-red-sauce joints that have popped up in recent years. It is only, as it has always been, delicious.Brett Martin is a correspondent and lead food critic for GQ magazine.Explore Bon AppétitRestaurantsNew OrleansItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Brett Martin"]}