{"id": "ae17a26b17c6ca4a0d6361db51513f8d", "url": "https://www.bonappetit.com/story/the-privilege-of-feeling-good", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "The Privilege of Feeling Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Privilege of Feeling GoodHealthyish editor Amanda Shapiro on Alabama's newly passed abortion lawBy Amanda ShapiroMay 16, 2019FacebookTwitterEmailIllustration by Simone NoronhaFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Yesterday’s news about Alabama effectively banning abortions, even in the case of rape and incest, was troubling and terrifying for a lot of us. For me and many others born after Roe v. Wade, the legality of abortion has always been a given, a right we never questioned. Now, as states challenge and chip away at that right, and with a conservative majority on the Supreme Court, it feels like the beginning of a post-apocalyptic future (All that Handmaid’s Tale protest attire really drives the point home).This New Yorker interview with a Supreme Court reporter was perhaps the most chilling thing I’ve read on the subject in the last few days. Linda Greenhouse explains that the Supreme Court is unlikely to overturn Roe v. Wade in a single ruling. The more likely scenario, she says, is that they’ll gradually erode the precedent through rulings that are more narrow in scope, like requiring doctors who perform abortions to have admitting privileges at certain hospitals. “They could uphold this obstruction, and they could uphold that obstruction, and they could send all these signals,” Greenhouse says. “And so, if Roe finally falls, it’ll fall with a little push of a pinkie, rather than a frontal assault, because there won’t be much left of it.”Each week in the Healthyish newsletter, I share my personal perspective. I talk about how we feel good in our bodies, whether that’s through the food we cook, how we move, who we’re with, or how we treat ourselves. And I talk about the things that get in the way of feeling good, like illness, stress, and mental health. I talk less often about the politics and privilege of feeling good: Who can afford fresh, healthy food and therapy and who can’t? Who has the time and support to take care of themselves and who doesn’t? Who has access to healthcare that respects a person’s agency over their own bodies, and who is being denied?Today I’m thinking about that last question, and I’m donating to the ACLU, who’ll be taking the state of Alabama to court, and the Yellowhammer Fund, which provides funding to people seeking care at any of Alabama’s three abortion clinics. There are more resources for donating and supporting here, here, and here.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleHow I'm Talking to the Men in My Life Right NowBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-16", "author": ["Condé Nast", "Amanda Shapiro"]}