{"id": "ae2023372ca18a562b0be9315c576c5a", "url": "https://www.bonappetit.com/recipe/pork-and-asparagus-stir-fry", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Pork and Asparagus Stir-Fry Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssuePork and Asparagus Stir-FryBy Deb PerelmanMarch 17, 20204.8(76)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintA Sichuan-inspired stir-fry of blistered yet snappy asparagus and crispy pork in an aromatic sauce from Smitten Kitchen’s Deb Perelman. We jump on asparagus the second we see it at the market this time of year, but green beans, snap peas, or any other crisp green spring vegetable would also be great here. Don’t forget a side of chile crisp.Ingredients4 servings3tsp. peanut or vegetable oil, divided2lb. asparagus, trimmed, cut on a diagonal into 1\"–2\" pieces8oz. ground pork6scallions, white and pale green parts only, finely chopped5garlic cloves, finely chopped12\" piece ginger, peeled, finely chopped2Tbsp. Shaoxing wine (Chinese rice wine) or medium-dry sherry2Tbsp. soy sauce1tsp. toasted sesame oilPreparationStep 1Heat 1 tsp. peanut oil in a large skillet over high. Once pan is hot (oil will be lightly smoking), add half of asparagus and a couple pinches of salt and cook, tossing only once or twice so the pieces have a chance to blister, until crisp-tender and lightly browned, about 4 minutes. Transfer asparagus to a plate. Add 1 tsp. peanut oil to skillet (no need to wipe it out) and repeat process with remaining asparagus.Step 2Reduce heat to medium-high; add remaining 1 tsp. peanut oil to skillet, then add pork, spreading out into an even layer. Season with a couple pinches of salt and cook, undisturbed, until meat begins to brown underneath, about 2 minutes. Break up meat with a wooden spoon and add scallions, garlic, and ginger. Cook, stirring, until pork is crisp and mixture is very fragrant, about 2 minutes. Add wine and soy sauce and return asparagus to skillet. Cook, turning to coat with pork mixture, until heated through, about 1 minute.Step 3Transfer stir-fry to a platter or large shallow bowl and drizzle with sesame oil. Serve with rice and chili crisp.How would you rate Pork and Asparagus Stir-Fry?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleWas going to make ground pork and cucumber stir fry tonight but came upon your asparagus idea and changed plans without too much trouble.  Glad I did! Reduced the salt, took the hint and used chili oil to finish and we ate every last bit of this dish.  Pork and Asparagus has earned a place in my favorite recipes folder.  RedS2KSpokane, Wa3/23/2022I can't handle spice but still wanted a bit of punch, so I added rice wine vinegar and some chopped pickled green beans instead of chili crisp. I wasn't sure the pickled green beans would be a good addition but they really worked! Overall, a decently flavorful stir fry. I'll probably add some extra soy, vinegar and sesame oil when I cook up the leftovers.BrittneyDallas, TX3/15/2022My whole family loves this recipe. I use broccoli or baby broccoli instead, my kids will eat that sooner than asparagus. We usually do a gojuchang Mayo on the side that adds perfect spice to it. I usually skip the salt and just add a little extra soy sauce to the meat. We double the recipe so we can have leftovers too!! Just do the pork in separate batches. Tonight we did it with spaghetti squash as the base and it added a great texture plus extra veggies! We make this probably once a week, great recipe!AnonymousAtlanta, Ga2/19/2022This is delicious! It comes together quickly has become part of my weeknight dinner rotation. I use dry sherry instead of the  Shaoxing wine. Quite often I forget to purchase scallions and substitute a sliced yellow onion that I blister before the asparagus - I think I like it even better with the onion. I serve with Jasmine rice. EPAthens, GA4/11/2021Cut the Salt!!!  Too much Salt being specified in these recipes.  Not needed.  Bad for health.AnonymousTexas3/8/2021An amazing dish, excellent as leftovers.\n\nMy spin on it involves a little bit of Dijon mustard on top while serving. It's worth a tryPhil ASan Francisco CA3/3/2021This is one of my favourite recipes to make on a weeknight - it's fast and soo tasty. I have substituted pork with vegan mince, and even just diced mushrooms and both are delicious alternatives. The key is the fragrant Shaoxing wine - can't be replaced! And finish with chilli oil for added heat and salt. I serve with sticky jasmine rice and it's always a winner.NicoleLondon1/26/2021It's a good recipe, easy to make. The flavors as-written are fine but not outstanding. If you have it on hand, adding 1 tsp of ground szechuan pepper makes a huge difference and really takes this dish to the next level. I've made it a handful of times a handful of different ways (green beans, crumbled tofu) and they've all been tasty. Julia ChildlessWashington, DC1/19/2021So flavorful and it comes together super quick. The next day it’s still really good too. The star of the show is the chili crisp though. It elevates anything you put it on. So good I make it once a month. I put it on noodles, rice, eggs, literally anything. Sara GNew York, NY1/14/2021I usually like your recipes.  This one did nothing for my family.  They said it was ok, but they didn't ask for it again. I'll try it again in a few months.priests  wifeNorthfield, MN12/16/2020I used leftover pork tenderloin that I cut into strips, didn't have the special oils or wine but substituted olive oil and regular cooking sherry.  It was easy and awesome!  I liked that I didn't need a cornstarch-based sauce or the fancy ingredients to get a quick flavorful way to use up leftovers!GratefulWest Chester, Ohio12/1/2020I make this once a week. Nuff saidAnonymousSan Francisco 10/2/2020So easy and so delicious. I've made it both with asparagus and with green beans. Both are great. This is a great weeknight dish.coopcoAntelope, CA6/29/2020I love this recipe! It's a great bi-weekly monthly one to use with any vegetable in season. I didn't have any scallions on hand, so I subbed shallots and it was a very happy accident! I liked it better with the shallots than the scallion whites. AnonymousSeattle6/17/2020This really is such a great recipe!  Super simple with great flavors.  My in-laws are coming by tomorrow and I plan to make it for them!blubeauty22Sag Harbor, NY6/5/2020Explore Bon AppétitStir-FryAsparagusVegetableGround PorkPorkMeatScallionOnionSpringWeeknight MealsQuickEasyOne-Pot MealsMainDairy-FreeKetoHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Deb Perelman"]}