{"id": "ae4ed4598c17016010976da92dd44641", "url": "https://www.bonappetit.com/story/olive-brine", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Don’t Throw Out Your Olive Brine! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDon’t Throw Out Your Olive Brine!This basically free ingredient can add salt and savoriness to all kinds of dishes.By Katy FrankAugust 24, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailLike finding just a dribble of milk left in the carton, discovering one lonely olive left in the jar can be devastating. But there’s a silver lining to this otherwise sad situation. Even after you eat the last olive, an unexpected star remains: olive brine. And I’m asking you—begging you!—not to throw it out.Olive brine is the liquid olives are packaged in, essentially salt water that’s been infused with the deep, alluring flavor of olives. And while it’s basically a by-product, I’ve found it to be an incredibly versatile condiment of sorts, a splash of which can lend a welcome pop of salt and complexity wherever it is needed. (To be clear, I’m referring to the brine that comes from the kinds of olives sold in glass jars, or the ones at the deli that you scoop from large trays into plastic containers along with some of the liquid they’ve been sitting in—not vacuum-sealed olives or the ones that come in cans.) While it sounds humble, olive brine is a secret ingredient that stretches my dollar, reduces waste in my kitchen, and adds depth to my vegetarian meals.I’ve found that it’s particularly well-suited to food inspired by cuisines that make good use of the olive: Middle Eastern, Mediterranean, and southern European. A good entry-level use of olive brine is adding a few tablespoons to your store-bought (or not!) marinara sauce, which takes a humdrum meal of noodles and red sauce to an utterly satisfying place—a hack if there ever was one. But the options are pretty much endless. While saving some for extra-dirty martinis is a no-brainer, I also like to add olive brine to salad dressings, blended vegetable soups, pasta salads, grain bowls—you name it, I’ve probably added olive brine to it. Sometimes I even use a splash to season water for cooking rice or pasta, which adds a subtle, implacable savoriness. The beauty of the brine is that while it adds olive flavor, it can be as subtle or strong as you like.My obsession with the stuff started a few years ago when I ran out of olives but desperately wanted spaghetti alla puttanesca, and I haven’t looked back. Once I realized olive brine was a sneaky shortcut to acidity and depth, I started using it creatively and spontaneously, adding it to whatever needed some oomph—and I hope you will too. I, for one, have no regrets.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-12", "author": ["Condé Nast", "Katy Frank"]}