{"id": "ae5809f5dc27f308bb2db5e31647c6c7", "url": "https://www.bonappetit.com/story/best-tomato-knife", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "The Best Tomatoes Call for the Best Tomato Knife | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Best Tomatoes Call for the Best Tomato KnifeYou say you love tomatoes. Now prove it.By Sarah JampelSeptember 3, 2021FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The idea of taking a dull knife (read: most of the cutlery in my kitchen) to an heirloom tomato makes me shudder. Think about it—the skin of an expensive delicate tomato being poked, prodded, and disrespected by anything other than a sharp blade? I’m SCREAMING.I've waited all year for (and spent lots of money on) the Brandywines and Cherokee Purples that are now at the farmers market in abundance. That’s why when it comes time for slicing, nothing but the best tomato knife will do—and for me that's a Victorinox paring knife with a serrated edge.  A serrated blade might seem counterintuitive, but unless your chef's knife is so razor-sharp that it falls through a potato (mine is certainly not), the serrations on the Victorinox's cutting edge are the better choice for juicy, slippery fruit. Because the cutting motion is across rather than down, you'll end up with thin, even tomato slices without tearing the skin or pressing out any of the seeds. If you’ve ever attempted to halve a cherry tomato with a dull knife and watched it go SPLAT!, you’ll understand.Photo by Chelsie Craig Victorinox 4-Inch Paring Knife with Serrated Edge$10 $9 at AmazonThere are occasions when the best knife for cutting tomatoes is actually a high-quality bread knife, like the 10-inch Mercer Culinary Millennia. For example, if you've brought home a beefy heirloom the size of a softball, a 4-inch serrated tomato knife might not be the proper tool for that job. Or say you need to halve a pint of cherry tomatoes for ratatouille pasta or a summery salad that is both fancy and beautiful. In that case, gently sandwich your lil guys between the lids of two quart containers, position a bread knife parallel to the cutting surface and in between the two lids, and saw them all in half in one fell swoop.Mercer Culinary Millennia 10\" Bread Knife$22 at AmazonBut in all other cases, you're going to want to reach for that Victorinox tomato knife, which is easier to maneuver and features an ergonomic handle and a Swiss-crafted, stainless steel blade. I bought it for a very specific purpose when I was a lowly pastry cook, assigned to slice poached pears into improbably thin slices (24 per pear!). But I ended up using the shortie for all sorts of things: cutting citrus into wheels for a cocktail or a tart, slicing ripe plums and peaches for fruit salad or clafoutis, extracting a clean wedge of pie or upside-down cake, sawing through a sticky log of cinnamon bun dough or the diamond-hard chocolate chips in a chilled cylinder of cookie dough.If you’re like, “clafoutis who? I’m never going to do those things,” that’s fine. You should still give this serrated slicer a home in your kitchen, if only for precious, perfect, peak-season tomatoes and all of the flatbreads and salads and toasts and HAVE YOU SEEN THIS GALETTE they grace. My tomatoes deserve the best tomato knife out there. Don't yours?Explore Bon AppétitShoppingTomatoKnifeToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-23", "author": ["Condé Nast", "Sarah Jampel"]}