{"id": "ae616eba2d8a912ebeecd046d99d1b22", "url": "https://www.bonappetit.com/story/add-this-ingredient-to-your-grocery-list-stat", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Add This Ingredient to Your Grocery List, Stat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAdd This Ingredient to Your Grocery List, StatWhat if one ingredient added texture, nutrition, and an umami depth of flavor to nearly every dish you can think of? What if that food was meat-, gluten-, and dairy-free? This fairy dust magic is not hypothetical: Indeed, it’s none other than the humble mushroom.By Mushroom CouncilSeptember 3, 2019FacebookTwitterEmailFacebookTwitterEmailIt might be time to rethink the mushroom. For years it has lived a dual life of highbrow and lowbrow—showing up in fancy restaurants atop steak, or on simple slices of pizza. But there’s so much more to mushrooms, one of the world’s most chameleon-like ingredients, with the ability to elevate dishes of all kinds. Because September is National Mushroom Month, there’s no better time to spread the word: Mushrooms of every type should be a pantry staple, on your weekly grocery list and stocked in the fridge. That way, you and your family will experience all their benefits, from flavor to nutrition to sustainability, every day. Read on, and then show us how you #MushroomADay.Mushrooms Support a Plant-Based DietThe term “plant-based” is entering our collective lexicon for good reason: Eating more plants and less meat is good for your health as well as the environment. You don’t have to go full vegetarian in order to reap the benefits of a plant-based diet. You can start cutting back on beef and pork by mixing vegetables into your meaty dishes. Mushrooms are the ideal choice, because they are meaty to begin with.Try: Blend maitakes into your burger and you’ll see that making a so-called Blended Burger is not merely a virtuous choice, but a delicious one. Try the same method in your favorite meatloaf and meatball recipes.Mushrooms Are SustainableMushrooms are one of the most sustainably produced foods because they grow year-round without needing many resources: Producing one pound of mushrooms only requires 1.8 gallons of water, and one acre of land can turn out one million pounds of mushrooms per year. Mushrooms can grow in all kinds of soil—including beds of compost! Buying mushrooms instead of foods that have a bigger imprint on the environment is a responsible, delicious choice.Try: Pasta, pizza, steak, avocado toast—all of these dishes are improved upon with the addition of meaty, savory, earthy mushrooms. And you’ll feel good knowing you’re supporting a sustainable industry whose mission is to make your food taste better.Mushrooms Boost FlavorCall it umami, call it savoriness, call it a jolt of flavor—mushrooms have that special something in spades. That quality turns a workaday omelet or sandwich into a meal to celebrate. Try this experiment: Think about two or three dishes you turn to most frequently. Now imagine adding mushrooms. It works, right? That’s because the earthiness of mushrooms is a good match to many foods, and they add a depth of flavor and a new texture that helps to elevate most dishes.Try: Sauté criminis with onions and herbs, and mix into your egg scramble for breakfast. For lunch, add cooked button mushrooms to your otherwise humdrum bowl of grains and greens. Throw a mix of specialty mushrooms under chicken thighs for a simple sheet pan dinner.Mushrooms Add NutritionMushrooms live in a category all their own—the fun-to-say fungi category. They provide many of the same nutritional benefits as vegetables, including selenium and other antioxidants, and the B vitamins many of us are deficient in. In fact, mushrooms are the only source of vitamin D in the produce aisle!Try: Think about swapping in mushrooms for high-energy-dense, high-carb foods such as pasta and bagels. Skeptical? You won’t be once you try cream cheese, tomato and capers on a grilled portabella, or tomato sauce and ricotta atop crispy shiitakes. For a lightened-up taco night, throw all your ingredients into a giant salad and adding a generous portion of sautéed button mushrooms.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-03", "author": ["Condé Nast", "Mushroom Council"]}