{"id": "ae666eba13073dbc3f8459fe0bd403d7", "url": "https://www.bonappetit.com/city-guides/portland/venue/nimblefish", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Nimblefish Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginportlandNimblefishThe SE Hawthorne temple of ethereal, Edomae-style sushiFacebookPinterestTwitterEmailAlex LauGO: for the most flavorful, most finessed sushi from chef Cody Auger. His exacting attention to detail, from the rice to the sourcing of the fish, makes each nigiri shine—and earned Nimblefish a spot in our 2018 Hot 10 list.ORDER: whatever you want! There isn't an omakase format at the moment, so go with your gut. From the tenderly boiled octopus over salty Calrose rice to salt-and-sugar-smoked king salmon to the soy-marinated tuna, you can’t go wrong.THE VIBE IS: intimate. At the counter, you’re face-to-face with Auger and his crew, who hand over each nigiri as they’re made to order.PRACTICAL STUFF: Open every day, 5 p.m. to 10 p.m. Make sure you line up early since the wait can be long.WE ALSO LOVEGüeroTorta is just another way of saying “sandwich that will change your life”Le PigeonThe restaurant that put Portland on the national culinary map AfuriA Japanese ramen chain we hope conquers AmericaExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-11-12", "author": ["Elyse Inamine"]}