{"id": "ae867572a4a856e46eb2d46a982e743d", "url": "https://www.bonappetit.com/story/diet-coke-feud", "year": 2020.0, "month": 3.0, "day": 2.0, "content": "You Might Have Everything in Your Pantry to Make Tahini Brownies This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Might Have Everything in Your Pantry to Make Tahini Brownies This WeekendPlus a photo series called “regular-sized people, over-sized food,” and more from the Beggs newsletter.By Alex BeggsMarch 14, 2020FacebookTwitterEmailPhoto by Alex Lau, Styling by Sue LiFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Turn off the radio, make browniesWhen you find out you need to “bring a simple dessert” four hours before a dinner, you make tahini brownies. I chopped up a Tony’s bar (70%), melted it in the microwave with oil and tahini, and then added it to the stand mixer where I’d whipped up eggs and sugar. And because this recipe is coincidentally gluten-free, you toss in some cornstarch and cocoa powder and call it a batter. Dump into pan, add a plop of sweetened tahini, swirl around with a chopstick, and the fudgy, dense, nutty brownies were done in 26 minutes. A huge hit.Want this letter before it hits the website? Sign up for our newsletter!Get the recipe: Gluten-Free Tahini BrowniesRegular-sized people with over-sized foodNever trust a turnip larger than your own head.Photo by Hulton-Deutsch Collection/CORBIS/Corbis via Getty ImagesTake a pitcher, it’ll last longer.Photo by Hulton Archive/Getty ImagesTake a look at that leek.Photo by Reg Speller/Fox Photos/Getty ImagesHuge cabbage.Photo by Hulton-Deutsch Collection/Corbis via Getty ImagesHuge pretzel.Photo by Keystone-France/Gamma-Keystone via Getty ImagesHuge scoop.Photo by George Rinhart/Corbis via Getty ImagesGood lordy, that gourdy.Photo by Fox Photos/Getty ImagesWhen did avocados start shrinking?Photo by Keystone-France/Gamma-Rapho via Getty ImagesI have no idea why this man is so bronzed and oiled but...that’s a big peanut.BettmannUnnecessary food meme of the weekSpeaking of going bigI loved this article on the rise of “maximalist cheese boards,” which have always perplexed me—why the excess? Where’s the room to even slice the cheese?! But Ruby Tandoh “sails the salami rivers,” tries a cheese that “tastes like an old country church,” and finds that people express their love through food in many ways. A platter of cheese just happens to be one of them.Read it at Taste: Who Are These Maximalist Cheese Boards For?Photo by Laura Murray, Styling by Allie WistUnnecessary food feud of the weekThis week, Alex Delany highly recommended his favorite soft beverage: Diet Coke. Gasp! Le horror! The Bon Appétit drinks editor likes a common soda pop?! Our editor in chief likes frozen pizza! A Test Kitchen editor swears by boxed brownie mix! Anyway. People contain multitudes. I used to sit diagonal from Delany and Basically editor Sarah Jampel and we used to cheers our cold cans of Diet Coke like I imagine the knights at the round table did with mead or whatever. Christina Chaey said she’ll drink DC til someone pries it out of her clutches. (bleak, Chaey). Kate Fenologio was once told by a 7-11 employee that she was the reason the soda fountain was always running out of Diet Coke. But others don’t share our passion. Joseph Hernandez and Sasha Levine raised their hands to let me know they’d rather drink [literally anything] than Diet Coke. Emily Schultz is “team reggo coke.” Bryan Fountain is “more of a Fanta guy,” and Hilary Cadigan said it gave her a side effect I can’t print here for propriety’s sake. Carla Lalli Music cracks open a DC once a year: “It’s a very special occasion, the flavor is truly vile—sweet sweet gasoline—but in a wonderfully nostalgic and peaceful way.”Explore Bon AppétitBeggs NewsletterRead MorecultureI’m the Drinks Editor at BA and, Yes, My Favorite Beverage Is Diet CokeBy Alex Delanyculture17 New Hard Drinks the World Isn’t Ready ForBy Alex BeggscultureThere’s an Entire Industry Dedicated to Making Foods Crispy, and It Is WILDBy Alex BeggscultureI Made BA’s Best Banana Bread and It Was Indeed the BestBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-14", "author": ["Condé Nast", "Alex Beggs"]}