{"id": "ae982c8b98ba72eb7a2dd1b09e0c1d46", "url": "https://www.bonappetit.com/story/frozen-granola-scones", "year": 2021.0, "month": 11.0, "day": 1.0, "content": "I Wouldn't Have Survived the Past Four Months Without These Granola Scones | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Wouldn’t Have Survived the Past Four Months Without These SconesI’m writing them into my last will and testament.By Sarah JampelNovember 3, 2021FacebookTwitterEmailPhotographs by Jenny Huang, food styling by Sue Li, prop styling by Sophie StrangioFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.One of the best gifts* my husband and I received after the birth of our baby was a freezer full of food. Friends stocked it with homemade dumplings (two types!), lasagna portioned out into two servings for easy defrosting, packages of the best ramen, jam, tons of muffins and quick bread, and, maybe greatest of all, a bag of Roxana Jullapat’s granola scones. (Upon receiving these presents, I climbed to the roof of our apartment building, my newborn strapped to my back, arched my chest toward the Heavens, and screamed, “HOW DID I GET SO LUCKY?” Mentally, at least.)But back to the scones. The adjective chock-full was invented, I believe, to be applied here: The scones are all goodies—dates, coconut, seeds, nuts—with only the strictly necessary fillers (there’s basically ¼ cup of flour in the entire recipe). Orange zest, something I never would have thought to add on my own, brings a brightness that counters the rich, chewy nutrients.Mother GrainsFind these scones and so much more in Roxana Jullapat’s phenomenal cookbook, Mother Grains.\n$40 at Amazon$37 at BookshopThese scones are certainly more energy than fluff. In those first couple months, I would quite literally stumble out of bed with no concept of time of day or day of week, grab the bag of frozen scones, hack off a piece, and stuff it into my mouth before the baby would start crying. I repeated the process until all of the scones were gone. Eating a piece of scone somehow made me feel slightly more human than shoveling granola straight into my mouth, though the ingredients were not dissimilar. Not once was I patient or prepared enough to defrost, let alone warm up, a scone and not once was I worse for it—they’re good straight from the freezer.Someone in the comments called these scones “rough textured” (but in a good way!). Bumpy is also a good descriptor, with each bite slightly different than the next. To achieve this panoply of texture and flavor, you need a lot of ingredients—like currants and raisins and dates, coconut and flaxseed and pepitas and almonds. Rather than a breakfast you can throw together on a weekday morning, these scones are best made on a weekend afternoon (or when you wake up at 4 a.m. and can’t go back to sleep) and doled out throughout the long, exhausting week. Make them for someone you love who’s in need of an energy boost—even if that person is your future self.*Also, one of the only gifts for me, not that dang baby. Jk jk jk.…I Owe Everything to These Scones:Granola SconesScones full of the textures and flavors of a granola bar—a hint of sweetness comes from copious dried fruit and a sprinkle of raw sugar.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-03", "author": ["Condé Nast", "Sarah Jampel"]}