{"id": "ae9baa37e096128487ffbfdb547eb1f0", "url": "https://www.bonappetit.com/story/turkey-tail-sandwich", "year": 2021.0, "month": 9.0, "day": 5.0, "content": "El Paso's Lonches Juaritos Has a Tail (Yes, Tail) of Two Cities | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Tail (Yes, Tail) of Two CitiesEl Paso and Juárez used to be one place. Today they’re separated by a man-made border—but united by one extremely delicious sandwich.By Roberto José Andrade FrancoSeptember 30, 2021FacebookTwitterEmailAlfredo Alvarez at his El Paso sandwich shop, Lonches JuaritosPhoto by Justin HamelFacebookTwitterEmailAlfredo Alvarez was bored and tired of working at IHOP. It was the type of boredom that comes from being at the same place for nine years. He’d worked there so long he’d even grown tired of the smell of pancakes. “I was a cook. But my goal, always, was to open a business,” he tells me in Spanish. “I wanted to start a lonchería, which you hardly saw here.” Loncherías are Mexican snack shops popular in Juárez, the city where Alvarez was born and where his father-in-law started a shop in 1975. And “here” is El Paso, Juárez’s sister city just across the Rio Grande, where Alvarez now lives.Alvarez’s plan began with saving money. He then asked his son, an engineer, a simple yet vital question: “I told him, ‘You’re good at math, you know more than I do, so how many lonches do I need to sell a day to get the same pay I got at IHOP?’” Whenever Alvarez talks of his college-educated children, there’s pride in his voice. “He told me I had to sell 20. I said, ‘20 lonches a day? That’s not too difficult.’”Eventually, Alvarez had saved enough to buy the frame of a puesto in Juárez. There’s no exact English translation for puesto, but food trailer comes close. “I got the skeleton of it, and I told my manager at IHOP that was it,” Alvarez says. “I gave my two weeks’ notice.”Once he brought the puesto across the border, it took a month to finish building it. It was small, with just enough room for two people. It had a griddle and a mini range hood. Alvarez parked it at the Bronco Swap Meet in El Paso’s lower valley, where vendors sell everything from cowboy boots to Mexican candies and snacks. His sign read “Lonches Juaritos” (Juáritos being a loving term for Juárez). “I sold over 65 lonches that day,” Alvarez recalls. “I went home so happy. And that’s how we started.”Six years later Lonches Juaritos has grown into a small brick-and-mortar restaurant next to the same swap meet where it all began. And today, just as back then, Alvarez's best seller is the lonche de colita de pavo: the turkey tail sandwich.Lunch is served.\nPhoto by Justin HamelWhile Mexican foods like tuétano (bone marrow), barbacoa, menudo, and just about any taco you can think of have grown popular in the United States, colitas de pavo remain associated with the El Paso–Juárez borderland. Perhaps that will change. Smithsonian Magazine says one reason for the food's limited appeal is that they’re the parts of animals—the “beaks and butts”—that consumers from wealthier countries won’t eat. That’s far from true in Juárez, a city that the news organization Norte Digital calls “the world capital of colitas de pavo.” There the sandwiches are “one of the few dishes that can be presumed to be 100 percent local.”“They’re a delicacy,” Alvarez says. Turkey tails are most often fried, roughly shredded, and reddish on the outside, with a succulent interior that looks like the dark meat of chicken. They taste like a combination of chicken and pork, specifically carnitas. Alvarez makes a special seasoning for his colitas de pavo and serves them with mayonnaise, mustard, lettuce, and avocado. He uses bolillo bread—a crunchy crust on the outside but soft on the inside—from a local baker who also moved to El Paso from Juárez.Alfredo Alvarez\nPhoto by Justin Hamel“Some people—as soon as they bite it, as soon as they taste it—tell me the flavor brings back memories of when they could visit home,” Alvarez says. Because of politics, COVID-19, and a variety of other reasons, it’s become more and more difficult to cross between El Paso and Juárez. Even before the pandemic an increased presence of customs and border patrol agents could force people to wait for hours in the hot desert sun. During the pandemic United States authorities limited border crossing to essential travel. The only Juarenses that can cross to El Paso now are those who work, go to school, or seek medical treatment there.The separation has been difficult for this binational community. “There’s a lot of people that still just can’t return,” says Alvarez, whose restaurant is only about a mile from the Rio Grande.Before the Mexican-American War, El Paso and Juárez were one place. El Paso del Norte was its name, and it had a river running through it. After the war that river—in Mexico called the Rio Bravo, in the United States called the Rio Grande—became the natural border between the countries, splitting the community in two. And yet, despite now being in different countries, the cities of El Paso and Juárez still share a history and culture.Most El Pasoans of Mexican heritage have family ties to Juárez. Some even grew up splitting their time between the cities on opposite sides of the river; from Monday through Friday they’d work and go to school in El Paso, then they’d return to Juárez on the weekends. But now that crossing the bridge has become more difficult, several restaurants have popped up on the El Paso side that try to replicate the taste of home.How the tails get cooked\nPhoto by Justin Hamel“A lot of people ask me if my lonches taste the same as the ones in Juárez,” Alvarez says. “I tell them they won’t be the same because it’s very difficult for me to go to Juárez every day to bring back products. There are also products I can’t bring back.” (Because of potential pests and diseases, poultry, fresh fruits, and vegetables are among the things that can’t cross into the United States from Mexico.)“People tell me they’re similar,” Alvarez says of his lonches. “Sometimes they tell me it’s better there, or that it’s better here. But that’s the way it is. That’s what I tell people. We try to copy that Juárez flavor as best we can.”If the flavor isn’t enough to remind patrons of home, the simple decor of Lonches Juaritos surely will. Black-and-white pictures of borderland landmarks and notable residents past and present decorate the walls. Alvarez downloaded, printed, and framed each one himself.Customers eat under Alvarez's photo wall.\nPhoto by Justin HamelI spotted Tin Tan, the Juárez comedian who best symbolizes the borderland's unique merging of cultures—even speaking his own type of Spanglish. There’s a photo of the Juárez Avenue mural honoring Juan Gabriel, the city’s favorite son and one of Mexico’s most influential artists, who often sang about his love of home. There’s a landscape of downtown Juárez, near the international bridge where for decades United States authorities sprayed toxic chemicals on Mexicans who crossed from Juárez to El Paso, claiming they carried disease.Alvarez says people will sometimes stop and stare at the pictures after ordering their food. “They stand there and take photos of those photos. They tell me, ‘It’s because it’s been years since I’ve been to Juárez.’”Explore Bon AppétitCultureTexasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-30", "author": ["Condé Nast", "Roberto José Andrade Franco"]}