{"id": "aea6e7c469d91b4dc8a62366f02777b3", "url": "https://www.bonappetit.com/recipe/slow-cooker-roast-pork-sandwiches", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Slow-Cooker Roast Pork Sandwiches Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSlow-Cooker Roast Pork SandwichesBy Claire SaffitzJanuary 31, 20184.7(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Claire SaffitzEmailPinterestPrintEmailPinterestPrintThis slow-cooker version of the Philly classic has all the makings of a great sandwich: sharp provolone, garlicky broccoli rabe, and lots of jus from the pork for dipping.IngredientsMakes 4Pork3pounds boneless, skinless pork shoulder (Boston butt)¼cup extra-virgin olive oil¼cup red wine vinegar1head of garlic, halved lengthwise through root end3sprigs rosemary2tablespoons honey2teaspoons fennel seeds1teaspoon crushed red pepper flakes1tablespoon kosher salt, plus moreBroccoli Rabe and AssemblyKosher salt2bunches broccoli rabe, woody ends trimmed¼cup extra-virgin olive oil6garlic cloves, thinly sliced½teaspoon crushed red pepper flakes4seeded semolina or hoagie rolls4ounces sharp provolone, thinly sliced1lemon, cut into wedgesSpecial EquipmentA 6-quart slow cookerPreparationPorkStep 1Combine pork, oil, vinegar, garlic, rosemary, honey, fennel, red pepper flakes, 1 Tbsp. salt, and 1 cup water in the  insert of slow cooker. Turn pork several times with tongs to coat and mix ingredients. Slide insert into base, cover, and cook over high heat until pork is very tender and shreds easily, about 4 hours. If programming your slow cooker, set for 4 hours on high, then set to warm after that (while pork is cooking, make the broccoli rabe).Step 2Transfer pork to a medium bowl and let rest until cool enough to handle. Pour cooking liquid through a fine-mesh sieve into a medium saucepan; discard solids. Let liquid settle so fat rises to the top, then pour off and discard all but a thin layer of fat. Bring liquid to a simmer over medium heat and cook, stirring occasionally, until reduced by about a third, 12–18 minutes.Step 3Meanwhile, shred pork with your fingers or 2 forks, discarding any large bits of fat. Season with salt.Step 4Set aside 1 cup cooking juices for serving, then add shredded pork to saucepan with remaining juices and toss to coat and rewarm pork.Step 5Do Ahead: Pork can be cooked 2 days ahead. Shred and add to reduced juices, then let cool, cover, and chill. Reheat over low.Broccoli Rabe and AssemblyStep 6Bring a large pot of salted water to a boil over high heat. Fill a large bowl with ice water and have at the ready. Add broccoli rabe to pot and cook just until stems are tender, about 2 minutes. Using tongs, transfer broccoli rabe to bowl of ice water and agitate to rapidly cool down. Drain and pat dry on paper towels. Transfer to a cutting board and slice into 1\" pieces on the diagonal, all the way from stem to leaves.Step 7Heat oil in a large skillet over medium. Cook garlic and red pepper flakes, stirring often, until garlic is golden around the edges, about 2 minutes. Increase heat to medium-high and add broccoli rabe; season with salt. Cook, tossing constantly, until leafy bits are just starting to crisp slightly, 7–10 minutes.Step 8Divide pork among bottoms of rolls. Top with provolone, shingling slices. Spoon broccoli rabe over, then squeeze lemon wedges over broccoli rabe. Close up sandwiches and cut in half. Serve with reserved juices for dipping.Step 9Do Ahead: Broccoli rabe can be blanched 1 day ahead. Pat dry, cover, and chill.Photo by Chelsie Craig, Styling by Claire SaffitzHow would you rate Slow-Cooker Roast Pork Sandwiches?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI eliminated the fennel b/c I didn't have any and used a bay leaf instead.  Also cooked for additional 2 hrs on low and meat was fantastic!KathyJacksonville FL2/21/2022Another killer recipe from bon apetit. I followed a few tips from previous reviews and only used two sprigs of Rosemary and 1 tsp on fennel. Flavors were absolutely phenomenal and recipe was easy to follow. Will definitely be making this again! Camilla Castaldo Sacramento, CA5/9/2021Made this exactly as written and it was really tasty. When we make this again we'll probably reduce the amount of fennel and flip the pork after a few hours in the slow cooker (the bottom was very juicy and tender but the top was a little drier).tinab623Chicago10/18/2019Does anyone know if I would be able to double the recipe and still fit in a 6 quart slow cooker?AnonymousLos Angeles5/31/2019Would someone explain 'head of garlic, halved lengthwise through root end’? I am thinking crosswise? Put the whole bulb in, peel and all? Thanks\nharmony5Pennsylvania3/3/2019Super easy and delicious. I didn't have rosemary so I omitted it, but otherwise came out perfect and had lots of flavor. AnonymousKansas City2/4/2019This recipe sounded wonderful! The Rosemary was a overkill  Just a hint would have been better. Two hours later and I still taste Rosemary... 1/2 a sprig would work. Did like the Broccoli Rabe though. It would make a nice side...magicman01Vilonia, Arkansas1/24/2019Tweaked the recipe just a bit to cook the pork via pressure cooker. It was sooo good ... blows away cheesesteak. Will definitely make it again.bendemRichmond, Va.9/25/2018This is one of the best sandwiches ever and so easy to make.  We followed the ingredients exactly, but cooked the pork on low for 8 hours.  All of the flavors and textures work so well together.  Bon Appétit wins again.  The whole family was wild about it.  Make this!Anonymous2/10/2018This was awesome. Made for Super Bowl. As a Minnesotan I wish I'd been making tater tot hot dish, but \"it is as it is\" (to use my mother's Minnesotan catchphrase). \nI used a 5 pound pork shoulder. Could have used 1-2 more hours but it was time to eat and it worked. I poured the liquid through a cheap plastic pasta strainer (vacation house) to remove the substantial solids then boiled vigorously for 10 min. Then poured over the pork entirely and let people spoon out more liquid. \nI made Mark Bittman's sauteed peppers and onions instead of the broccoli rabe. \nThis served waaaay more than 4 with sides and stuff. And way better than a Philly cheesesteak and more like what I've eaten when visiting that excellent city.amandaeolsonMinneapolis2/6/2018Explore Bon AppétitSandwichRollsBreadPork ShoulderPorkMeatProvoloneCheeseBroccoli RabeVegetableNut-FreeRoastSlow CookerSuper BowlLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Claire Saffitz"]}