{"id": "aeccd6e3f2cd16881d5ccf9a82d82a05", "url": "https://www.bonappetit.com/story/alison-roman-dating-life", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Alison Roman's Self-Quarantine Dating Life Is One Long Quest for Phone Sex | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusAlison Roman's Self-Quarantine Dating Life Is One Long Quest for Phone SexNo, David, “I made your pasta” is not a pickup line. By Alison RomanApril 30, 2020FacebookTwitterEmailIllustration by Sofie BirkinFacebookTwitterEmailFor the Healthyish Guide to Being Alone, we asked chef and cookbook author Alison Roman to document her dating life, which has gone fully digital since the lockdown.Seven weeks from now, I will have finished a book proposal, decluttered my entire apartment, sent hand-written letters to my friends and family, become the most hydrated woman in New York, met all my deadlines, become a morning person, finally discovered a tricep muscle (on my own arm) and absolutely had phone sex at least once –Me to myself, when quarantine beganIt is now seven weeks later, and I’m pleased to report that some of these plans have worked. My apartment has never looked better, my skin is so hydrated I finally know what “glowing from within” means, and I even enjoy running, a thing I would have tacked slightly above “going to brunch” in a list of things I would enjoy doing. My friendships and family connections are stronger thanks to daily check-ins, and I am busier than ever now that everyone, literally, is cooking at home. Aside from the low-grade anxiety and general ennui, I guess you could say I am flourishing! But my dating life has, um, how do you say: not flourished. In all fairness, this was absolutely true of my pre-quarantine life too, but I save that stuff for my therapist every Wednesday at 10 a.m.But...I did try. When quarantine began, I decided I wanted to be bolder, to be more forward about my desire for personal connections and romance-y things and, yes, to have phone sex, a thing I had not ever done before (I know, I know). The whole world felt new and different, which made me feel like I could be, too.I reached out to the single women I know (there are two of them), asking how they were maintaining their robust dating lives under the new rules of life. They all enthusiastically echoed one another: “So. Much. Swiping.” There was sexting, there were Zoom dates, an onslaught of tasteful and not-as-tasteful nudes peppered with a few choice horny video messages. We were in a golden age of online dating! To hear I wasn’t taking advantage, well, they weren’t mad, just disappointed.In the “before”, I would have said the digital version of courtship was not for me. I prefer to meet people the old fashioned way, on a subway platform where we look up and discover we are reading the same New Yorker article and share a small smile, then one of us gets off before we can exchange numbers and then spend the rest of the movie trying to find each other until we realize we are neighbors and it was you all along!But we were living in a brave new world now, one without the option of human to human contact. And I couldn’t help but wonder: Was I going to be a brave new girl in this brave new world?So I decided to go on “the apps” with a positive attitude and an open mind. I would be vulnerable and confident. I would message first. I would not open with a quarantine joke. I would try (genuinely try!) to meet people, casually date, maybe even build actual intimacy. I would possibly send a nude.Imagine how hot it would be to have all this getting-to-know-you build-up and then finally be able to meet in REAL LIFE?I downloaded the two that felt the least scary: Raya and Hinge. I followed the standard journey of downloading, deleting, and re-downloading. I swiped while I was falling asleep and when I was waking up like it was Instagram, swapping one scrolling addiction for another. I matched and then unmatched. Generally unimpressed with the selection and busier than I thought I’d be with work (it’s called distraction as a way to avoid intimacy, i.e., a defense mechanism! See, therapy does work), I wouldn’t exactly say I was having the golden age experience I was sold.In the event of a match, I’d say there was a 45 percent chance of messaging, and I can confidently say that that 45 percent was the most annoying part of this whole virtual courtship. Opening the app to see if they had messaged me back filled me with a not-so-quiet desperation, and I truly hated this communication purgatory. Luckily, things either fizzled out pretty quickly or they said something so generically annoying that it made me never want to have sex with a man ever again.“How are you holding up?” (NOT WELL, MARC WITH A C!), “I made your pasta” (that is not a pickup line), “If coronavirus doesn’t take you out, can I?” (kill me) and “I had read your byline and based on your reputation as a domestic goddess I had to assume you were a mother of 5, not a hot 30-something” (um, thanks?). I know that you have to message to move to text to move to FaceTime to move to IRL in 9 months, but damn, there’s got to be a better way?There was a date via FaceTime with an Australian where I taught him how to make focaccia. He didn’t have enough flour and absolutely did not listen to my instructions so the focaccia turned out just “okay.” Focaccia failure aside, I think we are better off as friends, which is actually really nice! He still sends me pictures of his baking attempts, it’s very sweet. Grade: B+I had a few late night phone calls. These truly filled me with a giddiness I hadn’t felt since high school when Jason P. from history class and I would talk ~after hours~. The calls lasted anywhere from 90 minutes to four hours, generally with at least an entire bottle of wine consumed in the duration. These phone dates were super fun and it made me wish dating apps were just modern versions of 1-800 numbers (let’s call them….1-900 numbers). I think talking on the phone is a dying art and when it’s done well, is extremely hot. Does that make me sound one million years old? If you get past the initial shock of speaking to a stranger on the phone, this method of communication has the potential to be better than texting—and certainly better than an IRL bad date. Like, sure, sex is good, but have you ever talked on the phone under the covers with the lights off bearing your souls until 3 a.m.? I still did not have phone sex. Grade: A-There were a couple other FaceTimes, usually from bed. They weren’t always necessarily sexy in context, but there is something decidedly intimate about the bedroom FaceTime, a thing I typically only experienced with long-term lovers. It made me feel exposed in a way I didn’t love (we should have had phone calls first), so let’s just say next time I agree to a FaceTime date, I’d better be engaged to that person. Plus, the screen thing reminded me of Zoom meetings, the least horny thing on the planet. Grade: BI had a month-long affair with someone who ghosted on me after about a month of trading Zillow links and incessant texts. Truly a shame since I spent all this time on a slideshow of screenshots of our correspondence to celebrate our one-month anniversary, doubly annoying because I even told my mom about him! WHERE DID YOU GO? Just kidding, I didn’t do any of that, but he did virtually ghost on me, which is, sure, less annoying than the IRL version but honestly inexcusable during a global pandemic. If you read this, please never call me! D-I thought quarantine would be the time when I’d finally be able to chat with a hot stranger at a bar without feeling like I was interviewing for a reality show (Raya is basically a reality show). I wanted to flirt with someone without having to coordinate our schedules to meet at Long Island Bar for a drink (“How about seven Fridays from now?”) but turns out quarantine schedules are almost as annoying to coordinate (“I can’t at 8:30, how’s 10:15?”). I wanted to get to know (like, really get to know!) someone without the expectation or distraction of immediate sex. Imagine how hot it would be to have all this getting-to-know-you build-up and then finally be able to meet in REAL LIFE? Wait, that’s just the premise of that very popular show I could only bring myself to watch one episode of. I knew this felt familiar.Seven weeks later, and what I’ve realized is that it’s a whole new world and also the exact same world. I still hate waking up before 8, I still drink too much wine even when I’m alone (there are so many Zoom hangouts, and wine is so good!), I am still late for almost every deadline (Amanda, I am sorry!) and if you ask my mom, I still don’t call enough. I’m still not that jazzed about the world of online dating, and, again, I still have not had phone sex (I repeat: There has been no phone sex). I still prioritize work over developing personal relationships, am still afraid of rejection, and yeah, “men are trash” is still a thing I have said in a post-quarantine world.But interestingly (or maybe totally uninteresting), I have “met” more people than I ever did in “the before.” Sure, none of them have really panned out, but that’s not always the point of dating—it’s not always about meeting The One, it’s about the journey not the destination, etc etc. (or so I’m told!).To quote my friend Susan, we are all just trying our best. And I will continue to try my best, because if this pandemic has taught me anything, it’s that, yes, I can thrive in isolation, but it sure would be nice to have someone help me eat all these roast chickens. And since we aren’t riding the subway right now and someone keeps stealing my New Yorker, I might as well keep swiping.Explore Bon AppétitHealthyishCoronavirusHealthyish Guide to Being AloneessayRead MoreCoronavirusHawa Hassan Is Feeding Hospital Workers At the Epicenter of COVID-19By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-30", "author": ["Condé Nast", "Alison Roman"]}