{"id": "aecdffdd5c30a2185aee9742d914c0fe", "url": "https://www.bonappetit.com/story/bartlett-house-ghent-new-york", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Julia Roberts and I Fully Endorse the Dreamy Breakfast at Bartlett House | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsJulia Roberts and I Fully Endorse This Dreamy Breakfast Spot The Bartlett House in Ghent, New York, is the perfect place for a long, lazy brunch.By Emma FishmanFebruary 21, 2020FacebookTwitterEmailPhoto Courtesy Bartlett House / Autumn JordanFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.The Hudson Valley in New York has been my escape ever since I was a little kid. (That’s how my family beat the heat in Atlanta.) Now that I live in New York City, where access to upstate is even easier, my obsession has only deepened—especially once I tried the brunch at Bartlett House in Ghent, New York.Filled with wholesomeness, off-duty celebs (apparently Julia Roberts is a regular!), and fresh baked goods, it’s the perfect place to sink into a long, lazy brunch before heading back to the fast pace of the city.  I like to order a luxurious spread: housemade bread served with butter and jam, a maple cortado, and a few dishes to share, like the green shakshuka. Packed with charred kale and topped with feta and a runny egg, it’s my absolute favorite thing on the menu. It also photographs well in the gorgeous space, a 19th-century home brimming with gold accents and beautiful green-stained wood flooring. (Yeah, I’ve been known to place my food on the floor for Instagram.)Once I’m caffeinated and full, I’ll pick up some jams (great gifts!) and grab some goodies from the bakery side of the house for my drive back. I change up my order every time, but I always get the ham and cheese croissant. Instead of having everything hidden inside, the croissant is flattened and topped with a slice of perfectly salty country ham and melted Gruyère cheese. It’s the first of the baked goods to go, which are almost always finished before we get back to the city.If it’s good enough for Julia, it’s good enough for me.Go there: Bartlett HouseExplore Bon AppétitHighly RecommendRestaurantsNew YorkRead MorecultureThis Shop Makes Me Want to Move to Westchester and Subsist on Mushroom Coffee AloneBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-21", "author": ["Condé Nast", "Emma Fishman"]}