{"id": "aed58bbfbbc808d7433a430848954f34", "url": "https://www.bonappetit.com/recipe/spicy-pickled-summer-beans", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Spicy Pickled Summer Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSpicy Pickled Summer BeansBy Lani HallidayAugust 27, 20204.5(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Tami HardemanEmailPinterestPrintEmailPinterestPrintPickling is an ideal way to reap the benefits of summer vegetables long after the season is gone. This punchy brine works with any crunchy veg, but sturdy summer beans (like yellow wax or green beans) will stay snappy and bright for weeks. Eat them on their own or slice them up to add a smack of acidity to salads, sandwiches, and grain bowls. This recipe is part of the 2020 Healthyish Farmers Market Challenge. Get all 8 recipes here.IngredientsMakes 2 quarts1lb. wax or green beans, trimmed1shallot, thinly sliced1–2small chiles (such as Fresno, habanero, or Thai), thinly sliced2cups distilled white vinegar or apple cider vinegar⅔cup sugar2Tbsp. plus 1½ tsp. Diamond Crystal or 1 Tbsp. plus 1½ tsp. Morton kosher saltSpecial equipmentTwo 1-qt. heatproof wide-mouth jars with lidsPreparationStep 1Pack beans, shallot, and 1–2 chiles, depending on your heat preference and the heat of your chiles, in jars, dividing evenly. Bring vinegar, sugar, salt, and 1⅓ cups water to a boil in a small saucepan. Let cool 15 minutes.Step 2Divide brine between jars (vegetables should be submerged) and cover tightly with lids. Chill at least 8 hours before using.Step 3Do ahead: Beans can be pickled 3 months ahead. Keep chilled.How would you rate Spicy Pickled Summer Beans?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleMade this over the weekend. Thought it was fairly easy. I'm now just letting rest in the fridge.Anonymous10/5/2020Never heard of \"Two 1-qt. heatproof wide-mouth jars with lids\" as an ingredient before?Anonymous10/5/2020I love these beans!dandandan2A hole10/5/2020Explore Bon AppétitPickleCondimentGreen BeanVegetableChileFresno ChileSummerEasySideNut-FreeVeganVegetarianDairy-FreeGluten-FreeHealthyishPickle and PreserveDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-27", "author": ["Condé Nast", "Lani Halliday"]}