{"id": "aed9204bfa7056796c3f624a499b615c", "url": "https://www.bonappetit.com/story/rent-week-rice-and-greens", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "This Rent Week Rice and Greens Recipe Is All About the Greens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Rent Week Rice and Greens Recipe Is All About the GreensBalance is nice, but you gotta shake it up sometimes.By Alex DelanyMay 31, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI’ve heard a lot of people say that life is about balance. I’m not exactly sure who set up the original set of scales, but I do generally subscribe to that mentality. I sweat on the basketball court in the morning if I’m going to overdo it at dinner that evening. I spend time reading at night if I’ve spent too much time in front of the screen during the day. I don’t drink on Monday if I had an ambitious Sunday evening. (Read: opened a bottle of wine after making a pre-dinner spritz). I spend my Saturday afternoon and evening by myself if I’ve seen too many people over the course of the week. You can very convincingly make the argument that life is best lived in balance.But sometimes you need to tell balance to go kick rocks. Sometimes balance isn’t the answer. Sometimes you need to open the third bottle of wine. Or lay in bed staring at your phone after staring at your computer for hours. Or hang out with the same person five days in a row. Or eat pasta for three consecutive meals. And sometimes, when you’re making dinner, you need to intentionally mess with the proportions. That’s how you end up with a bowl of rice and bright, tangy greens that’s more like a bowl of bright, tangy greens with a suggestion of rice.This Rent Week recipe is all about ease and flipping the script. It’s a mountain of greens with a bit of rice. And it comes with this New Playlist I made for you (completely free of charge). Smash the play button. Crack your beer, whether it be your first or your fourth. And grab some garlic.Okay: toppings first! Start by thinly slicing 5 cloves of garlic. The thinner you can get your garlic slices the better they will fry. And you want them to fry to the best of their ability, because you’re about to make garlic chips—the crunchy, sweet, savory, topping that takes about five minutes to conjure into this world. Heat enough olive oil to cover the bottom of a skillet over medium heat, and drop the slices in so they’re not clinging to one another. The sliced cloves will take about 30 seconds to develop a golden brown color on one side. Using a slotted spoon push some of the oil on top of the garlic to cook the top and then transfer them from the pan onto a paper towel to dry. You should work in batches, so none of the chips stay in the oil too long and burn.Every garlic chip is special and beautiful, just like you.\nPhoto by Chelsie CraigLet the chips hang out on their paper towel while you start to make a pot of rice; 2 cups of white rice should do it. You might have your own way of doing things, but if you need a rice refresher, we’ve got the recipe for a perfect pot right here. While the rice cooks, you’re going to enter...snare drums roll, cymbals clash, and studio audience oooooooo’s and ahhhhhhh’s…The! Tender! Green! Zooooooooone!!! Confetti bursts in a slightly underwhelming manner.The best thing about tender greens is that it really doesn’t matter what they actually are. What I mean is that when I say tender greens, you can use quite literally any mix of soft greens. Arugula. Parsley. Watercress. Basil. Chives. Dill. Cilantro. Fennel fronds. Broccoli sprouts. Celery leaves. Anything. I am not exaggerating or pulling your leg or making a joke that will come to embarrass you significantly in front of your friends at some point in the future. I am being sincere. You don’t need to go out and buy them. You can use whatever you have in the fridge. Any mix of tender greens will not only do—it will be delicious.Whatever your mix of tender herbs may be, you’ll need about five cups. That seems like a lot, and that’s because it is a lot. Remember what we’re doing? We’re throwing balance the bird. Tear the greens into manageable pieces. Big leaves are fine. This is going to eat like a salad, not a salsa verde.I  went for a mix of parsley, arugula, broccoli sprouts, and chives here.\nPhoto by Chelsie CraigNow, you make a very simple dressing. Mix together ¼ cup rice vinegar, a few pinches of chile flakes, a few pinches of kosher salt, 1 tsp. toasted sesame oil, and the zest and juice of 1 lemon. You’re not looking for an oil-based, emulsified dressing here. This is basically just a tangy sauce that will coat the greens. In a large mixing bowl, toss the tender greens in the sauce so they get coated completely.The other great thing about tender greens is that it really doesn’t take much to cook them. A quick wilt softens them to a point where they’re still texturally substantial, but also easy to eat. After you turn the heat off on your rice, throw your dressed greens into the pot, right on top of the rice as it rests. Cover it with a towel and lid. The residual steam from the rice will wilt the greens. After about ten minutes go by, take the lid off of the pot and stir the greens into the rice. Again, the scale will tip in favor of greens. That’s the ratio you want.So now you have this bowl of warm, fluffy rice and acidic, tangy greens. You know what to do. Hit it with those garlic chips. Get that textural contrast going. Complete the dish. Tip the scales. Or maybe just turn the scale off if it’s digital. And if you’re craving an anchor to all this imbalance happening in the bowl, find it somewhere else. Take a walk. Read a book. Tell your friends you’re busy. But, please, don’t skimp on the garlic chips.Want rice but no greens? Try some crunchy vegetables instead.I Happily Eat This Crunchy Rent Week Veggie Recipe at Least Once a WeekSteamed rice topped with crunchy, gochujang-dressed veggies never leaves the menu.View StoryExplore Bon AppétitBasicallyRent WeekherbRiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-31", "author": ["Condé Nast", "Alex Delany"]}