{"id": "aeda070c8523ff4fcb7e4ab02dbb3a64", "url": "https://www.bonappetit.com/story/office-crush", "year": 2019.0, "month": 10.0, "day": 1.0, "content": "I've Got an (Office) Crush... | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI've Got an (Office) Crush...Career goals and more from Healthyish editor Amanda ShapiroBy Amanda ShapiroOctober 3, 2019FacebookTwitterEmailPhoto by MirrorpixFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This weekend I tasted wine, danced on a rooftop, lounged in multiple parks, and biked my way through this endless summer we’re having in NYC. Then it was Monday, and I was way behind. I hadn’t gone grocery shopping or done my laundry or thought for a second about packing for Portland, where our assistant editor Aliza and I are headed tomorrow for Roux. My Trello to-do lists are crowded with deadlines that I’m not sure I can meet.And yet: I’m happy. Twice this weekend—at the Martha Stoumen wine tasting and in the park—I got asked the same question: “Do you like your job?” And both times the answer came easily, “I love it.” It’s a privilege, and honestly a bit of a miracle, to love your job. I love mine because, on any given day, I might be editing features, planning events, designing merch, testing recipes, scoping out new restaurants and shops, meeting with writers, and working on long-term projects. I often feel more like one of the people in our Entrepreneurs Run the World series than an editor, and most of the time that’s a great thing.We also have a series called Office Crush, and this week’s crush is Katie Rue, who owns Reception Bar on the Lower East Side. Katie’s job is just as all-over-the-place: She spends her days shopping for ingredients at the farmers’ market, going to tea tastings, doing grunt work behind the bar, handling emails, and trying out new recipes. It's further proof that you don’t have to run a start-up to be an entrepreneur.In that spirit, I wanted to introduce a few of my personal office crushes, friends and strangers whose work lives are currently inspiring mine:Rachelle Robinett, founder of Supernatural / old soul / solo travelerAnna Polonsky, founder of Polonsky & Friends / personal style iconAlison Roman, columnist / cookbook author / personal dating-life confidantHawa Hassan, founder of Basbaas Foods / lovely to run into at partiesMennlay Aggrey, “cannabis creative” / cookbook author / IG pen palHallie Applebaum, founder of Future of Women / one of the most #doingthings people I knowAshtin Berry, hospitality activist / host of Conversations With and About White Women on IG LiveBrittny Abad, tattoo artist / person I’m low-key stalking for my next tattooTell me about your office crushes and why you love them: healthyish@condenast.comUntil next week,Amanda ShapiroHealthyish EditorP.S. I highly recommend getting your hands on a bottle of this sparkling zinfandel.Explore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleA Seasonal Mix-UpBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-03", "author": ["Condé Nast", "Amanda Shapiro"]}