{"id": "aeeec74f226f4d9a0eec2407c9ba989d", "url": "https://www.bonappetit.com/story/sustainable-gifts-2021", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "The 13 Best Sustainable Gifts for the Home Cook in Your Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping13 Sustainable Gifts for the Extra-Green Cook in Your LifeHave a climate-conscious Christmas and an eco-friendly New Year.By Chala Tyson Tshitundu and Katja VujicOctober 22, 2021FacebookTwitterEmailPhoto by Yunhee Kim, Prop Styling by Christopher WhiteFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The holidays are all about generosity and goodwill, and what better way to celebrate the season than with sustainable gifts that also give back to the planet? While the impending climate crisis isn’t the cheeriest holiday party conversation starter, the fact of the matter is that Americans annually produce over 25 million tons of extra trash from Thanksgiving to New Year’s. We all have a responsibility to look after our planet, so we’re helping you give the green way with this lineup of 13 waste-saving, tree-planting, eco-friendly gift ideas. For extra credit try popping your presents into reusable tote bags rather than swaddling them in gift wrap and swapping out plastic-coated ribbons for biodegradable cotton string. For stocking stuffers, bundle small items into decorative beeswax food wrap, which can be used again and again in the kitchen in place of plastic wrap. Whatever you decide to do, eco-friendly packaging is only as good as the contents inside—so here are our picks for the best sustainable gifts for an Earth-friendly holiday season:Zwilling Fresh & Save Vacuum Sealer SystemSave your leftovers from an untimely end with this handy vacuum-sealing system. This starter set comes with an adorable mini-vacuum pump, reusable zip bags, and dishwasher-safe storage containers designed to slow spoilage and keep food fresh up to five times longer. Staff writer Alex Beggs even swears it keeps her avocado halves from turning brown. It’s a great gift for every kind of cook, from bread bros who can’t bear to toss another stale sourdough to meal-prepping parents who want Thursday’s apple slices to be just as crisp as they were on Monday.ZWILLING J.A. Henckels,LLCZwilling Fresh & Save$80 at Amazon – 6 Piece Set$125 $100 at Zwilling – 7 Piece SetBamboozle Nesting BowlsThis set of seven bowls has all the benefits of plastic—fun colors, durability, no chance of metallic flavoring—without the planet-destroying downsides. They’re made from upcycled bamboo fibers bound together with 15% melamine (a food-safe organic compound), and they’ll degrade in a landfill in 22 years. The baker in your life won’t want to toss them, though; they’re deeper than the average mixing bowl, which makes for both aesthetic appeal and splash-free whisking.Bamboozle Nesting Bowls$80 at Bon Appétit Market$80 at AmazonXaquixe Tumbler SetThese gorgeous drinking glasses aren’t just green in hue. Each tumbler is hand-blown from 100% recycled materials, and Oaxaca-based glass studio Xaquixe uses renewable energy sources—namely, burnt cooking oil salvaged from local hotels and restaurants—to power up their furnaces, reducing their carbon footprint. Even if you choose to gift them in turquoise, fuchsia, or saffron, these glasses are as green as can be.Xaquixe Bristol Tumblers$50 at Goodee (Set of 2)Vahdam Teas Porcelain TeapotBala Sarda’s family has been in the tea industry for over 80 years, and in addition to producing fresh, potent blends like Early Grey Chai, his company, Vahdam, also makes high-quality tea accessories as pretty as they are functional. Considering that teabags are notoriously non-recyclable, and that nylon ones release microplastics right into your teacup, this pot’s built-in stainless-steel steeping tube will help your loved one with the tea habit make the switch to loose-leaf—which makes better tea in addition to being more sustainable. Vahdam is plastic- and carbon-neutral and invested in the communities where its teas are produced.Gleam Porcelain Teapot$22 at Amazon$35 at VahdamClick & Grow Smart Garden 3Made for aspiring green-thumbs without garden access, this compact countertop planter is fitted with built-in grow lights and a self-watering tank, taking the guesswork out of growing fresh herbs and veggies at home. Watching little leaves of basil and lettuce sprout from their pods makes us feel more connected to the earth, even from our cramped Brooklyn apartments. It’s perfect for keeping single-use plastic clamshells of wilted herbs out of your kitchen and, subsequently, out of our oceans.Photo courtesy of NordstromClick & Grow Smart Garden 3$100 at Nordstrom$100 $75 at Click & GrowVital Choice Vital BoxGive the gift of good eating with this curated box of certified sustainable seafood. Featuring only wild-caught fish processed near the source to reduce emissions, Vital Choice subscription boxes are a great choice for high-quality wild salmon, halibut, and tuna, and more. Each box also includes three seasoning blends and a beautifully light fish broth for spectacular soups and stews. Wild Fish Box$169 at Vital ChoiceJunes Everyday ToteA statement tote is a terrific gift for the friend who’s all about sustainable fashion, and this one is ideal for a day in the park or a trip to the farmers market. She’s got pockets, which means you can safely tuck away a (reusable) water bottle or silicone coffee cup and keep your phone, keys, and wallet easily accessible. Junes’ special Bio-Knit fabric is produced with post-consumer plastic bottles and an innovative material called CiCLO, which makes plastic fibers biodegradable with a little help from naturally occurring microbes.Junes Everyday Tote$36 at Madewell$44 at MaisonetteTyphoon 2.5-Liter Living Compost CaddyDealing with extra food waste from holiday dinners can be stressful, but this cute compost caddy is a good way to keep kitchen scraps out of sight while easing the eco-conscious mind. Fitted with an easy-to-clean removable liner and odor-eating carbon filters, this sleek coated-steel bin is as discreet as it is durable, blending in with most kitchen decor. Just make sure the kids don’t mistake it for the cookie jar!Typhoon Compost Caddy$32 at Bed Bath & BeyondRamona Farms White Tepary BeansIf you’re looking for a low-cost stocking stuffer or a unique gift for all your work friends, the answer is beans. Dried beans reign supreme for experienced chefs, and newbies will get the extra gift of learning how to cook them. Tepary beans have been grown for generations by Indigenous Akimel O’odham and Tohono O’odham people in the Sonoran Desert, and for good reason—they’re extremely drought- and heat-tolerant, which means they’re a low-impact crop able to survive climbing temperatures. Supporting Indigenous land stewardship is one of the best (and most sustainable) ways to spend your money, and on a culinary note, we can confirm that these beans are creamy and delicious, great for everything from a summery bean salad to a warming autumnal chili.Ramona Farms White Tepary Bean$9 at Snuk FoodsVejibag Vegetable Storage BagBefore we tested out Vejibags, we thought reusable produce bags were a slightly splurgy kitchen luxury. However, we’ve upgraded them to kitchen necessity. Never again will your chosen recipient dejectedly compost their slimy or dried-out cilantro! And for us, a head of Boston lettuce—which normally wilts in the fridge within days—stayed nice and crisp even after a week and a half inside the Vejibag, which is made from nontoxic organic cotton that is free of dyes. It’s science, but it feels like magic.Vejibag Vegetable Preservation Bag$23 at HiveFuego Box Hot Sauce CrateAn ideal gift for all the hotties in your life, this reusable wooden gift box is packed with chile peppery goodness: three knockout sauces—bright habanero and carrot, earthy ghost pepper and jalapeño (our favorite), and tangy California reaper and pineapple—plus reaper-infused blossom honey and a ghost pepper and Himalayan pink salt blend. What makes this an eco-friendly gift? Fuego Box has pledged to plant five trees for every crate purchased to cool down the planet while spicing things up.Fuego Box Hot Sauce Gift Crate$60 at Food52Compostable Kitchen Brush SetSociety has advanced past the need for sponges, which harbor so much bacteria that they need to be replaced every other week and can take hundreds of years to decompose. It’s time to ditch those dingy dish sponges and grab this stunning six piece gift set of kitchen brushes from German company Redecker. Beautifully crafted from untreated beechwood with stiff plant fiber bristles, these sturdy compostable brushes are so chic they almost make us want to volunteer for post-dinner dish duty. Almost.Compostable Kitchen Brush Set$54 at GolduneGoodWood Rolling PinsNew Orleans–based design and build firm GoodWood is on track to become entirely zero-waste by 2025. You can read through its many sustainable practices here, but one is that they don’t let a single scrap go to waste. So with the wooden remnants from their large-scale design, fabrication, and furniture products, they produce high-quality, long-lasting home goods like this gorgeous rolling pin, perfect for the pie, biscuit, and sugar-cookie aficionados in your life. Its curved minimalist design is our favorite style for ensuring uniform dough thickness.GoodWood Rolling Pins$35 at Good WoodThink Green:Explore Bon AppétitShoppingSustainableGift GuidesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-22", "author": ["Condé Nast", "Chala Tyson Tshitundu", "Katja Vujic"]}