{"id": "aef9fa5f513ef184c712c933cfabd0a4", "url": "https://www.bonappetit.com/story/ny-shuk-matbucha", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "When Fresh Tomatoes Aren’t in Season, I Reach for Matbucha | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWhen Fresh Tomatoes Aren’t in Season, I Reach for MatbuchaThis Moroccan “cooked salad” of tomatoes, garlic, and peppers keeps me going all winter long.By Hetty McKinnonDecember 21, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I often declare that I love living “all the seasons” to justify why I choose to live in New York rather than my temperate hometown of Sydney, Australia. But come the dead of winter, I am eating my words along with too many starchy root vegetables. The sheer dearth of variety in fresh produce leaves my appetite begging for something other than stodgy soups and rich stews. At one point during the winter I will surely succumb to supermarket tomatoes because, despite their flavor being numbed by weeks in cold storage, they still offer a fruity jolt to my taste buds.But this year I’ve found salvation. New York Shuk, which makes Middle Eastern pantry staples like harissa and preserved lemon paste, recently released two varieties of matbucha (pronounced mat-boo-ha)—the Signature Matbucha, which has some heat, and the Matbucha With Olives and Mint. The first time I tasted it, I was transported. I was seven years old in my mother’s kitchen, taking bites out of a whole tomato, seedy juices running down my arm; I was overlooking the pebbly shores of Positano, gorging on fruity tomatoes topped with oozy mozzarella; I was sitting on a bougainvillea-covered terrace in Kaş, Turkey, wrapping up silky eggplant and syrupy tomatoes with flatbread. I had found my summer, in a jar.New York Shuk Matbucha$13 at Snuk Foods$13 $9 at Jayson HomeNew York Shuk describes matbucha as “an everyday tomato condiment” made with tomatoes, garlic, oil, and chile pepper. The other crucial ingredient is time. According to New York Shuk cofounder Leetal Arazi, it is simmered “anywhere between two to 10 hours,” which allows the ingredients to transform into a luscious, deeply concentrated and intensely flavored “cooked salad.”Leetal and her husband, Ron Arazi, also her partner in the business, say that while matbucha is traditionally eaten with challah as part of the Moroccan Jewish mezze table, they envision it as an essential weeknight hero in the United States. “In our family,” Leetal says, “we use it as a base for shakshuka or to simmer vegetables, chicken, or Halloumi. We use it as a condiment for sandwiches, spreading it on challah with warm chicken schnitzel and pickles, or with roasted eggplant, slices of hard-boiled egg, tahini and herbs.”New York Shuk Matbucha with Olives and Mint$13 $9 at Jayson Home$13 at New York ShukBack in my kitchen, I’ve been venturing even further afield with matbucha. I’ve used the signature blend as the base for my Chinese tomato and egg dish, forgoing fresh tomatoes for the ready-made tanginess from the jar. I’ve tossed in chopped cilantro to make an intense salsa-roja-inspired base for chilaquiles. I’ve added black olives, capers, and parsley for a fiery arrabbiata pasta sauce. Brothy gigante beans have gotten the matbucha treatment, as have Lebanese-style green beans, finished off with a hint of allspice and cinnamon.With these kitchen adventures, I realize that matbucha gives me exactly what I’ve been looking for during the depths of winter. Despite being a slow-cooked condiment, matbucha retains a breezy vine-ripened sweetness and tangy fruitiness that makes it feel like you are tasting summer at its peak. And while I do love all the seasons, summer is my favorite. Don’t tell the others.Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-21", "author": ["Condé Nast", "Hetty Mckinnon"]}