{"id": "aef9cbfc5cfa2d4ee2ef201db06c4f8a", "url": "https://www.bonappetit.com/story/ranking-grocery-store-cucumbers", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "A Definitive Ranking of Grocery Store Cucumbers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Definitive Ranking of Grocery Store CucumbersYes, there are different kinds of cucumbers, and yes, some are better than others.By Alex DelanyApril 5, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Judy Mancini.FacebookTwitterEmailCucumbers are the most refreshing vegetable there ever was or will be. That’s a fact. Cucumbers keep a little plaque hanging on the wall of their foyer. “Most Refreshing” it says. They’re proud of it. It’s adorable.But there are different kinds of cucumbers, and some certainly pull more weight than others. The juicy, crispy, delicately flavored fruit—yes, it’s a fruit—is really good when it’s good. And really bad when it’s bad. And while there are countless varieties of cucumbers out there, there are only a few types that you’re likely to come across on your next shopping run, and you need to know what you’re looking for when “CUKES” ends up scribbled on your grocery list. Here’s a little breakdown of the cucumbers you’ll most likely find at the grocery store, ranked from most to least delicious:Persian cucumbers are BAE.\nPersianWe put Persian cucumbers first; it’s kind of hard not to. They are our favorite, perfect in just about every way. Yes, they’re called Persian cucumbers, but they’re being cultivated across the world at this point, and nowadays you’ll find them in most supermarkets, often packed five or six to a little tray. These short, narrow cukes are perfect for slicing into spears for a crunchy snack, smashing for salads, or slicing thinly and massaging with salt and vinegar for some quick pickles. And while their (adorable) size is a big draw, their flavor is what makes them a crisper drawer-constant for us. They’re denser than other varieties, with almost no watery seeds to speak of, and their flavor is fresh and concentrated. Never slimy, never watery, never bitter. Love.Mmmm...pickles.\nEva KolenkoKirbyOh, you like pickles? Then you also like kirby cucumbers. These cukes are the most widely-pickled variety of cucumbers. They’re short like Persians but a little fatter, with bumpy skin and a dense interior that can hold up up to an assertive brine—big crunch, big flavor, convenient package. These are slightly more seasonal than the other cukes on this list—you’re most likely to see these at the store in the summertime—but when you see them, buy them. Follow our dear friend Brad Leone’s lead: Make some half-sour pickles, fix yourself a ham sandwich, and go to town.Pip, pip, cheerio!\nEnglishAlso sometimes called \"hot house cucumbers,\" these are your most reliable option when Persian and kirby cukes are nowhere to be found. You'll see them in almost every grocery store, usually individually shrink-wrapped, and while they're not as big on flavor as our other favorites, they're a hell of a lot crunchier and tastier than the dreaded pole cucumber. (More on that in a second.) While they're often technically seedless, they do have a fair amount of watery business at their core; to mitigate this, we sometimes will slice them in half lengthwise and use a spoon to gently scrape out the center, leaving us with two little cuke canoes, before doing whatever it was that we were going to do with them. Fun!BE GONE!\nPoleIt is certainly not our pleasure to introduce you to our arch nemesis. The pole cucumber is the thorn in the side of the cucumber’s otherwise sterling reputation. These are waxy, basic-ass cukes you see at the grocery store just about any time of year, usually somehow both dark green and weirdly yellow. They’re super bitter, thick-skinned, exceptionally watery, seedy, and usually have a coating of literal wax, as if the thick skin wasn’t already bad enough. If you’ve had a bad experience with a cucumber, we’d be willing to bet it was with a Pole cucumber. And we’re sorry. Avoid these dudes at all cost.From left to right: English, Persian, and pole cucumbers.\nIt’s important to remember that cucumbers do have a season. Even though they’re available year-round, cucumbers taste the best in the summer, when you see them at the farmers market. The subtle sweetness and herbal notes shine, cluing you into the fact cucumbers are indeed a fruit—hell, a good one kinda tastes like a melon. If you see cucumbers at your farmers market, buy them. They’re 100% worth it. But the best thing about a good cucumber is that you can just grab one and bite into it. If you have a dip, go for it, but a prime cuke is all you really need. You’re in the privacy of your home. No one’s judging.Cuke salad, comin' in...cold:How to Make Cucumber Salad Without a Knife, or a Recipe For That MatterSeriously: No sharp objects necessary. Your life is about to get a lot crunchier.View StoryExplore Bon AppétitCucumberBasicallyIngredientsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-05", "author": ["Condé Nast", "Alex Delany"]}