{"id": "aefa50d70304b00b7459cc55dd5b1ebe", "url": "https://www.bonappetit.com/story/hugos-burger-joint-fayetteville", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Best Waitressing Gig I Ever Had Was Serving Burgers at Hugo’s in Fayetteville, Arkansas | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Best Waitressing Gig I Ever Had Was Serving Burgers in Fayetteville, ArkansasSomeone either brought you to Hugo’s, or you’d been coming there your whole life.By Kathleen AlcottJune 6, 2018FacebookTwitterEmailPhoto by Mark JacksonFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.My last job in food service, strangely enough, was the only one I ever imagined keeping. During a fairly mysterious point in my early 20s, I had run away from San Francisco to Fayetteville, Arkansas, where I scored what I was told was one of the best serving gigs to be had, on the town’s old square, at a basement burger joint called Hugo’s.Four days a week I floated down the concrete stairs, past the only window, into a wide room that still smelled of the inky ribbons that had once been sold there. A cursive neon sign—Typewriters—was the only one on the wall, and this said something important about the place: No one who came there, to gorge on one of the 20-odd burgers and sandwiches available, needed to be told where they were. Someone had brought you, or you had been coming your whole life. There was almost no foot traffic, and the rare person who made his way down by accident always had the strange look on his face of someone lying about having fallen asleep.It was always five degrees cooler in Hugo’s—in “The Basement,” as the people who’d worked there a decade called it—and somehow the aesthetic of the place matched the relief of its temperature, the muted jewel tones of nubbly plastic cups in which I filled and refilled sweet tea, the plain paper tablecloths I replaced when a table turned over.The sign that never left.\nPhoto by Mark JacksonThe people who trained me were something I could not imagine waiters in San Francisco to be: happy. Zack W., who was always referred to by his first and last names, was famous in the town and just as much so in the restaurant, where he carried six plates at a time with the kind of casual determination as the most gifted of surfers. When a wave of customers came, as they always did—people were devoted to the Bleu Moon Burger, served with a side of potato chips, and the Catfish Po’ Boy—he walked right into them, grinning. In his off-hours he played music at one of the nearby venues or read, widely and ambitiously, and he treated this like a job too, completing a different author’s body of work each month. Deep into his 30s, he had never really left Fayetteville, where he’d been raised, though he’d meant to. He’d never gone to college, and he was and still might be the most educated person I’ve ever met, dedicated, in the way of the truly brilliant, to the project of changing his own mind. If his intellect made him stand out, his general fulfillment there did not; almost everyone else I worked with was kind, and generous, and glad to be receiving the ample tips they were from the customers who knew them.A burger with a side of chips and a side of fries.\nPhoto by Mark JacksonRegulars, in other restaurants where I had worked, could be fussy and bitter with new hires, rolling their eyes at the delay of having to speak their order. But at Hugo’s, my wobbly pen, pulled from my brand-new red apron, was almost always met with a phrase that summed up the general feeling of the place: Preciate ya, which was always accompanied with a wink, and which was sometimes, to Zack’s chagrin, shortened to Preesh.The clientele were various: Lucinda Williams; professors from the nearby university; and the men who frequented a pool hall not far away, which only began to admit women in the ’70s and where meth, in the bathrooms, was a problem. This was the dawn of Obama’s first term. He was the first president I’d ever voted for, and it was easy for me to lazily imagine that Hugo’s, despite its location in a red state, was the sort of place that embodied all that was, in the naive parlance of the time, post-racial, postfeminist, post-classist. If I didn’t think everyone voted the way I had, I probably believed that any opposing viewpoints that might have found expression there, where it was never bright and always cool—that those on opposite sides of the table would have ultimately found respect for the other.The catfish po’ boy.\nPhoto by Mark JacksonI’ve thought of Hugo’s a few times since the inauguration of Donald Trump and of Zack, who I heard finally did make his move to the Pacific Northwest. I wonder whether a fight’s broke out, under the neon sign that never turned off, about the teenagers who vandalized a mosque in nearby Fort Smith, about the president’s affair with a porn star. When the basement sold typewriters, I imagine it was home to many passing ideas, the beginnings pressed onto the pages threaded into the display models. I’d like to think it’s still a place where a worthy conversation might begin, and even if I can’t confirm this fantasy, I appreciate it.Kathleen Alcott is the author of Infinite Home.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Kathleen Alcott"]}