{"id": "aeff07eb4c1efa36e6548bf9c92cae4e", "url": "https://www.bonappetit.com/story/pistachio-paste-luxury", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "Pistachio Paste Is a Little Pantry Luxury | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePistachio Paste Is a Little Pantry LuxuryDrizzle it on toast, gift it to unsuspecting strangers, or keep a secret stash for you and you only.By Alex BeggsJune 8, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.What’s green and runny and $24 a jar? Pistachio paste! But if you can think of anything else, I’m all ears.I recently impulse-purchased a jar of Pistacchiosa, an Italian pistachio paste, at Zingerman’s in Ann Arbor, Michigan, my own personal Temptation Island on USA Network. Technically, it’s a pistachio cream, probably to denote that it has olive oil added to it to give it that silky-smooth texture. Pistacchiosa is made from Sicilian pistachios, which are grown on volcanic soil and supposedly have a mind-blowingly sweet and “richly concentrated flavor” compared to Turkish, Iranian, or California nuts. To me it’s the deep nuttiness and just-sweet-enough flavor that has me hiding it in the basement for personal use only. This morning I dabbed some on a buttered biscuit. A little luxury.Photo by Isa Zapata, Food Styling by Micah MortonSicilian Pistachio Spread$20 at Amazon$24 at Zingerman'sYou’ll find that no two pistachio pastes are alike. Some might contain pistachios, sugar, and milk powder, others might rely on almond extract for flavor, and some are actually pistachio butter made from 100% pistachio—but they’re all expensive. Some are sweetened and some are not; pistachio butter is usually unsweetened. (I’ve found that when baking recipes call for pistachio paste, it indicates the sweetened version, like almond paste. You can always add the pistachio paste, taste your batter, and then add in more sugar/honey if needed.)Pistacchiosa is my favorite not only because it has the best name, but also because it has an almost savory note from the quality olive oil. It doesn’t contain ingredients like milk powder or almond extract that would mute the pistachio flavor, and the added oil gives it a sensuous, silky texture. It drizzles off the spoon’s edge in mossy green ribbons.Other good options: This is the sweetened pistachio paste that Claire Saffitz has stashed for her Gourmet Makes Ben & Jerry’s ice cream, and then there’s always this smaller jar from Eataly, or if you want to go forth and make your own, there’s my baking queen Stella Parks’s recipe (not today, Stella!). If you have a Middle Eastern market near you, seek out Turkish pistachio paste, or sample what’s on Etsy to taste the difference.What to do with your jar of Pistacchiosa:Most people seem to be buying pistachio paste to mix with buttercream for macarons. You could do that!Speaking of buttercream, you can mix pistachio paste into your favorite frosting recipe to top your next birthday cake.Mix ½ cup of pistachio paste with 4 tablespoons of unsalted butter to make a pistachio frangipane and fill thumbprint cookies with it, or stuff cupcakes with it, or spread it underneath a pile of raspberries and strawberries in a galette. (Wow!!!)In the Bouchon Bakery cookbook, there’s a recipe for pistachio madeleines that uses pistachio paste, oh là là.Either make your own pistachio ice cream or follow my Aunt Barb’s lead and buy a pint of your favorite vanilla, let it warm up on the counter for 20 minutes, and then swirl pistachio paste into it with all your upper body strength.Mix a quarter cup or so into whipped cream, serve with berries. (Note: When I did this, it was best on day one; the oil seemed to make the whipped cream pool a little on day two.)...or use that pistachio whipped cream to fill cream puffs!Adorn pancakes.Decorate sugar cookies.Milkshake.Re-create Starbucks’s pistachio latte by blending it with your milk-of-choice before steaming.Make oatmeal more exciting!Pistachio breakfast buns with pistachios THREE WAYS.Spread it like a glaze on a warm-from-the-oven olive oil cake or lemon pound cake. I don’t recommend adding it to cake batter because you’d need almost the entire jar to flavor the cake, and this stuff is too expensive for that. Spread it on top of a slice of cake or a warm biscuit to really let it shine.Or sure, go ahead, use the whole jar and make this stunning pistachio cake with raspberry cream.There’s always toast.I could go on, but at this point I’ve nearly finished off the jar, and I know exactly how I’m going to empty it. With a spoon.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-08", "author": ["Condé Nast", "Alex Beggs"]}