{"id": "af0088ab6b3e55f4bee04555026bb7fd", "url": "https://www.bonappetit.com/story/harlem-of-the-west-fillmore", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Harlem of the West: What’s to Become of The Fillmore? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Harlem of the West: What’s to Become of The Fillmore?My wish for the Fillmore in light of its heartbreaking history and uncertain future? For all places to put as much craft into our community as go into their cocktails.By Shakirah SimleyJune 6, 2018FacebookTwitterEmailPhoto by Krissy T. HartFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Walking north from McAllister Street, I am enveloped by the Fillmore I think I know. I wave to Martine in the window of her African braiding shop (a haircare rarity in San Francisco these days) and give a nod to the dope boys posted up on the corner blasting old-school Too $hort. It is freezing outside. The typical late afternoon fog has moved across the city and settled over my hood, with its low-slung housing projects signaling utilitarian grandeur at best, just around the corner from meticulously Painted Ladies.I arrive at my destination, hoping for a whiskey warm-up: 1300 on Fillmore, one of the last African-American-owned restaurants on the corridor. Lauded for its gospel brunches and soulful, swanky vibe, it was the place to hobnob with community leaders and attend fund-raisers for neighborhood causes. 1300 often played host to summer programs for local kids eating out at a restaurant for the first time. For me, it was a place to see other diners who looked like me.I reach for the door—it’s locked. “What the….” The silvery curtains are unceremoniously drawn, and my eyes drift to a letter taped to the front window by the owners, Monetta and David. “After 10 great years, 1300 on Fillmore….” A familiar resentful and resigned pang churns with my hunger. Closed.“We love San Francisco and 1300 was our gift to the city, it was created out of the love we have for the city and our community…”Somehow, it feels a bit colder outside.PHOTO BY SHAKIRAH SIMLEY“I see you. You’re still here”I adore my neighborhood. The Fillmore is a part of the Western Addition district, one of the last slices of black life in San Francisco. This community values neighborly chats and sidewalk smiles. Breaking news is shared in a salon chair over a shampoo and twist-out or over a $1 cup of hella Robusta coffee and an actual newspaper. Elders will ask you to help carry their groceries from the Safeway (really, a test of your home training because you will carry those bags). A friendly “Good morning, queen” or “I like your hair!” seems to break through humanity hardened by city life, to say affirmatively: I see you. You’re still here.Being an African-American living in San Francisco is a precarious condition. Living in the Fillmore district is particularly so. In the spring of 1963, James Baldwin, chronicled in the fiery documentary Take This Hammer, surmised on the lives of black residents in a city known for its progressive values. “There is no moral distance...between the facts of life in San Francisco and the facts of life in Birmingham. Someone’s got to tell it like it is. And that’s where it’s at.”This is what it was, and in many ways, still is.In its heyday, the Fillmore was the black cultural zeitgeist of California, christened by the diaspora as the “Harlem of the West.” African-Americans, seeking shipyard jobs on the SF shoreline and bound geographically by racial covenants that limited housing and business opportunities, gave life to the Fillmore’s thriving jazz, arts, and literary scene. This is where, according to Elizabeth Pepin and Lewis Watts in their photo history project Harlem of the West, luminaries such as Billie Holiday, Charles Mingus, Dizzy Gillespie, Charlie Parker, and John Coltrane frequented renowned nightclubs like Elsie’s Breakfast Club and the Booker T. Washington Hotel Lounge. Fillmore was where Maya Angelou worked as a streetcar conductor and received inspiration for the seminal I Know Why the Caged Bird Sings. It was also the place where the self-determination of community allowed black folks to open their own butcher shops; sling stiff cocktails that fueled jam sessions till the wee hours; run counter spots that served fried fish sandwiches; and operate grocery stores that sold ingredients like grits, yams, and mustard greens for a taste of home down South.Eventually, these vital black-owned restaurants and bars would go up against a more insidious last call: postwar urban renewal projects that targeted low-income, nonwhite neighborhoods and spanned nearly 50 years in the Western Addition. In 1947, the San Francisco Redevelopment Agency (SFRA) gobbled up hundreds of city blocks and homes and displaced thousands of mostly black residents. From 1953 to 1970, during the height of redevelopment, black businesses including diners, cafeterias, bakeries, bars, hotels, and music venues were either evicted or demolished. The purpose? To redevelop depressed areas and bring “the beauty and restfulness of the suburbs, combined with all of the advantages of the City.” The aura of the white picket fence defined the San Francisco of “tomorrow,” and black meant blight.Neighborhood activists rose up in the face of disruption. In the spring of 1969, the Black Panther Party established its Free Breakfast Program for local youth at Sacred Heart parish church at the corner of Fell and Fillmore. Over hot plates of grits, eggs, bread, and bacon, the members not only delivered their radical anti-hunger politik but also inspired community members, young and old, to mobilize. Homegrown groups such as the Western Addition Community Organization successfully fought the city agency in 1975 to stymie the demolition and provide support for the displaced renters. However, acres of vacant land languished for years. Rebuilding occurred at a painful pace, with former residents unable to afford new homes, rampant redlining by banks, and businesses left incapable of bouncing back. Market-rate towers and townhomes replaced Victorians and affordable housing.When the redevelopment agency finally closed up shop in 2008, the damage amounted to 4,729 households displaced, 2,500 Victorian homes destroyed, and 883 businesses shut down. The legacy of this upheaval has had devastating impacts. Fred Blackwell, then executive director of the SFRA, said, “The agency’s time here has not been a happy story. There is no way to make up for clearing large swaths of land and displacing thousands of people.”The cultural loss is incalculable and deeply felt by my neighbors. Local club owner Agonafer Shiferaw penned a heartfelt letter to former San Francisco Mayor Ed Lee, in response to the city’s ill-fated attempt at a Fillmore Jazz Preservation District and the closure of his popular Rasselas Jazz Club at 1534 Fillmore after 28 years in business: “I am nonetheless saddened that the visionary promise of a revitalized, thriving, African American commercial presence along Fillmore Street with a jazz ambience is fading, and fading fast. At present, there are just a few African American enterprises along Fillmore Street. I urge you, Mr. Mayor, to...initiate a re-visit of the originating ideas that launched the Jazz Preservation District concept to determine what can be done to salvage this noble endeavor.”“The spirit of Harlem of the West still flickers”The Fillmore is still changing. Gentrification in San Francisco is on the minds and lips of everyone, from residents to politicians, activists to developers, business owners to bloggers. While neighborhood hubs such as the African American Art & Culture Complex manage to thrive and attract new talent, the vibrancy of the black food scene wanes as softly as the newly ubiquitous Edison bulbs that abet its demise.This fraught history and current real estate market trends ushered in a marked difference in the types (and color) of restaurant ownership, cuisine, and clientele in the Fillmore. Most food folks know my neighborhood because of its excellent culinary pedigree via State Bird Provisions (Bon Appétit’s Best New Restaurant in 2012) and its sister restaurant, The Progress, as well as heavyweights such as SPQR, Octavia, Spruce, and Atelier Crenn. While the critical acclaim is necessary for a thriving community, it’s hard not to remember what could have been and what has been lost.There are a handful that remain. The spirit of Harlem of the West still flickers. My wish for my neighborhood in light of its heartbreaking history and uncertain future? For all places to put as much craft into our community as go into their cocktails. Here are a few restaurants doing just that:During Throw Back Thursdays, prices reflect the original 1977 menu.\nPhoto by Krissy T. HartTwo Jack’s Nik’s Place (401 Haight St.): In 2006, second-generation owner and former after-school educator Nikki Cooper took over her family business, which has served Southern comfort food at the corner of Haight and Webster for 41 years. After two renovations and inspired by a deeply loyal following, Cooper was awarded a San Francisco Legacy Business designation in 2016, ensuring a viable lease and historical street cred in a brutal commercial real estate market. During Throw Back Thursdays, prices reflect the original 1977 menu—$2 beers and the Cap Snapburger (cornmeal-crusted snapper slathered in mayo and melted American cheese on a soft seeded bun) is the way to go.Live music and injera await at Sheba Piano Lounge\nPhoto by Krissy T. HartSheba Piano Lounge (1419 Fillmore St.): Part cozy jazz haven, part Ethiopian restaurant, this lounge is as treasured by locals as the famed jewels of its namesake queen. Sister-owners Netsanet “Net” and Israel Alemayehu run the show; both newcomers and regulars are oft greeted with hugs. My not-so-inner lush loves the unpretentious split of Prosecco that always accompanies my champagne cocktail with Abyssinian bitters. Unlike its clubby neighbors, Sheba’s nightly live music requires no cover or drink minimums. Every year, chef Alemtu Gimariam stocks up on spices on trips back from Addis Ababa; her house-made injera paired with tibs wat (cardamom-scented sirloin simmered in berbere sauce with clarified butter) is the truth. A key spot for the neighborhood holiday toy drive and a cohost to the yearly Mardi Gras festival.The bar was inspired by a former owner’s wartime experiences in Tunisia.\nPhoto by Krissy T. HartClub Waziema (543 Divisadero St.): A beloved weeknight watering hole of local folks tucking in for a post-shift whiskey. If the 60-year-old ruby wallpaper embellished with gold paisley could speak, it would lavish us with stories of performances by Tina Turner, James Brown, Billie Holiday, B.B. King, and Marvin Gaye. The bar was inspired by a former owner’s wartime experiences in Tunisia and was originally dubbed Club Morocco. After laying empty for almost 20 years, current owners Nebiat Tesfazgi and her husband Giday Beshue restored a dream deferred—a renovated club with Ethiopian fare and soulful sessions. With a hesitant blessing (the former owners did not want to sell) and box of original jazz recordings, Club Waziema opened in 1999, serving as one the few very bars for Divis denizens. Hearty specialities such as stewed collard greens in peppery lentil sauce are a welcome reprieve from blustery SF evenings—and the hospitality will make you feel much warmer.Peacock Lounge & Gold Room (552 Haight St.): The almost 60-year-old Peacock Lounge is an elusive gem in the lower Haight. Located below the Unity Masonic Hall, it's accessible only via an invite or private party; its main purpose is a social space for the San Francisco–based Black Masons. Still, the Hall, as it’s affectionately known by its members, occasionally serves as an open community space for gatherings, conversation, or action, like benefits for local victims of devastating house fires or a neighborly Christmas party. With much of black life in SF disappearing, it’s a safe haven for a generation still resisting gentrification.Shakirah Simley is a writer, educator and community organizer who lives in San Francisco.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsSan FranciscoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Shakirah Simley"]}