{"id": "af18c05c23750203c932cc6ad60c75bf", "url": "https://www.bonappetit.com/story/dairy-free-ice-cream-mcconnells", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "McConnell's Dairy Free Ice Cream Is the Real Deal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleOur Favorite Ice Cream Brand Just Dropped a Dairy-Free LineIt's ice cream season—do you know where your pint is?By Aliza AbarbanelJune 8, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailIce cream has gone through a lot lately. For decades, everyone's favorite childhood bribe remained a humble mix of cream, milk, sugar, and eggs. Now, it's been transformed by the likes of Halo Top, and dairy free ice cream is being blended from bananas, and even made from tofu. This summer, we're cooling off with a brand new—and very delicious—option.McConnell’s Fine Ice Creams has been making exquisitely flavored ice cream in the hills of Santa Barbara, CA for over 70 years, using milk from their own grass-fed dairy and mix-ins from their own on-site kitchen. This hyper-controlled production process yields nuanced flavors and an army of fans—Bon Appétit editor in chief Adam Rapoport has even been known to buy their mint chocolate chip in bulk. So, when their recently released vegan line began shipping nationwide, we had to get our spoons in some pints and see exactly what happens when a dairy goes dairy-free.A scoop of McConnell's dairy-free Turkish coffee ice cream.\nPhoto by Chelsie CraigWell, for starters, they don’t exactly follow the vegan status quo. Many plant-based ice creams—including BA's own recipe— use a nut milk or coconut cream base to create a meltingly creamy scoop. In contrast, McConnell’s spent a year developing a decidedly different base: pea protein. Their proprietary blend of micronized pea protein is higher in protein than nut milk and has a neutral taste, which is ideal for layering flavors without that distinctive coconut cream aftertaste.“It was of paramount importance that we produce something where our customers, who really wanted the McConnells experience, didn’t have to settle,” says Michael Palmer, McConnell's owner and CEO. “You can have great flavor, texture, and mouthfeel in a product that also doesn’t have to taste of coconut or roasted nuts.”Some pea-protein products have an unpleasantly chalky texture, but this ice cream is rich enough to mask any grit. I especially liked the dairy-free Eureka Lemon & Marionberries, which is tart, tangy, and rippled with slightly sweet jammy blackberry preserves. Despite Palmer’s professed aversion to coconut-based ice cream, the Toasted Coconut Almond Chip was another standout, pairing a true coconut flavor with shards of almonds and chocolate to create balanced, nutty layers of flavor and texture.Perhaps most importantly, these dairy-free pints are creamy and smooth—a vegan version of McConnell’s classics that pretty much taste like the real deal. As an unapologetic dairy lover who also occasionally nibbles nut cheese, I plan on stashing a pint in my freezer for ice cream emergencies. It’s summer: these things happen.Explore Bon AppétitHealthyishHealthy DessertsIce CreamVeganSummer DessertsTrendsRead MoreWhere to eatThe Ice Cream That's Plant-Based and Proud Of ItBy Rachelle RobinettRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Aliza Abarbanel"]}