{"id": "af1ac81e54bb22d186679d808472e179", "url": "https://www.bonappetit.com/story/secret-affair-chinese-takeout", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "My Secret Affair With Chinese Takeout | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy Secret Affair With Chinese TakeoutAfter two decades of sneak-eating chicken in garlic sauce to avoid my father’s wrath, I’m no longer hiding my love—or the reasons why it’s so complicated.By Jenny LiaoMarch 30, 2021FacebookTwitterEmailIllustration by Sarula BaoFacebookTwitterEmailThere are few things more irresistible than the forbidden. My contraband: an unassuming chicken in garlic sauce served at Chinatown Restaurant, a modest Chinese takeout counter near my childhood home in Brooklyn. The first time I encountered this dish, I was 10 years old. My older brother came home touting a plastic bag printed with a signature yellow smiley face, the words THANK YOU emblazoned across the front. Entranced by the savory aroma filling the air, I followed him into the kitchen.My brother untied the bag and opened an oyster pail, revealing thinly sliced chicken breast, velveted to tender perfection and bathed in a thick amber sauce. My mouth watered as he poured the contents onto a plate. “You need a little bit of everything for the perfect bite,” he advised. I watched closely as he scooped sauce-soaked jasmine rice onto his fork, topping the mound with morsels of chicken and broccoli. Careful not to spill, I closed my eyes, inhaling deeply as I chewed. The chicken had a silkiness I’d never experienced before. The broccoli—a vegetable I usually avoided at all costs—had a crispness that complemented the chicken so well, I couldn’t imagine eating it any other way again. Then there was the sauce: intoxicating, garlicky, not too sweet, not too salty, balanced just right. I wanted to drink it up. A warmth washed over my body. It was official: Chicken in garlic sauce was the most delicious food that ever existed.My brother and I were relishing bite after bite when our father walked into the kitchen. He took one look at what we were eating, grabbed our plates, and tossed them into the trash. The table rattled, and his face flushed with rage. “Don’t eat this garbage,” he shouted. “It’s not clean or healthy.” My father was a man of few words; he rarely raised his voice, but when he did, I knew to listen. The whole moment confused me. Somehow, my brother and I had unknowingly crossed a line.From that day forward, my father banned Chinese takeout from the house. He never described exactly why, other than insisting that our family’s home cooking was simply “better.” What I found most bizarre was the fact that he worked as a line cook in the very restaurants he denounced. I’d assumed this food and our family were one and the same—Chinese American. But if takeout was just like us, why did my father detest it so much?Historically speaking, Chinese takeout, or “American Chinese” food is a cuisine that adopts Western taste preferences and substitutes traditional, rarer Chinese ingredients with more readily available American ones. But it wasn’t always this way. Nearly two centuries ago, during the California Gold Rush, Chinese immigrants were cooking in a more traditional style, as a way to feed miners and railroad workers who longed for a taste of home. Then the Chinese Exclusion Act passed in 1882, and all Chinese citizens seeking to emigrate were banned from entry into the U.S.—except those who qualified for merchant visas, such as potential Chinese restaurant owners and kitchen staff. As the number of Chinese immigrants to the States rapidly declined (from nearly 40,000 in 1882 to under 200 by 1885) Chinese restaurant owners shifted their focus to serving working-class Americans instead, as a way to survive. The food of these early establishments was inspired by Cantonese cuisine but hardly resembled the subtly flavored dishes traditional to southern China. Instead of steamed proteins and stir-fried vegetables, immigrants adapted to a broader American palate, cooking sweeter, deep-fried dishes that would eventually symbolize what we consider American Chinese food today (think crunchy egg rolls or General Tso’s chicken).Since then, Chinese food as a whole has been unfairly characterized as unhealthy or unclean—a myth dating back to the 1960s, when the New England Journal of Medicine reported a condition known as “Chinese restaurant syndrome.” Symptoms, allegedly related to MSG, included weakness, palpitations, and headaches. Merriam-Webster officially added the term to its dictionary in the 1990s but has since reconsidered, revising the entry due to its racist implications. And though research has failed to prove a link between illness and MSG, the negative association lingers to this day.As an American kid, born and raised in New York, I didn’t know much of this fraught history. But I had experienced firsthand its lasting effects. In elementary school, my classmates often teased me for eating the home-cooked leftovers my parents packed me for lunch. One day, I remember bringing chicken with bok choy and white rice, and a kid taunting me: “Why don’t you eat more fried rice so your eyes get chinkier?” Even though this didn’t make any sense (I wasn’t even eating fried rice), I stowed the food away, mortified. When my grandma, Ah Po, picked me up after school, I walked ahead of her the entire way home so she wouldn’t see the tears streaming down my face.I never told my family about these encounters because I knew they wouldn’t understand. My father was proud of the food we ate at home—traditional southern Chinese dishes such as delicately steamed whole fish or bak chit gai (slow poached chicken flavored with ginger and scallion). He seemed to resent how Americans incorrectly considered “dirty,” sodium-forward fast foods as true representations of his culture, when these dishes looked nothing like the food on our dinner table. But those kids teasing me at school didn’t consider our home-cooked meals any different than what came out of an oyster pail. They saw what we ate as dirty too.Looking back, I spent those formative years in such agonizing limbo. I loved our family’s cooking as much as the fried noodles from down the street, but it didn’t seem possible to hold both identities at once. So I stopped speaking Chinese and eating my parents’ food in public. I devoured my illicit takeout in secret whenever my father worked late. Or at my friend’s house, blissfully scarfing down General Tso’s chicken until I felt sick. I kept all of this quiet to avoid disappointing my father. But in the process, I never managed to figure out how to be American or Chinese enough for myself.Two decades later, those memories still creep up occasionally and reverberate through my body. I see now that my father and I had much more in common than I realized as a child. On the surface, it was easier to write off my father’s disapproval of American Chinese food for “authenticity” reasons: He didn’t see himself or his family reflected in egg foo young or crab Rangoon. But what we shared was a kind of kindred shame. Long after the repeal of the Chinese Exclusion Act, when my father first moved to America in 1984, he could only find work at a Chinese restaurant. In the ultimate act of humility, for 27 years, he cooked the food he despised. As for me, every instance I indulged without his knowledge, or lied to my friends about his job, felt like a betrayal. By hiding these truths, I hid myself in the process; that way, I could never hurt him.Though my father may never admit it, Chinese takeout is part of his identity. And this food does reflect who we are; it’s a resourceful blend of our two cultures, a part of our immigrant story, a living metaphor for survival. The burn scars on his arms from cooking with hot woks are emblems of his own resilience and grit. They remind me that there’s honor in being his daughter.These days, I still find myself craving chicken in garlic sauce. Following a long hiatus, I ordered the dish from a different restaurant, near my new home across the country, in Los Angeles. Even though I didn’t have to eat it in secret anymore, the food was as alluring as I remembered. Just like how my brother taught me years ago, I opened the oyster pail ceremoniously and made myself a plate. Somehow, the sauce tasted sweeter, the broccoli crisper, the chicken juicier. I closed my eyes, chewed slowly, and savored every garlicky, perfect bite.Explore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-30", "author": ["Condé Nast", "Jenny Liao"]}