{"id": "af245312f3727bc16adbb0b415c4fd42", "url": "https://www.bonappetit.com/recipe/galletitas-de-cebada-tostada-y-mermelada", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Galletitas de Cebada Tostada y Mermelada Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueGalletitas de Cebada Tostada y MermeladaBy Mariana VelasquezNovember 23, 20214.8(5)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman. Food styling by Pearl Jones.EmailPinterestPrintEmailPinterestPrintThese jam-filled cookies from food stylist Mariana Velásquez’s new book, Colombiana, are inspired by linzer cookies, which are popular in the Colombian town of Tinjacá. This version gets a distinctive nutty depth from toasted barley flour, which is local to the region. Barley flour is widely available online, but you can substitute oat, sorghum, or millet flour in a pinch. Velásquez likes to sandwich her cookies with apricot or bitter orange jam, but any jam—from raspberry or strawberry to more tropical flavors like mango, uchuva (husk cherry), passion fruit, or guava—will work. All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonRound Cookie Cutter Set, 12-Pack$12 At AmazonRolling Pin$13 At AmazonAteco Bowl Scraper$3 At AmazonOffset Spatula$12 At AmazonWire Cooling Rack$17 At Bon Appétit MarketIngredientsMakes about 22½cup (60 g) barley flour2½cups (313 g) all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt¼tsp. baking powder1cup (2 sticks) unsalted butter, room temperature¾cup (150 g) granulated sugar1vanilla bean, split lengthwise1large egg½cup apricot jam¼cup (28 g) powdered sugar, siftedSpecial equipmentAssorted 2½\" and 1\" cookie cuttersPreparationStep 1Toast barley flour in a dry small skillet over medium-low heat, stirring constantly, until darkened slightly and nutty-smelling, about 4 minutes. Transfer to a medium bowl and whisk in all-purpose flour, salt, and baking powder.Step 2Using an electric mixer on medium-high speed, beat butter and granulated sugar until light and fluffy, about 4 minutes. Scrape in vanilla seeds (reserve pod for another use). Add egg and beat to incorporate, scraping down bowl as needed, about 1 minute. Reduce speed to low and add dry ingredients; beat until just combined. Divide dough in half and pat into disks; wrap tightly in plastic. Chill just until dough is easy to roll out and no longer sticky, 30–45 minutes.Step 3Working with one disk at a time, roll out dough between 2 sheets of parchment paper to ⅛\" thick (dough will come nearly to the edges of parchment). If dough becomes too sticky, chill another 10–15 minutes. Stack sheets of dough, still sandwiched between parchment, and slide onto a baking sheet. Chill until very firm, at least 1 hour.Step 4Place racks in upper and lower thirds of oven; preheat to 350°. Unstack dough sheets and transfer to a surface; carefully peel away top sheet of parchment paper from each; reserve parchment. Punch out cookies as close together as possible with larger cutters. Punch out centers from half of cookies with smaller cutters; remove scraps. Re-cover cookies with reserved parchment paper and restack on baking sheet; freeze until firm, 10–15 minutes.Step 5Using a small offset spatula, divide half of cookies between 2 parchment-lined baking sheets, spacing 1\" apart. Cover and chill remaining cookies while first batch bakes. Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until pale golden brown and edges are set, 8–10 minutes. Let cool 5 minutes on baking sheets, then transfer to a wire rack and let cool completely. Repeat with remaining cookies.Step 6Spoon 1 tsp. apricot jam onto center of whole cookies. Dust cutout cookies with powdered sugar and place, sugar side up, on top of whole cookies so jam peeks through cutout.Do ahead: Dough can be rolled out 2 weeks ahead; stack, sandwiched between parchment, on a baking sheet, wrap in plastic, and freeze. Cookies can be assembled 5 days ahead; store airtight at room temperature.Recipe Excerpted From ‘Colombiana’, by Mariana Velásquez (Harper Wave). Copyright © 2021.\n\nBut it on Amazon or Bookshop.orgHow would you rate Galletitas de Cebada Tostada y Mermelada?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI used almond flour instead of the barley, and regular vanilla, these turned out amazing. SamanthaWashington, DC12/14/2021Explore Bon AppétitDessertCookieHoliday CookiesBarleyRice & GrainsBakeColombiaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Mariana Velasquez"]}