{"id": "af25e0ef936bc61d3dc0d754f0bc6de6", "url": "https://www.bonappetit.com/story/japanese-curry-powder", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "Japanese Curry Powder (Kare-Ko) Is the Key to Making Great Japanese Curry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Can’t Make Japanese Curry Without Japanese Curry PowderA can of kare-ko deserves a place in your pantry.By Chihiro TomiokaDecember 28, 2021FacebookTwitterEmailPhotograph by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Here’s an incomplete list of some foods that most people would never attempt to make at home: Pirate’s Booty, Pringles, Japanese curry powder. While ambitious home cooks and professionals might blend, toast, and grind their own spice mixes for various kare-flavored dishes, these homemade blends are very different from the kare-ko (Japanese curry powder) sold in stores. So different, in fact, that the store-bought kare-ko has remained a popular pantry staple for decades, cited in recipes without question or embarrassment. Much like Heinz ketchup (or Kagome if you’re Japanese), Kewpie mayonnaise, and Bull-Dog tonkatsu sauce, kare-ko is a commercial product with nostalgic appeal and too many ingredients to easily re-create.Much has been written about the Japanese love of kare-ko and its many applications that deviate from its South Asian origins. A super-savory, not-so-hot mix of spices featuring turmeric, coriander, fenugreek, and, perhaps most prominent, cumin, kare-ko was first offered in Japanese stores at the beginning of the 20th century. In her essay on the origin of Japanese curry, the writer and artist Sita Kuratomi Bhaumik explores how a mix of spices known as curry found its way into so many beloved dishes, from “curried goat in the West Indies, cà ri in Vietnam, sauce au curry in France, currywurst in Germany, curry powdered coronation chicken in Britain” to kare in Japan. A stew thickened with commercial blocks of curry-flavored roux (another pantry staple), kare features, at its most basic, onions, carrots, and potatoes and is served on top of a large pile of white rice. It’s a dish so popular and ubiquitous that it’s taken on the name of the spice blend with which it’s flavored.While this stew is perhaps the most well-known dish that showcases Japanese curry powder, it’s far from the only one. In Japan, you’ll find ramen or udon in bowls of thinner kare broth; Hokkaido soup curry, which is topped with chicken and vegetables and not thickened with roux; and even savory deep-fried buns filled with a thick kare-flavored sauce. (Known as kare pan, they’re also a popular children’s cartoon character—the Japanese love for kare runs deep.) All of these kare-flavored dishes are commonly served in Japanese diners and old-school cafés with more than a little bit of retro flair.So what kinds of kare-ko are available? While the food industry giant S&B (pronounced “ee-su-be”) is the most popular kare-ko available in Japan (both in market share and according to at least one internet ranking), it is not the oldest. That honor belongs to Hachi, which began producing its kare-ko in 1905 (as opposed to 1923 for S&B). They each offer their spice blends in a charmingly retro red can, with labels that list turmeric, coriander, and cumin as their top three ingredients. S&B boasts that its popular red can of kare-ko contains over 30 types of spices and herbs, a tall feat to replicate in a home kitchen. (The S&B oriental curry powder more commonly available abroad contains 17 types.) Not to be outdone, Hachi stresses its longer history and blend of 22 spices.Photograph by Isa ZapataS&B Oriental Curry Powder$9 $8 at AmazonThe choice is yours—the varieties offered by S&B and Hachi aren’t even the entirety of Japanese curry powders available on the market. And that’s not even accounting for the many other spice blends, like Madras curry powder, that would make a delicious—though distinctly non-Japanese—seasoning for any Japanese curry dish. Let’s end this by saying that even though freshly ground spice blends are fabulous, commercial kare-ko deserves its place on your shelf. A popular use that will transport you to a Japanese café? Sprinkled into your next batch of fried rice and topped with a thin omelet. I promise you won’t regret it.Get the recipe:Japanese Curry With Winter Squash and MushroomsIf you love instant Japanese curry from a box, a bowl of this soul-warming homemade version packed with seared mushrooms and sweet winter squash will deliver instant nostalgia.View RecipeChihiro Tomioka buys chocolate chip ice cream for the chocolate chips and has written about all things Japanese at Food52.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-28", "author": ["Condé Nast", "Chihiro Tomioka"]}