{"id": "af2d107843d9d608fce624026148f38f", "url": "https://www.bonappetit.com/recipe/steak-short-ribs-with-crispy-garlic-and-chile-oil", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Steak Short Ribs with Crispy Garlic and Chile Oil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSteak Short Ribs with Crispy Garlic and Chile OilBy Andy BaraghaniJanuary 9, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintIdeally, you’d make the chile oil with a mix of dried chiles. If you can’t find the two listed, ancho, gochugaru, or even black pepper will work.Ingredients4 servings2boneless short ribs or strip steak (about 1½ pounds)Kosher salt3garlic cloves, very thinly sliced⅓cup plus 2 tablespoons extra-virgin olive oil1tablespoon Maras or Aleppo-style pepper1teaspoon Urfa pepper1tablespoon red wine vinegar or sherry vinegar (for serving)Flaky sea salt (optional)PreparationStep 1Pat short ribs dry; season generously with kosher salt. Let sit at room temperature 1 hour for even cooking.Step 2Meanwhile, cook garlic and ⅓ cup oil in a small skillet over medium-low heat, shaking pan occasionally, until garlic is barely golden and just starting to crisp, about 4 minutes. Transfer garlic and oil to a small bowl; let cool slightly (about 2 minutes). Stir in Maras and Urfa peppers; season with kosher salt. Let cool completely.Step 3Heat a large heavy skillet, preferably cast iron, over medium-high 5 minutes. (You want the pan to get smoking hot!) Pat meat again to remove any excess moisture that may have been released from salt and rub with remaining 2 Tbsp. oil. Cook meat, turning occasionally, until deeply browned and crusty all over, about 4 minutes for wider sides and 2 minutes for shorter sides. Transfer to a cutting board and let rest 15 minutes before slicing against the grain.Step 4Divide meat among plates. Spoon garlic and infused oil over and splash with vinegar; sprinkle with sea salt, if desired.How would you rate Steak Short Ribs with Crispy Garlic and Chile Oil?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is an amazing recipe that I keep coming back to. I follow the directions pretty closely, although I haven't been able to find the correct peppers. I've been using ancho chile and regular chili powder instead - works great! The only thing I change is the garlic and chile oil part. Instead of frying it separately before the meat, I sear the meat and remove it from the pan. Then I add the olive oil and the garlic into the same cast iron skillet that I seared the meat. I find that the flavor intensifies from the rendered fat and adds a richness to the garlic and chile oil. Bonus is it only uses one pan for the whole thing!Ephraim MandelTEANECK, NJ10/23/2020I made this last week, subbing out the peppers for what i could find (I dont remember which), and oh boy was it good. Will absolutely be repeating. Aperoli SpritzioliArlington, Virginia4/10/2020Reviewing the spirit of the recipe less so that the letter. Super fast and easy. Made it the first time subbing ancho chili powder for the ones in the recipe (couldn't find local, though I ordered some). So maybe not true to the recipe but the intent was there. I also did a reverse sear just because that's just how I cook my steaks. Seared in lard.\n\nThe dressing I guess is what I'm reviewing. And its awesome. Perfect marriage of salt, fats, and acids. Shaved garlic not only adds nice aroma, but texture; chili powder infused into the warm oil is fragrant and flavorful but not overwhelming. Made it with a squeeze of citrus as I discovered my red wine vinegar was empty too late to do anything about it, but the acidity added a wonderful brightness. Gonna be one of my new lazy mid week meals.adi.nagBrooklyn5/20/2019Explore Bon AppétitRibsMiddle EasternShort RibBeefMeatGarlicVegetableSteakEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoSearPassoverDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}