{"id": "af301b81ecd1432e732e36927fab4fe8", "url": "https://www.bonappetit.com/city-guides/montreal/venue/rotisserie-romados", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Rotisserie Romados Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealRotisserie RomadosThe Plateau’s mouthwatering Portuguese piri-piri chicken (and egg tarts!)FacebookPinterestTwitterEmailPhoto by Dominique LafondGO HERE: for chicken, the Portuguese way (a.k.a. roasted on a giant rotisserie), at the beloved no-frills Rotisserie Romados.ORDER THE: combo platter, which includes any size chicken (whole, half, breast, or leg), a generous pile of Romados’ house-made fries nestled around the chicken so they soak up all the fat and juices, and a small green salad with mustardy dressing. While the chicken is the main draw, you’d be woefully missing out if you didn’t also order at least a half dozen pastéis de nata, Romados’ other specialty. The combination of flaky puff pastry and sweet, vanilla-scented custard filling baked until burnished and blackened in spots make these three-bite pastries treasures.THE VIBE IS: low-key. There are only a handful of high-top tables, plus counter seating, and very sparse decor. But the service is polite and the line manageable, with a mix of hipster locals, tourists, and Portuguese families from the neighborhood.PRACTICAL STUFF: Open every day: Sunday to Thursday 8 a.m. to 9 p.m., and Friday and Saturday 8 a.m. to 10 p.m. All the food is packed in to-go containers, so if weather permits, walk a few blocks over to Jeanne-Mance Park for a picnic. Don’t forget the napkins.—Claire SaffitzPhoto by Dominique LafondPhoto by Dominique LafondWE ALSO LOVEAu Pied de CochonGet your fill of foie gras and other Quebecois luxuries at this Plateau legendPatisserie Au Kouign-AmannA carby, sugary haven in the PlateauL’ExpressWhen you want the French bistro classics, you go to this Plateau institutionExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-22", "author": ["Claire Saffitz"]}