{"id": "af393e5af5053db169ffe16bebd3eb22", "url": "https://www.bonappetit.com/story/golden-diner-home-fries", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "The Home Fries at Golden Diner Put All Other Home Fries to Shame | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Home Fries at Golden Diner Put All Other Home Fries to ShameHow to make the best home fries? Chop up the best hash browns. By Sarah JampelOctober 21, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I don’t know if you’ve noticed (I have), but Bon Appétit has a dearth of recipes for home fries. But every time I pitch it at a meeting, I’m shot down. Limp! the crowds cry. Mushy! they say. Under-seasoned! Cold! A waste of valuable diner plate real estate!Clearly, none of those people have tried the home fries at Golden Diner in New York City. Chef Sam Yoo’s version is exceedingly crispy (as in, you hear a crunch when you take a bite), with buttery-soft insides. The eating experience is like popping a potato chip and a spoonful of mashed potatoes into your mouth at the same time. The first time I tried them (on a breakfast plate with two fried eggs and very well-buttered toast), I couldn’t figure out how they could inhabit two different realities at once. (My mom always told me that wasn’t possible!)But the home fries at Golden Diner are so superior, as it turns out, because they’re essentially chopped-up French fries. Or technically chopped-up hash browns—which, in all honesty, are essentially flat, perfectly square French fries. (These get layered in the scallion milk bun breakfast sandwich—a recommendation for another story.)It’s not easy to achieve such perfection: The process is multi-day and painstaking. Once the Idaho potatoes are scrubbed and shredded, they’re rinsed three times in cold water. Next, the strands are brined in a salt-vinegar solution to break down the potato for that luscious interior and infuse it with a slightly tangy flavor that, in Yoo’s words, “helps it taste more like a McDonald’s hash brown.” The drained potatoes are then steamed, immediately pressed into trays, weighed down with lots of heavy objects, and left to sit overnight. In the morning, the starches have bound the shreds into one homogenous cake, ready to be portioned into neat squares, deep-fried, and chopped up for the most perfect home fries. (If you think this kind of crunch can be achieved without deep-frying…well, then you are mistaken.)Okay, so now that I know how much labor goes into these home fries, perhaps I’ll stop pitching the recipe for Bon Appétit. We’ll all just have to line up at Golden Diner instead.Go there: Golden DinerExplore Bon AppétitHighly RecommendNew York CityRestaurantsRead MorecultureThis Hotel Breakfast Turned Me Into a Morning PersonBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-21", "author": ["Condé Nast", "Sarah Jampel"]}