{"id": "af6abc4330176a18697207ca3cc9c9b0", "url": "https://www.bonappetit.com/story/herby-texas-toast", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "This Herby Texas Toast Looks Fancy But Is Incredibly Easy to Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Herb-Adorned Toast is More Dressed Up Than I've Been in WeeksI'm in my pajamas but my toast is ready for its photo op.By Jerrelle GuyApril 22, 2020FacebookTwitterEmailPhoto and Food Styling by Jerrelle GuyFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.As a kid, the toast I knew was Texas Toast. It was synonymous with garlic bread and we would buy it frozen in a box, already slathered in butter, garlic, and sometimes shredded cheese. Due to our good Southern tendencies, we’d treat the slices like biscuits, usually smearing them with strawberry jelly and eating alongside buttered rice, crispy sauced-up chicken, or any other plates of smothered food.My father taught me his jelly-on-garlic-toast trick, showing me the brilliance of cutting heavy foods with something sweet and bright. And while this pan-fried herby toast certainly isn’t garlic bread spread with jelly, it captures the same spirit—richness countered with brightness. Serve it with a splayed avocado, beneath a milky pouch of buffalo mozzarella or a tottering pile of crispy chicken, or, heck, with a lick of jam or jelly. Or not—just enjoy it as is.Here’s how to make it: Grab a piece of fluffy sandwich bread, sliced extra thick. The package should say “Texas Toast Sandwich Bread” or have “thick” in the name. You want slices that are between ¾\" and 1\" thick. The stockier and spongier the slice is, the better it will hold up to and hold onto daubs of herby butter. I prefer sandwich bread, Italian bread, or any slice with tight knit spores—that flat, dense face is a good blank canvas for the display of herbs. (Of course, you can bake your own loaf and slice it yourself. Or you can use any other bread you already have—ciabatta, sourdough, brioche—to completely fine results.)Make sure you have a non-stick skillet that is heating over medium heat, and that your butter is unsalted and just soft enough to spread. Depending on the size of your bread and whether you are into buttering both sides like I am, add 2 tablespoons of butter to a small bowl with about 2 tablespoons of whatever herbs you prefer. My magic combo has a large percentage of whole fresh oregano leaves, thyme, and about a teaspoon of roughly chopped rosemary. I mix that all together and I spread it evenly on both sides of the bread, nudging the herbs into place with a knife and pasting them flat against the gluey butter. Then I lower the bread into the warm skillet. (Texas legend has it that, unless you were going to use the oven, pan-searing was the only option with bread this thick—you can’t really shove it into a traditional toaster.) Cook the buttered toast for 1-2 minutes per side, or until it’s at your desired toastiness, pressing down slightly before flipping to encourage the herbs to adhere.An alternative way to cook this eliminates the extra step of whipping up a bowl of compound butter.  On more time-pressed moments, I heat the same amount of butter in a non-stick skillet, and once the butter is melted, I sprinkle the herbs into the center of the pan and quickly lay the piece of bread on top.  I press down slightly on the bread with the back of a spatula to help the herbs adhere to the surface. I cook that for 2-3 minutes before flipping the toast to brown the other side. This way tastes great, too, but it’s less likely the herbs will stick to every inch of the bread.My favorite part of this toast happens to be the silly ridiculousness of all those frilly herbs decorating a single slice of bread. But either way, once you taste this new way to toast, you’ll be tempted to add it to the rotation.Jerrelle Guy is a cookbook author, recipe developer, and food stylist currently living in Dallas.Explore Bon AppétitIt's That SimpleGarlicBreadherbButterFryRead MoreClassic Garlic BreadBA's Best Sandwich BreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-22", "author": ["Condé Nast", "Jerrelle Guy"]}