{"id": "af6e15053a61b040924c06eb0a94beab", "url": "https://www.bonappetit.com/story/riblets-better-than-wings", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "Riblets Are Way Better Than Wings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRiblets Are Way Better Than WingsI couldn’t care less about football, but I’m passionate about these sticky little ribs.By Carla Lalli MusicJanuary 30, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Stylist by Susie TheodorouFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’ve said it before and I’ll say it again: Riblets are the chicken wing of the pork world.My introduction to the riblet, also known as a “cocktail rib,” came about in 1999—the year Martha Stewart published her very legendary tome, Martha Stewart’s Hors d’Oeuvres Handbook, and when I became a professional cook. My attachment to this book and its the groundbreaking food photography is another story, but suffice it to say I literally studied every recipe, from goat cheese-piped radishes to deviled quail eggs. Twenty years later, it is still a source of mind-boggling, if slightly dated, inspiration.So when Adam Rapoport challenged me to a party menu challenge for our annual Super Bowl podcast episode, my mind went straight to Martha’s Molasses-Glazed Cocktail Ribs, stacked into a tidy pile and pictured in soft focus on page 136. I’ve made them many times over the years, first as a fledgling caterer and later as an amateur hostess and these sticky little ribs are my secret weapon.The cuts don't need to be perfectly even.\nPhoto by Carla Lalli MusicIf you listen to our foodcast (of course you do), you already know how a cocktail rib is fashioned, but to recap: By cutting a rack of ribs in half lengthwise, you get ribs that are half as long—all you need is a compliant butcher and a bandsaw. When you cook them, the meat shrinks away from the bones, creating the perfect three-bite finger food with a built-in handle. Martha’s approach was to coat them with a hard-working marinade, containing mustard and molasses for tang, harissa for heat, plus maple syrup for sweetness, and vinegar for requisite sourness. If you follow this framework of flavors, it’s easy to come up with your own signature glaze, which is exactly what I’m doing this year.First, pick up a rack of baby back ribs, which should weigh between 2 ½ and 3 pounds (St. Louis style will work as well, if that’s what your shop has in stock). Ask for them to be halved lengthwise so that you have two long strips, and then cut between each rib bone to make individual ribs.In a large bowl, whisk together ½ cup unseasoned rice vinegar, 3 tablespoons Worcestershire sauce, 1 cup maple syrup, ¾ cup English (or Dijon) mustard, and ⅔ cup gochujang until smooth. Season the ribs with kosher salt, toss to coat, and transfer to the marinade. Turn to coat ribs, and let sit 1 hour.Riblets getting saucy and glossy.\nPhoto by Carla Lalli MusicPreheat your oven to 375°. Transfer the ribs to a rimmed baking sheet and pour about 1 cup of the marinade over. Roast, uncovered, for 15 minutes, then baste with the reserved marinade. Roast for 15 minutes more, then turn the ribs over, baste again, and set timer for 10 more minutes (that would be the 40 minute mark, total). At this point, check the riblets. You should be able to see rendered fat on the pan, and around the edges some of the marinade may be reduced, bubbling, and starting to get dark. The ribs should be shiny, glazed and tender, with meat that has pulled back from the bone. Try one! If you think they need to be even more glazed, baste a final time, then roast 5–10 minutes longer (the ribs will eventually dry out if overcooked).Meanwhile, turn the marinade into a dipping sauce: Combine any extra marinade and ½ cup water in a medium sauté pan and bring to a simmer over medium-high heat; cook 5–7 minutes, stirring occasionally, to slightly reduce (this step is important since the marinade was in contact with the uncooked ribs).Riblets, like wings, benefit from crunchy cold things alongside. I serve these with celery sticks that have been tossed with fresh lime juice and flaky salt—you could do the same with cucumbers, carrots, or jicama. Pour the extra marinade into a little bowl and pile the ribs into a perfectly imperfect pile. If you’re going to take a picture for Instagram, I suggest you use portrait mode and come in on a slight angle, which will give you that epic, retro Martha soft-focus vibe. It’s that combination of trashy and classy that sold me on riblets way back when, and it still really does it for me.Explore Bon AppétitCarla NewsletterRibsSuper BowlRead MorecookingMaster the Italian Hero and Be the Hero of Every PartyBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-30", "author": ["Condé Nast", "Carla Lalli Music"]}