{"id": "af713e1574f8c2c68cf0b0687cdf8120", "url": "https://www.bonappetit.com/recipe/foolproof-fish-with-spiced-chickpeas", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "Foolproof Fish with Spiced Chickpeas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFoolproof Fish With Spiced ChickpeasBy Lauren SchaeferFebruary 25, 20194.6(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food styling by Rhoda BooneEmailPinterestPrintEmailPinterestPrintRoasting fillets of firm white fish (think cod, halibut, hake, or haddock) in the oven at a low temperature is hands-down the most approachable at-home fish cooking method there is. You avoid all of the sputtering and splattering (and potential smelliness) of high heat stovetop searing, and cooking the fish gently means you have a greater margin of error—and still takes less than half an hour. Fish cooked this way isn't going to take on any color, so the only way to really tell if it's done is by touching it; the flesh should flake easily under light pressure, and should look just barely opaque. And while that spiced chickpea-carrot mixture makes this dish a complete meal, you can cook your fish on top of just about any side dish you like and keep the method the same.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonSpoon$24.69 At AmazonColander$11 At AmazonCast Iron Skillet$30 At AmazonWooden Spoon$6 At AmazonIngredients4 servings2shallots½cup raisins, preferably golden2Tbsp. red wine vinegar2½tsp. kosher salt, divided3garlic cloves11½\" piece ginger2medium or 3 small carrots (about 6 oz. total)½cup extra-virgin olive oil, divided1tsp. turmeric½tsp. crushed red pepper flakes215-oz. cans chickpeas1½-lb. piece of whitefish, such as cod, halibut, haddock, or hake1cup mint leavesPreparationStep 1Place a rack in middle of oven; preheat to 300°. Time to do some prep! Peel 2 shallots. Cut in half lengthwise, then slice crosswise. Divide shallots between a medium bowl and a small bowl.Step 2Coarsely chop ½ cup raisins and transfer to medium bowl with shallots.Step 3Add 2 Tbsp. red wine vinegar and ¼ tsp. salt to shallot mixture and toss gently with a spoon to combine. This marinated mixture is the beginning of a tangy, herby finishing sauce for the fish, but we're going to wait until the last second to add the mint leaves, otherwise they'll oxidize and go brown. Set both bowls aside.Step 4Peel 3 garlic cloves, then thinly slice.Step 5Using a spoon, peel 1½\" piece ginger, then finely chop. (We always like peeling ginger with a spoon, rather than a vegetable peeler—all the better for maneuvering around those knobby bits.)Step 6Rinse 2 medium or 3 small carrots well. (You can peel them if the exteriors are really gnarly, but if not don't bother.) Slice as thinly as possibly into coins on a diagonal.Step 7Drain and rinse two 15-oz. cans chickpeas.Step 8Drizzle 3 Tbsp. olive oil in a medium cast-iron skillet and heat over medium. Add reserved shallots (not shallot-raisin mixture). Cook, stirring occasionally, until light golden in color, 3–5 minutes.Step 9Add garlic, ginger, 1 tsp. turmeric, and ½ tsp. crushed red pepper flakes and cook, stirring constantly, until fragrant, about 1 minute.Step 10Increase heat to medium-high and add chickpeas, carrots, 1 Tbsp. olive oil, and ½ tsp. salt. Cook, stirring occasionally, until everything is combined and well coated and flavors have melded, 3–4 minutes. Remove pan from heat.Step 11Cut 1½ lb. whitefish into even portions if needed so they will fit in your pan. Season fish on all sides with 1½ tsp. salt. Nestle into chickpea mixture in pan and transfer to oven. Bake fish until flesh just begins to flake away easily with light pressure from a fork, looks very juicy, and is just barely opaque, 15–20 minutes. (This will vary greatly depending on how thick your fish is, so keep an eye on the fish and start to take a look at around 15 minutes.)Step 12Coarsely chop 1 cup mint and add to bowl with reserved shallot-raisin mixture. Add remaining 3 Tbsp. olive oil and toss to combine.Step 13Spoon mint salsa over fish. Divide among plates, or serve right from skillet.How would you rate Foolproof Fish With Spiced Chickpeas?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleI love this recipe! My only tweak is to deglaze the pan with some white wine or champagne before placing the fish on top and popping it in the oven, this really melds the flavors of the chickpea base and keeps it from drying out.Elisabeth2/22/2022Love this recipe! I also add 3-4 generous handfuls of fresh arugula and 1/2c toasted hazelnuts to the chickpea mixture right before putting it in the oven; this seems to balance out the mint flavor and adds a little texture to the dish. KatieTacoma, WA2/10/2022I've made this a couple times and it's always good but next time I'm gonna make a couple tweaks.  I think less fish and chickpeas, more shallots, carrots and ginger and it would be perfect for my tastesPachDurham, NC11/18/2020YUM! This is so quick, easy, and healthy. Added some cavolo nero together with the chickpeas and carrots, which was delicious and an easy way to pack in some extra vitamins. Anonymous10/6/2020The mint is OVERPOWERING. I could see this recipe working if you used parsley or cilantro instead.. and less of it than 1 cup. Anonymous5/14/2020Super delicious! Don't worry about eyeballing things. I added extra shallots, garlic, and spices. Swapped for parsley because thats what I had on hand. Turned out amazing nonetheless! Try it out! I'm not a fish person and it still turned out perfect. Super excited because this one is certainly a keeper! \nAnonymousArlington Heights, IL4/24/2020Incredible. Made exactly as stated... we just had to cook in the oven for longer, but that likely has to do with our oven. Just perfectly balanced and amazing. Complete meal.AnonymousOntario, Canada8/10/2019Fantastic! So many flavors and they all just WORK. Didn’t change a thing, and I’d make it again and again. Raisin haters - take a chance on this one!AnonymousLos Angeles3/26/2019Cannot wait to make this again! Was super delicious. The salsa brought it all together. It was super simple and the components just plate themselves beautifully. AnonymousNew York3/10/2019So delicious!  Will definitely make this again.  I did need to cook the fish  for an extra 10 minutes.AnonymousPennsylvania 3/6/2019Fabulous recipe. A keeper and one I would even make for guests.alisonmouton8939France3/2/2019Straight forward and delicious!!AnonymousBoston2/28/2019Very good !AnonymousNY2/27/2019Explore Bon AppétitCodFishSeafoodHalibutHaddockChickpeaBeanVegetableOne-Pot MealsWeeknight MealsMainNut-FreeGluten-FreeDairy-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-24", "author": ["Condé Nast", "Lauren Schaefer"]}