{"id": "af717de837bcdbc7daa1664173540006", "url": "https://www.bonappetit.com/story/1821-bitters-prohibition-aromatic-bitters", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "These 18.21 Bitters Turn a Deadbeat Gift Into a Thoughtful One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThese Bitters Turn a Deadbeat Gift Into a Thoughtful OneWant to prove you’re an A+ gift giver? Give your loved ones a custom cocktail kit, complete with 18.21 Bitters.By Hilary CadiganDecember 11, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My go-to holiday gift has always been a bottle of alcohol. It's easy, it's scalable, and it's always well received. (Unless the person doesn’t drink, in which case: fancy boots.) But throwing booze under the tree also can also seem...a bit lazy. Like maybe you forgot to buy anything at all and, on Christmas Eve, hightailed it to the closest liquor store, grabbed the first dusty mid-range option you saw, and threw it into one of those Santa-printed bags they sell at the liquor store.So now that I’m in my 30s and desperately trying to prove that I’m! not! lazy!, I give a 2.0 version: The ~cocktail kit~.All you need to create a cocktail kit is the aforementioned booze, plus two things: a useful but not-too-pricey bar tool (this swizzle spoon is a good one, so is this mod trophy-shaped jigger) and a bottle of 18.21 Bitters. I love these bitters not only because they’re made by hand in my favorite city, Atlanta, but also because they’re extremely versatile, look très chic on anyone’s bar cart, and suggest far more advance holiday planning than that Angostura sitting next to the Santa bags. Plus, there’s a wide variety of fanciful flavors, so you can create a customized pairing based on your receiver’s favorite firewater. Bottle of gin? Earl Grey Bitters. Bottle of mezcal? Japanese Chili and Lime Bitters.My personal favorite is the smooth-n-spiced Prohibition Aromatic Bitters, which smell like Christmas if your Christmas took place in a 1920s speakeasy full of buttery leather and sparkly ladies smoking clove cigarettes (dream Christmas!). Pair it with your favorite rye or bourbon for a very excellent Old Fashioned, or add an absinthe rinse to make a mean Sazerac. If you really love the person, you could throw in some rye AND some absinthe, and maybe an Allen Toussaint record and, well, look at you. You’re the Gift Giver of the Year, and suddenly that one time you bequeathed everyone stolen Heineken pint glasses wrapped in red ribbon is forgotten and no one can ever call you lazy again, as long as you all shall live.Buy it: Prohibition Aromatic Bitters, $19 at 18.21 BittersAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitBittersHighly RecommendShoppingCocktailRead MorecultureThe Secret Ingredient That Improves My Cocktails, Morning Yogurt, Delivery Pizza…By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-11", "author": ["Condé Nast", "Hilary Cadigan"]}