{"id": "af73d6e9b1d3fae62e2a6ad8bf87239a", "url": "https://www.bonappetit.com/recipe/bas-best-shrimp-cocktail", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Shrimp Cocktail Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJuly 2018 IssueBA’s Best Shrimp CocktailBy Molly BazJuly 24, 20184.6(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintShrimp cocktail is all about the shrimp: big, fat, perfectly cooked gorgeous shrimp. We think 16–20 per pound are the perfect size, and that’s what this recipe was developed for (the size will be printed on the bag the shrimp are packaged in, or ask your fishmonger). If you end up with a different size, just follow these guidelines: For 26–30, poach 1½ minutes; for 21–25, poach 2 minutes; for 13–15, poach 4 minutes; for 8–12, poach 5 minutes. Proceed as written with the rest of the recipe!Ingredients4 servingsShrimp¼cup Diamond Crystal or 2 Tbsp. plus 2 tsp. Morton kosher salt¼cup sugar2lemons1lb. jumbo shell-on shrimp, deveinedCocktail Sauce and Assembly1cup chili sauce (preferably Heinz)¾tsp. finely grated lemon zest2Tbsp. fresh lemon juice2Tbsp. prepared horseradish2tsp. freshly ground black pepper¾tsp. hot sauce (preferably Tabasco)Lemon wedges (for serving)PreparationShrimpStep 1Scoop 8 cups ice into a large bowl; set aside. Combine salt, sugar, and 6 cups water in a large saucepan. Cut lemons in half, squeeze juice into pot, and toss in lemon halves. Bring liquid to a boil, stirring to dissolve salt and sugar, then remove pot from heat. Add shrimp and poach, uncovered, 3½ minutes.Step 2Immediately add reserved ice to saucepan to rapidly chill the liquid and stop the cooking. Let shrimp sit in ice bath 10 minutes. Drain, pat dry, and peel. Pat dry again. Cover and chill until ready to serve.Step 3Do Ahead: Shrimp can be poached and peeled 1 day ahead. Keep chilled.Photo by Alex LauCocktail Sauce and AssemblyStep 4Mix chili sauce, lemon zest, lemon juice, horseradish, pepper, and hot sauce in a small bowl. Cover and chill until ready to serve.Step 5Serve shrimp on cracked ice with lemon wedges and cocktail sauce alongside.Step 6Do Ahead: Sauce can be made up to 1 day ahead. Keep chilled.How would you rate BA’s Best Shrimp Cocktail?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis cocktail sauce is a total game changer. This whole process is so easy, and the outcome is so delicious. TylerLafayette, Indiana2/15/2021This is the best shrimp cocktail I've ever had. I've been making it since the recipe came out. Thank you!MoonrisecheesecoCanandaigua, NY1/16/2021Hey there, J V again. I decided not to remake the cocktail sauce. I let it sit out for about an hour-ish, and the volatiles in the horseradish escaped from the sauce. It was delicious after that. J V (again)Denver, Co1/3/2021I've never had cocktail sauce before, so maybe it's supposed to be overwhelmingly composed of horseradish, but I couldn't eat this without wincing with each bite. Why do we use 2 tablespoons?J VDenver, CO1/3/2021Explore Bon AppétitShrimpShellfishSeafoodHorseradishHerbs & SpicesLemonCitrusFruitQuickEasyStarterDairy-FreeNut-FreeFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-24", "author": ["Condé Nast", "Molly Baz"]}