{"id": "af7693774bf09acfbf8260c942b05411", "url": "https://www.bonappetit.com/story/trader-joes-spring-2021-reviews", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Trader Joe’s Spring Lineup Is Packed With Vegan Comfort Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Spring Lineup Is Packed With Vegan Comfort FoodBecause air fryers, crispy fried jalapeños, and bougie lil' mushroom snacks are always in season.By Alex BeggsMay 26, 2021FacebookTwitterEmailFacebookTwitterEmailHuge news since I last reviewed Trader Joe’s new snacks: I got an air fryer! (The Breville one). That means every frozen food from Trader Joe’s is 1000x better than before because the circulated hot air, previously known as “convection,” makes every fried-before-frozen thing extra all-around crispy. (The tempura cauliflower, wowwwwwwwww.)If you buy a lot of TJ frozen stuff, you need one. The new honey shrimp are fantastic air-fried, so is the garlic and pesto pizza with deep-fried crust.Elsewhere this spring, Joe seems to have invested big $$ on vegan comfort foods, with two types of vegan bolognese made with plant-based nubbins, and jackfruit doing its best to pass as barbecued pulled pork.Reviews, below.New and Exciting Salty SnacksCrisp Crunchy Crisps Pea & Chickpea SnacksThese pea-pea crisps have the look of a flattened packing peanut, and are curved, scoopable chips made of dehydrated this n’ thats. The flavor reminds me of veggie chips, which (who are we kidding) are made of potatoes. Indeed, potato starch is the second ingredient. A neutral vessel for salt and snack superiority complexes.Crispy Crunchy Champignon Mushroom SnacksSuck most of the moisture out of a mushroom, fry in sunflower seed oil, toss in salt, and TAKE ALL MY MONEY. I love these bougie little buddies. Some of the ‘shrooms are chewy, some are burnt, but life is not interesting without variety, which is why we keep the special mushrooms in the fridge. I’m not counting (I’m very much counting), but a bag of these “snacks” is around 30 grams of fat, so I eat them by the intentional handful.Straight-Up CandyFruity Gummy CandiesReal gummies, with glucose syrup and everything! The tropical flavors are mysterious and inviting, like the blueberry that’s so faint I wondered if they forgot to inject it with flavor, grapefruit that tastes like rosé, and pineapple that tastes like pineapple. They’re sticky and super chewy, which means they’re a performance-enhancing stress snack. Chew, chew, chew! Before it’s you who is chewed.Fruity Chewy Candy aka Not-StarburstThese logo-less wrapped chewy candies are about as stealth as a celebrity getting coffee in sunglasses and a baseball cap. WE CAN SEE THAT YOU’RE BEN AFFLECK. I’d know that jawline anywhere. Chew, chew, chew!Chocolate Covered Wafer Cookie with Peanut Butter FillingThese wafer cookies are one giant wafer, as opposed to sticks you can share. They’re inherently un-shareable, which seems like a product of the pandemic. Or it’s just my new permanent mindset. I love the crinkle paper wafer texture up against the smooth peanut butter-esque goo. No, I cannot break you off a piece.Vegan StuffPulled Jackfruit in Smoky BBQ SauceSilky, tender shreds of jackfruit in sweet barbecue sauce the texture of hair conditioner. The jackfruit’s doing a damn good impression of pork, without that chewy muscularity from an animal that was once alive and trotting. This pouched food fits well into my theory that all food is packaged for apocalypse bunkers now. Can’t wait to eat this after the blast!Vegan Pasta Bolognese BowlWeird wheat protein crumbles imitate finely chopped meat in this faux-lognese. I hate them! And the dense, chewy red lentil pasta! Sorry! This belongs in the “Trader Joe’s Airline Food” collection. Chew, chew, ew.In the Frozen AisleRoasted Garlic & Pesto Pizza with Deep Fried CrustThe deep-fried crust puffs up like an inner tube and starts to smell like funnel cake in the air fryer—my knees weaken. It has green splooges of pesto polka dots, bubbly mozzarella, and no flaws whatsoever. It’s so good, all puffy and garlicky and cheesy. Unlike frozen pizzas of yore, it doesn’t get that dried-out cardboard crust. Perhaps because some evil genius went the extra mile and DEEP. FRIED. THE. CRUST.Carne Asada BurritosIf you want Chipotle, just go to Chipotle.Buffalo Style Chicken PoppersWhat tailgating visionary came up with this? Put the buffalo chicken dip...inside filo dough. As promised, the air fryer made the outer dough shatter like the dreams of a recent graduate of NYU’s journalism school. After they’ve cooled down for five minutes, as the instructions require, the buff chicken dip inside is still scalding lava. Don’t take it as a warning, just keep eating.Honey Walnut ShrimpSHRIMP with FROSTING. Tastes like kettle corn. Either you’re into that or you’re not, but if you are, top with the crispy jalapeño pieces (below) for a spicy counterpoint.Pantry StuffCalrose RiceSticky rice in surfer cute branding because it’s from California, where, as I understand it, the sun’s always shinin’ and a tsunami could hit any minute. Rinse it well, cook, and serve it like I did with this amazing mustardy fish.Ajika Georgian Seasoning BlendA spicy, slightly herbal blend of red chile pepper and a few friends—garlic, salt, fenugreek, marigold (!), and coriander, based on the Georgian condiment. Something to play around with this summer when you’re suddenly grilling for people with newly exposed chins.Mediterranean DoradeDorade always reminds me of this street where I grew up called El Dorado Blvd. and one morning on my way to lifeguarding I ran over an armadillo on it (he tucked into his shell, was fine). Fish is also fine. It’s more subtle in flavor than tuna, with a tender, flaky texture.Magnifisauce!Burger “special sauce” that’s so watery the spout is in the shape of a bedpan for easy pouring. If bedpan isn’t a point of reference for you, wait ‘til you find out what life has in store. Sweet and cucumber-y.Crispy Jalapeño PiecesIrregular perfection. I’ve been putting these fried jalapeño chips on everything. My only regret is not buying five canisters in a hoarding frenzy. Oil shortage? Who cares! Crispy jalapeño shortage? WORRISOME.Matcha Green Tea Japanese Noodles“What are you gonna do with these?” asked my TJ cashier, who seemed genuinely curious about TJ’s new slim packages of cha soba. “Make a soba salad with a nutty dressing,” I said. And did. The gorgeous green color is lovely; the green tea flavor is subdued. Summer is cold noodle salad season, so stock up!New Zealand Salted ButterVERY YELLOW. Suspiciously yellow. How is it so yellow?Good on toast.Almond Flour TortillasAs a loyalist to lard and flour, I was skeptical but OPEN-MINDED about the world of potential that almond flour tortillas hold. What a relief that these weren’t dry and crumbly! Brava, tortilla innovator. They don’t puff up as much as the ideal tortilla from on high—Caramelo, there is nothing that comes close—but they cradled my breakfast eggs (and crispy jalapeño pieces) without tearing. They taste as neutral as I feel about gluten.Jarred Sauces with Personality and PizzazzCajun Alfredo Pasta SauceAn impressive amount of preserved dairy in a jar. Mmmmmaltodextrin! But I try not to question processed foods. It is what it is. Extremely shelf-stable. On the brink of “edible” and “indestructible” and “suspiciously tasty.” The fennel seeds get caught between your teeth like tiny lies you can’t take back, so just commit to them—like that British accent you tried out in 6th grade.Thai Style Green Chili SauceIf you make ONE THING with this spicy, gingery sauce, let it be my favorite soup recipe of 2021, Christina Chaey’s green curry lentil soup that Joe could never bottle.Vegan Bolognese Style Pasta SauceUnlike the vegan bolognese airline food, the understudy for meat is “plant-based” nubbins made of pea protein. And this is much, much better. Mushrooms, carrots, and celery do their vegetal aromatic thing while the pea protein floats in the soupy-broth with absolutely no idea that it is not ground chuck. And I respect that. Float on, little nubbins.Explore Bon AppétitTrader Joe'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-26", "author": ["Condé Nast", "Alex Beggs"]}