{"id": "af85b13d6201df22931e5fb814fd94dc", "url": "https://www.bonappetit.com/recipe/pupusas", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Pupusas Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPupusasBy Rick MartinezSeptember 13, 20214.5(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, styling by Sean DooleyEmailPinterestPrintEmailPinterestPrintPupusas—masa flour pouches filled with beans, cheese, and/or meat—are a signature dish of El Salvador. While making them can be a touch tricky at first, it’s not hard once you get the hang of it. Former BA senior food editor Rick Martinez breaks down the technique in these helpful step-by-step photos. Once you’re well acquainted with Salvadoran pupusas, you’ll definitely want to experiment with the fillings. Cooked chicken, carnitas, or chorizo all work well—just make sure the meat is chopped or shredded finely enough that it sits neatly in the dough, and drain off any excess liquid before using it. (You can make the filling a day or so in advance if you prefer to break up the work.) No matter the filling, pupusas pair perfectly with Curtido, a Salvadoran fermented cabbage relish, and this Salsa Roja.Editor’s note: This recipe was originally published on May 5, 2017.IngredientsMakes about 12¼cup plus ⅓ cup vegetable oil, divided½medium white onion, halved, broken up into individual layers (petals)115-ounce can Central American red beans or red kidney beansKosher salt3cups instant corn masa flour (such as Maseca Instant Corn Masa Mix)4ounces grated queso Oaxaca or salted mozzarella (preferably Polly-o; about 1 cup)Curtido (Salvadoran Cabbage Relish) and Salvadoran Salsa Roja (for serving)PreparationStep 1Heat ¼ cup oil in a large skillet over medium-high. Cook onion, tossing occasionally, until pieces are charred on all sides, 10–12 minutes (oil will smoke and onion will pop, so be careful). Don’t stop cooking at “browned,” they need to go further.Step 2Transfer onion to a blender, reserving oil in pan. Add beans and their liquid to blender and purée, gradually adding ¼ cup warm water if mixture is too thick and blender is struggling, until smooth.Step 3Heat onion oil over medium. Transfer bean mixture to skillet and cook, stirring and scraping bottom of pan occasionally, until mixture is the consistency of thick Greek yogurt, 5–10 minutes; season with salt. Let cool (refried beans will thicken as they sit, and that’s exactly what you want); set aside.Step 4Using a stand mixer fitted with the paddle attachment, beat masa flour, 3 tsp. salt, and 2⅔ cups hot water on medium speed until dough is very thick and sticky (alternatively, mix in a large bowl about 1 minute). Let rest, uncovered, 15 minutes.Step 5Meanwhile, mix cheese and bean mixture in a medium bowl.Step 6Combine remaining ⅓ cup oil and 1 cup warm water in a medium bowl. Dip both hands in this mixture and rub your hands together to coat. This will prevent dough from sticking to your hands, and will hydrate dough as you assemble.Step 7Divide dough into 12 balls (about ¼ cup each), keeping them covered with a damp towel so they don’t dry out. With 1 ball in the palm of your hand, use your thumb of the opposite hand to create an indentation in the center. Pinch sides to create a well for the filling (it should look like half of a coconut shell). Fill hole with 2 Tbsp. bean mixture. Pinch dough around filling to enclose (it’s okay if some is poking out), then gently flatten to a 4½–5\" disk, dipping your hands in oil-water as needed. Repeat with remaining dough and bean mixture (you may have some filling left over).Step 8Cook pupusa in a large cast-iron skillet or griddle over medium heat until center slightly puffs up and pupusa is browned in spots, 3–4 minutes per side. If filling leaks out, simply scrape off pan after pupusa has cooked.Step 9Serve with cabbage relish and salsa roja alongside.How would you rate Pupusas?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangle@JESSSICAGABRIELA if you used 3tsp of regular table salt then you likely added double the intended amount of salt. BA recipes generally assume that Diamond Crystal Kosher will be used.EoRourke7/29/2020Ok so does “ 3 tsp.salt” mean 3 teaspoons? Cause I applied that much and it turned out very salty. I would rather just input 3 punches of salt.  Please clarify.  JesssicagabrielaAlexandria, VA 4/15/2020These pupusas were amazing!! I've always loved pupusas but assumed they would be too difficult to make. These were so much fun to make and were so delicious. Can't wait to try them again, thanks for the recipe Rick!AnonymousSan Francisco4/6/2020I love this recipe and Rick's step by step on it is so helpful! Keep that Latin American food content coming, Bon Appetit! AnonymousWashington, DC 4/2/2020Great, easy recipe! Will be making again! AnonymousGeorgia3/31/2020I am 12 years old and this was the easiest thing to cook. And it tasted good , no one in my family can cook so for this to taste good it is a miracle. Nr9181948North Carolina3/26/2020Can not believe I had to watch 4 commercials!  BSAnonymous440223/23/2020Yay for Pupusas! I love trying out different pupusa recipes. Excellent.AnonymousSeattle, Washington1/11/2020Don't know why this recipe turned out bland for me, it was relatively easy to follow but all in all I wouldn't make it again.Anonymous11/27/2019Beans: Love the onion in that baby! It gave the refried beans soooo much flavor. Better than any can I have had.\nCortido: Subbed kosher for iodized (I know, I know but that's all I had and I didn't want to go back to the store!) and it had this weird taste (metallic; looked it up and I guess iodized NaCl is no bueno for fermenting; whatevs) but bf LOOOOVED it! So fresh and crunch and you cannot eat pupusas without it!\nSalsa Roja: Holy S#i+! This stuff is sooooo bomb! I'm gonna have to make this and keep on deck for eggs, quesadillas, savory oats, dude everything! Watch out Frank's, I'm bout to put this stuff on EVERYTHING!\nPupusas: Subbed the white for yellow masa (I think they were having a sale) and still were delicious. This was my first time making this and the first batch of dough was super dry making it difficult to form my little delicious hockey pucks. The forming takes time and is def an art. Second batch was super moist when forming and it was easy to form (albeit super sticky and messy; lubing was not working).  \nOVERALL: LOVE this recipe and the ease of Rick in his video actually made me try it.  There are tons of great places to grab pupusas in the LA area but his insight and easy going attitude made me WANT to try.  I'm glad it wasn't a bust and I absolutely love the flavors. Def making again but making the cortido and salsa roja ahead of time. AnonymousLos Angeles, CA11/20/2019absolutely fantastic! I made some with refried bean & cheese filling, and some with chicken adobo & cheese filling. the salsa and curtido are PERFECT with them! thank you so much.deedle2038Austin, TX8/13/2019Char onion over grill, never allow oil to smoke. 1, it's dangerous. 2, it's carcinogenic.AnonymousTexas6/26/2019I followed this recipe exactly and they turned out great! The refried beans were amazing just on their own. \n\nAfter trying the recipe filling we added some browned, chopped chorizo. We had it on hand and it worked out really well. \n\nThank you for this recipe and video. It was fabulous and I will be making it again and again. olgarieDenham Springs, LA6/24/2019sus pupusas son deliciosas!carmensadiego999Ecuador6/21/2019This is a seriously great recipe. So delicious!AnonymousNewark, NJ11/13/2017Explore Bon AppétitFlatbreadBreadSalvadoranCentral AmericanLatin AmericanMasaRice & GrainsStarterNut-FreeSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-05", "author": ["Condé Nast", "Rick Martinez"]}