{"id": "af8fb54d4417da4c4cf205ee17cabfcb", "url": "https://www.bonappetit.com/recipe/grilled-red-mullet-with-charred-onions-and-pine-nuts", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Grilled Fish with Charred Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssueGrilled Red Mullet with Charred Onions and Pine NutsBy Ignacio MattosApril 17, 20185.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe sweet and sour pine nut topping is a versatile garnish that can be used to top grilled vegetables, roast chicken, or a savory yogurt dip. For an over-the-top dinner menu, serve with arugula with Italian plums, Romano bean salad, paccheri with shellfish, grilled bistecca, and brioche au rhum. We said over-the-top.Ingredients8 servings¼cup extra-virgin olive oil, plus more⅓cup pine nuts4small onions, unpeeled¼cup drained capers¼cup raisins¼cup red wine vinegarKosher salt8whole red mullets or 4 red snappers, scales removed, cleaned1cup parsley leaves with tender stemsAleppo-style or other mild red pepper flakes and lemon wedges (for serving)PreparationStep 1Preheat oven to 350° and prepare a grill for medium-high heat. Clean grate well with a brush; oil grate. Toast pine nuts on a rimmed baking sheet, tossing once, until golden brown, about 5 minutes. Let cool (that’s it for the oven).Step 2Grill onions, turning occasionally, until skins are blackened and onions have softened (some of the juices may ooze out), 15–20 minutes. Transfer to a platter and let cool 10 minutes.Step 3Split onions in half. Remove outer peel and discard. Separate onion layers into individual petals. Transfer to a medium bowl and mix in pine nuts, capers, raisins, and vinegar; season agrodolce with salt.Step 4Season fish cavity and skin with salt; drizzle with ¼ cup oil. Grill, resisting the urge to turn, until skin is lightly charred and flesh is flaky and opaque down to the bone, about 3 minutes for mullet and 8 minutes for snapper. Place a metal spatula underneath fish, then lift and gently roll over onto the other side. Cook until flesh is flaky and opaque, 3–8 minutes, depending on fish. If a small knife slides easily through the thickest part of flesh, fish is done.Step 5Transfer fish to a platter and spoon agrodolce over. Top with parsley and some red pepper flakes; drizzle with oil. Serve with lemon wedges.How would you rate Grilled Red Mullet with Charred Onions and Pine Nuts?Leave a ReviewTell us what you thinkExplore Bon AppétitFishSeafoodPine NutNutSnapperMainDairy-FreeGluten-FreeHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}