{"id": "af927078365a3c3a30d65b1bae5b3724", "url": "https://www.bonappetit.com/story/slow-cooked-white-fish-recipe", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "This Halibut Recipe with Charred Cabbage Comes Together Faster Than You Think | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Slow-Cooked White Fish Recipe Comes Together Faster Than You ThinkSlow-cooked fish with grapefruit and... cabbage? It works, just trust us.By Jill BaughmanJanuary 8, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.Cooking a mild, white fish in the oven has always been my go-to healthyish quick dinner. It doesn't get much simpler than that. But I never waver from my usual process: Sprinkle the fish with whatever seasonings I've got, squeeze some fresh lemon juice over, add vegetables to the baking sheet, and let the oven do its thing. It's good and satisfying but, admittedly, pretty boring.Then I met this slow-cooked white fish with charred cabbage. Don't let the \"slow-cooked\" in the recipe name fool you: This dish takes under a half hour total, and it finally allowed me to break up my weeknight cooking routine.First, the fish. I used cod instead of halibut—keep in mind that this recipe will work with whatever mild fish you like. Zest a little grapefruit over the fillets (the flavor ties into the grapefruit slices you later plate the fish with), season with salt, then stick it all in the oven. We call this recipe slow-cooked because it takes a little longer to roast in a lower-temp oven (325º) than you're likely used to, but the difference is really only about 15 minutes longer of cooking time. Your patience results in a more tender, flakier texture for the fish. Alright, sweet, you're already halfway there.While the fish is roasting, it's time to take out the one skillet required to make this dinner. Once on the stove, you have to leave the cabbage completely untouched and undisturbed so it crisps up properly. It's hard to avoid the natural inclination to stir, but trust me, the cabbage doesn’t burn. You might think you’ve screwed it up, but you haven’t! The first time I did this, I stirred and tossed just a leeeeeettle bit because I thought it was browning too much too fast. But the cabbage didn't char enough, so into a leftover container it went. I tried again, this time actually walking away from the stove for a couple minutes. Finally, success! Those crispy bits are flavor game-changers when it comes to such a mild veggie and fish (and I can avoid my usual, unhealthyish cabbage-cooking method of drowning it in butter).The final component is cutting up that large, juicy grapefruit into slices (use the sharpest knife you've got!), then arranging the cabbage and slices on plates as artfully as possible. Cut the slow-cooked fish into chunks, transfer that to the plates, then top everything with some fresh mint and a good drizzle of oil. Yes, you can make a healthy, seven-ingredient (including salt, pepper, and oil) dinner in under a half hour. Bring it on, 2018!Get the recipe:Slow-Cooked White Fish with Charred CabbageSometimes with cooking, the best thing you can do is leave a thing alone. In this case, let the cabbage leaves sit and get charred around the edges before you even think about tossing them in the pan.View RecipeExplore Bon AppétitFishCabbageGrapefruitFeel Good Food PlanHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-08", "author": ["Condé Nast", "Jill Baughman"]}