{"id": "af9d89eb2f19fc3d37e79b9259b1979f", "url": "https://www.bonappetit.com/city-guides/copenhagen/venue/barr", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Barr Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogincopenhagenBarrA beer geek’s fantasy in Christianshavn, with crisp wafflesFacebookPinterestTwitterEmailPhoto by Ditte IsagerGO HERE: for an amazing food and beer experience—or if you prefer, beer and food experience—on the water. The Noma group has converted the old Noma space into a restaurant and bar serving dishes inspired by the “beer belt,” meaning the North Sea region, to go along with a super-geeky indie beer list.ORDER THE: pork schnitzel; hot-smoked mackerel; frikadeller (Danish meatballs); ribs for two; bone marrow; and pretty perfect waffles during weekend lunch. Even if you’re not up on your sours versus your lambics, you’ll enjoy the masterful food, which only pretends to be casual. (We doubt the Germans make their free-range pork schnitzel with anchovies.) If you can splurge, the four-course tasting menu with beer pairings is quite epic. Or just sit by the water and order from the 20-tap selection, which changes weekly. Whatever you do, don’t skip the bread.THE VIBE IS: sophisticated, international will-travel-for-food (and beer) crowd of all ages in the sleek wood-beamed main dining room. The 30-seat lounge area feels a little more just-wandered-in touristy, and you don’t have to make a reservation and you can get the full menu.PRACTICAL STUFF: Open for dinner every day, from 5 p.m. to midnight (the kitchen closes at 9:30 p.m., though) and lunch Friday to Sunday, from noon to 2 p.m.—Christine MuhlkePhoto by Ditte IsagerWE ALSO LOVE108Noma’s more casual spin-off in Christianshavn, with kombucha-shellacked pastriesBRUSHydrate, sort of, with 33 constantly changing taps from this Nørrebro suds stopRestaurant SchønnemannGet the OG Copenhagen experience at this Indre By *smørrebrød* destinationExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-18", "author": ["Christine Muhlke"]}