{"id": "af9fda2c6d3d65106cb76e2ea7cb953c", "url": "https://www.bonappetit.com/story/tofu-kimchi-stew", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "This Tofu Kimchi Soup Recipe is So Easy, I Have It Memorized | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Have This Tofu Kimchi Soup Recipe MemorizedDon't be so impressed: It's only 69 words. By Sasha LevineJanuary 10, 2020FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Wednesday at 7 p.m. is hard enough even when I do have an idea of what’s for dinner. And on nights when I don’t, panic strikes. And that’s when I turn to Tofu and Kimchi Stew.Spicy and soothing, all it asks of me is to slice some daikon, peel some ginger, and open a couple jars—namely, kimchi and gochujang—that bring the flavor when I don’t have the energy to.The whole recipe adds up to just 10 ingredients and 69 words of instruction, which is shorter than my weekly horoscope and definitely more favorable. Just heat some oil, add some scallions, ginger, and garlic, pour in the chicken broth (ideally homemade, but at least high-quality), whisk in gochujang and soy sauce, then add daikon, then the kimchi and tofu, simmer, aaaaaaand done.Of course, it’s so simple that it also makes a great base for your own spin. The recipe calls for firm silken tofu (tofu that hasn’t been pressed), but I always go for the softest stuff just because I love how its extra-creamy lusciousness adds a complementary texture to the mix. I’ve also worked in some glass noodles, topped my bowl with an egg yolk, and sprinkled over sesame seeds. These last-minute additions add almost no time at all.Whether you improvise with a few added touches or not, it comes together so quickly and easily that there’s really no excuse for takeout. (Try getting your pad see ew in under 30 minutes once that freezing snow-rain-ice slurry starts to fall.) Plus, it feels so good to slurp, with its elemental deliciousness, fermented wholesomeness, and nose-drip-inducing kick, that it never feels like a last resort (even if it is one).So while I can never quite predict when my no-dinner-plans panic will strike, I can breathe easier knowing I’ve got two flavor-packed ingredients  in my fridge and this two-stanza recipe memorized. Now if only I could also remember to call my grandmother...Get the recipe:Tofu and Kimchi StewIf gochujang hasn’t made it to your pantry yet, you can use any miso.View RecipeExplore Bon AppétitNever FailRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-10", "author": ["Condé Nast", "Sasha Levine"]}