{"id": "afa42619b3bc2e476b872b99258a1b04", "url": "https://www.bonappetit.com/story/sushi-rice", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Make Perfectly Seasoned Sushi Rice and Eat It With Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMake Perfectly Seasoned Sushi Rice and Eat It With EverythingWell-seasoned sushi rice is like rice in technicolor.By Chris MoroccoMay 29, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailI don’t order take-out sushi for the fish. Unless I'm spending a lot of money to eat at a phenomenal sushi restaurant, I eat it for the rice, which is perfectly seasoned with a mixture of salt, sugar, and rice vinegar. Silver Rice, a casual sushi spot in Brooklyn, gets me: They offer the revelatory option of ordering your sushi rolls in bowl form, similar to poke, which gets me my ideal ratio of rice-to-everything-else.Seasoned rice is like rice in technicolor: Rather that being a vessel for other ingredients and toppings, it has a flavor profile all its own. In fact, once you have a foundation of seasoned, clingy-yet-distinct rice, you can be pretty arbitrary about what goes on top. Suddenly a sliced avocado and a sprinkle of furikake or a couple of hard-boiled eggs feel like a full meal because that rice is just so satisfying. But because nobody is that fired up to look at a photo of a bowl of rice (well, I would be), I made a recipe for an easy glazed salmon to go on top. (But if you just make the rice I will of course understand.)There are a few things to note about the rice. 1) Rinse and drain the rice several times to remove excess starch that might prevent the grains from staying distinct once cooked; 2) Follow these measurements exactly, as the 1 ¼ cups of water we call for takes into account the water that will still be clinging to the grains of rice after rinsing and draining it; 3) Let the rice rest for 10 minutes before fluffing and seasoning it! This completes the cooking process by allowing the water to redistribute inside the pot which creates more uniformly cooked rice; 4) Every sushi restaurant seasons their rice slightly differently so feel free to tweak the proportions of your seasoned vinegar.The miso caramel-glazed salmon is a simple yet awesome update on teriyaki, made with equal parts maple syrup, miso, tamari, and rice vinegar. It is frankly one of my favorite recipes I've developed all year...or maybe ever. It’s delicious, but it could never compete with that rice.Get the recipe:Sushi Rice with Miso-Caramel Glazed SalmonThe tastiest rice is seasoned sushi rice.View RecipeExplore Bon AppétitHealthyishRiceFishRead MoreLifestyleThis Salsa Verde Is Our Desert-Island SauceBy Emily Fiffer and Heather Sperling Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Chris Morocco"]}