{"id": "afb2d090b8f990a48f86868bbb86a3f6", "url": "https://www.bonappetit.com/recipe/salad-ramen", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Salad Ramen Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSalad RamenBy Chris MoroccoJuly 12, 20194.3(16)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintWhen Brunette wine bar in upstate NY posted a photo of their hiyashi chuka and captioned it, “This ramen is basically a salad,” we were instantly hooked on the idea of what a cold noodle salad dish could be.Ingredients2 servings¼cup seasoned rice vinegar2Tbsp. extra-virgin olive oil2Tbsp. fresh lime juice2Tbsp. soy sauce1Tbsp. toasted sesame seeds½tsp. crushed red pepper flakes (preferably a seedless type, such as Aleppo-style or gochugaru)½tsp. toasted sesame oil10oz. fresh or 6 oz. dried ramen noodlesKosher salt2–3cups shredded or shaved vegetables, such as summer squash, radishes, carrots, scallions, cabbage, lettuce, and/or cucumbersPreparationStep 1Stir vinegar, oil, lime juice, soy sauce, sesame seeds, red pepper flakes, and sesame oil in a small bowl.Step 2Cook noodles in a medium pot of boiling salted water, stirring occasionally, until just al dente. Drain and rinse under cold water to stop the cooking. Transfer to a medium bowl, then toss with half of dressing.Step 3Divide noodles between bowls. Top with your choice of vegetables. Drizzle with remaining dressing.How would you rate Salad Ramen?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleOne of my favorite recipes (especially in the summer) and a great way to pack a ton of veggies into a meal. I make it about once a week and frequently top each bowl with some sliced grilled steak. CarolineWashington, DC12/29/2020Ignore the reviews that say this is too acidic. The dressing is great as written - only change was to add some grated fresh ginger.SpencerOakland, CA11/17/2020I used Hokkien egg noodles on this, not sure if this was the reason but the sauce didn't have any taste at all. I could taste a bit of vinegar but that was it. AnonymousSingapore8/28/2020My new favorite for a “cool” ramen fix. It’s light and so easy to add all the great veggies coming out of my Summer garden. I steamed some edamame as a side, but there are endless possibilities! k_sandeWest Linn, OR7/31/2020Was delicious with fried shrimp on top. I added a bit of salt and some honey to the dressing and found that punched it up quite a bit.AnonymousBrooklyn6/24/2020This recipe is really good! To make it more of a meal and balance out some of the intense acidity, we added 9 minute boiled eggs to ours. Be forewarned though, this noodle salad gave me/my boyfriend/my mom intense heartburn. Proceed with caution!ThoseFeratuSouthern California10/21/2019Chris Morocco, always out here with the intense acidity. I expected this from him so I tasted the dressing before throwing it on everything and then added a tsp. of mirin to sweeten it up (but I'm sure plain old sugar would do it.) Perfecto. Great with a miso egg.AnonymousAustin, TX9/6/2019I’m so sad to be leaving a not-so-good review! I was really excited to make this, and I doubled up the ramen and dressing so I could meal prep some lunches for the week. But now I couldn’t even finish my bowl, and I’m not sure if I want the lunches. The finished product looked beautiful but was very bitter. I wasn’t sure if it was too much rice vinegar, or maybe I was tasting the red cabbage too much? Either way, something was off that made this not delicious. I may try again with less rice vinegar, or maybe some brown sugar? Can someone else help with how to save this recipe?bexpocalypseRichmond VA8/12/2019This looks delicious! But what is the name of the vegetable on the far right?Anonymous8/8/2019Was very good, especially in all this heat!AnonymousConshohocken, PA7/23/2019Just everything I want to eat in 100 degree weather! Make it.Anonymous7/22/2019Explore Bon AppétitSaladRamen NoodleNoodlePasta & NoodlesSummer SquashSquashVegetableZucchiniRadishCarrotLettuceLeafy GreensCucumberCabbageSummerQuickEasyWeeknight MealsMainVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-12", "author": ["Condé Nast", "Chris Morocco"]}