{"id": "afbe89d3bd35ec2f8a6e64a158e34594", "url": "https://www.bonappetit.com/recipe/roasted-winter-squash-with-kale-pipian", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Roasted Winter Squash Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssueRoasted Winter Squash with Kale PipianBy Daniela Soto-InnesJanuary 8, 20193.6(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThis bright green style of mole is made by blending pumpkin seeds into a smooth paste (kind of like how pine nuts work in pesto). The oil in the seeds adds body and rich flavor to the sauce, which can also wake up other simply roasted vegetables such as sweet potatoes or carrots. If you can find it, try making this green sauce recipe with hoja santa, a robust aromatic Mexican herb—but any hardy green will work (we call for kale).Ingredients4 servings 1cup raw pumpkin seeds (pepitas), divided3lb. mixed winter squash pieces (such as 1\"-thick delicata rounds, 1\"-thick kabocha wedges, and/or quartered honeynut), seeds removed3Tbsp. extra-virgin olive oilKosher salt¼white onion, thinly sliced3garlic cloves, crushed8oz. tomatillos (about 4), husks removed, rinsed1small bunch Tuscan kale, ribs and stems removed, leaves torn2small serrano chilesFlaky sea saltCilantro leaves with tender stems and lime wedges (for serving)PreparationStep 1Preheat oven to 350°. Toast pumpkin seeds on a rimmed baking sheet until lightly browned, 6–8 minutes. Let cool.Step 2Increase oven temperature to 425°. Toss squash pieces and oil on another rimmed baking sheet to coat; season with kosher salt. Roast, tossing occasionally, until browned and tender, 30–40 minutes.Step 3Bring onion, garlic, tomatillos, and 2 cups water to a simmer in a large saucepan over medium-high. Cook until tomatillos are almost tender, about 5 minutes. Add kale and cook just until wilted and bright green, about 1 minute. Let onion mixture cool in pan until warm.Step 4Char chiles over the flame of a gas burner, turning occasionally, until blackened and slightly softened, about 1 minute (or, arrange chiles on a rimmed baking sheet and use broiler).Step 5Transfer onion mixture to a blender with a slotted spoon; reserve liquid. Add charred chiles and ¾ cup pumpkin seeds to blender and purée, adding reserved liquid as needed to get things moving, until a smooth, pourable sauce forms. Season pipian with kosher salt.Step 6Divide squash among plates. Drizzle with pipian and sprinkle with sea salt. Top with remaining ¼ cup pumpkin seeds and cilantro. Serve with lime wedges.How would you rate Roasted Winter Squash with Kale Pipian?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleWasn't crazy about it. The pesto ended up being a tasteless sludge. Wouldn't recommend.UntoldgloryHouston11/18/2019The kale pipian is great, this sauce could be a stand alone recipe. After making I had a decent amount leftover and will use to make a green egg scramble in the morning. Great flavor!Who me?Chicago1/17/2019I made this for my husband and I and we though it was great! the Kale Pipian sauce was so good I couldn't stop dipping chips in it.  I did only use 1 serrano pepper since my husband doesnt love spice and it only had a hint of spice. I served this over barley cooked in chicken stock to make it a more complete dinner. Next time I think I will add cauliflower or carrots to the roasted squash mixture to help cut down the sweetness a little.bethegalloway2052Sacramento, California1/14/2019Explore Bon AppétitPumpkin SeedSeedKaleLeafy GreensVegetableTomatilloDelicata SquashSquashKabocha SquashFallWinterSideDairy-FreeGluten-FreeVegetarianVeganHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Daniela Soto-Innes"]}