{"id": "afd8db4235cbb6146788d659493bbb8c", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/nata-de-cristiano-tokyo", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Nata de Cristiano Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoNata de CristianoAs close as you’ll get to Portugal without leaving Tokyo.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: for your newest sweet addiction. While there are a number of laudable international patisseries in Tokyo, none of those mammoths can compete with an operation that is scarcely bigger than the typical Tokyo apartment. Specializing in the pastries of Portugal, Nata de Cristiano makes some of the city’s most beloved treats. The pastel de nata (Portuguese egg tarts) are beautiful in form and, thanks to high-quality Japanese eggs, exceptionally rich. Their only fault is their irresistibility—which is all the more reason to order some extra.ORDER THE: pastel de nata. Buy as many as you think you can stand, then order at least one more than you estimated. They come in both mini and large sizes, but the large requires you to order a day in advance (either stop by the shop or give them a call). Grab a pao de lo for something more dramatic: What looks like a cottony sponge cake from the outside reveals a yolky center once you tear it open.THE VIBE IS: neighborhood bakery winnowed down to its bare essentials. The shop itself is only a window that opens onto the bakery, where pan after pan of pastel de nata are being constantly prepared and, other than a small bench outside the door, there is no seating. Take your haul of goodies to Yoyogi Park, where you can enjoy them at a leisurely pace.PRACTICAL STUFF: Open daily from 10:00 a.m. to 7:30 p.m. Yoyogi-Hachiman is the nearest subway station.Photo by Xavier Girard LachaîneThe \"shop\" is little more than a window opening onto the bakery.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}