{"id": "affbb667b6fea78e9b2ba1bb93a1da7d", "url": "https://www.bonappetit.com/story/soy-curls", "year": 2019.0, "month": 6.0, "day": 1.0, "content": "Soy Curls Are the Single-Ingredient Meat Substitute I Buy in Bulk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleSoy Curls Are the Single-Ingredient Meat Substitute I Buy in BulkStep aside Fakin' Bacon and tofu dogs: Soy curls are my go-to meat substitute.By Sarah JampelJune 4, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailBeing a vegetarian doesn't mean subsisting on steamed broccoli and bowls of pasta. In her monthly column, nearly lifelong vegetarian Sarah Jampel will tackle cooking, eating, and navigating the world meat-free—even when her grandma still doesn't know what she makes for dinner.It’s easier to talk about fake meat in terms of what it isn’t (um, meat) than what it is (um, I’m not sure). I couldn’t tell you how seitan is made (or the appropriate way to pronounce it), but I can tell you that I’ve always been equally intrigued and put-off by things like “chicken” fingers, fake bacon, tofu dogs. Yes, the concept of an easy-to-prepare vegetarian meat stand-in is appealing, but I usually end up wondering whether these highly processed, heavily packaged imitations are worth their convenience.And yet sometimes I want a vegetarian protein that doesn’t need to be pressed or pan-fried to taste its best. Sometimes I want a vegetarian alt for ground meat that will be ready in a matter of minutes. And sometimes, dear God, all I want is to recreate my favorite order from Claire’s Corner Copia in New Haven, CT: Caesar salad with buffalo soy chicken strips.And that, my friends, is where Butler Foods’ soy curls come in. I first learned about soy curls from vegan cookbook author Gena Hamshaw. Rich in fiber and protein, soy curls are made of non-GMO soybeans that are processed without chemicals and packaged with neither additives nor preservatives…and they taste kind of like chicken! Unlike TVP (textured vegetable protein), which is made by pressure-cooking and drying defatted soybean flour, these curls are made from the whole beans and thus contain all of their fiber and protein.They come dehydrated, resembling desiccated mushroom stems. But after a 10-minute soak—even better if it’s in a flavorful liquid, like broth or dashi—the curls plump up into squidgy strands. Just gently squeeze out any excess liquid before cooking. I like to sauté them in a hot pan with spiced olive oil (smoked paprika, garam masala, vadouvan, or za'atar) so that they get crispy and golden-brown on the outside but remain chewy and buttery within. I’ll put them on top of a salad, tuck them into a sandwich or wrap, or just eat them on their own. Soy curls can be the foundation of a stir-fry or, if you chop them up finely after they’re soaked, larb. And—this sentence is going to sound like a parody—I can’t wait to put soy curls in my spicy lettuce wraps this summer. (Need more ideas? Browse the 900+ Amazon reviews!)The one downside with soy curls is that they’re not so easy to track down: Only a handful of stores in most states carry them. But you can order them online (and, if you’re like me, you can order three—or even six!—bags at a time). If you’re a vegetarian who’s been waiting years for a meat-free product to turn into buffalo “chicken” that’s also made of ingredients you can pronounce, a few days of waiting will feel like nothing. After all, there’s a lifetime of soy curl enjoyment in your future.Buy it: Butler Foods Soy Curls, $7 for 8 ouncesAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitThe Not Depressing VegetariansoybeanVegetarianHealthyishSoyShoppingRead MoreLifestyleMarinated Lentils Are Saving My Vegetarian, Protein-Craving SoulBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-04", "author": ["Condé Nast", "Sarah Jampel"]}