{"id": "b0029b6ee7ec05688dfe7a4ea6c0bb7e", "url": "https://www.bonappetit.com/recipe/every-night-salad-with-yogurt-ranch", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Every Night Salad with Yogurt Ranch Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesEvery Night Salad with Yogurt RanchBy Lauren SchaeferOctober 28, 20184.7(18)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintWhy \"Every Night\"? Because there are so many times when all you need to round out a weeknight dinner is a simple green salad—and you can do a lot better than some sad mesclun mix and gloopy bottled dressing. This crunchy romaine number, drizzled with a creamy, craveable yogurt-based homemade ranch dressing, is the kind of salad that goes with just about anything, from delivery pizza to pan-seared pork chops. Make it once, and you probably won't even need a recipe the second time around (or the third, or the forth)—that's how easy it is. Oh, and fun fact: Contrary to popular belief, romaine is actually good for you. One more reason to keep this crowd pleaser in heavy rotation.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMicroplane$16 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAWhisk$10 At AmazonSmall Skillet$40 At AmazonLarge Bowl$18 At AmazonIngredients4 servings1garlic clove2lemons½cup plain full-fat yogurt¼cup mayonnaise2dashes hot sauce½tsp. kosher salt, plus more½tsp. freshly ground black pepper, plus moreA small handful of mixed herbs, such as dill, basil, cilantro, and/or parsley¼cup roasted, salted almonds1head of romaine or 2 romaine hearts2Tbsp. extra-virgin olive oilPreparationStep 1Peel 1 garlic clove and use a Microplane to finely grate into a medium bowl. If we're putting garlic into a dressing, we're almost always going to grate it. It's faster and easier than mincing by hand, and ensures that the garlic flavor is evenly dispersed.Step 2Slice 4 sides off 2 lemons. Cutting the lemons this way makes it easy to remove the seeds, and creates easy-to-squeeze \"cheeks.\" Squeeze juice from 1 lemon into bowl with garlic. Set remaining cheeks aside.Step 3Add ½ cup yogurt, ¼ cup mayonnaise, 2 dashes hot sauce, ½ tsp. salt, and ½ tsp. pepper and whisk to combine. Give the dressing a taste and add more salt and pepper if necessary—it should be plenty punchy.Step 4Remove leaves from any tough stems from handful of herbs. (You can use whatever soft herbs you have lying around for this, alone or in combination, but the dressing will taste great even without them.) Finely chop leaves, then stir into yogurt mixture.Step 5Crush ¼ cup roasted, salted almonds with the bottom of a small pot or pan. You can certainly toast raw almonds yourself if you want some extra credit, but using ready-to-go nuts is a good option if you don't feel like turning on the oven. Don't like almonds? Any nut or seed will work great here, too.Step 6Cut off bottom of 1 head of romaine and let leaves fall from core; discard any leaves that are tough, leathery, or wilty. Continue cutting from the bottom, removing leaves as they fall.Step 7Once you have removed all the leaves, slice larger leaves in half and leave smaller ones whole. (If your leaves are dirty or gritty, this is a good time to give them a wash—just remember to dry them off as thoroughly as possible afterward.) Transfer to a large bowl.Step 8Squeeze reserved lemon cheeks over lettuce and toss gently to coat. (We always dress with acid—think citrus or vinegar—before adding any oil, otherwise it will slide right off.) Add 2 Tbsp. oil and a generous pinch of salt; toss again to coat. If it seems like you're dressing this salad twice, well, you are! This ensures that each leaf of lettuce is properly seasoned before that creamy ranch gets drizzled on—a pro move whenever you're dressing a salad.Step 9Arrange half of lettuce mixture on a platter. Spoon dressing over, then repeat with remaining lettuce and dressing. Top with almonds; season with plenty of pepper. Repeat every night from now on.How would you rate Every Night Salad with Yogurt Ranch?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleThank you for giving me an alternative to bottled ranch dressing!  This is great.Gayla MarieFort Collins, Colorado7/4/2021I always try to follow the recipes the first time and then make adjustments. I was going to cut down on the lemons per the other reviews, but had small lemons so did use both. Worked out fine. The dressing needed more than 2 shakes of hot sauce, IMHO. I loved this salad, but something seemed to be missing so added chunks of feta. Next time will add chicken or salmon for a full meal. Yum!Hilo GirlSan Francisco, CA, United States4/16/2021I am not a fan of microplaning the garlic as by the time you are through most of the garlic is stuck in the microplane and your hands smell of garlic so strongly that you have to be careful what other food you touch.  Soap and lemon did not do the trick.  I'm going to stick with the plebeian garlic press from now on.  The dressing, however, is delicious though I did follow others comments and used only half a lemon and added a couple shakes of dried dill along with the other fresh herbs.Humboldt BabsCalifornia4/8/2021Am not sure why this recipe is so highly rated.  Way too acidic with so much lemon and yogurt. AnonymousCanada6/14/2020Used this just for the dressing portion... skipped the hot sauce and added a fresh jalapeno and a handful of cilantro instead. Tossed it all in the food processor (lazy) - it's outstanding.  And so easy.  No idea why I ever bought ranch. AnonymousRochester,  NY6/9/2019YUM. I used just chives because my other herbs ended up looking sad. The dressing was not sad regardless.AnonymousDallas, Texas5/1/2019Love this! Great with romaine or little gem but also for dipping carrots (or pizza crusts!). AnonymousLondon, England12/2/2018Surprised that, with the Nation Wide Recall on Romain Lettuce, you would post/publish this recipe!ddowning0691Ontario, Canada 11/25/2018Loved it!brittleConcord MA11/13/2018Can’t have ranch without chives imo Tx 11/11/2018This is pretty good and simple. Easily memorized. Taught me how to make a simple ranch dressing. Anonymous11/2/2018Made this last night. I used non-fat Greek yogurt and my herbs were Parsley and Thyme. I'm in love!!! The bitey garlic with lemon and savory almonds and crunchy lettuce is perfect. \"Every Night\" is right! Excited to keep adding roasted almonds to my salads - I would have never thought of that. One caveat - don't underestimate saltiness of almonds when salting (both) dressings. Great recipe!! AnonymousDetroit, Michigan10/31/2018Explore Bon AppétitSaladRomaineLettuceLeafy GreensVegetableYogurtOther IngredientsEasyWeeknight MealsSideVegetarianGluten-FreeKetoDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-28", "author": ["Condé Nast", "Lauren Schaefer"]}