{"id": "b0133d31a4015b40fcf6cb558fcda6d9", "url": "https://www.bonappetit.com/story/tricia-hersey-patrick", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "‘Nap Bishop’ Tricia Hersey Is Spreading the Gospel of Rest | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle‘Nap Bishop’ Tricia Hersey Is Spreading the Gospel of RestWe talk to her about burnout culture, self care vs. soul care, and the best place to nap in public.By Melissa Pandika April 4, 2019FacebookTwitterEmailFacebookTwitterEmailIn Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Next up is Tricia Hersey, a performance artist, poet and founder of the Nap Ministry, an interactive project focused on rest as resistance.Anne Helen Petersen’s Buzzfeed essay, “How Millennials Became the Burnout Generation,” published earlier this year, has spurred a national conversation about burnout culture. But as many pieces written in response to Petersen’s essay point out, the experience she describes isn’t universal. Burnout culture disproportionately harms people of color, especially Black Americans.Tricia Hersey is the founder of the Nap Ministry, an organization that advocates for rest as a form of resistance against burnout culture and capitalism more broadly. Black Americans “have never really had our place in capitalism,” other than as its engine, since slavery, Hersey says. Indeed, systemic racism has locked generations of Black Americans out of the wealth promised by capitalism. Plus, burnout culture, which glorifies sleep deprivation, can take a major toll on their health. A 2015 study found that, compared to white participants, Black participants were five times more likely to sleep less than six hours a night. Poor sleep has been associated with diabetes, heart disease and other conditions that affect Black Americans at higher rates.As the “Nap Bishop,” Hersey, based in Atlanta, hosts collective napping experiences, which bring people together to nap for 30 to 40 minutes. She also gives workshops on how to resist burnout culture (even if you can’t squeeze in a nap) and has performed a one-woman show featuring herself sleeping on a bed. The Nap Ministry’s Instagram account, where she posts quotes like “Your worth is not tied to your productivity,” and “Naps are not lazy” has garnered nearly 20,000 followers. We talked to Hersey about soul care, her favorite nap spots, and the old school R&B album she has on repeat.Self-care is important, but.... I’m really interested in soul care, which takes a deeper view of yourself as a human being worthy of self-care. The care comes from you, not from a massage therapist or getting your nails done. We’re often quicker to buy an expensive spa product than we are to take a nap—but what has gotten into our souls that we don’t think we’re worthy of sleep?  You can’t even get to self-care until you can look at what’s happening on a soul level.The Black community in particular needs rest because… of the weathering of Black bodies from just living and trying to survive, and at the same time experiencing microaggressions every day. If anyone should be sleeping, it’s Black people, when you consider how our ancestors built this country with their free labor and no rest. Reparations don’t have to look like a check; they can come in the form of rest. Rest is a healing portal into a space where things can be different, a place that’s sacred for you where you don’t have to deal with microaggressions.I nap… on my couch for 30 to 45 minutes between 2:00 and 3:00 p.m. My sister makes me these beautiful, warm crochet blankets. It feels like they have sleep magic in them. I fall asleep under them all the time. I also love herbal teas. My friend crafted a beautiful tea for the Nap Ministry that has mugwort and chamomile, which can help you to relax. On days I can’t nap, I love to close my eyes and zone out. I do a lot of daydreaming, which is like a mini-nap.I love napping in…  libraries. There’s some type of anointed spirit of sleep in the library—the quiet, the books. I like sleeping outdoors too, like on picnics or camping trips.My dream is for the Nap Ministry to… become a global movement. I would love to have my own nap temple, a huge space where people can come nap, and train people as nap ministers. I can teach people around the country theories around rest and how to host their own napping events, and help them be ordained in this whole practice.I can’t stop watching… The Real Housewives of New York City. There’s something about those New York uptown women. They are out of control! Because I’m reading slave narratives all day, I love my little trash TV. But The Real Housewives of Atlanta is my favorite because it’s Black women, it’s Black-centric and it’s here in town.Besides napping, my favorite wellness ritual is… taking baths. I feel like there’s something somatic that’s happening in the water that heals. I have this 30-pound container of pink Himalayan Epsom salt that helps relax your muscles. I also make my own bath salts with Epsom salt, baking soda and essential oils. I love orange and tangerine essential oils if I need a pick-me-up, lavender and rosemary if I need to calm down. I set out candles and crystals and a Bluetooth speaker to play the Nap Ministry Spotify playlist.Right now, I’m listening to…old school Chicago rap music, like Twista, Do or Die,  Soldierz At War. (I’m from Chicago.) I’m also really into trap music. I love the bass and how it hits a spot in your body that feels very ancestral. I also love old-school R&B. My husband wants to kick me out of the house because I will not stop playing Usher’s Confessions.The book I cannot put down is… Citizen: An American Lyric by Claudia Rankine. It’s poetry but also a mediation on race in America. She talks about these different interactions that happen with Black people—micro-aggressions and also bigger aggressions, like murder and police violence. It’s almost like she’s just a citizen who is doing this ethnography work and watching what’s happening in America around race. The poetry is unique in that it isn’t straight and linear but more like these dreamy, meditative responses to things that have happened to her.Besides napping, I rest by… having really set boundaries and being able to say “no.” If you open up my calendar, you’ll see I don’t play. I’m in there with a knife. I only say “yes” to things I’m really passionate about. I don’t schedule back-to-back meetings. I don’t rush to return emails. I push back against the fast, fast, fast mentality. It’s really hard because people want you to work at their pace. I’m trying to retrain people and let them know if they want to work with me, this is the pace we’re going at.Explore Bon AppétitHealthyishPerson of InterestInterviewsRead MoreLifestyleClaire Fitzsimmons Is the Sexual Wellness Guide We Didn’t Know We NeededBy Anya TchoupakovRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Melissa Pandika"]}