{"id": "b0248474364582d7c3ff890cae5ab3fc", "url": "https://www.bonappetit.com/story/mushroom-larb", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Lettuce Wraps with Mushroom Larb Are a Gift From the Weeknight Dinner Gods | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMushroom Larb Is Truly a Gift From the Weeknight Dinner GodsThis larb was love at first sight.By Molly BazJanuary 9, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiFacebookTwitterEmailThere are a few things I know for certain about myself: I love Caesar salad, I love shrimp cocktail and I really love letoose wraps. I make some version of a lettuce wrap situation at least once a week because a) they are infinitely riffable b) they’re supes dupe quick and c) I eat A LOT at work so the meal I wish to come home to generally leans on the lighter side. More often than not I find myself zhuzh-ing up some sort of quick-cooking weeknight protein (think rotisserie chicken, flank steak, ground pork) and serving it alongside lots of crunchy things, spicy things, pickle-y things and herby things, and a big stack of lettuces, and calling it dinner.Then, one day, this Mushroom Larb recipe came along by way of our beloved Andy Baraghani, and things changed. He opened my mind to the notion of a non-protein element taking center stage in the letoose wraps. This recipe was vegetarian and OWNING it (okay, except for the fish sauce, but you can skip it if you really want). Don’t get me wrong, I love a traditional meat-based larb, but this one is special in a very different way. The shiitake mushrooms, which get treated to a deep charring in a cast iron skillet, are the perfect vehicle for soaking up tons of sour, spicy, salty ingredients and therefore a premium choice for veg-larb. Their sponge-like quality allows for maximum flavor once the garlic, ginger, fish sauce, chiles, and herbs hit the pan.The recipe comes together in under fifteen minutes, which I think you’ll agree is a major plus. The mushroom mixture gets wrapped up in the crunchiest of crunchy cabbage cups, and what you’ve just made, folks, is a damn good and stupid simple dinner. Want to add a little extra heft? Make a pot of rice and serve that alongside the larb and the cabbage. And don’t forget the squeeze of lime.Larb is life:Spicy Mushroom LarbDon’t even think about tossing, stirring, or shaking that pan until the mushrooms are golden brown and crisp.View RecipeExplore Bon AppétitHealthyishVegetarianCabbageDinnerMushroomRead MorecookingThese Curried Tofu Collard Wraps Are My Summer AnthemBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-09", "author": ["Condé Nast", "Molly Baz"]}