{"id": "b0290ac875fdb2b85beede2753337ec9", "url": "https://www.bonappetit.com/story/what-is-tteok", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "Tteok (Korean Rice Cakes) Deserve a Permanent Spot in Your Freezer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Freezer Isn’t Complete Without an XL Bag of TteokDelightfully, incomparably chewy, Korean rice cakes deserve a permanent spot in your kitchen.By Kendra VaculinJanuary 10, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowellFacebookTwitterEmailFinding a bag of tteok in my freezer on an uninspiring weeknight is like stumbling upon an oasis in the middle of the desert. I have, on more than one occasion, actually squealed upon discovering it there, tucked behind a pint of ice cream and bag of green peas. This is because tteok is a fast track to comfort food, a ticket to a bowl of something satisfying no matter what direction you take it. Crispy and crunchy? Saucy and braise-y? Smothered with cheese? Tteok can do it all, and without it, my freezer feels incomplete.For more about the versatile ingredient, how it’s made, and ideas for using it at home, read on:What is tteok?Featured in sweet and savory dishes alike, tteok—or Korean rice cakes—are made from rice that’s steamed and pounded to create a distinctively chewy texture. Traditionally, the pounded mixture was rolled into long logs and cut into bite-size pieces, but now most commercially available tteok is extruded from a machine as long cylinders. Those cylinders are cut into chubby pieces, sliced thinly on a diagonal, or twisted into a cocoon shape that looks like two little balls stuck together.While tteok’s varied shapes make them a fun addition to soups, stews, and stir-fries, it’s the rice cakes’ texture that sets them apart. “It’s a specific chewiness that is different from anything else,” says Jenny Kwak, chef and owner of Haenyeo in Brooklyn’s Park Slope neighborhood. The elastic bounce that comes with every bite, even when the outside is crisped to a golden brown crunch, is what keeps people coming back for more.Tteok are right at home among the chicken, cabbage, and sweet potatoes in this dakgalbi.\nPhoto by Laura Murray, Food Styling by Micah MortonI’m sold! Where can I get it?Tteok is available both fresh or frozen, though the fresh variety is more difficult to find. If you can source the rice cakes fresh (usually from a well-stocked Asian market), Susan Kim, the chef behind Doshi, says they have next-level sponginess and chew. “In Korea, there are fresh tteok stores, almost like bakeries. Whenever I go to visit my parents, I pick up fresh tteok; you don’t even need to apply any heat, it’s just like a piece of bread you eat fresh. But it’s a perishable product in the sense that you should really enjoy it that day.”Frozen tteok, on the other hand, is often sold in vacuum-sealed bags and will stay good for months in your freezer. This makes it a valuable kitchen staple, and one worth keeping on hand at all times. Do note, however, that “many months” does not mean “forever.” Jennifer Kim, the chef at the now-closed Passerotto in the Andersonville neighborhood of Chicago, warns that if you keep tteok in the freezer for too long they can dry out and deteriorate. “Look for feathering and cracks along the edges—this means they’ll break apart when cooked.”How should I cook it?While fresh tteok can be eaten out of hand with little to no preparation (Susan Kim likes the bouncy pieces simply dipped in a mixture of honey and soy), frozen tteok needs heat and liquid to bring it to its full chewiness potential. Depending on the way you plan to use your tteok and how long you have before you want to eat, prep can differ slightly, but it always hinges on rehydrating the individual pieces.Susan Kim likens the rehydrating process of frozen tteok to soaking beans in room temperature water overnight before boiling. “After you soak it, it doesn’t appear any different, it just looks like it's still submerged in water,” she says. “But soaking tteok before using it does make a difference in terms of overall consistency and chewiness all the way to the core. Overnight if you can, half a day—even just an hour will make a difference.” From there, you need only drain and pat your tteok dry before tossing it into a hot pan with oil for crispy bites or directly into a sauce, soup, or stew to finish cooking.Thin rice cakes are ideal for stir-fries—flatter surfaces = more crisping.\nPhotographs by Laura Murray, food styling by Susie TheodorouTo get each piece to a softer, more elastic place in less time, you can skip the long hydration period and boil your tteok in water directly from frozen. Cook times will differ based on the size and shape of your tteok, but in general, you’ll boil them just until they float to the top of the pot like gnocchi, which should take about three minutes. While this process is much faster, what you make up for in efficiency you might lose in flavor: Taking the time to rehydrate the tteok and then “cook” it directly in the sauce or broth (rather than boiling it), gives each piece the opportunity to take on the flavor of the liquid surrounding it.According to Susan Kim, tteok’s texture only improves the longer it spends in a sauce of stew, much like a braise that is better after it rests. “I’ve noticed that the next day, the texture of the tteok changes in a way that I think is truly delicious. It will still be completely structurally intact, but the chewiness and the give of it changes. It’s almost as if the rehydration process continues as it’s submerged in the liquid.”How is tteok traditionally used?Tteok is added to soups, stews, and stir-fries, it’s crisped up as a snack or side dish, and it’s the star ingredient of tteokbokki, a spicy, saucy, simmered dish that’s sometimes served with boiled eggs or fish cakes. Variations on the classic tteokbokki include gravy-style curry bases, soy and garlic versions without the gochujang and gochugaru, and the recently popular rose tteokbokki, in which cream turns the sauce pink.Along with tteok, this tteokbokki contains another freezer aisle delight: fish cakes!\nPhoto by Chelsie Craig, food styling by Kat BoytsovaTteok can also be made into sweet applications, especially for children. Kwak describes dessert versions as “sautéed in sesame oil and sprinkled with a little sugar—it’s crispy, chewy, and soft inside, and kids love it. Or you can cover it with honey, maple syrup, or a sweet red bean sauce.”How else can I cook with tteok?“Tteok is such an essential part of Korean food, but it can really be used whenever we think of an ingredient as a vehicle, in anything rice- or pasta-based,” says Jennifer Kim. The “most popular dish on the menu by far” at Passerotto was the tteok lamb ragu, a play on traditional tteokbokki that featured lamb necks braised in an Italian-style sauce and plenty of shaved cheese. Meaty pasta sauces, cheese sauces, and even pestos play well with tteok, which makes a useful pasta alternative because it’s naturally gluten-free (though some store-bought varieties do contain wheat starch, so be sure to check the ingredients list). It’s “just another reason why people [who didn’t grow up with it] might start to cook tteok more often at home,” Kwak says. Plus, she notes, “Asian people like the chew in food. We’re not so into things that melt in your mouth, that’s a very Western thing. So the fact that tteok is a different texture to introduce to non-Korean dishes, that’s great. That’s what makes it interesting.”To play up a combination of textures—namely, a crispy exterior and tender interior—Kim recommends treating tteok like gnocchi, giving it “a hard sear in a cast-iron pan so it gets a crust on the outside but stays really chewy on the inside” before tossing it in sauce. Susan Kim employs a similar move in her Crispy Rice Cakes With Halloumi Cheese and Gochujang Brown Butter, a hit dish at her Doshi pop-ups, and one that also highlights the beloved pairing of tteok and cheese. “Halloumi, like tteok, totally changes texture when you cook it. I liked that people wouldn’t necessarily know if they were picking up a piece of crispy tteok or crispy cheese.” At Haenyeo, Kwak uses tteok in a Mexican application, with saucy and cheesy elements that mirror traditional Korean preparations but with a different flavor profile. The dish is a smoky, spicy fundido with chorizo, which gets a Korean twist from gochujang-spiked sauce and the chewy pieces of tteok hidden under the thick top layer of melted cheese. But in the world of tteok experimentation, she’s open to pushing the chewy, chubby bites to the limits. “You can even toast it and wrap it in bacon!” she says. “That’s an idea from a middle schooler, my friend’s son, who’s obsessed with tteok.”There’s really no limit to what tteok can be once you have it in your kitchen and incorporate it into your cooking, Susan Kim agrees. “I think it's one of those things that keeps evolving because the ingredient itself is so versatile.”Get the recipe!Crispy Rice Cakes With Halloumi Cheese and Gochujang Brown ButterToasty griddled Korean rice cakes, melty cheese, and a spicy, nutty brown butter–gochujang sauce come together in this truly decadent snack.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-10", "author": ["Condé Nast", "Kendra Vaculin"]}