{"id": "b0328bea23763195e3f92fbf30ab22ab", "url": "https://www.bonappetit.com/story/cacio-e-pepe-with-corn", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "Kid-Friendly Cacio e Pepe With Corn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor a Kid-Friendly Cacio e Pepe, Just Add CornIn search of an alternative to the mac and cheese her kids insist on, Deb Perelman finds inspiration in an iconic Italian dish.By Deb PerelmanMay 29, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Sue LiFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.Before we had kids, I implicitly understood the value of having pantry-staple recipes in my repertoire. But it wasn’t until we increased our family’s size that I realized how critical these miracle dishes would become. The instances when my husband and I were too busy or exhausted to cook grew exponentially, and the idea of leisurely simmering a pot of Bolognese while sipping wine on a weeknight became downright laughable.Cacio e pepe, the three-ingredient Roman dish that could be described as a funky grown-up mac and cheese, should be a slam dunk in the realm of pantry recipes. But upon returning home from a vacation to Rome a few years ago, figuring out how to re-create it was harder than I expected. Whisking hot pasta cooking water into a mixture of grated cheese and black pepper is supposed to form a smooth, glossy sauce—but the cheese always seems to clump up and stick to everything but the noodles. After dozens of unsuccessful attempts, I found a resolution in a virtually foolproof technique from the chef at the restaurant Flavio al Velavevodetto in Rome. Making a paste of cheese and cold water ensures a silky mixture that evenly coats the just-cooked spaghetti every time.Persuading kids who would rather eat buttered noodles or straight-up macaroni and cheese to try a sharp and peppery pasta was another hurdle. Reducing the black pepper helped, but it was a spur-of-the-moment ingredient that inducted them into the cacio e pepe fan club last summer. Since corn is one of their favorite vegetables, I added quickly blanched kernels to the pasta itself, and this combination hit the dinner jackpot. The sweet corn mellowed out the strong flavors of the sauce just enough that the kids were obsessed with it. And because it has so few ingredients, this adult can’t stop gushing about it either.Get the recipe:Corn Cacio e PepeIn search of an alternative to the mac and cheese her kids insist on, Deb Perelman found inspiration in an iconic Italian dish.View RecipeExplore Bon AppétitKid-FriendlyWeeknightCornPastaPicky Eaters’ ClubRead MorecookingMake This Strawberry-Granola Crisp for Mother’s DayBy Deb PerelmancookingA Cheesy, Bready Dinner to Please the Pickiest Eaters in Your HouseholdBy Deb PerelmancookingThis Garlic Bread Is the Secret to Converting Bean HatersBy Deb PerelmancookingNo Picky Eater Wants to Eat Broccoli—Until You Add KetchupBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-29", "author": ["Condé Nast", "Deb Perelman"]}