{"id": "b03c07f0aa42b725d6785b933e01237b", "url": "https://www.bonappetit.com/recipe/cold-roast-lamb-with-marinated-eggplant", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Cold Roast Lamb with Eggplant Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueCold Roast Lamb with Marinated EggplantBy Anna StockwellJuly 10, 20181.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintPop the garlic-and-rosemary-rubbed leg of lamb and the eggplant spears into the oven together for this dinner-served-cold recipe and they’ll be done at the same time.Ingredients8–10 servings8garlic cloves3Tbsp. coarsely chopped rosemary1Tbsp. cumin seeds2Tbsp. kosher salt, plus more1cup extra-virgin olive oil, divided, plus more for drizzling15–6-lb. boneless leg of lamb, tied12small Italian eggplants (5–6 lb.)Freshly ground black pepper12shallots, peeledMaster Vegetable Marinade1½cups parsley leaves with tender stemsFlaky sea saltLemony Yogurt Sauce and/or Grilled Serrano Salsa Verde (for serving)PreparationStep 1Pulse garlic, rosemary, cumin seeds, and 2 Tbsp. kosher salt in a food processor until finely chopped. Pour in ¼ cup oil and pulse again until a paste forms. Place lamb on a rimmed baking sheet and rub paste all over, pushing some inside layers of meat. Let sit at room temperature 1 hour.Step 2Place racks in upper and lower thirds of oven; preheat to 300°. Slice eggplants in half lengthwise, then slice each half lengthwise into thirds. Working in batches and using ½ cup oil total, place a few eggplant spears in a large bowl and drizzle with some oil. Toss, gently massaging each piece to coat; season with kosher salt and pepper. (Because eggplants are very porous when raw, working with a few pieces at a time makes it easier to control where the oil ends up.) Transfer to another rimmed baking sheet.Step 3Toss shallots and ¼ cup oil in the bowl you just used for the eggplants, then spoon over eggplants. Cover baking sheet with foil, sealing tightly.Step 4Place baking sheet with eggplant mixture on bottom rack of oven and baking sheet with lamb on top rack. Roast until an instant-read thermometer inserted into the thickest part of lamb (avoiding gaps) registers 140° for medium, about 90 minutes (start checking after 1 hour). Remove lamb from oven and tent with foil. Let cool about 20 minutes.Step 5Meanwhile, remove eggplant mixture from oven, uncover, and toss with a spatula. Increase oven temperature to 500°and immediately place eggplant mixture on top rack. Roast, tossing halfway through, until nicely browned and very tender, about 20 minutes. Let cool.Step 6Remove foil from lamb and roast on top rack until brown and crisp, about 8 minutes. Let cool.Step 7Once eggplant mixture is cool, toss in a large bowl with Master Vegetable Marinade, cover, and let sit at room temperature at least 1 hour.Step 8Just before serving, toss parsley into eggplant mixture and transfer to a platter. Slice lamb ¼\" thick; arrange on another platter. Drizzle lamb generously with oil and sprinkle with sea salt. Serve with Lemony Yogurt Sauce and/or Grilled Serrano Salsa Verde alongside.Step 9Do Ahead: Lamb can be seasoned 12 hours ahead; cover and chill. Let sit at room temperature 45 minutes before roasting. Lamb can be roasted and eggplant mixture can be marinated 1 day ahead; cover and chill separately. About 1 hour before serving, remove lamb and eggplant mixture from the fridge and let sit at room temperature to warm up a bit.How would you rate Cold Roast Lamb with Marinated Eggplant?Leave a ReviewTell us what you thinkExplore Bon AppétitMediterraneanLeg Of LambLambMeatEggplantVegetableSummerEasyMainDairy-FreeGluten-FreeNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Anna Stockwell"]}