{"id": "b0441b0e64c0d0988e1cbc3614a841ba", "url": "https://www.bonappetit.com/story/healthyish-guide-to-being-alone", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "The Healthyish Guide to Being Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersLifestyleThe Healthyish Guide to Being AloneBecause we're all in this together, whether we're together or apart. By Amanda ShapiroMay 5, 2020FacebookTwitterEmailIllustration by Sofie BirkinFacebookTwitterEmailWelcome to the Healthyish Guide to Being Alone, a month-long series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone. Check out the latest entries right below this letter from our editor.Healthyish friends,Before we were shot into a pandemic-themed pinball machine, before we were careening around in a reality we don’t understand and can’t seem to control, I wanted to make a guide to being single.It was going to be about the joys of eating alone at your favorite restaurant. What to make for dinner on the third date. The best solo vacations we’ve ever taken. It was going to be light-hearted and fun.Then came the pinball machine. Now there are no restaurants to eat at, alone or otherwise. Third dates are postponed indefinitely along with all the other dates. In a lot of ways, a guide to being single has become irrelevant. And yet, as we transition to what everyone keeps calling “the new normal” (No! I keep thinking. Nothing about this will ever be normal!) I’ve noticed that all of us, single and otherwise, are figuring out how to be alone.I’m fielding overwhelmed texts from friends shacked up with roommates and in-laws. Children are flying across my co-workers’ Zoom screens. A person I went on one date with before all this is in a cabin with his ex in the Adirondacks (true story). And plenty of us are reckoning with true isolation for the first time, our houseplants quickly becoming our closest friends.I’m in that last category, and, in case you were curious, I’ve named my plants after the seven dwarves. (I’m Snow White, obviously.) When I moved into my own apartment a year ago, it was the first time I’d lived alone, no roommates and no partner. I was in the midst of a very different sort of crisis then—it was stressful and sad, and there was some scary health stuff too, but it was personal, not global. It was probably the most challenging period of my life to date, but I never felt alone. I had friends here almost every night, family visiting, soon enough I was dating again. I told everyone how much I loved living by myself in New York, that it was a childhood dream, and it was all true.This time around, the health crisis is everywhere. The stress is everywhere too, and so is the grief. So instead of a guide to being single, this is a month-long series about being alone, and it’s for everyone. Throughout April, we’ll run stories, recipes, and advice that will hopefully help you find some mental solace, whatever your living situation might be. We’re turning everyone’s favorite Healthyish Instagram segment, 30 Seconds With Andy, into an advice column. We’re coming clean about our Secret Single Cooking. We’ll tell you about the pot that every solo cook should have, how to get into the virtual dating game, and what it’s like to be single and pregnant while in isolation.Look, we’ve got a lot of big problems right now. Being alone is maybe not at the top of the list, but, as the days and weeks stretch on, we’re going to get tired of Zoom parties. We’re going to hit cooking ruts. We’re going to stop shaving our legs (me, already). We’re going to see each other through cycles of grief and anger and panic and, yes, joy. Somehow, we’ve got to figure out how to be alone when we’re together and together when we’re alone.I hope you’ll find this series helpful. Over the course of the month, we’ll add new stories to the list below. Email healthyish@condenast.com if there’s something in particular you want to see, and thank you for being with us. We're with you, too.Sincerely,Amanda ShapiroHealthyish EditorThe Healthyish Guide to Being AloneI’m 25 and Taking Care of My Sick Dad. I’ve Never Felt Less Alone.Illustration by Sofie Birkin2020 Was Going to be the Year I Found Love. The World Had Other Plans.Alison Roman's Self-Quarantine Dating Life Is One Long Quest for Phone SexIllustration by Sofie BirkinI Fell Into a Deep Cooking Rut—Here’s How I Got OutPhoto by Alex Lau, Food Styling bu Susie Theodorou, Prop Styling by Eli Jamie Hawa Hassan Is Feeding Hospital Workers At the Epicenter of COVID-19Photo by Laura Murray All I Want To Do Is Eat Alone (Around Other People)Photo by Alex Lau Leading a Virtual Dance Party Is What I'm Living For Right NowIllustration by Sofie BirkinHow to Meal Prep for One But Never Eat the Same Thing TwicePhoto by Gentl & HyersIt Took a Global Pandemic, But I'm Finally Calling My MomPhoto by Marcus NilssonMake a Whole Galette For Yourself Because You’re Worth ItPhoto by Emma Fishman, Plate by Meilen Ceramics A Sex Shop Owner’s Favorite Toy for Going It AloneWhat It's Like to Be Single and 8 Months Pregnant in IsolationIllustration by Sofie BirkinA Tiny Pot That Every Solo Cook Should OwnSecret Single Cooking: The Meals We Make When No One Is AroundPhoto by Alex Lau, Food Styling by Rebecca Jurkevich Ask Andy: An Advice Column on Living AloneWe'll be updating this post with Andy's answer to a new question each week.PHOTO BY EMMA FISHMANWe'll add to this guide all throughout April, so check back soon.Explore Bon AppétitHealthyishHealthyish Guide to Being AloneessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "Amanda Shapiro"]}