{"id": "b0487b6f4048ee9856dc32866361aa4f", "url": "https://www.bonappetit.com/story/cooking-self-care", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Cooking as Self Care: How I Cooked My Way Out of Depression and Debt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Was Alone, Depressed, and Spending All My Money on Delivery Pizza. Then I Learned to Cook.I didn't realize it at the time, but cooking was the one form of self-care I let myself indulge in.By  Akanksha SinghOctober 22, 2018FacebookTwitterEmailIllustration by Stephanie DeAngelisFacebookTwitterEmailI was 22, alone and friendless, having just moved to Brisbane, Australia for school. Except, I wasn’t going to school—not really, anyway. I was spending most of my days at home with the blinds drawn, burning my eyes with daytime soap operas, and wondering if I should have stayed home in Montreal instead. I was depressed, and my bank account was too. I’d been putting all my money into pizza, and not the good kind. The kind you eat on your couch with your hair in a bun, in a sweatshirt and sweatpants that you've only put on because the same delivery guy was at your door yesterday and the day before.A delivery pizza in Brisbane costs around 30 Australian dollars (around $20 USD). When I finally realized I needed professional help, I also realized that my pizza-a-day habit would have to stop. My therapist's rate was 200 dollars a session, and, given that I hadn’t changed clothes for anyone other than the delivery guy in weeks, I was in for a lot of sessions.My therapist, Tracy, a young trauma specialist was astonishingly easy to open up to. After the second productive session, I came home red-eyed and emptied out, with a 200-dollar receipt burning in my wallet. I scavenged my pantry to find a can of tomatoes, a box of penne, and garlic cloves that had started to sprout, and I got to work on a marinara. Almost instantly, the smell of sautéed garlic dissolved the knots in my shoulders. By the time the tomatoes, dried Italian seasoning, and sugar went in, my lungs took in air for what felt like the first time in years. Despite the tomato spatters on the counter, I plated it properly—complete with a fork on a triangle-folded paper napkin—and sat down, not in the bed, but at the dining table to eat.I don’t know if it was the fact that I’d just saved myself 30 dollars or that I was ravenous, but it was the best penne in marinara I’d had in some time. Also, it was the only penne in marinara I’d had in some time, but that’s not the point.A couple weeks later, I put on an emerald green sundress and pink lipstick and ventured out of my one-bedroom apartment to the supermarket for groceries. It was the first time I’d been out on a day that I didn’t have a therapy session. Strolling down the aisles at Coles, I felt like Nigella Lawson or Rachel Khoo or the star of my own BBC Food series. So much so that I walked through the supermarket talking to the cheesemonger and the delicatessen attendant, sampling their recommendations like they do on cooking shows. The prospect of cooking something, anything, was enticing. I returned home with two canvas totes brimming with a bouquet of snapdragons and all the ingredients for a chicken Caesar salad.As therapy continued, with mountainous highs and cavernous lows, I cooked the tried-and-true recipes that had gathered dust in the corners of my mind. I cooked and re-cooked Rachel Khoo’s lavender chicken until the chicken skin was that perfect amber. I cooked Fabio Vivani’s chicken marsala. I cooked Gordon Ramsay’s sticky lemon chicken. I cooked my grandmother’s pulao.All the while, I kept attending my sessions and finally started going back to classes at school, even the non-mandatory ones. I started stepping out of the house on weekends, going to farmers’ markets and flea markets and car boot sales. With the money I’d saved by not ordering in, I bought myself some new cookware. I started spending an extra dollar here and there on ingredients like farm-fresh honey and local preserves and jams. I brought home a basil plant, which I (imaginatively) named Basil Brush after a show I watched as a child. I even bought my first cookbook, Meta Given's The Encyclopedia Of Cooking, Vol. 1. and started baking everything from croquettes to shortbread. The first thing I made out of that book was lemon curd, and I remember watching the yolks, sugar, and butter whisk into a silky, fluffy cloud and wondering why I’d ever bought the readymade version.Then, against all odds, I made friends. Somewhere between going to the store, going to class, and getting out of the house, I met people who shared my love of food, wine, and conversation. We took turns hosting dinners and cocktail evenings. And when MasterChef Australia and My Kitchen Rules rolled around—Australia’s two favorite winter cooking shows—my dinners evolved from one-pot meals to pre-plated extravaganzas with candles and wine pairings: individual Beef Wellingtons, chicken tikka masala, and ratatouille prepared like the one from the film.It wasn’t until three years later, toward the end of my time in Brisbane, that I brought up my love of food with my therapist. She pointed out that I tended to avoid taking care of myself; that I felt undeserving of kindness from myself and others. I hadn’t realized it at the time, but cooking was the one form of self-care I let myself indulge in. Everything from peeling veggies and washing pans made me feel grounded. Taking the time to poach an egg in the morning was an act of care.As I prepared to leave Brisbane, I wrestled with leaving behind my friends and flea market finds (the airline weight limit prevented me from taking my seasoned cast iron pan and, unlike my friends, the pan and I couldn’t Skype when I thought of it. But as my friends toasted me with my new nickname, “Martha” (as in, ‘Stewart’; insert hair toss) at my farewell dinner, I realized that there were more cast iron pans in my future. The last three years were just the beginning.Explore Bon AppétitHealthyishSelf CareessayRead MorecultureHow a Single Pan Taught Me About Self LoveBy Shelby VittekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-22", "author": ["Condé Nast", "Akanksha Singh"]}