{"id": "b04c9db2e3547ee844b3e9df0ce51392", "url": "https://www.bonappetit.com/recipe/crispy-roasted-broccoli-with-tahini-sauce", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Crispy Roasted Broccoli with Tahini Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Roasted Broccoli with Tahini SauceBy Lauren SchaeferSeptember 23, 20184.4(63)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb Adams, Food Styling by Rhoda Boone and Jennifer OphirEmailPinterestPrintEmailPinterestPrintThree simple things separate the kind of crispy, flavorful roasted vegetables that you could happily eat three nights a week from the kind that feel like a sad afterthought—and this roasted broccoli recipe gets it right. For one, making sure not to crowd the vegetables on the sheet pan ensures that they actually roast, not just steam. And cranking the heat—425°F is the sweet spot—helps to achieve exterior browning and caramelization more quickly, so that the veggies stay crisp-tender. Finally: SAUCE! Even the simplest, throw-together tahini sauce makes a platter of roasted broccoli feel a lot more special. And there you have it folks: roasted veggies you can actually get excited about.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketCitrus Juicer$13 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonWhisk$10 At AmazonSmall Skillet$40 At AmazonPlatter$29 At AmazonIngredients4 servings1large head of broccoli with stem3Tbsp. extra-virgin olive oil2tsp. kosher salt2lemons1garlic clove5Tbsp. tahini2Tbsp. raw sesame seedsPreparationStep 1Preheat oven to 425°. (Higher heat = more caramelization, more quickly.) Remove bottom 2\" of tough stem from 1 head of broccoli with a chef’s knife; discard. Cut broccoli crosswise, starting with the stem end (yep, you can eat most of the stem!) into ¼\" slices. When you reach the crown, slow your slicing so you can push the florets to the side as they begin to fall with each slice. You want to have lots of loose florets. No matter what kinds of veggies you're roasting, you want to cut them into pieces that are about the same size so that they cook at the same(ish) rate.Step 2Transfer broccoli to a rimmed baking sheet. (If you don't have a proper, heavy-duty aluminum half sheet pan, this is a reminder to invest in one ASAP.) Drizzle with 2 Tbsp. oil; season with 1 tsp. salt and toss to coat. If you were interested in adding any spices—think curry powder, chile flakes, fennel seeds—this is the time to do it.Step 3Arrange broccoli on pan in a single layer, spacing so no pieces overlap (this ensures broccoli will roast properly, not just steam). Roast until nicely browned, even charred in spots, and crispy with a bright green interior, 8–10 minutes.Step 4Meanwhile, make your tahini sauce. Cut 1 lemon in half. Using a citrus juicer (or your hands), juice lemon (fish out any seeds) into a small bowl. Cut remaining 1 lemon into wedges; set aside for serving. Peel 1 garlic clove and use a Microplane to grate it into bowl with lemon juice. (We're big fans of grated garlic over here, especially when it comes to dressings and sauces. It's a hell of a lot easier than trying to get a fine, even mince with a knife, and there's no risk of biting into a big chunk of raw garlic later on.)Step 5Add 5 Tbsp. tahini, 1 Tbsp olive oil, 1 tsp. salt, and ¼ cup hot water and whisk until smooth. Give it a taste: The richness of the tahini and zippiness from the lemon should be nicely balanced, so adjust with more of either if necessary, and don't be afraid to add more salt if the sauce doesn't pop.Step 6Gently toss broccoli by giving pan a shake (or use a spatula). Continue to roast until browned in spots and tender, 5–8 minutes longer. As with all recipes, the amount of time it takes is going to have a lot to do with the equipment you're using—you want that broccoli to have plenty of color on it, so don't be afraid to keep roasting until you get there.Step 7Heat a small skillet over medium. Toast 2 Tbsp. sesame seeds, tossing frequently, until light golden and slightly fragrant, about 2 minutes. Don’t walk away; the seeds will burn quickly! Let cool. (And, FWIW, this recipe will still be good if you skipped the sesame seeds—but if you're going to use them, make sure to toast them, which will make them a lot more flavorful. Cool?)Step 8Transfer broccoli to a platter and drizzle with tahini sauce. Top with sesame seeds and reserved lemon wedges for squeezing over. One of the great things about roasted vegetables is that they're just as delicious room temperature as they are piping hot, so don't stress if the rest of dinner isn't ready yet.How would you rate Crispy Roasted Broccoli with Tahini Sauce?Leave a ReviewTell us what you thinkReviews (39)Back to TopTriangletasty, for real. this tahini concoction is the perfect addition to crispy broccoli pieces! i had a lot of sauce leftover and ended up using it as a salad dressing the next day. so good. will be making this frequentlyashleymemphis3/1/2022I can't afford to see your recipe, which left a bad taste in my mouth, so I made my own directions, with some broccoli pieces roasted at 425-450 and drizzled with garlicky, lemony, lightly salted, lightly spiced, slightly thinned with water tahini.Anonymous2/21/2022This one has made it into the regular rotation, some months we make it weekly!! Be careful with the salt amount in the sauce. I've made this so many times I just eyeball it at this point. Always easy, always delicious. The tahini with the crispy broccoli bits is perfectionKaitlinChicago1/13/2022This was super easy and delicious. The tahini sauce is amazing and would go great on any roasted veggies!SoapnanaChicago, IL7/12/2021I never leave reviews on recipes but this recipe is so delicious that I felt morally obligated to let everyone know. This has quickly become one of my favourite recipes of all time. Don't skimp on the toasted sesame seeds!CeciliaVancouver, CA7/2/2021Easy, unique and delicious. Will make again following the recipe exactly.AnonymousRidgewood, NJ2/22/2021Love roasted broccoli. Love tahini sauce. Don’t love clumpy seized up tahini sauce. Try ice water to thin out the tahini. Makes it smooth and pourable. (I know I know it is cold on hot broccoli. But the sauce is better thin. )EssieDeeStamford ct1/4/2021A bit too sour for my liking but this was really good!Clara12/17/2020I love this recipe. I’ve made it a number of times. If this webpage ever goes away, I’ll be in crisis. AnonymousLos Angeles10/4/2020The salt content is far too much, I was following this recipe not even thinking, I couldn’t eat any of it.  Maybe my British pallet isn’t used to such levels, but it certainly isn’t healthy; 1 teaspoon on broccoli and the sauce needed me gasping for water. I will try this again, but only “season” the broccoli and 1/4 teaspoon of salt in the sauce. Stels87London, UK9/25/2020I absolutely love this recipe and sometimes just make the tahini sauce to put on other things. AnonymousLos Angeles8/7/2020Yum! I, like other reviewers, left the broccs in a little longer for more crunchy bits. Served with peppery soy saucey brown rice and some crispy fried tofu, with the tahini sauce drizzled on top of everything. I added some paprika and more garlic to my tahini sauce per our tastes. Definitely a super quick meal I’ll come back to. yagurlcarlyTucson, Arizona7/3/2020When I printed the recipe, I did not get steps 2 - 4. Very inconvenient. It meant I had to run between my computer and the stove. The computer is not located near my kitchen. eceSan Lorenzo, CA6/17/2020Such a delicious way to make broccoli more interesting. I didn't have tahini so I used hummus instead and it did the job. 10000000x more delicious with pomegranate seeds sprinkled on top! Also added some chopped up mint which was delicious. Highly recommend! The recipe is 5 stars with the addition of mint and pom seeds, 4 stars without. alexgoldman987988Toronto, Canada6/3/2020We did this as a main for a meatless dinner and it was perfect! Used kosher salt as directed and the sauce was perfect, not too salty. We had sauce left over and used it to top roasted cauliflower a few nights later. AnonymousHouston TX4/20/2020Explore Bon AppétitAmericanMiddle EasternBroccoliVegetableTahiniCondiments, Sauces & PastesLemonCitrusFruitQuickEasySideDairy-FreeVegetarianGluten-FreeVeganKetoRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-23", "author": ["Condé Nast", "Lauren Schaefer"]}