{"id": "b062f41b62c5878ce048d3cce7632341", "url": "https://www.bonappetit.com/recipe/lobster-shepherds-pie", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Lobster Shepherd’s Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueLobster Shepherd’s PieBy Claire SaffitzFebruary 13, 20183.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon and Nikole Herriott, Food Styling by Alison Attenborough, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintRemoving the lobster from the shells prevents them from overcooking, and the shells help build an excellent sauce for this sheperd's pie recipe.Ingredients4 servings Potatoes and Stock2lb. russet potatoes, scrubbed, pricked all over with a fork¼cup (½ stick) unsalted butter, divided1½lb. lobster tails, meat removed from shells and cut into 2\" pieces, shells broken into 2\" pieces2Tbsp. tomato paste½cup dry white wine1medium yellow onion, peeled, halved through root end1head of garlic, halved crosswise2celery stalks, halved crosswise1medium carrot, peeled, cut on a diagonal into 2\" pieces, divided2bay leaves1tsp. black peppercornsKosher salt1cup half-and-halfFreshly ground black pepper2large egg yolks¼cup chopped dill2Tbsp. prepared horseradish8oz. pearl onions, peeledAssembly¼cup (½ stick) unsalted butter8oz. pearl onions, peeled3medium carrots, peeled, cut on a diagonal into 2\" pieces¼cup all-purpose flour½cup half-and-halfKosher salt, freshly ground pepperFlaky sea saltPreparationPotatoes and StockStep 1Place a rack in top-most position of oven; preheat to 400°. Roast potatoes directly on rack until tender, 60–70 minutes. Let sit until cool enough to handle.Step 2Meanwhile, heat 2 Tbsp. butter in a large saucepan over medium-high until melted and foaming. Add lobster shells and cook, stirring often, until bright red, about 5 minutes. Add tomato paste and cook, stirring, until it starts to brown and stick to pot, about 1 minute. Add wine and cook, scraping up browned bits, until almost completely evaporated, about 3 minutes. Add yellow onion, garlic, celery, carrot, bay leaves, peppercorns, and 4 cups water. Toss in a generous pinch of kosher salt and bring to a boil over medium-high. Reduce heat and simmer briskly until liquid is reduced by two-thirds, 50–60 minutes. Strain stock through a fine-mesh sieve into a heatproof measuring glass; discard solids. (You should have about 1½ cups.)Step 3While potatoes are cooling, warm half-and-half and remaining 2 Tbsp. butter in a medium saucepan over low heat just to melt butter.Step 4Split potatoes lengthwise and scoop flesh into half-and-half mixture. Smash with a potato masher until mixture is smooth and lump-free; season generously with kosher salt and pepper. Remove from heat and mix in egg yolks, dill, and horseradish; cover with plastic wrap.AssemblyStep 5Melt butter in a clean large saucepan over medium. Add pearl onions and carrots and cook, stirring, until onions start to turn translucent, 5–8 minutes. Sprinkle flour over; stir to combine. Cook, stirring, until flour leaves a film on bottom of pot, about 4 minutes. Stirring constantly, gradually stream in stock, then bring to a simmer. Remove from heat and stir in half-and-half; season sauce with kosher salt and pepper. Let cool slightly.Step 6Arrange lobster pieces in a shallow 1½-qt. baking dish and ladle sauce over. Dollop mashed potatoes on top and use the back of the spoon to spread across surface, creating decorative swirls. Sprinkle with sea salt. Bake on a foil-lined baking sheet until lobster is cooked through and filling is bubbling around the edges, 20–25 minutes. Turn on broiler and broil pie just until topping is browned in spots, about 1 minute. Let rest 5–10 minutes before serving.Step 7Do Ahead: Pie can be assembled 1 day ahead; cover and chill. Bring to room temperature and uncover before baking.How would you rate Lobster Shepherd’s Pie?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleThis was an unmitigated disaster! After much expense, $75 give or take, and even more work and effort, I was left with a dish I could hardly finish. The potatoes were dry, the broth wasn't flavorful enough despite my multiple additions of salt/pepper, the pearl onions were way to big and the lobster came out like a rubber toy. I was so disappointed. I am going to try to salvage it though. Make lobster salad out of it, maybe it'll tenderize a bit in lemon juice and mayo? Fingers crossed but avoid this recipe. AnonymousBronx4/17/2018Made this last night for a friends birthday who loves lobster.  It takes a while to make but the end result is amazing.  Only thing i forgot was to add the remaining half and half to the sauce.  We didn't miss it.  The lobster was perfectly cooked, the sauce was decadently smooth and very rich the potato topping with dill and horseradish was fantastic.  Would definitely  make againAnonymousWilbraham3/3/2018Explore Bon AppétitSavory Pie & TartLobsterShellfishSeafoodMainNut-FreeRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}