{"id": "b0882e049bd7901e0911b2d9998c149d", "url": "https://www.bonappetit.com/story/nimbu-pani", "year": 2020.0, "month": 7.0, "day": 4.0, "content": "Nimbu Pani is a Sour and Refreshing Summer Drink Made with Just Three Ingredients | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingNimbu Pani is What I Drink When I Feel Like a Human FurnaceThe most refreshing part of my summer.By Nayantara DuttaJuly 22, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Nimbu pani is a staple of summer in South Asia—sold from carts on street corners and served to house guests—and, as I’ve moved around the world, from Hong Kong to Vietnam to Scotland to New York, it’s the pick-me-up that always transports me back home.There’s no one way to make nimbu pani (which translates to lemon/lime water in Hindi), and there are endless regional variations, from lebur shorbot in Bangladesh to guccha soda in Nepal. In Delhi, they call it banta, and it takes the form of lemon-infused soda packaged in glass bottles that open with a satisfying pop and a sizzle of citrus-scented mist when you push a marble to break the seal. In Kolkata, where I grew up, I always order fresh lime soda, which comes with seltzer, mint, and a lime simple syrup, all served separately, which gives me the pure delight of playing mad scientist when I mix the ingredients together.But no matter which way it’s made, nimbu pani is always deliciously sour and citrusy. It’s also lighter, healthier, and more refreshing than lemonade because it has more fruit juice and salt than sugar.In South Asia, the citrus (nimbu) used for this drink can be yellow or green, and it’s small and thin-skinned like a lime and especially tangy. We always keep some on the table to add flavor to our meals. If you’re outside of South Asia, you can use either a lemon or a lime for nimbu pani, and you can make the drink sour, sweet, or even both (we call this flavor khatta meetha). In the way that you get to know people’s coffee orders, you also learn how people like their nimbu pani. My own version is always simple and very salty, with water, lemon, and kala namak (black salt).I add kala namak to everything.\nPhoto by Laura MurrayKala namak is one of the South Asian seasonings that I add to everything—popcorn, guava, apples, you name it. It’s an addictively flavorful rock salt from the Himalayas that’s known for its chatpata taste—that is, it’s salty, sour, and tangy all at once. It’s commonly added to chaat, chutneys, raitas, and Indian salads (a plate of chopped cucumber, onion, tomato, and nimbu slices served with every meal). In Ayurveda, kala namak is considered a cooling salt because it balances out your body temperature so you don’t feel overheated. It also replaces the salt lost through sweat, which makes the drink particularly refreshing.Nimbu pani is deceptively easy to make: I fill a glass with cold water, squeeze in a tablespoon or two of lemon juice, sprinkle in a teaspoon of kala namak (it will fizz because of the sulphur in the salt, so leave some space in the glass), then stir, taste, and adjust for flavor. (You can also add in ice if you’d like!) If you’re new to kala namak, start small and add more as you get used to the taste.Feel free to get creative: Use seltzer instead of water, rock salt in place of kala namak, or add chaat masala, ground cumin, or, for a touch of sweetness, sugar, jaggery, or simple syrup. Nimbu pani tastes best when it’s simple, with only one or two key flavors to keep the drink light and refreshing, but you can always experiment and make the recipe your own (my friend recently added some juiced cactus pears to clean out his fridge). My favorite thing about nimbu pani is there’s no mistake you can’t fix. If you add too much of any ingredient, you can just make more to balance it out.On days when I feel like a human furnace and need to sit in front of the A/C or speed-eat ice cream, I make nimbu pani. It always gives me the energy I need to keep going.Nayantara Dutta is a writer and strategist based in India. She covers the South Asian diaspora, third culture identity, and sustainable living. Her writing has been featured in Eater, Quartz, Fast Company, and more.Explore Bon AppétitIt's That SimpleSummer DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-22", "author": ["Condé Nast", "Nayantara Dutta"]}