{"id": "b08bf0db7c47bd9d8f97760b20ffacae", "url": "https://www.bonappetit.com/story/anti-fatigue-kitchen-mat", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Your Sore Feet Called. They Want a Better Anti-Fatigue Kitchen Mat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYour Sore Feet Called. They Want a Better Kitchen MatIf you spend as much time in the kitchen as I do, you need an anti-fatigue kitchen mat.By Sarah JampelJune 22, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Roughly 30% of my workday is spent developing and testing recipes. I also live in a no-shoes household (judge as you wish, my relatives certainly do), which means I spend hours cooking without the support of my beloved Danskos, which means I often find myself at the end of the day with a slightly achy lower back and throbbing feet. (Worth it for a little less dirt in the apartment? I say yes.)I knew the solution was an anti-fatigue kitchen mat—a household version of the industrial pads professional chefs rely on to power through multi-hour dinner shifts. I wanted something that would provide the give of a plush rug rather than the unrelenting hardness of a wood floor, but most mats I came across had loud prints with puns in loopy cursive font or seemed too thin to offer sufficient support. That is, until I came across a WellnessMat in my parents’ kitchen (of all places!). The mats are squishy but not too soft—think of a firm mattress with a cushy topper. They come in a variety of colors and textures that are subtle but not drab, pretty but not too flashy, and they’re easy to wipe clean and vacuum.Photo by Emma FishmanWellnessMats Original Anti Fatigue Floor Cushion$150 at AmazonYes, a WellnessMat is a bit pricier than some alternatives, but they’re domestically manufactured and, as I tell myself, I’m probably saving money that I’d normally spend on massages. (Plus, you can find a great deal on a gently used one.) My anti-fatigue kitchen mat enables me to stand for seemingly hours at the counter—washing dishes, loading the dishwasher, kneading dough for...is this recipe serious…10 whole minutes?—without exhausting my back and lower body.I think my partner would probably prefer if I got tired faster so I’d join him on the couch for an hour or five of TV, but with my WellnessMat underfoot, I think I’ll stand right here and make another babka.Explore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-22", "author": ["Condé Nast", "Sarah Jampel"]}