{"id": "b0942ef6f3f109209425875d34901727", "url": "https://www.bonappetit.com/story/va-la-vineyard-silk-rosato", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Drinking This Pennsylvania Rosé at This Wine Bar Is My Summer Ritual | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsDrinking This Pennsylvania Rosé at This Wine Bar Is My Summer RitualHome is where the Silk Rosato is.By Alex DelanyJuly 24, 2019FacebookTwitterEmailPhoto Courtesy MarthaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.These are the things I do—always and without fail—when I return home to the greater Philadelphia area. I nap on my parents’ couch. I eat as many hoagies as I possibly can. And I go to Kensington’s Martha and drink a bottle of Va La Vineyard’s Silk Rosato.This is the bottle of wine I look forward to every summer, and it’s special for a couple of reasons. The first is that I’ve made drinking this wine in this place a tradition. Sitting in Martha’s beautiful tiered yard with a friend or two, as the sun shines down, and watching that stark white label being carried toward my large granite table reminds me that I am home and that I am happy.The other reason is that this wine is masterfully made, tantalizing, and singular. Va La’s Silk is a rosato that can hold its own against quite literally any other natural rosé in any respectable wine bar in the world. Bonus: It’s made in my native state of Pennsylvania. The wine is a blend of mainly Corvina Veronese, Nebbiolo, and Barbera—all Italian grapes, usually used for more substantial wines—which give it a brilliant garnet hue. Flavor-wise, it’s somewhere between the lively, wild natural wines I drink at my favorite bars in New York and the more traditional, reserved California Chardonnay and Italian Chianti I drink at my parents’ house. It’s both elegant and exciting, and the result is a wine that’s equal parts South Philly black cherry water ice and flinty Pennsylvania soil, with bright fruit, lots of acid, and just enough tannin to keep it all in check.Simply (and maybe surprisingly) put: This rosato made in Pennsylvania is one of my favorite beverages in any category. So do as I do: Go to Philly. Grab a seat at Martha. And get a bottle of Silk, assuming that I haven’t cleared out the cellar already.Go there: MarthaExplore Bon AppétitWine BarsRoseHighly RecommendWineRead MorerestaurantsI Fully Endorse Tipsy Wine Shopping at Bar NormanBy Amiel StanekcultureI’m Bad at Math But Can Tell You That This Lambrusco + Pizza = HappinessBy Emily SchultzcultureThe Halo-Halo at Philadelphia’s Sarvida Is 5 Layers of PerfectionBy Amanda ShapirorestaurantsDon’t Even Open the Menu at W/N W/N Coffee Bar‚ Just Trust the BartendersBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-24", "author": ["Condé Nast", "Alex Delany"]}