{"id": "b0a51287f5b313ecdcdb8b85eda53331", "url": "https://www.bonappetit.com/story/happy-hour-with-al-whiskey-port-easy-cocktails", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "3 Easy Cocktails That'll Make You Feel Like You're Sitting By the Fire | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking3 Easy Cocktails That'll Make You Feel Like You're Sitting By the FireA bottle of bourbon, one surprising bottle of wine, and enough easy cocktails to get you through the rest of the winter.By Al CullitonMarch 7, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically's resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.It’s still winter, and that means you're looking for drinks that make you feel like you’re sitting fireside in a worn leather armchair at some tony cocktail lounge. BUT you also probably don’t want to leave your house, or drop $16 on a drink, or have to deal with some mixologist sporting a waxed mustache and sleeve garters. Let me help you out with all of that. This month, I've got three easy cocktails you can make at home, won’t break the bank, and bridge the gap between the death throes of winter and the first whispers of spring, all made with good ol' bourbon and a little something called port (really!).Before we get to our cocktails, let’s talk about this month's bottles. Up first: bourbon. When colonists came over from the British Isles, they brought a taste for whiskey with them. And they started making it with whatever grain they had on hand—and that grain happened to be corn. This ad hoc whiskey eventually became its own thing, a style named for Bourbon county in Kentucky. There are some very fine, high-end bourbons out there, but for cocktails, look for something that’s about $24 for a one liter bottle—personally, I like Wild Turkey or Four Roses.Next up is port. Yes, I understand your dismay—you might not yet know that port is both delicious and cool, but these cocktails are going to prove it to you! Back in the 1700s, the English started buying a ton of port, a wine that was “fortified” with a little bit of liquor, thus preventing it from spoiling on the voyage from Portugal to London. There are two main types you're likely to come across: ruby port, which is unaged, fruity, and vibrant, and tawny port, which is oxidized and more mellow. (I favor tawny for cocktails, but both will work.) Vintage bottles of port can be pricey, the kind of thing you’d buy your professor as a retirement gift, but something in the $18-20 range will be great for our purposes. My absolute favorite is Quinta do Infantado.The kit.\nPhoto by Chelsie CraigYour Shopping List:1 1-Liter bottle bourbon1 750-mL bottle port1 bottle Angostura bitters4 lemonsA few eggsSugarWhole nutmegIceBefore we start making drinks, we’ll make a simple syrup. A lot of people think you have to make simple syrup on the stove, which is understandably annoying, but that’s not necessary. Add 1 cup sugar to 1 cup of very hot water and stir until sugar is completely dissolved. Let it cool. Any leftover syrup can be stored in an airtight container for up to three weeks—it’s a great idea to get into the habit of dating your syrups, vermouths, etc., before storing them in the fridge. (Simple syrup is great to have around because thousands of cocktail recipes call for it and it’s handy for iced coffee, too.) Now, let’s begin with the first cocktail of the night. It’s a variation on one of the cocktail world's true classics, and you're going to love it.Photo by Chelsie CraigThe Port ManhattanYou’ve definitely heard of a Manhattan. It’s one of those great old nineteenth-century cocktail recipes that’s still got legs today. It’s typically made with rye whiskey, sweet vermouth, and bitters, stirred and served in a stemmed cocktail glass, garnished with a cherry or a twist. This ones a silky-smooth sipper for your classy friend who points to the fanciest glass on your bar and says “I want whatever comes in that one.” Are you starting to see what we’re about to do? We’ve got whiskey—not rye, but bourbon—and we’ve got something that’s kind of vermouth-like, i.e. port. Let’s make a fancy drink!Pour 2 oz. bourbon into a mixing glass, then 1 oz. port. Add three generous dashes Angostura bitters. Add ice and stir until well-chilled, about 15 seconds, then strain into a cocktail glass. Using a vegetable peeler, cut a thick piece of lemon peel (avoiding the white stuff, a.k.a. pith, as much as possible). Using your thumb, fore- and middle-fingers, squeeze the oils from the peel onto the surface of the drink (peel side out, and with both hands). Sip, repeat, and settle down for a long winter's nap.Photo by Chelsie CraigThe “New York” SourNow, something for your pal who never looks like they’re trying too hard—you know, the one who feels good in their regular clothes even if they’re at a nice restaurant. This bright little number will have you saying, \"Winter? What winter?\" The sour is one of the great archetypes of the cocktail canon. At its core it’s just liquor, citrus juice, and sugar shaken so it’s a little frothy, incorporated and cold. There are a ton of variations on this template, like the Daiquiri, Pisco Sour, Boston Sour, Brown Derby, and the Gimlet. Personally, I really like a New York Sour—it's a classic whiskey sour with a bit of red wine floated on top to create a cool ombré effect. We’ve got port, so—you guessed it!—we’re using that instead of regular red wine.Pour 2 oz. bourbon, 1 oz. fresh lemon juice, and 1 oz. simple syrup into a cocktail shaker. Fill shaker with ice and shake hard for about 10 seconds. Strain into a double rocks glass filled with fresh ice. Position a spoon on the surface of the drink and slowly pour ½ oz. port into the bowl of a spoon, wiggling it ever so slightly as it fills to distribute the wine onto the surface of the drink without letting it sink. What a looker! These will go fast, so do yourself a favor and reset your cocktail station after you're finished with the first round—you'll be making another in no time.Photo by Chelsie CraigThe Port FlipThis last one is the wild card, the one for your weirdest friend—the one who seems like they were born into the wrong century, or might look natural wearing a monocle. The flip was once a tavern specialty consisting of ale, eggs, sugar and spices, and sometimes brandy or rum. A hot poker from the fireplace, called a flip-dog, would have been submerged in the drink to caramelize, heat, and froth it all at once.Not to worry, you can put down the fireplace poker—the modern flip is a lot less of a fire hazard. By the time the cocktail revolution of the later nineteenth century rolled around, the flip it had gone through a lot of changes. Suddenly it was a much more refined mix of fortified wine, a whole egg, and sugar, prepared using a new tool called a shaker. And ice. (Yes, ice was a novel luxury item back then)Pour 2 oz. port, ½ oz. simple syrup, and a whole egg into a cocktail shaker and seal the shaker. (If you’re worried about the raw egg thing, don't be. Maybe steer clear if you're of advanced age or have a compromised immune system, but otherwise you'll be fine.) You’re going to “dry shake” this cocktail first, which means without ice. Because the air in the shaker is warm due to the lack of ice, the seal won’t be strong, so hold your shaker together tightly while agitating the liquid heartily. Open the shaker and fill it with ice, seal again and shake well to chill. Strain into a coupe or a sherry glass. Grate nutmeg on top using a Microplane. (It’s flavorful stuff, so don’t overdo it.) And now you have a cold, cloudy, clever cocktail curiosity that will impress even your most jaded of friends.The lineup.\nPhoto by Chelsie CraigLook at that! You’ve got three more easy cocktails in your arsenal than you did ten minutes ago! And now you know about port, too. Crank that thermostat, invite your friends over, and get to drinking—it'll be spring before you know it.Al Culliton is a bartender and writer working in New York City. She is the general manager of the beloved Red Hook bar and restaurant Fort Defiance. Al loves poring over menus and cocktail books from bygone eras, visiting the New English countryside, and cooking for her partner at their home in Brooklyn.Looking to upgrade your bar gear? We've got you covered:All the Gear You Need to Make Killer Cocktails at HomeYou need more than just a shaker—but not that much more. Here's our list of essential cocktail gear.View StoryExplore Bon AppétitBourbonWhiskeyPortCocktailCocktail PartyBasicallyHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-07", "author": ["Condé Nast", "Al Culliton"]}