{"id": "b0afd8e1044732de0c9ed93ecd460140", "url": "https://www.bonappetit.com/recipe/hummus-with-pistachio-dukkah", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Hummus With Pistachio Dukkah Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2019 IssueHummus With Pistachio DukkahBy Ochre Bakery, Detroit, MISeptember 17, 20194.7(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole HerriottEmailPinterestPrintEmailPinterestPrintA nutty, generously spiced hummus from Ochre Bakery in Detroit, No. 4 on our 2019 Hot Ten list. Even if the hummus looks smooth after just 3 or 4 minutes of food processing, go for the full 8. It might seem excessive (and loud), but all that whipping is what makes the dip so irresistibly creamy.IngredientsMakes about 4 cupsDukkah⅓cup raw pistachios6Tbsp. coriander seeds¼cup cumin seeds½cup sesame seeds1tsp. kosher salt½tsp. freshly ground black pepperHummus and Assembly1¼cups dried chickpeas, soaked overnight in cold water, or 2½ cups canned chickpeas1Tbsp. plus ¾ tsp. kosher salt, plus more2garlic cloves⅔cup tahini (preferably Soom)⅓cup plus 2 Tbsp. (or more) fresh lemon juice¼tsp. (or more) cayenne pepper6Tbsp. extra-virgin olive oil, plus more for drizzlingPreparationDukkahStep 1Heat oven to 350°. Toast pistachios on a rimmed baking sheet 3 minutes—you want them to stay bright green. Let cool, then pulse in a food processor until you have a coarse, uneven mixture of some lentil- and some couscous-size pieces. Transfer to a medium bowl.Step 2Toast coriander and cumin in a dry large skillet, stirring often, until fragrant and starting to pop, about 2 minutes. Transfer to a small bowl and let cool slightly.Step 3Return skillet to medium heat and toast sesame seeds, stirring often, until golden brown and fragrant, about 3 minutes. Transfer to bowl with spices and let cool.Step 4Grind spice mixture in food processor (no need to clean bowl) until finely ground, then mix into nuts. Mix in salt and pepper.Step 5Do Ahead: Dukkah can be made 2 weeks ahead. Store airtight at room temperature.Hummus and AssemblyStep 6If using dried chickpeas, drain, reserving ⅓ cup soaking liquid, and rinse. Place in a large pot and pour in water to cover by at least 4\". Bring to a boil and cook until tender, 50–60 minutes. Stir in 1 Tbsp. salt. (You should have about 2½ cups; if you have extra, save for another use.)Step 7Transfer chickpeas to a food processor and add garlic, tahini, lemon juice, cayenne, 6 Tbsp. oil, and ¾ tsp. salt. Process until chickpeas are coarsely chopped, then, with motor running, gradually stream in reserved chickpea soaking liquid or ⅓ cup water and process until hummus is extremely smooth and creamy, 8–10 minutes. Taste and season with more salt, lemon, and/or cayenne.Step 8Transfer hummus to a bowl, drizzle with more oil, and sprinkle with plenty of dukkah (you’ll have some left over; keep it around for using on salads, roasted vegetables, slow-roasted salmon).Step 9Do Ahead: Hummus can be made 1 week ahead. Cover with plastic wrap, pressing directly against surface (or cover with a thin layer of oil) to prevent skin from forming, and chill.How would you rate Hummus With Pistachio Dukkah?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHey if you don’t have the coriander & cumin seeds, does anyone know what would be the equivalent amount of already ground spices for the dukkah? Thank you AngieHurleyville, NY1/31/2021if you don't have a food processor (or if the one you have just SUCKS), try peeling your chickpeas once they're cooked (if using canned, simply reserve the liquid, thoroughly rinse the chickpeas, and peel). it's tedious as hell, but you'll get a very smooth result that uses less electricity and puts less strain on your gadgets. if you have extra aquafaba (chickpea liquid) left over, try saving it as an egg replacer. AnonymousKansas City1/10/2020Explore Bon AppétitDipHummusMiddle EasternBeanVegetableChickpeaPistachioNutTahiniCondiments, Sauces & PastesSnackStarterDairy-FreeVeganVegetarianGluten-FreeHealthyishNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-17", "author": ["Condé Nast", "Ochre Bakery", "Detroit"]}