{"id": "b0b25cf68ddf8b9823773a7dbab4c677", "url": "https://www.bonappetit.com/story/win-son-bakery-fan-tuan", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Happiness Is the Sticky-Sweet-Savory Pork Fan Tuan at Win Son Bakery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHappiness Is the Sticky-Sweet-Savory Pork Fan Tuan at Win Son BakeryCrispy fried dough, fluffy pork floss, warm sticky rice. What more could you want?!By Christina ChaeyDecember 10, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Ever since I first sank my teeth into the warm, stuffed Taiwanese rice roll known as fan tuan at Win Son Bakery in Brooklyn, it has taken significant willpower to not venture into Williamsburg to cram one in my face every single morning of my life. Fortunately the Taiwanese-American bakery, which is across the street from staff favorite Win Son, is just far enough out of my way that my laziness usually overcomes my sticky rice desires. Usually.As someone who can never decide what I want for breakfast (sweet or savory? Creamy oats or crispy hash browns? Scrambled eggs or an omelet?), Win Son Bakery’s take on the classic Taiwanese morning treat is assurance that, yes, I can have it all, for $5. The pork fan tuan tucks every imaginable flavor and texture into a tightly wrapped, surprisingly weighty rice roll. It starts with a thin layer of warm sticky rice spread onto a square of cling wrap. On top of that is an expanse of fried egg with gel-like, just-set yolk, followed by a strip of impossibly crispy youtiao, the Chinese cruller that’s like a churro you accidentally left in the fryer a few minutes too long so it’s approximately 1,000 percent more fried (a.k.a. more delicious). Nestled up to the cruller is a fat tuft of wispy rousong, or pork floss, a sweet-salty dried pork that’s so fluffy you could use it to stuff pillows (PSA: Win Son uses Formosa brand, which you can buy!). A slick of sweet soy sauce, fresh chopped scallions, and crunchy salted radish pickles add the final ooh and ahh before everything gets rolled up burrito-style to form a small log that arrives, cut in half to expose its inner goodies, on a little metal tray. (I recently brought one back to the office for senior staff writer Alex Beggs and she was so overcome with emotion that she couldn’t even express her delight in words!)When you sit down to your own little roll, do me a favor. First, order a side of the chile oil that comes with the turnip cake on the menu, because you will definitely want it for the occasional dunk (Win Son, are you guys ever going to jar and sell that stuff or what???). Take your beauty shot, but then put away your phone. Focus on nothing else in the next three minutes other than the waves of flavor and texture that reveal themselves in each bite. It might not be large, but it contains multitudes.Go there: Win Son BakeryExplore Bon AppétitHighly RecommendRestaurantsNew York CityRead MorerestaurantsAll Day I Dream About Win Son’s Fried EggplantBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-10", "author": ["Condé Nast", "Christina Chaey"]}