{"id": "b0b6faeddc313427443cd6493ba12a43", "url": "https://www.bonappetit.com/story/remember-canned-tuna", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "When I Don’t Feel Like Cooking, I Remember Canned Tuna | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen I Don’t Feel Like Cooking, I Remember Canned Tuna100% pantry-friendly and 100% delicious.By Carla Lalli MusicApril 30, 2020FacebookTwitterEmailPhoto by Carla Lalli MusicFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’m thinking back on the early weeks of stay-at-home measures, when we all ran out in preparation desperation and bought all the canned things. Canned beans, canned soups, canned tomatoes, and yes—canned tuna (or jarred, if you’re fancy). Even as I laughed at myself, I still gave into the panic and stocked up. Weeks later, and despite my very limited grocery shopping, I’ve barely used the supplies I gathered. But what’s it for, if not for eating? Let’s get into it!Want this letter before it hits the website? Sign up for our newsletter!There are lots of ways to make tuna salad and I’m sure you’ll yell at me for not doing it the way you do it, or the way your grandmother did it, or your step-aunt or second cousin or beloved diner does it, which I’m certain is the best way. Which way was that, again? It must have celery. It better not have celery. It needs more mayo. The big mistake is that people use mayo. If it doesn’t have dill, you’re fired. If it has dill, I won’t eat it. Sorry—I was just transcribing the torrent of comments you haven’t sent me yet. I understand. But I don’t care. Tuna salad is universal, and yet deeply personal. This is how I make mine:Always pair with pickles and chips!\nAlex LauFirst, finely dice a small shallot, throw it in a small bowl, and squeeze enough fresh lemon juice over to cover, then season with salt and give it a stir. (If you don’t have a lemon, use your favorite vinegar.) Let this hang out while you prep everything else. Drain two 6-ounce cans or jars of tuna (packed in oil, ideally, but use what you’ve got) and place in a medium bowl. Add 4 Tbsp. mayo, 1 Tbsp. prepared horseradish (or Dijon mustard), 2 minced pepperoncini (with brine—or use any type of pickle, including kimchi), and a few dashes of green hot sauce (or red, if that’s what’s on hand). Season with lots of salt and pepper and mix and mash with a fork until well combined and the tuna is in small flakes. Add the soaked shallots and the juice and mixy-mix again. I like this on toasted whole wheat (more mayo on that, of course) with a slab of iceberg, but you could put it on a saltine from the quarantine stash and pat yourself on the back for that decision.Yes, there may be UFOs flying overhead and things have never been weirder, but I’m pretty sure the world isn’t going to end just yet. Whatever you stocked up on is yours for the taking, and popping the lid on a can of tuna is a smart and sane meal choice. It’s economic, it’s time-efficient, it’s tasty as hell. It’s tuna time, and it’s not a surrender.Get more tinned fish recipes right here...Explore Bon AppétitCarla NewsletterTunaRead MorecookingIt’s Called TOTES Toast: Tuna, Olives, Tomato, Eggs, ShallotBy Emily SchultzcookingTinned Fish + Avocado = A Creamy, Dreamy Dip That Has Never Let Me DownBy Hilary CadigancookingYour Tuna Sandwich Has Been Waiting Its Whole Life For Green Goddess DressingBy Andy BaraghanicookingThis Easy Tuna Pasta Is the Cheapest, Quickest, Most Comforting Weeknight Dinner EverBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-30", "author": ["Condé Nast", "Carla Lalli Music"]}