{"id": "b0bab8ca57f14fa145c9380c5533c765", "url": "https://www.bonappetit.com/recipe/blistered-green-beans-with-garlic", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Blistered Green Beans with Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlistered Green Beans with GarlicBy Chris MoroccoJanuary 23, 20194.8(76)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintInspired by salty-crunchy Sichuan dry-fried string beans (gan bian si ji dou), these green beans are shriveled and browned into delicious submission before receiving a flavor bomb of garlic, red pepper flakes, and chopped capers at the very end. Resist the urge to stir the beans around in the pan, and let them take on color like you would ground meat. Patience is essential here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonSplatter Screen$18 At Williams SonomaTongs$13 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients4 servings⅓cup extra-virgin olive oil1lb. green beans, trimmed, patted dry of any surface moisture or condensationKosher salt6garlic cloves, sliced1Tbsp. capers, drained, chopped1tsp. crushed red pepper flakesPreparationStep 1Heat oil in a large skillet over high until shimmering. Add green beans (the dryer they are, the less they will spatter when they hit the oil) and cook, covering skillet as needed if beans are spattering, until browned underneath, about 3 minutes. Turn beans with tongs and redistribute so they brown evenly (don’t toss them since hot oil can easily slosh out of skillet if you try to show off). Continue to cook, turning occasionally, until browned all over and tender, about 5 minutes longer. Season with salt. Add garlic, capers, and red pepper flakes. Cook, tossing occasionally, just until garlic turns golden, about 1 minute.Step 2Transfer beans to a platter. Spoon caper-garlic mixture over and pour some oil over too; season with salt.How would you rate Blistered Green Beans with Garlic?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleI just made it for my parents sine a nice friend got me a big bag of fresh green beans and I'm using them!  Loved it!  AnonymousAZ1/26/2022Love this recipe; absolutely delicious.  The only suggestion I have is to dramatically cut the olive oil.  The first time I made it, it was much too oily.  The second time, I used two tablespoons, which was perfect.SueBlueOakland, CA11/18/2021Excellent!  Another Chris Morocco win!!!  I've made this a few times.  A couple of things I've changed:\n1.  1 lb of beans in my 13\" cast iron skillet is a little too crowded.  3/4 lbs works about right.\n2.  By the time you get the beans all turned over to cook on the second side, it only takes about 3 minutes to finish, since you also need a couple minutes after you add the garlic and capers.  In other words, it's easy to let them get overdone.\nSnorkelPortland, Oregon10/30/2021This recipe understandably smoked up my kitchen but the results were delicious!  A simple, delicious side.  LindseyRichmond, VA9/17/2021The end result was delicious but what an absolute mess to make this! I dried the green beans with a tea towel and even let them sit on the counter for an hour before frying, but the oil still sputtered and splattered everywhere (OUCH). I think I might try tossing the beans in oil and roasting in a hot oven to see if I can get similar results. Clare KLos Angeles, CA9/14/2021Love this recipe! This is the only way I make green beans now. :)IdunPhilly, PA7/25/2021This was delicious.  The topping would be good on other veggies too; I'm thinking roasted broccoli or cauliflower -- yum!LoraSeattle7/19/2021These blistered green beans are one of our family’s favorites! Thank you Chris for this amazing simple flavor bomb recipe! Cobi LemkeCalifornia 6/18/2021Added kalamata and castelvetrano olives as well—YUMjaneBerkshires, MA 1/25/2021i really enjoyed the recipe!  i added cayenne pepper, balsamic vinegar and a little bit of lemon juice at the end.patrickmanhattan ny1/12/2021Simple tasty restaurant style blistered beans. DLegatsColumbus, Ohio 11/30/2020This is it. You found what you’re looking for no need to search any longer. These ARE the best string beans I’ve ever had in my life..... I will say I did cook mine for like 20 min because I like them very crispy burnt lol but WOW so much flavor. They’re amazing. Let this be the review that makes up your mind. I’m telling you. MAKE THIS!! Follow the recipe exactly! Emily0106New york10/16/2020This is simply THE BEST way to cook green beans. Get that oil HOT! I see this was so good they included this recipe again in the September 2020 issue. I'm not complaining. I don't mind repeats of 5-star dishes like this!carriespnc9/15/2020Quite tasty--I blistered the green beans in a wok, split into two batches for better surface contact. Following the other reviewers, I used plain vegetable oil since EVOO has a lower smoke point, then drizzled with a little EVOO at the end for flavor. Make sure to salt generouslyAnonymous9/13/2020Fabulous dish. Made it for four and everyone loved it. Not a single green bean left at the end of dinner. Will definitely make this again and again. Ron BlumenthalChicago9/7/2020Explore Bon AppétitGreen BeanVegetableGarlicEasyQuick5 Ingredients or FewerSideVegetarianVeganDairy-FreeGluten-FreeNut-FreeSautéPassoverHanukkahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-23", "author": ["Condé Nast", "Chris Morocco"]}