{"id": "b0c3348471a2acb4787d88b689a3727b", "url": "https://www.bonappetit.com/story/recipe-developer-diet", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "The Not-So-Glamorous Diet of a Recipe Developer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Not-So-Glamorous Diet of a Recipe DeveloperOr, how I ate potatoes for a whole week straight.By Christina ChaeyAugust 8, 2021FacebookTwitterEmailPhoto by Ben DeweyFacebookTwitterEmailEvery month Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.I’m sure this has something to do with how I was raised to not waste food, but every time I accidentally over-buy an ingredient, I become obsessed with planning how I’ll use the extras, overly concerned with making sure nothing goes to the bin.Unfortunately, over-buying ingredients is a practically mandatory part of being a recipe developer. I frequently have to make a dish a few times before getting it right, which means I usually have to buy three times as much as I need.This also means I’m usually trying to find ways to use up leftover ingredients that I don’t necessarily feel in the mood for. Recently, while working on a recipe for our Thanksgiving issue, I ate potatoes for every meal for almost a week straight of 90-degree days. And not just any potatoes—bad potatoes. FAILED potatoes. Potatoes that stubbornly stuck to the bottoms of skillets, gummy and gluey potatoes, potatoes that refused to brown when I wanted them to. The life of a recipe developer—glamorous, yes?But for every never-ending game of Tetris I play trying to fit all my recipe-testing groceries into my fridge, there are a few upsides to the job—not having to pay for said groceries is a big one. Over the last few months of testing recipes at home, I’ve also amassed a collection of ingredients I wouldn’t normally purchase, which have eased some of the drudgery of pandemic cooking and gotten me excited to play around with different flavors and techniques.I have three pounds of Thai khao niao, or sticky rice, something I loved to eat but had never cooked at home before editing a story in BA’s August issue by the extremely talented cookbook author Leela Punyaratabandhu. She taught me that khao niao is best for soaking up saucy and brothy dishes, which means that leftover rice will make a perfect side for some of the extra-saucy braising recipes we recently developed for our upcoming September issue.I have rum in my home bar for the first time since college (Denizen Merchant’s Reserve, not the Captain), thanks to a deliciously boozy test of a Mai Tai recipe that associate food editor Rachel Gurjar developed, which I want to drink right up until sweater-weather. Having rum on hand has also gotten me experimenting with different recipes for a daiquiri, a perfect cocktail I love to order but had never thought to make at home. (I may also have to try this strawberry version by the bar director Nahiel Nazzal before the season’s end).And remember those potatoes I mentioned earlier? After many failed experiments and one successful one, I found myself with almost seven pounds of leftover Russets and exactly zero desire to eat another bite of potato in this life. Not wanting them to go to waste, I spent Sunday afternoon making potato gnocchi, yet another dish I’d never made before. I don’t own a potato ricer and had no idea what I was doing and, frankly, the gnocchi were just okay, kinda gummy. But the experience of bringing potato and flour and egg together to create a soft dough and rolling and cutting out the gnocchi was invigorating, so different from the broccoli omelets and quesadillas and whatever the hell else I’ve been making on auto-pilot these many months at home. I froze most of the gnocchi for when I’ve recovered from potato fatigue, at which point I’ll take senior editor Sarah Jampel’s Sheet-Pan Gnocchi out for a spin.Photo by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykSummer FlavorsTomato GaletteClassic Banana PuddingSalted Strawberry DaiquiriKhao NiaoCucumber, Tomato, and Green Bean SaladSheet-Pan GnocchiExplore Bon AppétitWhat's Chaey Cooking?LifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-08", "author": ["Condé Nast", "Christina Chaey"]}