{"id": "b0cd5e3f26766cb2e7e12d5a9c6ccf55", "url": "https://www.bonappetit.com/story/texas-workers-defense-program-storm-aid", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "A Month After the Storm, Texas Workers Defense Project Volunteers Reflect on What “Paying It Forward” Really Means | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Month After the Storm, Texas Aid Volunteers Reflect on What Paying It Forward Really MeansIn the absence of robust government assistance, organizations that don’t usually deal with disaster relief stepped in to help get hot meals and water to those in need. Here, two volunteers look back on the experience, and ahead to the future.By Priya KrishnaMarch 24, 2021FacebookTwitterEmailPhoto courtesy of BASTAFacebookTwitterEmailIn February a winter storm blew through Texas, leaving over a million people without heat or water. Suddenly, people couldn’t cook. They didn’t have water to drink. And because the roads were snowed over, they couldn’t even go to the supermarket. With the pandemic layered on top of this, the situation became a full-blown humanitarian crisis.In the absence of robust government assistance, much of the work to help struggling communities fell to local organizations, like the Workers Defense Project and Building and Strengthening Tenant Action (BASTA). Neither of them typically do food distribution; the Workers Defense Project advocates for the rights of low-wage and immigrant workers. BASTA focuses on helping renters in Austin get affordable, safe housing. Yet together these organizations mobilized hundreds of volunteers to bring hot meals and water to those around Texas that needed it most, working with Good Work Austin’s community kitchen program and World Central Kitchen to source food from local restaurants. They created distribution centers in parking lots and dropped off meals to those who couldn’t get out of their homes.We spoke with two volunteers for these efforts in Austin—Ana Isabel Garcia, a house cleaner, and Carolina Isabel Antonio, her 14-year-old daughter. The two found themselves without water in the early days of the storm and received hot meals through BASTA and the Workers Defense Project. They decided it was important to pay that kindness forward by joining BASTA and the Workers Defense Project’s efforts, and help those who were still in need. They told us what the situation was like on the ground, and why aid remains critically important, even a month after the storm.How did you find out about the Workers Defense Project and BASTA?Ana Isabel Garcia: I found out about the organization from Facebook. They helped us a lot during the storm with food and water.Carolina Isabel Antonio: The only thing we lost during the storm was water. That was a really stressful thing because that is how my mom cooks and cleans vegetables. So we got cooked food and water [from WDP and BASTA] and we were really grateful. It was our turn to help other people.What was it like during the storm where you all live?CIA: Everybody lost water for almost a whole week. People were stressed out because they couldn’t go to the restroom or cook. What we started doing was getting water from the pool. Someone opened the gate and all the people that live in our apartment complex went to grab water with buckets and pots. The other thing was the snow on the roads. People couldn’t get out to get food because there was a lot of snow. So we grabbed shovels and started clearing snow so that people could go to the store.Why did it feel particularly urgent for you all to go out and help?CIA: A lot of people needed water. Their lights went out, their heaters went out. The government didn’t give no water, no food, they didn’t give nothing. Plus with the quarantines, it’s already hard. You try to go to the store and there is barely any food.AIG: And a lot of the older people couldn’t even go outside, so we were taking food to people’s homes.What was it like when you were volunteering?CIA: We went to the office of [the Workers Defense Project] and there was a line of cars. We were just handing out food and water. [The organizers] also told us which apartments needed water and food and we would go there. It was amazing to see how much communication there was to get people what they needed.What kind of hot meals were you handing out?AIG: First off, it was healthy food. And food that we are accustomed to, like chicken and rice. I am so grateful for the restaurants that offered hot meals, because many people didn’t have a water filter so they couldn’t cook [Editor’s note: In many counties, notices were issued that those who did have water shouldn’t consume it without filtering or boiling due to concerns about contamination]. I remember, when I was a recipient of meals, one that I really liked had chickpeas, mushrooms, and rice. The portions were also really generous.CIA: People were so shocked that we were giving them food that had the meat and rice and the good essential things the body needs. At first they didn’t want to take it because they thought it wasn’t free. Once I said it was free they would take a good amount. My mom would describe the food to them. She is really into flavors.AIG: I would say that the food is delicious and healthy. They would try it and say, “Wow!” Everything had great flavor.CIA: They even told me, “There are usually not people helping our community out here, and the fact that you are doing it is amazing.”Was it helpful to people that you could tell them, “We ate these meals just a few days ago, as we were in the exact same situation”?CIA: Yeah, some people saw the food and were like, “No thank you.” But once we put the food down and told them it’s good, they were like, “If they like it, we are going to like it.”What were some standouts from the meals that you all served?AIG: There was a brisket with rice and spinach. I added soy sauce to the rice.CIA: I don’t really like vegetables. But I ate all the vegetables on that plate!AIG: I have tried brisket, but I haven’t tried it with spinach. I had tried all these things, just not together. It was familiar enough. I knew if that was how I felt, that is probably how other people felt.CIA: I thought the food was going to be like the lunch from my school. But I was impressed by the flavor. When my mom first brought the meals home I thought she had cooked them.What were some of the reactions from the community as you were distributing meals and water? Any particular stories that stand out?AIG: I remember when we told them that everything was free, their expression would change. This is what impacted me the most. Seeing just how much they needed these things.CIA: It was amazing to see how people would communicate with their neighbors to help each other. I wish the whole community in Texas and around the world would be like that—just trying to help each other out, no matter if it is a stranger.What were the biggest challenges as you were volunteering?AIG: A lot of people didn’t realize the food was already cooked, and they thought they would have to prepare it themselves. So some tried to turn it away, saying they didn’t have heat or water. And when we were giving out food, we always wore masks, we sanitized our hands, even the pens. But some people didn’t wear masks.CIA: We were giving away food in a lot of apartment complexes, and the people who worked in the apartments, the managers, some of them didn’t like us coming to their buildings. They were like, “No don’t give water away, don’t give food away.” We were just trying to help.What have you learned from all of this? What do you think the long-term impact of the storm will be on the Texas community?AIG: Our apartment has water, and everything is good. But there is still a lot of help that this community needs, and people in Texas without running water.CIA: As a kid, I have learned that the government will not do a lot of things for the community. We have to help each other for us to be in a good stable place. A lot of people are in need, while we are just over here minding our own business. The more we help people, the more we will understand how many people need help.AIG: We plan on continuing to volunteer.The storm happened in the middle of a pandemic that continues to ravage the country—and especially Texas. What do you think of Governor Abbott’s recent decision to eliminate the state’s mask mandate and allow businesses to open at full capacity?CIA: I think it is so unprofessional. How can you say that you are going to allow people to not wear masks when the virus is still out there? Just because the vaccine is out doesn’t mean there aren’t still people dying from COVID.Ana Isabel, have you been able to get the vaccine?AIG: I’m still waiting.You can support the Workers Defense Project and BASTA by making a donation, or if you’re local, signing up to volunteer for their efforts.Explore Bon AppétitTexasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-24", "author": ["Condé Nast", "Priya Krishna"]}