{"id": "b0e5055e4fb3e0ec2025c1ea68340584", "url": "https://www.bonappetit.com/story/one-pan-party-pork-roast", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "This Pork Loin Roast with Potatoes and Kale Is a One-Pan Feast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Can Feed a Whole Lot of People with This One-Pan Pork RoastThis party-friendly pork with potatoes, leeks, and kale is an entire holiday feast in a pan.By Alex BeggsDecember 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailI was doing a Christmas Eve trial run on a Wednesday night and the entire apartment smelled like Christmas. Not from a candle or a six-foot Frasier Fir or anything. From pork. The pork roast in the oven was fumigating every room with toasty fennel seed, peppercorn, and cinnamon. Oh, it was nice.This party-friendly pork roast recipe was developed by Molly Baz to solve a holiday stress point: What big, impressive hunk of meat will feed 10 people...affordably? And what else is on the menu? How do I time my oven right to make it all happen? Will there be potatoes?The party pork roast is the answer. In one roasting pan we have two bone-in pork loin roasts on top of a bed of three pounds of potatoes, five leeks, two bunches of kale, and two and a half heads of garlic. Don’t worry, it all fits.I pulled this off in the middle of the week by seasoning the pork on Tuesday—and leaving work early on Wednesday, honestly. At Bon Appétit you can leave the office early “to roast pork” and you won’t be punished, but otherwise I might have gone with “dentist appointment.” I took the pork out of the fridge at 3:30 p.m. (to come to room temp), and it went into the oven at 4:30. We ate at around 8:30 and it was the juiciest pork I’d ever had, with golden brown skin. You’d assemble a bite with some creamy potato, a clove of roasted garlic, and leaf of crispy kale. Then, cue the Mmmmms. The fennel-cinnamon rub ends up pretty subtle but my guests were like, “is that...cinnamon?” In a good way. They devoured it.This is a one-pan recipe, however, do NOT assume you put everything in the pan and then wait it out. To achieve juicy-pork-crispy-skin, and to cook the potatoes fully, there’s some back and forth that happens, plus a crucial garlic butter baste. I viewed it as three rounds of action.See that skin? Damn.\nPhoto by Chelsie Craig, Food Styling by Kate BuckensRound 1: The first hour and ~40 minutesThe oven’s at 275°. In the pan we have potatoes, leeks, thyme, and garlic, tossed with a ton of olive oil and salt. The pork rests on top of all that, brushed with some melted garlic butter you made. Every 30 minutes you baste with that butter. You want juicy pork, right? When the pork hits 120°, take it out for its first rest, tented in foil to stay warm.Round 2: The next 30-45 minutesAbout those potatoes. Mine were big, and they were not cooked at this point. Crank the oven to 500° and continue roasting until the potatoes are tender.Round 3: The final 40-50 minutesAfter the pork has rested during that 45 minutes (and it can rest up to three hours, if you’re really planning ahead), it goes back in the oven for the final, golden-brown skin roast under that high 500° heat. THIS TIME though, you’ve added the kale in with a few tablespoons of apple cider vinegar for tang. The pork goes back on top of all the veg, and it’s done when it’s reached 130°—which could be as fast as 10 minutes depending on how long the meat rested, but my oven runs a little low so it was more like 30. And finally-finally, the pork has to rest another 15 minutes after coming out of the oven and before you slice in and discover that incredibly juicy, buttery center. Then arrange the slices over the vegetables on a platter and let the pork party begin.Get the recipe:Party-Ready Pork RoastInstead of using one larger bone-in pork loin roast, this recipe calls for two smaller ones. This allows for more exposed surface areas, which decreases cooking time and develops a delicious golden brown crust.View RecipeExplore Bon Appétitholiday2018Pork LoinPartyRoastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Alex Beggs"]}