{"id": "b0f5409efc7bee88f850b5bb09abe5e0", "url": "https://www.bonappetit.com/story/holiday-halva-recipe", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "You Should Send Your Guests Home with Halva | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHere’s an Idea: Don’t Serve Dessert at Your Holiday Party at All This YearSend your guests home with a slice of sweet-savory halva instead.By Jesse SparksDecember 20, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Sue Li, prop styling by Kalen KaminskiFacebookTwitterEmailI don’t know when or where people got the sick notion that the holidays should be about rushing or working until the last minute. Trash. Doing the most for the holidays DURING the holidays isn’t going to get you anything except a headache. This is doubly true when it comes to holiday desserts. Sure it sounds crazy, but here’s a thought: Don’t do it. Heaps of butter and sugar have been following your guests everywhere they’ve gone this past month. Why not offer them something on their way out the door—something rich and delicious they can enjoy on their own time? Why not Andy’s new recipe for salted chocolate halva?The whole recipe for this sweet-savory dessert is basically a series of dumping things into other things: mixing tahini with salt and sesame seeds; then mixing that with a sugar-water concoction. And then dumping melted chocolate on top of that. But that doesn’t mean it’s effortless. To pull this off, you have to have some finesse, timing, and one very special tool. That said: Don’t even try to do this without a candy thermometer. You know, that metal contraption that attaches to the sides of pots and saucepans and helps ensure that you never burn sugar (and other things) again? As much as we love them, most meat thermometers aren’t built to accurately and consistently read the temperatures of liquids, and this is absolutely required to make this thing work.Here’s where the finesse and timing come in, so listen up! After you’ve prepared a pan, mixed your tahini-sesame-salt mixture, and brought your sugar water concoction to the perfect temperature, you have to immediately remove it from stove and gradually stream into the savory stuff, mixing constantly with a spatula. Continue to mix just until the halva comes together and starts to pull away from the sides of bowl. This will happen fast—as in, in under a minute fast. So be careful not to overmix or it will become clumpy instead of flaky, and you want that layered, crystalized perfection. Then, working just as quick, dump that bad boy into the pan and let it cool for a bit. You’ll start melting your chocolate, and when it’s ready, pour it over your newly set halva (which you’ve slid out of the pan by now), top with some edible flowers (you can find ‘em at spots like Whole Foods), and high five yourself. After letting the chocolate set for 30 more minutes, you’ll be ready cut and package your holiday halva.By the time your friends unwrap their party favor at home (however many days later), they’ll be blown away—and probably ready for dessert again.Get the recipe:Salted Chocolate HalvaSalt and bittersweet chocolate lend a savory, sophisticated edge to this typically saccharine-sweet dessert.View RecipeExplore Bon AppétitSaltChocolateTahiniCandyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Jesse Sparks"]}