{"id": "b1028e95edce4db6ef7b36372a58336c", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/alibi-room", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Alibi Room Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverAlibi RoomVancouver’s original craft beer bar in a quiet corner of GastownFacebookPinterestTwitterEmailGrant HarderGO HERE: to hang with all the East Van beer-loving locals. There’s an impressive 50 taps of both local and imported craft beers at Alibi Room, and they all have your name on them.ORDER: something from local breweries Four Winds or Brassneck, the latter of which is run by Alibi’s owner, Nigel Springthorpe. Get a burger or the jalapeño chicken “samwich” with fries, if you start to feel hangry.THE VIBE IS: laid-back and friendly, with life buddies, work buddies, and plenty of flannel. You’ll overhear deep conversations about everything, from new video games to upcoming canoe trips. Despite its large industrial-heritage digs, Alibi Room is still crowded most nights, so you might have to wait a few minutes outside on Alexander Street before ordering your first brew.PRACTICAL STUFF: Open every day: Monday to Thursday, from 5 p.m. to 11:30 p.m.; Friday, from 5 p.m. to 12:30 a.m.; Saturday, from 10 a.m. to 12:30 a.m. (brunch from 10 a.m. to 2:45 p.m.); and Sunday, from 10 a.m. to 11:30 p.m. (brunch from 10 a.m. to 2:45 p.m.). Reservations are occasionally taken, but there are a lot of rules. We prefer to just walk in.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEThe DiamondProhibition-era glam (and meticulously made cocktails) in GastownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-14", "author": ["Lindsay Anderson"]}