{"id": "b114c3a16fadfd1888b9a621d73879a2", "url": "https://www.bonappetit.com/recipe/pull-apart-breadsticks", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Pull-Apart Breadsticks Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPull-Apart BreadsticksBy Bryan FordOctober 25, 20204.3(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'mytrek Brown EmailPinterestPrintEmailPinterestPrintWhen a recipe calls for sopping up sauce, these breadsticks are your sopper-uppers of choice. Topped with Kalamata olives, garlic, red onion, and Calabrian chiles, they’re also just as good on their own—serve them straight from the oven and let everyone rip them off with their hands. This recipe comes from Bryan Ford and is based on his Master Bread Dough. Feel free to customize them with whatever finely chopped toppings you desire; just be sure to press them into the dough so that they stick.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketCutting Board$10 At IKEAChef's Knife$34.53 At AmazonBench Scraper$8 At AmazonIngredientsMakes 62Tbsp. extra-virgin olive oil, plus moreBread flour (for surface)Master Bread Dough2oil-packed Calabrian chiles or 2 strips roasted red pepper from a jar¼red onion3garlic cloves¾cup pitted Kalamata olivesDried oregano (for serving)Flaky sea saltPreparationStep 1To make this recipe, start by preparing one batch of the Master Bread Dough.Step 2Lightly coat an 18x13\" rimmed baking sheet with extra-virgin olive oil. Lightly flour work surface with bread flour and turn Master Bread Dough out onto surface. Shape dough into a 1\"-thick rectangle. Use a chef’s knife or bench scraper divide vertically into 6 pieces. Stretch each piece to 12\". Arrange on baking sheet, allowing pieces to touch.Step 3Brush tops of breadsticks liberally with oil and cover with a kitchen towel. Let rest in a warm, draft-free spot until soft to the touch, 1½–2 hours.  Step 4Meanwhile, finely chop 2 oil-packed Calabrian chiles or 2 strips roasted red peppers from a jar and measure out 2 Tbsp. Finely chop ¼ red onion and 3 garlic cloves. Coarsely chop ¾ cup pitted Kalamata olives.Step 5Place a rack in middle of oven; preheat to 450°. Top breadsticks with garlic, then olives, chiles, and onion, pressing gently into dough to adhere. Drizzle with remaining 2 Tbsp. extra-virgin olive oil and sprinkle with dried oregano and flaky sea salt. Bake until golden brown, about 25 minutes.Photo by Emma Fishman, Food Styling by D'mytrek Brown How would you rate Pull-Apart Breadsticks?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleIncredible recipe. Thank you for providing the precise weight measurements. I have found it very important for measuring my ingredients especially when I was learning how to make sourdough bread. It was my first time working with a poolish and it turned out great. I will definitely be making this again. Sue S Edmonton, Alberta11/10/20205 stars for publishing this recipe with the incredibly helpful metric system. USAAnonymous10/26/2020One star for publishing this recipe with the archaic backwards metric system.  U.S.A.Anonymous10/25/2020Explore Bon AppétitBreadBread FlourFlourYeastOther IngredientsSideNut-FreeVegetarianDairy-FreeVeganBakingDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-25", "author": ["Condé Nast", "Bryan Ford"]}