{"id": "b11c19ce379a592450d364a586fa7633", "url": "https://www.bonappetit.com/recipe/broccoli-cheddar-soup", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Broccoli Cheddar Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBroccoli Cheddar Soup With Cheesy CroutonsBy Sarah JampelFebruary 4, 20224.5(124)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Yekaterina Boytsova EmailPinterestPrintEmailPinterestPrintOur better-than-ever broccoli cheddar soup recipe is lighter and brighter than some you may have had in the past. It boasts a creaminess that comes from blended potatoes and broccoli stalks rather than heavy cream or the roux that many recipes call for—which means that, minus the optional garnish, this creamy soup is also gluten-free. Grating a block of sharp cheddar is crucial for this comfort food classic as the preshredded stuff is often mixed with an anti-caking agent that can wreak havoc with the silky texture of this delicious soup.The other main player in broccoli cheese soup is, of course, the green stuff. The broccoli florets play two roles in this recipe: Half are added to the puréed base lending it a verdant hue, while the rest are mixed in toward the end, offering a nice crunch to break up the richness. Finally, in a nod to crusty bread bowls, we’ve added cheddar-topped croutons to every serving.For a dairy-free broccoli soup, check out Andy Baraghani’s recipe with turmeric, peanuts, and crispy shallots or Hetty McKinnon’s broccoli and cashew number for a cream of broccoli soup experience that is completely vegan.Editor’s note: This recipe was originally published October 14, 2020.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEADutch Oven$80 At AmazonWooden Spoon$6 At AmazonVegetable Peeler$10 At AmazonCake Tester$3 At AmazonBox Grater$13 At AmazonBlender$32 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketIngredients4 servings2onions4garlic cloves3Tbsp. unsalted butter½tsp. crushed red pepper flakes, plus more for sprinklingKosher saltFreshly ground black pepper2heads of broccoli1medium russet potato8oz. sharp cheddar cheese4thick slices rustic white bread, optional½cup plain Greek yogurtPreparationStep 1Halve 2 onions. Peel and coarsely chop. Peel and smash 4 garlic cloves, then coarsely chop. No need to break out your best knife skills because it’s all going to get blended, but try to cut everything into somewhat even pieces so they cook at the same rate.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Melt 3 Tbsp. unsalted butter in a large Dutch oven or pot over medium-low heat. Add onion, garlic, and ½ tsp. red pepper flakes; season with salt and black pepper. Stir to combine, then cover pot and cook, stirring occasionally, until softened and just starting to take on color, 8–10 minutes.Step 3Meanwhile, trim bottoms of 2 heads of broccoli, then peel. Separate hefty stalks from florets (the thin, little stalks attached to broccoli tops are fine to leave attached to the crowns). Set aside florets. Coarsely chop stalks into 1\"–2\" pieces. Peel 1 medium russet potato. Coarsely chop into 1\"–2\" pieces.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Add broccoli stalks and potato pieces to pot and stir to coat in butter. Pour in 5 cups water, add 1 Tbsp. salt, and bring to a boil over high heat. Reduce heat to medium-low and keep at a simmer. Cover pot and cook until broccoli stalks and potatoes are completely tender (test with a cake tester, paring knife, or fork), 20–25 minutes.Step 5Meanwhile, chop reserved florets into small pieces (you can take the time to separate them into baby florets or just have at them with your chef’s knife). Grate 8 oz. sharp cheddar cheese on the large holes of a box grater. You should have about 2 1/2 cups.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Add half of florets to pot, cover, and cook until bright green, 3–5 minutes. Transfer to a blender, let cool for 5 minutes, and purée until smooth. Some blender advice: Don't fill your blender more than halfway—work in batches as necessary. To avoid explosions, remove the center lid from the blender and cover with a kitchen towel. Alternatively, use an immersion blender. Your soup won’t be quite as smooth, but it will still be great. Return purée to pot.Step 7Return to medium heat and add remaining florets. Cover pot and cook until bright green, another 3–5 minutes. Add 2 cups cheddar cheese and stir until smooth. Cover and reduce heat to low; set aside while you make the cheddar croutons.Step 8Heat broiler. Broil 4 thick slices rustic white bread (if using) on a rimmed baking sheet until lightly browned (watch closely: broilers vary dramatically in power!), 2–3 minutes. Turn bread over (soft side up), then sprinkle with reserved cheddar cheese and a few flecks of red pepper flakes. Continue to broil until cheese is bubbling and browned in spots, 2–3 more minutes.Step 9Remove soup from heat and stir in ½ cup plain Greek yogurt. Season generously with black pepper; taste for salt.Step 10Cut cheese toasts (if using) into 1\" (spoon-sized!) pieces. Divide soup among bowls. Top with cheddar croutons or reserved cheese.How would you rate Broccoli Cheddar Soup With Cheesy Croutons?Leave a ReviewTell us what you thinkReviews (51)Back to TopTriangleI have never had Greek yogurt in a soup like this but I think it’s part of what makes this recipe! I used a block of sharp cheddar and highly recommend it. It has plenty of flavor with using water or stock. This will be THE broccoli cheddar soup go-to from now on!Kristen PauliEdwardsville, IL3/16/2022A beautifully light version of broccoli cheddar soup! This one is a keeper!AnonymousPhiladelphia 3/13/2022I followed this recipe exactly. Pretty much the only thing I could taste were the onions. This could have possibly been my fault - maybe the onions I had were huge? maybe I should have cooked them longer? I will say that the cheesy croutons were fantastic. I have made them a few times to accompany other dishes. EricaLong Island, NY3/8/2022This is a great recipe. I’ve made it twice and modified it the second time. I used half water, half chicken stock. I added in a carrot with the potato and broccoli stalks. I also added a few chunks of American cheese with the cheddar. Delicious! I love the crisp tender broccoli pieces in the finished soup. MeghanWrightsville, PA2/17/2022I love ittAnonymous2/7/2022I’ve made basically this same soup for years using an old Mark Bittman recipe — sauté onions, garlic, add broccoli, a potato, water or stock, salt, simmer for 20 minutes, blend, add yogurt, or milk, or cheese  that’s it, very simple and easy. VictoriaNYC1/29/2022Great recipe. I made it a few times and my family loves it. Easy and quick recipe to follow. The only change I made is  I used chicken broth instead of water.ElenNew Hope,PA1/8/2022This recipe came out better than expected, but I made a few modifications. I always start broccoli cheddar soup with a mirepoix base (carrot, celery, onion) for more flavor. I used a rich vegetable stock instead of water and added 1 cup of great northern beans to add smoothness, creaminess, flavor, and protein. Any white bean would do. I chose to use an immersion blender, but I don't blend all the broccoli florets because I don't like the soup looking so green. I add tons of broccoli florets at the end to add more chunkiness and I omit the yogurt and don't bother with croutons. Yum! No Soup For You! Salem, MA1/7/2022I made this as directed and I love the light texture. I wish it had a little more depth of flavor. I will definitely make it again but I will experiment with using stock instead of water, and maybe adding a crumpled fresh bay leaf with the liquid and removing it before blending. \n\nI also like one suggestion below to add a few spinach leaves to amp up the green color because the broccoli loses color while it's simmering. I'll give that a try, too. Shaun C Atlanta, GA 12/26/2021Absolutely great recipe. Made a couple tweaks (some extra garlic, just threw the whole single cup of full fat Greek yogurt in) and made sure to salt to taste at the end (needed it). David PSan Francisco12/14/2021Unfortunately, we found this soup to be incredibly bland despite all the great reviews. \nAdded chicken Better Than Bouillon to the water, but it still required more salt, heat and acid (tasted very 'one note'). Several rounds of adding Keenes Hot Mustard powder, yellow mustard, more salt and bouillon, and finally Crystal hot sauce, and finally we had a flavourful soup\nI typically enjoy BAs recipe, but this one was a miss for us.AnonymousWindsor, ON11/8/2021LOVED IT!  What I loved just as much is watching the video steps that helps sooo much as I am often in a flurry an miss a step while reading a recipe.  Cannot believe this doesn't have cream as the texture is on par.LCoNORTHBRIDGE, 20637/23/2021Great and easy.  I followed recipe except used chicken stock instead of water ( I had some leftover in fridge), added only a small pinch of salt and did not add the yogurt ... I’m so happy to have a delicious cream and broccoli recipe that I can make myself, and avoid unhealthy additives. I will definitely be making this again !DaniFl2/2/2021So delicious! One of my favorite iterations of broccoli cheddar soup. I added in a couple handfuls of spinach with the florets before blending to really amp up the green color and used white beans instead of a potato for some protein which gave it that same creamy effect. Skipped the yogurt as other reviewers mentioned, definitely didn’t feel like I was missing anything!MaliaMinneapolis, MN1/24/2021Ohhh so yummy and filling! I held back on the salt as other reviewers suggested but added more to taste at the end. Also, my hand held immersion blender was my tool of choice and worked great. I used unsalted chicken stock instead of water and held off adding the yogurt to the whole pot of soup. Instead, offered it when ladling the soup into bowls. The cheesy croutons were a perfect topping. I know I will make this soup again and again.Victoria S.Central MA1/18/2021Explore Bon AppétitSoupSoups and StewsAmericanBroccoliVegetableCheddarCheeseYogurtOther IngredientsEasyOne-Pot MealsMainVegetarianNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-02", "author": ["Condé Nast", "Sarah Jampel"]}