{"id": "b124d5fdd40dfcab8044f89809729d74", "url": "https://www.bonappetit.com/story/lemoniest-lemon-pound-cake", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "This Is The Lemoniest Lemon Pound Cake You’ll Ever Make | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is The Lemoniest Lemon Pound Cake You’ll Ever MakeLemon juice, lemon zest, and lemon glaze make damn sure of that.By Carla Lalli MusicOctober 9, 2018FacebookTwitterEmailFacebookTwitterEmailBack in the day, when I was a personal chef, there was a lemon pound cake from Fannie Farmer’s Baking Book that one of my clients went bananas for (yep, I’m mixing fruit metaphors). It had everything you’d expect in a pound cake—butter, sugar, flour, lemon zest—and got a little tang from buttermilk. I thought that pound cake recipe was the end-all-be-all, until I made the Simplest Lemon Pound Cake. Not only does it get its lemony-ness from bonafide lemons, the recipe is packed with tips and advice in every step that provide an extra buffer of kitchen insurance for the novice baker. Also: It’s covered in a lemon icing before being served, sooooooo……Before you do anything, turn the oven to 350°, then butter and line a loaf pan with parchment paper; no matter what happens, this cake is not going to stick. Don’t use wax paper! Its plastic coating will melt in the oven and ruin your cake (and possibly the pan too).Next, make sure your butter is at room temperature. I like to take it out of the fridge before I even turn on the stove, and let it sit on the counter while I track down all my ingredients and measure everything out. As long as your house isn’t super hot (i.e., an un-airconditioned apartment in New Orleans in July), you can take the butter out of the fridge the night before and it will be ready when you are. How can you tell it’s at the right temperature? The butter will be matte on the surface (not shiny, which means it’s starting to melt), and it should still hold its square edges (if they’re sagged or slumped, the butter is too warm). Press your finger lightly against the surface; the butter should take the indentation without collapsing around it. You can speed this up somewhat by cutting the butter into tablespoon-sized slices first.To ensure true lemon flavor (no extract here!), we’re using both the zest and the juice of the lemons. First, combine the finely grated zest of two lemons with softened butter and sugar, and whip that mixture with electric beaters until it’s light, fragrant, and fluffy. The lemony aroma released as the essential oils in the zest are smashed into the butter are To. Die. For. This process is called “creaming” the butter and sugar, though it would be more accurate to just say “aerating,” because that’s what’s happening in the mixing bowl. The individual grains of granulated sugar act as tiny little sugar shards, and they actually cut through the butter as the beaters turn, creating little teensy pockets of air along the way. Real science! It’s important to beat for the full 5 minutes to maximize lightness at this stage; those little air bubbles will expand when the batter heats up in the oven, creating a beautiful domed, risen top to the cake. Zone out on the cool rippled pattern the butter makes as it is flung through the turning beaters—trippy!Next, you add the eggs into the batter one at a time, which helps them incorporate fully, and then there’s more high-speed beating to re-aerate the batter.The glaze is really something to look at.\nPhoto by Caleb AdamsFinally, the dry ingredients—flour, baking powder, and salt—are added in two increments, with a small amount of milk in between. Again, this ensures that the dry ingredients are absorbed completely by the butter-sugar-egg mixture; if you dump them all at once, the batter could end up lumpy. By this point, you’ve created all the air you need, and it’s critical to not overmix the batter once it smooths out. Overmixing will deflate those lovely bubbles you worked so hard on, and it will also activate the gluten in the flour, which is the stretchy-chewy protein that could cause the cake to become tough.While the oven bakes, make the icing, which is a miraculous 3-ingredient concoction: powdered sugar, lemon juice, and thin strips of lemon zest. Okay, TBH I found it a little challenging to cut wide strips of lemon zest into extremely thin slices, and I’m pretty comfortable with my slicing-and-dicing abilities. If you’re concerned that your knife and/or your skills are dull, finely grate the zest instead.When the cake comes out of the oven, you get to poke holes all over it and pour even more lemon juice into it. I was worried that this step was going to make for a soggy middle, but it didn’t. The steamy heat inside the cake absorbed the juice, adding another layer of fresh lemon flavor to the finished product. Do not skip! When completely cool, pour the lemon icing over the top, then stand back and marvel at the slow rivulets of glaze that run down the sides. You’ve created a moist, rich, but still blissfully light and tender cake that delivers citrus flavor on three dimensions: Cooked zest; fresh juice; sugared zest.As I forked into my thick slice of cake, I wondered if this would work with lime instead of lemon, and I think it most certainly would. Orange? A little sweeter, but yeah, will work. Mixed citrus in the winter months? Give it a try, and let us know how it turns out!Grab the recipe here:Lemon Pound CakeEvery cook should have at least one good dessert up their sleeve, and this classic, lightly-glazed lemon pound cake should be yours.View RecipeExplore Bon AppétitBasicallyBasically 10x10CakeLemonSugarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-09", "author": ["Condé Nast", "Carla Lalli Music"]}