{"id": "b13efd1e6c926cabc64199a0b4fedcfb", "url": "https://www.bonappetit.com/story/yogurt-moat", "year": 2019.0, "month": 1.0, "day": 5.0, "content": "How to Make a Yogurt Vegetable Dip to Serve Basically Anything On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Make Any Vegetable More Exciting With the Power of a Yogurt MoatTurn any salad-like jumble into a meal by surrounding it with seasoned yogurt.By Emily Fiffer and Heather Sperling January 29, 2019FacebookTwitterEmailPhoto by Ren FullerFacebookTwitterEmailEmily Fiffer and Heather Sperling are two editors-turned-restaurant-owners in L.A. We'll catch up with Emily and Heather regularly for stories, recipes, and dispatches from the front lines of Botanica, their women-led, vegetable-first kitchen.Soon after moving to LA, we discovered a local sheep’s milk yogurt so creamy, rich, and tangy that we began referring to it as “the magic yogurt.” The more we tested and tasted, the more we became obsessed with yogurt’s ability to carry various spices, aromatics, and flavor agents, morphing sweet, savory, or piquant, and complementing almost anything we paired it with. In pursuit of any and every opportunity to get it into our mouths, the yogurt moat was born.The concept is simple: It’s a salad-like jumble of flavorful, well-dressed components perched on top of and surrounded by seasoned yogurt. When we say “moat,” we mean it: There should be a wide ring of creaminess encircling your tower of flavorful produce loveliness.Try topping chile-yogurt with roasted sweet potatoes and torn mint.\nMichael Graydon + Nikole HerriottHere’s how to make the moat magic happen: Depending on how thick you want your yogurt moat to be, you could go ahead with store-bought Greek yogurt, or you could strain regular organic, full-fat yogurt through a nut-milk bag or cheesecloth to your desired level of thickness. In a few hours, it’ll be like Greek yogurt, while an overnight strain in the fridge will get you closer to labne.Next, choose your base flavor: The moat is meant to complement whatever you’re piling on top of it, so ideate accordingly. A few of our favorite bases: microplaned garlic, lemon juice and zest, ground cumin, sea salt; liberal drizzles of chile oil and sea salt; lime juice and zest, sea salt and Aleppo pepper; orange juice and zest and a drizzle of maple syrup; sumac, lemon juice and zest, sea salt; zhoug, harissa or chermoula; burnt honey. Whatever route you go, it should be seasoned to the point of maximum deliciousness, a.k.a you could just skip the whole toppings thing and eat a bowl of it plain.But no skipping, you’ve got a moat to make! Spread your yogurt in a circle on a serving dish and artfully pile your salad on top. As with the base, the topping should be a thoughtful, well-seasoned combination that would be lovely on its own but will be next-level on top of its yogurt perch.Spicy cumin-serrano yogurt is the perfect base for grilled carrots.\nAlex LauTry roasted root vegetables (carrots, beets, delicata squash) tossed with arugula, lemon, olive oil and sumac atop a garlic-lemon-cumin moat; spoon some chermoula, zhoug or salsa verde over the top, or shower everything with dukkah, and you’ve got yourself a stunner. Try nestling poached eggs and lemony salad greens atop the chile oil moat for a play on a Turkish dish, çilbir. In summer, there’s nothing better than a moat of salted, garlicked yogurt piled high with roasted tomatoes and shallots, fat slices of heirloom tomatoes, packed with basil and drizzled with garlic oil.Moats can even take an everyday salad to the next level; try fresh figs, toasted walnuts, arugula and shaved fennel, with a honey-sherry vinegar dressing on a moat stirred through with orange zest, salt, and a smidge of garlic. Toss a salad of shaved rainbow carrots, shallots, chopped dates and toasted pistachios with lemon, olive oil, baharat, and salt and pile it on a zhoug moat. If your dairy leanings tend toward the sweeter side, roast seasonal fruit in aromatics (our go-to: star anise, vanilla bean, orange juice, and white wine) and serve it over yogurt stirred through with vanilla bean seeds and orange zest.The final step: herbs! Always herbs. Whether sweet or savory, garnish with herbs galore. Tarragon and mint are lovely when skewing sweet; everything is fair game for savory.We’d love to hear about your creations: DM us @botanicafood with all your feats, questions, and concerns. Happy moating!Explore Bon AppétitHealthyishBotanicaYogurtLos AngelesGreek YogurtRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-29", "author": ["Condé Nast", "Emily Fiffer", "Heather Sperling"]}