{"id": "b14090c288c92158544205a8fdbe1ac3", "url": "https://www.bonappetit.com/story/trader-joes-june-2021-reviews", "year": 2021.0, "month": 6.0, "day": 5.0, "content": "Trader Joe's Products Are Strong in the Frozen Aisle | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureTrader Joe’s Summer Lineup Is Very, Very Cold Thrilling new ice cream treats and much more, reviewed with sticky fingers.By Alex BeggsJune 30, 2021FacebookTwitterEmailFacebookTwitterEmailGet home quick, because your haul of Trader Joe’s new frozen treats will soon be sweating as much as the hidden valleys beneath my boobs. It’s a strong lineup this sweltering summer, from coffee boba ice cream to vegan ice cream bon bons to a tangerine take on Creamsicles (my favorite). Stock your freezers, keep your body dry to avoid fungal infection, and snack through the heat with the help of Mr. Joe and yours truly, offering my honest reviews of what’s new, below.Several SaucesOrganic Spicy Honey SauceAfter diving into honey recently, I learned that Brazil, Mexico, and Hawaii are the only sources of organic honey right now. It’s really hard to tell bees what to pollinate! Anyway. The honey is dark and tastes of molasses and Back Cherry White Claw someone left in your fridge (for a reason), while the spice seems to exist only to cover up the meh honey. Sorry Joe, I’m sticking with Mike’s.Related: The Snack Queens With Alex Beggs and Andrea HernandezContentThis content can also be viewed on the site it originates from.Dill Pickle MustardAs delicious as it is genius.Chile Lime MayoAs disappointing as it was promising.Bloody Mary SalsaBloody Mary but make it chunky. This doesn’t feel right to me without vodka in a pint glass with a toothpick loaded up with mortadella, ambiguous cheese blocks, and jumbo green olives. But if you l-o-v-e horseradish, go for it.A Single Wedge of CheeseMobay CheeseI was constantly presented with comparisons to my own sweating body this month, and this precipitous cheese was one of them. She sweats. But the mild, creamy goat’s milk cheese is a great intro to goat’s milk cheese that isn’t a log covered in blueberry jam. The varicose blue vein of ash down the center is for show, and show it does, but you won’t taste anything. A good cheese with subtle notes of bahhh. Will bahhh again.Drinkable LiquidsSparkling LemonadeThis is the adult mixer you’ve been waiting for. Sparkly, acidic, sweet. This + tequila would be a sunny, easy cocktail. It’s got enough sugar to rot my teeth and awaken the diabetes gene swimming around my bloodstream—but damn, it’s tasty.Ultra-Filtered Reduced Fat MilkA clever rebranding of lactose-free milk. I remember my grandparents’ fridge always having a clinical carton of Lactaid, a bottle of white grape juice, and a bottle of purple grape juice, and even preteen me knew I was being presented with three terrible refreshment options. This is lactose-free milk. I foamed it up for a cappuccino and couldn’t tell the difference between this and lactose-full milk. Yay?Wheat and Sugar AlternativesCauliflower Pizza CrustThere’s cheese in it! These are delicate and tend to crack and crumble when woman-handled, but the fact that they’re laced with Parmesan makes me a forgiving customer. I air-fried one and it burnt around the edges before getting crisped up anywhere else, but I really like this as a wheat alternative. (FWIW it’s much better than the gaseous cauliflower thins.) I cut it into wedges and served it with every dip in the fridge for Dip Lunch. I suppose you could make a pizza with it, but I don’t think the crust can really hold up much—baker beware.Allulose Sweetener BlendA low-cal not-sugar that you can put in your body, if you choose to.Chips and FriendsCrispy Peanut Butter Filled Milk Chocolate PeanutsNow THESE are a good time. Heavy on the chocolate coating, but innovative and only slightly melted, misshapen, and lumpy. They’re shaped like cartoon peanuts and that’s funny. Is this what a trompe l’oeil is? I dunno, I took French in a two-week intensive that NYU should refund me for. Little pieces of crispy rice in the PB filling give your teeth something to look forward to.Almond Butter Filled Pretzel NuggetsEven better than the peanut butter ones, which was heretofore thought to be impossible. Salty, thick pretzel exterior and soft almond butter inside. I make an after-school snack bowl with a handful of these and some cut strawberries. Let life be this simple.Everything But the Bagel Seasoned Kettle-Cooked Potato ChipsSome chips are huge, huge! And I never trust a giant chip. These give you onion breath so rank you’ll want to brush your teeth, clear your Chrome history, and go to church to cleanse your soul from the outside in. Does “Everything” seasoning need to be sprinkled on everything? Too much of a good thing can be exhausting.Rosemary SfloglietteHas little air bubbles that have broken off and left craters like acne scars. Good, sturdy, and bite-size. Some might say they’re even better than Carr’s rosemary crackers. Others might say Carr’s are butterier, and that counts for something. You decide.Frozen ThingsCookies & Creme Bon BonsA coconut milk-based (so, vegan!) ice cream speckled with memories of past cookies enclosed in a thin chocolate globular shell. Love ’em. They’re handheld and packaged in a jewelry box that cradles each globe in its own compartment. Every time I open it I think about what else I can put in the container when the bon bons are gone gone, and that’s the kind of future-looking, optimistic mindset that gives life a sense of purpose and continuity. Hair ties. Maybe I’ll put hair ties in it.Ube Ice CreamBetween this and the ube tea cookies and the ube pancake mix, it’s clear that JoeCorporate got a good deal on a vat of purple yam purée. It’s toasty, almost coconutty, and supremely creamy. A+Cold Brew Coffee & Boba Coconut Non-Dairy DessertI am shocked, shocked, that the boba holds up in this. The tapioca pearls are the size of peas— they might even be triangles?—but they’re chewy as they should be and a complete delight in this coffee ice cream. This is worth the hype…Tangerine Cream Bars...but these are my favorite of the frozen lineup this summer. I can’t have coffee ice cream after 2 p.m. I’m 33! And I’m easily agitated. But these not-Creamsicles don’t interrupt my biological clock. The tangerine exterior is slightly acidic and tart while revealing creamy vanilla ice cream within. At its core, it’s basic. Maybe that’s why I like it so much.Non-Dairy Frozen Dessert Chocolate Fudge Oat BarsRich, deep chocolate-flavored oat milk ice cream that has a chewy texture. Give it a whirl.Peruvian Bay ScallopsScallops packaged in a SpongeBob motif that makes them seem FUN and KOOKY. Love a kooky scallop. Fry ’em in lemony brown butter, make some noodles, and watch Columbo on Mom’s Amazon Prime.Sweet SnacksChile-Spiced PineappleHits that craving for mangonada or Tajíin-topped [any fruit]—gimme that sweet heat (oh, hi Rick!). The coating of chili powder is almost gritty, like eating sand at the beach, in a good way. My favorite thing about these chewy dried pineapple rings is that one is enough; I don’t plow through the whole bag when I’m proctrasti-snacking.Dark Chocolate Watermelon SticksEwwwie. These are a crime. A log of sticky watermelon jelly is enclosed in bitter dark chocolate. I can’t believe this was someone’s idea of a good time. It’s a BAD TIME. I would say “avoid these like the plague,” but from what I’m seeing, people don’t do that anymore. They seem to actually run toward the plague now. Baffling. All of it.This Peach Walks Into a Bar…Gluey.Organic Dark Chocolate Half-Coated Rice Cake ThinsThis is one of the “healthy” snacks that I’m getting sold on TikTok from diet influencers, in between all the FUPA-targeted workouts. What can I say, I’m an open book. So I talked myself into thinking edible corrugated cardboard would be a nice little afternoon treat, but objectively, it was kind of sad.Organic Brown Rice Cake ThinsSomehow sadder.Citrus Mousse CakesTJ’s makes these mousse cakes in different flavors to match the seasons, and they’re always great because they have this fluffy, cloudlike mousse inside. It’s a little lemon-shaped petits fours and, OMG, so cute.Tangy Turtles Tart & Sweet Gummy CandyAll of these taste like lime flavor with a spirulina chaser. Not my favorite gummies at TJ’s, and not actually tart/sour/tangy. But you can wear a turtle as a ring and propose to your playground girlfriend with it, so it has that going for it.Canned SnacksQuinoa-Stuffed DolmasThe quinoa filling is a decent idea but in desperate need of seasoning (except Everything But the Bagel seasoning, anything but that!). Dunk these in your yogurt dipping sauce of choice to make up for it.Cookies!Strawberry Shortcake Sandwich CookiesA sickening sweetness saturates the senses.Ube Tea CookiesI pop a few of these in the afternoon. They’re button-size powdered sugar cookies like Mexican wedding cookies or Snowballs or whatever you call them. The subtle, nutty ube flavor goes brilliantly with bracing cold brew. Big fan.Explore Bon AppétitCultureTrader Joe'sRead MorecultureTrader Joe’s Spring Lineup Is Packed With Vegan Comfort FoodBy Alex BeggscultureTrader Joe’s Fried Ravioli Is All I Want From Frozen FoodBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-30", "author": ["Condé Nast", "Alex Beggs"]}