{"id": "b141645af70ae7d65f8138b9440abbbd", "url": "https://www.bonappetit.com/story/what-is-greek-yogurt", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "What Is Greek Yogurt? And How Is It Different Than Regular Yogurt? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Greek Yogurt? And How Is It Different Than Regular Yogurt?How does the thick, creamy yogurt we love to use in dips and dollop on grilled meats get to be the way it is?By Alex DelanyJanuary 16, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailA decade ago, before Greek yogurt had reached full ubiquity, there's a good chance that people bought it by mistake, thinking it was the plain old yogurt they were used to. They took it home, peeled off the plastic thingy, stuck a spoon in and thought, \"Wait...what is this stuff?!\" Fast forward to present day, and Greek yogurt is just as common—if not more so—than the regular stuff. But the question remains: What is Greek yogurt, anyway? And what makes Greek yogurt different than regular yogurt? Because, well, it most definitely is.Well, for starters, Greek yogurt is thicker and denser than its non-Greek counterpart. Where regular yogurt is almost pourable, Greek yogurt is nearly solid—you can practically stick a spoon upright in it. And that’s because Greek yogurt is strained, while regular yogurt is not.Dipping lamb chops in yogurt isn't barbaric. It's delicious.\nThe two things aren't fundamentally different in composition. Both are made from milk that's been cultured and allowed to ferment. Greek yogurt is just what you get when you take regular yogurt, plop it in some fine mesh cloth, and allow some of the liquid in it—whey, to be more precise—to slowly drain out, resulting in a thicker yogurt with less moisture. This process changes the texture of the yogurt without removing the satisfying sourness that we associate with all yogurts.This technique isn’t employed by just the Greeks, though. Straining yogurt is common throughout the Middle East and Mediterranean. Labneh, the super-thick yogurt you might have heard us talking about from time to time, is made in the same way. This yogurt is essentially Greek yogurt taken a step further, strained aggressively to remove enough whey that the result is almost cream cheese-like in texture. The more concentrated the yogurt, the more concentrated the flavor—if you like the characteristic lactic tang that yogurt offers, you'll love the thicker versions.Greek yogurt is a great addition to herbed chickpeas.\nPhoto by Laura MurrayAnd whether we’re talking Greek yogurt, labneh, or other regional varieties, that thickness lends itself perfectly to creamy dips and sauces. Whether we’re doing a quick roasted shallot yogurt dip or just dolloping it on top of some lamb chops or shakshuka, we love strained yogurt for the cooling, creamy richness and bright contrast it lends to dishes.At the end of the day, the biggest difference between Greek yogurt and regular yogurt is texture. You can substitute it for regular yogurt in recipes, though you'll have to whisk some water or other liquid into it to get the texture right; failing to do so might throw off the moisture of the whole recipe, with dry results. (And nobody likes dry results.) The same cannot be said in the reverse, unfortunately; if a recipe calls for Greek yogurt, and all you've got is regular, you're going to have a hard time removing liquid from the recipe on the fly.So yeah, Greek yogurt is just strained yogurt. But let’s be honest. You’d probably rather ask for “Greek yogurt” than “strained yogurt.” The latter feels kind of sterile and loveless, doesn't it? “Greek” yogurt inspires thoughts of royal blue oceans caressing warm, sandy shores. Which we totally get, because this stuff takes us to a better place. At least until it’s gone.How about some shakshuka? You need to practice your yogurt-dolloping technique:30-Minute Shakshuka with YogurtThis shakshuka is the ultimate, don't-even-worry-about-it, weeknight pantry meal.View RecipeExplore Bon AppétitBasicallyGreek YogurtYogurtRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-16", "author": ["Condé Nast", "Alex Delany"]}