{"id": "b141173a23564983c33f6655b70713e3", "url": "https://www.bonappetit.com/story/why-i-work-in-soup-kitchen", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Why I Gave Up on the New York Food Scene to Work in a Soup Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy I Gave Up on the New York Food Scene to Work in a Soup KitchenAfter years working in restaurant kitchens, Millicent Souris realized that the hours she spent cooking for a privileged few could be better spent feeding hundreds.By Millicent SourisMay 1, 2019FacebookTwitterEmailIllustration by George WylesolFacebookTwitterEmail“Patti Smith donated that stove,” someone says.Just those five words alone and they had me. It’s a beauty. Eight burners, great BTUs, two ovens that fit whole sheet trays. I knew I was home. It’s early November 2012, right after Hurricane Sandy hit New York with a ferocity no one anticipated. Pastor Ann Kansfield is showing me around the kitchen at Greenpoint Church where she implemented a hunger program for the Brooklyn neighborhood. Now they’re cooking for Sandy relief.I’ve walked by this church countless times, meaning to volunteer at its soup kitchen for years—yes, literally years. There’re always great excuses to not go. Complicated scheduling. A sun that sets too late, one that sets too soon. No job, too many jobs. Too sad, too happy. I am a grade-A procrastinator. It took the hurricane to finally get my ass through the door, even though it’s located just a few blocks from my apartment.Kitchens I understand. Food too. It’s where I am most efficient, and that’s all I wanted from this time. To be of the most use—to cook, to feed people who lost their homes. To take my professional cooking experience of more than 15 years (Roebling Tea Room, the Queen’s Hideaway, Egg, and more) and apply it to something other than dinner service.Donations from the Greenmarket are dropped off by City Harvest, bags and bags of produce, stored on the picnic tables in the backyard, some labeled—butternut squash, onions, cabbage—others just a mix of root vegetables. Volunteers gather daily to cook food and deliver it to a fire station in the Rockaways. I set up a station and start cutting onions, not quite knowing what I’m making. You can’t go wrong beginning with onions.It’s a weird time. There’s a nor’easter, a gasoline shortage, and Manhattan south of 30th Street is without power. When the city does get turned on again, and restaurants reopen, service starts slow. The hours spent working at a nearly empty restaurant feel pointless, even if I know it’s important for it to be open and for the staff to earn their income.So I quit my job. I feel the very tangible notion that the hours I spend feeding a few could be better spent feeding hundreds. I keep cooking in the soup kitchen at Greenpoint Church through the holidays and into the new year.Five years later I’m invited into another soup kitchen, St. John’s Bread & Life in Bed-Stuy, Brooklyn’s largest emergency food provider. A friend suggests I meet with the director who is looking for someone to run a job-training program teaching people the basic skills they need to get jobs in kitchens.The interview is two days after the 2016 election and I’m hungover, like a lot of America. Since those months in the Greenpoint Church, I’ve been freelancing, trying to find more purpose beyond other people’s restaurants, trying to find a balance between making money and helping people.I sign on to create a curriculum that will teach people how to cook, how to move and communicate in a professional kitchen, how to work safely and cleanly. The pilot year of the program starts January 2018 and I work full-time to get it off the ground.A kitchen quickly reveals how much you don’t know. The learning curve is sharp, and there’s nowhere to hide. When I start working at Bread & Life, I realize there’s a new learning curve for me, one that involves poverty and its bureaucracy. I used to think all I had to do is train people, teach them the names of equipment, to say “behind” on the line.Over the year of the program I learn more about the barriers people have to confront in order to get and keep jobs. I don’t know the ins and outs of the system, but I know my ignorance reveals my privilege—including the privilege of ignorance. I learn the trainees that live in shelters can’t take canned food because it could be used as a weapon, and I need to write them notes to pinpoint their comings and goings so they can keep the bed they’ve been assigned. There’s so much on their plates. And a lot less too.One in five residents in Brooklyn is food insecure, meaning they lack reliable access to nutritious food on a regular basis. This is not the story we usually think of when we talk about the food scene here, a city associated with the farm-to-table, local sourcing, small-batch, artisanal this or that—phrases so commonplace they’ve become cliché. But the more expensive Brooklyn becomes, the more people we see at the soup kitchen.The lot next door is now a new condo. Townhouses nearby sell for $2 million, more than twice as much as they did a decade ago. Rents in the neighborhood have doubled since 2006. These changes can be dismissed as the cost of doing business, of living somewhere with so much movement, so many people. But for many longtime residents, people I’ve seen come into Bread & Life, gentrification means new financial stresses, the inability to rent a room, to have stable housing. The more popular Brooklyn becomes, the harder it is to keep up.People think I must feel good about myself because I work at Bread & Life. Others imagine I’ve given up some cool career in the kitchen. Some frame it as giving back. But I’m just trying to chip away. There is so much work to do, every day, to make up for our policies and screwed-up safety nets, how we fail people, and how so much of this failure has to do with the systematic racism in our country.And if there’s a population that is underserved, there is one that’s overserved too. We can order takeout on our phones, have entire meals delivered to our doors. We can eliminate certain foods from our diets because we are flush. We seek out the most magical olive oil, argue about the best wood for grilling, whisper about which clandestine corner to meet the raw milk guy.I care about these things too. But we need to find balance in our love affair with food. As we move into neighborhoods, we need to participate in them.I came into soup kitchens at two different times—one a natural disaster and the other man-made. One tragic and sudden and urgent in its scope of need; the second a quiet, persistent reality that trudges on every day, without an expiration date or a happy ending. I believe in the collective effort, and I have seen it work in our country.I see that having more people to work with in the kitchen means we can accomplish more each day. We can incorporate more fresh vegetables into the meals or get more rescue food to use in our kitchen and distribute in our pantry. Maybe we can get ahead rather than always feeling a bit behind.If there’s anything the past few years of uncontained political dumpster fire has proven to me, it’s that we have to show up. Every day, every week, every month, we must keep at it. We need the constant, consistent gesture, not just the grand one. When we depend upon people, we can do more. And there is always more to do.Resources for volunteering in the New York area:Food Bank for New York CityBread & LifeRepair the WorldNew York CaresExplore Bon AppétitFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-01", "author": ["Condé Nast", "Millicent Souris"]}