{"id": "b152d6204375d8c57ee8baceb91744cb", "url": "https://www.bonappetit.com/recipe/crispy-fish-with-brown-butter-sauce-and-kohlrabi-salad", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Crispy Fish with Brown Butter Sauce  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2018 IssueCrispy Fish with Brown Butter Sauce and Kohlrabi SaladBy Anna StockwellAugust 14, 20184.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintPerfect crisped skin and a nutty pan sauce make fish feel downright luxurious. Toasting your own nuts yields far more flavorful and fresh results than buying preroasted ones at the store. But recently we’ve been taking things a step further by toasting a handful of nuts in a skillet with a few tablespoons of olive oil or butter over medium heat until they’re super golden and fragrant. Save any of the leftover oil to boost vinaigrettes.Ingredients4 servings 1tsp. honey¼cup plus 2 tsp. fresh lemon juice3Tbsp. extra-virgin olive oil, divided1tsp. kosher salt, plus more2small kohlrabi, peeled, halved lengthwise, thinly sliced crosswise1large green apple, cut into quarters lengthwise, thinly sliced lengthwise½red onion, thinly sliced45–6-oz. skin-on Chilean sea bass or salmon filletsFreshly ground black pepper½cup coarsely chopped blanched hazelnuts6Tbsp. unsalted butter, cut into piecesLemon wedges (for serving)PreparationStep 1Whisk honey, ¼ cup lemon juice, 2 Tbsp. oil, and 1 tsp. salt in a large bowl. Add kohlrabi, apple, and onion and toss to coat. Let sit while you cook the fish.Step 2Swirl remaining 1 Tbsp. oil in a large nonstick skillet to coat. Season fish generously on both sides with salt and pepper and place, skin side down, in cold skillet. Set over medium heat and cook until fat starts to cook out of fish, about 4 minutes. Gently press on fillets with a spatula so skin makes good contact with pan, then keep pressing, cycling from one fillet to the next every few seconds, until skin starts to crisp. Continue to cook without pressing until skin is super crisp and flesh is mostly opaque, 8–10 minutes total (adjust heat as needed, but don’t rush it). Turn over; cook until completely opaque, about 1 minute. Place skin side up on plates.Step 3Wipe out skillet and return to medium heat. Cook hazelnuts and butter, swirling pan often, until butter foams, then browns, about 4 minutes. Remove from heat and stir in remaining 2 tsp. lemon juice; season brown butter sauce with salt and pepper.Step 4Toss kohlrabi salad and serve alongside fish fillets, leaving excess dressing behind. Spoon brown butter sauce over fish and salad and serve with lemon wedges for squeezing over.How would you rate Crispy Fish with Brown Butter Sauce and Kohlrabi Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitAmericanSalmonFishSeafoodKohlrabiVegetableAppleFruitRed OnionOnionBassMainHealthyishSautéDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Anna Stockwell"]}