{"id": "b165e67071be654c7951ed4ec55f2357", "url": "https://www.bonappetit.com/story/new-holiday-merch-2019", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "Get a Sneak Peek of New Bon Appétit Merch | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe've Got a Sneak Peek of New BA MerchGive the coolest gifts around.By Adam RapoportDecember 10, 2019FacebookTwitterEmailFacebookTwitterEmailI wouldn't typically recommend taking professional advice from an 11-year-old, especially one wearing a pink corduroy bucket hat. But sometimes you need to listen to those who know what they’re talking about—no matter who they might be.“Dad, here’s what you should do,” my son, Marlon, explained to me while sitting at the kitchen table a couple of weeks ago. “You need a midseason drop.”“We can do that?”“Yes —gosh!”Photo by Alex LauMarlon isn’t the first tween to think his dad is a total noob. But in this instance I got it: I needed Marlon more than he needed me. A few months back, Bon App launched an online merch store at shop.bonappetit.com, and I quickly realized that our target audience—thanks in part to our burgeoning YouTube channel and our social media platforms—is a lot closer to Marlon’s demographic than mine.Fortunately, BA’s 20-something design staff is plenty current too. And the more I looked at what Marlon was wearing, the more I noticed that was what the team was dreaming up: long-sleeve tees, logo’d hoodies, tube socks, fanny packs, and, if we can find a maker, bucket hats. (They’re a thing again—really.)In a way, turning to an 11-year-old for insight isn’t that different from what I do every day at work. When I’m wondering what chilled red wine to take to a party or what cocktail I should be concocting, I text our wine editor, Marissa Ross, and drinks czar, Alex Delany. When I need a restaurant in L.A.? I drop by deputy editor Julia Kramer’s office. When I want the recipe for that chicken biryani I’ve been sampling over and over in the BA Test Kitchen? I slack associate food editor Sohla El-Waylly.Photo by Alex LauAs anyone responsible for running a brand will tell you, it’s imperative that you know what you don’t know and that you surround yourself with people who are a lot smarter than you.Photo by Alex LauWhich is how and why we finally have our own online shop. Our creative director, Michele Outland, and design director, Chris Cristiano, worked tirelessly on the products, constructing mood boards and sourcing piles and piles of samples. A whole gang of people on our marketing and licensing teams figured out how to strike distribution deals, and a certain opinionated, streetwear-obsessed tween kept the boss on point.We \"dropped\" a bunch of products earlier this month, and we have even more coming later this week, most of which should arrive just in time for Christmas, if you order right away. Check in with our Instagram feed for when our new merch goes live. And just like that, you've crossed at least a bit of your holiday shopping off your list.Get Shopping:The BA Merch ShopExplore Bon AppétitAdam NewsletterRead Morecooking12 Kitchen Gifts I Really Want But Definitely Don’t NeedBy Alex BeggscultureAll the Gifts You Want, Curated By the Coolest People We KnowBy The Bon Appétit StaffshoppingThe 38 Best Gifts for BakersBy Sarah JampelshoppingMolly Baz's 11 Essential Tools Also Make Great GiftsBy Molly BazRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-10", "author": ["Condé Nast", "Adam Rapoport"]}