{"id": "b179910c5c3ce0eddcb52d3e3e573679", "url": "https://www.bonappetit.com/story/miss-americana-and-the-most-buttery-rice", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "‘Miss Americana’ and the Most Buttery Rice | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle‘Miss Americana’ and the Most Buttery RiceWhen I was supposed to be writing this piece, I was watching Miss Americana.By Amanda ShapiroFebruary 13, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Rebecca JurkevichFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This week’s new recipe is another weeknight hit from Andy Baraghani: Salt and Pepper Fish. It’s as simple as it sounds, and the buttery seasoned rice that goes with it might replace Chris Morocco’s sushi rice as my default rice recipe (don’t tell Chris). From the looks of things on Instagram, you all are still hung up on Andy’s cabbage, but I hope you’ll give the fish a try next. (Pairs well with cheap light beer and the new Nicolas Jaar album.)Also on Healthyish, Zoe Yang wrote a beautiful personal essay about coronavirus, Wuhan noodles, and the time she spent living in China. Her piece didn't mention this, but Chinese-American restaurants across the country are suffering from lack of business as a result of coronavirus fears. I've made a point of eating in Manhattan's Chinatown more often than usual, and I encourage you to do the same in your city.Last night, when I was supposed to be writing this newsletter, I was watching Miss Americana, the new Taylor Swift documentary on Netflix. To be honest, I hadn’t thought about Taylor Swift in a minute. I had a brief time with her music about six years ago, when 1989 came out and I’d just moved (back) to New York newly single, and that album and the show Girls felt like guilty pleasures I didn’t want to admit I loved. And, soon enough, I stopped loving them. Partly because I aged out of pop music and TV shows about post-college malaise, but more because it was something I knew I needed to do.I won’t recount all the reasons why everyone started hating Dunham and Swift—honestly, I don’t remember the details—but around the same time they became the poster women for clueless, navel-gazing, white privilege: a quality that, especially amid the 2016 presidential election, became impossible to excuse. (Didn’t they even hate each other for a while? I’ve never been able to keep track.) Since then, Dunham has more or less exited stage right—like, literally, she moved to Wales. Swift, on the other hand, has stayed in the spotlight, recording two records, touring internationally, and filming this documentary.Like Lady Gaga’s and Beyonce’s before it, Swift’s documentary is billed as the first real, unfiltered look into the superstar’s life. But as BuzzFeed writer Pier Dominguez put it, Miss Americana is less of a documentary and more of “a humanizing infomercial.” From the first shots of Swift sitting by a window, reading from her diary, the film’s point is hammered home: She always wanted to be seen as a good girl, and everything she did—her career, her body, her dating life, her political opinions—served that goal. The rest of the documentary lays out the case for how Swift has changed. We’re shown how her songwriting has gotten more honest, she’s stopped starving herself, she’s taken some political stances...she even put the cast of Queer Eye in a music video!I identify with Taylor Swift’s good girl persona more than I’d like to admit, and that’s why I found the documentary so disappointing: She’s so clearly still trying to be good. One of the first skills that good girls learn is how to read the room. In Swift’s case, the room is very big, like the-entirety-of-American-pop-culture big. But the room’s priorities are clear: These days we want our celebrities to have opinions. We want them to show their imperfections. We want “authenticity.” We want them to talk about #MeToo. And, right on cue, here’s the new Taylor Swift: wearing sweatpants and a messy ponytail and having some opinions, talking about her disordered eating and her sexual harassment case, hugging drag queens, and disagreeing with her dad when he tells her not to talk politics on Instagram.That conversation pits Swift and her mom (and her cat?) on a couch facing her dad and an unnamed white man across from them. The optics are clear, but Swift drives the point home, saying that she doesn’t want to end up on the wrong side of history. It’s one of the most honest lines in the film. Swift doesn’t want to be on the wrong side of history because she never wants to be wrong, because wrong is embarrassing. Wrong is bad.The other line I found most telling comes toward the end, when Swift makes the astute observation that women pop stars, unlike men, have to keep reinventing themselves to stay relevant. The good girl has to become the bad girl who has to become the chastened girl who has to become the enlightened girl...until you’re too old to be a girl and people stop paying attention at all. Swift, back in the window and surrounded by her diaries, says she wants to keep doing what she’s doing “while people still tolerate me being successful.”And so here she is at 30, reinventing herself and hoping we’ll approve.As a reward for getting to the end of this extra-long newsletter, here is a very good (possibly the very best) boy:ADAM HUNGER/USA TODAY SPORTSUntil next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Amanda Shapiro"]}