{"id": "b19db9d34b0c8ee425a89acd76104acf", "url": "https://www.bonappetit.com/recipe/inflammation-busting-pineapple-slushy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Pineapple, Turmeric, and Ginger Slushy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesInflammation-Busting Pineapple SlushyBy Molly BazJune 20, 20184.9(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintThis slushy is an anti-inflammatory triple-threat thanks to the tart pineapple, earthy turmeric, and zippy ginger. It's also part of the Healthyish slushy trifecta. Check out the other two here and here.Ingredients6 servings4cups frozen pineapple chunks (about 22 oz.)2½cups coconut water11½\" piece ginger, peeled, finely grated½tsp. kosher salt¾tsp. ground turmeric, plus more for servingPreparationStep 1Blend pineapple, coconut water, ginger, salt, ¾ tsp. turmeric, and 2 cups ice in a blender until smooth. Divide among glasses, then sprinkle with more turmeric.Step 2Do Ahead: Slushy can be made 1 hour ahead. Store in blender jar in freezer, then reblend on high speed to reincorporate.How would you rate Inflammation-Busting Pineapple Slushy?Leave a ReviewTell us what you thinkExplore Bon AppétitCold DrinkDrinks AllSmoothiePineappleFruitTurmericHerbs & SpicesGingerQuickEasyDrinksSnackDairy-FreeRawVeganVegetarianGluten-FreeNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Molly Baz"]}