{"id": "b1a5b592523a56a6417886e2ba509038", "url": "https://www.bonappetit.com/story/just-buy-it-kitchenaid-hand-mixer", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "My KitchenAid Hand Mixer Is the Most-Used Appliance in My Kitchen, Period | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy KitchenAid Hand Mixer Is the Most-Used Appliance in My Kitchen, PeriodIt's the best kitchen upgrade you can make if you bake anything ever.By Alyse WhitneyApril 11, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.I divide my life in two eras: before buying my KitchenAid hand mixer, and after. As a kid, I went from Easy Bake Oven cakes to semi-homemade sheet cakes (boxed cake with homemade frosting) to dozens of cookies with the help of my mom's trusty hand mixer, which was always a little covered in flour and stored in the upper cupboard to the right of the sink. It wasn't until I went to college and had a (KitchenAid-less) kitchen of my own that I understood how important that thing was. I learned the pain of manually hand-mixing baked goods, my arm cramping up trying to cream together maybe-not-quite-room-temperature butter and sugar for blueberry muffins or attempting to whip egg whites for my mom's savory rice pudding soufflé when I was particularly homesick. I was lost without it.Everything changed on a random day in 2009 when I drove (slightly over the speed limit) to the local Bed Bath & Beyond because I had brownies to bake for a friend's birthday. Armed with two 20% off coupons that we kept in a stack on top of the fridge—THEY NEVER EXPIRE!!!!—I grabbed the first one that I saw and went to the checkout. Back then, there weren't 100 colors to choose from, so I have a very utilitarian-looking black and stainless steel version; if I could buy a new one today, it'd be this adorable BOYSENBERRY number ($39.99 on Amazon). It remains my most-used appliance to this day, even though I got a used full-size KitchenAid stand mixer later that year on Craigslist for $75.Mix up spicy cheese dip in seconds with an electric hand mixer when you forget you invited people over (and don't feel like breaking out the food processor).\nPhoto by Chelsie CraigBut you're not here for a long-winded story about how I got my first hand mixer. (Too bad; I already told it. If you're still here: I promise real advice is coming.) You're here to find out why a KitchenAid hand mixer is the kitchen upgrade you should make sooner rather than later. It performs the basic tasks of a fancy stand mixer for less than ¼ of the price! Yes, it will make creaming butter and sugar together for virtually any baked good easier, but it also makes super creamy dips, whips egg whites into meringues or omelet soufflés, and even emulsifies salad dressings. I use mine for everything from whisking eggs for a brunch casserole to shredding cooked chicken for salad in seconds. (Watch the magic happen here.)Pretty mesmerizing, right?\nIt makes the creamiest base for pimiento cheese (before you fold in the cheddar) and lump-free deviled egg filling. If I could attach it to my hand permanently like Edward Scissorhands, I might. That's how dedicated I am to it. But since that would make Instagramming Alison Roman's salted butter chocolate chunk cookies and typing stories like this near impossible, I'll stick to storing it within arm's reach. But maybe in the future, I'll have an Inspector Gadget arm with kitchen tools attached. (Black Mirror, I've got a pitch for you.)Courtesy of KitchenAidKitchenAid 5-Speed Ultra Power Hand Mixer$60 $40 at Amazon$55 $40 at TargetNow, break it in with this sheet cake:Easy Sheet Cake with Chocolate-Cream Cheese FrostingMeet your new favorite birthday cake.View RecipeExplore Bon AppétitBakeBasicallyShoppingBA RecommendsRead MoreshoppingThe Best Kitchen Scales and Why You Need One, Even If You Never Bake a ThingBy Alex BeggscookingThis Humble Dish Is the Unsung Hero of Baking SeasonBy Alex Delanyrecipes47 Easy Cookie Recipes You’ll Make on RepeatGallery47 SlidesBy Alyse WhitneycookingThis Easy Sheet Cake Recipe Doesn't Seem Like It Should Work, but It's IncredibleBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-11", "author": ["Condé Nast", "Alyse Whitney"]}