{"id": "b1a6fa6047bfa726be11f5c22c9f1d1f", "url": "https://www.bonappetit.com/recipe/strawberry-and-watercress-salad", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Strawberry and Watercress Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueStrawberry and Watercress SaladBy Claire SaffitzMay 22, 2018EmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintWe paired peppery watercress with bright rhubarb and sweet berries in this spring salad recipe.Ingredients4 servings½medium rhubarb stalk, very thinly sliced on a diagonal6oz. strawberries, hulled, halved, sliced if large2Tbsp. fresh lemon juice2tsp. honey1bunch watercress, tough stems removed½cup basil leaves½cup cilantro leaves with tender stems2scallions, thinly sliced on a diagonalKosher saltCrushed red pepper flakes2Tbsp. extra-virgin olive oilPoppy seeds (for serving)PreparationStep 1Toss rhubarb, strawberries, lemon juice, and honey in a medium bowl to combine.Step 2Arrange watercress, basil, and cilantro on a platter, then scatter scallions over. Season with salt and sprinkle with red pepper flakes. Spoon berry mixture and juices over; drizzle with oil and sprinkle with poppy seeds.How would you rate Strawberry and Watercress Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladRhubarbFruitStrawberryBerryWatercressLeafy GreensVegetableSpringQuickEasySideDairy-FreeGluten-FreeVegetarianRawHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}