{"id": "b1b0b490d708206c1e36a441eecd57f1", "url": "https://www.bonappetit.com/recipe/broccoli-caesar", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Broccoli Caesar Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueBroccoli CaesarBy Chris MoroccoOctober 16, 20184.5(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintYou've never met a better, brighter riff on the classic Caesar than this raw broccoli and Napa cabbage twist. Just remember that while the stems are tender and delicious, it’s important to cut away the dried-out base and peel the tough skin of thicker ones.Ingredients8 servings2oil-packed anchovy fillets (optional)1garlic clove, thinly sliced¼cup fresh lemon juice2tsp. Dijon mustardKosher salt1large egg yolk or 2 Tbsp. mayonnaise½cup extra-virgin olive oil3Tbsp. grated Parmesan, plus more shaved for serving2medium heads of broccoli (about 1½ lb.)¼head of savoy or Napa cabbageFinely grated lemon zest (for serving)Freshly cracked black pepperPreparationStep 1Using the side of a chef’s knife, mash anchovies, if using, and garlic on a cutting board until a smooth paste forms. Transfer paste to a large bowl and whisk in lemon juice, mustard, and a big pinch of salt. Add egg yolk (or mayonnaise) and whisk until smooth. Gradually add oil, whisking constantly until emulsified. Whisk in 3 Tbsp. grated Parmesan.Step 2Trim woody ends from broccoli stems, preserving as much stem as possible. Peel any thick stems to expose tender inner cores. Cut off florets as close to the dark green flowers as possible and break into bite-size pieces. Add to bowl with dressing. Starting at the floret ends of the stems, slice very thinly crosswise and add to bowl. Thinly slice cabbage crosswise (you should have about 2 cups) and add to bowl with broccoli. Toss until broccoli and cabbage are combined and evenly coated with dressing; season with salt. Let sit 10 minutes.Step 3Top salad with shaved Parmesan, some lemon zest, and a few healthy grinds of pepper.Step 4Do Ahead: Dressing can be made 2 days ahead. Cover and chill.How would you rate Broccoli Caesar?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis salad was good, but the dressing was bland, which resulted in a dish that was tasty but not particularly unique. We enjoyed the texture and creativity of the raw broccoli and cabbage, but it tasted more like lemon/oil than caesar. If I make it again, I would make the dressing with another recipe.AnonymousLos Angeles, CA11/12/2021Excellent!  Thank you!  i did use less lemon juice than recommended the 2nd time I made it.AnonymousLake Bluff, IL10/30/2020This was just... ok.Anonymous9/20/2020I have made this several times as written and it's great.  I crave it.  It gets better the longer it sits and is great to take to work for lunches.  The most recent time I've made it I adapted it to what I had on hand - broccoli and green cabbage; added cauliflower that needed using plus carrot shaved with a peeler and thin-sliced red bell pepper because they're pretty and why not.  The dressing is delicious the way ranch is delicious because it's really versatile.  AnonymousErie7/5/2020I had really high hopes because of the reviews--this salad was good but not amazing. It seemed a little overly oily/lemony to me. If I make it again, I may modify the recipe. It did stay crunchy for a long time and I agree, it was better the longer it sat.AnonymousChicago, Illinois4/7/2020This salad is super good.  It's turned me on to broccoli again.  Takes a little time to cut up all the broccoli but worth it and makes a good amount and as other have said, it keeps well.  Definitely a keeper.AnonymousWashington1/13/2020This is really, really, really good. Stays crunchy for-ev-er. Everyone loved it. Will absolutely make again. stickyheelsDurham, NC12/2/2019Looks great but a bit confused on the directions, is there a typo? \"Cut off florets as close to the dark green flowers as possible and break into bite-size pieces. Add to bowl with dressing. Starting at the floret ends of the stems, slice very thinly crosswise and add to bowl.\"AnonymousLas Vegas11/20/2019Finally, I'm getting enough salad in my diet! This salad is just as good on day three as it was on the first go. Even already dressed! I've passed the recipe on to others, and it's become their go-to salad as well.\nTo whomever came up with this... THANK YOU!\n\n\nzoeelectraFort Collins6/1/2019soo yummmm, threw some fresh snap peas into the mix and thought it was delicious. I might use more chovy and less lemon next round though. \nkrillyarcher6031Olympia, WA11/27/2018This was a big hit at our Thanksgiving dinner - it even turned one guest that was not a broccoli fan into a broccoli lover who took home the leftovers to enjoy! Another winner, Chris Morocco!Pittsburgh, PA11/22/2018I am in love with this simple raw recipe. I used veganiase rather than mayonnaise and skipped the cabbage entirely. What a great way to get cruciferous vegetables into a meal. Satisfied my crunchy, salty. garlic cravings all at one and I'm not pregnant lol!edyeBaltimore11/2/2018I love caesar salad and this was delicious!! I did add croutons though...AnonymousNJ10/30/2018This is really really good!  AnonymousSt. Louis Mo10/28/2018I hate most salads, but I will make anything that Chris Morocco recommends. Super good, especially if you let it rest for a while before cramming your face. I think I just ate about a pound of broccoli. AnonymousSan Francisco, CA10/24/2018Explore Bon AppétitSaladAmericanBroccoliVegetableNapa CabbageCabbageLeafy GreensAnchovyFishSeafoodFallSideGluten-FreeHealthyishThanksgivingLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Chris Morocco"]}