{"id": "b1d67fe00bca0ff4fb89b1a1266c4e40", "url": "https://www.bonappetit.com/story/restaurant-workers-getting-out-the-vote", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "Some Out-of-Work Restaurant Workers Have Found a New Calling: Getting Out the Vote | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseSome Out-of-Work Restaurant Workers Have Found a New Calling: Getting Out the VoteShoppingBA MarketMerch ShopMoreChevronStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopVIEW THE SERIESElection 2020Some Out-of-Work Restaurant Workers Have Found a New Calling: Getting Out the VoteWith time on their hands and the future of their industry on the line, hospitality vets are putting their people skills to work this election.By Priya KrishnaOctober 27, 2020FacebookTwitterEmailIllustration by Julia DuffoseFacebookTwitterEmailSix months ago, Vanessa Rao was the general manager at Afterword Tavern & Shelves in Kansas City, Missouri, training new staffers on the wine list, coming up with new dishes, and keeping the cozy bar running. Now, she spends her days going car to car at get-out-the-vote events, making sure people are registered to cast their ballot. This November she’ll be working for the county as a paid volunteer, handing out ballots, and showing people to voting booths.After seven years working in the service industry, Rao was furloughed from her job when Afterword shuttered due to the pandemic in March. Before the pandemic, she paid attention to the news but hadn’t gotten deeply involved in politics. “I just had my beliefs and voted,” she says. But during her time off, she started paying more attention and found the League of Women Voters, the 100-year-old national civic organization that mobilizes female voters.“This election is super poignant for the service industry,” she says. “[We] are not unemployed through decisions we have made. We are unemployed [because of] other decision-makers”—politicians who have legislated Americans’ access to health care or how much restaurants will receive in stimulus funding.She says her experience as a restaurant worker both energized and prepared her to get the vote out. She knows how to keep calm when confronted with angry voters or de-escalate tense phone conversations.“When I get people signed up to vote and give them the steps and they are like, ‘I know how to do this,’ it is hitting the same part of my brain that enjoys providing service.”In March, as the pandemic suddenly halted in-person dining, millions of workers were out of a job, at the mercy of GoFundMe donations and gift card purchases for income. As the country has slowly reopened, some have gone back to work—but many of those who still haven’t are using the time off to mobilize politically. They’re writing letters to voters, text banking, phone banking, and signing up to be poll workers. They, like Rao, are emboldened to make change within their industry and to get involved in the election more broadly—and the organizational and people skills they developed working in restaurants are coming in handy.When Lorraine Nguyen found out that she and her fellow employees at the Cherry Circle Room in Chicago were furloughed until next spring, with no support from ownership and little to no guidance from state and federal governments, she helped to put together fundraisers to pay her colleagues’ groceries, rent, and medical expenses. She realized she had a talent for organizing and signed up to be an election judge at her local polling place.While working at a restaurant, she says, “it is hard to see outside that bubble.” But now, removed from her job, her perspective is different. “There are gigantic systemic structures that led to the decisions made for this industry. We have to know about them if we want to fight for better conditions.”“A restaurant is a microcosm of American problems, from racism to sexual harassment,” adds Anna Dunn, who previously worked at Diner in Brooklyn and has signed up to be a poll worker. Throughout her career in the service industry, Dunn has always been interested in advocacy. “For most of the people I know who are politically motivated,” Dunn says, “it does come from working in a restaurant, or [any] structure that has these different layers of inequality.”The skills acquired from cooking on the line, being behind a bar, or running a host stand are also uniquely translatable to election work.Marjorie Nuñez, formerly a waitress at Brooklyn’s Oxalis who is now phone and text banking for her home state of Florida, says she is “not scared of people being rude to me” and “definitely not turned off by talking to strangers.”As a server, “one of the main objectives is to sell the food and the drinks and the experience,” she says. “When you are...talking about the importance of voting, it is kind of like selling.”As a former bar manager at À Côté in San Francisco, Wendy Hector says that not only has her restaurant experience made her open to talking to people from all walks of life, but it has also helped her relate to voters, many of whom she says have also worked service industry jobs or have kids or friends recently laid off from the business.“It definitely bridges the gap,” she says, “when they realize one, you are a real person, and two, you had a real job, and that you are not just some liberal elite calling from an ivory tower.”Some workers have gone even further, creating or joining organizations to support each other’s efforts. Staff the Polls, started by Matt Weyandt of Xocolatl Small Batch Chocolate, is a resource for Atlanta restaurant employees to sign up to be poll workers—it also calls on restaurant owners to give their staff time off on Election Day and during poll worker training. Another initiative, Drag Out the Vote, is mobilizing drag queens and kings, many of whom are out of a job due to the pause on drag brunch and other drag shows that often take place at bars and restaurants. Kylie Minono, who used to perform as Adele at Hamburger Mary’s in San Francisco’s Castro neighborhood, now stations herself in different areas of the city with other “drag ambassadors” as they are called—all dressed in their finest outfits—asking people if they are registered to vote. She says that young voters in particular are often more interested in approaching a drag queen than an official-looking volunteer on the sidewalk.“One of the reasons I love drag shows, and especially drag brunches, is that it is an opportunity to exchange energy with people,” she says. “Being out and registering people to vote and being able to engage with the community in that way has helped me to start to feel whole again.”With no clarity around when restaurants may return in full force, some of these workers have made their shift into politics permanent.After the owners of Philadelphia’s Vernick Food & Drink announced that the restaurant would be shutting down temporarily in March, Lauren Guild, who ran the door and host stand there, thought about how much she enjoyed canvassing during the 2016 election. A few months into quarantine, she got a job as a field representative for the Progressive Turnout Project, a grassroots political action committee. These days she might be writing personalized letters to voters or calling people to collect data on how many will be voting by mail in swing states.She doubts she’ll go back to working in restaurants in the near future. “I don’t think I would be doing the things I liked doing,” she says. Masks and distancing restrictions means she’s less able to spend time talking to customers and making one-on-one connections. Her current role better allows for her to build deeper personal bonds over issues that matter to her.After her job ends on November 3, she plans to stay in advocacy. “No matter who gets elected, there is so much damage to the industry,” she says. “I think my role right now is better as someone fighting for restaurants.”How to help restaurant workers as they work to ensure a fair voting process and rebuild their industry, according to sources interviewed for this story:Follow The Chaad Project, an organization rooted in making the Chicago restaurant industry a more equitable place to work. (Lorraine Nguyen)Donate to Fair Fight, an organization started by Stacey Abrams that fights for free and fair elections for all. It is mainly based in Georgia, but its message is spreading nationally at a rapid pace. (Lauren Guild)Check out the League of Women Voters, which has been protecting and helping defend democracy for 100 years. The League works to get resources and information to voters in a nonpartisan way. Head to its website to find information relevant to your voting experience, fund the organization, or join a local chapter. (Vanessa Rao)Donate to Collective Nameless, an organization started by chefs in New York to combat food insecurity around the city, specifically in Black and brown neighborhoods. (Marjorie Nuñez)Explore Bon AppétitRestaurantsRead MoreElection 2020How to Practically and Specifically Help Restaurants This Election YearBy The Bon Appétit StaffElection 2020I’m Running for Office This November Because I’m a Chef and My Whole Industry Is at StakeBy Francesca Hong Election 2020Aisha “Pinky” Cole Isn’t an Activist. She’s a “Hood Politician.”By Aisha “Pinky” Cole, as told to Leigh-Ann JacksoncultureHow a Historic Hot Spot of the Civil Rights Era Remains a Refuge for the ResistanceBy Ryan Walker-HartshornRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-27", "author": ["Condé Nast", "Priya Krishna"]}