{"id": "b1e7e7e55279ff4d578da2f013c8ac96", "url": "https://www.bonappetit.com/recipe/nanas-chicken-and-rice-stew", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Nana’s Chicken and Rice Stew Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueNana’s Chicken and Rice StewBy Matthew RaifordJanuary 4, 20223.9(76)Read ReviewsTriangleEmailPinterestPrintPhotograph by Jenny Huang, food styling by Rebecca Jurkevich, prop styling by Linden ElstranEmailPinterestPrintEmailPinterestPrintSouthern grandmas are unmatched when it comes to making hearty meals to feed the whole family, and this chicken and rice stew from Bress ’n’ Nyam author Matthew Raiford’s nana is no exception. “As I wrote out this recipe, I remembered laughing with my nana while talking about leftovers and how much stock the bones of a whole roasted chicken made,” Raiford says. “Nana always had chicken stock in large mason jars in her deep freeze.” Raiford recommends serving this nourishing stew with freshly baked biscuits and honey butter to make it extra hearty.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonLadle$8 At AmazonTongs$13 At AmazonIngredients6 servings4Tbsp. salted butter1Tbsp. extra-virgin olive oil1large onion, finely chopped2large carrots, peeled, chopped2celery stalks, thinly sliced1cup shiitake mushrooms, stems removed, thinly sliced1lb. skinless, boneless chicken thighs1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus moreFreshly ground white or black pepper2sprigs sage2sprigs thyme2cups basmati rice1Tbsp. finely chopped marjoram1Tbsp. finely chopped rosemary (optional)1Tbsp. finely chopped parsley, plus more for serving (optional)PreparationStep 1Heat butter and oil in a large Dutch oven or other heavy pot over medium. Add onion, carrots, celery, and mushrooms and cook, stirring often, until softened and fragrant, about 5 minutes.Step 2Season chicken all over with salt and pepper; add to pot. Cook, turning over halfway through, just until exterior of chicken is opaque, about 2 minutes total. Add sage, thyme, 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, and 1 quart water. Bring to a boil, then reduce heat and simmer, uncovered, until chicken is tender and cooked through, 30–35 minutes. Discard sage and thyme. Using tongs, transfer chicken to a plate; let cool slightly, then shred meat with 2 forks.Step 3Return chicken to pot and stir in rice, marjoram, rosemary (if using), 1 Tbsp. parsley (if using), and 1½ cups water. Bring to a boil, then reduce heat, partially cover pot, and simmer until rice is tender and liquid is mostly absorbed, 30–35 minutes. Remove pot from heat and let stew sit 5 minutes.Step 4Ladle stew into bowls; top with parsley if desired.How would you rate Nana’s Chicken and Rice Stew?Leave a ReviewTell us what you thinkReviews (30)Back to TopTriangleSuper delicious and  very fragrant. It’s the perfect soup for a cold day.  Love the user feedback. I made the rice separately and let everyone  add in as desired. it’s already on repeat. AnonymousNew York 2/13/2022Delicious.Michael PasterRed Bank, NJ2/1/2022Just came off the stove here and it's fabulous. Read through the reviews about the amount of rice that should be use and decided on half a cup. Really because that is exactly what I had on hand. Turned out so nice. Smells so good while it's cooking. This is a keeper. M.C. Jersey Shore 1/28/2022This was easy to make, delicious, made the house smell great and was a nice meal on a cold evening. I read the comments about too much rice but decided to use the full 2 cups, and my family was fine with it being less brothy. However, my son recommended that I make it next time without the rice, because both my kids had tasted - and loved - the broth. In any case, everyone finished their whole bowl, and we have plenty of leftovers for a meal to come.Lnr OlsenLos Angeles, CA1/25/2022This was delicious. I followed the advice of the reviewers and reduced the quantity of rice (2/3 cup, based on 1:3 ratio uncooked to cooked rice, don't know if that was the \"right\" amount, but it worked).\n\nI noticed many folks used chicken stock; I used water as per the recipe. The relatively long simmer, along with the herbs, did yield a flavorful broth. Stock would no doubt elevate it, if you want to go that route. The Basmati rice held up well when we reheated the leftovers. \n\nThis is definitely a keeper.SoozPinch, WV1/23/2022This recipe is fabulous tasting..but definitely wish I would have read reviews...making it now, using a little over half cup of rice....when I used the 2 cups, I had to add almost a whole container of chicken broth...this is actually one of our favorite new recipes..KBSt. Pete, FL1/22/2022So delicious! All cooks make revisions according to their taste, and I made a few. I used bone in thighs for added flavor, and chicken stock instead of water. Also added a half cup of dry white wine along with the quart of stock, and reduced the rice to one cup. Texture and liquid to solid ratio was perfect. Will definitely make again!Mary Ellen MayMiddletown, PA1/22/2022Saw this recipe and immediately thought  it a new addition to our Soup Sunday. I do always read the reviews and my thoughts were the same on the rice to liquid ratio. What really stuck out though is the author speaks of his memories with his Nana and discussing her homemade chicken broth she always had in the deep freeze. Yet this recipe adds water twice? I will be making this but will also alter the rice as well as adding my homemade broth or at least store bought when I do not have any.AnonymousCalifornia 1/20/2022Well, as of now my kitchen smells like a four-star restaurant. It is a stew. If you don't like a lot of rice, cut it back. If you do, it's perfect. If you want to add more water or broth, super. I have tasted it and I love it. I personally would not change a thing. Shelby Kentucky1/19/2022To be clear - this is still edible as is. It will not look like the picture, unless you cook that rice separately and add it in later. Skimmed the reviews, did not understand the extent of the issue with this recipe's ratios. Doubled the recipe because I had two pounds of thighs to go through, but I didn't realize how much liquid 4 cups of basmati rice would absorb, as in literally all of it. Kind of a slog to eat through, to be honest. At this point it's basically just stuffing but with rice instead of bread. Very tasty though, I will be making this again. Just with half the rice and more stock to actually have soup. Or just precook rice with some of the seasonings and broth in my rice cooker.  And using two pounds of chicken in the base recipe is better than one. For any part of the recipe that has you adding water, use stock or Better than Bouillon to give it some flavor, plain water is boring for soup. A combo of Roasted Chicken, Onion, and Vegetable BTB bases would knock water alone out of the park. Can't wait to try this one over.DSIndiana1/19/2022Hindsight is 20/20, should have read the reviews and used much less rice and double the amount of meat. Also, add some Watkins  Boullion when adding the rice and water.  I will try the recipe again with revisions.PatifyBuffalo, NY1/19/2022Moral of this story: always read the reviews first! I plan to make this, but based on all the reviews, will only use 1/2 cup rice.AnonymousCanada1/19/2022Please Bon Apetit. Please revise this recipe to lower the cups of rice to either 1/2 cup uncooked basamati or 1 cup cooked so that it can truly be a stew and not just really flavored rice. Mari G Miami 1/19/2022I trust Bon Apetit recipes, and I questioned the two cups of rice in the ingredients.  I now have a mountain of rice, very flavorful rice.  I agree that I would add just 1 cup of rice, or even just a 1/2 cup rice so that the flavor of the broth and tender chicken can be enjoyed.  I also had home made chicken broth and substituted that for the water. I would like to try this recipe again with the stated adjustments.Debbie MatticeBuffalo New York1/17/2022This was delicious.  I read all the reviews the other day, and tried it with one cup of rice.. It was not stew, but a nice and tasty, homey, one-pot chicken and rice dish, if maybe a bit too much rice.    For stew, I guess I would go down to 1/2 cup and see what happens!   NancyNYUpstate NY1/14/2022Explore Bon AppétitDinnerEasyGluten-FreeNut-FreeStewSoups and StewsChickenPoultryChicken ThighRiceRice & GrainsShiitake MushroomMushroomVegetableSouthernAmericanSoul FoodMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Matthew Raiford"]}