{"id": "b1ebd3eb7a3dda48cfca1d5d30f81db5", "url": "https://www.bonappetit.com/story/ahi-assassins-poke-honolulu", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "I Repent of All the Fast-Casual Poke Bowls I’ve Eaten After Going to Ahi Assassins | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Repent of All the Fast-Casual Poke Bowls I’ve Eaten After Going to Ahi AssassinsThe fish is fresh, the rice is hot, and the poke cravings are completely sated at this Honolulu counter spot.By Elyse InamineJanuary 15, 2020FacebookTwitterEmailPhoto by Stephanie KurodaFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I'm slightly ashamed to admit that I eat bad, fast-casual poke bowls somewhat regularly for lunch. You know the kind: a mound of rice that’s cold, dry, and sad with strips of flavorless, highlighter-orange salmon, all showered with cheap soy sauce and too many vegetables (edamame, avocado slices, seaweed salad, and fried shallots?!). But I’m not ashamed enough to stop. The combination of raw, fatty fish and white rice is my kryptonite. It’s so familiar and comforting that, even when it sucks, I’m still happy and somewhat reminded of the “real” stuff back in Hawaii.Or so I thought. After visiting my extended family in Honolulu over the summer, I was slapped out of that subpar-poke fugue state. And I have to thank Ahi Assassins for removing the blinds from my eyes. At this unassuming poke counter in a tiny strip mall along South Beretania Street, the poke isn’t the perennial salmon but whatever owner and third-generation fisherman Josh Schade gets in the morning from his uncles. (Everyone is “uncle” in Hawaii.) Maybe it’s smooth-as-velvet ahi (yellowfin tuna) or blush-pink nairagi (striped marlin), but no matter what is available that day, the fish is always line-caught and locally sourced.“I love to catch fish, sell fish, trade fish,” Schade told me over the phone later on. As a kid growing up in Hawaii, he remembers having two options for playtime: watch “Oprah” with his grandma or go fishing with the boys. Fishing became his passion; initially he only opened up Ahi Assassins as a way to pay for the fuel he needed for his fishing boat. But once he set up shop on the second floor of the strip mall a few years ago, with barely a sign (only some flags with fish on them), word spread quickly. And my favorite poke counter was born.The poke doesn’t come as a “bowl,” nor with any fancy vegetables as you would see on the mainland. Instead, it arrives the Hawaii way. You get two scoops of hot sticky white rice piled high with hunks of fresh fish seasoned several different ways, but these are my favorites: Hawaiian style with sesame oil, limu (seaweed), and inamona (roasted kukui nuts); the insanely delicious paké that’s like the best scallion-ginger sauce (but with an extra burst of freshness from some parsley); or secret shoyu (he wouldn’t say more than that there is soy sauce in there).The best way to enjoy it is by sitting in the restaurant’s parking lot, with the windows rolled down and the hot, humid breeze blowing in, like I did this past summer. While I shoveled bites of the freshest fish I’d ever tasted with perfectly plain, intensely sauce-absorbent white rice into my mouth I wondered, “How have I ever settled for less?” Well I simply can’t any more.Go there: Ahi AssassinsExplore Bon AppétitHighly RecommendRestaurantsHonoluluRead Moreculture12 Honolulu Restaurants—For Something Other Than PokeGallery9 SlidesBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-15", "author": ["Condé Nast", "Elyse Inamine"]}