{"id": "b1f338b55a18d689a8ca91a5d7469215", "url": "https://www.bonappetit.com/story/ways-to-feel-good-at-home", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "17 Indoor Activities to Make You Feel Good at Home Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirus17 Ways to Feel Good at Home Right NowHow to practice social distancing without going completely stir-crazy.By Aliza AbarbanelMarch 18, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailCancelling plans to stay in and watch Love Is Blind while inhaling popcorn is pure pleasure. Social distancing, sheltering in place, and generally avoiding the outside world is, well, not.We’ve spent the past few days learning that our appetite for soft pants remains insatiable, but some of our other go-to apartment activities have lost their edge. So we turned to Bon Appetit staffers and members of the Healthyish community to crowd-source the best things to do inside right now. Read 'em, try 'em, and let us know what your favorite indoor activities are at @healthy_ish.Cook the things you swore you never had enough time to cook. Think: focaccia, enchiladas, chicken stock, wontons. If you’re really looking to lean into baking, Basically has you covered with an all-star 10-recipe baking package. –Sarah Jampel, Basically editorI'm listening to a lot of WBGO, our local jazz public radio station with a cult following. In tumultuous times, something about the eternal erraticism of jazz punctuated by the familiar voices of WBGO's hosts is remarkably comforting. –Trinity Mouzon Wofford, founder of GoldeSeize the moment to wear your favorite seasonally inappropriate clothes. Sundresses, tank tops: your time has come. The best part of office conference calls? Nobody will know you’re wearing cut offs. –Rachel Karten, associate director of social mediaI've been getting really into the daily dramas of my cats, Prince and Pocket. There are whole storylines; it's like a soap opera! You take what you can get in these times. Right now we're in the middle of a very subtle turf war over the couch. On Monday night, I got too involved during their usual zoom session (not a virtual meeting but a nightly ritual where they both just ZOOM around the apartment for 20 minutes straight). They galloped onto the bed and over my face with their claws, so now my face is covered in scratches. I think there's a lesson here about involving yourself in the dramas of others, but I'm not really sure what it is. –Hilary Cadigan, associate editorSince I'm working from home for the foreseeable future, I've been taking these precious moments to play around with the colors and textures I haven't touched in my collection and do my makeup just for me. In the coming weeks, you'll see me wearing a lot of rainbow shadow, glittery liner, and even face paint to do absolutely nothing. My cat seems to really enjoy it. –Mi-Anne Chan, video director at Conde Nast EntertainmentI'm making a conscious effort to put my phone away and read all the books I've been wanting to. Especially the nonfiction ones that I wouldn't otherwise reach for...but know I'll get a lot out of finally reading! Right now I’m reading Pangat, a Feast, by Saee Koranne-Khandekar. Histories of Indian regional cuisines, here I come. –Sana Javeri Kadri, founder of Diaspora Co.Work up a sweat without leaving your apartment. I've been trying to do more than just yoga, so I've been using FitnessBlender. They have hundreds of different Youtube workouts, many focused on just using bodyweight and no other equipment. Plus, they have very cheap, four-week, at-home workout plans on their site, with a pretty robust community. –Joseph Hernandez, research directorI am at home in Dallas with my parents, where I have started joining my mother every afternoon for her daily chai break. Chai is a nice way to break up the day, and give me a boost of energy for the last few hours of work. It's also a nice ritual to look forward to, during these days where we don't get to go out to eat. My mom has developed a shortcut method to making chai that I have now adopted — she boils water in a kettle, pours it into mugs filled with a few smashed cardamom pods, a spoonful of white sugar, and black tea bags. She lets that steep for a few minutes, and then tops it off with milk. We lay on the couch for 10 or 15 minutes sipping our tea, and then retreat to our work stations. –Priya Krishna, contributing writerIf you’re able, take a mindful walk. Observe how your body feels and watch for signs of spring, like daffodils popping up out of the earth and buds appearing on tree branches. –Aliza Abarbanel, Healthyish assistant editorLiterally just sitting down and listening to full albums from start to finish has been a very calming thing for me. I tend to fall back on a few select tracks, but it's been really nice to put on a full album and appreciate its nuances, like how tracks fade into and out of each other, or the lil transitions I might have missed. Need a new playlist? We’ve got you covered. –Jesse Sparks, editorial assistantHost a virtual dance party. Make a playlist and share it with your friends, then invite everyone to join on FaceTime. Or sign up for a virtual class like Dance Church and dance like no one's watching, because no one is...except maybe your dog.   –Amanda Shapiro, Healthyish editorTurn fresh produce into pickles. When I feel stressed, pickling feels like one thing I can physically do amidst the mountain of things outside of my control. Yesterday I did red onions, and cabbage is on the horizon. Somehow, the pungent smell of vinegar is soothing. –Allie Wist, photo editorThe news is too much right now, and so is social media. I’ve opted for screen-free time, working on puzzles while listening to audiobooks I’ve been meaning to catch up on. Right now, I’m listening to Such A Fun Age. –Alisha Ramos, founder of Girl’s Night InI’ve been finding the most joy by doing things with my hands: making elaborate pancake breakfasts, creating to-do lists with Bright Ideas metallic colored pencils, filling out my U.S. Census form, perfecting my chess game, and of course, tinkering with new blends of tea that we can roll out when this is all over. –Smita Satiani, co-founder of Alaya TeaClean the spots of your apartment that, um, you usually don’t. Reorganize your freezer: Take everything out, consolidate things, compost any old stuff, write down what you have to plan meals around it. Reorganize your fridge: Take everything out one shelf at a time, consolidate, wipe down the shelves with white vinegar diluted in warm water. Empty the junk drawer. Clean the oven. If you have one, wash the kitchen extractor fan filter (IT IS ALWAYS GROSS). –Gaby Melian, test kitchen managerI’ve been growing herbs and veggies indoors to transplant to my backyard this spring. I’m currently watering little plants like tomatoes, cucumbers, okra, and arugula, and I’m about to start some thyme, rosemary, kale, cabbage, and broccoli. I’m so grateful for my garden! –Dominique Drakeford, founder of MelaninASS and co-founder of Sustainable BrooklynIf you don’t have a sprawling houseplant collection or access to a garden, sprout a dried bean from your pantry. Whenever I soak dried beans for cooking, I try to take one or two and pop them into a cup of dirt on my windowsill (the Miyozakura panda sake cups are perfect for this). Not all of them sprout, but the ones that do grow super fast, which is really rewarding to watch. (Like, 'I did that!' even though literally all I did was put one bean into a cup.) They'll probably outgrow the cup before they have a chance to produce anything, but it's still gratifying to watch how quickly they grow and add leaves, and you don't need a raised bed or even outdoors space to do it. My next idea is to stage a bean race by planting a few different kinds side-by-side and seeing who wins. My husband tells me this is 'literally like watching grass grow' but I mean… desperate times, right? –Gray Chapman, freelance writerExplore Bon AppétitHealthyishSelf CareCoronavirusRead MoreLifestyle6 Very Good Things to Eat Right NowGallery6 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-18", "author": ["Condé Nast", "Aliza Abarbanel"]}