{"id": "b2021efc8c4fc24aad3070165c563b16", "url": "https://www.bonappetit.com/story/thanksgiving-ham", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Thanksgiving Ham Is What Your Holiday Is Missing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Thing Your Thanksgiving Is Missing Is…HamIt makes all the difference when the sandwiches are assembled.By Carla Lalli MusicNovember 21, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’ll tell you what about turkey: I like it a lot. I think turkey is delicious. I am not one of those people who complains about turkey, because I make turkey several times a year—on purpose. Turkey is one of the great poultry options, I dare say.But the thing about Thanksgiving is that it’s supposed to be a feast. And a feast implies excess. There should be options—possibly too many options! When you’re at a feast, you indulge, and then you indulge again, and then you realize there may be items you haven’t indulged in yet, so you go back for more. And when it comes to sides, we do a great job of this, with multiple dishes in the same category: mashed potatoes and yams. Green beans and collards. Stuffing and dinner rolls. Pumpkin and apple pie. So why—why!—is there only one protein on offer? Year after year the turkey sits on a throne alone, a queen without a king.Want this letter before it hits the website? Sign up for our newsletter!Photo by Alex LauWell it took me long enough, but I finally realized that ham is the king, and Thanksgiving might be lacking something without it on the table. I’m not talking about a fresh ham that you have to cure and do a bunch of other stuff to, or a spiral cut ham (like the beauty pictured at the top), which is a centerpiece all its own. I’m talking about a nice, tidy, compact little smoked ham like the one I order from my butcher, The Meat Hook, in Brooklyn. A few thin slices of salty ham draped over a turkey leg is a fine thing to behold, its smoky fattiness copacetic with every other side on the annual November menu. The ham requires an oven of its own, it’s true, but all you have to do is park it in there for the requisite amount of time to reheat before slicing it. Don’t even worry about it! Tell your incompetent cousin to bring it!But ham’s true contribution kicks in on Thanksgiving Weekend, when the pajamas are donned and the sandwiches are assembled. With leftover ham in the mix, any old turkey sandwich can become a deluxe deli combo, and who wouldn’t want that? When ham is an option, all of a sudden there’s Dijon on my sandwich in addition to the usual mayo, and if the turkey’s a little dry, the nice juicy ham helps fix that. Ham: so much to be thankful for.Explore Bon AppétitCarla NewsletterThanksgivingHamRead MorecookingThe Perfect Thanksgiving Stuffing: There Will Be Corn NutsBy Alex BeggsLifestyleHow to Make Your Vegetarian Loved Ones Happy on ThanksgivingBy Sarah JampelcookingCrispy Black Rice and Sweet Chinese Sausage Team Up for the Thanksgiving Side of Our DreamsBy Hilary CadigancookingCranberry Sauce Is the Last Thing You Should Stress About on ThanksgivingBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-21", "author": ["Condé Nast", "Carla Lalli Music"]}