{"id": "b211220d4505424c82988cdb21979b61", "url": "https://www.bonappetit.com/story/spice-blends", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "5 Spice Blends We Can Get Behind | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking5 Spice Blends We Can Get BehindTaco seasoning, steak rub, and curry powder don't make the list.By Sarah JampelMay 20, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailWant to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: how to start a spice collection and put it to use.When spice blends are good, they’re game-changers, providing big, complex flavor so that you don’t have to toast and grind a potpourri of spices to make a weeknight meal. But if you’re picking up a random blend from the grocery store, you probably don’t know exactly what you’re getting: Spice blends can be unpredictable and confining, tethering you to a flavor combination that you might not love. Some also contain added salt, which throws off your seasoning. And, unless you're getting it from a trusted source, it might be on the stale side.By replacing your jars of amorphous, aging spice blends (curry powder, taco seasoning, steak rub, your time is up) with the constituent spices themselves (like cumin, coriander, and turmeric, for example), you’ll have more options for customizing to your liking.All that being said, there are some spice mixes that we lean on because they’re tricky to make or specific enough that they’re fairly reliable. Here’s our shortlist:Vadouvan: thought to be born out of the French colonial rule of Pondicherry, India, the base of this sweet and slightly smoky masala (i.e. spice mix) is granulated shallots, onion, and garlic, with fenugreek being a common addition; try it in yogurt dip or as part of a dry rub for roast chickenZa'atar: bright, herbaceous, and toasty, it varies across the Middle East but is often a combo of dried oregano, thyme, and/or marjoram with sumac and toasted sesame seedsOld Bay: a proprietary blend of celery salt, paprika, and pepper, it goes hand in hand with shellfishChaat masala: made up of dry mango powder, cumin, coriander, black salt, asafetida, and chile powder, it adds an umami funk to everything from sliced fruit to boiled potatoesFive-spice powder: the eponymous number refers not to the components (which can include star anise, cinnamon, cloves, Sichuan peppercorns, and fennel seeds, among others), but to its harmonious blend of the five traditional Chinese elements and flavors; try it in these glazey pork ribsPut that blend to use:Sticky-Sweet Five-Spice Pork RibsLacquered with a tangy, garlicky hoisin glaze, these ribs are impressive without being burdensome: There's no grilling or marinating—just two hours in the oven followed by a quick broil.View RecipeExplore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-20", "author": ["Condé Nast", "Sarah Jampel"]}