{"id": "b21c94cffb0039ecf4104c5a3f5bc3ba", "url": "https://www.bonappetit.com/recipe/mochi-stuffed-jujubes-soft-hearts", "year": 2022.0, "month": 1.0, "day": 5.0, "content": "Mochi-Stuffed Jujubes (Soft Hearts) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMochi-Stuffed Jujubes (Soft Hearts)By Jessie YuChenJanuary 30, 20225.0(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintOriginating in Shanghai, these mochi-stuffed jujubes are also called soft hearts in Mandarin, named after the soft mochi center at the heart of the jujube (also known as Chinese red dates). The stuffed jujubes are poached in a simple syrup infused with dried osmanthus flowers, which have a floral, honey-like aroma and are often used in teas and desserts. The resulting cute little treats have a subtle sweetness and a satisfyingly chewy texture. They’re a simple dessert to make for a festive occasion and have only four ingredients. Jujubes and dried osmanthus flowers can be found at Asian grocery stores, in local Chinatowns, and online. —Jessie YuChenSee Jessie’s recipes for Mushroom YouFan and Jessie's Special Steamed Whole Fish to complete your Lunar New Year feast, and read about their favorite Lunar New Year traditions here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronParing Knife$10 At AmazonSmall Saucepan$155 At AmazonSpider$6 At AmazonIngredients2–4 servings12dried jujubes6Tbsp. mochiko (sweet rice flour)½cup raw sugar or light brown sugar½tsp. dried osmanthus flower, plus more for servingPreparationStep 1Working one at a time, make a lengthwise cut on 12 dried jujubes all the way to the center; carefully remove pits without breaking them, leaving as much flesh intact as possible. Place pits in a medium saucepan; set aside. Set jujubes aside separately.Step 2Combine 6 Tbsp. mochiko (sweet rice flour) and 3 Tbsp. room-temperature water in a medium bowl and mix and press with your hands until a dough forms. Form dough into small balls that are slightly smaller than your jujubes (about 1 tsp. or ½\" in diameter), then gently roll balls into fat cylinders. Place a cylinder in the center of each reserved jujube, gently pressing sides to ensure good contact between dough and jujube. (Extra dough can be made into little mochi balls and cooked in syrup.)Step 3Place ½ cup raw sugar or light brown sugar, ½ tsp. dried osmanthus flower, and 2 cups water in reserved saucepan with pits (using the pits here will add more jujube flavor to the syrup). Bring to a boil, reduce heat, and let simmer until sugar is dissolved, about 2 minutes. Add stuffed jujubes and reduce heat. Simmer gently, adjusting heat as needed, until jujubes float to the surface and mochi is slightly puffed, 10–13 minutes. Remove from heat; fish out and discard pits.Step 4Immediately arrange stuffed jujubes on a plate or in a shallow bowl. Drizzle syrup over and top with more dried osmanthus flower. (For a cold and chewier treat, combine jujubes and syrup in an airtight container, cover, and chill at least 20 minutes and up to 2 days.)How would you rate Mochi-Stuffed Jujubes (Soft Hearts)?Leave a ReviewTell us what you thinkExplore Bon AppétitDessertFruit DessertEasyVeganDairy-FreeNut-FreeChineseEast AsianAsianShanghainese5 Ingredients or FewerGlutinous Rice FlourFlourDateDried FruitFruitLunar New YearRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-30", "author": ["Condé Nast", "Jessie Yuchen"]}