{"id": "b221a61c628534329f55a9e6f6cb081d", "url": "https://www.bonappetit.com/story/food-scenes-the-incendiaries", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "We Need to Talk About the Food Scenes in 'The Incendiaries' | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Need to Talk About the Food Scenes in 'The Incendiaries'How this summer’s must-read novel about a cult turns food into temptation.By Katherine CusumanoAugust 21, 2018FacebookTwitterEmailFacebookTwitterEmailLike you, like me, writer R.O. Kwon loves food. This was among the first things she told me when I called her to discuss the array of takeout and picnics and buffets in her smash debut novel, The Incendiaries. Okay, The Incendiaries is actually about an extremist Christian cult, called Jejah, with ties to North Korea. But it’s also about food. Separately, food and cults, cults and food, are pretty powerful collective interests. But together? They make for a summer read you’re about to add to your queue if you haven’t already.In The Incendiaries, a young woman, Phoebe Lin, is drawn into Jejah by its charismatic leader, John Leal, while her boyfriend, Will Kendall, watches with alarm as its practices grow more and more radical—culminating in the bombings of five abortion clinics. (I promise, this isn’t a spoiler.) If it sounds like a lot, well, it is. The novel deals with religion, extremism, geopolitics, gender, and class—and it uses food as a way to navigate these hefty themes. Meals described in lush, sensory detail anchor many scenes, helping to ground the characters in their literal, physical needs. At the same time, they mirror the way extreme faith can seem to mend the losses Will and Phoebe have both suffered: Will continues to grapple with the loss of the evangelical faith he believed in from childhood, while Phoebe still blames herself for a death in her family.The first time Will and Phoebe gather with the members of the cult, it’s over an abundant—and somewhat menacing—dinner. “Pink meat bled when I cut it open, the charred bits crunching like minute bones. A torn roll steamed; butter liquefied. Oil dripped, gilding white porcelain. Teeth flashed, smiling,” observes Will. The meal is pure temptation. “Of all people, I should have recognized this warmth for what it was: a bag of tricks. The fellowship, a little food,” Will continues. (After all, having lost his faith during his first year at bible college, Will is best equipped to see through the illusion.) “The hocus-pocus bribe of hot bread, lavish, like God: take, eat. This is my body, which is broken for you.”Diners are tempted by a similar illusion at the local restaurant where Will works, a haute Italian place run by a gruff manager named Paul. (To illustrate these scenes, Kwon drew on her own experiences working in food service for a summer.) Will waits tables to pay his bills and scrounges for apples from the campus dining hall to tide him over between family meals. At the restaurant, he’s taunted by white-peach Bellinis; limoncello; and spumoni in cherry, chocolate, and pistachio, compounding his constant hunger. But the diners he’s serving don’t care much about the particulars of the restaurant’s suckling pig ravioli, or its poached quail. One table berates him when he’s unable to fulfill their precise demands. For them, the food itself isn’t especially important—it’s what it communicates. As Paul puts it, “They’re wild about a first-rate place like this because it’s selling an illusion,” he says. “To be fed well is also to feel loved.” Kwon deftly evokes both the physical and emotional experience of a good restaurant dinner here—it’s almost churchlike, underscoring how this kind of fulfillment remains just out of Will’s reach.To demonstrate his own love, Will plans a picnic for Phoebe, bringing along a basket spilling over with “stilton hunks, fat-pebbled pâté. Plum jam. The half-baguette. Ripe peaches. Mulled wine in a jug,” she recalls, conjuring both the sweetness of the gesture (she recognizes such a spread is beyond Will’s means) and its excess (“I ate too much, past appetite,” she says). Later, while in Beijing for a summer internship, Will indulges in various meals throughout the summer: “I glutted myself on roasted Peking duck and paper-wrapped trout, mapo tofu and thrice-cooked bacon. Boiled, succulent jiaozi. Lamb shish kebabs. Mouth-stinging Sichuan hotpots. Baozi. Jianbang. Spiced grass carp,” he lists. He’s insatiable—because for the first time, he can afford to feed himself. But the series of meals also stands in for the sense of wholeness he once found in his faith. Each flavor is more powerful, each scent more pungent than the last; as you read, it’s almost tangible, communicating the depths of Will’s nostalgia for the time when he believed. “I was imagining he, in part, loves the food in Beijing because it reminds him of the time just before he lost his faith,” Kwon said. “There’s possibly some comfort he draws from that.” Even as it traverses the globe, The Incendiaries inevitably comes back to food, engaging each of the senses to bring the reader wholly into Will and Phoebe’s world.But among the deadly sins, gluttony is deadliest—at least for Jejah’s adherents. As the cult grows more fanatic, its leader requires his followers, Phoebe included, to fast, to “deny themselves those carnal pleasures—or those carnal needs,” Kwon told me. In their effort to achieve some kind of spiritual satisfaction, the members embrace their emptiness. “We believed with our bodies,” Phoebe says. It’s here that the promise of the cult begins to fracture, in the confusion between needs and desires. But that’s all I’ll give away here.“I wanted to write a book in which I could give witness to what it felt like both to lose a faith that I believed ardently in,” Kwon told me, “but also what it felt like to fall into it—how incredible it felt when I did believe in God.” The temptation for Phoebe and Will is a spiritual appetite satiated, the promise a stomach filled. But this, too, is an illusion: The hunger always returns, eventually.Buy The Incendiaries here.Explore Bon AppétitBooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Katherine Cusumano"]}