{"id": "b2291defdccf8b980425b6a03811b4b8", "url": "https://www.bonappetit.com/story/sophia-roe-recipes", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Sophia Roe Shares 4 Healthyish Weeknight Dinners Because We Can't Survive on Cookies Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle4 Healthyish Weeknight Dinners Because We Can't Survive on Cookies AloneChef and wellness advocate Sophia Roe shares her recipes and tips for cooking good-for-you food on the fly.By Aliza AbarbanelDecember 1, 2020FacebookTwitterEmailPhotograph by Laura MurrayFacebookTwitterEmailThese recipes are part of Bon Appetit's December Holiday issue. Catch up on all the recipes, articles, and more here.We live for gingerbread, hot toddies, and all the other festive foods and drinks this time of year brings, but we also crave a bit of balance—especially around dinnertime. That's why we're taking our cooking queues from chef and wellness advocate Sophia Roe. When Roe cooks dinner at home, it’s always streamlined for speed. Based in Brooklyn, Roe has been busy producing and hosting Counter Space, a new Vice show. Each episode explores the global evolution of food through the context of current events, like Hong Kong's protest food and Yemen's crisis-plagued coffee fields. When she’s not doing that, she’s teaching her devoted Instagram followers how to preserve lemons and braise cabbage while also engaging them in candid conversations about subjects such as anti-racism and how to cope with trauma. So when Roe needs to get dinner on the table for herself and her family, she prizes healthyish plant-based dishes with minimal prep or fuss. “Some people think elevated food needs to take a long time, but that’s not true,” she says. “You just need to put purpose and thought into it.” Instead of relying on too many ingredients or high-tech equipment, Roe deploys practical techniques (preheat your baking sheet for the crispiest roasted sweet potatoes!) to create meals with instant appeal. Her recipes below are all designed to come together quickly from start to finish but will go even faster if you prep a few things, like a pot of black lentils or brown rice, ahead of time. Cooking dinner has never felt better.All-Dressed-Up Cauliflower RiceFluffy, textured cauliflower rice with warm spices and crunchy roasted pumpkin seeds.View RecipeBeluga Lentil and Root Vegetable SlawAny crunchy vegetable or fruit can live in this colorful slaw—try fennel, small turnips, or Asian pear.View RecipeSweet Potatoes With Maple TahiniCrispy roasted sweet potato wedges get tossed in a sweet and nutty tahini dressing in this quick vegetarian weeknight dinner.View RecipeTofu With Rice and Miso-Maple DressingCrispy tofu cubes get tossed in a sweet and savory glaze that hits all the umami notes.View RecipeExplore Bon AppétitHoliday 2020HealthyishWeeknightVegetarianRead Morerecipes63 Healthy Weeknight Meals That Are Faster Than Waiting for DeliveryGallery63 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Aliza Abarbanel"]}