{"id": "b22bf19a4e439379d50d17e80e5e80d0", "url": "https://www.bonappetit.com/recipe/rigatoni-with-fennel-and-anchovies", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Rigatoni With Fennel and Anchovies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueRigatoni With Fennel and AnchoviesBy Evan FunkeMarch 17, 20204.7(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintSomething truly magical happens when fennel, garlic, and anchovies get caramelized together in olive oil, then paired with citrus zest. Even the firmest anchovy haters will agree. This recipe is from Evan Funke, chef-owner of L.A.’s pasta temple, Felix Trattoria.Ingredients4 servings3large fennel bulbs (about 2½ lb.)½cup extra-virgin olive oil6oil-packed anchovy fillets6garlic cloves, thinly sliced½tsp. crushed red pepper flakes½cup (packed) mint leaves, plus more torn for serving1orange or tangerine1lemon1lb. rigatoni3oz. Pecorino Romano, finely  grated (about 1½ cups)PreparationStep 1Remove tough outer layers and fronds from fennel bulbs and discard. Working one at a time, cut bulbs lengthwise (through root ends) into quarters, remove cores, and slice quarters lengthwise into ½\"-thick wedges.Step 2Heat oil in a large Dutch oven or other heavy pot over high until shimmering. Add fennel to pot, arranging in as even a layer as possible. Season with salt and cook, undisturbed, until golden brown underneath and starting to soften, 6–8 minutes. Using tongs, turn fennel over and cook until golden brown on the other side, 6–8 minutes.Step 3Reduce heat to low and add anchovies, garlic, red pepper flakes, and ½ cup mint to pot. Cook, stirring often, until anchovies are disintegrated and garlic is golden, about 2 minutes. Remove pot from heat and finely grate zest of orange and lemon directly into hot oil; stir well to evenly distribute. Cover pot to keep sauce warm and let sit until pasta is done.Step 4Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1½ cups pasta cooking liquid.Step 5Uncover sauce, add pasta and 1 cup reserved pasta cooking liquid, and set over medium-low heat. Add Pecorino and cook, tossing vigorously and adding more pasta cooking liquid if needed, until sauce is emulsified and pasta is coated, about 2 minutes.Step 6Divide pasta among bowls and top with torn mint.How would you rate Rigatoni With Fennel and Anchovies?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleI've always been extremely curious about how to use anchovies. It's got such a stigma as an ingredient, and in an effort to be open-minded I attempted this recipe. And I have to say, the kind of umami it brings to the dish, married with all the other ingredients is just out of this world. My SO is not a pasta-person like me, so it was a really big deal when he requested I make this AGAIN not 2 weeks after my first attempt. I'm now on the lookout for all kinds of ways to incorporate anchovies into my cooking. godsyllaLos Angeles, CA4/7/2021Love this recipe! Super delicious and easy to make. Only note is that I used an orange that was a little on the large size and overpowered the rest of the dish slightly. Definitely keep it a small orange if you're choosing that over a tangerine! BradleyVancouver, BC11/10/2020Ahh I love, love, love this recipe!! I've made it so many times that I can't even keep count. I always make it vegetarian, subbing in 2 tablespoons of soy sauce, 1 cup of mushrooms, and 1 tablespoon of capers for the anchovies. I also alternate between fennel and anise—really whatever the grocery has :)Clara11/9/2020My FAVORITE BA pasta dish! I love making this. It’s so easy and such amazing flavor. AnonymousVancouver9/10/2020This is easy to make and absolutely delicious. I agree with others that fitting all the fennel in one layer is tough. After the first 5-6 minutes, however, as the fennel cooks down a bit, it becomes easier to fit them all. Regardless, the flavors pack a huge punch, with the brightness of the citrus and the umami of the anchovy. Wow was this great.Los Angeles6/8/2020Love this recipe! Have made it four times, both with anise and with fennel. So good. Wouldn't change a thing.AnonymousNew York5/25/2020I cut the recipe in half since I was only cooking for two people, but even with my large dutch oven I imagine the full recipe would have been a tight squeeze. Taste was fantastic though, and it came together quick! I ended up adding the juice from the zested lemon too since I love citrus. AnonymousRichmond, va5/20/2020This dish was very tasty and really easy to put together. I happened to have some left over lovely cooked white beans from another BA recipe so I added them in for extra protein. That did change the texture and look of the dish - made the sauce even thicker/creamer. I was frustrated by the description of how to cut the fennel, still not sure I did it according to the recipe, and I definitely could not fit all 3 large bulbs in one layer, but with a longer cook time and mixing often to make sure uncooked fennel parts made their way to the bottom of the pan I got some beautiful caramelization. I loved the mint and zests, both things I have been cooking more with thanks to BA. I never think to use mint on my own, it has been a fun new flavor profile to explore. San Francisco, CA5/13/2020This review is for people who, like me, find they have purchased the wrong kind of little fish when they’re already halfway through cooking the fennel!! With only a can of sardines in my cabinet and no experience cooking with either anchovies or sardines, i panicked and improvised a vegetarian substitute for the anchovies: about 1/4 cup soy sauce and maybe a cup of sliced mini portobello mushrooms. Was it the same as with anchovies? Probably not! Was it really good? YES!! I also\nadded a little juice from the orange at the end to brighten it up a little. Amazing!!AnonymousMichigan 5/3/2020I tried this pasta tonight in Italy. This recipe is so delicious and full of flavor. I did not have mint and it was perfect the same for me. I added an extra anchovy and used sedanini gluten free pasta I had on hand and the size of the pasta worked well with this recipe. Great job BA! Mediterranean foodiePadua, Italy4/26/2020This was my favorite pasta recipe out of the series in this month's issue. I wasn't too confident but the fennel, citrus, and mint blend together so well. Anchovies are just a little boost of love.darrahpState College, PA4/24/2020I was skeptical but the reviews were so good I decided to try it. I really like it - the caramelized fennel, anchovies, and pecorino all work together to create a really delightful funk. I think the lemon, orange and mint work well too - but next time I make this, I would sub out basil for the mint, just to come slightly back to a more familiar pasta profile. I could also use more anchovies. I have a really wide pot with deep sides which was perfect for cooking the fennel. If you use a traditional dutch oven, I can't imagine doing this in fewer than 2 batches for that first step. AnonymousMontreal4/18/2020I’m still eating this and had to pause to write a review. This is insanely delicious. I really wanted to try it because it’s all ingredients I love but would never, ever naturally put together. You know what, it totally bloody works. It’s delicious.\n\nI made it mostly as written, although I did increase the garlic and anchovies a little per other suggestions. Next time I’d add a tiny bit more even! And be sure to season really well. Also, I accidentally used parmesan instead of pecorino, which would have been even better. Either way, insanely good! I had to do the fennel in two batches even though I have an enormous cast iron. No sweat though - still easy as pie. Looks like a crazy amount of fennel to begin with I almost halved it but trust the recipe, it cooks down. laracbMelbourne, Australia4/15/2020Have to admit, I was a little unsure of the combination of flavors when reading this recipe, but I trusted in BA and am glad I did. Turned out surprisingly delicious! I made a half recipe of it, everything as written except that I threw in a few extra anchovies, because why not ;) I found that this dish really needed a fresh, zippy salad to go on the side to balance out the deep savoriness of the pasta.AnonymousSan Francisco, CA4/15/2020This recipe is a keeper as written!  So dang good!jcaryhob4/5/2020Explore Bon AppétitPastaItalianEuropeanFennelVegetableRigatoniPasta & NoodlesAnchovyFishSeafoodGarlicMainNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Evan Funke"]}