{"id": "b230ac9f0b88907d91a2bade4a95b965", "url": "https://www.bonappetit.com/recipe/pollo-al-carbon", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "Pollo al Carbon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPollo al CarbonBy Jarrett MelendezJuly 25, 20214.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Kat Boytsova EmailPinterestPrintEmailPinterestPrintWhen I was living in Mexico, whenever I didn’t feel like cooking, I’d hit up the nearest roadside vendor or neighborhood stand selling pollo al carbon. I’d buy a whole grilled chicken with salsa verde, pick up some fresh, still-warm tortillas, and resist the temptation to stand in the street using those very tortillas to pull chunks of juicy meat off the bone. Because I’m now living in the U.S., I developed this recipe for my cookbook, The Comic Kitchen, mostly so that I can eat this anytime I want. And now you can too! Because the coals generally burn longer than you need for just the chicken, take advantage of that residual heat to warm up tortillas and make fire-roasted salsa verde.Speaking of salsa, use jalapeños for a milder salsa and serrano chiles if you prefer something a little fiery. Instead of a whole chicken, skin-on, bone-in breasts are ideal for easy prep and grilling. Resist the temptation to go with skinless, boneless breasts for this. Although this method may take a little longer to cook, the boost in flavor and juiciness from using skin-on, bone-in breasts is well worth it.“Al carbon” specifically refers to charcoal, though it is completely possible to do this on a gas grill. The directions are largely the same: Just light half the burners to create the same 2-zone heating situation. —Jarrett MelendezAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronInstant-Read Thermometer$35 At ThermoworksCharcoal Grill$98 $82 At AmazonMicroplane$16 At AmazonWeber 7429 Rapidfire Chimney Starter$28Blender$32 At AmazonChef's Knife$34.53 At AmazonLarge Bowl$18 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketMedium Bowl$17 At Amazon16\" Heavy Duty Stainless Steel Utility Tongs$6 At AmazonColander$11 At AmazonIngredients4 servings4skin-on, bone-in chicken breasts (3–4 lb.)2large oranges3limes, divided2medium onions, divided7garlic cloves, divided2Tbsp. vegetable oil or grapeseed oil, divided, plus more for grill3tsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, divided1Tbsp. ancho chile powder2tsp. ground cumin1tsp. dried Mexican oregano1tsp. freshly ground black pepper1lb. tomatillos2jalapeños or serrano chiles¼cup cilantro leaves with tender stems, plus more for servingTortillas (for serving)PreparationStep 1Place 4 skin-on, bone-in chicken breasts (3–4 lb.) in a large bowl or resealable plastic bag. Finely grate 2 large oranges and 2 limes into a food processor or blender with a Microplane. Cut zested oranges and limes in half and squeeze juice into processor (you should get about 1¼ cups juice). Cut 1 medium onion into quarters, then add it to processor along with 6 garlic cloves. Add 1 Tbsp. vegetable oil or grapeseed oil, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, 1 Tbsp. ancho chile powder, 2 tsp. ground cumin, 1 tsp. dried Mexican oregano, and 1 tsp. freshly ground black pepper and process or blend until slightly chunky but uniform in color. Pour over chicken and toss to evenly distribute. Cover bowl (or seal bag) and chill at least 30 minutes and up to 4 hours.Step 2Meanwhile, prep the salsa ingredients. Remove husks from 1 lb. tomatillos; discard. Rinse tomatillos and place in a medium heatproof bowl. Peel remaining 1 medium onion, cut in half, and add to bowl. Remove stems from 2 jalapeños or serrano chiles; discard. Add chiles to bowl. Drizzle in 1 Tbsp. vegetable oil or grapeseed oil and add remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; toss to coat.Step 3Fill a chimney starter with charcoal and lightly pack crumpled newspaper or brown paper bags into the bottom of the starter. Remove upper grate from grill and place chimney starter on lower grate. Using a lighter or long match, light newspaper. As the paper burns the coals will slowly ignite. After 10–15 minutes, coals should be glowing and coated in white ash with little to no black spots remaining. Carefully dump coals onto half of grill in an even layer. If needed, use a long pair of grill tongs to push coals into place. Coat upper grate with oil and set over coals. Your grill is now prepared for 2-zone heat—the side with coals is the hot zone and the side without coals is the cool zone. Cover grill and open air vent on top. Let heat 5 minutes.Step 4Remove chicken from marinade, allowing excess to drip back into bowl; discard marinade. Place chicken, skin side up, on grate over indirect heat. Cover, making sure air vent is over chicken, and grill until an instant-read thermometer inserted into thickest part of a breast registers 155°, 25–30 minutes.Step 5Uncover grill and slide chicken breasts over direct heat. Grill, still skin side up, until crisp and lightly charred in some spots underneath, about 2 minutes. Turn over and grill on other side until crisp, deep golden brown, and charred in some spots, about 2 minutes. Check internal temperature again—thermometer should register 160°. If not, move chicken back over indirect heat, cover, and let cook another 2–4 minutes before checking temperature one last time. Transfer chicken to a platter and let rest in a warm spot 15 minutes.Step 6While the chicken rests, make the salsa. Arrange tomatillos, onion, and chiles on grate over direct heat. Cook, turning occasionally, until vegetables are softened and lightly charred all over and tomatillos release their juices, 10–12 minutes. Transfer vegetables back to bowl and let cool slightly.Step 7Arrange tortillas over direct heat and grill until warmed through, pliable, and lightly charred in spots, about 30 seconds on each side. Wrap tortillas in a kitchen towel to keep warm.Step 8Transfer tomatillos, onion, and chiles to clean food processor or blender and add remaining 1 garlic clove and ¼ cup cilantro leaves with tender stems. Cut remaining 1 lime in half and squeeze juice into processor. Cover and pulse until salsa is thick and chunky but pourable. Transfer to a bowl. Serve salsa with chicken, warm tortillas, and more cilantro. (You can pull meat from the bones and slice and shred before serving, if desired; discard bones.)How would you rate Pollo al Carbon?Leave a ReviewTell us what you thinkExplore Bon AppétitMexicanLatin AmericanChickenPoultryChicken BreastOrangeCitrusFruitLimeAncho ChileChileVegetableTomatilloJalapeñoSerrano ChileSummerMainDairy-FreeGluten-FreeNut-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-25", "author": ["Condé Nast", "Jarrett Melendez"]}