{"id": "b234822237c4202dc0b69498eb18d735", "url": "https://www.bonappetit.com/story/cellar-door-provisions", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Cellar Door Provisions Is the Perfect Restaurant That Is Positive It Could Be Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleCellar Door Provisions Is the Perfect Restaurant That Is Positive It Could Be BetterThis hyper-seasonal Chicago cafe has been quietly rejecting and rethinking restaurant culture...while turning out some of the best food in the city.By Julia KramerFebruary 20, 2019FacebookTwitterEmailBehind all the beautiful food at Celar Door, you'll find (opposite, from left) servers Maeve Coughlin and Breanne Johnson, line cook Bryant Nishida, shift lead Jennifer Sher, line cook Dylan Heath, and co-owners Emily Sher, Ethan Pikas, and Tony Bezsylko.Photo by Alex LauFacebookTwitterEmailPart 1: The QuicheThe Cellar Door Provisions quiche has the texture of just barely set custard, its crust made up of a million tiny unknowable layers of butter and flour. It is the only thing on the menu that does not change. And if you ask Gabe Moya, the chef de cuisine of this unusual little corner café in Chicago’s Logan Square neighborhood, what he thinks about it, oh, he’ll tell you.First of all, despite the fact that he grew up in Puerto Rico, Moya is “not a custard person,” doesn’t even like flan—“and that’s what the quiche is: a pie.” Second: “It has, like, 900 calories per slice, and that’s not counting the brisée.” (He calculated this once.) Third, and most important: It bears little relation to the type of cooking—built around whatever vegetables are available and whatever others have fermented long enough—that Moya’s actually interested in. “Any time there’s a write-up,” he says, taking a paring knife to the wilty stalks of a cardoon, “it’s just bread, butter, quiche.”The now legendary quiche, served with a little pile of greens from Three Sisters Garden in Kankakee, Illinois.\nPhoto by Alex LauCellar Door bakes four quiches a day (five on weekends), each of which is divided into ten slices. “I think we could probably sell more?” says Tony Bezsylko, one of the owners, in the form of a question, as if he’d never thought about it before. “But no one is going to have a good time making more quiche than that,” he says. “What you’re doing is not terribly engaging—you’re buzzing milk, cream, and eggs.” Also: “You don’t want to taste tons of dairy all the time.”The quiche is based on Thomas Keller’s recipe from Bouchon Bakery, which another of Cellar Door’s owners, Ethan Pikas, learned while cooking at a fine-dining restaurant in Phoenix called Binkley’s. Except at Cellar Door, the ratios are pushed to the brink: less egg in relation to cream and milk in the custard, more butter laminated into the pâte brisée, yielding a crust with puff pastry–like flakiness. The fat content in the dough is so high that you can’t trim the edges before it’s baked: Without the excess overhang serving as a counterweight, the dough would collapse in on itself. The custard is so delicate that the baked quiche has to chill overnight before it can even be sliced.I have a lot of thoughts about Cellar Door: about why it’s my favorite restaurant in Chicago, about why it’s significant that it’s in Chicago, about how it rejects and rethinks so many deeply ingrained aspects of restaurant culture. But I think the quiche—both in its greatness and in its limitations—makes the clearest introduction to the very particular mentality of this restaurant.The quiche tells you what uncommonly, absurdly, perfectionist-ly good cooking is going on at Cellar Door Provisions. But it also tells you that there’s more to Cellar Door than creating the best possible version of something. It tells you that it also matters whether the cooks enjoy working on something. It matters that the food makes you feel good and healthy—not just as a diner but also as a cook. And the quiche matters so much that no compromises will ever be made to sacrifice its quality. “The more of something you make, the worse it gets,” Bezsylko says. “I can’t see any pleasure in having a quiche factory.”Part 2: The ChefNow, a confession. Cellar Door Provisions has been my favorite restaurant in my hometown of Chicago for years, but until recently I could not have told you who the chef was. This might not seem that weird—plenty of people go out to eat without caring who the chef is—except that as a food writer, it’s been my job for the past decade to know this type of information. It’s also weird because the hype surrounding a new restaurant opening pretty much always revolves around who the chef is. How is it possible that some of the most original cooking happening anywhere in this country is at a restaurant that has never touted its chef as any kind of public figure, and in fact, for a long time, didn’t really have a head chef in the traditional sense at all?Confitted carrots\nPhoto by Alex LauIt goes back to 2013, when Pikas and Bezsylko signed a lease on a corner space in Logan Square, had a friend build two long wooden tables for the dining room, brought on two more cooks (Justin Behlke and Alex Truong), handwrote the menu on a roll of butcher-block paper, and, in February 2014, opened Cellar Door Provisions. There was no splashy press release. None of the articles written about the opening indicated who the chef was. Chicago’s food scene is informed by who worked for whom: You come up under, say, Paul Kahan, or Mindy Segal, or Rick Bayless. The Cellar Door crew had none of this context.Bezsylko had moved to Chicago in 2010 from Berkeley, where he was working on his dissertation in philosophy and riding his bike to Tartine Bakery three times a week. Unable to find good bread in Chicago, he studied the Tartine Bread book and began baking his own, two loaves at a time, then somehow 30 loaves a week, which he sold to friends out of his house in Humboldt Park.Pikas grew up in the suburbs of Chicago, but the only experience he’d had at a local restaurant was doing a stage (the restaurant equivalent of an internship) at Alinea. The two had begun collaborating on “Bread Nights” at Bezsylko’s house: pop-up dinners built around the sought-after loaves. “After four dinners, we decided to open a neighborhood spot,” Bezsylko says, “with no real plan. I envisioned it as... my house.”The place has never received a formal, starred review from a critic. And a “chef \" is not something you would be able to easily identify in the open kitchen, which has often looked to me a bit like some kind of Oberlin College food co-op. In lieu of fancy, shiny equipment, there are jars of various shapes and sizes lining shelves set up wherever there’s space. On more than one occasion, I’ve seen more people shaping loaves of bread and laminating croissants than eating in the actual restaurant.Most people open restaurants so they can serve dishes they already know how to make. Cellar Door is not most restaurants.The roles “were not well defined,” Pikas says, looking back on the opening. “We didn’t want a traditional kitchen hierarchy.” Instead, what Pikas and Bezsylko wanted was true collaboration: weekly meetings to determine the menu, equal standing among all. As for the name, “We couldn’t think of a better one,” Pikas says with what I now understand to be nearly pathological humility. “It’s kind of a mouthful.”A perfectly swirly oolong-plum laminated brioche\nPhoto by Alex LauMost people open restaurants so they can serve dishes they already know how to make. Cellar Door is not most restaurants. “It was a one-and-a-half-year endeavor of my figuring out how to make croissants,” Pikas says. Scones were a two-year project. Pikas doesn’t dabble; he drills down, writing detailed recipes in painfully neat handwriting on small pieces of notebook paper, then tweaking and rewriting them until he reaches something that approximates perfection. (I doubt he would ever consider anything he’s made perfect, or even finished for that matter.) In the first year, Bezsylko baked Cellar Door Provisions’s naturally fermented loaves.Not to sound like some San Francisco bread bro, but you literally could not find this type and quality of bread in Chicago in 2014, and it is still, in my opinion, the city’s best: for the crackly crust, for the unevenly holed crumb, for the tangy, sweet depths of its long-fermented flavor. I ask Pikas what makes Cellar Door’s bread so good, but of course, he pauses at the premise. “We are still learning it, honestly,” he says. “There are so many improvements we could make.”Eventually the roles became more defined. Pikas is now officially the executive chef. Bezsylko’s title is sous-chef and assistant general manager. And in 2016, Emily Sher came on board, first washing dishes, then working front-of-house, and now as general manager and a partner. Still, you get the sense that Pikas and Bezsylko are constitutionally resistant to any inference of hierarchy. “I’m uncomfortable representing the restaurant as ‘my’ thing,” Pikas says. “I’m in this process of learning as a cook. I’ve never felt like ‘I’m a chef.’”Part 3: The CardoonsCellar Door Provisions opens on Wednesday at 8 a.m., and as usual, there is no one waiting to get in. A lot of things are going on in the kitchen that I can’t really follow. Chuck Cruz, the lead line cook, is frying buckwheat groats and talking with Hailee Catalano, a line cook, about buying a goat. They also happen to be a couple; “we always work the same station,” Catalano says. Someone offers me a spoonful of peach-leaf syrup (clean and vegetal), then a hunk of red kuri squash that’s been lacto-fermenting for two days (practically carbonated), then a sip of something labeled “sunchoke milk” (the most cereal-y of cereal milk).Moya, the chef de cuisine, is cleaning a vegetable I’m pretty sure I’ve never seen in its raw incarnation before, which looks like oversized hardy greens that have been left to wilt in the fridge: cardoons. “I don’t think anyone else buys this from this farmer,” he says, admiring the grayish-green stalks. I hesitate to say this to Moya, but even after the considerable amount of time he spends elaborately cleaning and trimming the cardoons, they still look like sad celery.If Cellar Door were a band, its catalog would be divisible into two categories: Top 40 hits and the deep cuts, the not-crowd-pleasers.Over the two days I spent interviewing the Cellar Door crew, here are some words no one ever said: local, sustainable, organic, seasonal, farmers’ market. This type of sourcing is so core to the Cellar Door project that it all simply goes without saying. Of course, the commitment to this ethic is visible everywhere—even in the quiche: the eggs from Mint Creek Farm, the cream from Kilgus Farmstead, the little pile of greens alongside from Three Sisters Garden, all in central Illinois.Chocolate-persimmon tart\nPhoto by Alex LauUnlike other restaurants that hype their farmers or their larders, at Cellar Door you kind of have to pry to fully understand what is going on with the food. A brussels sprouts salad, for instance. You can guess that the sprouts are from a nearby farm. You can see that they’re prepared two ways: the outer leaves blanched, the interior hearts roasted. But what are the powders on top? “A little bit of sumac and dehydrated ramp-root powder,” Pikas says. And what is the sauce underneath? That’s a purée of turnips and house-made tahini. Oh, and the leaves are dressed in sunchoke oil—which is just the sunchoke scraps they’ve been amassing, infused into sunflower oil at a really low temp— and seasoned with the liquid from a jar of pickled turnips. “That’s one nice simple dish,” Pikas says.At dinner, which Cellar Door began serving on Friday and Saturday nights in 2017, the menu changes weekly. There might be confitted celery root with blood oranges, and a Sardinian-style dumpling filled with ricotta, and cultured brined butter—wait, I haven’t even gotten to the butter. Cellar Door makes its own, using cultured Kilgus cream mixed with a crème fraîche culture they’ve had going for five years now. But because they can’t just serve their regular house-made cultured crème fraîche butter at dinner (where’s the fun in that?), they whisk some brine into it— you know, like from the Napa cabbage they’ve got lacto-fermenting—to create an extra layer of, well, I don’t know what it is, but it’s definitely something.If Cellar Door were a band, its catalog would be divisible into two categories. The first would be the Top 40 hits that everyone loves and immediately understands: quiche, cup of coffee, the canelé with its deeply burnished shell and custardy insides. You taste it; you get it.The sunny scene at Cellar Door's lunch rush.\nPhoto by Alex LauBut there’s a whole other category: the deep cuts, the experiments, the not-crowd-pleasers. And like any good artist, Cellar Door is driven by its indefatigable commitment to this genre of cooking. The intensity of this mission—to create new dishes built around vegetables, day after day—is what invigorates Cellar Door. But...well, you know the myth about Icarus. I’ll be honest: The savory food at Cellar Door can occasionally  fly a little too close to the sun. Everyone there admits as much. “The food got kind of unhinged” at times, Sher says. “It kept the community rather small.”Not to mention, this can all be rather exhausting. “Sometimes we’re like, Who’s making us do this?” Sher says. “Oh, us!” It’s not just the grind of it but also a philosophical objection: “Obsessing over technique is often a way of interjecting my ego into food,” Pikas says. “If it’s possible, I want to get away from ego in food. Simple food can be more emotive than highly technical food.”In an effort to make some of the recipes “less involved,” the team decided to serve a dip. Pikas describes the recipe to me, which begins with blanching cardoons, rugged and fibrous as they are, five to six times. Could they not have made a dip with...something else? “We get interested in vegetables that aren’t selling,” Pikas explains, not to mention that cardoons fit a very particular Cellar Door flavor profile, which leans bitter, strong, and very determined.Part 4: The CityIn September of 2018, a coffee shop called Four Letter Word opened across the street from Cellar Door Provisions. “Someone was like, ‘Hey, aren’t you upset that a coffee shop opened across the street?’ ”Bezsylko tells me. “‘Isn’t that going to take away from your coffee sales?’ ”He had to explain to them: “I asked for that to happen. I want them to sell coffee.”Bezsylko had seen that the space was available and reached out to Ria Neri, the roaster behind Four Letter Word, whose coffee Cellar Door had been brewing since 2016.“Chicago’s a place where you can do that,” says Bezsylko.Four Letter Word owner Ria Neri (left), whose coffee Cellar Door has been brewing since 2016.\nPhoto by Alex LauThat’s something I think about: how Chicago makes Cellar Door possible, and how Chicago makes Cellar Door sometimes nearly impossible. Around the time the restaurant opened, the food-media universe was hitting the era I remember fondly as Peak Sqirl, the nationwide infatuation with Jessica Koslow’s delightful L.A. café. Meanwhile, in our office in New York, it was as though there were only one restaurant in all of Manhattan: Gerardo Gonzalez’s El Rey, with its way-beyond-coffee-shop food. What might have happened had Cellar Door opened in, say, Silver Lake, or the Lower East Side? Would “The Quiche” have taken on the cult status of Koslow’s Technicolor toast or Gonzalez’s almond-milk Kale Caesar? In a city more hyped up on vegetables, would there have been lines out the door to see what new dishes would land on the Cellar Door menu each week, what today’s riff on turnips might be?Or could Cellar Door exist only in Chicago? Away from the excessive media hype of NYC and L.A.? Here—unlike Sqirl or El Rey (RIP)—a restaurant of this caliber has remained a true neighborhood spot, a place where a regular can come and sit for hours, even on weekends. A place that can try things out and evolve at its own pace, without the pressure of expectations. A place that hasn’t spawned another place. A place that is not pushing merch. A place that has never been nominated or short-listed or even really mentioned in the same breath as a James Beard Award. “Even now we’re not always busy,” Pikas says. “There’s a two-hour slot on our weekday mornings when there’s never anyone in here.”In a city more hyped up on vegetables, would there have been lines out the door to see what new dishes would land on the Cellar Door menu each week?Why is that? I called Jason Hammel, who pioneered the whole Logan Square farm-to-table all-day-café thing, like, 20 years ago at Lula Cafe. He called me back—after just having left Cellar Door, where he’d grabbed a scone. “There’s never a time I’m in there that I don’t see someone else who’s a chef or cook or front-of-house person,” he said of the small but devoted community that has sustained the restaurant over the past five years. Hammel mentioned multiple times how envious he was of Cellar Door: “They continue to do what they do without the notion of expanding, and I don’t just mean in space—I mean in offerings, in when they’re open. Their growth is deeper; they’re digging down.”While Cellar Door itself hasn’t expanded, Bezsylko has somehow managed to spread its vibes out onto this quiet residential stretch of Diversey Avenue, which feels farther away than it actually is from the new barcades and taprooms in the heart of Logan Square. When the space next door to Cellar Door opened up, Bezsylko connected the building’s owner with Bradford Taylor, the owner of the cult wine bar Ordinaire in Oakland, who’d recently moved to Chicago and become a regular at Cellar Door.Any bottle from Diversey Wine can be brought to Cellar Door for a $10 corkage fee.\nPhoto by Alex Lau“Cellar Door very much jibed with my ideals at Ordinaire,” Taylor says. Plus: “I just love when I walk into a business and I can see that they are making choices that are  financially ridiculous.” In May 2018, Taylor opened Diversey Wine shop next door.The previous year, Cellar Door had completed a major renovation, replacing its original chairs and tables with minimal blond wood ones, launching BYOB dinner, and building a neat little interior passageway between its dining room and the wine shop. Now Cellar Door has a liquor license, and Taylor puts together the café’s by-the-glass list of whatever-he’s-into-at-that-moment natural wines, while customers can still pick out any bottle of wine from Diversey and open it at Cellar Door for a $10 fee.The result is a trio of like-minded businesses whose boundaries blur. The morning I was in the kitchen at Cellar Door, Moya was running a tray of pastries—craggy scones, chubby hunks of apple coffee cake—across the street to Four Letter Word. In the afternoon I met Sher there for an interview; it’s basically her office. I asked Neri, the Four Letter Word owner, whether she ate often at Cellar Door, and she paused before offering a tepid “yes.”“How often?“Sometimes twice a day.” Her roaster, Ari Sofiakis, has set the record for most visits to Cellar Door in a single day: five.Part 5: The DreamI dug through the mud of the internet to find what I think is the earliest mention of Cellar Door, from a short post on Eater in December 2013. The second line is a quote from Bezsylko: “We hope to question some of the standard assumptions of the restaurant industry. Assumptions to do with capital, working conditions, waste, and perhaps even the very purpose of restaurants in our culture.”Line cook Hailee Catalano and lead line cook Chuck Cruz plating in the kitchen.\nPhoto by Alex LauWho says that to a reporter from Eater who’s just trying to find out what day your restaurant is opening?I call up Bezsylko. “I don’t remember that at all,” he says. “How do you challenge those assumptions?” I ask. “You know what you should read?” he asks in return. I’m thinking he might point me to an Audre Lorde text; Sher had sent me one she liked. Instead, he starts summarizing a review from Cellar Door’s Yelp page: “From what I understand, the owners started this place purely out of a passion for food and experimenting with it,” writes Avita T. “It was really not started to be a business, and so the restaurant does close relatively frequently, erratically.”Bezsylko objects to the reviewer’s claim of erratic closures, but otherwise he loves her description. “There’s something about the ethos of the place that challenges a lot of assumptions about the bottom line,” he says. To start: He, Pikas, and Sher have not taken a profit. (Related: Cellar Door has never turned a profit.) Second: “We invest in our labor as heavily as we can,” paying their employees more than they pay themselves, giving their staff two days off in a row, and closing for a week three times a year so no one has to worry about getting time off  with their families at Thanksgiving or Christmas. Third: They have practically no investors, so they can base their decisions on their principles—not on what will yield a return.I ask Bezsylko if running a restaurant for five years has tempered any of his idealism. “If anything,” he responds, “I’ve become more idealistic about what a restaurant can do.” The values at Cellar Door have “been aspirational— because the restaurant has been hanging on by a thread cash-wise,” he says. Bezsylko now sees being a little more of a business as a way to realize those values—of paying people more, of one day being able to provide health insurance for his staff. “I’ve become even less cynical,” he says, then quickly corrects himself. “I guess I’ve never been a cynic.”Sher, Pikas, and Bezsylko are constantly self-reflecting. How do we make more money without pricing people out? How do we find funds for staffers for professional development? How do we get more people to come in for dinner?That last question seemed to be top of mind on my trip to Chicago in November, soon after which Cellar Door decided to change its prix fixe dinner menu to an à la carte format.“We’re still figuring it out,” Sher said. “That’s what we always do.”Explore Bon AppétitHealthyishChicagoRestaurantsRead MoreLifestyleWhen Did Healthyish Pizza Become a Thing?By Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-20", "author": ["Condé Nast", "Julia Kramer"]}