{"id": "b241b71dcd8df134e357e16e74532bdb", "url": "https://www.bonappetit.com/story/halloumi-fries", "year": 2022.0, "month": 2.0, "day": 1.0, "content": "Halloumi Fries Are 1-Ingredient Cheese Sticks That Deliver the Satisfaction of Mozzarella Sticks Without the Dredging | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Easiest Fried Cheese SticksDeep-fry Halloumi. That’s it. That’s the recipe.By Sarah JampelFebruary 2, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kt Boytsova.  Prop Styling by Stephanie De LucaFacebookTwitterEmailWhat’s better than a good recipe? When something’s so easy you don’t need one. In It’s That Simple, we’ll talk you through the dishes and drinks we make with our eyes closed. Today, Halloumi fries.For some people, mozzarella sticks are “having a moment.” For others, it’s been mozz sticks all along. “I think mozzarella sticks are trending right now,” says Kat Turner, executive chef and co-owner of Highly Likely Café in L.A., “but for me, they were always number one.” And when Turner was thinking about menu additions to complement the café’s natural wine program, fried cheese sticks were the logical addition. Only, she wanted something gluten-free with no breading involved and with all the salty fattiness came from the ingredient itself.Her answer? Halloumi fries. A semi-firm Cypriot cheese traditionally made of goat’s and sheep’s milks, Halloumi has a high melting-point, meaning it’s perfectly suited for grilling, pan-frying, and deep-frying, which, thanks to the all-around heat and fat, results in the most dramatic contrast between soft interior and crusty outer edges. While you can dredge Halloumi, you don’t need to: “If you deep-fry Halloumi, you get a lot of those delicious qualities of mozzarella sticks without breading. It gets a craggy, crackly, golden brown crust on the outside with a soft, squeaky texture on the inside.”Because Halloumi is commonly brined in salt water, it’s also flavorful to the core, so there’s no need to season the cheese before or after cooking. Simply slice it into batons, pat dry, drown in hot oil, and serve warm while the interiors are creamy-melty and the exteriors crisp. (For all of its dairy-rich glory, mozzarella skews bland, leaning on heavily seasoned breading and/or tangy marinara sauce for assistance.)Here’s how to make Halloumi fries:At Highly Likely, Turner is “blessed with a deep-fryer,” but it’s easy enough to fry at home as long as you have a large heavy-bottomed pot, a bottle of oil, and the patience to let it get up to temperature. (I did it—multiple times—and lived to tell the tale!) To get frying, heat 1\" neutral oil (like canola or vegetable) to 350°F in a large heavy-bottomed pot with high sides (it’s even better if it’s nonstick, but a Dutch oven will also do). The high sides are important—the cheese is bound to sputter when it hits the hot fat—as is the oil’s temperature: Too cool and it might get greasy; too hot and it might brown before warming through.As your oil is heating, slice one 8-ounce package Halloumi in half, like a burger bun, so that you have two thinner slabs. Cut each half into four long batons (about 4x½\"). Pat dry with paper towels or a clean kitchen towel. Carefully add the cheese to the hot oil, standing back to avoid spatter. Fry, turning occasionally if necessary, until deeply golden brown on all sides, 2–3 minutes total. Transfer to a wire rack to cool slightly and voilà: Just like that, Halloumi fries have joined the ranks of great cooked cheeses, from oozy, pastry-ensconced baked Brie to Greek saganaki to paneer tikka to the regional specialty of Turner’s home state of Wisconsin: squeaky fried cheese curds.Once you get a taste for fried Halloumi, you’ll look for any opportunity to eat more of it. At Highly Likely, Turner adds fried slabs to a focaccia sandwich with Kewpie mayo, house-made harissa, and an herby arugula salad. She also serves it showered with roughly chopped tender herbs atop a pool of hot honey sauce—quite simply, equal parts honey (a natural companion to the salty cheese) and the café’s house-made fermented Fresno chile hot sauce. Feel free to use whatever hot sauce you please and to serve the mixture on the side, for dipping, or artfully zigzagged over top. At my house, I’ve found myself doing something decidedly less inspired. I drizzle the cheese with honey, grind over some black pepper, and hit it with a little Boonville Barn chile powder before it even makes it to the table.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-02", "author": ["Condé Nast", "Sarah Jampel"]}