{"id": "b25f311a95e2c4da96124f86982d4d6f", "url": "https://www.bonappetit.com/story/las-cuatro-milpas", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "If These Tortillas Were Any More Lard-y, They Would Oink and Run Away | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopWhere to eatIf This Restaurant’s Tortillas Were Any More Lard-y, They Would Oink and Run AwaySan Diego’s Las Cuatro Milpas puts flour tortillas in a whole new light.By Amiel StanekApril 5, 2019FacebookTwitterEmailPhoto by Amiel StanekFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.At a certain point in my adult life I came to the blessed understanding that some corn tortillas were better than others, sure—that those made by hand from freshly milled masa were infinitely superior to their wan shelf-stable counterparts. But flour? I assumed that a flour tortilla was a flour tortilla was a flour tortilla, the burrito’s unremarkable casing of convenience. I never gave it much thought. That is, until Las Cuatro Milpas changed everything for me.For three generations, the Estudillo family has been serving a distinctly So-Cal brand of Mexican food in San Diego’s Barrio Logan neighborhood. Their menu is short—nothing but the California border classics (rolled tacos served under a riot of shredded iceberg and cotija, crispy tacos stuffed with juicy shredded pork, steamy, custardy tamales)—and there’s almost always a line down the block to get in. Everything there is amazing, but the star of the show is the house-made flour tortilla, which serves as the wrapper for stripped-down pork-and-cheese burritos, or the vehicle of choice for a bowl of beans and rice or huevos con chorizo. Unlike the pallid, shock-white, “fat-free” flour tortillas I was familiar with, these were almost unfathomably rich, so full of lard that they looked almost damp when fully cooked, patches of near-translucence freckled with spots of char from the griddle. They had flavor for days—toasty, nutty, and almost overwhelmingly meaty and porcine, like pork rinds in flatbread form.I kept eating long after I was almost-sick full, nibbling last little shred after last little shred of lardy goodness as I marveled at the brigade of women rolling out fresh stacks in the back of the restaurant. In my dizzy, overstuffed state, I swore I could see halos around their heads, the air thick with flour and fluorescent light.Sitting at that table, hands so covered in pork fat that I felt like I had just moisturized, I had the sudden, unsettling realization that I’d been red pilled. I’d never look at a flour tortilla the same way again; how could I, knowing what I know now? And so yes, I wholeheartedly recommend these tortillas to anyone who is ready to have their life changed forever. But if you’d prefer to remain in a state of blissful ignorance, to go on enjoying fast-casual East Coast burritos and late-night quesadillas made on grocery store tortillas that are about as flavorful as the plastic bags they come in? Well, then I’d recommend you steer clear of Las Cuatro Milpas—don’t make that line any longer for the rest of us.Go there: Las Cuatro MilpasExplore Bon AppétitRestaurantsCaliforniaHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-05", "author": ["Condé Nast", "Amiel Stanek"]}