{"id": "b26493f9eedf9e12a57a2cc72aa0cae1", "url": "https://www.bonappetit.com/story/deadhead-apron", "year": 2022.0, "month": 1.0, "day": 2.0, "content": "This Hedley & Bennett Apron Makes Me Want to Become a Deadhead | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Apron Makes Me Want to Become a DeadheadWho’s the grooviest dad now?By Bettina MakalintalJanuary 8, 2022FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.You would have been hard-pressed to find Young Bettina in any color other than black, and maybe gray. But after the past two years of heaviness and staring at the sparse white walls of my apartment, Current Bettina is ready to go all in on kitschy fun. I want to fill my home with maximalist food-related ephemera and wear glittery platform Crocs and embrace tie-dye and big loud prints and as much color as possible. I’m not alone, at least on the tie-dye front—apparently, in times of turmoil, consumers look to nostalgic fashion as a kind of escapism. And boy, have we seen some turmoil!So when I saw Hedley & Bennett’s Grateful Dead apron collection in all its tie-dyed glory, dear reader, I was smitten. Mind you, I hadn’t consciously listened to a single Grateful Dead song until, um, late last year, but I maintain that you don’t have to be a Deadhead to appreciate the endearingly corny throwback print. It’s not just tie-dye(!) but tie-dye with dancing Grateful Dead bears(!) across it. Some of the bears are even wearing their own little Hedley & Bennett aprons (like the Droste effect) and holding knives, spoons, tongs, and pans. How could I not be obsessed?! (The other apron in the collab is denim with tie-dye pockets for the Deadhead who doesn’t want to scream it to the world.)As many of my shirts, Jackson Pollocked with red sauce and oil, will attest, I’ve never been much of an apron person at home. The ones I’ve tried in the past weren’t right. While cross-back aprons are beloved by many, I prefer the size flexibility of ones with waist ties. Even among those, the neck loops were too long, the waist ties were too short (I like when I can cross them behind my back and then tie them at my front), the bibs were too narrow at the top to provide adequate cover, or the material was simply unpleasant to wear. That rough canvas feeling? Not for me!But the cotton-poly blend fabric of this Hedley & Bennett apron feels heavyweight but soft with a touch of stretch. There are pockets for kitchen towels and Sharpies and meat thermometers and that one lip balm I don’t want to lose. The print obscures speckles of food. The ties are long and sturdy, and the neck loop is adjustable. The shape is wonderfully full in its coverage, though I usually fold it over itself at the waist since the apron goes past my knees (I’m 5'0\"). It just feels high quality, like a really nice piece of clothing.The elephant in the room is the price. The Grateful Dead apron will set you back $105, which is on the higher end of not just aprons but also of Hedley & Bennett’s entire line. (Their essential apron is generally around $85 in solid colors, though collaborations and limited-edition prints and fabrics run higher.) If you’re looking for functionality and cost-effectiveness, you can certainly find cheaper aprons that do the job. You don’t need this apron! But it is a pleasant treat for you or that one cook you know who already has everything.In a spiritual sense, I just want to be the grooviest dad at the cookout. I’m over being uptight and boring. With my Crocs and my silly little apron, I’m ready to keep on “Truckin’.” (That’s a Grateful Dead reference. I’m pretty sure.)Photograph by Emma FishmanGrateful Dead Tie Dye Bears Apron From Hedley & Bennett$105 at Hedley & BennettExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-08", "author": ["Condé Nast", "Bettina Makalintal"]}