{"id": "b27a257907bafcc53f44a75d69c2470f", "url": "https://www.bonappetit.com/story/tortilla-brands-to-shop", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "The Tortilla Brands to Shop for Making Tacos at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStockpile These Tortillas for a Lifetime of Great TacosRejoice! The tortilla boom is upon us. By Aliza AbarbanelFebruary 13, 2020FacebookTwitterEmailPhoto by Zach BaumanFacebookTwitterEmailA taco is only as good as the tortilla that holds everything together. Luckily for home cooks, new tortilla brands are making it so there’s never been a better time to buy The Good Stuff: tortillas made from heirloom wheat and corn (with kernels nixtamalized in-house for the freshest, most flavorful masa). From Kansas City to Los Angeles, San Antonio to Honolulu, these small-batch tortilla brands are making our duck carnitas, goat birria, and pork volcánes al pastor taste better than ever.Three Sisters NixtamalThis Portland, OR, tortilleria is keeping the Northwest stocked with corn tortillas made from fresh nixtamal. They're sold across Washington and Oregon in farmers' markets, independent grocery stores, and Whole Foods.MasiendaBeloved by chefs across the country for sourcing high-quality landrace corn, this L.A. based tortilla brand imports heirloom white and blue corn from a network of small traditional farmers in Mexico. Both kinds of corn tortillas are distributed in seven states (NY, DC, Kansas, Colorado, New Mexico, Utah, Arizona, CA) plus Washington D.C.Hawaii MASAThese Honolulu tortilla makers partner with Mexican farmers to produce five tortilla types, named for the stone-ground landrace corn from which they came. Pick up tortillas made from chalqueño cremoso, bolita belatove, cónico azul, and other varietals at the Kaka’ako farmers market.Kernel of Truth OrganicsThese simple yet transcendent organic corn tortillas, beloved by chefs and home cooks alike, are now dominating L.A.’s taco scene. Eat them at restaurants like Guerrilla Tacos and Guelaguetza or buy them at a handful of markets in L.A.La Paloma White WingsThese chubby Tex-Mex style tortillas made from ultra-soft, ultra-white flour in San Antonio, Texas. Buy them in grocery stores across the state.Yoli TortilleriaMidwestern non-GMO corn gets the traditional Aztec treatment in Kansas City, MO, from this local tortilla brand. The resulting white, yellow, red, and blue tortillas are served in local restaurants like Porta Fonda and sold both in local grocery stores and online.CarameloThese extremely porky Sonoran-style tortillas (also made with avocado or duck fat) are made in Lawrence, Kansas but ship nationwide. Try their tortillas in breakfast burrito format at Red Kitchen Tamales inside Lenexa Public Market, then bring home a pack of your own...then re-up online when you devour the whole batch in one go.Vista HermosaMini New York taco chain Tacombi sells the nutty corn and floppy, avocado oil-rich flour tortillas from their restaurants under the Vista Hermosa name at markets throughout the New York area.Manos de MaizThis D.C. shop transforms heritage maize from Mexico and the U.S. into fresh ground masa, then sells it, along with thick tortillas, at Eastern Market.Pinole BlueThese antioxidant-rich heirloom blue corn tortillas made in Wichita, Kansas from kernels grown in Chihuahua, Mexico, can be found and purchased online.SieteGrain-free taco lovers deserve good tortillas too. Austin-based brand Siete Foods offers a fleet of grain-free tortillas made from ingredients like almond flour, cassava, and chia, available in bulk online and in Whole Foods across the country.Explore Bon AppétitTortillasTacoproductShoppingMexicanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Aliza Abarbanel"]}