{"id": "b28824f72ee4422688bfc73d3a329eb8", "url": "https://www.bonappetit.com/recipe/sumac-roasted-carrot-dip", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Sumac-Roasted Carrot Dip Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishSumac-Roasted Carrot DipSponsored by VitamixFacebookPinterestTwitterEmailJerrelle Guy1–2 cupsThis twist on hummus combines roasted carrots with sumac, honey, garlic, and tahini with crave-worthy results.PrintIngredientsRoasted Carrots:6 medium carrotsOlive oil (for drizzling)1 Tbsp. honeySalt and pepper, to tasteDip:¼ cup olive oil2 Tbsp. balsamic vinegar2 Tbsp. tahini paste2 Tbsp. water, plus more as needed4 garlic cloves4 tsp. sumac, plus more for sprinkling1 tsp. saltOptional toppings:Crushed pistachios or almondsCrumbled fetaRecipe PreparationPreheat the oven to 425°.Cut ends off carrots and peel. Place on a sheet tray, and drizzle liberally with olive oil and tablespoon of honey. Season with salt and pepper to taste, tossing to coat completely. Roast in the oven for about 45 minutes or until fork-tender and caramelized. Check them halfway through.Remove carrots from oven and blend in a Vitamix E310 Blender for 4–5 minutes starting on level 1 and slowly progressing to level 6, adding in the rest of the ingredients until a smooth paste forms. Add more water if necessary. Transfer to a serving bowl and top with olive oil, sumac, nuts, and feta.Serve with pita chips or crudités.Sponsored by VitamixGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitVitamixSponsoredHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}