{"id": "b2a8870c72bbb5c94325ff64912d24c2", "url": "https://www.bonappetit.com/story/peter-steckler-restaurant-diary-3", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "A Lot of Things Are Changing Now That We’ve Got the Vaccine | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsA Lot of Things Are Changing Now That We’ve Got the VaccineIn his third Restaurant Diary entry, line cook Peter Steckler explains how the vaccine provided him relief and his restaurant a new influx of customers.By Peter Steckler, as told to Allyson ReedyApril 14, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four different people working in the industry. Each week you’ll hear from one of them: wine educator Kyla Peal, bartender turned brand ambassador Jenny Feldt, farmer Kristyn Leach, and line cook Peter Steckler. Here Steckler shares about how the vaccine is impacting his job; business at American Elm, the Denver restaurant where he works; and customer behavior and how trust is crucial to success and safety. Read his first and second diary entries here.I got vaccinated this morning and I already feel safer. I know that’s not exactly how the vaccine works, but I felt immediate relief. I was so excited to get the shot—the first of two Moderna doses—that I drove an hour up to Greeley to get it. Restaurant workers were eligible for it beginning mid-March here in Colorado, and I spent the past couple weeks looking for an appointment. It’s not as easy as it sounds. Appointments book up fast, especially with so many being eligible at the same time. Everyone at the restaurant, especially our general manager, was good about sharing resources and alerting us to special industry vaccination events, but the timing never worked out for me.As far as I know, everyone at the restaurant is planning on getting vaccinated. A lot of them already got the Johnson & Johnson one-doser, so there’s an increased feeling of safety associated with that. That said, I’m wary of talk about lifting the mask mandates (Editor’s note: The governor of Colorado recently extended the mask mandate for a majority of the state for another 30 days). It feels like we’re so close to getting through this, and I want everyone to be as safe as possible until it’s over. I see trust as being a core value in this industry and in this job. Our kitchen staff is showing up to work every day, and it’s based on trust—trust that we’re doing right by each other and trust that the patrons in the dining room are following the rules, being responsible, and keeping us safe at work. It’s mutual. I’m happy that at American Elm we’re not easing up on the rules. We’re still doing daily temperature checks and regular COVID testing for staff, and we’re keeping the mask mandate for staff and diners going until it’s absolutely clear that they’re not necessary anymore. I think that’s the most responsible thing to do, at least through spring and summer.This trust is important, especially now because I feel like there’s going to be a serious restaurant boom. Besides the nicer weather, I think we’re going to get a rush of people who may not have eaten out for the last year or who are just more comfortable coming out because they got vaccinated. We occasionally hear back in the kitchen about a table of guests who are out to dinner for the first time since this all happened. It’s pretty cool to be a part of that.Because we’re expecting this restaurant rush, we’re trying to beef up staffing. But for as long as I’ve been working in the industry, it’s been tough to hire enough workers to fully staff the restaurant. There’s a labor shortage in the hospitality space and I think it’s only intensified with COVID. We’re certainly feeling it. One of our newer line cooks left, so we’re trying to hire more, but it takes time to hire and train and get everyone in the flow. At this point we don’t have the bandwidth to continue cooking for guests at the restaurant on top of everything we’ve been doing over the past year to survive. Our restaurant has been really good at creating different ways to feed people: takeout, meal kits, the special events. Over the last year we’ve learned that there’s viability in to-go, and that’s awesome. But now that more and more people are dining in, we don’t have the bandwidth to do as much takeout as we were able to do before.Last year we did a massive Mother’s Day meal; it was the week after I started working here. This year we’re not doing something as big as that since we don’t have enough staff to make it work. Ideally. we’d be able to do it all: in-house, takeout, special events. Hopefully, we can hire some new workers and be ready for that restaurant resurgence going into spring and summer.Explore Bon AppétitRestaurantsRestaurant DiariesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-14", "author": ["Condé Nast", "Peter Steckler", "As Told To Allyson Reedy"]}