{"id": "b2b122ce97d557806dbc056ba0eb853b", "url": "https://www.bonappetit.com/story/i-use-a-wine-app-and-its-great", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "I Can't Believe I'm Saying This, But I Use a Wine App and It's Great | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Can't Believe I'm Saying This, But I Use a Wine App and It's GreatI thought that wine apps were just for nerds and dads—turns out, they're for me, too!By Alex BeggsMarch 15, 2019FacebookTwitterEmailFacebookTwitterEmailRaise your hand if you want to know more about wine but don’t have the energy to try that hard.  🙋That would be me. Reading about wine helps some, but it’s hard for me to retain any information if I’m not tasting the wine I’m reading about. (What? I’m an immersive learner!) So I downloaded Delectable, a wine app where you photograph and review every wine bottle you open, and tried to better myself.The process goes like this. Buy bottle of wine. Open bottle of wine. Photograph wine bottle label. Then the super smart app technology pulls up the wine it thinks you’re drinking, and most of the time it’s right! This is always miraculous to me; it's the little things. Once confirmed, you rate and can review the wine with a short caption, plus see dozens of other reviews. Those strangers' reviews helped me pinpoint tasting notes, widen my wine vocabulary, and invent one of my one. (You can also follow people on Delectable and treat it like a wino-Instagram. I like to follow BA’s wine editor Marissa Ross because she drinks cooler stuff than me and I find that aspirational.)The more you play around with Delectable, the more you start to notice patterns in what you’re into, what you hate, and the qualities you seem to like in wines. I’m not a fan of funky, tannic natural wines that suck my tastebuds off my tongue. I like FRUITY, OKAY? I drink too much Gruner. I seem to mention Parmesan cheese a lot for some reason.Then I started to use Delectable as a wine diary, leaving long, stupid, personal captions for myself about where I was when I was drinking it, what was going on that day, weird details from the night. Since I’m not using it as a social network and don’t care about followers, I like this self-indulgent use. In fact, I find the memory of the weekend/dinner party/ restaurant meal helps me place the wine in my memory too.Oh man, this Meinklang frizzante rosé was so good, I remember drinking it in our old apartment, where our grumpy landlord forbade our back deck grill and ruined our summer. But lack of a grill didn’t matter when we were drinking this juicy strawberry fizzwine; it was delicious.Because it’s an app, and apps are pretty much over at this point, sometimes I forget to use it. I haven’t posted in four weeks, but then again I’ve been drinking a lot of whiskey lately. I’ll get back to it. The journey of self discovery is never over.You know what also helps? This:This One Thing Makes Buying Wine WAY Less OverwhelmingI used to be an anxious, freaked-out wine shopper. And then everything changed.View StoryExplore Bon AppétitBasicallyWineTechnologyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-15", "author": ["Condé Nast", "Alex Beggs"]}