{"id": "b2b407dd7ce28c4583093a8707842010", "url": "https://www.bonappetit.com/story/pure-over-glass-coffee-maker", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "The Stunning 'Pure Over' Coffee Maker Lets You Ditch Paper Filters for Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDitch Paper Filters Forever With This Stunning Pour-Over Coffee MakerIt’s better for the planet and your morning brew.By Anna RahmananMay 11, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can’t live without. See our past recommendations here!What does it take to concoct the perfect cup of coffee at home? According to my husband, Perry, it’s a high-end espresso machine. According to me, a French press. After years of debating we seemed destined to remain at loggerheads—until we discovered the Pure Over.The Pure Over is a coffee maker that straddles the line between a pour-over in function and a French press in flavor. Made entirely of glass and as functional as it is beautiful, it requires no pods or filters and is composed of four pieces—a mug, a dripper, a diffuser lid, and a coaster. Place the dripper on top of the mug, fill it with medium-ground coffee beans, and then place the diffuser lid on top of the dripper. As you slowly pour boiling water into the lid, its holes regulate the speed at which the water rains into the dripper chamber below, evenly saturating the coffee. The grounds themselves act as a filter, no paper needed. The setup yields the sort of cup that tastes as high-end as my husband likes and as accessible as I have time to make while pregnant with a toddler at home.The Pure Over is the brainchild of 32-year-old glass artist and java expert Etai Rahmil. After running out of paper filters while in his glass blowing shop in Portland, Oregon, he decided to create a novel brewing method that would forever eliminate the need for traditional filters—which, he argues, also prevent natural oils from dripping into the cup. Rahmil works with borosilicate, a specific type of glass that is also used in the medical field and can withstand drastic temperature changes without breaking. “The glass is a natural heat insulator that will help keep the drink at optimal temperature for longer,” he explains. Bonus points: It’s easily cleanable and can even be thrown into the dishwasher.According to Rahmil, it takes 1.5 million trees to make the 275 billion coffee filters produced every year, and the average coffee drinker discards 25,000 filters at a cost of $6,500 in his or her lifetime. So not only does the Pure Over deliver a bold and convenient cup of coffee, it also makes me feel like I’m doing my part for the planet—and yes, my husband agrees.Pure Over Glass Coffee Kit$84 $75 at Pure OverExplore Bon AppétitHealthyishHealthyish Loves ItRead MoreshoppingThese Globally Inspired Snack Boxes Let Me Travel Without, Well, TravelingBy Hilary CadiganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-11", "author": ["Condé Nast", "Anna Rahmanan"]}