{"id": "b2b50bd440f25f72b2a0e28b22b46ccf", "url": "https://www.bonappetit.com/story/kosher-salt-vs-sea-salt", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "Kosher Salt vs. Sea Salt | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCan I Swap Sea Salt for Kosher Salt?Some salt is, in fact, “saltier.”By Sarah JampelSeptember 28, 2021FacebookTwitterEmailFacebookTwitterEmailWe’ve all been in the position of skimming a new recipe, seeing it call out a specific type of salt—whether kosher or sea salt—and defaulting to whichever we happen to have in our pantry at that time. In theory, all salt is salt, right? Well…sort of.Variation in size and shape changes how densely salt crystals pack into a teaspoon. The denser they pack, the more salt a given unit of volume will deliver. So pay attention to what the recipe calls for—1/4 teaspoon of fine sea salt will have a bigger impact on your dish than the same amount of a larger-grained salt like Diamond Crystal. Using both interchangeably may mean an over- or under-seasoned meal.When it comes to the question of kosher salt vs. sea salt, at BA, our cooking salt of choice is Diamond Crystal kosher salt: Its light and hollow flakes are easy to grip and crush, readily adhere to protein, and dissolve quickly. It’s also less salty by volume, meaning that it’s harder to oversalt. But there’s also a strong contingent of chefs and recipe developers who prefer fine sea salt. Ben Mims of the Los Angeles Times turns to fine sea salt to dissolve seamlessly into baked goods; cookbook author Dorie Greenspan prefers it to regular kosher salt for its cleaner taste; and Joe Yonan of The Washington Post likes its reliability: In general, brands don’t differ that drastically. So if you want fine sea salt to be your cooking salt of choice, go for it—but remember, when recipes call for Diamond Crystal kosher, you’ll have to adjust.A rough conversion: About 1¼ teaspoon of coarse kosher salt will be about 1 teaspoon of fine sea salt, but be very wary—coarseness varies by brand of salt, and the only way to be absolutely sure is to take out that kitchen scale and make sure the two are equal in weight, especially in more finicky baking projects that require precision. Our recommendation: Keep a few types of salt stocked in your pantry to avoid seasoning mishaps.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-28", "author": ["Condé Nast", "Sarah Jampel"]}