{"id": "b2c802d884cfd6d4839faafb6d0cdb65", "url": "https://www.bonappetit.com/story/homemade-pretzel-bites-recipe", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "These Homemade Pretzel Bites Are Better Than the Mall's | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Homemade Pretzel Bites Are Better Than the Mall'sAnd we've got a spicy cheese dip recipe to go with.By Alyse WhitneyJanuary 25, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailMy snack love language is pretzel bites. Usually the only times I get them are at the movie theater (slightly stale with molten cheese sauce in its own compartment) or at Auntie Anne's in my hometown mall (nuggets so buttery that don't need any dipping sauce). I once tried to make them myself when I was in 8th grade after watching too much Food Network. All I remember is giving up after one tray, because it was so much work to boil, then bake, then salt. Now I do all of those cooking tasks just for a weeknight dinner, so it's not as daunting to use a three-step process when the end result is SO. MANY. PRETZEL. BITES.Choose your own topping adventure—I'm partial to everything spice.\nPhoto by Chelsie CraigFor the Super Bowl this year, I'm ready to tackle our new pretzel bites recipe. It's definitely a project, but most of the work is done in the stand mixer (if you have one; if not, you can knead by hand) and the most time is spent waiting for the dough to rise so you can roll it like Play-Doh and cut into bite-sized nuggets. They're crunchy on the outside and soft and chewy on the inside—aka the ideal texture. Instead of using lye, which can be hard to find and work with, they turn a deep mahogany color after boiling in a baking soda bath for about 20 seconds before baking for 8 to 12 minutes at 500°. You can sprinkle on coarse salt, paprika, everything bagel spice, sesame seeds, poppyseeds, caraway seeds—whatever you're into right now. Food director Carla Lalli Music introduced the Bon Appétit staff to her favorite German mustard,\nDüsseldorfer Löwensenf mustard, which often comes in a tube. There's mild, medium, or extra hot, but all of them have a balanced spice and can be squeezed onto every pretzel to stop double-dipping. Brilliant.We love this German mustard in a tube for any and all pretzels.\nPhoto by Chelsie CraigBut really, what are pretzel bites without cheese? Luckily, we have a spicy cheese spread to go along with them. If you love pimiento cheese, you're really going to love this unfussy, opposite-of-nacho-cheese dip. It's made with a cream cheese, sour cream, mayonnaise, and two whole cups of cheddar, but hey, this is meant for sharing! Grated garlic and a pinch of cayenne pepper give it a zippy punch, and paprika makes it look pretty. You could double the recipe and have backup in the fridge for when it inevitably runs out at your football-viewing party, and like pimiento cheese, it tastes fine cold or room temperature. It doesn't need to be constantly reheated and doesn't congeal like queso. It's ready for all the pretzel dipping you need for hours. And, as they say, once you pop the fun don't stop.Get lost in swirls of spicy cheddar dip.\nPhoto by Chelsie CraigGet the recipes:Pretzel BitesSpicy Cheddar Cheese SpreadLook, another Super Bowl favorite:Explore Bon AppétitCheeseDipSnackSuper BowlappetizerRead Moreculture50 Super Bowl Favorites That You Need at Your PartyGallery50 SlidesBy The Bon Appétit Staffrecipes73 Super Bowl Appetizers to Tackle This YearGallery73 SlidesBy Alyse Whitneyrecipes42 Gooey, Cheesy Super Bowl Party RecipesGallery42 SlidesBy Bon Appétitrecipes63 Super Bowl Dip Recipes for Game-Day Winners and Half-Time ViewersGallery63 SlidesBy Joe SevierRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-25", "author": ["Condé Nast", "Alyse Whitney"]}