{"id": "b2d105414df6bfbe6a55ec0b8c7b4522", "url": "https://www.bonappetit.com/recipe/grilled-salt-and-pepper-black-bass-with-curry-verde", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Salt-and-Pepper Black Bass Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Salt-and-Pepper Black Bass with Curry VerdeBy Andy BaraghaniMay 21, 20195.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintLearn how to cook a whole fish and you'll have summer's most impressive dinner in your back pocket. Two tips for grilling whole fish like a pro: Use two large metal spatulas to make turning it a lot easier, and season the entire fish—we’re talking head to tail and inside and out.Ingredients4 servings1cup grapeseed or other neutral oil, divided, plus more for grill1Tbsp. vadouvan or other curry powder1green chile (such as serrano or jalapeño), finely chopped11\" piece ginger, peeled, finely grated1garlic clove, finely grated1½cups finely chopped cilantro, plus 1 cup leaves with tender stems3Tbsp. fresh lime juice, dividedKosher salt21½–2-lb. head-on black sea bass or other whole fish, cleaned8scallions, 4 whole, 4 very thinly sliced on a diagonalFreshly ground black pepperLemon wedges (for serving)Flaky sea saltPreparationStep 1Prepare a grill for medium heat. Heat ½ cup oil in a small skillet over medium. Once oil is shimmering, stir in vadouvan and remove skillet from heat (it should foam a little). Let cool in pan.Step 2Combine curry oil, chile, ginger, garlic, chopped cilantro, and 2 Tbsp. lime juice in a small bowl. Season curry verde with kosher salt and set aside.Step 3Place fish on a cutting board and pat dry thoroughly with paper towels (inside and out). Using a sharp knife, make slashes crosswise on a diagonal along the body every 2\" on both sides, cutting all the way down to the bones (this will help the fish cook evenly). Place fish and 4 whole scallions on a rimmed baking sheet; season fish generously inside and out with kosher salt and pepper. Drizzle fish and scallions with remaining ½ cup oil (this may seem like a lot, but it’s the best way to prevent the fish from sticking to the grate).Step 4Clean and oil grate, then immediately place fish and whole scallions on grill. Grill, turning scallions occasionally, until lightly charred all over, about 4 minutes. Transfer to a cutting board. Continue to grill fish, undisturbed, 8–10 minutes. Lift up slightly from one edge to see if skin is puffed and lightly charred and easily releases from grate. If fish is not ready, let it grill another minute or so, then try again. Once it releases easily, gently slide 2 large metal spatulas underneath and turn onto second side. Grill until the other side is lightly charred and skin is puffed, 8–10 minutes, depending on size of fish.Step 5Finely chop grilled scallions and add to reserved curry verde.Step 6Toss sliced scallions, cilantro leaves, and remaining 1 Tbsp. lime juice with a pinch of kosher salt in a medium bowl.Step 7Spoon curry verde on a platter and set fish on top. Scatter scallion mixture over and sprinkle with sea salt.How would you rate Grilled Salt-and-Pepper Black Bass with Curry Verde?Leave a ReviewTell us what you thinkExplore Bon AppétitScallionOnionVegetableCilantroHerbs & SpicesBassFishSeafoodBranzinoSummerQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeKetoHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Andy Baraghani"]}