{"id": "b2d5e55e0560df72a37affacc1998366", "url": "https://www.bonappetit.com/recipe/lemony-spring-vegetable-and-barley-bowl", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Lemony Spring Vegetable and Barley Bowl Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueLemony Spring Vegetable and Barley BowlBy Carla HallFebruary 8, 20224.5(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Micah Morton, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintThis one-pot dish from chef Carla Hall is basically spring in a bowl, bursting with fresh asparagus, tender green peas, lemon, and mint. It’s important to buy pearl barley for this recipe: Compared to whole grain hulled barley, which is chewy and requires lots of cooking liquid, the pearl barley used here cooks in less time and results in a creamier texture (think arborio rice). Another quick-cooking grain like pearled farro would also work well here. Making Hall’s Fennel Potlikker is a crucial first step here, so be sure to read through that recipe first.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Pot with Lid$155 At AmazonCitrus Juicer$7 At AmazonWooden Spoon$6 At AmazonMicroplane Grater$16 At AmazonIngredients4 servings2Tbsp. extra-virgin olive oil1lb. asparagus, trimmed, cut into 1\" pieces1cup pearl barley3cups Fennel Potlikker (add water if short)1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus more1cup fresh or frozen green peas2tsp. fresh lemon juiceFreshly ground black pepper1Tbsp. finely grated lemon zest½cup mint leavesPreparationStep 1Heat oil in a medium pot over medium. Cook asparagus, stirring often, until softened and bright green, about 5 minutes. Transfer to a plate; set aside.Step 2Increase heat to medium-high and add barley to pot. Cook, stirring often, until lightly browned, about 4 minutes. Add potlikker and 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt; bring to a boil. Reduce heat, cover pot, and simmer until barley is tender and doubled in size and liquid is absorbed, 25–30 minutes.Step 3Uncover pot and stir in peas. Cook until peas are tender and bright green, about 4 minutes. Stir in lemon juice and reserved asparagus; season with salt and pepper.Step 4Divide barley among bowls. Top with lemon zest and mint.How would you rate Lemony Spring Vegetable and Barley Bowl?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleVery delicious but waaaaay too much salt. Taste your broth before adding any more in the barley simmering portion of the recipe.  1 tablespoon seems like a typo, a teaspoon, tops. I had to scoop out the salty broth, water it down, and re-add it.  Amy EEncinitas CA3/22/2022This is a spectacular dish. Cooking the barley in the potlikker is an enormous burst of flavor. Next time I make it I'll try cutting the amount of potlikker in half (if only to save more of it for other dishes). I have enough left in the freezer for the companion shrimp recipe. Look forward to making that. I learned a great deal from making this. Highly recommendRod ParkerBaton Rouge, LA3/16/2022I loved this recipe!  Very fresh and flavorful and healthful, and VEGAN even though not specified as such.  I made it exactly as written except that I added some fresh dill since it needed to be used up.  I think it would also be very adaptable.  I will try using farro next time for some extra fiber.  I think zucchini might fit in here when my garden is overflowing with it in the summer, and I bet it would be great as a cold salad with some cucumber and feta added.  I will be making this often!ShannonMadison, VA3/1/2022Explore Bon AppétitDinnerVegetarianVeganNut-FreeDairy-FreeRice and Grain BowlBarleyRice & GrainsMintHerbs & SpicesPeaVegetableAsparagusSideMainSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Carla Hall"]}