{"id": "b2e1d125b890614b94c5d26e5676c716", "url": "https://www.bonappetit.com/story/anthony-falco-robertas-pizza-consultant", "year": 2018.0, "month": 5.0, "day": 5.0, "content": "Anthony Falco Left Roberta’s. Now He’s an “International Pizza Consultant” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAnthony Falco Left Roberta’s. Now He’s an “International Pizza Consultant”“I’ve order all the wrong equipment. I’ve hired all the wrong people. I’ve done everything wrong in the last 10 years. You hire me to eliminate that stuff.”By Elyse InamineMay 31, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmail“Welcome to the pizza dungeon,” Anthony Falco says, as he leads me down concrete stairs to the kitchen of Bocce, a new thin-crust pizza-slinging restaurant smack in the middle of the Union Square Greenmarket in New York City.Falco, who you might know as the guy who put Roberta’s on the map, left the legendary Brooklyn institution a few years ago and now he’s doing what he does best: helping restaurateurs develop the ideal pizza for their concept and then moving on once his job is complete. A self-dubbed “international pizza consultant,” he’s taking the skill, knowledge, and connections he’s accrued in a decade of pizza-making and sharing it with anyone who wants to get into the pizza business. Since Falco started consulting at the end of 2015, he’s been hired dozens of clients for six concepts all over the world, from Braz Elettrica in Sao Pãolo to General Assembly in Toronto, and he’s got at least six more in the works. But the dream isn’t owning a restaurant that bears his name. “That’s a nightmare for me. I never want to be a 100 percent sole chef and owner of anything again,” Falco says. “I’m all about giving away pieces to people I like.”Stretching out the dough before it goes into the oven\nAlex LauAnd for Bocce, that means doing the research with partner Jason Leeds (research = eating at Pizzeria Beddia in Philadelphia), creating a pizza style (“American,” straddling the line between extra-crisp bar pizza and foldable New York style), developing recipes, training staff, and fine-tuning everything during small friends-and-family events like today. Upstairs, Bocce has a breezy, courtyard-like feel, more windows than walls (and Greek columns—it’s inside a huge stone monument on the north end of the park); downstairs in the kitchen, it feels more and more like a humid public swimming pool. The unrelenting blast of the ovens beat down like the August sun and three food runners stand by the entrance, hands behind their back like lifeguards. Pizza lifeguards.Falco in front of the ovens\nAlex LauToday, Falco’s wearing a white baseball cap with hot pink flecks he spray-painted himself that reads “Rad Times Pizza,” his pizza lifestyle brand (more on that later). He glides over to the two squat Izzo ovens and swiftly moves a green pie, covered in curly pea tendrils and bitter spigarello thanks to the vendors above ground, from prep table into the oven. A few steps away, four cooks assemble pies as they come in at the pizza station. They joke with him, occasionally, though they seem a little on edge during their second night of preview dinners. Falco doesn’t seem worried one bit.“I’ve ordered all the wrong equipment. I’ve hired all the wrong people. I’ve done everything wrong in the last 10 years,” he says. “You hire me to eliminate that stuff.”60 seconds pass, and Falco pulls out the pizza. It goes upstairs to Bocce’s first few customers in for a sneak peek at the restaurant opening next week.Slicing the pizzas\nAlex LauFalco’s first mistake came immediately after high school. Instead of enrolling in film school, Falco moved to Seattle in 1998 to start a web design company. (The same year as Google, he notes.) And he hated it. After four years he took off, traveling the world, where he realized his passion was food, not web design. He reminisced over the thick Sicilian pizzas he learned how to make from his Sicilian great-grandmother in Marlin, Texas. (Fun fact: Marlin is home to lots of Sicilian farmers due to the similar climate.)Falco with his starter\nAlex LauThis awakening led to Falco’s next move, getting deep into frites in Seattle, where he opened a shop in 2003. He made 20-30 dipping sauces from scratch and learned that potatoes are best in summer, slightly crispy on the skin and creamy inside. “It let me get in this mindset of focusing on one thing, obsessing over it, and perfecting it,” Falco says.Just around the corner from the frites shop was a legit Neapolitan joint from pizzaiolo Dino Santonicola, now at Cane Rosso in Texas. The nostalgic pies sent Falco into a mid-life-like crisis, though he was 25 years old, that went like this: “‘Wait, what am I doing? I’m not Belgian! Pizza—it just clicked.”Falco’s first pizza tattoo\nAlex LauHe moved to New York City in 2007 and landed jobs at Pulino’s and Vinegar Hill House—and eventually a little pizza joint far off in Brooklyn called Roberta’s. After developing frozen pizzas destined for Whole Foods, building the website, and designing T-shirts, all for Roberta’s, he left in 2016. He wanted to meet new people, experiment with new projects, and wade into unknown territory again. Almost immediately, calls started coming, and life as an international pizza consultant began.“Pizza is such a dynamic food—it’s a hybrid between baking and cooking so you have to have this crazy person mentality,” Falco says. “But then opening a restaurant adds exponential chaos, with developing the menu, working with the architects on the floor plan, buying equipment, and sometimes helping find a chef. I provide stability.”Tossing the dough\nAlex LauAfter he bounces out of Bocce, he’s going to Brazil, Toronto, and eventually to Kuwait to help a restaurateur bring back Japanese-style pizza (Neapolitan pies with Japanese ingredients à la Savoy in Tokyo). He’s also working on a pizza-centric horror film for Rad Times Pizza. (To best explain the movement, Falco tells people to imagine you’re back in the golden era of 1984 to 1992, where T&C stands for “thin & crispy” pizza and arcade games and acid wash rule again. That’s Rad Times Pizza.)The finished pie\nAlex Lau“People say I have a dream job because they think I travel the world, eating pizza all the time, but that’s the worst part,” Falco says. “What makes it a dream job is the people I work with, young people starting in the industry, entrepreneurs who are pursuing their dreams, and chefs who are more talented than me.”A freshly topped mushroom pizza jolts Falco back to the work ahead of him. Things are still quiet in the dank underground kitchen, but service jitters are creeping in as orders pick up. “It’s for you,” says a cook to Falco. “Take her away.”Become a domestic pizza consultant with this cast-iron pizza recipe:Explore Bon AppétitPizzaChefsRestaurants + TravelRead MorerestaurantsAfter Three Moves, A Cult Neapolitan Pizzeria Calls NYC HomeBy Anthony MangierirestaurantsThis Slice Shop Is Low-Key Milling Its Own GrainsBy Priya Krishnaculture8 Styles of Regional Pizza to Know, Love, and CherishBy Arthur BovinoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-31", "author": ["Condé Nast", "Elyse Inamine"]}