{"id": "b2e515ac340810603652d5dfbdc932c9", "url": "https://www.bonappetit.com/recipe/weeknight-meatballs", "year": 2020.0, "month": 8.0, "day": 3.0, "content": "Weeknight Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2020 IssueWeeknight MeatballsBy Chris MoroccoAugust 18, 20204.4(109)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintWe stripped meatballs down to the most essential elements, creating a recipe that is easy enough for a postwork dinner. Making larger meatballs means they actually have time to properly brown in the oven without overcooking.Ingredients4 Servings2Tbsp. extra-virgin olive oil, plus more for baking sheet2large eggs1½cups panko (Japanese breadcrumbs)½cup milk or water1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt1tsp. garlic powderFreshly ground black pepper1oz. Parmesan, finely grated (about ½ cup), plus more for serving1lb. ground beef (20% fat) or other ground meatWarm homemade or store-bought tomato sauce and torn basil leaves (for serving)PreparationStep 1Place rack in top third of oven; preheat to 425°. Lightly brush a large rimmed baking sheet with oil. Using a sturdy wooden spoon, vigorously stir eggs, panko, milk, salt, garlic powder, several cranks of pepper, 1 oz. Parmesan, and remaining 2 Tbsp. oil in a medium bowl until nearly a smooth paste. Mix in one quarter of meat (combining just a small amount of meat in the beginning makes it easier to incorporate the rest without overmixing). Add remaining meat and mix well to thoroughly combine, but don’t overwork it. Using oiled hands, form into 8 large meatballs and place on prepared baking sheet.Step 2Bake meatballs until well browned underneath, about 15 minutes. Using a stiff metal spatula, pry up and turn over meatballs (they may want to stick a bit). Bake until browned on second side and an instant-read thermometer inserted into the center of each one registers 160°, 5–7 minutes.Step 3Divide meatballs among plates and spoon some sauce over. Top with basil and more Parmesan.How would you rate Weeknight Meatballs?Leave a ReviewTell us what you thinkReviews (45)Back to TopTriangleI haven't even made this recipe and I can tell it's off just because of the Panade.  Really, Chris?  \nBasic formula for a Panade is 1 cup starch (Panko in this recipe) and 1 cup liquid (Milk in this recipe).  Combine those and let sit about 10 minutes for liquid to really be absorbed.  Discard excess liquid, then use only 1/2 cup of Panade per 1 lb. of meat, along with eggs (for binding-not liquid), spices, oil, etc.\nDo that, then add to recipe with other ingredients and you should have super-moist meatballs.  Also, if you don't want the extra dairy you can use milk-substitutes, or stock, or even water.\nDo this and you won't have to guess at how much to decrease breadcrumbs, or adding more expensive parmesan to get the moistness, especially on what is supposed to be a quick, inexpensive weekday meal.\nA+ for the baking idea.  Browning meatballs on stovetop is a pain.EricJMAstoria, NY2/4/2022The Good, the Bad and the Ugly - Great tip to initially mix only a small part of meat with the other ingredients. And yes, great suggestion to bake them in the oven. So much easier and healthier than frying. My one addition is a tsp of Dijon. Now the bad and ugly: Way too much panko. I want meatballs not breadballs. Cut crumbs to 1/2 cup but double the parm. I made 12 balls, and baked in a casserole dish, snuggled close together, instead of a baking sheet. They stay more moist that way. I used half beef and half pork for better flavour and texture.TuvaVancouver1/28/2022Actually quite a delicious recipe, but I recommend using less panko and slightly  more parmesan, and I rolled them smaller into polpettini, as we didn't want the giant size 1/8 lb meatballs in the recipe. We found that large size unappealing,  I decided to rolled them at about 1\" diam..I also added a little more parmesan -used1-1/2 oz in total , and about 1 c panko which is 1/2c less than the recipe . I knew instinctively that 1-1/2c  cups of panko was too much!  The ratio should be at  most 1 cup panko or even 3/4c  to 1 lb of meat. . When smaller, theese  brown quite fast, and are light and delicious. Not bready or like matzah balls at all. I served them with  penne in a creamy ricotta tomato-red pepper sauce  - - outrageously delicious - - and then we had the leftovers  as scrumptious meatball heroes in pannini rolls. A big hit with my husband, I've made them several times over the last few months. I get about 18 small meatballs out of this recipe the way I do it-and one plate might have 3 or 4 small ones - they are  light and fresh tasting.  I do recommend trying them as  smaller meatballs--easier to eat, nice proportion of cheese to meat flavor and more appetizing than a gigantic meatball you have to break up with your fork .  Jane HNew York12/28/2021Use more meat or cut back on the breadcrumbs! I use a whole pack of the organic ground beef from Costco (about 1.3 lb) with the rest of the ingredients staying the same. I think you could even go for 1.5 lb and still get moist meatballs! To make the meal even easier, I use my 1/3c cookie scoop (which is smaller than is recommended here) and get about 12 meatballs from 1.3 lb of meat. I cook for 10 mins on one side and 5 on the other. AnonymousArcata, CA12/14/2021I typically love making recipes from BA for my wife. I made this for her birthday dinner, big mistake. Chris Morocco you never let me down before, we love your recipes. Whoever said matzahball in another review could not be more right. Please revise this recipe so others don’t make this same mistake. They tasted like glue covered meat. \n\nThe best part of this recipe is where it said to not mix completely as there were small pockets not infiltrated by bread to ruin the meat. \n\nP.s. I only used 2/3 of the recommended panko and it still turned out like this. \n\nPlease fix this recipe! \n\nAnonymous11/3/2021Amazing recipe! Very cheerful, super yummy! Christiano Paiva Berlin, Germany10/12/2021Everyone loved them. I made slight adjustments following other reviews (less panko). Added parsley, fresh garlic, onion and fennel seeds. Was soooo good. Will make again. Jennifer L. Los Angeles, CA8/20/2021So so good! I’ve made a million meatball recipes and this will be my new go-to. I used ground turkey and made more than the recipe said (ie made smaller ones vs bigger) and also used half the bread crumbs based on the other reviews.Quick, easy and delicious!Milwaukee7/22/2021AMAZING!!!! This recipe seemed so simple but after ready the reviews, I was curious. They weren’t lying! These meatballs were so moist inside with a crispy exterior. They are delicious on their own with marinara sauce or served in a hoagie topped with cheese. I’ll be making these often!! Thank you for this amazing recipe! Paula Dallas, TX 7/7/2021Freaking delicious. Easy to make & so flavorful. Well done, BA.AnonymousSeattle, WA4/19/2021Amazing! My new go-to for a meatball recipe. So tender and tasty.SarahIN3/15/2021This is not JohnC this is his wife TinaC. My husband has made the best meatballs for the past 25-years, we have them every Christmas (it takes forever to make, I know I'm his su chef).\nWhen he found Chris' Weeknight Meatball Recipe and wanted to try it, I was skeptical.\nI am not skeptical now, they were easy to make and tastes GREAT!\nThank you Chris!JohnC and TinaCBainbridge Island, WA3/13/2021Way too many breadcrumbs. Otherwise mostly tasty. I'll do 3/4 cup panko next time and see how that worksAnonymousNYC2/25/2021Made these for dinner and they were so easy and very delicious. Loved how straightforward the process was and the ingredients were minimalist. I made with all ground pork (that's what I had on hand) and they were so good- looking forward to trying with beef next time. Brooke EliasonSalt Lake City, UT2/9/2021We love these meatballs- they are tender and tasty and are done so fast. I often use Impossible Burger and almond milk and they come out great too. The texture is best when the panko and milk really come together to form a panade, then it will combine with the meat and keep them tender and juicy. AnonymousIrvine, CA1/20/2021Explore Bon AppétitMeatballItalianEuropeanItalian AmericanAmericanGround BeefBeefMeatParmesanCheeseGround TurkeyTurkeyPoultryGround ChickenChickenGround PorkPorkQuickEasyWeeknight MealsMainNut-FreeDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-18", "author": ["Condé Nast", "Chris Morocco"]}