{"id": "b2f82e9184ec3d076a7d141170a5647b", "url": "https://www.bonappetit.com/story/home-queer-cooking-series", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "‘Home, A Queer Cooking Series’ Reinvigorated My Pride in Home Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Queer Cooking Show Reinvigorated My Pride in Home CookingSome people have Pinterest, I have this indie show about LGBTQ+ home cooks and the dishes they cherish most.By Jesse SparksJune 22, 2018FacebookTwitterEmailCourtesy of Michael ChernakFacebookTwitterEmailIt’s taken me a while to get back into the cooking groove after a solid few months of eating out—and falling into a funk of existential dread at the hellscape the world is becoming. Watching all of the primed and perfect foods on The Great British Baking Show didn’t helped my waning motivation (as much as I’d love to, I’m not going to attempt Nadiya’s levitating soda pop cheesecakes). But the ongoing indie documentary web series Home, A Queer Cooking Series has rekindled my love for the reality of simple home cooking.Each mini-doc focuses on one person or couple: queer artists, activists, and performers make dishes that either comfort them or mark a significant moment in their lives. In 8 minute segments, we cook vegetarian loaded sweet potatoes with an activist in Binghamton, NY, jammy soft-boiled eggs and thin strips of toast with a drag king in London, and watch cookbook authors and illustrators in Brooklyn flip raspberry pancakes and fluffy scrambled eggs. As they cook, they talk about their relationship to queerness. Open and honest conversations that feel even more intimate in the setting of their own kitchens.Creator Michael Chernak assembles characters you want to root for, encourage, and joke with over a glass of wine. “There was some sort of telling way about who they were through food, whether it was intentional or not,” he says in a phone interview. “I was having the most productive conversations with my friends and people I didn’t know around politics, relationships, and love. Using food as a middle ground for the series helped bring all types of people together to listen to queer experiences.”Courtesy of Michael Chernak\nDiving into this show feels fitting now, as LGBTQ+ people across the country celebrate Pride month, honoring the 1969 Stonewall Riots that sparked the gay liberation movement in America. But the show is different than a lot of popular queer media’s usual suspects, like Queer Eye, a sharply produced show with Netflix’s budget and marketing behind it. Home is filmed in humble kitchens with two-person maximum occupancies on a plain DSLR camera and mic. The dishes don’t always come out looking like Instagram food porn, but they’re made with the tenderness and attention that you give to meals you’re making for those you love.This care shines in Jess, a bisexual activist, nurse, and single mother navigating life while trying to organize Ladyfest Binghamton, a festival in upstate New York that celebrates women, trans women, and nonbinary people, while trying to teach her young daughter how to challenge homophobia. “What’s difficult for me is everyday I see it in my daughter, these things that I’ve never implemented in her,” she says while broccoli, red pepper, corn, and peas simmer into a stuffing for sweet potatoes. “I’m trying to reverse that so she’s more accepting and understanding of me. It’s kind of a struggle, but it’s also wonderful to do it by myself so we can pave our own way.”Courtesy of Michael Chernak\nMoments like Jess’s capture what works about the series. For all of its low-budget quirks (sometimes the coloring is off, some shots last longer than any moment of intense eye contact should), the series has an endearing warmth. It’s soothing and meditative. There’s no heartbreaking elimination, no underlying anxiety or dramatic turn. There’s just the comfort of catching up with the friend you haven’t seen in months. As you listen to Peter and Manny chat about the turkey chili recipe passed down from Peter’s mother, the rough edges feel a little less brazen. For me, that’s what Pride is about: honoring the recipes, people, and experiences that made us who we are, rough edges and all. This Pride Month—and beyond—my home cooking is another expression of that.Watch Jess’s episode here:ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitPop CultureRead MoreInstant Pot Glazed and Grilled RibsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-22", "author": ["Condé Nast", "Jesse Sparks"]}