{"id": "b2fd5b3875acba2e4cc6f8fd1e2af766", "url": "https://www.bonappetit.com/recipe/shingled-sweet-potatoes-with-harissa", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Sweet Potatoes with Harissa Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueShingled Sweet Potatoes with HarissaBy Molly BazOctober 16, 20183.9(28)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe classic savory-sweet side gets a makeover with the addition of harissa for an extra hint of spicy-earthiness. We promise you won’t miss the marshmallows.Ingredients8 servings⅔cup plus 2 Tbsp. extra-virgin olive oil⅔cup plus 2 Tbsp. harissa paste2Tbsp. white wine vinegar, divided3¼lb. medium sweet potatoes, peeledKosher salt3Tbsp. raw pistachios2tsp. sesame seeds1tsp. fennel seedsSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Preheat oven to 400°. Whisk ⅔ cup oil, ⅔ cup harissa, and 1 Tbsp. vinegar in a large bowl to combine. Slice sweet potatoes crosswise on a mandoline ⅛\" thick.Photo by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiStep 2Add to bowl with harissa mixture and toss to coat; season with salt.Step 3Arrange sweet potatoes so they are standing upright in concentric circles in a 2-qt. baking dish, packing tightly.ChevronChevronStep 4Roast, brushing any accumulated harissa oil in dish onto sweet potatoes every 10–15 minutes, until soft and starting to brown on top, about 1 hour.Step 5Meanwhile, toss pistachios, sesame seeds, and fennel seeds on a small rimmed baking sheet. Toast alongside sweet potatoes until golden brown, about 4 minutes. Let cool, then transfer to spice mill or mortar and pestle and coarsely grind. Set dukkah aside.Step 6Whisk remaining 2 Tbsp. oil, 2 Tbsp. harissa, and 1 Tbsp. vinegar in a small bowl. Remove sweet potatoes from oven and brush with oil mixture. Sprinkle with reserved dukkah.Step 7Do Ahead: Dukkah can be made 3 days ahead. Store airtight at room temperature.How would you rate Shingled Sweet Potatoes with Harissa?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleI made this a few years ago for Thanksgiving and it was excellent but I think the key to my success was using my homemade harissa. 2oz dried red chilies soaked in hot water for an hour; 2 or more garlic cloves, 2 tsp coriander seeds, 2 tsp cumin seeds, 2 tsp caraway seeds, pinch of salt, 6 tbsp olive oil all in a blender.  Freezes well and far tastier than any store bought harissa I have had.  I'm planning on making this sweet potato dish again next week now that we can celebrate Thanksgiving together again.AnonymousSeattle/WA11/20/2021I wish there was a way for the sauce to stick to the potatoes better.  They kind of dried out in the oven and I baked them for an hour and they potatoes still weren't done so I'd increase the baking time a bit (maybe an extra 15-20 minutes?) to ensure they're done.  I really like the dukah on top though, very unique flavors.AlyssaAustin, Texas1/23/2021Not sure if the last reviewer neglected to notice the part of the directions that says \"season with salt\". If you remember to salt, the rest of the flavors really shine through!AnonymousNYC1/5/2021This recipe was really forgettable. I'm not sure if my harissa was lackluster or if there may have been another problem. The dish looked professional and beautiful with those shingles, but tasted like mildly spicy sweet potatoes. Anonymouscanada10/13/2020This recipe has a great flavor, although I found that cooking at 400 degrees for an hour was nowhere near long enough. Next time, I would cover the dish with foil for the entire time (or at least 40-50 minutes or so). I continued cooking beyond 1hr and it seemed like the insides would just never cook fully uncovered. The presentation is beautiful though, and the combination of the harissa, sweet potatoes, and dukkah was really well-balanced. AnonymousNew York, NY 12/30/2019I've made this several times on special occasions and again last night for Thanksgiving. It's a unique dish that has guests asking about the spices. It's a ideal balance to the traditional sweet potatoes served during the holidays. I'm dedicated to baste the harissa/oil sauce every 15 minutes in the oven. It's a work, but well worth it. When done, I siphon off all run off (with the baster) at the bottom of the dish so it's not sitting in oil when served. Also I use a powdered Harissa to mix with the oil; I think it gives me more proportion control and it less expensive. Comparatively easy to execute and I bought a nice casserole dish to bake and present in. Thank you Bon Appetit!Yerno PreferidoRoseville, CA11/29/2019made this for friendsgiving and i think i used too much harissa because it was super spicy (i ended up using maybe 3/4 of the jar of trader joe's harissa on four sweet potatoes). i also used acv instead of white wine vinegar just because that's what i had at home. it still worked and tasted great!Anonymoussan diego, ca11/27/2019I really loved this recipe! I did take some cues from previous reviews but otherwise stuck to the directions. I used Mina Harissa and it has a good kick. I also used about 1.5 teaspoons of salt and tossed the potatoes before tossing in the harissa blend. I cooked these covered for the first 40 minutes and then uncovered and cranked up the heat to broil for about 5 minutes to get some toasted tops. I did not find the need to baste the potatoes and didn’t need to top them with more of the oil, vinegar harissa blend. It’s not necessary but I also had some full fat Greek yogurt to top it off with which was a nice balance to the sweet and spicy. juliaandchildChicago 11/26/2019Just made this for Friendsgiving! It was a total hit. I was honestly bummed that I didn’t have any leftovers to take home, so I’ll have to make it again very soon. This recipe is awesome with a few minor tweaks.\n\nAs recommended by other commenters - 1/3 cup of Trader Joe’s Harissa paste, 1/3 cup of oil, kept the vinegar the same, plus a generous amount of salt when tossing the potatoes, which were sliced at 1/8in. I’d say the spice level here is a 3.5/10. Not overwhelming and super complimentary, but could be a bit much for more sensitive folks. Adjust accordingly!\n\nMy potatoes weren’t packed super crazy tightly, but close enough that they all were standing upright when placed in a small cake pan. I covered with foil and roasted for 40 mins at 400, brushing the tops every 10 mins with what was already remaining in the bottom of my initial mixing bowl. No additional oil. Just enough of the mixture to wet a brush and keep the potato tops slightly oiled. \n\nFor the last 20 mins, I stopped basting and turned up the oven up to 450. I took the foil off for the final 10 minutes. \n\nI decided to add a couple more pinches of salt to the final oil/vinegar mix, and omitted adding the extra harissa. I reused my original mixing bowl to make use of the tiny bit of harissa reserves there instead.\n\nThe tips were deliciously crispy and caramelized. The rest of the shingles were soft, sweet, salted, lightly acidic, and perfectly spicy. The dukkah is beautifully aromatic and gives a lovely crunch. I can’t wait to make this again. sweavesSt. Petersburg, FL11/21/2019I have made this recipe at least 6 times - it is that tasty!   I follow the recipe exactly and it comes out perfect every time.  The tops of the potatoes become crispy and caramelized.  The crunchy  dukkah topping adds a great flavor.  If you do not enjoy spicy food, then I recommend that you do not make this recipe.  Although my family finds these potatoes pleasantly spicy - not extremely spicy.  I will definitely keep making this recipe!AnonymousCleveland, OH1/21/2019This recipe was a hit, but may need a few tweaks. For starters, my mandoline-sliced sweet potatoes were the perfect width, but I am unsure if they were 1/8\" or thinner. I think this makes a big difference in avoiding what some reviewers considered an undercooked dish per the recipe. Second, to avoid undercooking, I used a covered dutch oven for about 40 minutes of the cook time, then uncovered for the remaining 20 minutes to brown the tops. I then added another 10 minutes under the broiler, watching carefully to avoid burning the sugars. Third, I suspect the type of harissa used makes a big difference. I used a mild and potent harissa that had a great taste straight from the jar. The end result were perfectly cooked, fork-tender, sweet potatoes with a slight-spicy, sweet, and earthy flavor. The tops were not crisp, but browned, and had a nice presentation. I served this dish at a holiday party and had a ton of complements and requests for the recipe, so thumbs up from me.AnonymousSan Antonio12/26/2018This recipe is a total fail! I used a mandoline for even slicing and dutifully basted the potatoes with the leftover harissa and olive oil mix. After 1 hour, the exposed edges of the potatoes were somehow soggy AND burnt, yet the center of the slices were totally raw. Even after an extra 30 min, the centers were still crunchy and the edges now wilted. I love harissa and cook with it weekly, but the flavor combo of the sauce was acidic in a way that reminded me of vomit (gross but weirdly true). I agree with another commenter - this recipe is seriously flawed and just does not work as written. Very disappointed, since BA is my go-to!AnonymousNew York11/26/2018LOVED this dish, it was yummy, it looked beautiful, and it wasn't too difficult to make.  The only comment I want to make is about the harissa - you need to know your harissa! I went with 1/4 of a cup as I knew my harissa from Trader Joe's is on a spicy side. Few people at the dinner table still thought it was spicey. I thought 1/4 was perfect as I like a nice kick to potatoes sweetness. Potatoes were well cooked in 1 hour, and I did broil them for the last 10-15 minutes to get them to roast at the top. It made one delicious and super beautiful side dish this Thanksgiving. My friends asked me for the recipe and I'll definitely make this dish again.ikkeLos Angeles11/24/2018This recipe looked beautiful but did not taste good and it was difficult to get an even cook on the potatoes.  It sat untouched at our Thanksgiving line up. Anonymous11/23/2018Did this recipe, yesterday for Thanksgiving. It was a success at the table!\n I covered it with foil for one hour and 10 minutes , then removed the foil and increased the heat to 450 F to brown the top a little bit for 10 minutes.\nI used less Harissa paste (1/3 cup), and still it was quite spicy.  I like the kick of the spice but not to overpower the palate. Next time I will use less oil too.starfallRochester,NY11/23/2018Explore Bon AppétitAmericanSweet PotatoPotatoVegetableHarissaCondiments, Sauces & PastesPistachioNutFallSideDairy-FreeGluten-FreeVeganVegetarianHealthyishRoastThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Molly Baz"]}