{"id": "b2fe8cca64d8637be9ef42afad57ab53", "url": "https://www.bonappetit.com/story/9-ways-to-stay-happy-in-winter", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "9 Ways to Stay Happy in Winter From People in the Coldest Places | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle9 Ways to Stay Happy in Winter From People in the Coldest PlacesHow to fight the cold weather blues, inside and out.By Julia BlackJanuary 13, 2018FacebookTwitterEmailPhoto by Barcroft Media (Getty Images)FacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.There are two kinds of people in this world: people who love winter, and people who think those people are lying. For that second group, cold isn't the half of it. From chapped lips to seasonal depression, vitamin D deficiency to unwanted weight gain... it can be enough to make you wonder why we don't just all move to Hawaii and be done with it. Of course, winter also has its upsides, and, with a bit of proactive planning, you can do away with most—if not all—of the downsides. We spoke with some of our favorite chefs, nutritionists, and wellness experts who've taken on bitter winters across multiple continents to gather up the best tips and tricks for the chilliest, darkest months of the year.1. Let seasonal ingredients shine\"Citrus, citrus, citrus,\" says chef Sara Jenkins, who left behind New York City life for winters in Maine when she opened her restaurant Nina June in Rockport. \"In the absence of any fresh salad greens or juicy tomatoes, I like to shave raw root vegetables like turnips, radishes, and celery root and brighten them with citrus and fresh herbs from the supermarket. We also have all these homemade grains up here, from rye to basic wheat berry, so I'm constantly trying to build stews around those.\"Crunchy Winter-Vegetable SaladView Recipe2. Adjust your hair and skin routinePerhaps the most underestimated blight of winter is its effect on your hair and skin: torn cuticles, split ends, chapped lips, and scaly skin from harsh wind, icy cold, and dry indoor heating. Holistic nutritionist and cookbook author Sarah Britton has become a dry skin brush devotee during long winters in Toronto and Copenhagen. \"Dry skin brushing is an ancient practice that improves total-body circulation and even gets rid of cellulite. [It] sloughs off any dead skin cells that are clinging to our skin so that our pores can open up and we can detox more efficiently. Do it before you shower for about five minutes, starting at the feet and using circular motions to work toward the heart and around the back. It’s addictive.\"You can even fight dry, itchy skin in your sleep. \"In the last few years, I've started saturating my face with oil before bed,\" says Britton. \"There are tons that are good for your face, so you should choose one based on your skin type. In winter, I like something like sesame oil, which is also warming. Make sure it’s a cosmetic-grade, cold-pressed oil—you never want to put refined oil on your skin.\"Changes to your diet can also do wonders. \"We do smoked fish and cured fish at the Purple House,\" says owner and chef Krista Kern Desjarlais in North Yarmouth, Maine, \"so I tend to just snack on that throughout the day. The oils and minerals in fish are great for your hair and skin, which get really dry up here from all the blown heat and the fire heat in our homes. I also make sure I'm really consistent with taking my fish oil capsules in the winter.\"Slow-Roasted Salmon with Fennel, Citrus, and ChilesDon’t bother trying to divide this fillet into tidy portions. Instead, use a spoon to break it into perfectly imperfect pieces.View Recipe3. Align your schedule with the changing daylightIf you're a late sleeper, why not try a few months on the early bird schedule? (If you sleep until noon, after all, you could easily be left with just a few hours of good daylight.) And once you're up, resist the impulse to stay inside. \"I try to get out as much as I can and take a five-minute drive out to the beach,\" says Jenkins. \"Even if it's a really cold day, a walk in the sunshine is incredibly restorative.\"If daylight is really hard to come by where you are, consider investing in a light therapy lamp. (Britton even uses a portable one she can wear around her head.)4. Drink more water and get more sleepWhat's better than curing a cold? Not getting one in the first place. Chicago chef Diana Dávila, of Mi Tocaya Antojería, credits her supercharged immune system to drinking lots of water and always getting a solid night's sleep. It's so effective, in fact, that she enforces the same standards for her staff. \"I have to take care of myself so I can take care of them,\" she says. \"I just nurture everybody and try to lead by example. You have to mother the sh*t out of people. Hopefully, that builds good habits that they can take with them.\"5. Try a detoxWe're not saying you should drink nothing but spicy lemonade for ten days straight. (Seriously, especially in the winter, we're not big proponents of juice cleanses.) But we're all for responsible, nutritious cleansing routines. \"I really like to do a khichari fast,\" explains Britton. \"It’s an ayurvedic dish and a one-pot wonder made of mung beans and brown rice, and then usually carrots, potatoes, and peas, and a bunch of spices. It’s highly digestible, it’s nutrient-dense, it has the complete amino acid profile, and it really helps reset the system. You eat it for breakfast, lunch, and dinner for three days.\"Photo by Alex Lau6. Target key nutrients\"I tend to eat a lot more iron in the winter,\" says Britton, \"because we want our blood to be super strong. Everything from the legume family is good; beets are fantastic, especially the greens... any dark, leafy green in general. You just have to remember that when you are consuming plant-based (non-heem) iron, you need vitamin C—like a sprinkle of lemon juice—to chelate it. A vegetarian iron supplement should be a whole food supplement with vitamin C.\"Desjarlais adds, \"I think a lot of us up here [in Maine] are vitamin D deficient. I recommend taking a vitamin D capsule, and seeking out foods that are rich in good antioxidants.\" And if you can feel a cold coming on, try adding some vitamin C and Zinc to your daily routine to help bolster your defense system.7. Find new ways to exerciseIt can be easy to make excuses not to work out when the weather is horrendous. But take advantage of those bright, brisk days. \"I used to cross-country ski, but now it's mostly running and walking,\" says Desjarlais. \"And then there are just everyday chores—which sounds very old-fashioned, but up here you do a lot of shoveling. That keeps you in really good, tip-top shape.\"And if the freezing walk to the gym is the real obstacle, take after Dávila and develop a regimen you can keep up from home. \"I've done enough yoga by now that I can do my own routine without going to the studio. It's a great way to move your muscles and bones and improve blood flow without leaving the house.\"8. Eat wholesome comfort foodYou won't find much meat in Diana Dávila's kitchen this time of year—or on the winter menu at Mi Tocaya Antojería. She prefers to pile on the vegetables in dishes like her guisado de nopalitos or vegetables \"en tierra\" with lentils and quinoa, which she says offer the heartiness you're looking for in a winter meal without leaving you weighed down.At the Purple House, Desjarlais says, \"We do 'Sunday pancakes,' where we serve ployes, Canadian pancakes, made with buckwheat flour, and maple syrup. In general, we go for memory-inducing, nostalgic flavors. I think the flavors of liquor, cooked-off, are incredibly comforting... I might do a fruit compote with a burned-off alcohol like Cognac, as well as apricots and cherries. We also use a lot of chia, hemp, flax, dried raisins, currants, and cranberries in our [granola], along with a really simple yogurt.\"9. Live a little!\"I think it's about finding your inner joy,\" says Desjarlais. \"Maybe it's snowmobiling, sledding, or skiing, or maybe it's drinking hot toddies around the fire. And when it's all snowy and gross outside, [there's no shame in] hunkering down inside and nesting.\"Explore Bon AppétitHealthyishHealthyWinterFeel Good Food PlanRead MoreLifestyleHow Alaskans Eat Healthy in the WinterBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-12", "author": ["Condé Nast", "Julia Black"]}