{"id": "b302a9407077b67f90ffe144b410ca20", "url": "https://www.bonappetit.com/story/messy-kitchen", "year": 2018.0, "month": 10.0, "day": 5.0, "content": "8 Tips for Avoiding a Messy Kitchen When Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking8 Tips for Avoiding a Messy Kitchen When CookingRunning the dishwasher isn't enough.By Bon AppétitOctober 31, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThere are two inevitabilities that come with cooking: good food and a mess to clean up. For every baking project, every dinner party, even every one-pot meal made for you and you alone, there are also splatters and spills and stray ingredients in strange corners of your stove. Sure, it would be nice if the rule of “whoever doesn’t cook is on dish duty” solved everything, but simply washing pots and pans never really cuts it.Take, for example, BA’s Best Baked Ziti, a dish that is worth every bite but is also cause for some disorder. Here are some tips to help tackle the post-cooking mess.Wash dirty linens immediatelyYes, you should wear an apron, but aprons still need to be cleaned. Regardless of whether or not you covered up your crisp white shirt, regardless of whether or not you managed to escape the flying red juices of canned tomatoes, some splatter is unavoidable. The solution is to put those linens into the wash as soon as possible. The longer you wait, the harder it will be to get the stains out.Clean as you goEvery pro knows that the key to an efficient work station is to clean as you go. There’s nothing worse than a full sink that needs to be addressed after dinner is done and you’re a glass of wine or two deep. Soak that pot that had tomato sauce in it while the pasta water boils, wash that cheese grater while you blend the sauce, and rinse those bowls as soon as you’re done using them.Pour off excess grease into a jarGrease is the enemy of cleaning. It just… never seems to come off of any surface. But if you pour the excess into a jar before you move on to scrubbing, you’ll have an easier time. Plus, this saves your sink from clogging because grease is not good for your pipes; it will get stuck down there and eventually cause plumbing trouble.Soap, water, and elbow greaseYou generally don’t need fancy sprays or wipes for surfaces. Soap and water on a sponge—with the help of your strong arms on tougher parts—should work perfectly fine.Use water and a brush for cast-ironA cast-iron skillet can be a bit of a beast, and it needs to be taken care of. For this, just use water to rinse and a brush to get off any residual food. Then set the wet skillet over a low flame to make sure it fully dries.Get into the nooks and crannies of your stoveFor a gas range stove, use a brush to clean the top grates. Then lift them up and off and use a sudsy cloth to wipe the part underneath. For an induction stove where the whole surface is smooth, you’re good to go with just the sudsy cloth.Use a sheet tray as a catch-allThe oven is an often-overlooked part of kitchen cleaning. The food that falls down to the bottom tends to be forgotten about. One way to avoid that is to place a sheet tray on the rack underneath whatever you’re baking. In the case of baked ziti, it will catch anything that boils over.Save water by using a dry brush to clean dishesWhen loading up the dishwasher, it’s important to get the caked-on food off beforehand, otherwise your dishes won’t get properly clean. But it wastes a lot of water to rinse them and then run the machine. So instead, try wiping off the leftover bits and pieces with a dry brush. It works perfectly well and is better for the environment. That’s what we call a win, win.Get the recipe: BA’s Best Baked ZitiExplore Bon AppétitCleaningSamsungRead MorecultureThe BA Test Kitchen Wants to Help You Clean Up Your MessBy Elaheh NozariRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-31", "author": ["Condé Nast", "Bon Appétit"]}