{"id": "b313da08c7246dc11265f06fef68adf2", "url": "https://www.bonappetit.com/recipe/basically-spaghetti-pomodoro", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Pasta Pomodoro Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Spaghetti PomodoroBy Claire SaffitzSeptember 8, 20184.7(155)Read ReviewsTriangleEmailPinterestPrintPhoto by Heidi's BridgeEmailPinterestPrintEmailPinterestPrintNothing says “baby’s first kitchen” quite like mediocre store-bought marinara sauce dumped over clumpy noodles—but nothing says “hello I am a confident, resourceful, worldly home cook” like a tangle of perfectly-cooked spaghetti cradling a rich, buttery, almost-as-easy-to-make-as-opening-a-can pomodoro sauce. And once you’ve made this recipe, you’ll understand all of the tricks and techniques that separate mediocre at-home pasta dishes from the ones fancy restaurants charge the big bucks for. This recipe is a part of the Basically 10x10, a collection of ten essential, no-fail recipes that every home cook should have in their arsenal.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonColander$11 At AmazonMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonTongs$13 At AmazonHeatproof Measuring Cup$18 At AmazonIngredients4–6 servings3Tbsp. kosher salt, plus more128-oz. can whole peeled tomatoes4garlic cloves3Tbsp. extra-virgin olive oil, plus morePinch of crushed red pepper flakes, plus more3basil sprigs, plus leaves for serving1lb. spaghetti4½oz. Parmesan, finely grated, divided (about 1 cup)2Tbsp. unsalted butterPreparationStep 1Fill a large stock pot two-thirds full with water and heat over high to bring to a boil. Once you see the water start to steam, add 3 Tbsp. salt. We know, we know: That looks like a LOT of salt. But salting the pasta water aggressively—it should almost be seawater-salty—is the key to making sure that every noodle is properly seasoned through and through, and is one reason why restaurant pasta tastes better than the stuff you usually make. While you wait for the water, start your sauce.Step 2Open a 28-oz. can of whole peeled tomatoes and drain contents in a colander set over medium bowl. (Whole peeled tomatoes are the only canned tomatoes worth buying, TBH. The diced ones sometimes have weird chemicals added to them to keep the chunks from breaking down. Gross.) Using clean fingers, poke a hole in the tomatoes and shake to drain liquid and seeds from the insides of each tomato, reserving liquid. Shake colander over bowl to separate the solids from all the juices and encourage liquid to drain; set aside.Step 3Smash 4 garlic cloves with the flat side of a chef’s knife forcefully, so garlic breaks up into smaller bits; remove skins. If the cloves are really big, you might need to give them an extra smack to make sure they're broken up, but don't bother chopping—the garlic will infuse into the oil you sizzle it in and break down as the sauce simmers.Step 4Working next to your pasta pot, heat 3 Tbsp. oil in a large Dutch oven over medium. (We like using a Dutch oven or a large, high-sided skillet for cooking sauce and finishing pasta; it's kind of the only thing big enough to toss a whole pound of pasta in without noodles flying everywhere.) Add garlic and cook, stirring often with a wooden spoon, until garlic is golden all over, about 3 minutes.Step 5Stir in a pinch of red pepper flakes, then add drained tomatoes and increase heat to medium-high. The idea here is to concentrate the flavor of those tomato solids before adding the liquid they came in, which will give your sauce a more complex, rounded flavor. Cook, stirring occasionally, until tomatoes are darkened in color, browned and caramelized in spots, and starting to break down, 6–8 minutes. Don't rush this part! If you aren't getting color, let it go for another few minutes. Mash with the back of the wooden spoon to form a coarse paste.Step 6Add reserved tomato liquid to pot and stir to combine. Season with a pinch of salt, throw in 3 basil sprigs, and reduce heat so sauce is bubbling at a simmer. Cook, stirring occasionally, until liquid is reduced and sauce is thick like applesauce, 8–10 minutes. If your water isn’t boiling yet, turn off heat under sauce while you wait. If it is, reduce heat to lowest setting and move on.Step 7Add 1 lb. pasta to pot of water and agitate with tongs to prevent sticking. Cook pasta, tossing occasionally, just until lower end of time range given on the package for al dente. If you're not sure if it's done, fish out a piece and take a nibble—it should still be slightly too crunchy to want to eat because it's going to continue cooking in the tomato sauce. Just before pasta is done, use a heatproof measuring cup to scoop out about 1 cup pasta cooking liquid.Step 8Using tongs, transfer pasta from stock pot into Dutch oven with sauce, allowing water to piggyback on pasta into sauce. (That's right, no draining!) Crank heat under sauce up to medium-high and pour in ½ cup reserved pasta cooking liquid. If you've never finished cooking pasta in a pan full of sauce, your life is about to be changed—this process is what ensures that every single noodle is completely coated and infused with saucy goodness, and is pretty much the main difference between a dish of \"meh\" pasta and one that blows your mind.Step 9Cook pasta, tossing constantly, until sauce is clinging to each noodle and any standing liquid is mostly absorbed, about 1 minute. You still want a saucy consistency, but not watery. If things ever start to look a little dry, just add another splash of that pasta cooking water; if they look too wet, just wait a bit for some more liquid to evaporate.Step 10Slowly sprinkle in half of the Parmesan cheese (you want the grainy stuff with the texture of shaky cheese, not Microplaned), tossing constantly, until it has melted into the sauce. Add more pasta water, a couple of tablespoons at a time, to loosen sauce if necessary—it should be plenty saucy while you're incorporating the cheese so it emulsifies into the sauce properly. You want the sauce to ooze but still be thick enough to coat the pasta.Step 11Remove pot from heat and stir in 2 Tbsp. butter until melted. Finishing with a bit of butter is almost always a good idea—it makes the finished dish extra glossy and delicious. (Don't look at us like that—if you think pasta is diet food, you're kidding yourself.)Step 12Using tongs, divide pasta among bowls, then top with remaining cheese and basil leaves. Top with red pepper flakes and an extra drizzle of oil, if you feel. And there you have it: saucy, glossy Basically Spaghetti Pomodoro. Give yourself a pat on the back, and kiss the jarred stuff goodbye.How would you rate Basically Spaghetti Pomodoro?Leave a ReviewTell us what you thinkReviews (65)Back to TopTriangleDelicious, easy, and simple! This one’s a keeper! AnonymousGreenville, SC12/23/2021I dice the tomatoes first, I feel that makes a better reduction. My late wife liked mushrooms, so I'd dice them relatively finely and add them to the tomatoes a few minutes in. Nice tip on additional butter, thank you.\nLeon JesterSouth Central Virginia8/12/2021Simple and elegant. I loved the videos. I learned a lot. I do add a pinch of sugar just to reduce some of the acidic taste from the tomatoes, but that’s what my mom always did, so perhaps it is fine without. I cannot tell you what a difference this is over any jarred sauce; it’s amazing. And no chemicals or salt. The jarred brands, even high end, have too much salt. I also love Marcella Hazan’s easy sauce: she also adds butter but simmers the sauce with 1/2 of an onion (not chopped) I remove the onion before adding the pasta. JanicePark City, Utah 8/12/2021Great recipe - I added 2 T Balsamic Vinegar and 4 oz Pine Nuts toasted. Also put cut Basil in when mixing Pasta and Sauce, Parmesan Cheese on top of served portions. Really good!AnonymousSouthern CA7/23/2021Way too much salt! I am on a salt free diet and will not add any salt at all. Found that just adding spices and herbs work just fine to create a flavorful dish.ClaraSan Lorenzo, CA6/12/2021Great recipe, but in true BA fashion they over salted the dish.  Cut the salt in half and you have a great recipe. I prefer a more flavorful version so I double the garlic and red pepper. If you want it thicker or sweeter ad 1 (no more than 2) tbsp of heavy cream.  If you took my advice but it's not salty enough add more parmesan or crispy pancetta.  Remember salt  should not flavor your dish.  It's only there to accentuate the natural flavors of the other ingredients you're cooking with.Drew86Ft. Myers, FL4/22/2021I find myself coming back to this recipe again and again. It's so simple and a huge hit whenever I make it. So delicious and Italian cooking at it's finest. 10/10 would recommend! LindseyBay Area, CA1/26/2021Super dish, this is simple Italian cooking at it's best! I used a mixture of tinned plum tomatoes and tinned cherry tomatoes, this gave the dish extra sweetness.Chris HigginsDorset, UK1/12/2021amazing recipe, super easy and super cheap to make! just for those experiencing cheese clumping. you most likely have the heat too high (or possibly adding it too much at a time/to a dish with too much liquid. but most likely the heat things) especially if you're using a dutch oven (which retains heat) for this step id have already turned off the stove. otherwise, the proteins will stick to each there and the fat that helps create the smooth melt will release into the dish without those proteins (if that makes sense)wNew York1/3/2021Bravo!!Judy SusinoGarfield, NJ12/29/2020Love this recipe. Have used it so many times now and always adapt based on what we have home. I always did it with whole tomatoes, but found that it works just as well with diced ones. I add about 6 big cloves of garlic and two small ones and put them through the garlic press and only fry on low heat with the chilli flakes. Yesterday I had no basil which was unfortunate ,but I had fresh thyme and rosemary so I put two springs of thyme and one of rosemary after adding the liquid sauce. Mixed it around and kept it on the stove for a long time and it was delicious! Didn't have spaghetti either, but had fresh homemade ravioli with four cheeses and it goes along beautifully. Often I don't feel the need to add the butter and I find that olive oil or pasta water does the job to make the silky sauce. NiaNetherlands12/21/2020Haven’t made this but just a question: why does the image at the top of the article look so drastically different from the end pic in the directions? They rrally look like two different dishes based on the pics and the preparation instructions.LuluAlameda,CA11/15/2020This is absolutely delicious. THE best pomodoro sauce I’ve tasted at home. Everyone loved it and scratched around looking for more... thank you for this recipe!!!!AnonymousAlberta, Canada 11/12/2020Bravo! This made me feel like I was back in Italy with that perfect blend of salty flavor and just-sticking-to-the-pasta sauce. Used San Marzano tomatoes. I added a BIT of sugar during the bubble-down phase. I also paired it with a nice Ferrari sparkling and it was perfect!! MaryBNYC11/12/2020\"Don't look at us like that—if you think pasta is diet food, you're kidding yourself\" ha! Claire- your recipes are always so clear and easy to follow! This the best spaghetti recipe I've ever tried!!! cant wait to make it again <3 DevonHalifax, Nova Scotia11/2/2020Explore Bon AppétitPastaItalianEuropeanCanned TomatoTomatoVegetableSpaghettiPasta & NoodlesBasilHerbs & SpicesParmesanCheeseEasyMainNut-FreeVegetarianSautéSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Claire Saffitz"]}