{"id": "b33a24fe21a151040a1c782f525451ae", "url": "https://www.bonappetit.com/story/grapefruit-lemon-bars", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "This Lemon Bar Recipe Does One Better: It Adds Grapefruit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Haven’t Made Real Citrus Bars Until You’ve Made CURDBow to the epic citrus pillows that are these grapefruit bars.By Amanda ShapiroDecember 7, 2018FacebookTwitterEmailFacebookTwitterEmailMy mom’s lemon bars are legendary. They’re from The Joy of Cooking, and I and others in my family have been known to request them in lieu of cake on birthdays and pretty much any other occasion. So when I heard about this new grapefruit bar recipe and realized that they were essentially lemon bars, add the grapefruit, I was curious, skeptical, and ready for a citrus-bar showdown.In truly dimwitted fashion, I scheduled the bake-off for the weekend after my parents moved, and I could hardly find the oven amid the boxes. Now was clearly not the time to challenge my mom to a head-to-head baking battle (she would’ve cried). Instead, I unearthed the measuring cups and embarked on a grapefruit-bar journey alone...while my parents fretted over closet space upstairs.I’m so glad I did. These bars are nothing like the ones I grew up eating, which involve simply pouring a mixture of sugar, cornstarch, lemon, and egg over a shortbread crust and baking it. These bars have magic, and that magic is CURD. As I learned from a crash course with the recipe’s mastermind, Chris Morocco, curd means you cook it, i.e. you heat the lemon mixture (sometimes over a double boiler; in this case, right in the saucepan) until it simmers, then you whisk in butter gradually. All these years I thought I was curd-ing but I was really just mixing stuff together! As it turns out, the extra work yields an unbelievably soft, pillowy, creamy-bright filling that makes other lemon bars look kind of sad and deflated in comparison. Sorry, Mom!Making the shortbread crust was simple thanks to my best friend the food processor. My dough never became dough, exactly, more like loose sand, but I just pressed it into the pan while my parents rearranged furniture in the next room, and, after 25 minutes in the oven, it had become a perfectly golden-brown crust.While that was baking, I candied the grapefruit peel—another cooking thing I’d never done before! It was pretty easy, but try to avoid the pith (the white stuff under the peel), because even a half cup of sugar can’t mask that much bitterness. Also, the recipe says to discard the sugar syrup after simmering the grapefruit, but let me suggest you save it for cocktails: It’s like an Aperol simple syrup, and who wouldn’t love that?Then it was time for the curd. I’ll admit that there was a brief moment—okay, about eight minutes of constant whisking—when I hated the curd. Sweating, arm cramping, a handyman drilling holes in a wall somewhere: It all felt like torture...until, thank the Lord, the creamy, pale yellow, just-thick-enough mixture was done, along with all of my grip strength.I poured it over the shortbread, topped it with the candied grapefruit, and sent it into the oven for a final bake. Then I chilled the bars in the fridge for a few hours while I located a few boxes of Christmas decorations and went to town. I suggest letting these bars chill for as long as possible, overnight if you can stand it, because the curd will be easier to cut and the shortbread will have absorbed some of the delicious, citrusy goo (a very good thing). I only gave them three hours because I had a train to catch, so my bars got a little sloppy, but the flavor was unreal—pops of citrus and cream balanced by the buttery richness of the crust—and the ones I left in my parents’ fridge received rave reviews for appearance and taste.Am I a total curd convert? Will I never ask my mom for her lemon bars again? I won’t make any promises, but I will make you some curd—as soon as my strength returns.Get the recipe:Grapefruit Bars with Candied ZestThe twice-cooked curd method ensures that these bars are extra sturdy and have a smooth, shiny surface.View RecipeExplore Bon Appétitholiday2018Holiday CookiesCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-07", "author": ["Condé Nast", "Amanda Shapiro"]}