{"id": "b35aa470fafab630942a92bcc8521ad6", "url": "https://www.bonappetit.com/story/chemex-ottomatic-coffee-maker", "year": 2021.0, "month": 1.0, "day": 3.0, "content": "The Upgraded Chemex Ottomatic Was the Best Gift I Got in 2020 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Upgraded Chemex Was the Best Gift I Got in 2020And to be honest, I gave it to myself.By Andy BaraghaniJanuary 20, 2021FacebookTwitterEmailPhoto courtesy ChemexFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I know and understand people who take their coffee routine very seriously. This is a judgment-free zone because these people are my friends. If you want to fully geek out on the origin of your coffee beans, go right ahead. I might even join that conversation. When it gets to the coarseness of your coffee grounds and achieving the ideal water temperature for blooming them for your pour over…well, I’ll let you talk about it while I start to make my coffee. The New Yorker in me wants a decent cup of coffee, one that’s delivered fast and certainly without making a fuss.For most of my adult life, I was a French press kind of guy, and usually just one cup of coffee in the morning kept me perked up for the day. But then 2020 came and I found myself drinking nearly three cups a day. I needed to retire the French press and invest in something that made a proper cup of coffee, looked chic on the kitchen counter, and again, wasn’t as fussy as organizing the moving parts required to make a pour-over every time. That time can be spent on breakfast!The answer came in the form of the Chemex Ottomatic 2.0. If you’re thinking, This thing looks familiar, that’s because you’ve probably seen parts of it before. This is the latest version of the Chemex Ottomatic, an automatic drip coffee maker that uses the same filters and iconic glass carafe as a classic Chemex pour-over setup.The difference here is that it introduces all of the aspects of an automatic drip coffee machine. Water is heated constantly in the chamber, keeping it at the optimal brewing temperature, and then it’s dispersed through a nozzle that gently pulses water over the coffee grounds in a wide arc, not just a narrow drip. And the carafe is set on a heating plate that can be turned on (for when I want to brew coffee and save some for later) or off (for when I want to use the machine’s iced coffee function).The Ottomatic 2.0 basically removes all of the work of a pour-over while still giving me the same honed flavors. It brews me six cups of coffee, and yes, it looks beautiful while doing it. See, it’s already a better start to the new year.Mark McCartyChemex Ottomatic 2.0$350 at Zola$350 at ChemexExplore Bon AppétitHighly RecommendCoffeeShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-20", "author": ["Condé Nast", "Andy Baraghani"]}