{"id": "b360949f6efc8ea9dace508b2e3cc3c5", "url": "https://www.bonappetit.com/story/desk-dip-for-lunch", "year": 2019.0, "month": 10.0, "day": 2.0, "content": "Desk Dip Is the Answer to Your 11:30 a.m. Stomach Growl | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDesk Dip Is the Answer to Your 11:30 a.m. Stomach GrowlDipping delicious things in another delicious thing is our favorite office lunch maneuver.By Alex DelanyOctober 9, 2019FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Kat BoytsovaFacebookTwitterEmailI’d like to change your office lunch for the better. It’s not my sole purpose in life. I won’t pretend to be that noble. But the quality of your lunch is something I care about. Which is why I want to tell you about Desk Dip. I know exactly what you’re thinking. What the freaking heck is this gosh darn Desk Dip? It sounds...so cool.I love the enthusiasm. And the curiosity. And for that, I will address your question with pleasure: Desk dip is exactly what you think it is. It’s a dip. That you eat at your desk. For lunch.But it’s also so much more. In a world of sandwiches and salads and predictable office lunch options, Desk Dip is a breath of fresh air. It’s an opportunity to break out of the walls that mainstream lunch culture has built around your work lunch. (If you work in a cubicle, these walls are literal. If not, the walls are metaphorical.) Desk Dip is a new way of thinking. It’s all about having the freedom to choose.When I dip, you dip, we dip.\nPhoto by Chelsie CraigThink about it like this: Desk Dip contains multitudes. First, you have to pick a dip that appeals to you. Maybe it’s an eggplant caponata inspired situation. Or maybe a simple, lemony hummus recipe. Or maybe it’s the Desk Dip that I’m really digging at the moment: a super silky, slightly spicy, tiny bit sweet curried coconut peanut number. After you make that call, the options are limitless.Because what you’re dipping into your Desk Dip is where a creative spirit really comes into play. You could just bring some pita chips and call it a day. Or you could bring some crunchy radishes and carrots. And a jammy seven minute egg. And some sliced up rotisserie chicken breast. And a roasted sweet potato. And some blanched string beans. And maybe even some potato chips? It really doesn’t matter. You are the commander of your own destiny. YOU CAN DIP WHATEVER YOU WANT TO DIP.This is a lot to take in. I know. A whole new world, a new perspective. But please, trust me. Take this leap of faith. Make Desk Dip your office lunch, even if it’s only for a day. Try it out. If you don’t enjoy the experience, go back to your reheated baked ziti. But to be quite honest, once you get a taste of the Desk Dip lifestyle, it’s pretty tough to revert back to the old you.Get the recipe:Curried Peanut DipThis creamy, spicy-sweet dip pairs with leftover rotisserie chicken, jammy eggs, cucumber spears, and roasted sweet potatoes for the perfect desk-friendly lunch.View RecipeExplore Bon AppétitLunchDipRead MorecultureThe Bon Appétit Guide to Actually Enjoying Your Lunch at WorkGallery20 SlidesBy The Bon Appétit StaffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-09", "author": ["Condé Nast", "Alex Delany"]}