{"id": "b3685fc605176f1f853375d9370f8b8f", "url": "https://www.bonappetit.com/recipe/burnt-masala-chicken-wings", "year": 2021.0, "month": 3.0, "day": 3.0, "content": "Burnt Masala Chicken Wings Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2021 IssueBurnt Masala WingsBy Preeti MistryMarch 16, 20214.1(11)Read ReviewsTriangleEmailPinterestPrintPhotograph by Heami Lee, food styling by Frances Boswell, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintChef Preeti Mistry came up with the technique used in this recipe a few years ago when they were trying to replicate the unique smokiness that food gets when it’s cooked in a tandoor—just without the tandoor. Burning the spices re-creates at home the slightly bitter taste and smell you get from the 800°-plus oven. “Roasting, then grinding masala adds depth of flavor to the wings,” Mistry says. “The tamarind sauce is a nice tangy foil.”If you don’t eat meat on holidays like Holi, skip these wings and find more of chef Preeti Mistry’s Holi party recipes here.Ingredients8 ServingsBurnt Masala8black cardamom pods3green cardamom pods3chiles de árbol22\" cinnamon sticks1Tbsp. black peppercorns1½tsp. whole clovesMarinadeJuice of 2 lemonsJuice of 4 limes2serrano chiles, finely chopped4garlic cloves, finely chopped14\" piece ginger, finely chopped3Tbsp. vegetable oil4tsp. Diamond Crystal or 2 tsp. Morton kosher salt4lb. chicken wingsGlaze and assembly½cup tamarind concentrate (such as Swad)2Tbsp. sugar2Tbsp. unsalted butter11\" piece ginger, peeled, finely chopped1Tbsp. hot chili sauce (such as Sriracha)½bunch cilantro, tough stems discarded, choppedspecial equipmentA spice mill or mortar and pestlePreparationBurnt MasalaStep 1Place a rack in middle of oven; preheat to 350°. Toast black and green cardamom pods, chiles de árbol, cinnamon sticks, peppercorns, and cloves on a small rimmed baking sheet, tossing halfway through, until chiles are nearly black and cloves are ashy gray, 8–10 minutes.Step 2Transfer chiles and spices to spice mill or mortar and pestle and let cool. Finely grind (you should have about ⅓ cup); set burnt masala aside.MarinadeStep 3Whisk lemon juice, lime juice, chiles, garlic, ginger, oil, salt, and 2 Tbsp. burnt masala in a large bowl to combine. Add wings and toss to coat in marinade. Cover and chill at least 2 hours and up to 12 hours.Glaze and assemblyStep 4Place racks in upper and lower thirds of oven; preheat to 425°. Whisk tamarind, sugar, and ½ cup water in a medium bowl until sugar is dissolved; set tamarind mixture aside.Step 5Melt butter in small saucepan over medium heat. Add ginger and chili sauce and cook, stirring, until ginger browns slightly, about 4 minutes. Add reserved tamarind mixture, reduce heat to low, and simmer, whisking occasionally, until glaze is thick and glossy, 10–15 minutes. Let cool.Step 6Line 2 rimmed baking sheets with double layers of foil; place a wire rack inside each. Using tongs, remove wings from marinade, letting excess drip back into bowl, and divide among racks; discard marinade.Step 7Roast wings until golden, 15–20 minutes. Remove from oven; turn wings over. Brush all over with glaze, return to oven and roast until wings are golden brown and cooked through and glaze is bubbling slightly, 10–15 minutes.Step 8Transfer wings to platter and scatter cilantro over.How would you rate Burnt Masala Wings?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleGreat recipe to help usher in Spring/Summer. My father would eat at KFC if he had it his way (or if there was no one here to cook for him) and he can be quite picky when it comes to food but he has always trusted my cooking. Everyone loved this recipe (even dad) and I cannot wait to make it again. Next time I might do the second 15-20 minutes on the grill for extra flavor.thenamesantGrand Haven, MI4/11/2021Made these for a picnic and Indians and non-Indians alike enjoyed them! This might be down to personal preference, but I added a LOT more sugar into the glaze as it was cooking (at least triple Preeti's recipe), because I found the tamarind to be too intense and I wanted the contrast of smokey spices with a sweet glaze. Other than that I found it to be relatively easy for so much flavor. Fatima Chicago3/24/2021Explore Bon AppétitChicken WingChickenPoultryTamarindCondiments, Sauces & PastesStarterMainNut-FreeDairy-FreeGluten-FreeRoastSuper BowlFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-16", "author": ["Condé Nast", "Preeti Mistry"]}