{"id": "b36a50403b8c8ff6829d6c9d4bed32a4", "url": "https://www.bonappetit.com/story/toothpicks-beat-cake-testers", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "The Best Cake Tester is a Toothpick | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingToothpicks Are the Only Cake Testers You NeedSave your officially-named cake tester for prodding vegetables or fish fillets.By Sarah JampelMarch 31, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Imagine your last name is “Singer” but you were destined to be a dancer. That’s exactly the kind of battle a manufactured “cake tester” is up against. I constantly reach for it for tasks around the kitchen (prodding a boiling potato, poking a steamed squash, unraveling a tight knot, sure), but I never use it for its eponymous job. The somewhat-harsh reality is that cake testers, while handy in so many ways, simply aren’t great (or even good) at testing cakes. But you know what little tool does excel at assessing the doneness of a cake? A toothpick.So whenever I'm at the point of the recipe where I have to insert a cake tester, I follow in the footsteps of Chris Morocco, the great baker Alice Medrich, and my mom, all of whom swear by the toothpick. Its rough, uneven surface means that crumbs will adhere, and its light color makes it easier to judge the moisture level of the cake. If you don’t have a toothpick, a thin bamboo skewer can stand in its place.You should own a cake tester, but you shouldn't use it for testing cake.\nPhoto by Chelsie CraigOfficially-sanctioned cake testers, on the other hand, are made of stainless steel and therefore too slippery to show the full range of what’s happening inside the pan. Sure a metal cake tester might come out coated in a sheen of batter (your cake is not done), but it can’t communicate the breadth of possibilities. Crumbs don’t cling; slight moistness isn’t visible because the tester won’t change color when it’s damp. A cake tester gives you one of two answers even though you’re probably searching for a more nuanced response.No matter what tester you’re using, it’s just as important to follow all of the recipe’s cues for doneness. In Sohla El-Waylly’s Cardamom-Pistachio Carrot Cake, for example, a cake tester would likely come out clean before the cake is fully cooked. A toothpick would give you a more accurate reading, but for this cake (and for many!), it’s important to touch it with your finger. If it feels foamy and airy and your fingerprint sinks in and leaves an indentation, give it another five minutes. Your fingerprint should spring back and you should be able to feel the density of the cake.So while I’ll hang onto my cake tester—one day I might even use it to judge the doneness of a fish fillet—I might call it by a different name, like prodder or poker or piercer? I’ll stick to my toothpicks and, since I never use them to pick my teeth, I’ll call them “cake testers” instead. Got it?Get the recipe:Cardamom-Pistachio Carrot CakeHere’s what happened after carrot cake met carrot halwa, the milky, long-cooking, spoonably-soft confection common in South Asia. Raisins, cinnamon, and cream cheese frosting made way for brown-butter pistachios, cardamom, and sticky carrot glaze and the rest of their romance was history. View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-31", "author": ["Condé Nast", "Sarah Jampel"]}