{"id": "b3704be688682485ef6b8f47d6227040", "url": "https://www.bonappetit.com/city-guides/montreal/venue/dieu-du-ciel", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Dieu du Ciel Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginmontrealDieu du CielChoose your own microbrew adventure in Mile EndFacebookPinterestTwitterEmailSamuel JoubertGO HERE: for some of Montreal’s best microbrews in a super-casual space that’s both a pub and brewery for Dieu du Ciel.ORDER: any of the 16 or 17 beers scribbled in chalk on big boards. Even if you’re not a beer nerd, Dieu du Ciel makes over 150 varieties, from stouts to IPAs to sour ales, so you’re sure to find something you dig. Sure, there’s a selection of cocktails, scotch, and whiskies, but everyone is here for the beer. If you’re hungry, the micropub has a kitchen, so you can get individual pizzas, sandwiches, and other pub snacks.THE VIBE IS: relaxed at any time of day (or night). Despite its reputation for making superlative microbrews, Dieu du Ciel has an unassuming, unpretentious air, so beer noobs can feel at ease.PRACTICAL STUFF: Open every day 11:30 a.m. to 3 a.m., with the kitchen open until midnight and snacks available until 2 a.m. Heads up: Kids accompanied by parents are welcome during the day, but after 8 p.m. it’s 18 and up.—Claire SaffitzSamuel JoubertSamuel JoubertWE ALSO LOVELarrysA natural wine bar that also serves the best breakfast in Mile EndCafé OlimpicoGet your caffeine fix at this Mile End espresso shopSt-Viateur Bagel ShopSettle the great bagel debate by getting a dozen at the famed Mile End mini chainExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-08-23", "author": ["Claire Saffitz"]}