{"id": "b371b25e07dbb69ea983485209fb4579", "url": "https://www.bonappetit.com/story/duxtop-portable-induction-cooktop", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "The Duxtop Portable Induction Cooktop Is Magnetic | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Portable Induction Cooktop Is MagneticGas is fleeting but electricity is forever.By Ali FrancisJune 22, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.For 10 days in April, I stayed in a remote, lakeside cabin in Cape Cod (dreamy) that only had a kitchenette (less so). Because of council code and all that, it couldn’t be a “real” kitchen—so forget about an oven. The cups were plastic, the knives were for cutting butter, there was nay a whetstone in sight. The pièce de résistance, though, was a futuristic-looking Duxtop Portable Induction Cooktop. Bern, as I’d come to call the sleek black box, my sole companion, consistently and quickly delivered al dente penne, perfectly creamy scrambled eggs, crispy mushrooms, and snappy sausages. I, on the other hand, continued to meet Bern’s devotion with skepticism.Duxtop Induction Cooktop$104 at AmazonThe haptic experience of using an induction cooktop was, honestly, eerie at first, like driving an automatic car after years with a stick shift. I had trust issues, okay? Unlike my gas stove in Brooklyn, there were no dials or flames—“Bern, you in there?”—yet, after I set a pot of salted water on top and pressed the Boil icon, it would bubble wildly two minutes later. What are you, I wondered, patting Bern’s, uh, head. How do you work? Why are you hot but…not?If cooking over fire is about feel, cooking with induction is about faith. In the end, Bern (and a heavy-handed background check on Google) won me over. The Duxtop Portable Induction Cooktop, I learned, could do pretty much everything my gas stove back in Brooklyn could—without the harmful respiratory and cognitive side effects, earth-killing fossil fuel emissions, and extreme risk of setting every dish towel I’ve ever owned aflame (just me?). Here’s what you need to know:How do induction cooktops work?“I frankly don’t fully understand it,” says BA’s test kitchen director, Chris Morocco, “but rather than combusting gas, which then heats your pot, induction heats the pan directly through magnets.” In other words, the electromagnetic heating coils lurking beneath the burner’s flat glass surface produce electricity when they come into contact with ferromagnetic materials: cookware that contains iron or has an added magnetic layer. The active heater coils cause the magnetic particles to agitate, which warms the pan quickly. Kinda like when you’re so mad your face feels hot (I made this up). Unlike gas or electric stoves, which have to first get hot enough to heat your cookware, the surface of an induction cooktop usually remains cool (and safe!) to touch. Any heat you do feel is not coming from the surface itself—rather, it’s heat that’s transferred from the hot pan back to the glass cooktop.Okay, but which is the best induction cooktop?I’m a Duxtop Portable Induction Cooktop loyalist, and not just because Bern was my first love. The feature-set-to-price ratio on this one is unbeatable (the over 2,199 Amazon reviewers who gave it five stars agree!). First, it has a whopping 20 temperature options that range from 100℉ to 460℉, meaning there is basically nothing you can’t cook on this burner. And unlike lots of induction units that have automatic shutoff periods, you can set a 10-hour timer on the Duxtop, and rest assured your brisket won’t be disturbed while braising. Also, it weighs less than most human babies (5 lb., 12 oz.), and takes up about the same amount of space as a large cutting board. Finally, it lets me sleep better at night knowing I’m not breathing toxic gas or generally contributing to our planet’s ecological collapse (more on that soon). How do I know if my cookware is induction compatible?The good news is that “most new pans are being made to account for induction,” says farmer, whole-animal butcher, and induction devotee Sophia Hampton, whose work explores the relationships between food, animals, and the environment within a changing climate. Hampton typically uses her cast-iron pan with induction cooktops. “The only thing is,” she adds, “the pan needs to be totally flat to induct properly.” No warped old things! This also means that induction cooktops won’t work well for curvaceous cookware, like, say, your favorite wok. For that you’d need a specialty concave induction burner or a wok built specifically for the purpose.Besides cast iron, many types of stainless-steel pots and pans also work with induction—excluding anything with a high nickel or aluminum content, which will block the magnetic field. Cookware that’s entirely made of aluminum, copper, or glass will work only if it’s lined with a magnetic bottom layer, which many manufacturers have started to do. But if you’re like me and would prefer to be able to test for compatibility on the fly, simply hold a magnet to the bottom of your favorite pots and pans to determine the level of attraction:The magnet is a stage-5 clinger: Go forth, your cookware is induction-ready.The magnetic pull is loose: This pan might induct. What do you have to lose?The magnet drops off immediately: Sparks will not fly, this pan won’t induct.Are gas stoves really that bad for me?A growing body of research suggests that, uh, combusting literal fossil fuel in our literal kitchens is pretty terrible. Outdoor air quality has been heavily regulated since the Clean Air Act was introduced in the ’70s, but if we measured indoor air quality, the millions of us in the U.S. that use gas stoves would probably be kicking them to the curb.A Rocky Mountain Institute report, published in collaboration with Physicians for Social Responsibility, Mothers Out Front, and Sierra Club, found that gas stoves can emit levels of nitrogen dioxide and carbon monoxide (among other pollutants) that would violate outdoor air quality standards. People cooking with gas stoves were found to have 50–400% higher amounts of nitrogen dioxide—which is particularly harmful to the lungs and can also impair cognitive ability—in their kitchens, as opposed to those cooking with electric or induction. This puts our most vulnerable populations at risk: children and people living in low-income housing where ventilation is poor, space is limited, and gas stoves are occasionally turned on as additional forms of heat when temperatures drop.If it seems absurd to you that we’re still burning gas in our homes, knowing it makes people sick, it is. But we’ve all been gaslit by the fossil fuels industry, which is constantly fighting against electricity. “People feel emotional about gas stoves, and the gas industry knows it,” write Justin Gillis and Bruce Nilles in an opinion piece for the New York Times. “Seeing this fight coming, the industry is already issuing propaganda with gauzy pictures of blue flames.”Gillis and Nilles suggest that induction stovetops and cooktops are the ideal alternative. Simply put: “Induction cooktops, running on electricity, are superior to gas stoves,” they write.Why are induction cooktops better for our climate?“There is nothing good about fossil fuels,” Hampton says. “Cooking with gas is a carbon footprint manifesting in your home. If we value anything that’s good in this world—polar bears, the Antarctic, having four seasons—we can’t have an economy that is based on gas and oil.”In addition to not releasing harmful emissions into the atmosphere, electricity has the unique potential to become fully renewable, Hampton explains, as we phase out coal and natural gas and our grids become cleaner and greener. (Currently, 20% of electricity used in the U.S. is generated from renewable sources.) Induction stoves and cooktops are also generally more energy efficient than their electric or gas counterparts, because heat is transferred directly into the cookware, rather than being lost to the atmosphere.Well, then, what’s it like to switch to an induction cooktop?I did find that cooking with Bern took a little time to get used to. Induction was virtually soundless and buttons felt less intuitive to knobs—like cooking in a sensory deprivation tank—but none of these minor grievances affected the flavor of my food. Here are some things I learned along the way:Your pan will heat up super quickly. I typically spend at least 10 minutes in the shower, folding laundry, or twiddling my thumbs while my gas stove takes its sweet time to boil a pot of water. The Duxtop Portable Induction Cooktop does it in almost half the time (which means my pasta goes from pot to plate faster too).Heat will not be generated unless your induction-compatible pan is on top. It did take me a while to figure this out, because I don’t read instruction manuals and am not good at understanding complex physics. The reaction occurs between the cookware and the magnetic heating coils, so, like at a wedding, both parties must be present. Muscle memory had me setting my ideal temp and then waiting for the cooktop to get hot—which, of course, never happened but is a nice safety feature nonetheless.Induction cooktops usually offer precise, and controlled, temperatures—depending on the model. This makes them a great option for dishes that need low, slow, and even heat, like stews, caramelized onions, stock, and sous vide anything. Hampton uses hers overnight to make rich bone broths, because, without any flames, induction simply “cannot burn your house down.”Induction cooktops are easy to clean. All I need to do is wipe off the smooth glass square, as opposed to scrubbing those annoying gas grates every time I slop sauce (a.k.a., every time I cook 😬).The heating element can shut off prematurely if you, say, raise the pan to flip an omelet in the air like the Muppets chef. In this scenario, and others where you might shake your pan around while cooking, you could lose heat. I did not find this to be the biggest deal. Because the pan heats so quickly with induction, I just put it back on the burner and off we went again.Induction cooktops are ultra convenient, particularly if you live in a small space or don’t want to fork out for a full stove replacement. The Duxtop Portable Induction Cooktop, for example, is 14 x 11.4 x 2.5\" and plugs into my wall socket like a toaster or kettle. Even Morocco is tempted by the convenience and fuss-free nature of induction cooking: “I have a secret ambition to use one as an alt-grill,” he says. “Just run an extension cord outside and sear away in minutes.” No getting coals hot, no BURNING GAS.You might lose a little magic. “Cooking our food over the fire is a primal instinct for humans,” Hampton says, “which is why I’m a reluctant induction advocate.” Morocco agrees: “Cooking is so much about feel,” he says. “Also why I hate microwaves.” Without knobs and fire, the experience can feel like a simulation of the real thing. But when you think about it, a gas flame is also a pretty wan approximation of a roaring campfire.So, should I buy an induction cooktop?The cooking experience is going to be a little different with induction; it’s not always easy to part with nostalgia. “I’m a whole animal butcher who does believe in craft and working with your hands,” Hampton says. “But that’s such a small thing to cling to in the face of being able to move away from fossil fuels. I just think we gotta get over ourselves at a certain point.”TLDR: If you care about the health of humans (including the ones that live in your household) and the planet and you can afford to make the switch, yeah, you probably should.Induction Girl Summer1 / 93ChevronChevronPorterhouse With Summer Au Poivre SauceView RecipeExplore Bon AppétitShoppingAmazon Prime DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-22", "author": ["Condé Nast", "Ali Francis"]}