{"id": "b378ba533452498209528c86764be668", "url": "https://www.bonappetit.com/story/the-only-good-zucchini-recipe", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "I Hate All Zucchini Recipes—Except This One | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Hate All Zucchini Recipes—Except This OneIn her weekly newsletter, food director Carla Lalli Music talks about the only zucchini recipe she’ll ever make.By Carla Lalli MusicAugust 23, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The only good zucchini recipe in the entire worldZucchini is like the glass of water that’s been sitting on your bedside table while you were away all weekend during a heatwave, and you know your cats have been drinking out of it.Zucchini is like your husband’s gym socks. Even when they’re clean, you’d rather not touch them.Zucchini is a summer cold: Insulting.Zucchini is a wet bath mat.Zucchini is sand in your sandwich.Zucchini takes something that should be good—fresh summer produce—and makes it bad, just by, like, being itself.I am editing the first draft of my cookbook right now, and I just removed all mentions of zucchini. I don’t want to be associated with it.To use the phrasing I’ve taught my children to employ when they’d rather stab themselves in the eyes than eat what I’ve put on the table: Thank you for offering, but I don’t care for zucchini.Am I being clear?Want this letter before it hits the website? Sign up for our newsletter!Let’s look at the facts. Zucchini is watery and bland. Its flesh tastes like nothingness, but the skin can be weirdly bitter. Sometimes they look good—there are types that are striped or curved or come in pretty hues—but they’re all the same inside, which seems extra rude.Chris SearlZucchini grows like crazy, so there are tons of recipes for it, sort of like how common illnesses can be treated with a wide range of available medications.I’ve tried to like it. If you prepare it raw and you eat it the second it’s been sliced, it might be crunchy. For a hot minute I liked this shaved zucchini salad with macadamias, but I’ve never made it at home because I don’t trust anyone I live with to be quick enough, and five seconds later it turns into a watery mess.Some say zucchini is “great” if you dress it with lemon juice, excellent olive oil, shavings of Parmigiano, and flaky sea salt. I’ve tried that, too, but I think it only works if you’re sitting on a yacht off the coast of Capri, and do I look like Leonardo DiCaprio to you?Anyway, if I was in Italy, I’d order stuffed zucchini flowers, because those are stuffed with mozzarella and anchovies, then battered and fried.Zach DeSartI’ve also made a thousand zucchini fritters, trying to prove to myself that zucchini has some—any?!—redeeming qualities. But in order to make a decent fritter, you have to shred the flesh, salt it, squeeze it, toss it, and squeeze it out again, effectively obliterating everything zucchini-ish about the zucchini in the process. Even if you make a good fritter in the end, it’s not a very strong case for zucchini.See? I’ve tried. Zucchini is basically horrible and there are no exceptions.Okay, fine. This wouldn’t be much of a newsletter if there wasn’t one exception.Here it is. The only zucchini recipe I can get behind is one in which halved zucchini is thrown onto a grill, allowed to blacken and char, and then torn asunder and tossed with vinegary onions, hot Calabrian chiles, and cooling mint.It’s extreme makeover: zucchini edition.Why is this one good and everything else is bad? Let’s look at the facts: The cooking process undoes all the unappealing things zucchini always has to offer. The charring ekes out any inherent sweetness and cloaks it in a fierce smokey eye. The heat slightly dehydrates the flesh, throwing off some of all that excess water, and helps the flesh morph from watery planks into a custardy, pudding-like texture.Zucchini aside, it’s the accompaniments that make the dish. Fiercely spicy Calabrian chiles, refreshing mint, pickled onions—they’d be good with anything. You could use the same base method with small eggplant or small scrubbed beets and it would be fantastic. Corn cobs still in their husks. Sweet bell peppers. Halloumi cheese.Heyyyyyy… wait a minute! This zucchini recipe doesn’t even need to be made with zucchini! You could use zucchini, of course. And if you were extremely thirsty, you could drink that glass of cat water on your nightstand. It might not be great, but it probably won’t kill you. Your call!Get the recipe:Torn Zucchini with Mint and Calabrian ChilesExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Carla Lalli Music"]}