{"id": "b38f078b5514946999496f450b150fd3", "url": "https://www.bonappetit.com/recipe/strawberry-halva-shortcakes", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Strawberry-Halva Shortcakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueStrawberry-Halva ShortcakesBy Samantha SeneviratneJuly 6, 20214.7(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintStudded with chunks of sesame halva and bittersweet chocolate, these strawberry shortcakes from baker Samantha Seneviratne are delicious enough to eat all on their own, but when layered with cream and strawberries, they really shine. If fruit with chocolate isn’t your cup of tea, feel free to omit the latter.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBench Scraper$8 At AmazonPastry Brush$9 At AmazonWhisk$10 At AmazonIngredients8 ServingsBiscuits1large egg¼cup buttermilk1tsp. vanilla extract¼cup heavy cream, plus more for brushing1¾cups (219 g) all-purpose flour¼cup (50 g) granulated sugar2½tsp. baking powder½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt¼tsp. baking soda6Tbsp. chilled unsalted butter, cut into pieces4oz. sesame halva, broken into ½\"–1\" pieces3oz. bittersweet chocolate, choppedSanding sugar (for sprinkling)assembly1½lb. fresh strawberries, hulled, quartered2Tbsp. fresh lemon juice6Tbsp. granulated sugar, divided1¾cups heavy creamPreparationBiscuitsStep 1Preheat oven to 400°. Whisk egg, buttermilk, vanilla, and ¼ cup cream in a small bowl to combine. Whisk flour, granulated sugar, baking powder, salt, and baking soda in a large bowl. Using a pastry blender or your fingers, work butter into dry ingredients until mixture resembles coarse meal. Add halva and chocolate; toss to combine. Drizzle in egg mixture and stir with a fork until crumbly but incorporated.Step 2Turn out dough onto a parchment-lined baking sheet. Knead once or twice to bring together, then pat into a 6\" square. Using a bench scraper or a knife, cut into 8 equally sized rectangles; space apart. Brush tops with cream, then sprinkle with sanding sugar.Step 3Bake biscuits until golden brown and a tester inserted into the center comes out clean, 20–25 minutes.Do ahead: Biscuits can be formed (but not baked) 1 month ahead. Freeze on baking sheet until solid, then transfer to freezer bags. Bake from frozen.AssemblyStep 4While the biscuits are baking, combine strawberries, lemon juice, and 3 Tbsp. granulated sugar in a medium bowl. Let sit, tossing occasionally, until juicy and glossy, about 10 minutes.Step 5Whisk cream and remaining 3 Tbsp. granulated sugar in a chilled large bowl to medium-stiff peaks.Step 6To serve, split biscuits and spoon some whipped cream and berries over bottoms. Top with remaining biscuit halves and spoon remaining whipped cream and berries over.How would you rate Strawberry-Halva Shortcakes?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleDelicious! Excellent texture and fantastic flavor. I got a package of halwa recently and was excited to use it; I found that the flavor did come through but isn’t overly strong. Like others noticed, the dough was very wet. I added 1/4 cup flour and refrigerated them for 15 minutes before baking, but they still spread significantly and didn’t rise much. We weren’t able to cut them in half laterally like most shortcakes but instead cut them in half vertically and just stacked the two halves. I would definitely recommend lessening the liquid too to prevent that!AshMonroe, WA1/15/2022I just made the dough (which was delicious raw) and agree it was very wet and so sticky - I added more flour too - but perhaps not enough as I am not a seasoned baker and didn't want to over do it, they are currently in the freezer chilling! I hope they work out as they are a birthday request for my daughter. LydiaCharlottesville, VA8/28/2021Yes to this. Made with gluten free flour and it worked great. Batter was gooey, but I chilled in freezer for a bit and that helped. Loved this recipe - will make again!AnonymousMinneapolis, MN8/28/2021I really enjoyed this recipe! What a lovely texture :)\nI did, however, find the dough much too wet and decided not to add the full amount of egg mix to the dry ingredients so that the dough could be handled. I also decided to leave out the chocolate chips in order to make sure I could taste the halva - it worked. Delicious!AJLondon, UK8/11/2021Not sure if the halva really adds much to the shortcakes, I didn't really taste it, the whole product is very good though. The chocolate in particular added to the shortcakes is incredible but I think it also overpowers the halva. Had to add a lot more flour (like maybe 1/4 cup) than specified to get the biscuits to be able to be handled at all, they were so gooey. Will be making this again but might omit the halva since I don't think I'll miss it (though I loved the idea of it).StephLos Angeles, CA8/8/2021Explore Bon AppétitBiscuitFruit DessertDessertStrawberryBerryFruitChocolateOther IngredientsSummerBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Samantha Seneviratne"]}