{"id": "b38fdc0bdc015b79ce054ddeab200959", "url": "https://www.bonappetit.com/recipe/grilled-yu-choy-with-sate-oil", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Grilled Yu Choy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueGrilled Yu Choy with Sate OilBy Tom CunananMay 21, 20195.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris Morocco and Tom Cunanan, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintIf you can't find yu choy, a slightly bitter green in the brassica family that's often available at Asian markets, don't be discouraged: The fiery sate oil complements any grilled vegetable. You can thank Tom Cunanan of Bad Saint in D.C. for this one.Ingredients8 servingsSate Oil2heads of garlic, cloves separated, finely chopped2shallots, finely chopped14\" piece ginger, peeled, finely chopped4tsp. kosher salt2½cups vegetable oil, divided½cup crushed red pepper flakes2dried shiitake mushrooms (optional)¼cup sugarAssemblyVegetable oil8cups yu choy or halved baby bok choy or 3 bunches broccolini, trimmedKosher saltSpecial EquipmentA spice mill or mortar and pestle (optional)PreparationSate OilStep 1Bring garlic, shallots, ginger, salt, and 2 cups oil to a simmer in a medium saucepan over medium heat. Reduce heat to low and simmer gently until aromatics are softened, 8–10 minutes. Add red pepper flakes and cook, adjusting heat as needed to maintain a bare simmer and stirring occasionally, until oil is very deep red and aromatics are very lightly browned, 45–60 minutes.Step 2Meanwhile, grind mushrooms, if using, in spice mill or with mortar and pestle to a powder.Step 3Remove sate oil from heat; stir in sugar, mushroom powder, and remaining ½ cup oil (this will help cool it down). Let cool slightly before using.Step 4Do Ahead: Sate oil can be made 2 months ahead. Transfer to an airtight container; cover and chill.AssemblyStep 5Prepare a grill for medium-high heat; oil grate. Place yu choy on a rimmed baking sheet. Drizzle with vegetable oil, season with salt, and toss to coat. Grill, turning occasionally, until lightly browned and crisp-tender, about 4 minutes. Transfer to a platter; drizzle with sate oil, including the crispy bits.How would you rate Grilled Yu Choy with Sate Oil?Leave a ReviewTell us what you thinkExplore Bon AppétitCondimentFilipinoSoutheast AsianAsianBok ChoyLeafy GreensVegetableBroccoliSummerQuickEasyWeeknight MealsSideDairy-FreeGluten-FreeNut-FreeVegetarianVeganKetoHealthyishGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Tom Cunanan"]}