{"id": "b3937f009fa37bad46a2a8db9b6889c6", "url": "https://www.bonappetit.com/story/welcome-to-basically-10x10", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Welcome to Basically 10x10! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWelcome to Basically 10x10!Ten weeks, ten recipes that will make you a better cook—promise.By Amiel StanekSeptember 7, 2018FacebookTwitterEmailFacebookTwitterEmailWant to become a better cook? The kind of kitchen wizard who has a tried-and-true arsenal of effortless, no-fail dishes up your sleeve? Well, friend, the Basically 10x10 is here for you. The idea is simple: ten essential recipes served up over the course of ten weeks via our nifty newsletter, which you can sign up for here! Just do it! It's FREE! And awesome! We promise!.Here's how it works. From September 9th until November 11th, we'll send out a Sunday newsletter featuring a new, soon-to-be-in-heavy-rotation-in-your-kitchen recipe along with a short shopping list of the ingredients that you'll need to make it. And for the next week, it'll be all about that recipe on Basically. We'll be posting Instagram Stories featuring BA staffers cooking through the dish, as well as a Wednesday Q&A with our editors where we help you troubleshoot. We'll be publishing stories that reinforce the learnings that the recipe has to offer. And, of course, we want you to cook the damn thing before the next recipe hits your inbox, take a photo of it, and post it to Instagram with the hashtag #Basically10x10 for a chance to be featured in our end-of-week Story.Say cheese!\nPhoto by Heidi's BridgeBut the real party is going down in your kitchen. Because the cool thing is that each of these recipes is built like an at-home cooking class. As we guide you step-by-step through the recipes, we'll also be calling out all of the techniques we encounter along the way that are key not just to that recipe, but all of the recipes like it that you might ever come across. We're not just going to tell you to put what seems like an outrageous amount of salt into your pasta water, or to sling a couple of tablespoons of butter into the pan right before you serve your spaghetti—we're also going to tell you why and how those steps play a part in the creation of the glossiest, most perfectly seasoned plate of restaurant-worthy pasta you've ever made in your life. So while you're building a roster of delicious, doable dishes that you'll want to cook (and eat!) on repeat, you're also gaining the skills you need to tackle a whole world of other recipes with confidence. Cool, right?So, yeah, we're going to teach you how to make a dumb-easy spaghetti pomodoro that will blow your mind. And how to roast a whole chicken so that you nail it every time, all juicy meat and browned, crackling skin. And how to make a crunchy salad with the simplest homemade yogurt ranch to replace that sad mesclun-mix-and-bottled-Italian-dressing sitch. But you're going to get a whole lot more than dinner out of it. Let's do this!What're you waiting for? Sign up for the newsletter already!Explore Bon AppétitBasically 10x10Read MorecookingExpensive Pasta Is Worth It—Here's WhyBy Alex DelanycookingThis Creamy One-Pot Pasta Is Like a Great Dinner Party in a BowlBy Jesse SparkscookingA Rent Week Tomato Sauce for August and BeyondBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-07", "author": ["Condé Nast", "Amiel Stanek"]}