{"id": "b39355097fa01cb7f04b4d9489252a35", "url": "https://www.bonappetit.com/recipe/sos-pwa-nwa-and-mayi-moulen", "year": 2021.0, "month": 1.0, "day": 4.0, "content": "Sos Pwa Nwa and Mayi Moulen Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSos Pwa Nwa and Mayi Moulen (Black Bean Sauce and Cornmeal)This deeply comforting Haitian meal consists of sos pwa nwa, black bean sauce enriched with coconut milk, served alongside mayi moulen, a creamy cornmeal porridge flavored with garlic and herbs.By Lesley EnstonJanuary 24, 20214.5(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintSos pwa nwa is a stewy Haitian black bean sauce that combines beans, coconut milk, and aromatics to create a deep velvety dish. Starting with dried, not canned, beans makes a big difference, as canned beans will never achieve that same rich texture. Sos pwa nwa is most often eaten with white rice or mayi moulen, a thick and creamy cornmeal-based dish. It’s similar to polenta but infused with much more flavor thanks to aromatics such as garlic, thyme, and parsley. Included in this recipe is a hack for less labor-intensive cornmeal: Cover it with a lid! This way you won’t have to stir as often. But when you do stir, really put your back into it—mayi moulen is thick and requires some elbow grease to ensure it doesn’t stick to the bottom of the pot. The pairing of the sos pwa nwa and mayi moulen is a deeply comforting vegan meal, perfect for cold nights. —Lesley EnstonAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLodge 7.5 Quart Enameled Cast Iron Dutch Oven$90 At AmazonImmersion Blender$100 At Amazon8-Inch Chef's Knife$47 At AmazonColander$11 At AmazonLarge Saucepan$60 At AmazonMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketCutting Board$10 At IKEAWooden Spoon$6 At AmazonSmall Skillet$40 At AmazonLadle$8 At AmazonIngredients4 servings1cup dried black beans3Tbsp. extra-virgin olive oil, divided1small onion3scallions5garlic cloves5sprigs parsley, plus more for serving4sprigs thyme½cup unsweetened coconut milk3½tsp. Diamond Crystal or 2 tsp. Morton kosher salt, divided, plus more3whole cloves1Scotch bonnet or habanero chile1cup fine-grind cornmeal1avocadoPreparationStep 1Place 1 cup dried black beans (no need to soak) in a colander and rinse under cold running water. Combine black beans, 1 Tbsp. extra-virgin olive oil, and 5 cups water in a large saucepan or small pot. Bring to boil over high heat and cook 15 minutes.Step 2Reduce heat to low, cover, and simmer beans, checking occasionally and adding more water if needed to keep covered, until tender but not mushy, 1½–2 hours. Squeeze a bean between your fingers to test.Step 3Meanwhile, peel and finely chop 1 small onion; set aside for mayi moulen. Thinly slice 3 scallions. Smash 5 garlic cloves with the side of chef’s knife, peel, and finely chop. Remove leaves from 5 sprigs parsley and 4 sprigs thyme and coarsely chop; discard stems.Step 4Purée most but not all of the beans in pan with an immersion blender (or, transfer about half of the beans to a regular blender and blend until mostly smooth; mix back into beans in pan).Step 5Heat 1 Tbsp. extra-virgin olive oil in a small skillet over medium. Cook scallions and a little less than half of the garlic, stirring often, until starting to brown, about 4 minutes. Scrape into beans, then add half of the parsley, half of the thyme, ½ cup unsweetened coconut milk, and 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt. Press 3 whole cloves into 1 Scotch bonnet or habanero chile (this will make them easy to find later!) and add chile to pot; bring bean mixture to a simmer. Cook, stirring occasionally, until just beginning to thicken (but don’t cook so aggressively that chile breaks open), 15–20 minutes. Sos pwa nwa should still be loose enough to spread on a plate. Thin with water if needed. Taste and season with more salt as needed. Carefully fish out and discard chile.Step 6Meanwhile, make the mayi moulen: Heat remaining 1 Tbsp. extra-virgin olive oil in a Dutch oven over medium. Cook reserved onion and remaining garlic, stirring often, until starting to turn golden brown, about 4 minutes. Add 4 cups water and bring to a boil.Step 7Whisking constantly, gradually sprinkle in 1 cup cornmeal, then add remaining thyme, remaining parsley, and remaining 1½ tsp. Diamond Crystal or ¾ tsp. Morton kosher salt. Cook, stirring constantly, until starting to thicken, about 2 minutes. Reduce heat to low and cover pot. Cook, stirring vigorously every 5 minutes or so, until cornmeal is velvety smooth and no longer gritty, 18–25 minutes. Taste mayi moulen and season with more salt if needed.Step 8Thinly slice 1 avocado. Remove leaves from another 1–2 sprigs parsley and coarsely chop. Mound mayi moulen on plates, then ladle sos pwa nwa next to it, letting it spread. Top with avocado slices and chopped parsley.How would you rate Sos Pwa Nwa and Mayi Moulen (Black Bean Sauce and Cornmeal)?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangleI *still* really love this recipe. The Sos Pwa Nwa is now my preferred method for making black beans. I will say that most recently I couldn't find a Scotch bonnet and went with two habaneros instead and I really missed the heat and sweetness from the Scotch bonnet. I won't make that substitute next time!AnonymousLA CA5/3/2021I really loved this recipe. I am not particularly familiar with Haitian food so I followed the recipe closely (only substituting dried thyme for fresh) and found the flavors to be delicious. The textures were great to me - this felt like a warm hug in a bowl. The cornmeal ended up better than just about every way I've attempted to make polenta. Looking forward to putting this into my regular dinner rotation. AnonymousLA CA3/31/2021I garnish mine with Pikliz for texture.Derek3/2/2021I made this using 2 cans of black beans and all the liquid. The beans were very saucy, I cooked on low for close to 1.5 hours before it was thickened. If using canned black beans, I'd add only enough liquid to get them spinning in the blender easily, and wouldn't start w all the liquid from 2 cans. \nOn the whole, it was a fine meal. I found the texture to be very same. I think the avocado is unnecessary- the flavor gets lost and it doesn't add anything texture wise. I added like zest and juice to the beans and cornmeal after taking off the heat which really helped the flavors pop. Was pretty flat without it. \nI didn't measure the salt but felt like it took much more salt than the recipe called for. I would strongly advice salting to taste, not based on the measurements. Especially if it seems quite bland. \nI have leftovers still, will probably try topping with something crunchy- toasted coconut chips or thinly sliced radish, maybe even some lightly pickled carrots or onions? Or roasted salted nuts. Crush corn chips even! It really needs something to change up the texture. Anonymous2/23/2021 was super excited to try out this recipe. This was my first time trying to make Haitian cuisine. I was a bit disappointed however, because it came out pretty bland. Next time I need to add more salt, spices, and green onion. I think some butter or any type of animal fat instead of olive oil might be a good idea to add more flavor. I am curious to try an authentic version of this dish.NaomiCalifornia2/10/2021This was awesome! I couldn't find scotch bonnet or habanero so ended up using jalapeno, which was still really good but next time I will definitely use one of the former for a punchier flavour. Also used ground cloves instead of whole and honestly because of how saucy and hydrated both components of this dish are I'm inclined to use dried parsley and thyme for an even more pantry friendly meal. I am 100% adding this to my rotation.AnonymousOttawa, ON1/31/2021This looked amazing and it was even better than I thought it would be! This is pure comfort in a bowl. I made the mayi moulen with maseca because that is what I had and it was good! But probably better with cornmeal. I too made my beans in the instant pot (70 minutes & then a 30 minute natural release because I forgot about them) and agree they were probably a little saucier than if cooked on the stove. Even better as leftovers. Can't wait to make this again. AnonymousSeattle1/29/2021So delicious! I probably bastardized it a bit by making the beans in an insta pot, but I was short on time. I was also worried about all of the water in the beans, but I think it'd thicken up more with time on the stove. I left it a bit soupy, but even still am hesitant to change it. Thanks for the great recipe!More beans please1/27/2021I love a good recipe that uses ingredients I already have in the pantry. I subbed black beans for red and it still came out amazing. I did a dollop of sour cream because I was all out of Avocado and needed some fat. I almost cried actual tears it was so good. @BA more Haitian recipes please. AnonymousNew Jersey 1/27/2021Comforting, yummy meal.  I wasn't sure about the amount of liquid in the beans, it seemed like too much, but it was a sauce.  The avocado was a great addition.  I loved the trick with the cloves in the pepper.  I would make this again.AliForest Ranch, CA1/27/2021Explore Bon AppétitStewSoups and StewsHaitianCaribbeanBlack BeanBeanVegetableCornmealFlourEasyMainVegetarianVeganGluten-FreeDairy-FreeBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-24", "author": ["Condé Nast", "Lesley Enston"]}