{"id": "b3976521fa6cf4612662aec7a509a995", "url": "https://www.bonappetit.com/city-guides/new-york/venue/via-carota", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Via Carota Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkVia CarotaThe perfect excuse for ditching work and drinking negronis all day in the West VillageFacebookPinterestTwitterEmailCerruti DraimeGO HERE: for a long, lazy lunch. For dinner with people you love. For the best cacio e pepe in town. For Italian food so simple it’s transcendent. Via Carota is a neighborhood restaurant worth traveling across boroughs to at least pretend you live in that neighborhood. And for a few hours, no one will know otherwise.ORDER THE: cacio e pepe that’s the perfect ratio of pepper to bouncy noodle; insanely rich wild boar ragu with buttery but never gummy pappardelle; a negroni; another negroni; and all the vegetables from the “verdure” section you can handle but especially the roasted carrots, mushrooms, fava beans (when in season), and piselli (peas and prosciutto). For mains, you can’t go wrong with whatever the whole fish offering is, svizzerina (a hand-cut, hamburger-like steak), or the fried rabbit, but who can resist the specials? Trust in the special, which celebrates whatever is in season and leans towards decadence for the sake of decadence. That’s why we go out to dinner, isn’t it?WORD TO THE WISE: The nicer the weather, the longer the wait, especially for the limited outdoor seats. Yet, the wait is always shorter than they say. Don’t let the chaotic chalk-on-a-post system stress you out. Show up early for dinner, or prepare to camp out with a negroni. You’ll never regret calling in sick for work and scheduling a day around a rosato-soaked lunch either.THE VIBE IS: not “rustic” in the design blog sense. The reclaimed wooden floors, hutch full of china, and long marble bar work in concert to make you feel right at home—in your fantasy Italian countryside home, that is. The warm chandelier lighting makes the place glow at night in a flickering candlestick kind of way that detoxes you from a day in fluorescence. A row of two-tops by the window can make the restaurant seem cramped, but all of the bodies hum and laugh together in this beautiful communal experience we call supper. If someone accidentally bumps into your chair, say hello.PRACTICAL STUFF: Open every day, from 11:00 a.m to midnight.—Alex BeggsCerruti DraimeWE ALSO LOVELiliaA special occasion spot that changes the pasta paradigmLe CoucouA fine French meal that turns any night into a special occasionMomofuku KoHang out with chefs at David Chang’s continually groundbreaking spot in the East VillageExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-21", "author": ["Alex Beggs"]}