{"id": "b399d719a642cd8e6b5e183e1f9578b7", "url": "https://www.bonappetit.com/story/best-breakfast-taco-in-austin", "year": 2018.0, "month": 3.0, "day": 4.0, "content": "I Ate 26 Tacos to Find the Best Breakfast Taco in Austin | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Ate 26 Tacos to Find the Best Breakfast Taco in AustinFlour Tortilla. Bacon. Eggs. Potatoes. Cheese. These are the things that make or break the most portable breakfast around.By Alex DelanyMarch 27, 2018FacebookTwitterEmailPhoto by Vincent CrossFacebookTwitterEmailI would have liked to have been in Austin for the music. A show at The Continental Club, followed by some cold beers at Deep Eddy Cabaret would have been nice. Instead, I was there to eat 26 breakfast tacos in a single day. No guitars or drum sets. Just tortillas and eggs.Austin is the land of the breakfast taco, the cheap, on-the-go morning staple that Texans know and (usually) love. It’s a combination of Mexican technique and American flavor, a Mexican tortilla made with flour supplied by German immigrants, piled with ingredients familiar to cultures across the world. It is Tex-Mex in its most transportable form, and maybe something even greater. The breakfast taco is proof that diversity, adaptation, and inclusion, rather than the dogma of authenticity and segregation, inspire greatness.But what makes a great breakfast taco great? I hit 13 of the most highly-regarded breakfast taco joints in town and ordered two tacos at each spot. I ordered whatever specialty taco was recommended or well-known at the taco stand, and also a standard, consistent taco, made up of five ingredients. Here’s what I was looking for in the control taco:Hand-Painted type at Rosita al Pastor, and two breakfast tacos at Joe's Bakery\nPhoto by Alex DelanyThe TortillaThe flour tortilla is the base of every true Austin breakfast taco, and the best ones come hot off the griddle, after they’re freshly pressed. A warm tortilla keeps everything else inside the taco insulated (similar to how restaurants serve food on warm plates), and a good one should be both soft, chewy (but not gummy, like the store-bought ones), and barely crispy, with flaky, semi-translucent (Thank you, lard!) sections of the tortilla giving way to pockets of air.The EggsThere are three constants that should always exist in a scramble, whether you’re eating them out of a taco or not. Scrambled eggs should always be well-seasoned, well-whisked (fluffy, with minimal white streaks), and moist. Dry, under-seasoned scrambled eggs are a bad roommate in an apartment called Tacos.The BaconBacon should be equal parts crispy and chewy. Not one. Not the other. Both. That applies to bacon in a breakfast taco too, whether it’s chopped and incorporated into the eggs or laid down as a whole strip right on top. Every bite of the taco should have some bacon-y goodness going on.Breakfast tacos at Tamale House East, and proof that I kissed a bunch of tacos at Tyson's Tacos\nPhoto by Alex DelanyThe CheeseYou’ll most likely see shredded cheddar or Monterey Jack cheese on an Austin breakfast taco. Maybe a blend of both. Whichever you encounter, the cheese should complement, not dominate. I don’t want to swim through a giant sea of melty cheese to get to the rest of my taco (even though I would like to swim through a giant sea of melty cheese at some point in my life).The PotatoThe potato is what fills up your stomach, hands you your bag, and pats you on the back as you walk out the door (or crawl into bed, depending on your lifestyle). It tides you over until lunch. Some places chop potatoes finely. Some slice them thin. Some mash them. Whatever the technique is, the potatoes should be seasoned and cooked through. Nothing ruins a breakfast taco (or anything, really) as quickly as a bunch of bland, half-raw potatoes.Breakfast tacos and The Real Deal Holyfield at Valentina's Tex Mex BBQ\nPhoto by Vincent CrossThe Specialty Taco Winner:Valentina’s Tex Mex BBQ makes a monumental breakfast taco called the Real Deal Holyfield. It starts with a warm, perfectly-cooked, airy flour tortilla, which gets piled with smoked brisket, bacon, a fried egg, tomato-serrano salsa, beans, and potatoes. This thing is a testament to both barbecue and tacos, smoky, salty, juicy, and filling as all hell. The slice of brisket dropped on top of an already loaded taco is a co-sign[?] of excess, almost as if the folks at Valentina’s are saying, “Go ahead, tell us we can’t. We will.” And yet it still remains balanced. This taco is amazing.The Top Three Specialty Tacos:1. Valentina’s Tex Mex BBQ - The Real Deal Holyfield2. Tamale House East - Spicy Migas3. Veracruz All Natural - MigasThe welcoming face of the truck that is Rosita al Pastor\nPhoto by Vincent CrossThe Best Breakfast Taco in Austin:Rosita al Pastor served the best classic breakfast taco I ate all day. The eggs were perfectly scrambled and seasoned. The potatoes were soft and salty. The bacon was chewy and crispy. The cheddar cheese was sprinkled with care. And that tortilla, pressed and cooked in a truck parked in front of a bingo hall, was something I wanted to wrap around my body and take a nap in. This was the taco that I would go back and eat again after devouring 26. It was everything I wanted and certainly the best thing I’ve ever eaten in a strip mall parking lot. This is what I was hoping I’d find, a humble combination of ingredients that made me feel less like I was eating a taco and more like I was existing exactly where I was meant to be.The Top Three Classic Breakfast Tacos:1. Rosita al Pastor2. Joe’s Bakery3. Dai Due TaqueriaThe complete list of taco spots I visited (in no particular order):Mi Madre’sJoe’s BakeryTacodeliTorchy’sValentina’s Tex Mex BBQTamale House EastVeracruz All NaturalPueblo ViejoDai Due TaqueriaJuan in a MillionRosita al PastorEl PrimoTyson’s TacosWant the best of more regional specialties? How about Philly cheesesteaks or Chicago hot dogs?I Ate at 16 of the Best Philly Cheesesteak Spots in 12 HoursI picked a winner, and yes, I felt terrible.View StoryI Ate at 14 Different Chicago Hot Dog Joints in 1 DayAnd yeah, I had a favorite.View StoryExplore Bon AppétitTacoAustinCity GuidesBreakfastScrambled EggsPotatoCheeseBaconRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-27", "author": ["Condé Nast", "Alex Delany"]}