{"id": "b39d0b85ac59ba5e51537b98358e4006", "url": "https://www.bonappetit.com/story/im-who-i-am", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Frank Guido: “I Don’t Want to Change. I’m Who I Am” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoprestaurants“I Don’t Want to Change. I’m Who I Am”How do you keep the old customers while also courting the new? Ask 73-year-old restaurateur Frank Guido.By Jen DollApril 16, 2019FacebookTwitterEmailPhoto by Chris MottaliniFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I’m digging through my wallet for change to feed the parking meter, plunking in coins one at a time, when Frank Guido emerges from his classic red sauce joint, Frank Guido’s Little Italy, in Midtown Kingston, New York, about two hours north of New York City. There’s a bright-orange paper sign in his hand about the size of an envelope. It takes me a second to realize (1) It says FUNERAL on it, and (2) He wants to give it to me to put on my dashboard so I don’t have to pay for parking.The meters are new, he says, shaking his head as I assure him that it’s fine, it was only $3, and, wait a second, there’s a funeral happening in the restaurant right now? Not a funeral itself, he explains—it’s an after-funeral gathering; Frank Guido’s Little Italy gets about 90 percent of them in the area, he estimates. “We wish they were birthday parties, anniversary parties. But it’s part of our business…. At my age, I know all these people dying. Unfortunately, a lot of them are our customers.”There’s a kind of poetry to it, though. When your restaurant becomes a place to return to again and again, the line between family and customer starts to blur. In a morbid sort of way, having your funeral gathering at a restaurant might be the greatest compliment there is.The photo wall includes various images of Frank's large extended family... plus famous guests like Robert De Niro.\nPhoto by Chris MottaliniFrank, who turns 73 in April, opened his first business—a pizza place and bar called BG’s in Cottekill, New York—in 1968. The Guido family has owned 26 Hudson Valley restaurants since then. Right now there are three: Mariner’s Harbor nearby, run by Cousin Sal; Frank Guido’s Port of Call, in Catskill; and Little Italy, which opened in 2007 and which Mark Guido, Frank’s 44-year-old son, has recently taken over. There’s a new venture in the works, Frank tells me. He won’t say more, but he admits “the excitement is opening up and trying something new rather than doing the same thing.”Still, there’s something to be said for giving the people what they want, chugging along with the tried-and-true. In the case of Little Italy, that’s its best-selling chicken parm; the fried calamari, the “Traditional NY Style” pizza with mozzarella and Mama’s tomato sauce (Frank’s favorite), and the meatballs and gravy his grandmother used to make. People are always asking to take the sauce home. They won’t reveal the exact ingredients, Frank says, but they might pack you a 16-ounce container for later.Sure, there have been a few small changes, like a new pizza with goat cheese, pear, and arugula. But why fix what’s not broken?As we head to a quiet table in the back of the restaurant to talk, we pass framed photos of notable Italians like Tony Bennett, Yogi Berra, George Pataki, Luciano Pavarotti, and Frank Sinatra on the walls. “There's a picture of Robert De Niro, Joe Pesci, and myself, and I sent it down to Robert De Niro,” Frank tells me. “I said, ‘Sign this, Robert. And see if you can get Joe Pesci to sign it.’” He laughs at his audacity. “Can you imagine asking Robert De Niro to go get Joe’s autograph?” He said, ‘Frank, nice seeing you again, but you are on your own with Pesci.’”There are also pictures of Frank’s grandparents, who came to America from Calabria and Naples, his mom and dad, and his large extended family (he grew up with close to 100 first cousins), as well as his “paesanos”—the group who grew up together in the Italian community of East Kingston in the ’40s and ’50s. “I’ve been friends with these guys for 65, 70 years,” he says. They’re customers too.Frank’s love for the restaurant business started when he was an eight-year-old hanging out in his Uncle Chucky’s bar, where they sold drinks for a dime and hamburgers for 35 cents. When he graduated from high school, he went to Marist College, where he got a Master’s in accounting and joined the IRS. Three months later, he left to open a bar. “It was in my blood,” he tells me.Mark Guido joins us. It’s in his blood too: He has that restaurant energy—one eye on the conversation, another to whether everything is running smoothly. He updates his dad on the funeral gathering; they’ve been served, and are eating. I ask if he knows all of Frank’s stories. “Most of them,” he confesses. “I know enough to carry it on to my daughter.”Across from the family wall there are more pictures, bigger and more stylistic; they look professionally shot. “Are those family too?” I ask. “Those are stock images,” Frank says. “They are just very Italian looking.” These are new additions from Mark. “I just wanted a little different look,” he explains.Mark came into the family business after trying out a string of colleges and landing at the University of Nevada Las Vegas, known for its restaurant and hospitality programs. That’s where things started to click. Then his dad got prostate cancer. When Mark graduated, he decided to come home. Frank got better, and Mark stayed in Kingston. “I can’t imagine working for anybody else, really,” he says. “This is where my heart is.”This is a place, after all, where his best friends still live; their parents were friends, too, and so were their grandparents, who came over from Italy in 1911. “That’s how the families in East Kingston were intertwined,” Frank explains. “A hundred and eight years later, there is still a relationship.”“What’s it like to work together?” I ask them.“Well, I’m very tough,” Frank says. “But, I’ve been really deferring more to Mark. You know, I ask him, do you want me here, or do you not want me here? I’ve learned more from him than he has from me.”“We don’t see eye-to-eye on everything, of course,” Mark says. “Our manner or styles might be different, but it’s not an issue. Money doesn’t come between us or anything like that. We have never not talked.”“I defer to him, though,” Frank says.One thing that probably won't change as Frank steps back from the restaurant: the sign.\nPhoto by Chris MottaliniMark has to get back to work, and Frank has an appointment with the bank. But first I have to eat. Frank convinces me to order the “filet and tail”—sliced steak with lobster tail, which is “on special,” and pasta on the side, “so I can try the Mama’s Tomato Sauce.” I do not fight this. The dish is better than it has to be, but it’s also what I expected—it’s something very close to what my own Italian mom makes.What should a restaurant be, I wonder as I eat. It can give you new experiences and flavors, force you out of a rut. Or it can provide a sense of continuity in time and space and place. You walk in and know immediately where you are: the dark wood hues, the bottles of red table wine labeled with an image of an Italian grandma, the white linen tablecloth. It comes off as seamless, but there’s a constant balancing act at work, a striving-forward that also recognizes the connections to the past.This is what grounds a restaurant, what makes it a place people return to over and over, to commemorate births and anniversaries and even deaths. “I’ve dealt with the same bank for over 50 years, the same food vendor for 50 years, the same wine vendor,” Frank told me earlier. “I’ve been going to the same barber—probably looks like it—for 35 years. I’m an old guy. I don’t want to change, I’m who I am. My son, he’s always saying, adapt to what people want, and we gotta do this. But I said no, this is who we are. If you come, you know what to expect. I’m gonna give you pizza or I’m gonna give you chicken Parmesan, there’s gonna be enough food to take home. And Mark realizes that too. We are who we are.”Mark had agreed, nodding along. “He loves where he is from. And now, so do I. I could have gone anywhere. I stayed home.”Jen Doll is a freelance journalist and the author of the young adult novel Unclaimed Baggage as well as the memoir Save the Date: The Occasional Mortifications of a Serial Wedding Guest.Explore Bon AppétitRestaurantsItalian AmericanRed SauceNew YorkRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Jen Doll"]}