{"id": "b3a59f6774a1e2e2d26ebce7ea226c02", "url": "https://www.bonappetit.com/story/make-yourself-a-bedtime-elixir", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "A Bedtime Elixir Will Demarcate Your Working Hours From Your Playtime Hours | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Make Yourself a Bedtime Elixir It's the equivalent of leaving the office.By Maggie LangeMarch 28, 2020FacebookTwitterEmailPhoto by Ted Ted CavanaughFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Brew a drink to demarcate work time and playtime.Where are you now? In this eerie specific patch of time, it’s easier to guess than ever: You are at home and you are possibly spinning out.As an intervention, you might consider a psychic anchor of sorts, an activity and a salve, a day-divider: an Evening Bedtime Elixir. You’re gonna concoct this potion with little forethought from the jangled bounty of your current “pantry situation.” You can squeeze half-a-lemon into a mug, douse with very hot water. Throw in some thinly sliced fresh ginger if you can get it and some ginger tea if you can’t, squirt in honey or light agave, pour in some whiskey, shake in turmeric, add a spoonful of apple cider vinegar. All of these, some of these, or swap in that pricy Douglas Fir nettle tea you anxiety-bought with a little scotch and go full mountain hermit.Your potion is endlessly adaptable to your current situation, but consider both the ritual of making and drinking this potion as a Very Powerful Barrier between day and night, between work and break, routine and wildness. Yes, a gentle lavender-chamomile whatever is usually the soporific choice. But this is not a usual time! It’s an unusual time for an unusual potion.You can always make your choices—between bright and citric or soft and silky—but I have an opinion. Something acidic cuts through the noise in your head. Something sharp will straighten up the somersaulting minor panics in your neural tissue. This is a potion, which means it has to be strange, unexpected, and distracting enough to make you forget the tension headache that’s somehow migrated to your right shoulder blade.Our new days are floaty and tense at the same time, amorphous and constrained, and—no, no, enough of your day! We gotta be declarative that our day is over. This Evening Bedtime Elixir is to consume definitively. We are our own school bells, sunsets, happy hours. The Evening Bedtime Elixir is a bookend. Without bookends, we’re falling off the shelf and onto the floor and we’ve spent enough time on the floor. No more time on the floor!Maggie Lange writes for magazines mainly about music, salty food, books, curly hair, and other things she loves. She lives in Los Angeles, but she still wakes up on East Coast time.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-28", "author": ["Condé Nast", "Maggie Lange"]}