{"id": "b3bdaac0c67458ac4c2f3697405720aa", "url": "https://www.bonappetit.com/story/best-blt-recipe-technique", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Follow These Rules to Make the Best BLTs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFollow These Rules to Make the Best BLTsIn his weekly newsletter, Adam Rapoport shares how to make as many BLTs as possible before summer ends.By Adam RapoportAugust 28, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.The rules for the best BLTHow is it that we’re creeping up on Labor Day and I’ve yet to write about BLTs? I mean, seriously—seems like someone has been shirking his responsibilities.What I do know is that I’m out at the beach this week, and I intend to eat as many BLTs as possible. And here’s how I’ll be making mine (with some input from select friends and family):The BaconPhoto by Alex Lau, Food Styling by Susie TheodorouYes, I love a cast-iron skillet as much as everyone else at BA. But I’m making my BLT bacon in the oven. Wire rack, set into a sheet tray, 400°. Never not perfect. And ideal for a crowd. And by “crowd,” I’m setting the bar at two people, because who ever eats just one homemade BLT?As for the bacon itself, I’m fine with regular old supermarket bacon: crispy but not brittle. I’ll save the super thick-cut stuff for steakhouse visits.Want this letter before it hits the website? Sign up for our newsletter!LettuceOn next week’s Bon Appétit Foodcast, Amiel Stanek argues strongly for “shrettuce”—shredded iceberg lettuce, the kind you get on drive-in style smash burgers. Shrettuce provides the crisp, coolness of iceberg without the whole-leaf slippage you often get when biting down on the sandwich.Occasionally, if I’m feeling fancy—or just at some creative sandwich shop—I’m okay with peppery arugula. It stands up nicely to the bacon. But please don’t take this as a formal endorsement.TomatoPhoto by Adam RapoportWhen I go to the Gee Whiz diner near our office on a random (perhaps slightly hungover) Wednesday, and I’m absolutely jonesing for a BLT, I’m fine with a thoroughly underwhelming grocery-store variety of tomato.But this time of year, which is the only time I make BLTs at home, it’s gotta be the real deal: plump, heavy heirloom tomatoes, streaked with yellow and blood red, maybe some purple or green. And when you slice into them with your serrated knife, their clear, fragrant juices pool up on your cutting board.One thing: Don’t forget to salt your tomatoes when building your sandwich. Yes, bacon is salty, but tomatoes need their own attention. A little freshly cracked pepper never hurts, either.BreadOkay, here’s where we’re likely to disagree. Pursuits insist on white bread (toasted, obviously). And I get it—when you look up BLT in a dictionary, that’s what you’ll see. But at some point in my life (perhaps during my years at the University of California at Berkeley; go Bears!), I became a multi-grain, whole-wheat guy. I want my bread to have heft and texture.In terms of wild card varieties, I’m not mad at toasted ciabatta. It’s basically white bread, but with attitude.ExtrasYou know what’s better than a fried egg? A crispy fried egg.Alex LauMayo—mayo, mayo, mayo. Top and bottom. I ride with Hellmann’s, but when my Instagram friends down South DM me about Duke’s, I’m not one to argue. Just send me a case.And if my fancy friends want to whip up some herby, homemade aioli,, I won’t argue with them, either.Avocado? I love avocado. On pretty much everything. But a peak-season BLT shouldn’t need one. Middle of the winter? Different story.Egg. My wife loves a crispy, olive oil-fried egg on her BLT. Bite into the sandwich, and the yolks runs down the layers of bacon. Kind of genius. But when I’m making BLTs for a crowd (see above), you know what I don’t have time to do? Make crispy, olive oil-fried eggs. Sorry, Simone!Get the recipes:The Ultimate BLTBacon in the OvenHomemade AioliCrispy, Olive Oil-Fried EggsExplore Bon AppétitAdam NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-28", "author": ["Condé Nast", "Adam Rapoport"]}