{"id": "b3ca5ce12348bc79d013326e111c3993", "url": "https://www.bonappetit.com/story/dam-good-english-muffins", "year": 2021.0, "month": 3.0, "day": 5.0, "content": "Sourdough English Muffins Perfect for Breakfast Sandwiches or Anytime Snacks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDam Good English Muffins Are Just ThatFluffy, tangy, and big enough for as many eggs as I please.By Sarah JampelMarch 29, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I forgot about English muffins for, I don’t know, 20 years. But now, in my tiny corner of the world, English muffins are undergoing a miniature revival. And no offense to a particularly popular variety named after a certain Mr. Samuel Thomas, but I’m not talking about the flimsy two-biters of my youth. No, I’m talking about English muffins with more heft and flavor. Of all of the ones I love—homemade with sourdough discard (you have my permission to roll your eyes), snagged from Motzi Bread in Baltimore, or found in the freezer section of my grocery store—my very favorite is the sourdough English muffins from Dam Good English Muffins in Cortlandt, New York.Ever since my friend Ali introduced them to me, I’ve been ordering packs online and stowing them in the freezer for whenever I need a pick-me-up. What I love about these muffins is that they’re tangy thanks to the natural yeasts in the sourdough starter and the cold fermentation; they’re chewy; they’re salty; and they’re LARGE. These are the kind of English muffins that can stand up to a fully loaded breakfast sandwich. They’re sturdy enough to handle a poached egg, a muffin-size pizza, or a heavy-on-the-PB&J sandwich. (They’re also vegan, a trait I nullify as soon as I generously slather them with butter, hot from the toaster.)I recommend ordering at least three bags to start. That way, you won’t be quite as perturbed when your roommate/partner/mom asks you to share. Not that that’s ever happened to me or anything…Photo by Emma FishmanDam Good English Muffins$6 at Dam Good English Muffins$18 at Etsy – Three BagsExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-29", "author": ["Condé Nast", "Sarah Jampel"]}