{"id": "b3dcbc179b6ccd759ec617136f70fd14", "url": "https://www.bonappetit.com/recipe/mozzarella-arancini-stuffed-rice-balls", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Mozzarella Arancini (Stuffed Rice Balls) Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMozzarella Arancini (Stuffed Rice Balls)By Molly BazNovember 8, 20184.7(55)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintTo make these Sicilian cheese-filled snacks, you first have to make risotto, then use the risotto to make cheese-stuffed balls, then coat them with breadcrumbs and deep-fry them. It’s a labor of love that will make other people love you, which is reason enough to give this recipe a try.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronTuttoCalabria Crushed Calabrian Chili Peppers$10 At Snuk FoodsDeep-Fry Thermometer$29 $16 At AmazonMicroplane$16 At AmazonMedium Saucepan$39 At AmazonLadle$27 At AmazonIngredientsMakes about 14Calabrian Chile Sauce3Tbsp. chopped oil-packed Calabrian chiles from a jar2Tbsp. extra-virgin olive oil1½tsp. finely grated lemon zest2tsp. fresh lemon juice½small garlic clove, finely gratedArancini3½cups low-sodium homemade chicken stock or store-bought broth4Tbsp. unsalted butter, divided1medium onion, finely chopped2garlic cloves, thinly sliced1cup carnaroli or arborio rice1½tsp. kosher salt, plus more½cup dry white wine2oz. finely grated Parmesan (about 1 cup)¼cup heavy cream2tsp. finely grated lemon zest1Tbsp. fresh lemon juice1tsp. freshly ground black pepper, plus more3oz. low-moisture mozzarella, cut into ⅓\" pieces2cups panko (Japanese breadcrumbs)½cup all-purpose flour2large eggsCanola oil (for frying; about 6 cups)Special EquipmentA deep-fry thermometerPreparationCalabrian Chile SauceStep 1Mix chiles, oil, lemon zest, lemon juice, and garlic in a small bowl to combine.Do Ahead: Sauce can be made 12 hours ahead. Cover tightly with plastic wrap and chill.AranciniStep 2Bring stock to a simmer in a medium pot over medium heat, then keep warm over low.Step 3Heat 2 Tbsp. butter in a medium saucepan over medium. Add onion and cook, stirring often, until softened but not browned, 4–5 minutes. Add garlic and cook, stirring constantly, until softened but not browned, about 1 more minute.Step 4Stir in rice; season with 1½ tsp. salt. Cook, stirring often, until some of the grains turn translucent around the edges, about 3 minutes. Add wine and cook, stirring often, until pan is almost dry, about 2 minutes. Ladle in 1 cup warm stock, bring to a simmer, and cook, stirring often, until liquid is absorbed, about 4 minutes. Ladle in another 1 cup stock and continue to cook, stirring yet again, until most of the liquid is absorbed, 5–7 minutes. Add remaining 1½ cups stock and cook, stirring often, until rice is cooked through but toothsome and liquid is mostly absorbed, 9–11 minutes longer. Remove from heat. Stir in Parmesan, cream, lemon zest, lemon juice, 1 tsp. pepper, and remaining 2 Tbsp. butter. Season risotto with salt.Step 5Spread risotto in an even layer on a parchment-lined rimmed baking sheet. Chill at least 1 hour or up to 4 (cover risotto with plastic wrap after 1 hour so it doesn’t develop a skin).Step 6Line another rimmed baking sheet with parchment. Scoop about ¼ cup risotto into your hands and form into a patty about 2½\" in diameter (it doesn’t need to be perfect!). Place 2–3 pieces mozzarella in the center of patty. Carefully pinch and shape risotto so it completely encases the cheese, then roll into a 2\" ball. Your hands might get messy, and the balls may be slightly misshapen (they’ll firm up later). Place on prepared baking sheet. Repeat with remaining risotto and mozzarella. Freeze balls 10 minutes.Step 7Meanwhile, pulse panko in a food processor or place in a ziptop plastic bag and crush with a rolling pin until finer crumbs form. Transfer to a shallow bowl. Place flour in another shallow bowl. Lightly beat eggs in a third shallow bowl to blend; season all bowls with salt and pepper. Working one at a time, dredge balls in flour, shaking off excess. Transfer to bowl with egg and turn to coat, letting excess drip back into bowl. Coat with panko, pressing gently to adhere. Transfer to a parchment-lined rimmed baking sheet. Chill balls while you heat oil.Step 8Pour oil into a medium heavy pot fitted with thermometer to a depth of 2\". Heat over medium until thermometer registers 350°. Carefully lower half of rice balls into oil with a slotted spoon or spider and fry until deeply golden brown, 6–8 minutes. Transfer to paper towels to drain; season with salt. Repeat with remaining rice balls. Serve warm with sauce alongside.How would you rate Mozzarella Arancini (Stuffed Rice Balls)?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleI’ve made these four times. Every time they come out perfectly. Amazing recipe, although a bit time consuming….worth all the effort!\nGayle WalkerSydney 3/25/2022Made these and they are perfection. Can this recipe easily be doubled?Anonymoustoronto, on3/15/2022These came out great. The risotto is super flavorful and lemony delicious (I do like lemon). I watched the video to review the steps and that was helpful since this was my first time making arancini. I did not make the sauce, but it does sound delicious. Although they didn't come out with the traditional flavor of arancini I am used to from my family's region of Italy, these were thoroughly enjoyed. AnonymousSan Francisco, CA12/25/2021Surprisingly uncomplicated compared to the list of ingredients and steps, I believe the key is a super tasty broth which I made with kombu and pork bone which added so much umami and depth to the risotto. You could make any kind of risotto  base really, versatility is always nice. The mozarella center is winner af, this recipe is going in my repitoir. Marie Montreal8/21/2021Ok. So made again. This time I reconstituted cremini mushrooms, filtered the liquid, and used it as part of the simmering liquid. Also added some tasso that I chopped in the food processor. Added about 3 tbsp more cream. No salt, ham and parmesan enough. Absolutely amazing. Also doubled the recipe; will freeze and take out what we want as an appetizer.KayGoshen, KY USA4/22/2021We. Ate. Them. All. Granted, we ate them as a meal, not as the appetizer or side they should be. I cut down on salt just a smidge. Loved the dipping sauce. With my homemade mozzarella, just perfection.KayGoshen, KY USA4/14/2021a great recipe, i didn’t break up the panko and it was fine. i also added mushroom finely chopped and that was good. however, for me personally this was too lemony. next time i would probably do either the zest or the juice but not both. it was sort of competing with the richness instead of complementing it. i think maybe next time i might also make the balls a bit smaller too, more bite-sized. anyway, this recipe was a great one for making these my first time and the texture comes out perfectGrace Pisanoboston, ma 1/13/2021Just made these and they are absolutely delicious and worth the time!  I substituted parmesan (not a fan and didn't have) with grana padano cheese and I used smoked mozzarella.  I also used marinara instead of the recommended sauce. YUM!Tina GOntario, Canada1/1/2021These turned out perfectly! The first time we made them, we just made one batch of the risotto with the plan to make the arancini the following day ... but oh wow, it was hard not to eat the whole batch the night before. The next time, we doubled the risotto. :)\nThe risotto is a keeper recipe and the fry technique is spot on. The breading sticks and creates a perfect crunch. Changes we made: double the garlic and served with a mellow tomato sauce. They were gone in an instant!Oakland, CA10/16/2020We followed the recipe carefully, except we used Rembrandt Gouda and Truffle Pecorino for our cheeses.  It came out absolutely perfect.  This was our first time making aranchini and it was so pleasing to find it an easy process.   The Calabrian Chile Sauce was a revelation! We pressed the garlic glove, and that worked just as well.  Next time we'll try some roasted garlic. The sauce is great on sandwiches, with beef and pork too. We're kina addicted. Toronto7/31/2020This is an outstanding recipe! I made zero changes and watched the video for added help. I liked that the risotto can be made ahead of time - I actually made it the day before to help break up the steps. I used an ice cream scoop to help me form even sized balls. Having an oil thermometer is key to be able to maintain an consistent 350 degree frying oil \nWill definitely make these again. They definitely seem like they would freeze well after the breeding step so next time I’ll make a bunch to keep on hand if company comes over! AnonymousMiami FL5/3/2020Even though I ended up baking these at 180° for 30 mins (we have a no deep frying rule in my house after an *incident*), these were a HUGE hit ! I'll try and negociate lifting the deep-frying ban for next time though.\nI used an ice cream scoop to help form them, which was helpful because I have warm hands, so they never got too sticky.Isabel hello3/22/2020I made these tonight and they are to die for.  It’s a labor of love, but wow, are they good.  I followed the recipe exactly except for 2 things.  I had salted butter so I used that and added less salt later on in the recipe.  And I used only 1 cup oil to fry.  I turned the balls as they were frying so that each side got submerged and golden.  It came out amazing!  I wish there was a way to post pics to this site as evidence.  AnonymousBoston, MA1/19/2020\nI made a single batch for Christmas Eve & it was SO freaking good that I was requested to make a double batch less than a week later. We cannot get enough of these!\n\n For the second time around I did take Sophie Q’s suggestion below & added 8oz crimini mushrooms (cooked in a pan with a simple butter & thyme mixture). It definitely added even more flavor & I’ll be sure to include mushrooms each time I make this in the future! \n\nSide note: I didn’t have Calabrian chiles on hand & instead made a classic marinara alongside a pesto cream sauce. Still super tasty & delicious though. MAKE THIS!!!! Trust me, you won’t regret it. AnonymousPhoenix, AZ1/1/2020I have made this recipe twice now and loved it both times. Delicious and relatively easy to do, especially helpful with Molly's guidance in the video. The second time I made it I added small pieces of fried mushroom to my risotto and it was excellent. \n\nAlso for anyone wondering I the first time I made this recipe I prepared them around 4 days in advance and kept them in the fridge, about 15 minutes before I needed to cook them I popped them into the freezer and it was totally fine.Sophie QEngland10/12/2019Explore Bon AppétitSicilianItalianEuropeanMozzarellaCheeseRiceRice & GrainsSnackStarterNut-FreeDeep-fryChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Molly Baz"]}