{"id": "b3ee89ff785bdf4d0d94d3c6695cae35", "url": "https://www.bonappetit.com/recipe/black-sesame-mochi-cake-with-black-sesame-caramel", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Sesame Mochi Cake  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlack Sesame Mochi Cake With Black Sesame CaramelBy Sarah JampelDecember 27, 20194.8(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food styling by Yekaterina BoystovaEmailPinterestPrintEmailPinterestPrintAttention, lovers of squishy and chewy foods! This moody-glam dessert was inspired by Hawaiian butter mochi—a super simple one-bowl cake made with eggs, coconut milk, evaporated milk, butter, and, last but not least, glutinous sweet rice flour, which creates its characteristic bounce. We traded out the coconut for intense black sesame flavor and color used three ways: in the sugary pan lining, in the cake batter itself, and in the glazy caramel sauce that goes on top. Koda Farms Mochiko is our preferred brand of glutinous rice flour, but Bob’s Red Mill sweet white rice flour will also work.IngredientsMakes one 8\" or 9\" cake¼cup (½ stick) unsalted butter, melted, plus more for pan¾cup (3.6 oz.) black sesame seeds1¼cups sugar, divided2cups (254 g) glutinous sweet rice flour (preferably Koda Farms Mochiko)1tsp. baking powder1tsp. kosher salt, divided2large eggs1cup whole milk1tsp. vanilla extract½cup plus 5 Tbsp. heavy creamPinch of cream of tartarToasted white sesame seeds (for sprinkling)PreparationStep 1Place a rack in center of oven; preheat to 350°. Generously grease an 8\" or 9\" round pan with butter. Line bottom with parchment and grease parchment with butter.Step 2Toast black sesame seeds in a dry large skillet over medium heat, stirring frequently, until fragrant and just starting to crackle, 2–3 minutes. Transfer to a food processor or blender. Pulse, scraping down sides as needed, until seeds are finely chopped but haven't formed a paste. This could take as long as 2–3 minutes in a food processor, or 1–2 minutes in a high-speed blender.Step 3Scoop out ¼ cup ground sesame seeds; set aside. Add ¾ cup sugar to food processor and pulse until sugar is a uniform gray and no lumps of sesame remain. Transfer to a large bowl. Sprinkle some sesame sugar all over sides and bottom of prepared pan (as if you were flouring it). Tap pan so sesame sugar coats sides and bottom in a thin layer; this will form a crust, which will help the cake release. Tap out any excess back into bowl. Add flour, baking powder, and ½ tsp. salt to bowl and whisk to combine.Step 4Whisk eggs and ¼ cup melted butter in a medium bowl until creamy and emulsified, about 30 seconds. Whisk in milk, vanilla, and ½ cup cream. Add egg mixture to dry ingredients and stir to combine.Step 5Transfer batter to prepared pan. Bake cake until a tester inserted into the center comes out clean and cake is risen and springy with a firm golden brown crust, 45–55 minutes (the smaller your pan, the longer it will take).Step 6Run a knife or offset spatula around edge of pan. Let cake cool in pan 10 minutes before inverting onto a wire rack. Invert again onto another wire rack and let cool completely.Step 7Vigorously whisk reserved ¼ cup ground sesame seeds with remaining 5 Tbsp. cream and ½ tsp. salt in a medium bowl until smooth.Step 8Bring cream of tartar, remaining ½ cup sugar, and 3 Tbsp. water to a boil in large skillet over medium-high heat, stirring to dissolve sugar. Cook, stirring frequently, until mixture is the color of light honey, 3–4 minutes.Step 9Immediately remove caramel from heat. Vigorously whisk in cream mixture until combined. Immediately pour onto center of cooled cake and spread to the edges. Garnish circumference of cake with white sesame seeds.Photo by Laura Murray, Food styling by Yekaterina BoystovaHow would you rate Black Sesame Mochi Cake With Black Sesame Caramel?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleTo counter the previous comment labelling this as Americanized black sesame tang yuan, I’m Asian and I thought this was incredibly delicious. For those who experience their caramel seizing when poured into the cream mixture, it can most definitely be saved by microwaving the entire mixture for 20-second bursts and whisking until completely emulsified. I made these in a muffin tin to get more crispy edges. A local Japanese bakery charges $4 a pop for something similar (but not as good imo), so I’ll definitely be making these myself from now on.chechingToronto, ON11/26/2021The cake was wonderful! The soft, bouncy texture was well complemented by the black sesame. I cut back on the sugar slightly and it was still amazing. I also used a 9 inch pan and it took my oven 1 hour to fully cook the cake. Highly recommend for sesame lovers. I will be making this again :) Maybe next time with a matcha baseAnonymousLac La Biche, Alberta5/24/2021Just made this; it was DELICIOUS. I’ve had a ton of black sesame laying around since the New Year and haven’t been sure how to use it; this was a great way to let it shine. The caramel really is the unsung hero here (though that could also be because I’m a caramel fiend); the extra salt keeps it from being too sweet. My cake was flat instead of concave after cooling, and my caramel was a little too hot when I poured it over (I took the instruction of “immediately” very literally; really you should wait a minute or two before you pour it over so that it thickens up just enough to stick to the cake), so it ran down the sides and I had to frantically scoop most of it off my counter back onto the cake before it cooled, but that didn’t affect the taste, and the drips of caramel down the sides actually looked quite nice. To the commenter below who was having issues with their sugar hardening immediately when they added the cream: you probably need to let your cream sit and come to room temperature before using it. Cold cream or butter added right to hot sugar can chill the sugar to the point it hardens up immediately when you’re making caramel. Otherwise, you might have cooked your sugar a hair too long, or you might need to be whisking faster as you add the cream and sesame mixture. AnonymousGrand Rapids, MI3/12/2021This is an extremely delicious riff on Hawaiian butter mochi cake.  I made this with normal sesame seeds because that’s what I had, and canned coconut milk.  We did not find it overly sweet and caramel really enhances the whole experience.  Don’t skip it.  We can’t stop eating it.AnonymousNYC10/10/2020I grew up eating black sesame tang yuan, and I'm really underwhelmed. This tastes like an over-sweetened, over-glutinous, and overcooked version of tang yuan :/ Another instance of BA Americanizing non-Western foods to suit certain sensibilitiesAnonymous9/21/2020Loved making this super easy cake because the black sesame made for such an interesting dough! The end result is a Delicious, chewy, gooey, cake that might not look great but definitely tastes great.AnonymousMalden, MA6/7/2020If you're thinking about trying this recipe... do it! I made this without the caramel sauce and decreased the amount of sugar to 1/2 cup just because my family prefers things less sweet, and it was still amazing! The depth the black sesame provides is something else... This cake is even better the next day, and you can store this in the fridge or at room temp. Anonymous5/27/2020The cake it self isn’t too difficult but the caramel can be a little tricky. The result is super delicious!Jymoon89Philadelphia, PA4/19/2020What a gorgeous cake and  deee-licious.\nMy crust didn’t brown. Cooked in a 9” pan for 45 minutes and tester came out clean. Will cook a little longer next time.MurgieMontreal4/19/2020My jaw actually dropped at how good this cake looks, excited to bake tomorrow!jenniferkatie4/13/2020Great recipe.  Love the black sesame flavor, different textures of the crust, mochi cake, and caramel.  Got rave reviews at a party.  AnonymousSan Mateo, CA3/9/2020The brand you linked to is Koda Farms. Mochiko is the Japanese term for sweet glutinous rice flour...Anonymous1/26/2020Absolutely delicious! This recipe makes a beautifully sweet and savory mochi cake. I got a really nice crust by using a dark metal cake pan. I couldn’t quite get the caramel right so I ended up doing a matcha glaze and it was still tasty. In my opinion, the crust is the best part, so I will be making them in cupcake tins and reducing baking time! AnonymousHonolulu1/7/2020Delicious! will make this again for Chinese New Year; reminds me of niao goh cake.  However, I did not have black sesame seeds on hand and used a bag of toasted sesame seeds (just roast them a little more).  Forty minutes in the oven was good enough for me but every oven is different. Thank you for a lovely recipe!New York1/6/2020this is so, so, so good. my partner has celiac, and we’ve found that the best gluten free recipes are ones that aren’t trying to be gluten free, but are by chance. this is the perfect example of that. the texture is great, it’s not overly sweet, and it’s pretty easy to make! will definitely be making again, and again. strawbaby420portland1/6/2020Explore Bon AppétitCakeDessertGlutinous Rice FlourFlourSpringSnackGluten-FreeBakingNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-26", "author": ["Condé Nast", "Sarah Jampel"]}