{"id": "b40488f4d5722089147778f5cb2e7320", "url": "https://www.bonappetit.com/story/butter-vs-oil", "year": 2021.0, "month": 8.0, "day": 1.0, "content": "Should You Cook With Butter or Oil? Well, That Depends | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingShould You Cook With Butter or Oil? Well, That DependsChoosing the right cooking fat for the job is key. We’re here to help.By Nico AvalleAugust 2, 2021FacebookTwitterEmailPhoto by Joseph DeLeo FacebookTwitterEmailYou have a lot of options when choosing a cooking fat for a dish and each choice comes with its own unique perks and benefits. Take this recipe for Cod With Scallion-Sesame Butter, which includes not one, not two, but three fats, each with a specific purpose. There’s olive oil for searing, butter for richness, and toasted sesame oil for added warmth and flavor. “Regardless of what kind of dish I’m cooking, I’m always looking to maximize flavor from every ingredient,” says Test Kitchen director Chris Morocco, who developed the recipe. “It’s not about having an oily end product, but more about the different aromas and flavors each fat brings to the table.”By that same token, individual cooking fats also come with their own limitations—from smoking points to flavors and consistencies that may or not be welcome in a particular situation—which make choosing the right one all the more important. To help you make the right decision at home, we asked members of our Test Kitchen how they go about choosing fats when cooking. And while none of these are hard and fast rules, asking yourself these questions before reaching for a stick of butter or a bottle of oil will help set you on the best path forward.Is fat the star of the show?Fat is essential for making almost anything taste delicious (thank you, Samin Nostrat), but that doesn’t mean you always want it to be the center of attention. Unlike more fragrant fats like coconut or olive oil, neutral oils don’t bring a lot of flavor to the table on their own. Associate food editor Rachel Gurjar considers that a huge selling point when making infusions like chile crisp or oil-based pickles. In these cases, the oil is a carrier for other ingredients, so you don’t want it to steal the spotlight. “When you use something like olive oil, the fat itself is going to taste so strong,” she says, “while something like a neutral oil would simply absorb the flavors and the colors that you add instead.”In that sense, you can think of neutral oil as a blank canvas: bursting with potential, but boring as hell on its own. When a dish is fat-forward or if the ingredient list is short and simple, you want to make sure the fat you choose is something you’ll actually want to taste, whether it’s a subtle and peppery glug of extra-virgin olive oil or something as bold as toasted sesame oil. “I will almost never use neutral oil in a salad dressing because I see that as a wasted opportunity to use something more flavorful,” Chris explains.Butter is another fat that brings a lot of it’s own character to a dish. “While it’s carrying flavor, it’s imparting flavor as well,” says senior food editor Andy Baraghani. Just think of garlic and herb butter: while the aromatics and fresh greens are welcome members of the ensemble, we all know who we came here to see.How (and when) will it be served?There’s a reason we geek out over olive oil cakes and it has everything to do with saturation. “Olive oil is going to maintain its fluidity at room temperature and enhance the sense of moisture even after the cake cools,” says Chris. That’s why baked goods made with unsaturated fats like neutral oil or olive oil dry out much more slowly compared to a buttery cake, even when sitting on the counter: butter and other saturated fats like coconut oil want to solidify.The same holds for savory foods. A pat of butter added to a ribeye right before serving can be delicious while the steak is hot, but Chris points out that the perfection doesn’t last. “That’s luscious and compelling for the first 20 minutes it’s on the plate,” he says, “but maybe at 25 minutes, when the butter starts to congeal, it starts to suck.” Heat (or the lack thereof) transforms the texture of butter, and keeping that change in mind can be the difference between something that’s creamy and rich and something that’s seized up and greasy.Can it stand the heat?Just like we all have a breaking point, every oil has its smoking point. For olive and unrefined coconut oil, this occurs around the 300-350°F range. For most neutral oils, by contrast, you’re looking at temperatures well above 400°F. These are the heat ranges where extreme transformations like Maillard reactions and caramelization can take place, which makes these oils great candidates for tasks like searing steaks and other thick cuts of meat (try that in butter and the butter will burn long before your ribeye takes on a hearty sear).When whole butter hits 212°F, it’s going to transform in a completely different way. First, its moisture is going to evaporate, leaving behind just milk solids and fat, then the solids are going to begin toasting and browning, creating brown butter. “Brown butter is magical,” says Rachel, “but because it’s so flavorful, the simpler you keep it, the tastier it’s going to be.” If you’ve ever had a simple brown butter and sage sauce, you’ll know exactly what she’s talking about.How to have it allSometimes you just need the flavor of butter, but don’t want your dish to taste burnt, and that’s okay! If you brown butter before straining out the milk solids, you’ll be left with ghee, a form of clarified butter frequently used in South Asian cooking. “Even though you’re taking out the solids, there is a distinct flavor that you can taste from the butter you started with,” says Rachel while explaining why she starts with high quality butter when making ghee at home. Ghee’s smoke point is comparable to olive oil, making it perfect for blooming spices for things like chhonk and tadka.Depending on the context, mixing fats is also a great option. “If I’m cooking steak,” Rachel explains,” I will always use butter and oil from the start because I want the best of both worlds: I want butter to add the toasty, caramelly notes it gains when it browns to the steak, but I also want to keep the butter from burning.”That method works best if you’re trying to add brown butter flavor to a high-heat application, but if you want whole butter flavor without the nuttiness, Andy suggests adding it later on in the cooking process, when it won’t be cooked for long enough to remove its velvety consistency. “When I’m finishing a pasta that I’ve built with oil, the butter and the pasta water I add at the end helps the sauce that cling onto the pasta as well, so that they come together and aren’t two separate entities.”The same holds for meat and seafood as well: butter and flavorful oils like toasted sesame, which don’t hold up well to high heat, can bring a last minute punch of flavor and richness to a protein cooked in a more neutral fat. “I’d absolutely make an argument for including some kind of fat as a finishing element in a dish,” says Chris, “there’s no joy in having a pool of neutral oil on the plate, but butter can be a completely delicious addition.”Explore Bon AppétitcookingFarmers Market ChallengeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-02", "author": ["Condé Nast", "Nico Avalle"]}