{"id": "b404487f461eaed86b5fcb975724a4d6", "url": "https://www.bonappetit.com/story/bow-to-the-bowl-scraper", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "A Bowl Scraper Is An Incredibly Useful Tool For Baking and Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Bowl Scraper Can Do What Your Hands Could NEVERIt's time you had one of your own, yes?By Sarah JampelMay 1, 2020FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Sometimes when I’m observing my cats, I gloat about the structure of the human hand, with its long fingers and opposable thumbs. As I watch them bat at literally every object on every surface with their clumsy paws until the thing simply falls over, I wonder what their lives would be like if they had little hands. (Mine would be a nightmare.)But even though the human hand is an incredible thing, sometimes it’s just not the best tool for the job. Sometimes it gets in the way. Especially when cooking and baking. You’ll know this if you’ve ever tried to use your palms to shuffle a pile of minced onions into a pan and lost half to the floor, or found yourself with sticky dough glommed to every nail bed. In situations like these, you need a wide, nonstick expanse—you need a flexible plastic bowl scraper.The curved side bends to the contours of a bowl, but unlike a spatula, a bowl scraper is handle-free. Because your hand is closer to the action, you have more control (it’s like the difference between using a long broom versus a brush and dustpan), helping you to get out every last bit of sticky dough or batter. No chocolate chunk left behind. The flat side acts like a dull knife for portioning a mass of dough, dividing logs of gnocchi, or shoveling piles of prepped ingredients into bowls and pots.Bowl scrapers shine their brightest, however, in two situations: messy, buttery doughs—like when you’re making pie, biscuits, or scones—and wet, sticky bread doughs. For buttery doughs, a bowl scraper will keep your hands clean and, if you’re folding or stacking your dough, prevent bits of flour from falling all over the place. And unlike your pesky appendages, it doesn’t get too warm (that sort of temperature change can spell disaster for sensitive doughs). If you, too, have joined the legions of home bread bakers, you’ll have learned that a bowl scraper is particularly indispensable for wet bread dough: Use it to wiggle your risen dough out of the bowl without deflating it, to divide the mass into two, and to help turn your amorphous blob into a “taut round” (!).If you’re wondering about metal bench scrapers, they serve a similar function, but because they aren’t flexible, they succeed at positioning and transporting but not at scraping. If you’re only going to have one, choose the plastic.When my cats watch me using a bowl scraper to laminate galette dough or scoop cookie dough out of the mixer, are they gloating that their “clumsy paws” could accomplish a similar task? Until they learn to speak English (give ‘em a few years), I’ll never know.Ateco Bowl Scraper$3 at AmazonExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast", "Sarah Jampel"]}