{"id": "b4126cf9fac2222680d4d0164339f366", "url": "https://www.bonappetit.com/story/molly-yeh-yogurt", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Molly Yeh On All the Things She Learned About Yogurt From Writing a Cookbook About It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking8 Reasons Why Molly Yeh Loves Yogurt More Than LIFEMolly Yeh cooked with yogurt every day for six months—and she's still not sick of it.By Molly YehMarch 13, 2018FacebookTwitterEmailPhoto by Chantell QuernemoenFacebookTwitterEmailYogurt has been a pantry staple of mine ever since I recovered from the sugary pink yogurt of my childhood and discovered that you can purchase unflavored yogurt in big tubs and use it as an ingredient instead of a stand-alone snack. Now, like salt, coffee, and toilet paper, yogurt is one of those things that I buy more of well before I’ve run out, to avoid ever having to go a day without it. Writing Short Stack Yogurt was some of the most fun I’ve had in the kitchen because even though I was wild about yogurt already, cooking with it every day for six months led me to discover tons of new uses and quirks about it. I went through about a million tubs of a few different varieties of yogurt, and I’m proud to say that I’m not even close to being sick of it. Here are eight of the best things I learned about yogurt from this process:Yogurt is the duct tape of dairy products.It’s an easy fix for anything that needs acidity or creaminess, a great protein option for meatless meals or if you’re just out of everything else, and it can stand in for so many other dairy products at a moment’s notice. Thin it with water to fill in for milk in a baked good, spread it on toast or whip it into a tart filling instead of cream cheese, use it as a frosting if you’re out of butter, mix it into soup instead of heavy cream, and knead it with flour for a slightly sour bread (and DGAF that you’ve killed your sourdough starter). Not all results will be equal to its original counterpart of course, but they’ll be quirky, tangy, and delicious.Eating yogurt every day really does make your belly (or at least my belly) happy.I’m not a doctor but after eating yogurt every day for half a year and not once feeling bloated (even when I was pouring chili butter all over it!), I’m starting to believe those magazine articles that claim that yogurt, with its digestive-system-regulating probiotics, are an essential part of achieving your ideal bikini bod.Yogurt + carbonation = delightfully refreshing.The first time I tasted carbonated yogurt (at Sofra, in Cambridge), I immediately recognized the smooth yet prickly sensation that is the thing I love most about the classic New York egg cream. So I got a bottle of Fox’s U-Bet chocolate syrup, played around, and brewed up a tangier egg cream that is thicker and more satisfying than its classic milk counterpart, and lighter than a milkshake. Yogurt beverages such as Persian Doogh, Turkish Ayran, and Armenian Tan have been around for centuries and today are often carbonated. I’m sorry for screwing with tradition but just try it, it’s good!French style yogurt is gonna take over some of your world, but not all of it.Halfway through my testing, Yoplait’s French-style yogurt, Oui, came onto the scene and I got so happy because for the first time since moving to my small town, I had access to this custardy rich variety. Its fierce smoothness is the answer for anyone who dislikes Greek yogurt’s tart qualities, and, of course, the cute glass or ceramic jars only make it better. The jars aren’t for show: The yogurt is cultured in there (as opposed to other styles, which are cultured in large batches then portioned into cups), revealing a sturdy texture that is most special when its unstirred. My smoldering warm take is that, as a standalone snack or base layer for desserty toppings, you need this, but as an ingredient in a larger dish, its small jars, aversion to being stirred, and lack of punchiness put it at a disadvantage. In my fridge, I always have Greek whole milk yogurt and plain whole milk yogurt, and only sometimes do I indulge in French style.Yogurt + butter = bffs.The Turkish egg dish Cilbir bowled over my tastebuds with its yogurt + chili butter combo. Until then, I was too busy drizzling my savory yogurt situations with olive oil to consider butter as an alternative, but the flavor of butter will bring your yogurt to an entirely new dimension.Yogurt powder is really fun!!I buy it on Amazon, and it’s my new favorite way of adding yogurty flavor without moisture. Dust donuts with it, add it to melted chocolate, or invent a homemade yogurty Cheeto.Thickening agents are totally fine... most of the time.Google “Greek yogurt with added thickeners” and you’ll find tons of articles telling you to stay from certain brands that thicken their yogurt not by the traditional way of simply straining out the whey, but by adding thickeners such as pectin or gelatin. Some yogurt authorities say this makes it fake, others say that there’s no legal definition of Greek yogurt, and getting that signature thick texture with thickeners is perfectly fine and yields a less expensive product. I haven’t found a huge difference flavor-wise, and a pectiny Greek yogurt is available five minutes from my house as opposed to the hour round trip that it’d take to get traditional Greek, so I buy it. The only time you should stay away from added thickeners is in baked goods, when the thickener could alter the chemistry of the recipe and affect the end result. For non-baking recipes though, it’s up to you.Yogurt lasts for forever.When you’re trying to determine whether you’re yogurt is expired, just go by smell. The current record holder in my fridge is half a tub of plain yogurt that was supposed to expire four months ago. 4!!!Buy Yogurt (Short Stack) by Molly Yeh on Amazon, $10 or on Short Stack, $14.Cook with yogurt right now:Spiced Dal with Fluffy Rice and Salted YogurtIn this dish, lentils get a double dose of tartness from lime-marinated red onion and a drizzle of tangy yogurt.View RecipeExplore Bon AppétitHealthyishYogurtGreek YogurtCookbooksRead MoreLifestyle10 Yogurts We're Very Into Right NowGallery10 SlidesBy Leah MenniesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-13", "author": ["Condé Nast", "Molly Yeh"]}