{"id": "b41c020ccc9d546683e8025e1bfff85c", "url": "https://www.bonappetit.com/story/how-to-make-applesauce-1", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "How To Make Applesauce At Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhen You're Buried In Apples, Homemade Applesauce Is The Only Reasonable PlanIt's not just for babies, okay?By Sarah JampelNovember 6, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food styling by Pearl Jones FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we make with our eyes closed.The most obvious part of apple-picking is the part I always seem to forget, and that’s the sheer number of apples I end up taking home. After spending an hour or two getting to the orchard, I want to spend at least that amount of time wandering through the rows of trees and grabbing a few of each variety. Before I know it, my totes are drooping under the weight and I’m schlepping 22 pounds of apples from Baltimore to Brooklyn on the Bolt bus.When my fridge is full to the brim of apples and I’ve had enough cake and crumble bars, I make applesauce. It’s surprisingly quick, extremely flexible, pretty healthy (or at least, very acceptable to eat for breakfast), and good for freezing. You don’t even have to chew it—how’s that for l-i-v-i-n-g?Here’s how I do it: For the most exciting color, texture, and flavor, I like to use a mix of apples. Some with green skin, some with red. Some that are tart and crisp, others that are soft and sweet. They don’t have to be perfect-looking specimens, so feel free to hit up the seconds at the farmers market if that’s an option for you. Four pounds of apples will make around 6 cups of sauce.Start by rinsing your apples. Now comes the question of peeling: If you don’t mind the texture of the skin, don’t bother. If you want a super-smooth sauce, peel. (FWIW, I prefer to leave the peels on for texture, flavor, color, and to reduce food waste.) Core the apples, removing any seeds and stems, then cut them into large chunks.Carla Lalli Music's dreamy applesauce gets its rosy glow from apple skins.\nAlex LauNext, dump them in a big pot and pour in water (better: a combination of water and apple cider) to reach a quarter-way up the fruit. Throw in a cinnamon stick or two, a peel of lemon, and—if you have it—the seeds of a vanilla bean (if you want to use vanilla extract, that comes at the end). You could also add a small knob of peeled and crushed ginger, if that’s your thing.Bring the water to a simmer over medium heat, then reduce heat to low, cover, and cook until the apples are soft enough to mash, 40 to 45 minutes. Check periodically to stir and add more water (or cider) by the tablespoonful if things start to look dry.Now it’s time to turn those apples into sauce! First, pluck out cinnamon sticks, lemon peel, vanilla bean pod, and any other accessories. Options abound:Mash with a potato masher (or sturdy spoon). Creates something more like a compote. Chunk City.If you have a food mill, which presses a mixture through grates, leaving anything tough behind—now’s the first (and only?) time you’ll use it this year. Smooth as your skin pre-puberty.Or press the mixture through a fine mesh strainer, which achieves the same end as the food mill but takes a lot more time.Last option: You can break out the food processor or blender and let ‘er rip. If it’s still not as smooth as you want, send it through the strainer.Once your apples are sauce, check in and adjust. If your mixture is too liquidy, cook it for a few more minutes on low heat until it’s the desired consistency. Make sure to taste it at this point, too: If it’s not sweet enough, add some sugar and cook until dissolved. Season with lemon juice, salt, vanilla extract, a splash/glug of bourbon, or ground cinnamon. Heck, last time I made applesauce I added a splash of apple cider vinegar for extra zing. Call me a creative.As rustic as it gets: peels on and mashed by hand. \nPhoto by Laura Murray, Food Styling by Mariana VelasquezJust like that, you’ve transformed the apples clogging up your fridge to a quart or two of applesauce. As for what to do with that applesauce, well, you’re on your own, kid.Kidding! Mix it into oatmeal, spoon it over yogurt, bake it into a cake, or feed it to a baby (with permission from a pediatrician, of course). Before you know it you’ll be out of apples—and running back to “the orchard”—er, grocery store—for more.For the rest of 'em:Suspiciously Cheesy Apple Crumb BarsIncorporating Cheez-Its into the dough results in a toasty, buttery flavor that your friends will be able to identify as deliciousness, but not necessarily as cheesiness. (Trust us, we did a blind taste-test!)View RecipeExplore Bon AppétitAppleIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-06", "author": ["Condé Nast", "Sarah Jampel"]}