{"id": "b42b12c0def628c147b5bbba804a185d", "url": "https://www.bonappetit.com/story/rose-wellness-ingredient", "year": 2018.0, "month": 9.0, "day": 1.0, "content": "Why Rose Products Are Everywhere in the Wellness World Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleRose Is the Wellness Ingredient in Everything Right NowA rose is a rose is a hydrating facial mist.By Neha KulshSeptember 4, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailUnlike other holistic buzzwords (looking at you, ashwagandha), rose is an ingredient we all think we know. Name-checked by Shakespeare, it's in our gardens, on plastic thank you bags, in emoji-form on the Democratic Socialists of America Twitter page. But now, just when you thought you were up to speed, it’s found its way into our skincare. Salma Hayek never cleanses in the morning, but she does spritz rosewater. Blogger-beauty-mogul Huda Kattan, purveyor of the cult-favorite eyeshadow palette, swears by its anti-inflammatory properties. Miranda Kerr was such an evangelist of rosewater she created her own. So how did rose become the next superstar, and is it really good for us?First, some background. Rose comes in many incarnations (more on that later), but rosewater has long been a staple in culinary traditions influenced by the ancient Islamic Empire like North Africa, India, and the Middle East. The process of creating rosewater dates back to the Middle Ages, when chemists distilled petals with steam to make water.\"Rose holds a very special place in our culture,” explains Nasim Alikhani, owner of Persian restaurant Sofreh in Brooklyn, who was raised near Isfahan, a city famous for its fragrant rose bloom. “When I was growing up, we would have this intoxicating scent of rosewater in every home—in the neighbor’s house, even the store,” she says. Today, she uses the floral essence to perfume her entire dessert menu, like a spice-kissed rose custard that comes together in 15 minutes tops, with cardamom and rice flour.For Alikhani, roses were always about skincare too. “My mother and my aunts used to use rosewater to cleanse their faces every day,” she remembers. “When you go and see your mother or your grandmother, or your aunt, people you love, and that’s the first thing you smell as a child, it’s just so deep,” explains Nasim. “Rosewater is the faces of all the ladies I loved in my family,” she says.Stories and Objects' rose water wins over even the biggest skeptics.\nNow rose-based products like rosewater, rose oil, and rosehip oil (more on the distinctions later) are becoming a mainstream beauty trend. In a world of makeup you can’t see and perfumes you can’t smell, a barely-there mist is a sign of the times. According to research and consulting firm Kline, rose products are on the up-and-up. Sixteen rose products cracked the top 100 ranking for facial toners in March 2018 compared to 11 just a few months before. What started as a longtime word-of-mouth staple among models, makeup artists, and Martha Stewart has inspired a shade of lipstick and cropped up in exfoliators, hair oils, and toothpaste.If rosewater feels like a pleasing puff of vapor, rose oil and rosehip oil go one step further, delivering hard-hitting skin care benefits. Insights from Google Beauty Trends, the extensive ranking of skincare searches, revealed rose hip oil grew 9% in 2017 from the previous year, especially as an ingredient to treat scars.As with so many up-and-coming skincare ingredients, there’s a lot of buzz worth getting straight. According to board-certified dermatologist Sejal Shah, “Rose oil is extracted from the petals of roses that most of us are familiar with, commonly rosa damascena or rosa centifolia.” Rosehip oil, or rosehip seed oil, “is derived from the seeds of a specific wild rose plant predominantly found in Chile or the Southern Andean Mountains,” she explains.Both rose and rosehip oils provide the glowy skin benefits we’re after. “Rosehip oil contains antioxidants, vitamins (in particular vitamins A and C), and essential fatty acids that can brighten skin, even skin tone, and improve signs of aging,” says Dr. Shah. Rosehip oil comes in a range of price points, like this no-scent version from the Ordinary and a certified organic option from Trilogy, both cold-pressed.For a more concentrated alternative, rose oil, a type of essential oil, is your best bet. “Rose oil contains antioxidants, vitamins, minerals, and antibacterial agents. It can be used to soothe skin, calm inflammation, rejuvenate and hydrate,” Dr. Shah says. While these ingredients are generally tolerated by most skin types, they’re very potent. Dr. Shah recommends introducing products into any routine with caution, especially undiluted rose oil. For rose straight-from-the-source like Rose Absolute from Mountain Rose Herbs, she recommends a 2% dilution for adults, or \"two drops of undiluted essential oil in five milliliters of a carrier oil.\" If you're looking to steer clear of vials and measurements altogether, plenty of formulas dilute rose with other ingredients, like this brightening oil from Korres infused with Vitamin C.Buy them all:Isle of Roses Hair Oil, $65Herbivore Coco Rose Body Polish, $36Stories and Objects Persian Rose Water, $25Land of Women Absolute Rose Balm, $58Lebon Sweet Extravagance Organic Toothpaste, $22All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishNatural BeautyRoseRose WaterShoppingTrendsRead MoreLifestyleAn All-Natural At-Home Face Mask Recipe That's Designed to Be Messed WithBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-04", "author": ["Condé Nast", "Neha Kulsh"]}