{"id": "b43e5c360ebf669e082bdb9eedf22c20", "url": "https://www.bonappetit.com/recipe/tahini-linzer-torte-bars", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Tahini Linzer Torte Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueTahini Linzer Torte BarsBy Sarah JampelDecember 1, 20203.9(39)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Sue LiEmailPinterestPrintEmailPinterestPrint“The cookies of my childhood were always store-bought (Chips Ahoy, SnackWell’s, Oreos), always reduced-fat (the ’90s, baby!), and, when I could manage it, traded for something better in the school cafeteria,” says Sarah Jampel. “This recipe is equally inspired by the poor guy I could never foist off—Mr. Fig Newton—and a much more elegant jam-filled dessert, the linzer torte. Here I swapped out the ground nuts of a classic linzer for tahini, yielding a rich, buttery crust. It’s filled with jam, topped with more dough, and cut into big, unbreakable bars. One of these would’ve gotten me at least a couple packs of Dunkaroos back in the day—if I felt compelled to trade at all.” Unlike a truly woven lattice, this fake version uses strips of dough simply laid on top of each other. Don’t worry if they break—just press them back together and they will fuse as they bake.IngredientsMakes 12¾cup (1½ sticks) unsalted butter, room temperature, plus more for pan3cups (375 g) all-purpose flour¾tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. baking powder¾tsp. ground cinnamon¼tsp. ground cardamom2large eggs1cup (200 grams) granulated sugar⅔cup high-quality tahini, stirred well1tsp. vanilla extractSesame seeds (for sprinkling)1¼cups jam of choiceRaw sugar (for sprinkling)PreparationStep 1Lightly butter a 13x9\" baking dish, then line with a sheet of parchment paper, leaving overhang on long sides. Lightly butter parchment. Whisk flour, salt, baking powder, cinnamon, and cardamom in a medium bowl.Step 2Separate yolk from 1 egg over a small bowl to catch egg white. Place yolk in another small bowl; set egg white aside for brushing dough. Using an electric mixer on medium-high speed, beat granulated sugar, tahini, and 1½ sticks butter in a large bowl, scraping down sides of bowl as needed, until light and fluffy, about 3 minutes. Add vanilla, egg yolk, and remaining egg and beat just to combine. Scrape down sides of bowl, add dry ingredients, and mix on low speed until just combined. Scrape half of dough into prepared pan. Using your fingers, press into pan in an even layer, going 1\" up the sides; chill.Step 3Place remaining dough on a sheet of parchment paper and pat into a square. Place another sheet of parchment paper on top and roll into a 13x9\" rectangle. Remove top sheet of parchment and generously sprinkle dough with sesame seeds. Replace parchment and press dough gently with rolling pin to help seeds stick. Remove parchment and cut dough lengthwise into ¾\"-wide strips (don’t pull them apart; dough will be very fragile). Slide onto a baking sheet and freeze until solid, about 2 hours.Step 4Place a rack in middle of oven; preheat to 350°. Spread jam evenly over dough in pan. Lightly beat reserved egg white with a fork, then brush all over frozen strips of dough. Retrace cuts to make sure strips are separated, then lay lengthwise over filling (spacing them about ½\" apart works well). Cut remaining strips in half and place crosswise on top of strips, pressing into edge of bottom crust (you may not use all of the strips).Step 5Brush lattice once more with egg white and sprinkle generously with raw sugar. Bake until crust is deeply browned all over and jam is bubbling in places, 40–45 minutes. Let linzer torte cool in pan, then use parchment to lift out onto a cutting board and slice into 12 squares.How would you rate Tahini Linzer Torte Bars?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleThere is absolutely not enough fat in this recipe for it to work. No wondering it's a failure for so many reviewers. \n\nMaida Hatter's linzer torte has a pound's worth of ground nuts and 2 1/2 sticks of butter for the same amount (3 cups of flour). This needs almost double the amount of tahini and another stick of butter in order for it to work. \n\nThankfully I know how to make proper linzer torte and could fix this. Looks like many people were not. MattDE8/21/2021I wish I'd read the negative reviews first. These were not good. Not a disaster -- technically, the recipe \"works\" – but the flavor is very hollow and sweet and the textures don't gel. I made these as a gift but I will be putting them in the community donation fridge instead and making something else. A wasted expense on great tahini and jam...I'd like that $25 back.\n\nOddly, I tried to rate these one star and the BA website won't let me select anything but 5.DisappointedBrooklyn, NY4/25/2021The person from Honolulu found the issue with these cookies, and I believe the editors incorrectly updated the web version. The magazine version does list 1.5 STICKS of butter in the ingredients list and 1.5 CUPS in the instructions. At the time of writing this review, the web version indicates 1.5 sticks in both the ingredients and the instructions. I’m guessing 1.5 cups was correct - these came out incredibly dry with 1.5 sticks - basically more like a crumb topping, though it did eventually sort of come together. I’m going to try it again with more butter. They’re tasty though, as long as you use good tahini. If you use that Joyva roasted tahini crap that comes in a can at the supermarket, they’ll probably also taste like crap. I used Soom tahini. Also felt like it needed more cardamom - I used closer to 3/4 teaspoon. I also didn’t have enough dough to go 1 inch up the sides, but it doesn’t matter if you use a thicker spreadable fruit butter. DanielaPhiladelphia, PA3/2/2021I really wanted to like these as I prefer complex flavors. But they ended up being a waste of quality raspberry jam and tahini. I wish I had halved the recipe as I will definitely NOT be gifting these to anyone. (I threw a few in my freezer for breakfast options, and pitched the rest. No-one in my family liked them, and we rarely agree on anything.) The sweet and salty moon pies in this issue were a hit, as were the brown butter and pistachio sables.Nancy OArlington, VA2/6/2021I used a decent quality fig jam (inspired by the fig newton comment in the headnote) and woooow these were so good! I've never made anything like this before so the lattice and gigantic strips of dough were a bit strange to work with, but it did turn out looking mostly like the picture and my parents were pretty impressed. I actually enjoyed eating these bars for breakfast the most since they weren't overly sweet!SarahNJ12/31/2020It was my first time baking Linzer Torte, so I have no pre-conceived notion about this recipe.  In fact, this recipe triggered my curiosity on the original Linzer Torte, which I'll plan to make soon. Overall, it's a good recipe.  As mentioned in the intro of the recipe, the tahini makes it nice, flaky and buttery.  I used home-made Cranberry Chutney, so it has an Indian twang to it.  I think any tart jam will go well with this pastry mix.  I would do away with the ground cardamon though because it overwhelms the tahini and if you aren't used to cardamon, the flavor could be a little off-putting.  The tart keeps well in the freezer in an air-tight container.  I would take one piece at a time, pop it in a microwave for 40 seconds and put a scoop of ice cream on top.  Yummy!\nPS.  Thumbs down for those nasty reviewers.  Don't need to be mean or rude if it doesn't work out for you.  Just be constructive and informative. NatalieCincinnati, OH12/29/2020No. These were a pain to make and not remotely worth the time. I used high-quality raspberry preserves, but that wasn’t enough to offset the thick, bland dough. Tasted like sweetened sand pies. I was going to give these as gifts, but...I’d only feed these to my sworn enemies.Minky12/25/2020so good!! used raspberry jam. love the flavors. the lattice kept falling apart on me but I gently pushed it back together once in the pan and the finished product ended up looking gorgeous. I did have leftover lattice so if your base crust seems like it needs some more dough, you can definitely take a few pinches from the lattice half.danielleChicago12/22/2020These are delicious, but there is not enough dough to make these 1” up the sides of the rimmed sheet pan and have enough for the lattice as called. Emily S.Los Angeles, CA12/14/2020Note! The recipe directions mention 1-1/2 CUPS of butter, but the ingredients list 1-1/2 STICKS. I’m going to go by the list, but it needs to be corrected! AndreaHonolulu12/13/2020These are ... really good. Followed recipe as directed except had no cardamom so used some ginger and nutmeg, and used raspberry jam. They are light, fluffy, and flavorful. They feel like extra fancy PB&J's!DianeBrooklyn12/12/2020I am afraid to waist the ingredients and not like the taste of tahini.  Is it over powering or do they taste like linzer squares should?AnonymousNJ12/7/2020I think that vegetable shortening or a vegan butter substitute would be best if you're trying to make these without dairy!Anonymous12/3/2020This looks amazing - but what would be a good dairy free/lactose free substitute for butter to mix with the tahini? Can I use veg. shortening? Or oil? \n\nAnonymousMadison, WI12/3/2020Explore Bon AppétitCookieDessertBar CookieTahiniCondiments, Sauces & PastesSnackBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Sarah Jampel"]}