{"id": "b453adaf3b4df6a1976c1ad4d4acb446", "url": "https://www.bonappetit.com/recipe/khoshaf", "year": 2020.0, "month": 10.0, "day": 3.0, "content": "Khoshaf Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueKhoshafBy Sohla El-WayllyOctober 20, 20204.0(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Susie Theodorou, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis simple refreshing drink Sohla El-Waylly often uses to break fast during Ramadan gives all kinds of holiday vibes. Though definitely not halal, spike it with a splash of liqueur (Cardamaro, Lillet, sambuca, even peach schnapps would be nice), or keep it nonalcoholic with a light honey syrup instead. This recipe is part of Sohla’s Thanksgiving-for-two-or-maybe-eight feast, see the full menu here.Ingredients6 Servings3bags chamomile tea1cup mixed dried fruit (such as apricots, figs, prunes, and/or cranberries), pits removed if needed, cut into ½\"–1\" pieces if large⅓cup honey (optional)Floral, fruit, or spiced liqueur (such as St-Germain, arak, Cardamaro, or sambuca; for serving; optional)PreparationStep 1Place tea bags and fruit in a heatproof pitcher or large measuring glass or jar and pour 4 cups boiling water over. Let sit 5 minutes. Remove tea bags, wringing them out into pitcher to get every last drop. Cover and chill at least 12 hours and up to 1 week.Step 2If using honey, mix in a small bowl with ⅓ cup hot water until dissolved. Cover and chill until ready to serve.Step 3To serve, divide fruit and tea among glasses. Sweeten with honey syrup or liqueur if desired.How would you rate Khoshaf?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleTastes delicious!! Highly recommend.AnonymousKilchberg, Switzerland12/3/2020A delicious fruity drink! As a Muslim, I think it’s perfectly fine that the recipe includes an optional alcoholic version bc its stated that it’s not obviously not halal (also, plenty of Muslims are lax about eating halal and DO drink alcohol anyway). Will make this drink again. Sasa New York11/16/2020I think you need to be more respectful of Ramadhan and not associate it with a recipe that has optional alcohol, which is antithetical, regardless of your mention that it is not halal. Ramadhan is a religious observation, and should not be mentioned/discussed in the same space as alcohol, keep them separate. WaffaEngland11/12/2020Explore Bon AppétitPitcher DrinkDrinks AllCold DrinkMiddle EasternChamomile TeaAlcohol & Other DrinksDried ApricotDried FruitFruitFallEasyDrinksDairy-FreeNut-FreeVegetarianGluten-FreeNonalcoholicThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-20", "author": ["Condé Nast", "Sohla El-Waylly"]}