{"id": "b47dfd2fee8d449327748a4f77349a40", "url": "https://www.bonappetit.com/story/yume-ga-arukara-tsuyoshi-nishioka", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Yume Ga Arukara: Behind the Man, the Myth, and the Udon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Man, The Myth, The UdonAt Yume Ga Arukara in Cambridge, MA, one of our Hot 10 winners, chef Tsuyoshi Nishioka and his protégé Tomo Shinoda specialize in cranking out perfectly chewy udon noodles and workshopping dreams.By Elyse InamineOctober 1, 2018FacebookTwitterEmailElizabeth CecilFacebookTwitterEmailIt’s a sleepy Friday afternoon at Yume Ga Arukara, a nook of a noodle shop inside the food court at Lesley College in Cambridge, MA. Jamie Guan quietly chops scallions. Tomo Shinoda rolls udon noodle dough through a hefty machine that slices each pudgy slab into thick strands. They’ll go into an intensely flavorful broth for niku [beef] udon, the one thing (yes, one thing) this restaurant cooks, which is so profoundly delicious it earned Yume Ga Arukara a place on our Hot 10 list this year. But right now it’s 4:42 p.m., 18 minutes before the restaurant opens and several months before our list is revealed. All of the sudden, a flash of yellow darts through the dining room.“Ohayo!” Tsuyoshi Nishioka yells to his cooks. “Hai!” “Hai!” They yell back, dropping everything to greet the 39-year-old udon master. Nishioka’s wearing a yellow X-Large baseball cap from the pioneering L.A. streetwear brand and a flour-flecked black shirt with his restaurant’s name and its tagline, “Because I have dreams,” on the back. His introduction to udon was at at Setouichi Seimen, a renowned udon shop in Osaka, seven years ago. He finally learned how to make it from the master there last summer.As the staff gathers around him for the pre-service meeting, he asks: “What are your goals for the year and for today?”“To finish my project this year and, tonight, to be really fast,” explains Guan, a prep cook who by day works as a furniture designer and builder.“Learn how to make udon and open my own place,” says Shinoda, a recent college grad and Yume Ga Arukara’s head chef, his thick eyebrows furrowed beneath a backwards baseball cap. Only 24 years old, Shinoda can come off as serious and soft-spoken, but he’s also eager to learn and quick to laugh. “And then, to pick up quickly tonight,” he adds.Nishioka beams and nods emphatically. “My goal for the year is to not buy any new clothes, books, or anything. My goal for today is to make the best noodles,” the chef says. “Now please stretch and touch your toes,” Nishioka instructs. It’s nine minutes till service.Nishioka is all smiles.\nPhoto by Elizabeth CecilFind Your DreamsNishioka wasn’t always a noodle head. He started off as a comedian in Kyoto and worked in restaurants to supplement his comedy career, performing solo and in a trio with friends. Then he discovered the famous chain Ramen Jiro, which invented the tonkotsu-shoyu hybrid known as the Jiro style of ramen. After he left comedy to pursue ramen, one of his trio members committed suicide. Stunned, Nishioka researched all he could about suicide and realized it was an epidemic in Japan. (It’s the leading cause of death among people between 15 to 39 years old.)“For young people, they’re afraid of failing. They think they always need to succeed, and if they fail, there is no reason to live for the future,” he explains.“That’s very bleak,” I tell him.“That’s Japan,” he responds.After trying to open his own ramen-ya in Japan, he decided to move to the U.S. in 2011 and debuted the Jiro ramen-powered Yume Wo Katare a year later, with as much intent to nurture young cooks as intent to cook excellent ramen. That’s why he picked Cambridge, abundant with students under pressure. Like his follow-up, Yume Wo Katare serves only one dish. In addition, it offers dream workshops. Yes, dream workshops.Speak Your DreamsOne afternoon, I attended a dream workshop with seven or so employees and one loyal customer. Seated at the desk-like tables crammed into Yume Wo Katare and facing each other, we went around sharing our goals in a sentence, starting with Michael Fang, an employee of the ramen-ya. “I want to be a better boyfriend from now on,” he said. Immediately, Nishioka rifled through the dozens of worksheets he’s created for the workshops and handed it to Fang to fill out on his own.Entitled “Project Analysis,” it listed a bunch of questions, asking why he’s doing this (for his girlfriend), strength and skill sets he already has (communication), and obstacles he foresees (busyness). Once Fang wrote in these answers, Nishioka pushed him with lots of not totally clear but very enthusiastic hand gestures to read the worksheet outloud to the group. “You make a good relationship with everyone,” Nishioka said to Fang after he shares. “But not your girlfriend? Why?” Fang furiously took down the firm but caring advice on his sheet.Then Nishioka went back to meticulously picking a worksheet, all neatly organized and on a display at the front of Yume Wo Katare, for each person at the workshop. “He’s like a librarian,” Shinoda whispered to me. “A dream librarian,” Sara Brande, the restaurant’s brand manager, adds.Yume Wo Katare means “Speak your dreams” and that concept is encouraged to everyone at the ramen shop, including diners: Once you finish your ramen, the staff yells a “Perfect!” (there’s nothing left), “Good job!” (some noodles and broth remaining), “Almost!” (you got a whole meal there!), or “Next time!” (well, you get the point). You can order “Share Your Dream” on the menu (for zero dollars) and, after the cooks rank your bowl-cleaning performance, a host will come over and ask if you are ready to announce your goal to everyone in the restaurant. Then, the host will turn off the music and hand over the proverbial mic to you. The dreams can be anything, from “solve global warming by reconstructing the genome DNA in plants and algae” to “visit San Francisco,” both of which have been proudly framed and hung on the restaurant wall in the past. Later on, after the workshop, Fang explains the connection between the dreams and the noodles: “If you can finish your bowl, you can achieve your dream.”The dinner shift at Yume Ga Arukara\nPhoto by Elizabeth CecilReflect On Your DreamsAfter Yume Wo Katare’s success, Nishioka opened Yume Ga Arukara in September 2017, again choosing Cambridge, but this time in a college food court. Here you don’t announce your dream, but he still grades your bowl completion.“Good job!” Nishioka and Shinoda yell in unison as the first two patrons of Yume Ga Arukara nearly finish their bowls at 5:12 p.m. Yume Ga Arukara means “because I have dreams.” It’s scrawled in blue on the wall inside the 20-something-seat restaurant, and you’re supposed to complete the sentence yourself. “The story behind it is if my kids ask me why I work so much, then I can tell them it’s because I have a dream,” Nishioka says, gesturing towards the signage.At 5:37 p.m., Nishioka downs a bowl of udon, the first of his usual four for dinner. For a solid seven minutes, he doesn’t look anywhere. “Every day it gets better, so I never get tired of it,” he says in between slurps.Shinoda checks the noodles.\nPhoto by Elizabeth CecilBy 5:53 p.m., Shinoda takes out a new blob of dough to start cutting more noodles. The restaurant usually goes through about 50 pounds of noodles on a busy day—nearly 120 after its inclusion in the Hot 10—and tonight is shaping up to be a busier one. The line wavers between 11 and 13 people at a time, forcing the three-person Yume Ga Arukara team to constantly shuffle chairs to accommodate everyone: solo regulars, students showing off their underground find to their families, dates seated side by side and awkwardly figuring out how to talk to each other. Nishioka exhales once everyone is settled in with a bowl in front of them. He seems simultaneously stressed and elated when everyone shuts up and slurps. “I’m still an entertainer,” he tells me. “I like to sit and watch customers enjoy my food.”Expand Your DreamsShortly after I visited, Nishioka moved to Japan with his family, handing off Yume Ga Arukara to Shinoda to oversee in his absence. Though it seems abrupt, it’s not a surprising for a man willing to drop everything to pursue his next big dream. There, he’s training 50 young, eager prospects on how to make Jiro ramen and open their own dream-centric ramen-yas in each of Japan’s 47 prefectures. Yume Wo Katare outposts in Okinawa and Beppu are already up and running along with dream workshops attached to each location. “Once I achieve that, I’ll come back to Boston,” he says. (However, he will be back this month to celebrate Yume Wo Katare’s sixth anniversary.)By 8:46 p.m. at Yume Ga Arukara, everything is winding down. Nishioka silently guzzles his final bowl of udon. They’ve slung about 95 bowls in the last four hours. He slides the empty bowl in front of him. A Yume Wo Katare regular, sitting with some friends at the counter, looks over and yells “Perfect!”The Hot 10: America’s Best New Restaurants in 2018The most delicious, exciting, and just plain fun places to eat in America right now.View StoryExplore Bon AppétitRestaurantsHot 10 2018Read MoreLifestyleThis Cold Udon with Grapefruit Ponzu Is the Only Thing I’ll Eat Until OctoberBy Aliza AbarbanelrestaurantsThe Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office LobbyBy Elyse InaminecookingA Ramen Recipe That's All About That Ginger Scallion SauceBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-01", "author": ["Condé Nast", "Elyse Inamine"]}