{"id": "b4842e704d2c9b3e2a836ee480dd1255", "url": "https://www.bonappetit.com/recipe/watermelon-and-snap-pea-salad", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Watermelon and Snap Pea Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueWatermelon and Snap Pea SaladBy Jessie YuChenMay 25, 20214.4(58)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintI serve this refreshing and unexpectedly savory summer salad whenever I want to make a good impression—like the time I first met my partner’s family (they still talk about it!). I love the way the sweetness of perfectly ripe melon is carried by the Taiwanese black vinegar, which delivers deep complexity and subtle fruity notes. The prep time is short and the flavors are strong, a recipe sure to hook you and whoever you serve it to.About the black vinegar: Kong Yen-brand vinegar is an iconic Taiwanese black vinegar-based condiment that’s infused with a variety of vegetables, fruits, and spices, giving it an idiosyncratic flavor. While Chinese black vinegar (such as Chinkiang brand) tastes different, it can work in a pinch, but an even better substitute would be equal parts Worcestershire sauce, rice vinegar, and orange juice. —Jessie YuChenThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.Ingredients4 Servings1garlic clove, finely chopped½cup Kong Yen or Chinkiang black vinegar2Tbsp. black sesame oil or toasted sesame oil1Tbsp. chile crisp (such as Lao Gan Ma) or Sze Daddy chili sauce2tsp. dark (aged) soy sauce (preferably Kimlan)1tsp. fish sauce½tsp. Taiwanese or Japanese groundblack sugar or dark brown sugar¼tsp. freshly ground white or black pepper3Tbsp. store-bought fried shallots, divided8oz. sugar snap peas, trimmed, thinly sliced on a diagonal¼cup thinly sliced Thai basil or mint1baby seedless watermelon (about 3 lb.), rind removed, flesh cut into 1\" pieces2tsp. toasted black and/or white sesame seedsPreparationStep 1Mix garlic, vinegar, oil, chile crisp, soy sauce, fish sauce, black sugar, white pepper, and 1 Tbsp. fried shallots in a medium bowl until sugar is dissolved.Step 2Add sugar snap peas and basil to dressing in bowl and toss to coat.Step 3Arrange watermelon on a platter or individual plates and top with sugar snap pea mixture. Drizzle any dressing remaining in bowl over. Scatter sesame seeds and remaining 2 Tbsp. fried shallots on top.How would you rate Watermelon and Snap Pea Salad?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleTruly outstanding — forwarded the recipe to my guests mid-bite! \nI agree with others that the watermelon cubes should be smaller, and I cut the snap peas larger (into 2-3 pieces), which made the presentation more visually elegant (errant bits of peas can detract from the appearance). Fresh mint is better than basil for this Asian vinaigrette in my opinion. You definitely do not need to use (should not use) all of the dressing. I used the amount you would for a salad. A pool of dressing is visually distracting and a set-up for splatters of black liquid, while not enhancing the flavor. If you make ahead, the dressing pulls out some of the liquid from the watermelon. Though it intensifies the flavor of the watermelon, you must use a slotted spoon to serve or else it will function as a soup, too. :-)\nThank you, BA, for featuring new taste profiles; they keep our palates tantalized, our minds curious, and our spirits soaring. Some of us have been adept in the kitchen for decades and want to continue exploring and learning new cuisines.Carol Saratoga,CA8/22/2021My husband and I LOVED this. My son hated it. We halved the recipe but still used the 3 TB of fried onions (we used the same ones as for green bean casserole). Found most of the stuff except the \"chilli crisp\" so we used Costco's sweet Chili sauce. The author probably would shudder but we loved it. BeginnerCookLisaPortland OR7/27/2021I absolutely ADORED this salad. Tracking down the Kong Yen black vinegar was an absolute must, it is truly one of the most incredible things I have ever tried. I had no problem eating the snap peas and watermelon together, but this might be easier to eat with a spoon or with chopsticks than with a fork. Highly recommended. Rita JChicago, IL7/26/2021Ok, I was pretty excited about this one, but I am sorry, I think it fell short.  Instead of the black vinegar, I might try rice vinegar.  Are the snap peas suppose to be cooked?  I tried raw, and I had to spit them out - just bought them at the store, but guess the store sold them past their prime?  The shallots helped, but unfortunately I would not make this recipe again, although I am excited to work with the asian sauces and do some tweaking.  I dunno, maybe more garlic?  I am sucker for anything with Chili crunch. If you aren't crunching - what are you doing?ErinRichmond, Va. 7/22/2021I'm torn on this one. I was really excited because I love all the things in this dish but especially watermelon and black vinegar. I was excited for the savory taste sensation I was about to experience! Ultimately though, it fell short of expectation and, I gave it 3 stars. It was interesting and pretty good but I'm not sure I would make it again. Maybe if I were going to a bbq or potluck with a bunch of adventurous eaters who would appreciate something different for being different? I mean, I love watermelon for being watermelon and I feel like this could have been made with cucumbers or tomatoes or green papaya or any number of things and tasted similarly. From a functional standpoint, I was a little confused about how to eat it. There doesn't really seem to be a way to get both watermelon and tiny pieces of snap peas in one bite. So instead what happens is you eat this as two different salads (watermelon and then tiny pieces of snap pea) and without something bigger to scoop them up with (like lettuce or something) you're left fishing around on your soupy plate for these tiny pieces of snap pea. The dressing is also more a sauce so this dish is kind of messy on your plate and in the end your left with a big bowl of pieces of snap peas and saucy dressing. Plus the leftovers keep less well than just plain watermelon would. So after all that? Meh, thumbs down, won't make again. I was really hoping for a new & improved watermelon salad to add to my repertoire but it was not to be!\n\nFor those in the Seattle area saying they can't find black vinegar: I've seen it at Ken's in greenwood and also the central market in shoreline. Probably other places also but those are the two places I shop often that I know carry it.AnonymousSeattle, WA7/12/2021This was a hit at the 4th of July block party. I’m nit even a watermelon fan, but with a ripe one, the umami in the dressing and crunch of the snap peas sealed the deal! Honestly the dressing itself is a great way to enhance whatever else you have in the way of leftovers, from tri tip to pad thai to grilled asparagus. This will be in rotation all summer!Nicole PSacramento, CA7/6/2021The combination of flavors in this salad was definitely delicious. I seem to have a slight stomach ache after eating it, but maybe I just ate too many servings. Definitely addictive.  I will say, it took me days of driving around to different stores to try to find all of the very specific, unusual ingredients, so for the first salad, it is definitely costly in time and effort. I would like to ask Jessie YuChen for suggestions on other uses for the dressing and other uses for the very specific ingredients that are now taking space in my refrigerator and pantry.Carolyn GormanShelburne, Vermont6/29/2021This was super delicious! The vinegar and spice really had that savory quality of wanting to come back for more. I fried my own shallots because they're tasty and easy but with store bought this comes together in a flash. I used mint and dark brown sugar, and Fly by Jing chili crisp. Definitely serve it on a platter or shallow dish since the sauce accumulates at the bottom. I think this would be a great side for a bbq, but we just had it as a lunch salad on a hot day. SarahBerkeley, CA6/20/2021I did not like this salad at all. I have been disappointed at the quality of the bon appetit recipes lately. I made this as an appetizer and had to throw it all. I am a long standing member so I do not understand how this recipe got to be published.AnonymousMaryland6/14/2021Beautifully colorful and perfect for summer. I used mint rather than basil. The juxtaposition of sweet to spicy is terrific! Lucky enough to have giant Asian market nearby and enjoyed browsing through it looking for the ingredients. Salad does not keep very well — it gets a bit too soggy, so eat up and enjoy!jocomoProvidence, RI6/8/2021Jessie YuChen you hit it outta the park for a grand slam! Loved that you provided the preferred brand names to help negotiate the myriad of choices at my great local Asian market (Viet-Wah). I used my garden fresh mint, brown sugar and French's crispy fried onions and served it with bbq garlic shrimp; but it would go with anything.  It's my new favorite way to eat watermelon. So surprising and wonderful. Julianne Renton Washington 6/4/2021This recipe definitely made the “will make this again” and again and again :). It’s soooo delicious specially on a hot day. The combination of the ingredients creates an irresistible fusion of flavors that explode in your mouth. AnonymousAstoria, NY6/4/2021I am going to try this recipe for a Lunch-N-Learn presentation through my work. Someone on the Lunch-N-Learn team said that maybe they will try watermelon basil instead of the Thai basil called for in the recipe. Or I might try mint instead. Good suggestions all and I will share some of your comments in the presentation...AnonymousMadison, WI6/4/2021There doesn't seem to be an avenue at BA to comment or ask questions other than through this review process.  They say want to contact us and then there is no contact information available at least that I could see except for a snail mail address in the magazine.  I think this recipe looks good as I love to try new flavor combinations but I do wish sometimes that along with a recipe there would be suggestions for what to serve with it.  That goes for many of BA's recipes as well as other's.  As to the reviewer who is frustrated by ingredients that are difficult for her to get, I can see how that would be disappointing but there are many recipes in BA as well as other food magazines that don't appeal to me or have ingredients that I can't eat.  It's impossible to please everyone. SherwoodSeattle's, WA6/1/2021Tough call.  Sounded great, good ingredients, always interesting to combine sweet with savory and umami, but didn't make the \"will make again\" list.  I wish I could be more specific.  Maybe use mint instead of basil?  God knows basil is way up there in the herb hierarchy.  The dark vinegar is a good component, as is dark soy sauce.  Anyway, I hope you love it.  I'll stick with a wedge.  Jk...PaulTexas5/31/2021Explore Bon AppétitSaladTaiwaneseEast AsianAsianWatermelonMelonFruitSugar Snap PeaPeaVegetableThai BasilBasilHerbs & SpicesSummerQuickEasyWeeknight MealsStarterSideDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Jessie Yuchen"]}