{"id": "b4886eb4f828e2c91bcee2547564e357", "url": "https://www.bonappetit.com/recipe/sticky-sweet-grilled-pork-shoulder", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Pork Shoulder with a Sticky-Sweet Glaze  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueSticky-Sweet Grilled Pork ShoulderBy James DumapitMay 22, 20185.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintBarbecue god Aaron Franklin and his team were asked to come up with a recipe using a Big Green Egg, and the result is sticky-sweet pork shoulder you’ll want to make all summer. It’s inspired by the classic Cantonese barbecued pork dish known as char siu and gloriously shellacked with a molasses glaze. Time and temperature matter for this recipe, which is why a Big Green Egg is such an awesome cooking tool. The pork should be fridge-cold when you roast it, so take it straight from the refrigerator to the grill. But we also give you instructions on how to make this with an oven + conventional grill if you don't own a BGE.Ingredients8 servingsPork2heads of garlic, cloves separated, peeled1wide 6\" piece ginger, peeled, chopped1cup hoisin sauce¾cup fish sauce⅔cup honey⅔cup Shaoxing (Chinese rice) wine½cup chili oil⅓cup oyster sauce⅓cup toasted sesame oil14–5-lb. skinless boneless pork shoulder (Boston butt)Kosher saltGlaze and Assembly¾cup (packed) dark brown sugar1Tbsp. mild-flavored (light) molassesBread-and-butter pickles, white bread, cilantro, and rinsed thinly sliced white onion (for serving)PreparationPorkStep 1Purée garlic, ginger, hoisin sauce, fish sauce, honey, wine, chili oil, oyster sauce, and sesame oil in a blender until very smooth. Place 1½ cups in a small bowl for glaze; cover and chill until ready to use. Pour remaining marinade into a 2-gal. resealable plastic bag.Step 2Place pork shoulder, fat side down, on a cutting board with a short end facing you. Holding a long sharp knife about 1\"–1½\" above cutting board, make a shallow cut along the entire length of a long side of shoulder. Continue cutting deeper into meat, lifting and unfurling with your free hand, until it lies flat (it’s better to end up with 2–3 even pieces than 1 uneven piece). Add to bag with marinade and seal, pressing out air. Work pork around inside bag to coat with marinade. Chill at least 8 hours and up to 1 day.Step 3Prepare a Big Green Egg for medium heat (with cover closed, thermometer should register 350°). Remove pork from marinade, letting excess drip off. Lightly season all over with salt. Fit grill with convection plate and set pork on top. (If you don’t have a convection plate, bank coals on one side and set pork over cooler area to avoid flare-ups.) Cover and roast pork until an instant-read thermometer inserted into the thickest part registers 140°–145°. (You can also do initial cooking in a 350° oven.) Transfer to a cutting board and let rest at least 20 minutes.Step 4Do Ahead: Pork can be roasted 2 days ahead. Let cool; cover and chill.Glaze and AssemblyStep 5Bring brown sugar, molasses, and reserved marinade to a simmer in a large saucepan; cook until reduced by one-third, 6–8 minutes (you should have about 1⅓ cups). Keep warm.Step 6Prepare a Big Green Egg for medium-high heat (or use a conventional grill). Grill pork, basting and turning with 2 pairs of tongs every minute or so, until thickly coated with glaze, lightly charred in spots, and warmed through (an instant-read thermometer inserted into the thickest part should register 130°–145°; be careful not to overcook), 6–8 minutes. Transfer to a cutting board; slice against the grain ¼\" thick. Serve with pickles, bread, cilantro, and onion.How would you rate Sticky-Sweet Grilled Pork Shoulder ?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleThis was insane. So good. I would make it again right now, still feeling like my body is 50% pork. However, I wanted to contribute some more detailed directions because I found the recipe lacking. I followed the recipe exactly except my cut of pork had a bone in it, so I removed the bone with much hacking and praying and trimmed the extra fat (leaving a moderate amount on the meat for flavor and to prevent sticking). Once I did the lengthways cut and laid it out, the meat was probably about 2 inches thick. Marinated close to a day and did the initial roasting in the oven, in a cast iron pan, uncovered. The recipe doesn’t say how long, so I googled something kind of helpful, but we ended up taking it out early and good thing we did, or it would’ve been overcooked. We roasted at 350 for about 15 minutes, then grilled for about ten minutes total (with maybe a 10-20 minute rest in between roasting and grilling). I basted liberally with the marinade, then my husband grilled it for 5, then we checked the temp and it was 130, so I basted again and we grilled it for a final 5 minutes. Served it on Japanese milk bread (a King Arthur recipe) with very thin slices of onion and pickles, drizzled with leftover marinade and sprinkled with salt at the end. I also added a sugar snap pea salad with buttermilk ranch dressing and sweet potato fries as sides. Divine! The only edit I made was to sub about a 1/4 cup chili garlic sauce and 1/4 cup grape seed oil for the chili oil, because I didn’t have any on hand. Our guests left home super happy and I felt relieved that we didn’t bomb on a new recipe with company over, haha.AnonymousOklahoma5/26/2020If you do the initial cooking in a roasting pan in the oven, should you cover it with foil or leave it uncovered?wisekarenBoston5/24/2019it is bothersome when questions are asked in comments and no one responds!Anonymous5/10/2019This looks delicious. I’m a little curious about the initial cut of the shoulder. Is it supposed to be a spiral cut or something? Or just make 1.5” slices?WerdyoAtlanta 7/15/2018I cut mine into 3 large chunks and the initial cook took roughly 45 to 50 minutes depending in the piece. Looks great!TksdadLos Angeles7/4/2018How long should the pork cook while over medium heat (the first cook)? I understand until 145F, but I'm making this for the 4th of July and would love an approximation on the cooking time.Anonymous7/4/2018Explore Bon AppétitPork ShoulderPorkMeatMolassesCondiments, Sauces & PastesEasyMainGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "James Dumapit"]}