{"id": "b495601d023e240597c786a9628f0435", "url": "https://www.bonappetit.com/story/her-first-roast-chicken", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Roast Chicken Recipe Got Me Over My Roast Chicken Fears | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Grown-Ass Woman Makes Her First Roast ChickenYeah, I'm 30 and made my first-ever roast chicken last weekend. What're you looking at?By Alex BeggsNovember 13, 2018FacebookTwitterEmailPhoto by Marcus NilssonFacebookTwitterEmailGuess what? This grown-ass, 30-year-old woman had never roasted a chicken before last weekend. I know! And I’ve never smoked a cigarette, played the lottery, run a marathon, read Jane Austen, or had a baby, either! Want to talk about it?Didn’t think so! Let’s skip ahead to the part where I make the chicken. First, I had to buy one. This was a chore I hate. Heavy-grocery shopping. Regular groceries like bags of Tostitos and blocks of store-brand cheddar are fine. Groceries that pull my reusable tote (I’M A GOOD PERSON) down on my shoulder and leave deep red marks are a reminder of my frailty. A common theme in chicken work.FOR ME, at least it is FOR ME.In the past, my domestic partner, a big tall MAN if you must know—God, you’re nosy!—handled the meat. Blah blah blah a million years of human evolution blah man cooks the meat blah blah. I KNOW. He does the laundry too. I’d sit there, all passive and weak, drinking a martini, while I let him do all the work. What was I thinking? I should be asserting myself and cooking this bitch bird MYSELF.So I got home and followed Basically’s no-fail roast chicken recipe, which calls for a 3-4 lb. chicken, a lemon, half a stick of butter, and a head of garlic. And kosher salt, duh. I unwrapped my Bell & Evans chicken (I was told this was the most ethical option to be had from my local crummy grocery store and bought it because I’M A GOOD PERSON) from its plasticky death condom and eww there was blood in there. My womanly fears of imminent chicken death set in and, after I tossed it, I washed my hands for the first of seven times. Say it with me now: YOU WILL CERTAINLY DIE OF SALMONELLA. (Editor's Note: You will probably not.) Inside the chicken there was a bag of innards, which I pitched right in the trash, where my sense of self is.I sliced the lemon and the head of garlic in half.The rubbery, fleshy chicken was dead and cold under my soft fingertips. I hated touching it. I hated submitting to it. I hated sprinkling salt into the cavity like a deranged chicken gynecologist.There’s this cool trick though, where you slice in between the chicken thigh and breast and the leg splays out. Later, you’ll slice into that space to check if the chicken is done. Really, a cool trick.Just a little slicey-slice through the skin that connects the leg and the breast.\nPhoto by Alex LauOnce the whole bird is covered in salt, into the cast iron she went, tits up, with the lemons and garlic face down. The melted butter goes all over, and I had to touch the rubbery dead flesh yet again.425°, 45 minutes.At this point, I needed to check to see if she was done. Ready for the ball, Cinderella? Thought you were a kitchen wench and now you’re a princess, did ya? Well look who’s roasting chickens now!!! Still not sure how I ended out on top here.Christ almighty it was HEAVY. I hated how heavy it was and how much this continued to remind me of my weak biceps, my inability to command a room full of people with my booming voice. My memoir is going to be called The Feminine Critique and it’ll be a blueprint of my failings. The chicken though, was golden brown beautiful. She’d made it.I sliced into that weird leg part yet again and the juices ran clean, bloodless, I was pretty sure of it. There was a lot of butter and chicken fat swimming around. Random stabbings with a Thermapen over the body gave me a range of numbers over 160°, so if anything, I’d overcooked it. $16 wasted, maybe. A life, wasted. Maybe two. But after a 15 minute rest, in which I fainted onto a chaise couch out of boredom and my weary disposition, I tore into the chicken and found her perfect. The once cold and postmortem flesh was now crispy and potato chippy.First, I ate the chicken butt in one happy bite. Then I took my knife to the breast and attempted to carve it like I’d seen on YouTube but ended up with a Lizzie Borden hack job. The stuff inside was plump and juicy. Decidedly not overcooked. The lemon and garlic created an inadvertent pan sauce. I’d squeeze a piece of soft, roasted garlic out of its papery shell and eat it with a bite of chicken. I’d stop, sigh, and look out the window, thinking about cigarettes and lottery tickets and life’s lost opportunities. I think roast chicken is this antiquated metaphor for crossing some Serious Home Cook boundary, into the domestic zone. The ability to provide for one’s self, as well as for others. I did the damn thing. And it was delicious! But I’m still the same ol’ me.How rewarding.Get the recipe:No-Fail Roast Chicken with Lemon and GarlicOnly 6 ingredients, and you'll always know when it's done.View RecipeExplore Bon AppétitBasicallyroast chickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-13", "author": ["Condé Nast", "Alex Beggs"]}