{"id": "b49a3d4aa34e02dd5ae0ab68ae4d768e", "url": "https://www.bonappetit.com/recipe/hoppin-john", "year": 2021.0, "month": 12.0, "day": 5.0, "content": "Hoppin' John Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHoppin’ JohnBy  Millie PeartreeDecember 31, 20214.5(28)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrint“When I was growing up, one of my favorite meals was black-eyed peas, simmered with pork neck bones or a ham bone left over from Sunday dinner or a holiday meal, served over rice. It wasn’t until later in life that I discovered one of my childhood favorites had a name: Hoppin’ John. As I got older I started to do some research and ask around about how this simple rice and beans dish received its infamous name. Some say the name comes from children ‘hoppin’ ’ around the dinner table; another story tells of a man named John who came ‘a-hoppin’ ’ when his wife took the dish from the stove. “Whatever you call it, the combination of stewed beans, salt-cured meat (here I use ham hock or slab bacon), and the added Cajun/Creole flair from the ‘holy trinity’ of onion, bell pepper, and celery is a quintessential Southern classic. Hoppin’ John is traditionally served on New Year’s Day with collard greens and cornbread, symbols of wealth and prosperity; a bowlful is meant to bring you good luck all year.” —Millie PeartreeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSlotted Spoon$13 $10 At AmazonMesh Sieve$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4–6 servings2Tbsp. vegetable oil (if using ham hock)1smoked ham hock or 8 oz. slab bacon, cut into ¼\" pieces1small onion, finely chopped½green bell pepper, finely chopped1celery stalk, finely chopped2garlic cloves, finely chopped1¼cups dried black-eyed peas, soaked overnight, drained1Tbsp. Cajun seasoning2tsp. dried thyme1bay leaf4cups low-sodium chicken broth or water½tsp. freshly ground black pepperKosher saltCooked long-grain rice (such as Carolina) and thinly sliced scallions (for serving)PreparationStep 1If using ham hock, heat 2 Tbsp. oil in a medium Dutch oven or other heavy pot over medium-high. If using bacon, cook in a medium Dutch oven or other heavy pot over medium-low, stirring occasionally, until bacon is crisp, 8–10 minutes. Using a slotted spoon, transfer bacon to a paper towel–lined plate. Carefully pour out all but 2 Tbsp. fat from pot.Step 2Add onion, bell pepper, and celery to pot and cook, stirring occasionally, until beginning to brown, about 5 minutes. Add garlic and cook, stirring often, until fragrant, about 1 minute.Step 3Add black-eyed peas, Cajun seasoning, dried thyme, bay leaf, and ham hock (if using), then pour in broth. Bring to a rolling boil, then reduce heat and cover pot. Simmer until peas are tender but not mushy, 1–1½ hours.Step 4Drain pea mixture in a fine-mesh sieve; discard cooking liquid and bay leaf. Return pea mixture to pot, add pepper. If using bacon, return to pot and stir to combine. If using ham hock, remove from pot and let cool slightly. Pull meat from bone and return to pot; discard bone. Taste and season with salt.Step 5Divide rice among bowls and top with a ladleful of peas. Scatter scallions over.How would you rate Hoppin’ John?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleI’ll make again. I made with bacon and didn’t think enough savory and depth of flavor infused so I’m looking forward to the ham hock version. Jenna C. Los Angles, CA3/10/2022While technically the poster is correct, for many years and most people field peas were unavailable. I am picky enough to only use Carolina Gold or Carolina Aromatic rice. I use both smoked belly and pork hocks, using them first to establish a base. I do not use bell peppers as I feel that is a Louisiana addition. Don't over cook your rice!joel pesapaneisle of palms, sc1/18/2022Field Peas are to be used in Hoppin' John--not black eyed peas. The difference is like night and day--like ice cream versus gelato. The overwhelming number of recipes that use black eyed peas would not be tolerated if you were discussing any other ethnic form of cooking, but black American southern food traditions get re-mixed and taken over without nary a backward glance.. You can make spaghetti and meatballs with ramen noodles but is it still a proper spaghetti dish? And you would find no Italian willing to besmirch their grandmother's good name by sharing said \"recipe\".\nThe Possum Hill KidBeaufort, SC1/2/2022Just like my mom made growing upDebutntYoungstown Ohio 1/2/2022Explore Bon AppétitDinnerLunchBreakfastEasyBlack-Eyed PeaBeanVegetableHamMeatRiceRice & GrainsNew Year'sSouthernAmericanSoul FoodCajun & CreoleGluten-FreeDairy-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-31", "author": ["Condé Nast", "Millie Peartree"]}