{"id": "b49c5988d80dee8d7b6a13e21a1afaa1", "url": "https://www.bonappetit.com/story/a-cyclists-guide-to-ottawas-culinary-scene", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "A Cyclist’s Guide to Ottawa’s Culinary Scene | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredA Cyclist’s Guide to Ottawa’s Culinary SceneBy Destination CanadaApril 5, 2018FacebookTwitterEmailFacebookTwitterEmailOttawa, Canada’s capital city, has 497 miles of dazzling cycling paths and lanes within the region that connect to a bounty of farmers’ markets, coffeehouses, creative cocktail bars, and can’t-miss restaurants. Set off on a striking sensory journey along its gorgeous bike paths to explore the culinary hot-spots of this urban oasis via bicycle.Cycle the CityBegin your tour in Centretown on the scenic Rideau Canal path, following along this waterway that weaves throughout Ottawa while bound for a scenic cycle around Dows Lake. Continue to the Preston Street bike path en route to breakfast at Art-Is-In Bakery. Next, it’s onward to eclectic Hintonburg for a coffee fix and to-die-for doughnuts at The Ministry of Coffee and Social Affairs and SuzyQ Doughnuts. Take a post-treat detour to check out artist John Felice Ceprano’s balanced rock sculptures in the Ottawa River, then link up with the stunning riverside bike path.Work up your appetite as you follow the Ottawa River pathway, crossing the Portage Bridge into Old Hull in Québec. Glide along the Voyageurs Pathway, taking in spectacular views of Canada’s Supreme Court and Parliament buildings, then return to Ottawa over the Alexandra Bridge and enter Major’s Hill Park to take in the lush greenery. Hit the trail once again, bound for an afternoon in the ByWard Market district—Ottawa’s hub for food, entertainment, and shopping—including a visit to the Château Lafayette and dinner at OZ Kafe. Round out your route by passing through Confederation Square and the Plaza Bridge en route to Riviera, the final destination on this lively tour of Ottawa.A view of Parliament from Major's Hill Park, Ottawa.\nFresh Baked BreakfastArt-Is-In Bakery is an edgy, character-rich gastro-bakery serving up pastries with a serious pedigree. This buzzy all-day establishment attracts loyal locals thanks to its modern atmosphere and devilishly delicious baked goods. Must-try orders include the bakery’s Kronut—a croissant and doughnut hybrid—and Dynamite baguette, available in varieties like cheddar and jalapeño and rosemary and roasted garlic. Each one of their homemade breads, sweet treats, and twist-on-a-classic dishes are dreamed up by classically trained pastry chef and co-owner Kevin Mathieson.Art-Is-In Bakery: 250 City Centre Ave., Ottawa; 613.695.1226 x 801, artisinbakery.comInventive dishes and homemade baked goods are the main event at Art-Is-In Bakery.\nCoffee TalkOttawa runs on fuel provided by indie coffee shops like The Ministry of Coffee and Social Affairs, where Nutella-infused lattes and iced coffee are must-sips. Just down the street, swing by SuzyQ Doughnuts, where the proprietor uses a traditional (and top secret) Finnish recipe for \"Sugar Munkki\" as the base for unique creations like Maple Bacon, Bloop (Blueberry Vanilla Fruit Loop), and Mango Lassi doughnuts, for which regulars line up en masse.The Ministry of Coffee and Social Affairs: 1013 Wellington St. W, Ottawa; 613.695.9002, theministryofcoffee.wixsite.com/ministrySuzyQ Doughnuts: 969 Wellington St. W, Ottawa; 613.724.2451, suzyq.caThe Ministry of Coffee and Social Affairs in Ottawa.\nSuzyQ Doughnuts offers a new twist on traditional Finnish treats.\nKeeping It LocalBike through the ByWard Market district to hear one of Canada’s most bilingual cities in action. Bustling shops, street performers, open-air produce stalls, and the central Market Square are home to over 600 unique vendors. Visit artisan cheese purveyors, butchers, and fishmongers to sample local Ottawa ingredients, or head to La Bottega Nicastro for a made-to-order sandwich on their fresh herbed focaccia, served up from their bustling back counter.ByWard Market: 55 ByWard Market Square, Ottawa; 613.562.3325, byward-market.comLa Bottega Nicastro: 64 George St., Ottawa; 613.789.7575, labottega.caThe market stalls and a freshly made sandwich at La Bottega Nicastro in Ottawa's historic ByWard Market district.\nHave a Laugh and a LagerLater, mix and mingle with a crush of locals at Saturday afternoon’s legendary foot-stomping, guitar-playing Lucky Ron Show featuring classic country tunes and lots of audience participation at the lively Château Lafayette. Ottawa’s oldest tavern and beloved original dive bar has been in action since 1849 and is an absolute institution. While many locals order a quart of Labatt 50 as they take part in this authentic cultural event, nowadays “The Laff” also offers several local craft beer options.Château Lafayette: 42 York St., Ottawa; 613.241.4747, thelaff.caA look at Château Lafayette, Ottawa’s oldest tavern.\nDine Like an InsiderCome dinnertime, wander down the cobblestone courtyard that leads to OZ Kafe for a contemporary and “veg-forward” dining experience. Industry insiders come for their signature offerings like Heirloom Tomato Salad and Brined Nagano Pork Rib Chop and stay for the late-night sets delivered by a rotating roster of resident DJs in beautifully restored stone-and-wood rooms.OZ Kafe: 10 York St., Ottawa; 613.234.0907, ozkafe.comOZ Kafe serves seasonal dishes in a rustic setting.\nA Spirited ExperienceWind down the day just a block from Confederation Square at Riviera. Here, their house cocktails—including the Smoky Old Fashioned—truly raise the bar and come crafted to order by master mixologist Stephen Flood. Tucked away on the charming Sparks Street pedestrian mall, the restaurant is housed in a former bank, inheriting its soaring 30-foot ceilings and setting the backdrop for its distinctly refined atmosphere.Riviera: 62 Sparks St., Ottawa; 613.233.6262, dineriviera.comThe Smoky Old Fashioned at Riviera.\nLocated in a former bank, Riviera is a hidden gem along Ottawa's Sparks Street Pedestrian Mall.\nAll you need is two wheels and an appetite to explore Ottawa's exciting food scene. Ready to roll? Plan your trip here.Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Destination Canada"]}