{"id": "b4a080ea3ac47ede6aa1f2925fb1bda5", "url": "https://www.bonappetit.com/recipe/chicken-salad-with-citrus-and-chile-oil", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "Chicken Salad With Citrus and Chile Oil Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2021 IssueChicken Salad With Citrus and Chile OilBy Devonn FrancisJanuary 1, 20214.8(24)Read ReviewsTriangleEmailPinterestPrintPhotography by Emma Fishman, Food Styling by Adriana Paschen, Prop Styling by Elizabeth JamieEmailPinterestPrintEmailPinterestPrintWith plenty of protein, a double punch of acid from citrus and vinegar, and a garlicky chili oil, this salad is made for dinner. While your chicken is getting toasty in the oven, make your chile crisp-inspired dressing with garlic, paprika, cracked coriander, and red pepper flakes. If you have leftovers (or want to make extra for a bit of meal prep), keep all of your ingredients separate in the fridge so that they stay fresher for longer.  This recipe is part of the 2021 Feel Good Food Plan, our eight-day dinner plan for starting the year off right.Ingredients4 servings3skin-on, bone-in chicken breasts  (about 1½ lb. total)Kosher salt, freshly ground pepper2Tbsp. plus ⅓ cup extra-virgin olive oil3garlic cloves, thinly sliced2tsp. paprika1tsp. coriander seeds, coarsely crushed½tsp. crushed red pepper flakes2medium endive, leaves separated1large head of radicchio, leaves  separated, torn if large4satsumas or blood oranges or 3 medium oranges, peeled, sliced into rounds, seeds removed2Tbsp. white wine vinegar or red wine vinegar2tsp. toasted sesame seeds, lightly crushedPreparationStep 1Preheat oven to 450°. Pat chicken breasts dry with paper towels; season on all sides with salt and pepper, then rub with 2 Tbsp. oil.Step 2Heat a large ovenproof skillet over medium-high. Arrange chicken, skin side down, in pan and cook, undisturbed, until skin is deep golden brown, about 3 minutes. Turn chicken over with tongs and transfer skillet to oven. Roast chicken until cooked all the way through, 15–17 minutes. Transfer to a cutting board and let cool 10 minutes.Step 3Meanwhile, cook garlic and remaining ⅓ cup oil in a small skillet over medium heat, stirring occasionally, until garlic is fragrant and pale golden, about 4 minutes. Immediately pour garlic oil into a small bowl and stir in paprika, coriander seeds, and red pepper flakes; season with salt.Step 4Cut chicken off the bone, then slice  ½\" thick; discard bones.Step 5Toss endive, radicchio, and satsumas with vinegar and half of spiced garlic oil in a large bowl to combine; season salad with salt and pepper.Step 6Divide salad among plates or shallow bowls; top with chicken and drizzle with more spiced garlic oil. Sprinkle sesame seeds over.How would you rate Chicken Salad With Citrus and Chile Oil?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleI left out the chicken , added thin sliced zucchini and blanched purple kale w vinegar and garlic along with the radiccio.  Combined all ingredients and topped it off w honey pecans, .Wonderful.with regular oranges!DorothySan Francisco.3/2/2021Really good. The combination of garlic, paprika and coriander has an unexpectedly delicious emergent flavor. I’ve never cooked chicken like this, but I absolutely would again. It ends up much juicier than boneless skinless chicken breast, and I also feel like it’s harder to overlook it this way. I couldn’t find endives but subbed about 1/8 of a cabbage instead. I mixed blood oranges and satsumas, and add a handful of quartered deseeded kumquats. Would recommend. AnonymousSan Francisco, CA2/9/2021I made the recipe almost as written. After the suggestions on the Tamarind Chicken to use a roasting pan in the oven, I just cooked the chicken entirely in the oven. I roasted it at 450 for 20 minutes and another five at 425. My oven seems to require a little more time than most recipes call for. Anyway, I love, love, love the flavors! We had blood oranges, which are really sweet this year. They helped the radicchio and endive. The chili oil is sublime. I will definitely use it on other things. This goes into the regular rotation!AnonymousSan Francisco, CA1/23/2021I really wanted to love this recipe. After reading the few reviews I see that other modified the recipe. I made it as the recipe states and felt it fell short. AnonymousSeattle, wa1/13/2021This is the best recipe of the bunch so far. The chicken was delicious! We made it with red cabbage and leftover collards from the chicken dish instead of radicchio and endive (it's just unbearably bitter). But the garlic oil and everything else about it were just scrumptious! Anonymousnyc, ny1/8/2021Pretty tasty. I would slice the raddichio, endives, and oranges finer, to better distribute the sweet bits with the bitterness.MegVancouver 1/6/2021Great winter recipe. To balance the bitter, I put honey in the dressingKD1/5/2021Explore Bon AppétitSaladChicken BreastChickenPoultryCitrusFruitEasyWeeknight MealsMainGluten-FreeDairy-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-01", "author": ["Condé Nast", "Devonn Francis"]}