{"id": "b4a736497f7260b7d1e18e5ae1cc4020", "url": "https://www.bonappetit.com/recipe/brussels-sprouts-with-cranberry-mostarda", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Brussels Sprouts With Cranberry Mostarda Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueBrussels Sprouts With Cranberry MostardaBy Janice TiefenbachNovember 19, 20195.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThe mostarda—an Italian sweet-and-sour mustardy condiment—improves with age, so you can get ahead of the game and make this many days (or even weeks!) ahead. Then use it on all your roasted vegetables, or in place of cranberry sauce with Thanksgiving turkey. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8–10 servings1lemon1cup sugar16oz. fresh (or frozen, thawed) cranberries1cup pitted prunes, coarsely chopped1Tbsp. brandy or Armagnac¾tsp. kosher salt, plus more3Tbsp. mustard powder2Tbsp. mustard seeds1Tbsp. red wine vinegar1Tbsp. plus ½ cup extra-virgin olive oil, plus more for serving3lb. brussels sproutsFreshly ground black pepperPreparationStep 1Using a vegetable peeler, remove zest from lemon in 3\"-long strips. Shave off any white pith and set zest aside. Cut any remaining white pith from lemon, then cut along sides of membranes to release segments onto a cutting board; remove seeds. Coarsely chop segments; place in a medium bowl. Pulse reserved lemon zest and sugar in a food processor until lemon zest is finely chopped, about 1 minute. Mix into lemon segments.Step 2Place cranberries and prunes in food processor (no need to wash out) and pulse until coarsely chopped; add to lemon mixture. Mix in brandy and ¾ tsp. salt. Transfer cranberry mixture to an airtight container, cover, and let sit at room temperature 12 hours. Mix mustard powder, mustard seeds, vinegar, and 1 Tbsp. oil into cranberry mixture.Step 3Place a rack in middle of oven; preheat oven to 450°. Toss brussels sprouts and ½ cup oil on a rimmed baking sheet; season with salt and pepper. Roast until browned and tender, 25–30 minutes.Step 4Add 1 cup mostarda to brussels sprouts and toss to combine. Transfer to a platter or large bowl; drizzle with oil.Step 5Do Ahead: Mostarda can be made up to 1 month ahead. Keep chilled.How would you rate Brussels Sprouts With Cranberry Mostarda?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleHow does the sugar disolves? there is no boiling in this recipe so i got confused, would appreciate some feedback.AnonymousBoston, MA12/25/2021This was amazing !  The combination of the brussel sprouts and cranberry mostarda was so tast. The mostarda stands on its own as a condiment to serve with grilled meats and or cheese.  PilarHuntington Beach, Ca12/21/2021Pss...If you want more zip/heat, try black mustard seeds!rafBerta AnneLA, Ca.12/21/2020Hello, Mostarda could always be found in my Italian kitchen when I was, a lot, younger.\nI am so happy to see this recipe as no one wrote it out. This will be on my condiment tray forever.\nI do believe there might have been a little wine involved. Perhaps it was to drink as they worked, not sure.\nThank You! I can now pass this to my family. I will need to look for 4 pretty jars, I still have my Great Grandmother's jar. As I am the oldest female in my generation I have much beautiful glassware.\nAt this place in time I was not much looking forward to making a full dinner for Christmas, now I can not wait!\nAs I live in a multi culture apart building I will share this with my neighbors as they share with me!raf\nPlease stay Happy and Healthy!!!Berta AnneFallbrook, Ca.12/21/2020I loved it\nWhen I first made the Mostarda IT was sooo spicy but it definitely mellowed out as it sat\nOceaneLund canada12/24/2019Totally didn’t let the mostarda sit the whole 12 hours before eating, and it was still incredible on the roasted Brussels 😍 I just made sure to give the fruit a hand by smashing the mixture a bit with an avocado masher. Also, I only used about 24 oz. of brussels for me and my partner. So, there’s so much delicious mostarda left over. Think I might try it with some roasted asparagus nextAnonymousRichmond, Virginia12/6/2019Explore Bon AppétitBrussels SproutVegetableCranberryBerryFruitPruneDried FruitFallSideDairy-FreeGluten-FreeVeganVegetarianHealthyishRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Janice Tiefenbach"]}