{"id": "b4d9b5b7b554d9d0eda60e74ff404de6", "url": "https://www.bonappetit.com/recipe/charro-beans", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Charro Beans Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueCharro BeansBy Esaul RamosMay 22, 20185.0(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintCooking the beans with all the dried spices leaves you with an intensely flavorful broth that’s just as delicious as the beans themselves. Keep the beans submerged in the broth in the refrigerator so they won’t dry out; plus, they’ll continue to soak up all that flavor. This recipe is from 2M Smokehouse in San Antonio, TX.Ingredients8 servings1lb. dried pinto beans, soaked overnight12garlic cloves, lightly smashed1Tbsp. beef bouillon paste4tsp. kosher salt, plus more¾tsp. ground coriander¾tsp. ground cumin¾tsp. garlic powder¾tsp. onion powder½tsp. cayenne pepper1small white onion, chopped1medium tomato, chopped½cup chopped cilantroPreparationStep 1Drain beans, place in a large pot, and add 10 cups water to cover. Add garlic, bouillon paste, and salt and bring to a simmer. Cook until beans are just tender, 30–35 minutes. Stir in coriander, cumin, garlic powder, onion powder, and cayenne and cook, stirring occasionally, 5 minutes. Taste and season with more salt if needed.Step 2Remove beans from heat and stir in onion, tomato, and cilantro. Cover and let sit 5 minutes for flavors to meld.Step 3Do Ahead: Beans (without onion, tomato, and cilantro) can be cooked 5 days ahead. Let cool; cover and chill. Reheat over medium before adding remaining ingredients.How would you rate Charro Beans?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleHello, Yummo...this recipe is Spot on!! First recipe I made came from a cafe in New Mexico. Lost that recipe in a move. Tried to make the beans from memory, not the same. Now...your recipe! Thank You!!\nI have made the beans in many states for many friends. Upon moving to Los Angeles, I have made your recipe for newer friends. Everyone has loved them!! \nAs I have shared your recipe with the many friends in many states, a third generation now enjoys them!\nThank You Again...Berta&Friends!!rafBertaAnneLos Angeles, Ca.1/11/2021Explore Bon AppétitMexicanLatin AmericanPinto BeanBeanVegetableEasySideNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Esaul Ramos"]}