{"id": "b4dae6b5bd7f97c1aa196327d824e6f7", "url": "https://www.bonappetit.com/story/marilyn-hagerty-broken-drum", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Marilyn Hagerty, of Viral Olive Garden Restaurant Review Fame, Reviews the Broken Drum in North Dakota | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsMarilyn Hagerty, of Viral Olive Garden Restaurant Review Fame, Reviews the Broken Drum in North DakotaPeople have been hanging out at The Broken Drum for 13 years. Now, there's finally good food.By Marilyn HagertyJune 6, 2018FacebookTwitterEmailPhoto by John BorgeFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Three medium-size meatballs. A rounded serving of mashed potatoes with nice brown gravy in the middle. With this midday special, there was a soft white bun. The cost: $8.50. There was also a steak sandwich for the same price. The soup of the day was chicken wild rice.Steak! And shrimp!\nPHOTO BY JOHN BORGEEver since the Broken Drum Bar and Grill in Grand Forks, North Dakota, added a full-scale kitchen and hired a full-time cook, the place has been buzzing at meal time. There are sloppy Joes on Wednesday and burritos on Thursday. When Friday rolls ’round, there’s steak and shrimp.Thirteen years ago when Mike and Jamie Spicer bought this old bar on the northern outskirts of Grand Forks, it was basically just another drinking place. Then the Spicers decided to bring in chef Debbie Johnson.The bar scene.\nPHOTO BY JOHN BORGEThey were so right. Longtime customers still straggle in for beer and alcoholic drinks, but now people come in droves from all over for good food. When I approached the Broken Drum at noon on a Friday in May, the muddy parking lot was overflowing with all kinds of trucks and a few cars. There was absolutely no place to park. Friendly merchants nearby allowed me to park in their lot. “Lots of people do,” said one.The soup. With a soft white bun.\nPHOTO BY JOHN BORGEInside the Broken Drum, the tables all around were full. As I settled in at the bar, I noticed a Miller Lite case with ketchup and mustard in it. The silverware was wrapped in a white paper napkin. Jamie Spicer was working behind the bar, taking care of customers at the cash register, and nimbly tidying up as people left. At 1 p.m., he erased the meatballs from the sign behind the bar. They were all gone. But there was still the steak sandwich and more soup.Over the years, I knew the Broken Drum was out there, along with a few other drinking places along Highway 2. I figured it wasn’t my cup of tea until my hairdresser began talking about it. Her dad frequented the Broken Drum. He always liked it. Now with food, he loves the Broken Drum, and his wife goes along with him for meals.The Broken Drum, no longer shady.\nPHOTO BY JOHN BORGEThe staff at the Broken Drum works well with Johnson. And she loves her work. My nicely seasoned meatballs with mashed potatoes arrived on a sturdy paper plate along with a big bun. Her food reaches out beyond the Broken Drum with catering services. In the springtime there are graduation parties and extra calls for catering here and there.The Broken Drum has long changed from a sort of shady place to go. Now it’s beyond an adventure. It’s becoming a trendy place to meet and eat—to see and be seen.Marilyn Hagerty is a columnist for the Grand Forks Herald and had her 15 minutes of Internet fame several years ago after her restaurant review of The Olive Garden went viral.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Marilyn Hagerty"]}