{"id": "b4e95b61d55eba4cac648c3bf0d4ea6f", "url": "https://www.bonappetit.com/recipe/mortadella-wedge-salad", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "Mortadella Wedge Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMortadella Wedge SaladBy Ali Slagle December 2, 20213.8(12)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling Cyd McDowell.  Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintA wedge of iceberg, the nearly flavorless but crisp as can be lettuce, can be dolled up with more than the iconic steakhouse trio of tomatoes, bacon, and blue cheese dressing. Here a similar balance between refreshing acidity and meaty richness comes from pickled jalapeños, fresh herbs, a tangy-creamy buttermilk dressing, and slices of mortadella tucked between the lettuce layers. The result is a wedge salad with flavor and zip all the way to its core. It would also taste (and look) great with torn green olives, toasted pistachios, and/or thinly sliced shallots softened in pickled jalapeño brine. —Ali SlagleAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronGlass Measuring Cup$19.99 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonPepper Grinder$16.99 At AmazonIngredients4 servings1large head of iceberg lettuce¼cup sliced pickled jalapeños½cup basil and/or mint leaves, plus more for serving8oz. thinly sliced mortadella, torn into large piecesKosher salt, freshly ground pepper1lemon½cup buttermilk¼cup sour cream¼cup extra-virgin olive oil1garlic clovePreparationStep 1Quarter iceberg lettuce through the stem end. Remove any tired outer leaves. Tuck jalapeños and ½ cup herbs between lettuce leaves, dividing evenly. Tuck 2–3 pieces mortadella into each wedge; season with salt and pepper. Finely grate zest of lemon over wedges, then cut lemon in half.Step 2Squeeze juice from 1 lemon half into a measuring glass or medium bowl. Add buttermilk, sour cream, and oil. Finely grate in garlic clove and stir to combine. Season dressing with salt and pepper.Step 3Squeeze juice from remaining lemon half over wedges (seek to get cut sides completely drizzled in lemon juice). Drizzle dressing over and finish with a grind or two of pepper and more herbs.How would you rate Mortadella Wedge Salad?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleSubbed mortadella for shrimp????? You mental midgets who review recipes and change them, please go away forever.Matt is NutsNyc12/28/2021Great recipe! Made dressing, as stated. Subbed out mortadella for grilled shrimp.  Excellent Matt DAtlanta, GA12/12/2021Explore Bon AppétitDinnerSideStarterWeeknightEasySaladIceberg LettuceLettuceLeafy GreensVegetableButtermilkOther IngredientsJalapeñoChileMortadellaCured MeatMeatGluten-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-02", "author": ["Condé Nast", "Ali Slagle"]}