{"id": "b4e9b05e64907f26de0f655fd33a5367", "url": "https://www.bonappetit.com/story/make-malfatti-ricotta-pasta", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Make Malfatti: Fluffy Ricotta Dumplings That Are So Much Easier Than Gnocchi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMake Malfatti: Fluffy Ricotta Dumplings That Are So Much Easier Than GnocchiLittle pillows of ricotta, Parmesan, flour, and egg. That’s it!By Alex BeggsApril 24, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiFacebookTwitterEmailOne of my favorite locations is in bed, asleep, which is why these ricotta dumplings shaped like tiny, freshly plumped pillows were calling to me. Malfatti translates to “badly made,” which calls to me even more. In this recipe from Estela and Cafe Altro Paradiso chef Ignacio Mattos, the soft malfatti (made of ricotta, Parmesan, flour, and egg) are combined with a creamy butter sauce, cherry tomatoes, and pancetta. The styled photo makes it look restaurant-y and sensual, but I swear, you can do this at home, on a weeknight.All of my past forays into homemade pasta have failed miserably after hours of anguish, see the Rock-Hard Gnocchi Incident of 2015, but these malfatti were much, much easier. With huge rewards! Here’s my pep talk.The Ricotta Squeeze PartI had to run to the hardware store to get cheesecloth, which is the one thing you need that I’ve never owned before. It’s like $2, so not a huge commitment. The essential purpose: to squeeze the moisture out of the ricotta. For like 27 seconds. Oh my GOD it was a satisfying feeling, squishing the ricotta in the sink. Don’t people make creepy YouTube videos about stuff like this? I’m all in.Roll it into...that size.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiThe Malfatti DoughInto the food processor: the squeezed-out ricotta, tons of shredded Parmesan, salt, and an egg. That gets combined with flour in a big bowl and you’ve got your dough. If you’re intimidated by dough because it’s sticky and makes a huge mess, fear not. This dough is wetter than usual and very easy to work with. (Okay, I still made a mess.)The key lesson here: imperfection.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiRoll It OutFlour a surface, which is a big Boos cutting board for me, and tear the dough into 4 pieces. You roll each one out into a long log with your hands, like you did with Play-Doh. The recipe calls for a 22x¾\" (inch) rope of dough, which I definitely did not measure. Then you use a dough scraper or gasp, a knife, to cut the little pillows off and save for later on a floured sheet pan. Again, did not measure, but completely eyeballed as “almost an inch.” The entire dough/rolling/slicing took me under 30 minutes, easy.Like marshmallow pasta.\nPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiThe SauceCook the pancetta–I used bacon—in a big pan like a Dutch oven first, then take it out to be a crunchy topping later, while the rest of the sauce benefits from the fat. Meanwhile, in a pasta pot of simmering water, the malfatti cook in 3 minutes, floating to the top like a prize. Add them to the Dutch oven with some of their pasta water (aka liquid gold), butter, and cherry tomatoes. Everything cooks together for a mere 4 minutes, until the sauce thickens and coats everything in a creamy, velvet sauce.The ExtrasOf course you could take your pancetta and run at this point. Or go all the way and serve your malfatti pillows with lemon zest, more Parmesan, and the fancy olive oil you serve with bread at parties.I don’t know how to say this any other way than: That’s it.The result is so decadent looking, the ricotta dumplings so much fun to eat, and the combo of cherry tomatoes and pancetta so...reminiscent of a BLT. They were also EXTREMELY FILLING. I pictured by body slowly morphing into a soft malfatti pillow. Things could be worse. It almost felt too damn good for a random weeknight. Do I deserve such treasures? I can’t wait to make them again, trying out different sauces (brown butter and mushrooms seems like a good idea), and trying them out on my friends, who still might be traumatized from the Gnocchi Incident. I’ll make it up to them, I swear.Get the Recipe:Malfatti with Pancetta and Cherry TomatoesMalfatti—literally “badly made”—are not as tricky to shape as you think. We’ll walk you through it.View RecipeExplore Bon AppétitRicottaParmesanWeeknightItalianRead Morecooking6 Spring Pasta Recipes to Get You Out of Your Blanket FortBy Alex DelanyRicotta Dumplings with Asparagus and Green GarlicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Alex Beggs"]}