{"id": "b4f07b39efee22c1379cf402cfe56d9a", "url": "https://www.bonappetit.com/story/potato-salad-for-dinner", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Permission to Eat Potato Salad for Dinner: Granted | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPermission to Eat Potato Salad for Dinner: GrantedYou see a side dish, I see dinner in a bowl.By Sarah JampelAugust 9, 2018FacebookTwitterEmailTed CavanaughFacebookTwitterEmailI have come to understand that, in the eyes of many, potato salad is considered a “side dish.” But as a vegetarian who survived years of cookouts and barbecues by loading up my plate until it was half potato salad, half potato chips, and almost too heavy to hold, I embrace potato salad as a fully acceptable—even reasonable—main dish option.But only if it’s the right kind of potato salad (and only if it’s summertime).Potato salad with pesto, it just makes sense.This vibrant and saucy potato salad has starch (uh, that’s the potatoes), protein (eggs and cheese), fat (olive oil), and “green vegetables” (at least two tablespoons of herbs). In place of the normal hallmarks of potato salad—mushiness, mayonnaise, unidentifiable add-ins (is that a green bean, I see? a diced carrot chunk?)—this one is all crunchy and salty, with acidic dressing that gets its creaminess from eggs, the eternal crowd favorite. Pour a tall glass of salted watermelon juice and it sounds like pretty balanced meal to me!See, what distinguishes this potato salad from the rest is, first and foremost, the potato preparation. The roly-poly salad consists, mostly, of small new potatoes (so very fashion compared to those old stick-in-the-mud Yukons or Russets, am I right?), which get halved and roasted, no boiling (or, heaven forbid, peeling) necessary. In 20 minutes (25 tops), they’re crispy-edged and golden-brown, like they just spent a little too much time on the beach.The gribiche (hard-boiled egg) dressing on its own. And yes, I would also eat this without potatoes.\nTed CavanaughAnd while the potatoes cook, you have just enough time to putz around your house and still make the potato salad’s pièce de résistance: sauce gribiche, an herby, egg-based dressing (stay with me!) that’s often paired with cold meat in French bistros (I’ll pass on that part). Boil a few eggs (make extra for snacks and salads later in the week), chop them up, then fold them into an emulsion of olive oil, white wine vinegar, and grainy mustard, salted-up with itty-bitty cornichons and capers. Spoon any extra sauce over crispy-skinned fish, sautéed asparagus and morels, or fat slices of beefsteak tomatoes, or a bed of grains.But give it a try! Shovel some potato salad into a big bowl—more than you think you can eat—and take yourself and your dinner somewhere outside (or somewhere directly in front of an A/C unit). Eat the whole helping, then some more. Get back to me if you’re not totally satisfied and full of life (and potatoes).Get the recipe:New Potatoes with Parmesan, Black Pepper, and Gribiche DressingIf you can’t find new potatoes at the farmers’ market, look for Peewee potatoes or very small Yukon Golds at the grocery store.View RecipeExplore Bon AppétitPotato SaladPotatoSummerSummer SidesRead Morecooking15 Easy Recipes to Bring to a Picnic or Barbecue or Wherever You Have to Go This SummerBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-09", "author": ["Condé Nast", "Sarah Jampel"]}