{"id": "b4f01d75bfc00f7d21ad083c3b96c369", "url": "https://www.bonappetit.com/story/mister-sunday-nowadays-queens", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Inside Mister Sunday, the Weekly Dance Party-BBQ at Nowadays in Queens | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Are You Doing Laundry on a Sunday? Go to This Dance Party-BBQ InsteadWe spent an afternoon dancing and eating at Mister Sunday, a weekend party in Queens.By Aliza AbarbanelSeptember 13, 2018FacebookTwitterEmailEmma FishmanFacebookTwitterEmailAliza Abarbanel has a thing for finding spots that create their own mini-worlds, an oasis of food-drinks-dancing-community-who-knows-what. She’ll be documenting them in her new semi-regular column The Third Place.Like any good party, you can hear Mister Sunday before you see it. Surely the entrance is somewhere in the endless row of Queens warehouses, but the metronomic thud of house music helps remind you that you’re in the right place. It floats above the cars zipping past the Evergreens Cemetery, accompanied by the sound of drink orders and barking dogs.Mister Sunday is a long-running all-ages BBQ-dance party hybrid currently thrown at Nowadays, a sprawling indoor-outdoor bar with many lives. Nowadays has served a community of Ridgewood locals and roaming partiers since 2015. The 5,000-square-foot converted warehouse boasts a rarity in New York real estate: a sprawling backyard that can accommodate hundreds of dancers of all ages. Like the Field of Dreams, real outdoor space has a certain magnetic quality—if you build it, they will come.Co-founders Eamon Harkin and Justin Carter use an eclectic mix of programming—think free outdoor movie screenings hand-picked by MoMA’s former senior curator of film and residencies from DJ collective Working Women—to bring all kinds of people out to Ridgewood. The duo also keep the crowd dancing as Mister Sunday's resident DJs. A food program helmed by Henry Rich of Metta and Rucola, hinged on an outdoor Caribbean food truck and BBQ stand, provides all the fuel dancers could ever need. Come for a mid-afternoon World Cup screening and you might stay until the not-so-early morning—fortified with chickpea curry and kombucha. I came to Mister Sunday one blazing summer afternoon to eat, drink, and disco. Here’s what I saw.3 p.m.A Mister Sundays attendee grabbing necessary provisions for a day of dancing.\nEmma FishmanOutside, a scraggly line forms of local families and a few Irish tourists stand clutching IDs and birthday cards, dog leashes and children’s books. Humidity hangs thick in the air. “Do you think they have A/C?” a nine-year-old asks his parents. After putting on wristbands and hearing the house rules (no harassment of any kind, no phones on the dance floor), the crowd filters into the yard.Brightly-colored picnic tables fill the space, bordered by a stocked outdoor bar, a small BBQ stand, and a parked food truck with jerk chicken thighs and spicy salt fish on the menu. A disco ball slowly rotates above the springy dance floor—the kind usually encountered on elementary school playgrounds. It’s a joy to dance on, and most people are here to dance. (The no-phone rule means you can REALLY dance like no one is watching.) An impressively-bearded man in a kilt shimmies alone in the middle of the dance floor to a joyous house track until two little girls in princess dresses leap in and begin to twirl.4 p.m.A proper spread at Nowadays.\nEmma FishmanA dad pushes a baby stroller while balancing a plate of BBQ ribs, which are smoked over red oak and sugar maple then glazed with red barbecue sauce. The coleslaw is bright and crunchy, a vivid pink that plays off the equally rosy picnic tables, and served alongside a cluster of plump tear-and-share potato rolls.The heat refuses to break, and the crowd stays hydrated with varying levels of success. Water jugs are scattered throughout the yard, but so are margaritas rimmed with Tajin, spiked bottles of White Label yerba maté, and endless Aperol spritzes with their telltale orange glow. Kids and adults alike clutch kombucha and bottles of Mexican coke.5 p.m.Hanging out at the edge of the dance floor.\nEmma FishmanThe dance floor has expanded to fill the yard, and toddlers wearing protective headphones wiggle on their parents’ shoulders.  Mist is piped out over the dance floor, and club kids in fashionably orthopedic sneakers crane their bodies to catch droplets. A couple with matching fanny packs trade bites of a snickerdoodle-cinnamon ice cream sandwich, and a few overheated dancers take sanctuary indoors, where the A/C is blasting and jugs of fruit-infused waters are regularly refilled. The cucumber one is always drained first.7 p.m.As the late summer sun retreats, the pace picks up. The BBQ stand is out of brisket, and the perpetually cheery cashier flags down anyone who passes by to buy the last few ribs. A tangle of people perched on a grassy hill tear off bites of chewy flatbread to dunk into chickpea curry from the food truck. After much discussion, a bite (or two) are fed to the smiling pit bull at their feet. Then it’s back to the dance floor.Mister Sunday happens every Sunday from 3 p.m. to 9 p.m. and runs through October 21st. Learn more about it here and follow Nowadays on Instagram to stay in the loop.Explore Bon AppétitNew YorkRead MorerestaurantsThe Caribbean Pop-Up Dinners That Brought a Whole Family TogetherBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-13", "author": ["Condé Nast", "Aliza Abarbanel"]}