{"id": "b4f2ac668de36f9bda31c5e561b778bb", "url": "https://www.bonappetit.com/recipe/spicy-kimchi-slaw", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Spicy Kimchi Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueSpicy Kimchi SlawBy Claire SaffitzMay 22, 20184.8(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintWe traded the goopy sweet mayo dressing in your typical cabbage cole slaw for a whipped, airy kimchi dressing. Cabbage two ways! If you prefer something less spicy, replace the kimchi juice with water.Ingredients8 servings8scallions½cup kimchi, plus 1 Tbsp. juice from jar2Tbsp. seasoned rice vinegar1Tbsp. Sriracha2tsp. fish sauce2tsp. toasted sesame oil¼cup vegetable oil1small head of Napa cabbage16\" piece daikon, peeled, cut into matchsticks2cups store-bought shredded carrotsKosher saltToasted sesame seeds and cilantro with tender stems (for serving)PreparationStep 1Remove dark green tops from scallions and thinly slice; set aside. Blend scallion bulbs, kimchi, kimchi juice, vinegar, Sriracha, fish sauce, and sesame oil in a blender until smooth. With motor running, very slowly stream in vegetable oil; blend until dressing is thick and airy. Set aside.Step 2Tear off leaves from cabbage until you get down to the crunchy white part. Rip outer leaves into 2\" pieces. Thinly slice core crosswise until you have about 6 cups; reserve remaining cabbage for another use. Toss in a large bowl with daikon, carrots, and reserved scallion tops. Season with salt; pour reserved dressing over. Toss to coat, transfer to a platter, and top with sesame seeds and cilantro.How would you rate Spicy Kimchi Slaw?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleSuperb and easyCarolThe villages fl10/12/2021This has become a go-to side for me, it is so good. I've made it 10+ times, and I've learned that a half-tablespoon of brown sugar in the kimchi dressing is a good thing if you're serving this with a main that is already salt/vinagary/spicy. The dressing is the star so sometimes when I can't find daikon I sub a big handful of thin kale ribbons or bean sprouts. Amazing recipe, family favorite.JessaminRaleigh, NC11/13/2020WOW I made this to take camping (glamping) and ate it next to a beautiful lake with the sour cream and onion potato salad peddled in the Aug. 2020 issue. insanely good!! I ate the dressing straight out of the blender, I ate the slaw until the fish sauce finally got to me. it's SO GOOD and I am bringing this to my next picnic. pro tip: I also made the kimchi toast (also in Aug 2020) for camping and it was a great way to double up on kimchi usage without being duplicative. thank you for your gifts Claire saffitz!!! jahgurlremyPortland, OR8/12/2020We made this as a sode dish with Johnsonville Korean BBQ smoked sausage. Subbed jicama for daikon. I will add a little honey for sweetness next time. AnonymousChicago 5/29/2018Explore Bon AppétitSlawSaladNapa CabbageCabbageLeafy GreensVegetableDaikonCarrotEasyQuickSideGluten-FreeDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Claire Saffitz"]}