{"id": "b4fb114b834bf942861039dc38a70157", "url": "https://www.bonappetit.com/recipe/passion-fruit-bars", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Passion Fruit Bars Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssuePassion Fruit BarsBy Mehreen KarimFebruary 8, 20223.3(15)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintLike lemon bars on holiday in the tropics, this two-layer confection is flavored with passion fruit juice (that’s right: You don’t need to seek out whole fruit or purée). By starting the curd on the stovetop, you’ll ensure that it sets quickly when transferred to the oven, which will keep its texture soft yet sliceable. The secret ingredient—okay, it’s cream of tartar—provides a sour counterpoint that keeps these from being cloyingly sweet, and the buttery vanilla shortbread offers just enough heft to anchor the curd while still keeping the bars melt-in-your-mouth tender.If you do happen upon the fresh fruit, buy it—we love it spooned over each bar as an optional garnish that offers pops of crunch to counter the silky curd below.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron8\" Baking Pan$25 At AmazonSilicone Spatula$13 At BA MarketCitrus Juicer$7 At AmazonMesh Sieve$13 At AmazonScale$25 At AmazonWhisk$10 At AmazonMedium Saucepan$39 At AmazonWire Cooling Rack$17 At Bon Appétit MarketIngredientsMakes 16Shortbread1cup (125 g) all-purpose flour½cup (100 g) granulated sugar½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt¼tsp. baking powder½cup (1 stick) unsalted butter, melted, slightly cooled1tsp. vanilla extractCurd and assembly¼cup (31 g) all-purpose flour¾tsp. cream of tartar1tsp. Diamond Crystal or ½ tsp. Morton kosher salt4large eggs2large egg yolks1¼cups passion fruit juice (preferably Ceres or Goya Passion Fruit Cocktail)2Tbsp. fresh lemon juice1cup (200 g) granulated sugar2Tbsp. unsalted butterFresh passion fruit or powdered sugar (for serving; optional)PreparationShortbreadStep 1Place a rack in middle of oven and preheat to 350°. Line an 8x8\" baking pan, preferably metal, with overlapping sheets of parchment paper, leaving generous overhang on all sides. Whisk flour, granulated sugar, salt, and baking powder in a large bowl to combine. Add butter and vanilla and mix with a rubber spatula until butter is evenly distributed. The dough should stick together in clumps while still remaining crumbly.Step 2Transfer dough to prepared pan (you may find it easier to form into a ball first instead of working with clumps—entirely up to you) and press into pan in an even layer, working it all the way to the sides and corners.Step 3Bake shortbread until top and edges are golden brown, 13–17 minutes. Transfer to a wire rack and let cool.Curd and assemblyStep 4While the shortbread is cooling, whisk flour, cream of tartar, and salt in a small bowl to combine. Vigorously whisk eggs, egg yolks, passion fruit juice, lemon juice, and granulated sugar in a large saucepan just to combine. Add dry ingredients and whisk to incorporate.Step 5Set saucepan over medium heat and cook curd, whisking constantly and making sure to get into the corners of the pan, until it begins to release steam and thicken, 9–12 minutes. Immediately remove pan from heat, add butter, and whisk until smooth.Step 6Pour hot curd through a fine-mesh sieve onto shortbread crust, using a rubber spatula to scrape off any curd that clings to the bottom of sieve. Spread curd into an even layer, working it all the way to the sides and corners. Tent a sheet of foil over baking dish to cover loosely and bake 12 minutes.Step 7Reduce oven temperature to 325° and remove foil from pan. Continue to bake bar until sides of curd are set but center still jiggles slightly when pan is gently shaken, 8–10 minutes more. Transfer pan to a wire rack and let bar cool, about 1 hour. Cover pan tightly with plastic wrap and chill at least 3 hours before serving.Step 8Just before serving, slice passion fruit bars into 2\" squares and top with spoonfuls of fresh passion fruit or dust with powdered sugar with a fine-mesh sieve if desired.Do ahead: Bars can be baked 3 days ahead. Keep chilled.How would you rate Passion Fruit Bars?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleWhy are these measurements different than what is in the magazine? Don’t bother with this recipe.  It’s not worth the effort. Very greasy shortbread and the ratios are off. You can hardly taste the passion fruit anyway. AnonymousChicago 3/6/2022This is really not a great recipe -- the curd is flavorless and the shortbread is oily :(AnonymousNew York, NY3/2/2022Gritty crust weeping butter - even after it cooled. The passion fruit curd is too sweet. There are better recipes on the internet which require less effort and yield much better results. AnonymousNew York, NY2/25/2022Yummy, but time consuming, and worth it. Buttery crunchy crust, and I used 100% frozen passionfruit (Whole Foods sells in thee frozen fruit section ), as opposed to juice which is sometimes diluted with other juices, losing tartness.  I wasn't sure why flour was used in the curd.  I've made curd without it and it's perfect.   Some small flour lumps remained which is possibly why this recipe calls for putting the curd  through a sieve.  This part added on much more time/work.  If I make these again, I'm skipping the flour and saving the time, and I'm guessing they'll be just as good.  Cant wait to serve them to end my dinner party this Sat! Thank you.Alli F.Lower Merion, PA2/24/2022@Confused Baker:\n\nIt stays in the 8X8 pan; only the foil on top is 12X12. \nThe oven temp is reduced to 325 from the original 350 (from step 1) Anonymous2/21/2022I feel like there are steps missing such as  when do you put the shortbread back into the baking dish that's now 12*12 as well as what should the oven temperature be when baking the curd and shortbread together for 12 minutes. Reduce the oven temp to 325 but from what? When removing foil from the pan, is it the 12*12? Confused BakerChicago IL2/16/2022Explore Bon AppétitDessertFruit DessertBar CookieCookieBakingNut-FreePassion FruitFruitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Mehreen Karim"]}