{"id": "b4fc4d696adb5eaffa7b1b88feed8a5c", "url": "https://www.bonappetit.com/story/worst-kitchen-tools-to-clean", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "The 12 Most Horrible Kitchen Tools to Clean, Ranked | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe 12 Most Horrible Kitchen Things to Clean, RankedI'm heated.By Amiel StanekOctober 8, 2018FacebookTwitterEmailIllustrations by Jordan AwanFacebookTwitterEmailI don't care what any of my old roommates told you: I actually like doing dishes. I love the satisfaction I get from motoring through a big stack of conscientiously scraped and rinsed plates the morning after a dinner party, or a sink full of identical short tumblers—that shit is like ASMR for me. Line 'em up, knock 'em down. Lather, rinse, repeat.BUT, there exists an entire category of things in the kitchen that I would literally rather throw in the g-d garbage than wash, kitchen tools that are so completely impossible to clean that the very thought of putting sponge to them fills me with eye-twitching fury. They will sit in the sink for days, unwashed, until I, in some fit of drunkenness or despair, have a full on rage blackout and, blinking back tears, attempt in vain to wrestle them in submission. (For the record, I don't have a dishwasher, or a very large sink, or decent water pressure, or much patience to speak of—these conditions clearly contribute to the specificity of my irritation.)I actually think the experience of washing these items can be so traumatic that I completely repress any memory I have of dealing with them—otherwise, like, why would I even use them? Maybe I'm writing this down as a message to my future self, like when 14-year-old-you sends a letter to 24-year-old-you reminding you not to be a poser, and how sick the Red Hot Chili Peppers are. Or maybe I'm just a bored food writer procrastinating from other work, with a large platform and little oversight. Regardless, below you'll find my list of most hated kitchen items to wash, ranked from least to most horrible.Illustration by Jordan Awan12. Tall Water GlassesMaybe if I had child-sized hands, or had a child who could use their child hands to wash dishes for me, then cleaning tall, narrow water glasses would be easy. But I am childless and have adult hands and hate every second I have to spend trying to cram my adult fist into these stupid things.Illustration by Jordan Awan11. CarafeI repeat: Adult. Hands. And don't try to tell me how easy they would be to wash if I bought some kind of \"bottle brush\" that looks like a glorified toilet bowl cleaner, because I won't.Illustration by Jordan Awan10. ColanderWhenever I use a colander to drain something, I think to myself, \"Ah, what a truly, TRULY useful kitchen tool!\" And then when I go to wash one, I realize that it isn't a kitchen tool at all, but an existential torture device. When you sponge one side, you push all the crud to the other side; when you sponge the other side, it pushes all the crud to the side you just cleaned. And on, and on, and on. Like a dog chasing its tail, except the dog does it for so long that it dies.Illustration by Jordan Awan9. Fine Mesh SieveSee above, but twice as bad. How do you wash something that has no surfaces?!Illustration by Jordan Awan8. ForkYou know, it's weird, but I kind of love washing spoons. Fold a sponge in half, with the bowl of the spoon in the middle, apply a little bit of rotating thumb pressure and blammo! Clean spoon. Forks, on the other hand, are reeeeeal fuckers. The tines?? How the hell am I supposed to clean every single side of every single tine?? And don't even get me started on the place where the tines meet—The Fork Crotch. There's always bullshit in The Fork Crotch, and if you don't clean it properly, immediately, before it has any opportunity to dry, then that bullshit is going in someone's mouth.Illustration by Jordan Awan7. WhiskWhyyyyyyyyyyyyyy loooooooooooord.Illustration by Jordan Awan6. Wine GlassesOnce upon a time, I was the kind of young bohemian with dreams and values who drank wine out of juice glasses like a true proletariat and was free and beautiful and pure. But spend enough time steeped in the hellscape of Young Professional New York and a certain psychosis takes hold. And when that psychosis takes hold, you do things like buy wine glasses. And then you put wine in them. And then you try to wash them. And then you die. Well, not, like, actually die, but you could! Every time I wash wine glasses I convince myself that one of them has a secret invisible chip on the rim, and that I'm going to slice open my hand while washing them and then pass out—I faint at the sight of my own blood—and bleed to death before anyone finds me. For this reason I only wash wine glasses when someone else is at home, or when I'm wearing a Life Alert.Illustration by Jordan Awan5. ThermosI absolutely love my Zojirushi \"vacuum carafe,\" which keeps my coffee at a completely undrinkable, molten hot temperature for days and days. But cleaning it? Forget it. The top part is an Escher-esque construction of like forty gaskets and interlocking plastic rings that, once taken apart to wash, can probably only be reconstructed by a Phd student. I tried once, and then just threw it out and bought a new one. And I've never washed it. Which is OK! I only put black coffee in it! Which I'm pretty sure is antiseptic, like pee!Illustration by Jordan Awan4. MandolineSomehow, I've managed to never cut myself while using a mandoline. Somehow, I've never managed to not cut myself while washing a mandoline. I hope you enjoy that shaved fennel salad, because I will pay in blood later.Illustration by Jordan Awan3. Food ProcessorSo. Many. PIECES OMFG. Endless nooks. Countless crannies. The part that goes into the other part that is hollow and gets crud in it BUT allows literally no point of sponge access. Life is hell.Illustration by Jordan Awan2. Crisper DrawersNot only are my crisper drawers too big to fit in the sink, but they are always full of the most unspeakably horrible things. I like to think that the disgusting fluid that always manages to collect at the bottom of them is the fermented tears of every piece of food I have left rotting in the fridge; I hear their sobs as I clean, and I feel the shame of my ancestors.Illustration by Jordan Awan1. Wire Resting RacksHere it is folks: The wire resting rack is absolutely, hands-down, beyond a shadow of a doubt the most horrible thing in the kitchen to clean. I mean, it's just math. 41 wires run in one direction. 28 wires run in the other direction. That means that a single wire resting rack contains 1,148 little metal squares of LITERAL HELL for grease and slime and bits of chicken skin and crumbs and blood and tears to hide in. It combines the hulking ungainliness of crisper drawers, the torture-physics of the fork, the whisk, and the fine mesh sieve, and the nook-and-cranniness of the food processor—and then it does math on them. Bad, bad, scary math. It somehow exists in four dimensions at once, with limitless surfaces ready to catch and hold on to whatever you just washed off the last surface. It's an endless, Borgesian library of greasy, soiled metal and existential despair. And I'm just going to let it soak for a little bit longer.Explore Bon AppétitToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-08", "author": ["Condé Nast", "Amiel Stanek"]}