{"id": "b501e4d0979e5dc690068b80b182474e", "url": "https://www.bonappetit.com/recipe/alfajores-with-coconut-dulce-de-leche", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Alfajores With Dulce de Leche Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAlfajores With Coconut Dulce de LecheBy Rick MartinezNovember 19, 20194.5(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted + Chelsea Cavanaugh, food styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintThe traditional South American honey-almond cookie gets a tropical twist thanks to a decadent yet shockingly easy coconut dulce de leche, oozing between two shortbread cookies. Top it with a blanket of brightly dyed coconut flakes and suddenly you’re on a beach far, far away.IngredientsMakes about 24114-oz. can sweetened condensed milk113.5-oz. can unsweetened coconut milk2tsp. kosher salt, divided½cup (50 g) almond flour or meal2¼cups (288 g) all-purpose flour, plus more for dusting1cup (2 sticks) unsalted butter, room temperature⅓cup (76 g) granulated sugar1large egg yolk1tsp. vanilla extract¼cup plus 2 Tbsp. honey1½cups (125 g) unsweetened shredded coconut1Tbsp. (or more) any color plant-based food-coloring powder1Tbsp. (or more) second color plant-based food-coloring powderLuster dust (optional)Special EquipmentAssorted 2\" (or smaller) cookie cuttersPreparationStep 1Place a rack in middle of oven; preheat to 375°. Bring condensed milk, coconut milk, and ½ tsp. salt to a boil in a small saucepan over medium-high heat. Scrape mixture into a 13x9\" baking dish and bake, stirring every 15 minutes or so, until very thick and a light caramel color, 40–50 minutes. Mixture will look lumpy, broken, and very pasty—that’s exactly what you want. Let cool in dish 1 hour, then transfer to a food processor and process until smooth. Set dulce de leche aside for serving.Step 2Meanwhile, whisk almond flour and 2¼ cups all-purpose flour in a medium bowl to combine. Using an electric mixer on medium-high speed, beat butter, sugar, and 1½ tsp. salt in a large bowl, scraping down sides and bottom of bowl as needed, until pale and creamy, about 3 minutes. Add egg yolk, vanilla, and ¼ cup honey and beat until combined, about 2 minutes. Reduce speed to low, add dry ingredients, and mix, scraping down sides and bottom of bowl, until incorporated. Divide dough in half and pat each piece into a 1\"-thick disk. Wrap in plastic and chill until firm, at least 2 hours.Step 3Preheat oven to 350°. Roll out 1 disk of dough on a lightly floured sheet of parchment paper, dusting with more flour as needed to keep dough from sticking, to about ⅛\" thick. Punch out shapes with lightly floured cookie cutters and transfer to 2 parchment-lined baking sheets, spacing 1\" apart. Pat scraps into a 1\"-thick disk, wrap with plastic, and chill 10 minutes if soft.Step 4Bake a sheet of cookies, rotating halfway through, until edges are lightly browned, 7–9 minutes. Let cool 10 minutes on baking sheet, then transfer to a wire rack and let cool completely. Bake remaining sheet of cookies. Line baking sheets with fresh sheets of parchment paper and repeat process with remaining disk of dough.Step 5Divide coconut evenly among 3 bowls. Add 1 Tbsp. food-coloring powder (sift if needed) to a bowl of coconut and toss until coconut is coated; add more powder if a more intense color is desired. Repeat with remaining food-coloring powder and another bowl of coconut. Leave 1 bowl of coconut white. If using, add some luster dust to all 3 bowls and toss to combine.Step 6Turn half of the cookies over to expose flat side; spread 1 tsp. dulce de leche over (this will be the inside of the sandwiches); set aside.Step 7Heat remaining 2 Tbsp. honey in a small bowl in the microwave just until warm (you want it to be loose), then stir in 2 tsp. warm water. Working one at a time, lightly brush honey over the top of remaining cookies (the ones that have not been filled with dulce de leche). Immediately dip tops into a bowl of coconut; press additional coconut onto cookie to cover any bald spots. Close up cookie sandwiches, coconut side up.Step 8Do Ahead: Dulce de leche can be made 1 month ahead; place in an airtight container and freeze. Thaw in refrigerator overnight before using. Dough can be made 3 days ahead; keep chilled. Cookies can be baked (but not assembled) 2 days ahead; store airtight at room temperature.How would you rate Alfajores With Coconut Dulce de Leche?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleHow sad that the hunger for money trumps what could be invaluable public relations tool!  Belen LeeHillsborough NH and Puerto Rico3/7/2022I make these as a holiday special! Everybody gets a kick out of this “remix” on the traditional South American cookie. Yum yum yum, YUM ¡Delicioso!AnonymousLong Beach, CA10/18/2021A friend gave me a gift of this dulce de leche, which was wonderful, but when I tried making it myself, it was a disaster!  I think I took a wrong turn at the first step, bringing the milk to a boil, as I spent about 20 minutes doing this while I stirred so as not to burn the milk.  That, on top of the 40 minutes in the oven, turned it into a very solid toffee.  Sadly, after taking it out of the oven and letting it cool as directed, I was able to get it into my food processor, but as it continued to cool it became quite solid and totally wrecked the food processor blade and plastic container :(  A new one was just delivered today but I am not sure I want to try making it again.  My friend is promising to send more gifts of dulce de leche my way :)  It would have been helpful to have had a few more details about that first step. Anonymous12/19/2020Yummy but super, super sweet. You really only want one, but the flavor is delicious and the cookie is soft and crumbly. I used the extra coconut dulce de leche to coat the cookies with coconut flakes instead of honey, and I enjoyed that more. Unlike another poster, I actually do think you need the coconut flake for a variation in texture. Once the cookies had been cooled, filled, and mostly dried, I kept them in the fridge and the dulce de leche stayed smooth and soft.  Alex the BakerDallas, TX12/7/2020These were excellent. The cookie and dulce de leche were really well balanced together and delicious. I would probably skip the coconut topping because the rest of the cookie was so good and it's harder to taste with the coconut on top. One of the best cookies I've made in years.Anonymous5/10/2020These are really excellent alfajores, but I thought the shredded coconut was unnecessary and detracted texturally, so I skipped it for most of my batch. The cookies themselves are pleasantly buttery with a melt-away quality and a tiny bit of nuttiness from the almond flour.  I forgot to pick up some of the cheaper generic honey I normally use for baking, so I ended up using fancy wildflower honey, and the floral honey note really came through nicely. The coconut dulce de leche was a delicious mess to make, and the complexity from the coconut helps avoid the cloying one-note sweetness that dulce de leche sometimes has. I used nearly all of it for filling the cookies, putting a generous half table-spoon each on each cookie sandwich--mine were a bit larger than called for since I used a 2.5-inch biscuit cutter to cut the dough. They oozed a little, but seemed fine as long as they didn't sit tilted for any length of time.Anonymous1/27/2020I just made these today. I made the dough one day ahead. I had half of the dulce de leche left over since it called for only ONE teaspoon per cookie. (between top and bottom cookie) I was concerned if I put more dulce in between it would ooze out when someone took a bite. My niece had a good idea. Instead of using the honey/water mixture so that the coconut would adhere to the top cookie, use more dulce de leche on top and the coconut would not fall off. Also the cookies would taste more delicious and not dry. Please comment if you were able to use all the dulce in the filling of the cookies. AnonymousVashon Island, WA12/26/2019What in the tarnation, I'm so confused! We spent six hours making these cookies, following very confusing instructions. Afterwards, my partner was the first to eat one and almost immediately fell ill from all the sugar. You are likely thinking we didn't properly follow the instructions. Nope, I know for a fact that is incorrect. How, you ask? My profession is authoring IKEA furniture assembly instructions - that's why. This recipe also calls for luster dust, what in all that is holy is luster dust?! We were going to gift some to our friends, but we wisely decided to do otherwise. Why you ask - because it would make them sick. These are the gateway drug for diabetes and extensive visits to your dentist.AnonymousDiabetes Town12/24/2019Really, really delicious. Very time consuming if you’re making it all in one day. I think it’s probably better to split up the work over a few so that it’s not so intrusive. But still, VERY delicious!AnonymousDC12/24/2019This will soon become a family favorite.  The Dulce was soo easy to make .  Why should you spend $$$ at Williams and Sonoma for a jar when it is this easy to make!  It is key to not roll the dough too thin.  Also who can afford the expensive food dye?  I used regular dye in the shredded coconut AnonymousNJ12/24/2019They changed the recipe from 133 g sugar to 76, but when I made them last week, I used 133 grams and they came out perfect, so I have no idea which is correct. introcourseLincoln, Nebraska 12/19/2019THESE. ARE. SO. DELICIOUS. Coconut dulce is a brilliant touch, and surprisingly easy.AnonymousBrooklyn12/18/2019Granulated sugar in the cookies. One third of a cup does not weigh 133g. Two thirds does. Which is it?nataliematz88Omaha, Ne12/14/2019Explore Bon AppétitCookieDessertSouth AmericanLatin AmericanCoconut MilkOther IngredientsCoconutFruitAlmond FlourFlourDulce de LecheBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Rick Martinez"]}