{"id": "b523da0b92e8407364d8cec2b6419fe9", "url": "https://www.bonappetit.com/recipe/no-fail-roast-chicken-with-lemon-and-garlic", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Roast Chicken with Lemon and Garlic Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNo-Fail Roast Chicken with Lemon and GarlicBy Claire SaffitzMarch 8, 20214.8(518)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis roast chicken recipe is proof that there’s really nothing simpler, more delicious, or more comforting than a beautifully browned roast bird surrounded by a puddle of buttery, garlicky pan juices. While cooking a whole anything can feel intimidating, this recipe is dubbed foolproof for a reason—it’s converted many an intimidated meat-cooker by eliminating the uncertainty of knowing whether the chicken is done. We’ve made that point easier to identify with lots of visual cues that anyone can follow, and if you do have an instant-read thermometer, you can feel free to use that, too: Just remove the chicken from the oven when the thickest part of the thigh hits 160°.And it’s not just easy—it’s also delicious. We take it to the next level with lots of lemon and garlic and a “healthy” pour of melted butter to crisp up the skin while keeping the meat moist and tender. Consider this roast chicken, a hunk of good baguette, and a simple green salad your Sunday dinner from now on.Editor’s note: This recipe was originally published November 9, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Saucepan$155 At AmazonPlatter$29 At AmazonPaper Towels$13.45 At AmazonIngredients4 servings1lemon1head of garlic¼cup (½ stick) unsalted butter or extra-virgin olive oil13½–4 lb. whole chickenKosher saltFreshly ground black pepperPreparationStep 1Arrange a rack in the center of your oven, and preheat to 425°. Cut 1 lemon in half crosswise and remove any visible seeds.Step 2Cut 1 head of garlic in half crosswise. (If it falls apart a bit, don't sweat it.)Step 3Melt ½ stick butter in a small saucepan or microwave in a small bowl.Step 4Place 1 3–4-lb. whole chicken on a cutting board (best to use a plastic one you can sterilize). A word on bird size. A 3–4-lb. chicken is pretty much the ideal size for roasting this way. Something a little bit bigger will work, but once you get much past 4½-lbs. it becomes harder to guarantee that the breast meat won't dry out in the time it takes the dark meat to cook. Pat the whole thing dry with paper towels. It's super important to get the chicken as dry as possible, which helps with browning.Step 5With chicken breast facing up and legs pointing toward you, use a sharp knife to slice through loose area of skin connecting the leg and breast, making about a 3\"-long incision. Continue cutting downward until you hit the joint that connects the thigh to the body, then stop (once you get through the skin, there’s not much there; if you are cutting through flesh, you’re too close to the breast). This exposes the leg joint, making it easy to tell if chicken is cooked. Repeat on second side.Step 6Season every surface of chicken, including skin along backbone, inside cavity, under wings, and inside part of the leg you just exposed, with lots of salt and pepper. If you’re using kosher salt, it should take you 4–5 generous—as in, four finger—pinches, which will be around 4 whole teaspoons.Step 7Transfer chicken breast side up to a large oven-safe skillet. Arrange lemon and garlic cut sides down in skillet around chicken.Step 8Drizzle chicken all over with melted butter (mmmmmmm) and transfer to oven.Step 9Roast until chicken is nicely browned and cooked through, checking for doneness after 45 minutes. To check, carefully remove skillet from oven (the handle is hot!), poke a knife into leg joints, and pierce the meat. If juices run clear, the chicken is done. If you see a rosy pink color, it needs more time. Continue to roast, checking every 5 minutes, until juices run clear. (If you’re not sure, you can also use the knife to lightly shred some of the meat along the thigh bone—the meat should look opaque and the fibers should separate easily.)Step 10Let chicken rest in skillet at least 15 minutes before carving—this will help the juices in the meat to settle, and will also get it down to a temperature that is cool enough to handle with your bare hands while carving. Don't worry: It's a big piece of meat, so it will still be plenty warm by the time you serve it. Transfer chicken to a platter. Pour all of those glorious, buttery pan juices over top of the meat and serve with roasted lemon and garlic alongside. Winner, winner, chicken dinner!→  Nervous about carving the bird? This video should help.Step 11Do Ahead: Chicken can be made 2 days ahead. Let cool. Cover and chill; bring to room temperature before serving.How would you rate No-Fail Roast Chicken with Lemon and Garlic?Leave a ReviewTell us what you thinkReviews (131)Back to TopTriangleI never leave recipe reviews but this is so good I felt compelled to. I’ve been searching for a delicious easy roast chicken recipe for years and finally found it. I like the thighs and my husband likes the breasts and we both agreed this was my best chicken. The skin crisped up perfectly. The flavor was immaculate. I worried it wouldn’t have enough flavor with the lemon and garlic going right in the pan and not on the chicken but I was wrong. It was honestly perfect. Can’t wait to enjoy the leftovers on a Caesar salad. CarolineRichmond va 3/24/2022My go to recipe when I want something Delicious, Easy, Impressive-looking, when I feel guilty that I haven't cooked in a week and need to make up for a week's worth of going out to eat. This is the dish. Worthy of your best company. Always have a lemon, a clove of garlic & a stick of butter on hand and a spatchcocked chicken in the freezer. vhcrnaAnnville3/20/2022Damn good chicken.\nGosiaHenderson, CO1/31/2022Super delicious and easy! Added some small potatoes the 20 minutes. Definitely make this one again, even for a dinner party.Heather BirdAustin, Texas1/21/2022Simply wonderful.  I have told all my friends about this recipe.  Easy and special dinner.JaneSouth Carolina1/8/2022I love this recipe!! Just made it tonight, never cooked a young whole chicken in my cast iron skillet ever. This recipe is a keeper, my husband and I loved how tender the chicken came out, the juices from the lemon and garlic was phenomenal! I really loved your video step by step making it the easiest recipe for one of the best chicken dinners I've ever made.DonisCalifornia12/27/2021Loved this recipe. Easy and fast. Made for a Sunday supper with guests. I put the chicken in when they arrived and we sat down to dinner 1 hour later.  It was very moist,.  I used the garlic for the baguette added parsley to the sauce, I used a bell and Evan chicken which is air dried so moisture was not an issue. Will make again!EG12/20/2021Every time I see a recipe that calls for a chicken that's 4 lb or smaller, I laugh out loud. It's nearly impossible to find a chicken that small - occasionally there's something 4.5 to 5 lbs, but almost everything in my supermarket is 5 - 6+ pounds. (I mostly shop at a Kroger or Safeway/Albertson's owned chain store.) One person I spoke to as we were digging through all the whole chickens in the refrigerator case has the theory that the store keeps the smaller chickens for the rotisserie chickens. KenPasadena, CA12/17/2021Why don’t you just use a thermometer probe and pull it out of the oven when it hits 165?  I use thermostatic probes almost every time I cook any protein.  No worries about over or under cooking.Rexico Dallas Texas12/17/2021outstanding. moist and flovorful.\ni did add some  mojo to the mix in the sauce. love garlic and lemon combinationsjanTampa12/5/2021This is my first roast chicken - ever.  The chicken was overall, good and simple, but after 45 minutes of roasting time, I did have to return the chicken back to the oven and cook about 20 minutes longer.  AnonymousCharlotte, NC11/30/2021I love roasted chicken.  This is a great recipe.  The chicken was very tender. The taste was great.Meri AbuChicago Illinois11/29/2021I followed this recipe well, and this is the result:\n\n4lb chicken at 45 min in the oven at the stated temperature, extra well done.\n\nSauce was strongly bitter from the lemon skin, and not tasty. Needed lots of honey/sugar.\n\nCouldn't taste the garlic because if the powerful bitter taste. \n\nI even basted it 2 times. \n\nWaste of my time, effort and organic chicken. \n\nVERY DISSATISFIED. \nChris scotland11/23/2021Super easy and the videos very helpful.   This is my new go-to  for roast chicken.   \nUsed my cast iron enamel coated roasting pan.  perfection.  thanks!AnonymousVictoria BC11/14/2021So easy. So tasty. This is my go to - especially on a night when I don't feel like \"cooking\". Just pop it in the oven and go. You cannot go wrong with this recipe! Sharon CQueens, NY11/8/2021Explore Bon AppétitChickenPoultryLemonCitrusFruitGarlicVegetableWeeknight MealsEasy5 Ingredients or FewerMainDairy-FreeNut-FreeGluten-FreeKetoHealthyishRoastPassoverRosh HashanahHanukkahDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-08", "author": ["Condé Nast", "Claire Saffitz"]}