{"id": "b545a0fa3e8bb7de714e355e38a6f18b", "url": "https://www.bonappetit.com/story/sangria-feud", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Make a Huge Pie This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMake a Huge Pie This WeekendRecipe ideas and other news—plus a minor sangria feud—from the week.By Alex BeggsJune 22, 2019FacebookTwitterEmailLaura Murray, styling by Anna BilingskogFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Make a huge pieThis week, I shilled for the deep dish pie dish. What’s to lose? $8! What’s to gain? A big, fruit-stuffed pie. I want to master apple pie this summer, even if it’s not in season. I play the long game. I’m preparing for the holidays. I’m using Claire Saffitz’s recipe as a starting point, but probably tweaking the filling to make it...easier on myself. Her crust though, I follow to a T. Rick Martinez’s blueberry pie recipe is another stunner and I hear it has a love potion effect (I HEAR). You’ve got options.Gloria Vanderbilt in Vogue, 1961.\nPhoto by Horst P. HorstGloria Vanderbilt’s favorite lunchFive years ago, I was lucky enough to interview Gloria Vanderbilt, who died this week at age 95. I was a big fan, especially of her paintings and collages and joie de vivre. She told me that every day she took a break from painting for lunch and every day she ate the same thing. A peanut butter and jelly sandwich, with a glass of milk. All of her life’s incredibly high highs and deeply low lows, loves and loss, wealth and debt, seemed tucked into that homey, comforting sandwich. When we brush off our gold-plating, we’re all PB&J underneath.Want this letter before it hits the website? Sign up for our newsletter!CoincidentallyAnother celebrity food quirk. In my outlaws’ house in Detroit, I read a back issue of AARP Magazine that featured a short but powerful interview with Alan Cumming in which he reveals he loves soup and eats it twice a day. “If it’s water and got vegetables in it, I’m in,” he said. Well.The garlic videoWe learned our lesson when the viral video clip of slicing pineapple a whole new way didn’t ultimately turn out. So when we watched the garlic-peeling video this week, we groaned and declared: It’ll never work. At least, not in the way we want it to. There are 45 different gadgets to help man conquer garlic. But garlic knows.Photo by Alex Lau, food styling by Susie TheodorouSomething to do with a ton of garlicMake these roast chicken legs.Hello cousin TimMy cousin Tim texted me this week because he wanted to know why I wasn’t in Chris Morocco’s doughnut video, which I hadn’t even watched yet. It turns out, I play a small role, an international woman of mystery, who sprints off-camera to avoid being immortalized on YouTube. I prefer to live in the shadows! But the doughnuts, made with Greek yogurt, have this moist, incredible crumb and tangy lemon glaze, are pure sunshine. Make them!Get the recipe: Lemony Glazed Cake DoughnutsOut of the shadows“Have you heard about our barley?” I went to an event for a new Macallan expression this week that I thought was going to be another press tasting full of writers wafting and sniffing and spitting and saying the word “nose.” Instead, it was an immersive experience in a $13 million mansion on Riverside Drive (for sale—snagged a real estate one-sheet in the lobby, no pool). People were wearing stilettos, by choice, which always shocks me. The barley, by the way, is grown on the Macallan estate and is harvested for one week, once a year. In the “barley field activation” of the mansion, though, it was fake, stuck into foam hillscapes you could take a photo in front of while a soundtrack of chirping birds played. That’s harvested year-round, at Michael’s.The sweaty meat carverDid I watch a 10-minute meat carving training video for Old Country Buffet this week? Maybe! Have you tried the lasagna? It’s my favorite.Unnecessary food meme of the weekUnnecessary food feud of the weekAliza Abarbanel wrote about her love for this rosé sangria recipe on Basically this week (“it’s vegetal!”), but not everyone at BA can get down with fruit salad wine punch. “Everything sangria thinks it is doing well, a Pimm’s cup does better,” declared Chris Morocco. “There’s no instance in which I’d rather have sangria than wine,” said Emma Wartzman. “If a spritz exists,” posed Alex Delany, “then what’s the point of sangria?” Jesse Sparks, waving a mug of tea around, wasn’t here for the negativity. “I love the stuff. You can make it with friends—remember those? They LOVE SANGRIA. It’s ridiculously easy, and big batch-able.” Carla Lalli Music is down for sangria too. “The brandy, the fruit, I can put some sangria away,” she said, before adding, “NO grapes.” A feud-within-a-feud! Ryan Walker-Hartshorn declared she is pro-grapes in sangria, “and I cut them in half individually,” she said, “that’s love.” Emily Schultz interjected that her “friend has some Ed Hardy sangria in her apartment,” which is knowledge I’ll have to live with the rest of my life. Andy Baraghani sent me his order: “Ideally it would be some stone fruit (not cut into stupid cubes but thin wedges), a handful of lightly bruised basil (maybe mint), a touch of brandy, a bit of orange and lemon peel that has been muddled with a spoonful of sugar, and wine.” Would drink. Adam Rapoport likes white sangria, where all the ingredients are on display—peaches, citrus—but not murky, mysterious red sangria, where “you don’t know what’s going on in there, it could be Sierra Mist for all I know.” Could it?Explore Bon AppétitBeggs NewsletterRead Moreculture23 Date-Friendly Foods, According to MeBy Alex BeggscultureIs It Ever Okay...To Take Over the Grilling at Someone Else’s Party?By Alex BeggscultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggscultureA Fond Farewell to Our Wonderful AmielBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-22", "author": ["Condé Nast", "Alex Beggs"]}