{"id": "b560cedc01036d633bedf4a48bf7894d", "url": "https://www.bonappetit.com/story/weeknight-roasted-salmon-recipe", "year": 2018.0, "month": 1.0, "day": 1.0, "content": "The Weeknight Roasted Salmon Recipe I'll Always Double | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Weeknight Roasted Salmon Recipe I'll Always DoubleWhen dinner is this flavorful and satisfying, next-day lunch leftovers are a dream come true.By Christine MuhlkeJanuary 2, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis story is part of the 2018 Feel Good Food Plan, our two-week mind-body-belly plan for starting the year off right.One of the easiest ways for food to make you feel good is for you to enjoy making it. This roasted salmon recipe certainly passed the test: one bowl, two sheet pans, big restaurant-worthy flavor and style. And I had just about everything in my pantry or freezer. (Big thanks to Sitka Salmon Shares, the amazing Alaskan CSF I belong to). Oh, and did I mention that this dish is really healthy, with lots of good fats and brain food in the salmon, vitamin A in the sweet potatoes, and digestive properties in the ginger? That certainly doesn't hurt.While the sweet potatoes took the full 40 minutes to soften and the salmon needed a smidge less than the recommended 16 (I used wild salmon, which is leaner than farmed and cooks faster), I had more than ample time to slice the veg and pear and whip up the tangy ponzu sauce, which I would happily pour on any protein or veg. I liked the of-the-moment presentation that breaking the potatoes and salmon with one’s hands gave (though waiting for them to cool a smidge before tackling that task is highly recommended). The crunch of the celery in the salad seemed a little redundant alongside the crisp Asian pear for my taste, so I'll probably omit it next time—or just snack on it whole while cooking. Mmmmm: fiber!Here’s the pro move: I doubled this roasted salmon recipe and saved the rest for lunch the next day. The overnight soak in that addictive ponzu sauce made the salmon even more flavorful. (I stored the potatoes on top of the salmon so they didn’t swim in fish-flavored juice.) Served over mustard greens dressed with the extra ponzu, it made for a very feel-good meal that kept me satisfied and energized until dinner. And as a person who is quite nearly always hungry, I really can’t remember the last time that happened…Get the recipe:Ponzu Roasted Salmon for TwoSalty-tart and just-sweet-enough ponzu sauce is a great back-pocket finisher for everything from salads to roasted vegetables, especially when you are tired of your everyday vinaigrette.View RecipeExplore Bon AppétitHealthyishSalmonFeel Good Food PlanPotatoMustard GreensWeeknightDinnerRead MorecookingHow to Make a Week's Worth of Amazing Lunches in 2 HoursBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Christine Muhlke"]}