{"id": "b56aa60643d68febb803466f84b5187a", "url": "https://www.bonappetit.com/story/soom-tahini", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "Why Soom Tahini is Our Favorite Brand | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen You Never, Ever Want to Stir Together Separated Tahini, Buy SoomThe silkiest, creamiest tahini money can buy—and no separation, ever.By Sarah JampelMay 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.This might sound silly, but it’s true: On numerous occasions I have had my heart set on making something with tahini—tahini tea cake, tahini-ranch dressing, creamy hummus—only to be stopped in my tracks by the contents of my unopened jar.You know the one: It’s got an inch of cloudy oil on top and a layer of sandy sediment below, and no matter how carefully you try to integrate the two, there always seems to be more spilling than mixing going on. I’m sorry but sometimes no cake, sauce, nor dip is worth that frustration—and the mess that gets left behind.That’s where Soom tahini comes in. It’s so silky-smooth that you never have to stir. For lazy tahini fiends like me, that means I’m cooking and baking with tahini more often. And since Soom is so delicious—nutty, earthy, and just the right level of bitter—it also makes what I’m cooking taste just plain better.I first read about Soom in Michael Solomov’s first book Zahav, in which he deems it his favorite brand. The Philadelphia-based, sister-owned company sources its White Humera sesame seeds from the Tigray region of northwest Ethiopia, then sends them to Israel, where they’re roasted and pressed. The seeds have the ideal oil to meat ratio, meaning that it doesn’t take any extra oil or additives for the tahini to remain emulsified—so you can get to cooking, not to stirring.Photo by Chelsie CraigSoom Premium Tahini$9 at Bon Appétit MarketExplore Bon AppétitHighly RecommendTahiniMiddle EasternShoppingRead MoreCrispy Roasted Broccoli with Tahini SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-28", "author": ["Condé Nast", "Sarah Jampel"]}