{"id": "b56b152f4dcc35c2cde3b39b0dd8f36b", "url": "https://www.bonappetit.com/story/nova-scotia-surf", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "In Nova Scotia, the Waves Are Fast and the Food Is Slow | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhere the Waves Are Fast and the Food Is SlowIn Nova Scotia surf-and-turf isn’t just a main course, it’s a way of life, a way to play and a reason to stay.By Melissa BuoteNovember 7, 2019FacebookTwitterEmailJessica EminFacebookTwitterEmailThis article is part of a series on Canadian food and travel, with support from Destination Canada.We are only a 15-minute escape from the city and we can see the stars. Not just one or two struggling to break through the city skyglow. All of them. “There’s Cassiopeia,” I say, pointing up to a cluster shaped like a loose W, joking about being able to name all the constellations. Turns out it is Cassiopeia. We can see the Big Dipper and Leo and Jupiter too. We can’t see the ocean, but we can hear it down below, white noise in the black of night.A few hours earlier, sun shining, Dean Petty took a break from the barbecue where he was grilling sweet Annapolis Valley corn and smoking a side of ribs to point out various surf breaks along the same curve of the Atlantic that edges his backyard. “Minutes, Minyards, Backyards, Inside Oz, Outside Oz, Radars, Seawall…the list goes on.” There is also Moose, named after the statue of a giant moose erected in Cow Bay by nature artist Winston Bronnum in 1959.A hawk was flying overhead and Dean, a pro surfer turned pizzaiolo, kept losing track of his thoughts as he watched it drop again and again, looking for fish. The hawk keeps bailing on the dive, content to hang loose on the swell of wind and stay out of the spray below. It feels like a metaphor, something a little too on the nose about risk and reward or maybe something a little more oblique about how the Atlantic Ocean will always make you wait.It was only a few years before Dean moved here in 2006 that what had been a pretty open secret in the surf community—Nova Scotia has sick waves—became a wider revelation. In 2004, the Red Bull Ice Break, a sub-zero surf competition where little ice floes rode the waves with the surfers, took place in Cow Bay. The combination of rough winter waves, rocky coastline, exposed reef, wind and swell combos, plus general gnarlyness and bodaciousness (all required for truly great surfing, as I understand it) finally put Atlantic Canada’s waves on the radar.Petty with his surfboard.\nPhoto by Jessica EminFifteen years later you could still call Cow Bay a bit of a hidden gem, but really it’s just remained a little unpolished: It’s a world-class surf destination, but it’s also the burbs, and nothing sparkles with more dullness than suburbia.But the suburbs of Halifax aren’t quite what you’d expect. Maybe that’s because the capital is not really a city, but what you call a regional municipality—a county, basically. It spreads out leisurely across the central southern part of the province, with two “cities” (Halifax and Dartmouth, with adorable ferries running between the two) and suburbs that wind around lakes and through fishing villages to little communities with names like East Loon Lake Village and Ecum Secum. It’s a beautiful stretch, where country roads can take you to rustic fish-and-chip shacks, charming bakeries, and dozens of craft breweries and cideries, punctuated with a series of coves and bays that lead to the Atlantic Ocean.Cow Bay is one of those bights, right where the suburbs of Dartmouth and Cole Harbour begin to fade into something more rural. There are endless reasons to come to Nova Scotia: bowls of creamy, comforting seafood chowder crowded with meaty clams, mussels, and lobster; lively nights at ceilidhs and kitchen parties where you can enjoy the lilt of traditional Gaelic fiddle music; the unparalleled North American sparkling wine found in the Gaspereau Valley. But there are really only two reasons to specifically go to Cow Bay: You love to surf or you love moose statues. Either way, follow your bliss!Pepporoni pie straight from the oven at Yeah Yeahs Pizza.\nPhoto by Jessica EminDean, who grew up in Kittery Point, Maine, followed his to Nova Scotia, “a point break mecca,” he calls it, ostensibly to attend university, but really to surf. Now he has two businesses in Dartmouth, Anchored Coffee and Yeah Yeahs Pizza, but he lives in a bungalow overlooking Cow Bay. Because after all this time, even with a restaurant making the best pizza in Nova Scotia, it’s still really about surfing.The pizza really is righteous, though. The New York–style pies have an airy crust, just the right balance of crispy and chewy, fermented long enough and cooked with enough heat to delightfully blister and blacken the crust. Every slice is entirely crushable, from the classic Margherita to white pizza with creamy fior di latte, roasted mushrooms, charred green onion and a bright squeeze of lemon, or a pepperoni pie given extra zip with ribbons of onion, hot peppers, and a drizzle of hot honey. The coffee ain’t bad either.The pizza shop is just upstairs from Anchored Coffee’s roastery, which itself is tucked in next to Two if by Sea, one of the most popular cafés in downtown Dartmouth, a neighborhood that has become a spark plug for a current of cool, youthful restaurants, cafés, and breweries. “The space is not precious; it’s not perfect, but it parallels perfectly with the waves,” Dean says. “I think it definitely comes back to the grit of being in Nova Scotia. When things come together, there is no better place to catch a wave...or to have a second-story pizza place in a weird location.”A good way to spend the morning at Cafe Goodluck.\nPhoto by Jessica EminIt’s in that neighborhood where you’ll find Cafe Goodluck, a small, sweet, brunch-focused restaurant with a menu that weaves French classics and diner food into a fresh take on comfort. They serve flaky, buttery quiche and croque monsieurs, house-made brioche stacked with sweet and salty honey-caramelized ham and topped with a torched Bernaise. They also build dishes around produce from Off Beet Farm, a small urban farm in Cow Bay, regularly using its greens for salads. Chef Emma Adamski creates simple, flavorful dishes like fresh tagliatelle with pungent pink oyster mushrooms in a rich cream sauce, and sweet, sunshiny late-summer tomatoes on garlic-rubbed sourdough.Jamie Tingley and Sarah Fisher started Off Beet in their backyard. And their front yard. And their neighbor’s yard. So it isn’t a Playmobil playset kind of farm; you don’t hear an Ennio Morricone whistle as you look out over the fields. It’s scrappy and relaxed, worn in like a pair of grass-stained overalls. It is, quite simply, a house, quaint, almost distinctly suburban, with a deck that wraps around the front and that big window on the second floor that looks out over the bay. “I think it’s taken me some time to get over the idea of what a farm should look like,” Sarah says. “We don’t have a barn, we don’t have space, I can see my neighbors.”Off Beet Farm supplies Cafe Goodluck with a lot of their produce.\nIt was just past noon, too hot outside and well past the time anybody could reasonably go do any work in the thick, wet air of the sweating greenhouse, when I picked my way through rambling vines of plump gold tomatoes with Sarah. She plucked a few off the vine to try, each one bursting with dirty, grassy sweetness, before we escaped to the coolness outside—even on the hottest summer day there is always a bit of wind in Cow Bay—where the gardens weave around the property with a sense of cooperative anarchy, beans poking through the broad leaves of squash plants, edible flowers creeping into vegetable beds.Jamie says he likes surfing as much as he likes farming because both are so difficult to perfect. “I think they are the two most difficult things I’ve ever done in my life; they are constantly challenging me,” he says. “It has such immediate, immediate satisfaction. When you are catching those waves it’s like bam! bam! bam! When we are out farming and we go out and see all these tomatoes that are just hitting it, when I have a perfect crop of turnips, we’re like wow! and we do get super stoked.”The parallel between the creativity of farming and surfing is not lost on Sarah. Choose a plant or choose a board, work on the land or play on the sea: The rest is you and your ingenuity working to produce something in concert with an unpredictable force. “You can’t force waves to be something,” she says. “You can’t force weather to be something.”As you may have caught on, there is no endless summer in Nova Scotia. To put it mildly, the weather can be mercurial. As Dean explains it, “You can come up here on a surf trip and get fully skunked.” Part of Nova Scotia’s charm is its lack of guarantees, though; to really understand Nova Scotia is to thrive on its challenges. Which is why winter surfing is so popular with serious surfers.All calm waters here.\nPhoto by Jessica Emin“We have better waves in the winter,” Dean says, though he admits that even with the consistency of the waves and wilder swells in the stormier seasons you have to have some screws loose to put a wetsuit on and wade into the ocean in -20 degree weather. Jenner calls it epic, “One of the most surreal experiences.” It’s the biggest payoff for the way Nova Scotia can toy with you when it comes to weather, the way the Atlantic breeds patience and perseverance.“I think there’s something to it—we wait a lot of the year for waves. It’s the ultimate metaphor even if it’s so cliché,” he says. That hawk from earlier is probably nodding his head right now. “Like I didn’t know how to run a restaurant, but it was like, cool, I’ll figure this out and I’ll be sliding around on the wave. If you work hard enough you’ll find the line that works for you, and if you hold that for long enough you’re going to create something.”Don’t be put off by all the challenges, though. While winter surfing and the more ambitious surfing in Cow Bay may only be a lure for people seeking maximum adventure (please see previously mentioned gnarlyness), there are friendlier waves nearby, point breaks meant more for a Johnny Utah than a Bodhi, at sandy beaches like Rainbow Haven and Lawrencetown (please see previously mentioned bodaciousness).Jenner Cormier actually surfed with Jamie a number of times before he knew who he was. Jenner grew up in Lawrencetown, not Maine, so he didn’t have to travel as far either Dean or Jamie to surf in the bay—just 20 minutes—but he always surfed more at Lawrencetown Beach anyway. There you only have to pick your way over a few rocks before your toes sink softly into the sand. As a teenager he took a free surf lesson from one of the local surf schools that pepper the beaches in the area and was immediately hooked, spending summers surfing there and at Martinique Beach, Seaforth Point, and Cow Bay.“We used to spend a ton of time at the beach growing up, trying to surf on these Styrofoam boards that my parents would buy from the hardware store,” Jenner says. “I swear, we would snap a dozen a summer from trying to stand on them.”A spread at Bar Kismet.\nPhoto by Jessica EminHis teenage dream became the foundation for his adult reality, as Jenner essentially arranged his whole life around surfing. He started working in food service because night shifts meant he could surf in the day. Bartending led to international competitions, which led to winning competitions and then work in Toronto at restaurants like Bar Raval. But the draw of the ocean brought him back East. He now runs Bar Kismet, an old Greek Diner he renovated into a warm but worn feeling space in the North end of Halifax with his wife, chef Annie Brace-Lavoie.The restaurant has used a lot of Off Beet’s produce too: squash blossoms stuffed with ricotta and smoked haddock dandelion greens, speckled trout lettuce and peppers that they have woven into dishes alongside grilled branzino, torched mackerel or charred octopus. Kismet focuses on local seafood, with dishes like the ever-present raw scallop, a half-shell with silky coins of Digby scallop tucked into the curve, made as bright and verdant as a summer day on my last visit with lemongrass olive oil, cilantro stalk, and crisp raw radish. The menu is ever-changing, but constant in its reverence for local seafood and the adroit preparation and plating.Back at Dean’s, those ribs didn’t fare so well. They oversmoked. The steaks toughened up and the corn charred when one of the owners of the new taproom at nearby North Brewing Co. stopped by with a couple of cans of a crisp, a new grapefruit-bitter shandy. He distracted the cook with trip over to inspect the quiver of surfboards tucked into a nearby shed. In the end it didn’t really matter. It was still a great night. Like Dean said, sometimes you get skunked. But then you sit there after sunset, beer in hand, bonfire roaring, waves roaring louder still. And there’s Cassiopeia, shining brightly above you. And the Big Dipper and Leo and Jupiter too.Now that's a good surfing wave.\nPhoto by Jessica EminWhere to Eat, Drink, and Surf in and Around Halifax and the Eastern Shore:Not sure what to do in Cow Bay because moose statues aren’t your thing? Here are some places to drop anchor while exploring Halifax, taking you from the city’s harbor to the rocky shore of Cow Bay and the sandy beaches of the Eastern Shore.The menu at Yeah Yeahs.\nPhoto by Jessica EminYeah Yeahs PizzaSuper playful, very hip pizzeria specializing in New York–style pies in the downtown Dartmouth neighborhood locals call Halifax’s Brooklyn. The rotating Pizza of the Week, or POW, is not to be missed.66 Ochterloney St., Dartmouth; 11 a.m.-8 a.m., dailyBar KismetIn the trendy North End Halifax neighborhood, Bar Kismet has an ever-changing menu focusing on local seafood prepared with French and Mediterranean inspiration. Exceptional cocktail program.2733 Agricola St., Halifax; 5 p.m.–12 a.m., Tuesday–SundayCafé GoodLuckCozy downtown café with a brunch-focused daytime menu offering fresh twists on comfort food and French classics driven by seasonal produce. Evening menu features handmade pasta and inspired salads.145 Portland St., Dartmouth; 8 a.m.–3 p.m., Tuesday and Wednesday; 8 a.m.–9 p.m., Thursday and Friday; 9 a.m.–9 p.m., Saturday; 9 a.m.–3 p.m., SundayAlderney Landing Farmers’ MarketA weekly market overlooking Halifax Harbour featuring some of Nova Scotia’s best local growers and food purveyors, including farms from across the province like Off Beet Farm, cheesemakers, fresh baked goods, and more. Don’t miss Evan’s Fresh Seafoods, which makes some of the best fish and chips, haddock burgers, and lobster rolls in the city. Hop on the ferry across the harbor here.Alderney Landing, Dartmouth; 8 a.m.-1 p.m., Saturdays; 11 a.m–3 p.m. Sundays (weekends only)Two if by Sea CaféA beloved fixture in downtown Dartmouth, this café is the original source for Anchored Coffee. Best known for giant buttery croissants that stretch the definition of the pastry as far as as the dough will let them.66 Ochterloney St., Dartmouth; 7 a.m.–6 p.m., Monday–Friday; 8 a.m.–5 p.m., Saturday and SundayNorth Brewing Co.This cold beer store in Cole Harbour also has a taproom, Side Hustle, where you can snack on one of the city’s best burgers and try all of the beer, including the Lawrencetown Surf Session Ale, a juicy, refreshing IPA with hints of citrus zest and green tea.899 Portland St., Dartmouth; 12 p.m.–7 p.m. dailyEast Coast Surf SchoolYear-round surfing lessons and equipment rentals at Lawrencetown Beach. You can get everything you need from hoods, mitts, and booties to boards.4348 Lawrencetown Rd., East Lawrencetown; 8 a.m.–9 p.m. dailyRose & RoosterThis café and bakery is a great stop for maritime classics like fish cakes and chowder, or for a Sunday brunch if you are headed out to the beaches of the Eastern Shore. Don’t miss any of the bakery’s classic baked treats like lemon and date squares and millionaire’s shortbread.6502 Highway 207, Grand Desert; 8 a.m.–5 p.m. dailyWant more on Canada? Right this way!Explore Bon AppétitCanadaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-07", "author": ["Condé Nast", "Melissa Buote"]}