{"id": "b577726b9beb1cc275fa0721d6389d10", "url": "https://www.bonappetit.com/story/kelly-ripa", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Kelly Ripa Wants Nothing to Do With Keto, Thank You Very Much | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureKelly Ripa Wants Nothing to Do With Keto, Thank You Very MuchThe ‘Live with Kelly and Ryan’ co-host starts her day with ghee coffee at 5 a.m. and ends it with half a PB&J sandwich.By Alyse WhitneyJanuary 22, 2019FacebookTwitterEmailGilbert CarrasquilloFacebookTwitterEmailKelly Ripa is the most upbeat, revved-up, relentlessly positive person on morning TV. How does she get that way? Bulletproof coffee. A little after 5 a.m., the Live with Kelly and Ryan co-host combines the “darkest roast coffee” she and her husband, actor Mark Consuelos, can find with a spoonful of Organic Valley ghee and two shots of espresso, and blitzes it in a blender until frothy. “It fills me up and I feel satiated, so it keeps me from being ravenous during the show,” she explains, since she doesn’t eat anything before the cameras roll.Yep, it's ghee-spiked coffee powering Ripa through Live with Kelly and Ryan\nPhoto by Alex LauThroughout the 18 years that she has co-hosted Live—first with Regis Philbin, then Michael Strahan, and now Ryan Seacrest—she has learned that eating and being on camera don’t mix well. “It’s very, very hard to host a morning show when you’re digesting—my brain almost goes to sleep,” she says. “I’ve tried eating once or twice before the show and it’s always been a disaster.”That said, she does not limit herself when it comes to eating—it just all happens after the show wraps filming for the day. Below, Ripa shares a glimpse into her morning routine (featuring...Madonna?), how she’s handling “post-traumatic election disorder,” the healthyish snacks she eats like candy, and why at 48 she’s eating “whatever the hell I want.”What’s your favorite part of your morning routine?I really love Madonna’s MDNA products—bet you didn’t know she has a full skincare and makeup line! I got the line as a birthday gift and think it’s incredible. I like to put on her rose mist before I put on any moisturizer, and she has an under-eye oil that I think is very moisturizing, and I see a difference with the texture of my skin.Do you use any wellness products?I love a jade roller. I’m not sure if it does anything, but I actually love the way it feels on my face, and I keep it in the refrigerator so that it’s nice and cold. It probably doesn’t do anything, but it feels good. It’s just a nice cooling little way to wake up.Instagram contentThis content can also be viewed on the site it originates from.Do you usually work out with your husband? I’ve seen you doing yoga together on Instagram.Mark and I don’t actually work out together ever unless we are on vacation. There’s this incredible woman in the Bahamas named Tamara Fredericks-Lorey, @yogatambahamas on Instagram, and we worked with her on our 22-year anniversary trip to Harbor Island last year. That was a nice escape. I think that I’ve just been too into the election and the news cycle, and I feel like I have post-traumatic election disorder. I just felt like I’ve been paying too close attention to the news, and I need to disconnect from it for a little bit. I think we all probably do.How do you unwind after an exhausting day?Lately, the kids and I have been watching old episodes of Hoarders on Netflix. I used to watch Hoarders when it was on A&E, and I found it fascinating. After my two youngest kids finish their homework, they climb into bed with me and we watch a few episodes before bed. And then I dream about cleaning things out of my closet because I am truly also very affected by that show.Are there any wellness trends you don’t believe in?I’ve been given more sage to burn than most people. People really believe in the power of sage. I’m not really a sage burner. I try not to let toxicity in my life, so the need to cleanse it is very minimal. That goes for any level, whether it’s people or a work situation, or friendships that are bad for you. I just don’t allow that in my space, and therefore I just have bunches of unburned sage everywhere.What about fad diets?My husband has gone full keto, which I don’t mind telling you is something I could never do. I just don’t have that level of discipline. Mark says that I’m carb-o, because I always eat his bun if he gets a burger. And the fries. But you know, I work out, so I feel like I’m allowed. I’m 48, I’m entitled, and I’m eating whatever I want to eat.What do you snack on in your dressing room?I do enjoy keeping nuts around me at all times, and I don’t just mean the people in my life. [Laughs] I mean almonds and cashews, and I do like dried fruit. I know people will say, “Oh, that’s the jellybean of the healthy snack world,” but for me, dried apricots and cherries are better than candy. I know it has as much sugar, but I just enjoy it. And peanut butter ThinkThin high protein bars, which many nutritionists have told me “are not the best ones,” but I like how they taste.You stay mostly healthy—what’s your “ish”?Mark and I used to have peanut butter and jelly as a bedtime snack. I’m not sure why. Even as a kid, I didn’t really like it, but now here I am. I get ciabatta bread, and now I eat half a sandwich before bed, with chunky Skippy peanut butter or Justin’s honey peanut butter and Bonne Maman strawberry or raspberry jam. Here’s the thing: I’m 48. These are things at 38 I never would have tainted myself with. But at 48, I’m sort of saying, Who cares? Life is short. Eat the peanut butter and jelly.Explore Bon AppétitInterviewsCelebritiesKelly RipaHealthyishGheeCoffeeRead MorecookingWhat Is Ghee, the Clarified Butter We Could Eat by the Spoon?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-15", "author": ["Condé Nast", "Alyse Whitney"]}