{"id": "b588ae569a0b75ec219499a0c1dc1e07", "url": "https://www.bonappetit.com/story/best-cooling-rack", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "The Best Cooling Rack Will Reward You With Crispy Fried Chicken and Tender Cakes | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Cooling Rack Will Reward You With Crispy Fried Chicken and Tender CakesAnd yes, you can use it for sheet-pan cooking too.By Tiffany HopkinsAugust 25, 2021FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.By the time you get to the “let cool” part of the recipe for a sponge cake or a batch of picnic chicken, you’re ready to claim victory and share your masterpiece with the group chat. But don’t get ahead of yourself—properly cooling your food makes the difference between a crispity, crunchity fritter and a sad, soggy pile of grated veggies. And in order to do that, you need a cooling rack. The best cooling rack will ensure that your cakes and cookies stay perfectly moist and that your fried shrimp retain the shatteringly crisp coating that you worked so hard for.Nordic Ware Cooling Rack$17 at Bon Appétit MarketWhy do I need a cooling rack?Baked goods are temperamental. You could pull a flawlessly baked cake out of the oven—one that’s passed the toothpick test and is slightly springy to touch—then cut a slice out of the pan a few hours later only to be met with a crumb that’s tough and dry rather than tender and moist. The problem? You hotboxed your perfect cake by letting it sit in the pan, where it continued baking and overcooked. This can be avoided with a cooling rack, which facilitates quicker, more even cooling. We recommend setting your cake in its pan on a cooling rack for 10 minutes, which allows air to circulate under the pan while it firms up, and then turning it out onto the rack to cool completely.The benefits of a cooling rack don’t stop at baked goods. It’s also the key to keeping your crispy food crispy. A wire rack elevates the food off of a solid surface, so that air circulates and the bottoms of your battered fish fillets don’t get soggy from absorbing residual steam. You also don’t want fried food sitting in its own grease (like these aloo tikki), so the cooling rack allows excess fat to drip off.So I can use my cooling rack for cooling, duh. But can I use it for sheet-pan cooking?You can and should, as long as your rack is labeled oven-safe. The open rack allows hot air to circulate in the same way cold air does, which means both the tops and the bottoms of your oven-baked chicken cutlets will get nice and crunchy. Your food will be slightly elevated from the pan, which means it’ll cook more quickly, more evenly, and attain better all-around browning. Using a cooling rack for sheet-pan cooking is especially good for crispy baked chicken wings or even roasting a whole bird. Think air fryer, but low-tech. You can also use your wire rack so that oven bacon gets nice and crispy as its fat renders—or so that your steak can drip its steaky goodness all over broccolini and white beans. That’s sheet-pan cooking at its finest.So which cooling rack is the best cooling rack?If you want to use your wire rack for cooking in addition to cooling, look for one that is labeled oven-safe and has a grid design to ensure that your food won’t slip through the grates. Note its measurements and make sure the rack fits nice and snug in your sheet pan—there shouldn’t be a lot of wiggle room between the rack and your sheet pan’s edges. We love this Nordic Ware cooling grid which, at 16.75\" x 11.5\", fits perfectly in our favorite rimmed half-sheet pan. It’s high-quality, nonstick, and heat-safe up to 400℉.Nordic Ware Cooling Rack$17 at Bon Appétit MarketIf you’re cooking at higher temps or broiling, go with a stainless-steel wire rack, which is heat-safe to 575℉. Because this one isn’t nonstick, depending on what you’re cooking you might need to give it a generous coating of cooking spray.Kitchenatics Stainless Cooling Rack (Half Sheet)$22 $19 at AmazonAre there any other ways I can cook with my cooling rack?Yes! We highly recommend taking your wire rack to the grill, especially when cooking teensy or thin ingredients like green beans, cherry tomatoes, or squid that could easily fall through the grates. You could invest in a grill basket, but a wire cooling rack is easily stored, and you’ll use it all the time like we just talked about, right? The best cooling racks for your grill will be a bit smaller in size, about 8.5\" x 12\" (the size of a quarter-sheet pan) and have a stainless-steel construction—no nonstick coatings here—for max durability over high heat. Hot tip: Place the cooling rack upside down on the grill so you can grab onto the rack’s feet with tongs to easily move it around.Kitchenatics Stainless Cooling Rack (Quarter Sheet)$17 $14 at AmazonExplore Bon AppétitToolsShoppingBA RecommendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-07-18", "author": ["Condé Nast", "Tiffany Hopkins"]}