{"id": "b588320647c288a4650591147e83f6ab", "url": "https://www.bonappetit.com/story/steaming-setup", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "How to Steam Anything You Want (No, You Don't Need a Basket) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Steam Anything You Want (No, You Don’t Need a Basket)Once you learn the setup, there’s nothing you can’t steam.By Jessie YuChenJanuary 21, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When I was growing up in Taiwan, steaming was the cooking technique I was most familiar with. Just like how nearly every American household has a microwave, nearly every home kitchen in Taiwan has a Tatung steamer. We use it daily to cook rice, steam buns, and even reheat leftovers. It’s considered the most basic piece of cooking equipment—the appliance everyone needs to own in order to survive college. Until I moved to the U.S., I didn’t think I could live without one in my kitchen.Tatung Electric Steamer$143 $120 at Amazon$140 $98 at Wayfair$137 at TS EmporiumBut as I became more familiar with cooking on a gas stove, I learned to steam dishes using a wok setup, which allows me to steam bigger items and control the heat better than I could in my Tatung (it’s an amazing appliance for anyone who wants consistently perfect rice, but it’s limited to what can fit inside it). Once you learn how to rig a steamer with a few pieces of common kitchen equipment, on the other hand, there’s nothing you can’t steam—from fresh crabs to silky steamed eggs to whole fish—and you don’t need a special machine to do it.Here are a few tips I learned from Taiwanese home kitchens for building and using a simple setup so you can steam pretty much anything you want without relying on steaming baskets or an electronic steamer.Here’s how to steam:To make a simple DIY steamer, you need only three items (and you might already have them in your kitchen). The first is a deep vessel to cook in, be it a wok, pot, or deep pan. The size of the vessel depends on the size of the food and/or the cooking container. If you’re steaming in a bowl or on top of a plate, that bowl or plate needs to fit completely inside the vessel.The next thing is a lid to trap the steam. When covered, the lid should not be touching the food. (Imagine your dumpling’s skin sticking on the lid, breaking and losing all the juice—you don’t want that.) It’s helpful to have a dome lid, which provides more overhead room for steam to collect and prevents your food from getting smashed.Heavy Duty Dome Lid$20 at AmazonFinally, you need something to keep the food from touching the water—otherwise you’ll just be boiling. You can use any heatproof item, like an inverted wide bowl that can act as a stand in the boiling water—even three aluminum foil balls would work in a pinch. But my preference is a round cooking rack. Found in most Asian grocery stores and also available online, they’re reusable, sturdy, and just the right size, height, and shape for the job.Round Cooling Rack, Set of 3$14 at AmazonTo steam, place the rack in the center of the pot. Add about an inch of water—it shouldn’t be touching the highest part of the rack. Cover the pot and turn the heat to medium. When you hear the water boiling or see steam coming out, you’re ready to start. Add your food, re-cover the pot, and let it cook according to the recipe (or your liking).A tip for removing handling hot dishes (and avoiding painful steam burns): Use a hot dish clip. Yes, dry towels or mitts are chefs’ best friends in the kitchen when handling burning hot pans. But it’s much easier to use the clip to retrieve the dish, especially when towels tend to get wet from steam or boiling water. From Taipei to New York, I always keep a hot dish clip in my kitchen.Stainless Steel Gripper and Clamp$19 at AmazonAs soon as you’ve mastered this basic setup, you can steam almost anything you want at home with what you already have available in the kitchen. All that’s left to do is decide what to steam first. I think these jiggly, custardy steamed eggs are a great place to start.Get steamySilky Steamed Eggs With MushroomsThese savory and oh-so-simple steamed eggs are the definition of cozy comfort food.View RecipeExplore Bon AppétitcookingtechniqueShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-21", "author": ["Condé Nast", "Jessie Yuchen"]}