{"id": "b59078fb7e04f1632accadda6a9ff40c", "url": "https://www.bonappetit.com/story/never-fail-citrus-vinaigrette-pork-chop-recipe", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "This Pork Chop Recipe Is Preeeetty Much Impossible to Mess Up | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Pork Chop Recipe Is Preeeetty Much Impossible to Mess UpI thought pork chops were a dry, sad, never-make-at-home dish. This recipe changed my mind.By Alyse WhitneySeptember 21, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWhen I was a kid, pork chops were one thing: thin-cut, Shake ‘n Baked, and dry. They were usually served with those boxed mashed potato flakes that my parents added water to in order to make them...mashed potato-ish. Suffice it to say, I thought I hated pork chops and mashed potatoes for most of my life. But then I had a transformative experience eating a Berkshire pork chop at Riverpark, one of Tom Colicchio’s restaurants in New York City, about eight years ago. It was grilled with peaches and cipollini onions, perfectly pink in the middle, and incredibly juicy. I vowed then and there to start making pork chops at home, but it wasn’t until...seven years later...that I actually did the damn thing.Our juicy pan-seared pork chop recipe was the ideal point of entry into pork chop cookery, because it has a built-in fail-safe for not overcooking the chops. Pork can get dry and tough very easily, even if you just accidentally leave it in the pan a few minutes after the heat is off. There are two nifty tricks with this recipe: You basically only cook the chops on one side and kiss them with heat on the other, and you smother them with delicious citrus vinaigrette after to really guarantee there is no shortage of juiciness and flavor. The dressing is made mostly of things you probably have on hand: lemon zest, juice, garlic, mustard, oregano, cumin, sugar, olive oil, and cilantro. I have made it without cilantro and it’s fine, albeit a little less bright and herby.A little sugar helps things caramelize nicely.\nPhoto by Alex LauThere is another sneaky part of this recipe that ensures your meat caramelizes: a little sugar sprinkled over one side of the four ½-inch-thick chops so they get as deeply bronzed as possible. This all happens quickly—5 minutes on the first side, 1 minute on the second, and a 10-minute rest in the skillet for carryover cooking—giving you time to roast vegetables, make a pot of rice, or dress a salad, depending on how lazy you are. OH, AND THE BEST PART: you whisk the pan juices from the pork into the dressing! Everything in life should be more porky.PAN JUICES IN THE DRESSING, HELL YEAH.\nPhoto by Alex LauSince I am a single woman who lives in a studio apartment by myself, I usually just make two pork chops. But if I want leftovers for lunches throughout the week, I make extras, slice them up after they’ve rested, and make rice bowls. I’ve found that if you just zap the pork in the microwave for a minute or less, it doesn’t overcook and get dry or rubbery. But it is just as good tucked into summer rolls or on top of a salad. Also: Make extra citrus dressing. It goes great on Bibb lettuce with crunchy vegetables and sliced pork.Pork chops still aren’t my everyday weeknight dinner, but whenever I get a craving, I know I’m only 15 minutes away from the juiciest ones ever. Now I am going to send this recipe to my mom, who may still Shake ‘n Bake for her and my dad, and hopefully start a new Whitney family tradition.Get the recipe:Juicy Pan-Seared Pork Chops with Citrus DressingRather than marinating ahead of time, which, let’s face it, doesn’t work on weeknights, we came up with a citrus-mustard-cilantro dressing that bathes the chops in punchy flavor.View RecipeExplore Bon AppétitBasicallyPorkPork ChopNever FailRead MoreJuicy Pan-Seared Pork Chops with Citrus Dressingtest-kitchen4 Weeknight Dinners You Can Throw Together After WorkBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-21", "author": ["Condé Nast", "Alyse Whitney"]}