{"id": "b590b2e11d847e03756ee6507798d7ac", "url": "https://www.bonappetit.com/recipe/blt-wraps-with-horseradish-mayonnaise", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "BLT Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2018 IssueBLT Wraps with Horseradish MayonnaiseBy Molly BazJuly 10, 20182.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintThe classic components of a BLT get enhanced with a spicy, zesty horseradish mayo—the ideal foil for ripe summer tomatoes and salty bacon.Ingredients4 servings2oz. country-style bread, preferably day-old, torn into 1\" pieces (about 1½ cups)1lb. thick-cut bacon½tsp. kosher salt, plus more½cup mayonnaise1Tbsp. finely grated lemon zest4tsp. fresh lemon juice2tsp. prepared horseradish1tsp. freshly ground black pepper3heads of Little Gem lettuce, leaves separated, covered, chilled1pint cherry tomatoes, halved1cup basil leavesLemon wedges (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 350°. Spread out torn bread on a rimmed baking sheet. Set a wire rack in baking sheet over bread and arrange bacon on rack (it’s okay if strips overlap a bit; they’ll shrink as they cook). This setup will crisp the bacon, and as the bread becomes enriched with some of the drippings, it will get nice and toasty. Bake 20 minutes. Remove from oven and turn bacon. Carefully tilt baking sheet to pour off any fat into a small bowl; reserve for another use if desired. Return to oven and bake until bacon is brown and crisp and breadcrumbs are golden brown, about 20 minutes more. Transfer bacon and toasted breadcrumbs to separate paper towels to drain.Step 2Slide breadcrumbs, still on paper towels, to a cutting board and crush into very small pieces with a flat-bottomed measuring cup. Season with salt, place on a small plate or in a small bowl, and set aside for serving.Step 3Meanwhile, whisk mayonnaise, lemon zest, lemon juice, horseradish, pepper, and ½ tsp. salt in a small bowl to combine; set aside.Step 4Arrange bacon, lettuce leaves, tomatoes, basil, and lemon wedges on a platter or on a couple of plates and in bowls so that each component is visible and easily accessible. Set out kitchen shears next to bacon for cutting to size. Serve with breadcrumbs and reserved horseradish mayonnaise (for spreading over lettuce).How would you rate BLT Wraps with Horseradish Mayonnaise?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleIf this is a wrap, shouldn't there be WRAPS in the list of ingredients?\nAnd toasted breadcrumbs in a wrap?Anonymouscoastal Alabama9/6/2020I made a salad-ified version of this -- a wrap just didn't feel like it set me up for the right ratio of ingredients. I chopped up Boston lettuce (what I had at my loval grocer), toned the horseradish down a bit, but tossed the rest of the ingredients together. YUM. The breadcrumbs and bacon are so rich and salty, the tomatoes cut through it nicely, the basil is a fitting surprise addition to the BLT format, and the dressing is so delightful.AnonymousHouston, TX8/16/2019Explore Bon AppétitSandwichWrapBaconCured MeatMeatLettuceLeafy GreensVegetableCherry TomatoTomatoHorseradishHerbs & SpicesSummerEasyWeeknight MealsSheet-Pan DinnersMainNut-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-10", "author": ["Condé Nast", "Molly Baz"]}