{"id": "b5a54a4ff2312fd50f5d442f5bf6b1e1", "url": "https://www.bonappetit.com/story/best-toaster-oven", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "The Best Toaster Oven Is Versatile, Compact, and Can Replace Your Full-Size Oven | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Toaster Oven Is Versatile, Compact, and Can Replace Your Full-Size OvenThe Panasonic FlashXpress is my only appliance worthy of precious countertop space.By Sonia ChopraSeptember 27, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Due to professional circumstances, I know a lot of people who not only have a favorite kitchen tool but like to wax rhapsodic about them. Usually these tools are utensils: Microplanes, fish spatulas, offset spatulas, chef’s knives. Sometimes they are certain pans or storage containers or gadgets. For me, it’s the toaster oven, which is my most-used kitchen appliance.The one I own—the one every single person in my family owns, actually, as though getting one is a level that must be unlocked in the simulation of our lives—is the Panasonic FlashXpress Toaster Oven. Unlike my Instant Pot, KitchenAid mixer, and Vitamix blender, it resides in a place of honor on my countertop, out in the open for everyone to see. Partially this is because of its modest footprint—only 12x13\". Mostly it’s because it is the best thing in my kitchen.Photo by Isa ZapataPanasonic FlashXpress Toaster Oven$170 at Amazon$160 at Michael'sWhy is the Panasonic FlashXpress the best toaster oven?With a compact design—although it can still fit up to four slices of bread—and a $150 price tag, this stainless-steel toaster oven is versatile but less expensive than a big, fancy, bells-and-whistles toaster oven (more on that later). It has one infrared heating element toward the front and another in the back for speedy, even cooking and maximum efficiency with no preheating required. In addition to its temperature controls, which go up to 500 degrees, it has six preset cooking functions for toast, frozen waffles, rolls, pizza, hash browns and french fries, and reheating leftovers. It also has a removable crumb tray, an interior oven light, and “shade control” functionality so you can tailor your toast to the perfect level of doneness. I appreciate the retractable baking rack; every time I open the door, it’s as if the Panasonic FlashXpress is presenting me with a tiny gift of a gently warmed brownie or perfectly toasted cashews.Besides four slices of toast, what can I cook in my toaster oven?This toaster oven does so much. It toasts bread, as you’d expect. It bakes cookies and brownies and summer-fruit cakes without raising the temperature in my apartment the way the full-size oven would. It roasts veggies of all kinds, from Sungolds that burst into saucy perfection to heartier items like root vegetables and brussels sprouts. (My favorite Thanksgiving tip: Roast your brussels sprouts in the toaster oven to save on valuable oven real estate.) It turns tofu crisp and bakes marinated paneer; it cooks salmon and chicken breasts and basically anything you can fit into an 8x8\" square pan. It toasts nuts; it reheats meals if you, like me, don’t have a microwave; it handles frozen pizza and waffles marvelously. I love it so much that I feel bad for calling the other oven in my home the “real” oven—I definitely use this one much, much more.The Panasonic FlashXpress is the best small toaster oven out there, and I recommend it to everyone and anyone. But I accept that perhaps your needs are different from my own. I got you.If your oven is busted and you really need to roast a chicken:If counter space and money are no object, seek out the Breville Smart Oven Pro. When professional baker Yossy Arefi’s regular oven broke, she tested all the recipes for her cookbook Snacking Cakes using this very oven! The Smart Oven Pro holds its temperature consistently and, at 15.75x18.5\", it can accommodate a quarter-sheet pan or a 9x13\" baking dish. It toasts, roasts, bakes, slow-cooks, and broils—you can even fit a whole chicken in there.Breville Smart Oven Pro$525 $280 at Sur La Table$280 at Bloomingdales'sIf you have a small kitchen. Like, a really small kitchen:You, friend, should consider the Dash mini toaster oven. It’s adorably petite at only 9x9\"—perfect for a dorm room—and comes in a variety of pastel colors like butter yellow and peony pink. Former art assistant Annalee Soskin kept one of these at her desk for her toasting her morning bagel or heating up those midafternoon pizza bites. This is not going to be your kitchen workhorse by any means, but this compact toaster oven is cute, it’s tiny, and it works.Dash Mini Toaster Oven$25 at Amazon$25 at TargetIf you desire a toaster oven that’s also an air fryer:Air fryers use a little convection fan to circulate hot air and achieve max crispiness. Some toaster ovens come with a convection setting, so if you’re in the market for a combo appliance, we recommend the Breville Smart Oven Air Fryer Pro. If you have a lot of counter space (this thing is big at 21.25x17\") and want a toaster oven that can both roast a 14-lb. turkey and dehydrate mushrooms, you’ll love the Breville’s large capacity. The Smart Oven Air Fryer toaster oven is equipped with a digital display and six heating elements that automatically adjust according to your setting selection. When you want to air-fry some sesame-coconut chicken tenders, set it to “Super Convection” and your food will emerge extra-crispy (the setting also reduces cooking time by 30%). This convection toaster oven also comes with two heavy-duty oven racks, an enamel baking pan, a nonstick pizza pan, and a mesh basket for air-frying.Breville Smart Oven Air Fryer Pro$750 $400 at Sur La TableIf you need a designer toaster oven for your designer kitchenThere’s only one countertop toaster oven sold by the MoMA Design Store, and it’s Balmuda’s The Toaster. This Japanese stunner comes in colors like matte black and an incredibly sophisticated shade of greige. Compared to all the buttons and displays on Breville toaster ovens, it’s minimalist in design with just two knobs—one for cook modes and one for cook time. It also comes with a delightful mini coffee cup that holds exactly a teaspoon of liquid. Fill the mug—which looks like it’s sized for a mouse—with water and pour it into the oven’s reservoir before turning it on; the Balmuda will then release steam into the interior (you’ll hear a pleasant hiss and see the glass fog up), which allegedly toasts bread more quickly while sealing in moisture and flavor. While we can’t say we can taste the difference between steam-toasted bread and traditionally toasted bread, Balmuda’s The Toaster works like a charm, has a small footprint (12.6x14.1\"), and is so beautifully designed that it’s practically an objet.Balmuda The Toaster$299 at Amazon$330 at Sur La TableTiffany Hopkins contributed additional reporting to this piece.Explore Bon AppétitShoppingToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-27", "author": ["Condé Nast", "Sonia Chopra"]}