{"id": "b5b0493ec1f59eab781ac882627f2794", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/philippe-the-original", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Philippe the Original Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesPhilippe the OriginalDip to your heart’s content at this legendary Downtown L.A. sandwich shopFacebookPinterestTwitterEmailRen FullerGO: for a very messy but very satisfying meal of jus-kissed French bread and tender roast beef at Philippe the Original.ORDER THE: beef double-dip, in which each slice of bread is soaked ever so slightly with aromatic beef jus, or the sleeper hit: lamb dip with blue cheese.THE VIBE IS: Dodger land. (Don’t even think about wearing any other baseball uniform or hat.) Since it’s close to the stadium, you’ll find just as many customers wearing blue as cashiers in the front taking your order. The decor is a little drab, with fluorescent lights and brick-hued tables with wobbly stools, but you won’t mind, or notice, once you get into that sandwich.PRACTICAL STUFF: Open every day: 6 a.m. to 10 p.m.—Elyse InamineRen FullerWE ALSO LOVEBay Cities Italian Deli & BakerySuper Italian-style sandwiches in Santa MonicaLanger'sL.A.’s unbeatable pastrami sandwich (sorry Katz's)Son of a GunThe seaside homage from L.A.’s most dynamic chef duo (and home to a great chicken sandwich)Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}