{"id": "b5b4bf47787b20f239cc2ca90a8b6d2a", "url": "https://www.bonappetit.com/story/napa-butter-cream-bakery", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "Napa Has Changed, Butter Cream Bakery Has Not | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsNapa Has Changed, Butter Cream Bakery Has NotLet’s just say no one’s going there for the tasting menu and wine pairings.By Kira GarciaJune 6, 2018FacebookTwitterEmailPhoto by Emma K. MorrisFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Butter Cream Bakery is a pink-and-white-striped beacon of sugar and caffeine on a four-lane strip in the heart of Napa, California. Inside you’ll find glass cases crammed with apricot danishes, pink-glazed doughnuts, and birthday cakes glowing with artificial color, all baked in-house. If you’re in the mood for something more substantial, Butter Cream is also the city’s only real diner and has been slinging perfect eggs, hash browns, and tea in small pink plastic pots since the 1940s.While the phrase “Napa dining” conjures images of supple summer produce, local cheese, and carefully curated wine pairings, when I was growing up there in the ’80s, our meals weren’t quite so glamorous. Sure, our tomatoes were always red, and our golden hills were always gorgeous, but back then the town looked a lot more like Central Valley than Silicon Valley. It was pickup trucks with NRA bumper stickers not Teslas with vanity plates.Not what you would expect in Napa.\nPhoto by Emma K. MorrisAs a teenager I sulked over Nirvana songs at Napa High and plotted my escape to the city, really any city, eventually landing in New York. Two things comforted me there in my early uncomfortable years as a displaced Californian: quiet walks through the American Museum of Natural History and solo dates at a diner on the Upper West Side. I’m not the first to say that diners are a balm for loneliness. They aren’t homes away from home; they’re something better: reliably comforting places where a cross section of patrons sit alone together, bonding over their need for caffeine and carbs. Whether you’ve just picked grapes for 10 hours or pulled an all-nighter in the Columbia library, nothing will cure you like a grilled cheese and a side of fries.I started to look for diners everywhere I traveled and found Butter Cream, again, after years of overlooking it on visits home. Here were the same ball-capped dudes eating alone at the counter, probably occupying the same seats since ’86. Here were the doughnuts glazed in maple icing so sweet it hurt my teeth (in a good way). I settled in over eggs and bacon and introduced my son to the joy of bear claws and jam-filled scones.The kind of place where you always want to be.\nPhoto by Emma K. MorrisButter Cream has kept its candy stripes, but Napa has changed, of course. Its once-sleepy downtown is now a strip of luxe hotels and high-heeled tourists clad in fur vests, who’ve become more visible as Napa’s working- and middle-class residents trickle out to more affordable towns. Gentrification has made its mark, but the city has evolved for the better too: My high school’s Native American mascot was retired recently after years of public outcry. Though I’ve been long gone, I feel a little misty-eyed pride with every step forward the city takes.Despite its transformation from a backwater to a bachelorette destination, Napa holds on to the best of its old-school treasures. It’s a city that refuses to fully participate in any bright, shiny future that doesn’t include sheet cake and bottomless coffee cups. I cherish this stubborn attachment to the past because it means I can return, again and again, to Butter Cream’s fluorescent-lit breakfast tables.These days weekending urbanites in expensive sunglasses wait for tables alongside locals with whining kids. I stand with them, somewhere in-between I guess, hoping Napa continues to save a space for each of us.Kira Garcia is a writer based in New York.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsNapaRead MoresponsoredTaking the Leap for Organic Wine in NapaBy Edward JonescultureChef Christopher Kostow Stealthily Masters Napa ValleyBy Chris YingPhotography by Peden + MunkcultureThe Silverado Pickups Are a Rockabilly Band Made Up of Napa Valley WinemakersBy Mickey RapkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Kira Garcia"]}