{"id": "b5c9f8e50ff29c06a6b49d5f450b38b6", "url": "https://www.bonappetit.com/story/honeydew-fruit-salad-recipe", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "You’re Gonna Try This Fruit Salad and You’re Gonna Love It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou’re Gonna Try This Fruit Salad and You’re Gonna Love ItA weekly dispatch from Bon Appétit food director Carla Lalli Music.By Carla Lalli MusicJune 21, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Everyone was wrong about this fruit salad.If this was Jeopardy! and Alex Trebek said that the category was “Foods People Love to Insult,” I would smack the buzzer and yell at the top of my lungs, “WHAT IS FRUIT SALAD?”But the recipe I’m making on repeat this summer is exactly that—a salad starring honeydew melon. My only regret is having wasted a bunch of previous summers without it in my life.Listen, I get why fruit salad is one of the most eye-rolly foods on the planet. The fact that every day—in airports, cafeterias, produce aisles, and Starbucks across the land—people are bullied into purchasing 16-ounce plastic cups filled to the brim with a mix of slimy bananas, cut-up oranges, and battered strawberries is an affront and an insult. Mostly, it’s insulting to the fruit. And that’s why “fruit salad” is such a bad word (don’t Google that, though—it means something else).Want this letter before it hits the website? Sign up for our newsletter!To make matters worse, there’s a special level of disdain reserved for honeydew. Lucky cantaloupe gets to kick it with ribbons of fancy prosciutto. And watermelon has achieved new heights ever since they figured out how to get rid of all those annoying seeds. But honeydew is the stuff of scented candles, Midori liqueur, and bad hotel buffets, where it is usually offered in its crunchy, flavorless form. I thought for sure that legendary food historian Jane Grigson would have something nice to say about it in her Fruit Book and found this instead: “Its main advantage is cheapness.” How’s that for shade?!?This salad is the best PR that honeydew could ever get. Obviously, buy a ripe melon, which shouldn’t be difficult this time of year. Whether you are shopping at a supermarket or your neighborhood’s farmer’s market, root around in the bin until you find a fragrant, heavy one. Then, make some DIY pistachio oil with toasted, crushed nuts stirred into olive oil. Slice up the honeydew and some fennel and introduce them to each other. Remember, honeydew, should be sweet, fragrant, juicy, musky, and tender. Fennel is crisp, herbaceous, and delicate. They go together—trust me. Get some of that crunchy, green-on-green nut oil involved, then bring in lemon and vinegar, the acidic ingredients that will temper the sweetness in the fruit and get the juices of the fennel going. Basil, a sweet herb with licorice qualities, bridges the link between the melon and the fennel. A little heat from crushed chile perks up the party like the nubby insoles on a pair of athletic slides. You are moments away from being both refreshed and sated.You might think I’m crazy for throwing so much weight behind an adorably-named gourd. Well, ever since I had children, I’ve gotten really good at convincing people to try foods that they think they hate. This pastel-green-on-pale-green salad sounds good, and it looks good. If you make it and don’t like it, at least we can both say we tried.Get the recipe:Honeydew and Fennel Salad with BasilIf you have a perfectly ripe melon—great! If you don’t, no worries. The salt, acid, and a bit of heat here will give life to lackluster specimens.View RecipeExplore Bon AppétitFruitSaladCarla NewsletterRead MorecookingThis Savory Fruit Salad Is a Summer Game-ChangerBy Sara KramertechniquesYour Caprese Salad Doesn't Need TomatoesBy Alyse WhitneyLifestyleWe're Living In an Era of Actually Good Fruit SaladBy Karen PalmertechniquesThis Isn't Your Mother's Fruit Salad (Love You, Mom!)By Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Carla Lalli Music"]}