{"id": "b5cf92f07f5e43ca44413e54d4d99a9f", "url": "https://www.bonappetit.com/story/smoke-signals-bakery-tara-jensen-a-bakers-year", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "The Smoke Signals Bakery Cookbook Is Finally Here: Inside 'A Baker's Year' by Tara Jensen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Long-Anticipated New Cookbook from a Teeny Bakery in North CarolinaPart cookbook and part diary, Tara Jensen's first book is anything but traditional.By Sarah JampelJuly 17, 2018FacebookTwitterEmailThe finished sunflower loaves crackle as they cool.Peter Frank EdwardsFacebookTwitterEmailFor Tara Jensen, the baker, artist, and teacher behind Smoke Signals Bakery in Asheville, North Carolina, the goal has never been wild commercial success or mainstream availability. As Julia Kramer wrote in 2016, Jensen “structures her life around the rhythms of a wood-burning oven, not the demands of a high-volume production facility.” We will never find Jensen’s bread in a California supermarket—and that’s part of its appeal.It’s no surprise, then, that her new cookbook, A Baker’s Year: Twelve Months of Baking and Living the Simple Life at the Smoke Signals Bakery, is not a straightforward, nuts-and-bolts baking textbook. Part journal, part self-help book, part sketchpad, and, yes, part cookbook, it’s a personal, poetic peek into her life over twelve months, a stand-out publication in an age when, as she argues in her introductory letter, we favor touch screens over face-to-face contact and the appearance of bread to the bread itself. “Be concerned with more than just looks to achieve a bread that doesn’t leave the heart bitter and the stomach empty,” she instructs. “Bread should look, first and foremost, like it came from somewhere.”And your bread will look like it came from you. Jensen does not—she cannot!—offer instruction that would allow us to replicate the perfectly rustic sourdoughs and festooned pies that have earned her so many Instagram followers. She calls for freshly-milled, regionally-specific grains, for a cornmeal called “Bloody Butcher,” for bee pollen, sorghum syrup, edible flowers, and many other ingredients you may not find at your local store. Unless you can recreate Jensen’s exact environment, your pies, cakes, and breads will not be mistaken for hers. And that’s okay.Jensen talks about baking like many people talk about yoga: your practice, your breath, your intention. She asks us to be patient and resilient and independent. We will learn to take baking into our own hands; we will fail, adjust, and note-keep. She does not outline a guide to pie-decorating because she is confident that we can be artists, too. “With enough practice, your own voice will emerge.”Tara Jensen at her bakery Smoke Signals in 2016. She lets her loaves rise in simple, inexpensive wicker baskets lined with cut-up flour sack towels.\nPeter Frank EdwardsThe headnotes are short, and many are more evocative than informational. “Sweet and tangy and a little out of the box. Just like my new crush, ” she says of her peaches and rhubarb pie. \"Aromatic and toothy like a bouquet of honey and flowers,” she says of her spelt waffles. It might be easiest to decide what you’d like to bake first based on how you’re feeling at the moment.Even if you’re not a baker at heart, you can still learn something. Jensen tells us how to nurture a sourdough starter, sure, but also how to take a deep breath (start by finding a comfortable space) and host a Sunday night pizza party. You might even get inspiration for tonight’s dinner: coriander-sage pancakes brushed with a honey-balsamic glaze and served with pickled onions, capers, and cheese, or pizza with roasted spinach and roasted turnips. Her “yard sauce”—the pet name for a pizza dressing made from olive oil blitzed with an entire head of garlic, lemon, and herbs—sounds like something you’d be wise to make every week to toss into pastas and salads.Jensen encourages readers to look for pie-decorating inspiration in needlepoint, cross-stitching, and weaving images.\nPeter Frank EdwardsIt’s an eclectic mix, but one that reflects Jensen’s desire for her cookbook to be more than that. “She wants her book to contain stuff about, like, the moon. About astrology and poetry,” wrote Kramer back in 2016. “And people said, Okay, that’s great, but do you have any recipes?”Photo by Tara JensenThis book is Jensen’s victory. A Baker’s Year closes with an outline of the lunar cycle from new moon to waning crescent, followed by instructions for setting a new moon intention, and and a handful of recipes for lofty, single layer “moon cakes”: Full moon is what we know to be yellow cake; new moon, a deep chocolate; waning moon, a sunny turmeric-orange; and waxing moon, a hearty spice cake with apple, walnuts, and ginger.“Bake the full moon cake two or three times before moving on to the other cakes. You may forgo the timer and the notepad once you learn the rhythm, but perhaps you will enjoy it, bringing the ritual of goal-setting and journal writing with you into your baking.” And when the intention is a great cake, the practice isn't so bad.Get the recipe:Full Moon CakeTara Jensen's moon cakes are about using the ritual of baking as a practice of remaining present, reflecting, and setting goals.View RecipeBuy it: A Baker's Year, $17 on AmazonOnce you've made bread, it's time to make butter:Explore Bon AppétitCookbooksBreadPieCakeBakeRead MoreLifestyleThe New Frontier of Dessert Is Local FlourBy Aliza Abarbaneltest-kitchenHow to Make the Best Blueberry Pie and Maybe Also Find LoveBy Rick MartinezcookingA Gluten-Free Bread Recipe That Doesn't Taste Like Giving UpBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Sarah Jampel"]}