{"id": "b5da8c093293a36305a1b58e3346f315", "url": "https://www.bonappetit.com/recipe/raspberry-tahini-thumbprint-cookies", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Raspberry-Tahini Thumbprint Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueRaspberry-Tahini Thumbprint CookiesBy Kendra VaculinFebruary 8, 20224.7(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Stephanie YehEmailPinterestPrintEmailPinterestPrintThese jam-bellied cookies don’t rely on tahini alone for their nuttiness—they also have a subtle touch of almond extract that boosts the natural sesame flavor along with bursts of toasty seeds. Use any flavor jam you like and feel free to choose one hue of sesame seeds (though the combination of black and white makes for the most stunning appearance). To keep these as chewy and tender as possible, pull them from the oven while they’re still soft—they’ll firm up as they cool on the baking sheets.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonAteco Bowl Scraper$3 At AmazonScale$25 At AmazonMedium #40 Cookie Scoop$16 At AmazonIngredientsMakes about 301½cups (188 g) all-purpose flour1tsp. baking powder1tsp. Diamond Crystal or ½ tsp. Morton kosher salt1large egg½cup (100 g) granulated sugar½cup (packed; 100 g) light brown sugar½cup (1 stick) unsalted butter, room temperature¼tsp. almond extract (optional)½cup well-mixed tahini¼cup black sesame seeds¼cup white sesame seeds⅔cup raspberry jamPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 375°. Whisk flour, baking powder, and salt in a medium bowl to combine. Beat egg, granulated sugar, brown sugar, butter, and almond extract (if using) in the bowl of a stand mixer fitted with the paddle attachment on medium speed until light and fluffy, about 3 minutes. Add tahini and beat, scraping down sides of bowl as needed, until combined. Reduce speed to low and add dry ingredients in 2 additions, mixing until completely combined after each addition. (Dough will be soft at this point.) Cover bowl and chill dough 30 minutes.Step 2Mix black and white sesame seeds in a shallow bowl or dish. Working one at a time, scoop out dough by the tablespoonful and roll into balls. Roll each ball in sesame seeds to coat and divide between 2 parchment-lined baking sheets, spacing about 2\" apart.Step 3Bake cookies until slightly puffed and spread, 6–8 minutes. Remove from oven and press handle of a whisk or wooden spoon about halfway down into the center of each cookie to create a small well (the cookies will be too hot to use your thumb). Dollop about ½ tsp. jam into indentation in each cookie. Return cookies to oven, rotating baking sheets top to bottom and front to back, and bake until golden around edges and jam is beginning to set, 6–8 minutes. Let cookies cool on baking sheets before eating. (They will be soft right out of the oven but will firm up as they cool.)Do ahead: Cookies can baked 1 day ahead. Store airtight at room temperature.How would you rate Raspberry-Tahini Thumbprint Cookies?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleNew favorite. Doubled the almond extract as previously recommended and used Heidi's Raspberry Red Chile Ginger jam for the filling. Delicious!JenCNew York, NY3/12/2022I made these twice this week - they went fast the first time and are sure to go fast this time. One tip - if you find not enough seeds are sticking to the dough as you make the balls, dip it in water before rolling it in seeds. More will stick. \n\nIf you like sesame, these are perfect. I didn't have the almond extract on hand and they were still very flavorful. Only slightly harder than chocolate chip cookies due to the two-stage cook and 1/2 hour wait time for the dough to firm up, but they look and taste special. Chef JohnnyCalifornia3/12/2022Easy and delicious.  Doubled the almond extract and wouldn’t advise skipping it.  Fantastic cookies. StephanieSan Diego2/27/2022These were a real treat — add in the varied textures and tastes factor and a home run hit. Thumb print styles are always great for littles in the kitchen too. Our 9, 8, and 4 year old got in in the action. Thank you!@blondeappleCT2/27/2022So delicious and so easy to make! Almond extract is very subtle and enhances the cookie favor.Cassandra Jersey City, NJ2/22/2022These are delicious. They are buttery, nutty, and a little tangy from the raspberry jam. I did add the almond extract, it is a light flavor; may even double it next time. Loved these!Heather Orlando, FL2/20/2022Explore Bon AppétitDessertBakingCookieTahiniCondiments, Sauces & PastesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Kendra Vaculin"]}