{"id": "b5df886de3975f701afb845d934f3988", "url": "https://www.bonappetit.com/recipe/fusilli-with-battuto-di-erbe", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Fusilli With Battuto di Erbe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2020 IssueFusilli With Battuto di ErbeBy Evan FunkeMarch 17, 20205.0(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis pasta recipe from Evan Funke, chef-owner of L.A.’s pasta temple, Felix Trattoria, evokes the flavors of wild herbs that grow on the hillsides around Bologna, is a great way to use up any leftover herbs and greens in your fridge—use as many or as few as you’d like. Fusilli is an ideal magnet for the fine texture of herby spring batutto (which just means a chopped up sauce).Ingredients4 servings1¼cups extra-virgin olive oil, divided1garlic clove, smashed1oz. mixed hardy herb leaves (such as rosemary, sage, thyme, and/or marjoram; about 1 heaping cup)1tsp. fennel pollen (optional)7oz. tender spring greens (such as arugula, dandelion, and/or broccoli rabe leaves; about 5 cups)5oz. mixed tender herb leaves (such as mint, basil, lovage, celery leaves, and/or parsley; about 6 cups)½tsp. kosher salt, plus more1lb. fusilli (spiral-shaped pasta)Parmesan, for servingPreparationStep 1Heat ¾ cup oil in a large Dutch oven or other heavy pot over medium until shimmering. Add garlic, hardy herbs, fennel pollen (if using), and red pepper flakes and cook, stirring often, until oil around garlic starts to sizzle slightly and garlic begins to turn golden brown, about 2 minutes (be careful when you add the garlic as the oil may spatter). Add spring greens and tender herbs and season with a couple pinches of salt. Cook, stirring often, until greens and herbs are wilted and bright green, about 2 minutes. Scrape herb mixture onto a rimmed baking sheet; spread out and let cool slightly. Reserve pot.Step 2Transfer herb mixture to a blender or food processor and add ½ tsp. salt and remaining ½ cup oil; blend on high speed until you have a coarse purée. Taste pesto and season with more salt if needed.Step 3Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain pasta, reserving 1 cup pasta cooking liquid.Step 4Scrape pesto back into reserved pot and add pasta and ¾ cup pasta cooking liquid. Set over medium-low heat and cook, tossing vigorously and adding more pasta cooking liquid if needed, until warmed through and pasta is coated (do not let pesto come to a boil), about 1 minute. Taste and season with more salt if needed.Step 5Divide pasta among bowls. Using a mandoline or vegetable peeler, shave parmesan over pasta.Do ahead: Pesto can be made 1 day ahead. Transfer to a bowl set in a larger bowl of ice water and let cool. Remove bowl with pesto from water; cover tightly and chill.How would you rate Fusilli With Battuto di Erbe?Leave a ReviewTell us what you thinkReviews (1)Back to TopTrianglewhat on earth is fennel pollen?  new to me??AnonymousCanada7/6/2021Explore Bon AppétitPastaItalianEuropeanFusilliPasta & NoodlesArugulaLeafy GreensVegetableDandelion GreensMintHerbs & SpicesBasilMainSideNut-FreeVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-17", "author": ["Condé Nast", "Evan Funke"]}