{"id": "b5e0d0fe3c2c4096fba1f0ace39d7444", "url": "https://www.bonappetit.com/story/saucy-glossy-pasta", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Use the Saucy Glossy Technique for the Best Pasta | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingUse the Saucy Glossy Technique for the Best PastaFood director Carla Lalli Music shares tips and tricks for her favorite mushroom and prosciutto pasta in her weekly newsletter.By Carla Lalli MusicOctober 25, 2018FacebookTwitterEmailMichael Graydon & Nikole HerriottFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Sometimes you just need a big bowl of pastaI know for a fact that it’s always pasta season, but it’s hard to get a grip on mushroom season.When are mushrooms “around,” anyway? The answer is sometimes and always. Mushrooms thrive in damp, cool weather, which is why lots of them show up in the fall—the famed and fragrant porcini, ruffly hen of the woods, orange chanterelles, earthy black trumpets, hedgehogs—and friend of the fungi, stinky black truffles, too. If you’re a forager, fall is a great time to be alive. (If you hate mushrooms, you’ve already stopped reading this, which is fine with me because I don’t trust anyone who doesn’t like mushrooms).Want this letter before it hits the website? Sign up for our newsletter!Regardless of where you find your fungi, there’s never not a good time to make pasta with mushrooms, especially when there’s crisp prosciutto, cream, and butter involved. There’s something about the savory flavors of bouncy mushrooms, salty prosciutto, and piney thyme makes me want to pick a chilly night to wrap myself in a sheepskin cape and sit on a sheepskin rug in my sheepskin-lined house slippers and eat a bowl of noodles. Same?The extra-beautiful part of this recipe is that it’s completely and totally weeknight friendly. On your way home from work tonight, pick up a few slices of prosciutto, several handfuls of mushrooms (shiitake or crimini if you would rather not drop $12/pound for them), a nice fat ribbon-shaped pasta (like pappardelle or tagliatelle), a couple of shallots, some chicken stock, a small bunch of thyme, and cream. You have butter and olive oil already, right? Right.Because prosciutto gets weird and chewy when it’s heated up, the first step in this dish is to crisp up the slices, which can then be crumbled. Italian bacon bits! Sort of. Then it’s time to sauté the shallots and mushrooms with the thyme, and there’s no funny business about when to salt or not salt, so forget all the drama you may have heard about cooking mushrooms: Salt them like you’d salt anything else—early and often. When the shallots are soft and the ’shrooms are browned, you add the chicken stock to the pan and let it cook down to almost nothing. This is the beginning of your pan sauce, and one of those magical alchemical moments when the mushrooms and aromatics give their flavor to the stock, and the stock lends the flavor to the mushrooms, and the reduced broth is a concentrated version of what all the ingredients add up to now that they’re officially melded.Photo by Laura MurrayAt the same time, your pasta is burbling away in salted water, just waiting for the very al dente moment to jump into the mushroom party pan, along with any pasta cooking liquid that’s clinging to the ribbons, plus about a cup of liquid scooped right into the skillet. The technical term for what happens when you begin to toss together that starchy water with the mushroom essence and fat ribbons of pasta is called The Saucy-Glossy Time. The agitation of the pasta water, the reduced stock, and half of the prosciutto crumbles creates an emulsified sauce that will eventually coat the pasta, once the liquid has cooked down enough. These are the moments the foragers only dream of as they are sinking into the mossy forest floor in search of non-poisonous fungi to eat for dinner, and all you had to do was detour to the grocery store on the way home.You might think your mushroom pasta is saucy and glossy enough at this point, but we think you should add a little cream to bring it all together, and a little butter, to make it even better. The rest of the prosciutto crumbles drop down from above. We didn’t think to call for grated Parmesan to finish the dish, but I think when I make this myself, there will definitely be a hunk of cheese that lands on the table too. It’s eating season, after all, and I didn’t come to mess around.Get the recipe:Pasta with Mushrooms and ProscuittoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-24", "author": ["Condé Nast", "Carla Lalli Music"]}