{"id": "b5eb14cb16a4fa9a12905372acc742f2", "url": "https://www.bonappetit.com/story/never-fail-kimchi-pancakes", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "These Kimchi Pancakes Are My Favorite Pantry Meal | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Kimchi Pancakes Are My Favorite Pantry MealBecause I always—always—have kimchi in the fridge, and they come together fast enough for weekday mornings.By Emily SchultzJuly 6, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.Like all siblings, my sisters and I have very specific jabs and digs that we whip out when we're mad at one another. There are the ones that really sting, sure, but more often than not they just show how much we know about each other and our specific idiosyncrasies. For example: These days, whenever I make fun of something my sisters are eating, someone slings back, “Well, all you do is eat kimchi!” Which is, well, actually pretty true, and I'm not mad about it at all. Especially when \"eating kimchi\" means \"eating kimchi pancakes,\" my new favorite go-to breakfast, lunch, dinner, or snack.Here's the thing about me and kimchi. When I see headlines for something called “pantry pasta” or “clean-out-the-fridge-frittata\" or any other dish that promises to make use of the ingredients I always have around, my thoughts immediately turn to the huge jars of kimchi that are pretty much ever-present in my fridge. And while my favorite ferment doesn't necessarily fit into those catch-all dishes, it always belongs in my beloved kimchi pancakes.They're beyond easy to make. The actual pancake batter is all of five ingredients, which I really, seriously always have in my house. (Soy sauce! All-purpose flour! Eggs! Kimchi! Scallions!) And it comes together super quick. Like, I-make-these-for-breakfast-on-a-weekday quick.Chopping squishy-crunchy kimchi is extremely satisfying.\nPhoto by Alex LauSo all you do is combine the soy sauce, water, brine from the jar of kimchi, and an egg in a bowl. Then you whisk in some AP flour until things look smooth and fold in that sweet, sweet chopped-up kimchi and four sliced scallions. You heat up some oil in a pan the same way you would for sweet breakfast pancakes, and when it's hot dollop in heaping spoonfuls of your batter—I prefer them to be on the smaller side because it makes flipping them more manageable. (Yes, I’m a 25 year old adult who works at a food magazine and isn’t afraid to admit she’s scared to flip pancakes.) Once you’ve made all of your pancakes (there should be 8 lil guys!), you stir some rice vinegar and soy sauce together in a bowl to make a salty-tangy dipping sauce. And that's all folks!Make them in the morning if you’re a savory breakfast lover like me. Serve them with a stir-fry for dinner. Or whip up a batch whenever you're home, think there's nothing to eat, and remember the beautiful jar of kimchi waiting around to make your day. And be sure to dig up all of the embarrassing pictures of your siblings wearing underbite-corrective headgear. You know, for emergencies.Make them! Make them! Make them!Quick Kimchi PancakesChewy. Crunchy. Salty. Spicy. These veggie-packed fritters have it all.View RecipeExplore Bon AppétitNever FailKimchiPancakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-06", "author": ["Condé Nast", "Emily Schultz"]}