{"id": "b5f2020a851a128a0a4bd7b0ebb4f839", "url": "https://www.bonappetit.com/story/wtf-is-absinthe", "year": 2021.0, "month": 4.0, "day": 4.0, "content": "What Is Absinthe and Will It Really Make You Hallucinate (or Give You Superpowers)? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWTF Is Absinthe Anyway?Black licorice lovers, this drink’s for you.By John deBaryApril 23, 2021FacebookTwitterEmailPhoto by Ted and Chelsea CavanaughFacebookTwitterEmailAs far as alcohol-related misinformation goes, the mythology around absinthe is some of the most egregious. Wormwood, the primary ingredient that gives absinthe its unmistakable botanical bitterness, has been associated with gods and magic since ancient times. Absinthe was also one of the only spirits to have been specifically banned by governments in the early 1900s, thanks to its rise in popularity during a time when temperance movements were taking hold in Europe and the United States. While it’s been hailed both as a miracle cure and villainized as a societal scourge, absinthe is, truthfully, neither. But it is a fascinating spirit, and the time spent getting to know it is well spent. So what is absinthe, really? Here are seven key facts to set you on your journey.1. Absinthe is an acquired taste. For most people in the U.S., absinthe’s predominant bitter flavors of anise, fennel, and licorice are unfamiliar, if not altogether unappealing. Put another way, if you don’t love black licorice candy, it might take you some time to get into absinthe. It’s also really strong, usually about 60–70% alcohol, so you’ll always want to dilute it (more on that later).A good starter bottle is Pernod, one of the oldest producers of absinthe still in operation. Another very classic—and very good—absinthe is Vieux Pontarlier. If you’re looking for a domestic absinthe, St. George Spirits has been producing its own style of absinthe since the ban was lifted in 2007. (Yes, absinthe was banned—well, sort of—in the U.S. until 2007.)2. Absinthe will not make you hallucinate.This is probably the most widely held misconception about absinthe. Nothing in absinthe will make you hallucinate, never has, never will. There is a chemical found in wormwood—absinthe’s primary flavoring—called thujone that’s known to be a convulsant at extremely high doses. But in order to get to that point, you’d have to drink so much alcohol that you’d be dead-drunk before you felt any effects. And besides, thujone exists in common ingredients like sage, which is used extensively without any ill effects.3. Absinthe contains three key ingredients: wormwood, anise, and fennel. Absinthe is made by redistilling neutral alcohol with botanicals—the “holy trinity” is wormwood, anise, and fennel—to create a concentrated, high-proof spirit. Other ingredients that are commonly added include hyssop, melissa, star anise, and lemon balm. Producers then reinfuse the spirit with more of these botanicals to give it its characteristic green hue. (Sometimes producers skip this step, which results in “white” absinthe.)4. Absinthe is OLD. Early forms of absinthe (that is, drinkable wormwood) are so old, in fact, that they appear in the Bible, as well as ancient Egyptian and Syrian texts. Back then, absinthe was a simpler recipe, consisting of just wine infused with wormwood. It was used to treat a wide range of conditions including jaundice, menstrual pain, anemia, and bad breath.Over the centuries, absinthe gradually transitioned from medicine to recreational beverage, with the recipe that we now think of as modern absinthe emerging in apothecaries in Switzerland in the late 1700s. As in ancient times, absinthe was thought to alleviate chills and fevers and stimulate appetite. Though its medicinal claims are largely unproven, it was given to French soldiers during their colonial conquest of Algeria as a fever and malaria preventative. Once soldiers returned to France, they had developed a taste for the stuff, and it became widely popular among young urbanites.5. The traditional method of drinking absinthe is with cold water and sugar. The classic method of enjoying absinthe involves a special fountain that drips ice-chilled water over a sugar cube perched in a spoon over the glass. Regular people can just use a ½ oz. (1 Tbsp.) simple syrup and 5 oz. chilled filtered water for every 1½ oz. absinthe, stirred together briefly. When you drink absinthe this way, you’ll notice that the liquid goes from clear to a milky translucent, a phenomenon known as the louche.An old-fashioned absinthe setup.\n6. Absinthe’s louche effect once helped solve a geological mystery. Chemically, absinthe is a suspension of essential oils in high-proof spirit. When added to water, the alcohol’s ability to hold on to the oils is diminished, which results in something called spontaneous emulsification, where the oils come out of solution but not so much that they coalesce and separate (like oil and vinegar). This creates a milky matrix that scatters light and creates that opalescent and captivating glow that absinthe is known for while also softening its intense botanical flavors.In 1901, lightning struck the Pernod factory in Pontarlier, France, causing a fire and forcing the workers to release tens of thousands of liters of absinthe into the nearby Doubs River to prevent an explosion. Nearby, a professor was studying another river to determine if it was fed by the Doubs via an underground channel. While previous attempts to prove this had been unsuccessful, two days after the fire, the river turned a milky hue, thus verifying that there was an unseen connection between the two rivers.7. When it comes to cocktails, less is more. You’ll see that most recipes calling for absinthe say to use a few dashes or drops or a rinse of the glass. In most cases that’s all you need to give an intriguing herbal edge to any drink. A great example of this is the Paddington, a drink from the iconic neo-speakeasy, PDT. This rum-based mash-up of a Corpse Reviver #2 and a daiquiri features a rinse of absinthe that balances out the fruity notes from the citrus and rum.To make one drink, add 1 dash absinthe (St. George Absinthe Verte) to a chilled cocktail coupe glass and swirl around until the inside is coated. Set aside (or return to the freezer).Combine 1½ oz. rum, such as Banks 5 Island, ½ oz. Lillet Blanc, ½ oz. fresh grapefruit juice, ½ oz. fresh lemon juice, and 1 barspoon orange marmalade in a shaker and shake vigorously for 15 seconds. Strain into the prepared coupe. Garnish with a grapefruit peel, expressing the oils from the skin over the drink’s surface.Here, try a Rattlesnake!The RattlesnakeView RecipeJohn deBary is a former/semiretired bartender, author of ‘Drink What You Want: The Subjective Guide to Making Objectively Delicious Cocktails,’ the creator of a line of zero-proof botanical drinks, Proteau, and the co-founder and board president of Restaurant Workers’ Community Foundation.Explore Bon AppétitAbsintheCocktailLiquorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-23", "author": ["Condé Nast", "John Debary"]}