{"id": "b5f3def21cd890a66b557db55ca4e97c", "url": "https://www.bonappetit.com/story/making-perfect-fancy-cranberry-sauce", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Our Nostalgic, Fancy, and Kinda Polarizing Homemade Cranberry Sauce Is Here | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOur Nostalgic, Fancy, and Kinda Polarizing Cranberry Sauce Is HereIt’s subtly spiced with bay leaves and cardamom, then set in a gelatin mold and crowned with sugary orange zest and cranberries.By Alex BeggsOctober 16, 2019FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiFacebookTwitterEmailWe asked our food editors to test and retest the Thanksgiving classics: to compare Idaho potatoes to German Butterballs, to weigh the merits of whole birds against cooking in parts. And we asked them to do it while filming Making Perfect, a six-part video series documenting every success and setback. Somehow, it all worked out...perfectly. Here’s how the Fancy Cranberry Sauce came together.Find all of the recipes from the Absolutely, Positively Perfect Thanksgiving menu here.The Dream TeamAndy Baraghani and Brad LeoneThe ChallengeFor some inexplicable reason (let’s blame DNA and nostalgia), the staff of Bon Appétit has a thing for canned cranberry sauce. But they can’t get behind the preservatives and all that corn syrup.The SolutionBrad and Andy dreamed of a sauce as sliceable and jiggly and fun as the canned stuff, but with deeper fruit flavor and more nuance. It’s subtly spiced with bay leaves and cardamom, then set in a gelatin mold that your cousins will never see coming and crowned with sugary orange zest and cranberries. “This will be polarizing,” says Andy. “I’m fine with it.”Watch Andy and Brad on their quest to make the perfect Thanksgiving turkey and cranberry sauce.\nFace Off: Smooth vs. TexturedBrad prefers a smoother bite, so he tried a version that put the cranberry mixture through a food mill. But Andy wanted real fruit texture, so they left the cranberry mixture as is and doubled down with tiny cranberry galaxies floating in jelly. Brad wanted to use pectin to create a sort of “set jam,” Andy preferred a wobbly gelatin. Somehow Andy kept getting his way.Brad Stans Canned SauceHe grew up with the stuff, he can’t help it. “There was something in that can that had a little grit to it,” he says. “And it’s not like transparent Jell-O. It’s murky and purple and beautiful.”The ingredients all laid out.\nPhoto by Emma FishmanThe Mold Never Gets Old...This is your once-yearly chance to dust off that gelatin mold you inherited from Great-Uncle Albert (he was into suspended fruit salads, so what?). But beware a mold that’s very intricate—too many little nooks and crannies and indentations will make it more difficult for the jelly to slide out. Lacking a Great-Uncle Albert? Sorry to hear it. The best molds are vintage, so peruse Etsyuntil you find the shape of your dreams. Yes, French ice cream moldswill also work—thanks for asking. And before pouring in your cranberry mixture, don’t forget to coat the tin with nonstick spray....But You Can Bundt If You WannaFor aesthetic and historically accurate (and clearly personal) reasons, Andy insisted on using an old-school mold, which doesn’t have a hole in the center and thus makes bigger, more dramatic slices. But a Bundt pan also makes a totally fantastic gelatin mold! If you’re bundting, we like the nonstick Anniversary Bundt pan from Nordic Ware.Buy it: Anniversary Bundt pan from Nordic Ware, $38 at Williams SonomaHow to Serve ItOn your finest vintage china, cutting each serving into a thin wedge as you would cake.Get the recipe:Fancy Cranberry SauceWe have a thing for canned cranberry sauce, so we dreamed up a sauce as sliceable and jiggly and fun, with deep fruit flavor and a pretty topping.View RecipeFor more Absolutely, Positively Perfect Thanksgiving menu ideas:1 / 8ChevronChevronExpertly Spiced and Glazed Roast TurkeyView RecipeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitMaking Perfect: ThanksgivingThanksgivingRead MorerecipesBon Appétit’s Absolutely, Positively Perfect Thanksgiving MenuGallery8 SlidesBy The Bon Appétit Test KitchenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-16", "author": ["Condé Nast", "Alex Beggs"]}