{"id": "b5f3262766a27604d6107601b163b0c4", "url": "https://www.bonappetit.com/story/burrow-bakery-ayako-kurokawa", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "The Mysterious and Magical World of Burrow, a Japanese Bakery Hiding In an Office Lobby | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Mysterious World of Burrow, a Japanese Bakery Hiding In an Office LobbyYou’ll forget you’re in New York City once you step into Ayako Kurokawa’s bakery.By Elyse InamineJune 13, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailIt’s easy to walk past 68 Jay Street in New York City. Don’t. Beyond the blocky, metal 6-8 above the doorway, there are no signs indicating anything more than offices inside the Dumbo building. There is. Once you enter the generic lobby, you’ll almost run into a pole (probably propped there for structural integrity). Now you might be wondering: Have you been cast as victim number one in Saw 18? Nope, but it does feel as if someone is trying to divert you from something. Or push you somewhere else. And that might very well be the intention of Burrow, a sweet but strange Japanese bakery that’s quietly creating otherworldly cakes and cookies that baffle pastry chefs and bring in customers like Louis Vuitton artistic director Virgil Abloh.“Hi, nice to see you again,” Ayako Kurokawa says to me, as she pokes her head behind the unsalted-butter-yellow linen curtains by the cash register. She’s wearing tan Birkenstocks, a denim jumper-like apron, and a white beret. Then she disappears. It’s 11:08 a.m. this balmy Friday, and I’ve arrived just as tiny plates of raspberry jam-filled linzer cookies, pudgy slices of pistachio cake, and cream puffs are replacing the breakfast menu of cornbread-like smoked salmon cakes, shellacked croissants, and jiggly tomato and Gruyère quiches.The pastry case at Burrow.\nAlex LauBurrow is a glass-enclosed, oval-shaped bakery, where the front half is made up of small cases of constantly changing pastries, a few spindly stools, and a narrow counter by the windows that offers a clear view of the drab lobby and people stumbling into that pole. The back half holds the studio-turned-bakery Kurokawa has fashioned for herself and her team of three other Japanese female bakers. I follow her inside.To say I’m obsessed with Burrow is an understatement. Sure, it’s one thing to arrive 15 minutes late to the office to pick up some breakfast goods on your way in. It’s another thing to return again and again, once you find out cakes aren’t ready until the afternoon, to the point where you’ve carved out a Burrow-visiting calendar for yourself that may or may not require the use of personal days. Despite my intense loyalty, it’s taken almost as long to meet Kurokawa. But after a few more visits and consistent follow-up emails with lots of exclamation points, I finally convinced her to let me peek behind the curtains.The circus-tent-inspired strawberry cake.\nAlex LauThat said, today, I have a very important mission: to crack the code behind Burrow. It’s not new (four years old at this point). It’s barely noticeable (in addition to no signs, there’s no phone). Its strict schedule, hand-stitched in red yarn on the curtains—open Monday to Friday, 9 a.m. to 4 p.m., with breakfast ending at 11 a.m. and cakes out around 2 p.m.—makes it difficult to find time to even visit. Kurokawa has no outstanding pedigree (stints at The Modern and the Plaza Hotel in New York City). And yet, Burrow has racked up 78,000 Instagram followers (and counting) and customers from all over the world queue up out the door.“I remember stumbling across her Instagram account years ago and just being floored. There is this tiled hexagonal cake that I look up over and over again, trying to figure out how it’s made,” says Anna Posey, the pastry chef and co-owner of Elske in Chicago. “When I finally made it into her shop a few years ago, the bakery is just what I hoped for. Everything is perfectly executed, minimal, creative, and beautiful. I would definitely call her an artist.”Ayako Kurokawa, the baker and brains behind Burrow, at her station.\nAlex LauIn the kitchen space, Kurokawa sets up her station, a nook in between the fridges and the sink. An unframed, Impressionistic oil painting of an orange-bonnet-wearing woman hangs on the wall, along with a tumble of cake molds strung together like a giant charm bracelet. Back when this space was simply a studio for Kurokawa to experiment and bake on a special-order basis, she painted this wall with curvy, red strokes to mimic antique wallpaper. It’s still there today. While the three other bakers roll up almond croissants and lather up cake layers with offset-spatulas at fast-forward speed, time seems to have stopped in her corner. I’ve stepped into Kurokawa’s world, which Posey says is like “having an Alice in Wonderland moment.” And for the next five hours, I forget I’m in New York City.Unlike sterile restaurant kitchens, it feels more like a home kitchen, infused with—and powered by— with her personality and style. There are miniature magnets made by Kurokawa everywhere: a tiny green trash can for recycling pick up on the kitchen white board, a Baldor logo for ingredient drop-off, little cakes on the SunFire ovens, indicating what’s baking inside. Black Crane-designed aprons, loose and flowy like a very stylish parachute, hang on the side of the ovens, a collaboration Kurokawa forged with Momo Suzuki, the designer behind the cult jumpsuit brand.When asked how she finds inspiration, Kurokawa pauses for a long time. “That’s a tough question,” she says with a nervous laugh. She brushes it off and continues working at her station, silently cutting chunks of frozen carrots to then mix with orange juice for a vegan carrot cake. Anytime I ask Kurokawa about her process, she tends to shy away from answering, not because she’s secretive, but more because she doesn’t really have an answer, as if she hasn’t given it much thought. When she gets her portrait taken for this story, she appears visibly uncomfortable, punctuating each click of the camera with a little “ah” and shuffling away as fast she can once it’s over. Most artists love talking about themselves, their creations, their genius. Have you heard of Kanye? But Kurokawa hates making herself the center of attention, instead letting her cakes take, well, the cake.Inside the kitchen at Burrow.\nAlex LauAs a kid in Hokkaido, she never had an affinity for baking. But then after moving to New York City in 2000 to go to college to study English, she stayed in the city by taking odd jobs: handing out Japanese newspapers in Midtown East (which is how she met her husband), cooking at a Japanese deli, making rice balls at a Japanese bakery. Kurokawa decided to give pastry a shot. She brought her resume to The Modern in 2006 and soon became enraptured by the citrus tuiles and pulled candy she was learning how to make. But after a couple years working in other restaurant pastry departments, coming home in tears from the stress of the job, Kurokawa ventured out on her own. Out of this rented studio, in 2012, she started selling cakes to friends and anyone who found her via Instagram or by word of mouth, like Cartier for a company event or Anna Wintour for a birthday party.Kurokawa can pinpoint when her Instagram took off; it was in 2013 when visual artist Mimi Jung snapped a quick pic of a fruit-filled sponge roll cake. Weirdly, the photo isn’t particularly stylized or even beautiful, but after that Kurokawa’s page took on a life of its own. She started removing personal photos—if you haven’t noticed, Kurokawa is very private—and posting her creations instead. Still, it took a good friend’s urging to make Kurokawa turn her one-person studio into a retail bakery in 2014.The gravity-defying strawberry tart.\nAlex LauBy 12:17 p.m., the three bakers are out for lunch, and Kurokawa is the only one in the kitchen. Her favorite time. “I think I’m more productive and creative when I’m alone,” she says. She rubs her hands together and looks at the production list for the day. Caramel mousse for coffee cake is next on her list. It’s silent, and Kurokawa is lost in her thoughts. She’s thinking about circus tents, which inspired the vertical stripes you find when you cut into her stunning strawberry cake. She’s thinking about how to maintain the shape and colors of apples, which is how she dreamed up her Dali-like cake that’s draped with thin, mandolined outlines of the fruit. She just does what she likes. But what she likes straddles fantasy and function, and it unlocks something in me, and others: a genuine delight in seeing her romanticism and playfulness, something not typically evoked in serious, liquid-nitrogen-enhanced restaurant desserts or, worse, over-the-top desserts strategically engineered for social virility. Kurokawa makes you feel like you’re in on an inside joke with her googly eyed upside-down pineapple cakes and cartoonish face cookies.The flurry of the last few moments before Burrow closes for the day.\nAlex LauBy 1:32 p.m., everyone is back, and they’re staring at me. I realize I’m standing in front of the production list and move aside. The bakery hums back to life, and Kurokawa and her crew hurry through the long lists of tasks—prepping focaccia dough, cutting out butter cookies, readying themselves for the usual 3 p.m. onslaught, cleaning up for the weekend ahead. Dreaming of new desserts will have to wait for later that night or the next day. By 4:22 p.m., she unfurls another set of linen curtains, sliding them to cover all the windows. The shop is now closed, but they’ll be back at it on Monday.For the first few years, the way Kurokawa talked about Burrow was as her castle. It was place to decidedly do her own thing but also to protect herself, her process, and her employees in ways restaurants had failed her before. By treating her bakers with kindness. By having humane hours and weekends off. After years of honing her craft and getting to know her customers, on and offline, Burrow has taken on a different meaning for Kurokawa.“I imagine a day at Burrow as theater,” Kurokawa says. “The show begins at 9 a.m. and ends at 4 p.m., when we close the curtains.”Explore Bon AppétitRestaurants + TravelNew York CityPastryRead MorecookingThe Long-Anticipated New Cookbook from a Teeny Bakery in North CarolinaBy Sarah JampelrestaurantsNapa Has Changed, Butter Cream Bakery Has NotBy Kira GarciarestaurantsWhy People Travel Far and Wide for Shatila Bakery's BaklavaBy Priya KrishnaPhotography by Emily BergerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-13", "author": ["Condé Nast", "Elyse Inamine"]}