{"id": "b5f7d274753fb88a0c27d108e4f14f71", "url": "https://www.bonappetit.com/story/ricotta-panna-cotta", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "This Panna Cotta Is As Smooth and Airy As a Summer Cloud | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Ricotta Panna Cotta Is As Smooth and Airy As a Summer CloudA new recipe that’s so deceptively easy, the fridge does most of the work for you.By Emily SchultzJuly 11, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Emily EisenFacebookTwitterEmailThe first time I ever made panna cotta was in college, for a Food Photography class assignment, which unknowingly prepared me for a career of Instagramming food for a living. The assignment was to photograph desserts, and I wanted to do something that sounded way more sophisticated than the Wegman’s cupcakes my classmates would shoot. (Love U Wegman’s). I found a beet and pomegranate panna cotta recipe while scouring “beautiful desserts” on Pinterest (very conceptual!). The dark pink colors would impress my professor for sure. After photographing my creation, I finally tried it and...it was horrible. The earthiness of the beets overpowered everything, and I thought I hated panna cotta forever.Fast forward five years to me moseying around the Test Kitchen looking for a 3 p.m. snack, and there was Claire Saffitz’s new recipe for ricotta panna cotta. It was mildly inappropriate to eat three servings worth of this jiggly wonder, but I did so anyway because in college I also used to say YOLO a lot. The combination of creamy-tangy ricotta and the warming sweetness from the vanilla and drizzle of honey got to me. I was ready to make panna cotta again.Even though it sounds like a fancy, complicated Italian delicacy, it’s REALLY easy to make. I’m not just saying that because I work at a food magazine. There is no part of this recipe that requires your oven to be turned on, and it’s covered in fresh-from-the-farmers’-market nectarines and honey.FYI, this is what gelatin blooming looks like.\nPhoto by Laura MurraySo all you do is pour one of those flavorless gelatin packets—you know the ones that have the same packaging they did in 1950—into a ¼ cup of cold water. The gelatin dissolves for 10 minutes while you prep everything else. Mix ricotta, half and half, powdered sugar, vanilla extract, and kosher salt in a food processor (or blender if you don’t have a food processor) until everything is combined. Your gelatin-water is going to look like real gelatin and a teeny bit yellow, which just means it bloomed. Congrats! Then add half-and-half into the gelatin and whisk over low heat until smooth. This may take longer than expected, because you really don’t want any gelatin clumps; it should look like a glass of whole milk. Pour that into the blender/food processor with the ricotta mixture from earlier and blend everything for 30 seconds.Oil a dish for the panna cotta—Claire used a Pyrex pie dish but I used a cake pan, both work! Pour the panna cotta into the pan and let it chill in the fridge. After four hours have gone by and you’ve given yourself a motivational pep talk about how you’re totally going to nail flipping the panna cotta out of the pan, put your serving plate or platter on top of the dish you were chilling it in, and flip quickly and confidently! Because you oiled the dish earlier, the panna cotta should come out super easily. You can also run a spatula around the edges to loosen it, and then dip the dish in a bath of hot water for five seconds before flipping. If there were any breaks in the custard, just scatter nectarines over that part. (That’s what I did…) Drizzle the honey on top, a bit of olive oil, and serve it to your friends. You might even be inspired to photograph it.Get the recipe:Ricotta Panna Cotta with Nectarines and HoneyTreat this spoonable dessert as a vehicle for piles of your favorite peak-season fruit.View RecipeSome people (like Brad) even make their own ricotta:Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-11", "author": ["Condé Nast", "Emily Schultz"]}