{"id": "b649039eca76530d650cccf831571937", "url": "https://www.bonappetit.com/recipe/raos-spaghetti-with-broken-meatball-marinara", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Rao’s Spaghetti with Broken Meatball Marinara Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDRao’s Spaghetti with Broken Meatball MarinaraSponsored by Rao’s Homemade®FacebookPinterestTwitterEmail(Binary data 20 bytes, use -b option to extract)PrintIngredients1 slice artisan white bread (1 ounce)1/4 whole milk1 pound ground beef1/3 cup fresh parsley leaves, finely chopped, plus more for optional garnish¼ cup fresh basil leaves, finely chopped, plus more for optional garnish1/4 cup freshly grated Parmesan1 large egg2 garlic cloves, finely gratedKosher salt and freshly ground black pepper3 tablespoons extra-virgin olive oil¾ pound Rao’s spaghetti1 jar (24 ounce) Rao’s Marinara sauceRecipe PreparationIn a large bowl, combine the bread and milk and let sit for a few minutes. Using your hands, squeeze milk out of the bread and discard the milk. Tear the bread into pea-size or smaller pieces and return to the bowl. Add the beef, parsley, basil parmesan, egg, garlic, 1 teaspoon salt and ¼ teaspoon black pepper. Stir to combine and form into 16 meatballs.Heat a large high-sided skillet, preferably enameled cast iron, over medium-high. Add the oil and swirl to coat. Arrange the meatballs in the skillet in a single layer and cook, until well browned on the first side, 3 minutes. Then, turn meatballs, no need to be super gently, allow them to break up slightly. Continue to cook, turning a few times, until mostly crisp and golden on the outside, about 10 minutes more. Pour the marinara into the skillet with the meatballs and gently stir to combine.Meanwhile, bring a large pot of salted water to a boil. Cook the spaghetti per package instructions until al dente. Drain and transfer to the pot with the meatballs and sauce. Toss to coat and serve with more parm & a sprinkling of parsley and basil, if desired.Sponsored by Rao’s Homemade®GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitRao’s Homemade®PastaMeatballItalian AmericanGround BeefSpaghettiMainNut-FreeDinnerMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Rao S Homemade"]}