{"id": "b650294612c548d6341468c2de48b6e0", "url": "https://www.bonappetit.com/recipe/napa-cabbage-and-cucumber-slaw", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Napa Cabbage and Cucumber Slaw Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueNapa Cabbage and Cucumber SlawBy Chris MoroccoJuly 9, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintIf you make this slaw ahead, the vegetables will continue to soften as they sit and become more like pickles, which isn’t a bad thing at all.Ingredients4 servings6cups thinly shaved or sliced cucumbers and/or Napa cabbage¼red or white onion, very thinly sliced¼cup seasoned rice vinegar2Tbsp. extra-virgin olive oilPreparationStep 1Combine vegetables and onion in a medium bowl; season generously with salt. Let sit until they start to release their water, 8–10 minutes, then begin to massage, gently at first so they don’t break, then harder as they begin to expel their liquid, until softened to about the texture of coleslaw. Pour off all excess liquid and add vinegar and oil; toss to coat. Taste and season with more salt if needed.Step 2Do Ahead: Slaw can be made 3 days ahead. Cover and chill.How would you rate Napa Cabbage and Cucumber Slaw?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThis is just a simple, refreshing , crunchy salad.  My husband loves cucumbers so this was a big hit.AnonymousMiami Beach10/8/2020So great and simple. I was worried about eating raw cabbage but it reduces so much once you remove the liquid. Will defs make it again.AnonymousBangalore8/25/2020I really loved this slaw as an alternative to the coleslaw with a mayo based dressing. I made it and ate it with BBQ sandwiches and it was the perfect choice. I will be making it again.  dobermaPhiladelphia 12/18/2019Love this simple, refreshing crunchy slaw! made alongside the stirfried eggplant with basil and some white rice. Makes for great leftovers as the crunch holds up. Anonymoustoronto8/22/2019Explore Bon AppétitSlawSaladCucumberVegetableNapa CabbageCabbageLeafy GreensQuickEasy5 Ingredients or FewerSideDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianKetoHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Chris Morocco"]}