{"id": "b6830ea43c40c8eac0555086ba77b237", "url": "https://www.bonappetit.com/story/ashley-christensen-and-audi-team-up-to-empower-more-womenin-the-hospitality-industry", "year": 2019.0, "month": 9.0, "day": 4.0, "content": "Ashley Christensen and Audi Team Up To Empower More Women | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredAshley Christensen and Audi Team Up To Empower More Women In The Hospitality IndustryBy Audi Q3September 24, 2019FacebookTwitterEmailFacebookTwitterEmailThis video is part of a four-part series with Audi Q3, Bon Appétit, and Condé Nast Traveler highlighting Audi's elevation of female servers, managers, chefs, and owners in the hospitality industry.In July of 2019 Nashville writers, musicians, and cuisine-minded residents gathered over four evenings with celebrated chef Ashley Christensen. They were served a variety of southern favorites including steaming macaroni au gratin, fried green tomatoes with pimento cheese, and southern crab grits. But the focus of the evening was on the women serving the food and drinks.In celebration of Audi's new Q3, the carmaker launched PROOF, the Audi Culinary Dinner Series, which is a multi-city pop-up restaurant showcasing women chefs and graduates of the James Beard Foundation’s Women’s Entrepreneurial Leadership (WEL) Program, a program co-founded with Audi. Through WEL, luminaries of the culinary world like Christensen mentor aspiring female chefs, beverage managers, and food service workers in a pronounced effort to balance gender disparities in the hospitality industry. That night Christensen was joined by chefs Ann Marshall of the High Wire Distilling Company, in Charleston, South Carolina, and Joanne Canady-Brown of The Gingered Peach in Lawrenceville, New Jersey.Developed with Babson College, WEL invites up to 20 women to a five-day entrepreneurship and leadership training program. The curriculum covers strategy, finance, and leadership development, all with an eye on teaching work-life balance. When Christensen heard about the scholarships, \"It just recharged my batteries,\" she says. Now she makes sure, \"that when I'm in my community, I'm making myself accessible to young women who need resources.”The numbers tell the story. Women represent less than 20 percent of chefs and head cooks in the U.S.; only six percent of the head chef positions at the top 15 restaurant groups in the U.S. are held by women. Audi launched the series believing those statistics are simply unacceptable.Christensen was blessed to grow up in a house focused on cooking. Her father, a truck driver, would return from across the U.S. with new recipes to try. Her mother knew the southern American cookbook front to back and infused Christensen with those techniques, traditions, and flavor combinations.\"I feel best when I'm cooking,\" she says. But even Christensen says she can lose her inspiration from time to time. What brings it back? \"Cooking something I've never cooked before,\" she says. With resources like WEL, women who haven't established themselves in the culinary world can start doing the same.Christensen opened Poole's Diner in Raleigh, North Carolina, in December of 2007, growing the down-home spot into one of the most celebrated restaurants in the country. Today, she owns five other restaurants, and in 2017, she won Eater's Chef of the Year. Earlier this year, she earned the James Beard Outstanding Chef award, the Foundation’s highest individual honor.That night in Nashville, when the napkins were back on the table and the plates cleared, Christensen took the microphone and reminded the room of the power of hard work and taking care of one another.\"I love going on the road and telling the story,\" she says.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-18", "author": ["Condé Nast"]}