{"id": "b6862dbe62459ef4c53232d3678f0e1f", "url": "https://www.bonappetit.com/story/kabocha-squash-flour", "year": 2020.0, "month": 5.0, "day": 3.0, "content": "This Gluten-Free Flour Is Made from Dehydrated Kabocha Squash  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleKabocha Squash Flour Is My New Go-To for Gluten-Free BakingIt blends with other flours like a dream without making things too craggy, stodgy, or crumbly. By Kyle BeecheyMay 15, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailHealthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!It feels like everyone I know is squashing anxieties with focaccia and killing time by baking yet another loaf of banana bread. I’ve been inspired to try a whole slew of gluten-free flours, making blends with buckwheat and fonio. But the flour I keep mixing in is one I never expected: kabocha squash flour.Mine comes from Hearthy Foods, a California-based brand with an arsenal of alternative flours. As soon as the jar arrived, I made a quick bread from an equal blend of kabocha, rice, and rye flour (so I didn't have to use as much of my precious, and pricey, squash flour). I put my experiment in the oven and crossed my fingers. Not only did it rise and bind like a dream, but it wasn’t too craggy, stodgy, or crumbly. It was a hit, and no one I fed it to could guess the mystery ingredient.Who knew that a flour made from nothing but dehydrated, milled squash could be such a baking workhorse? Its nutty flavor can lean savory or sweet, and it’s mild enough to let other ingredients shine through. Surprisingly, unlike other gluten-free flours, kabocha didn’t make things too cakey, crumbly, or dense.I’ve been baking two or three times a week since “staying home” became the cool and socially responsible thing to do, putting kabocha flour in brownies, pancakes, and cinnamon rolls. All were moister than usual, with that earthy craveable sweetness. Since it’s gluten-free, you will need to adjust your quantities when subbing in recipes that call for AP. Start by substituting no more than 50 percent AP flour, then check out this guide to make your own gluten-free flour blends. With practice and a lot of internet research, I’ve found that a good overall philosophy when baking without gluten is to add two or three tablespoons of starch (tapioca or corn) and two teaspoons of extra baking powder for every cup of gluten free-flour to avoid crumbly or overly dense results.Kabocha flour has my heart, but now I’m inspired to play around with fonio, rice, cassava, and honeybean too. It might take some research, but I’ve got time.Buy it: Kabocha Squash Flour, $20All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItGluten FreeShoppingRead MoreLifestyleThe Cookbook That Makes Herbal Medicine Totally ApproachableBy MacKenzie Chung FeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-15", "author": ["Condé Nast", "Kyle Beechey"]}