{"id": "b696c927a16077058c4623afabe75383", "url": "https://www.bonappetit.com/story/never-fail-crispy-glazed-tofu", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "This Crispy Tofu Will Convert Even Hardcore Tofu Haters | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Crispy Glazed Tofu Will Convert Even Hardcore Tofu HatersThis low-maintenance, weeknight-friendly recipe will turn you into a tofu fiend.By Aliza AbarbanelNovember 9, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.In theory, working at a food magazine should mean that my fridge is always fully stocked with peak-season produce and every night is a parade of beautiful, thoughtful meals. In reality, making dinner most nights feels like an off-brand version of Chopped in which I spend a lot of time gazing into my fridge, then just end up throwing a bunch of things in a bowl. But even on the darkest fridge days (a.k.a. rent week), I can rely on this crispy tofu to come through.Stop! If you’re an avowed tofu hater, don’t you dare close this tab. This recipe will turn you—I’ve seen it before. I’ll admit that, in the wrong hands, tofu can be bland and stodgy. But this tofu is crispy and chewy, with a custard-y interior and hugely flavorful maple-soy glaze. What’s not to love?I would be embarrassed about how often I’ve made this recipe since it debuted on Healthyish last February, but senior food editor Chris Morocco is a genius so I have no shame. It’s been in heavy rotation for months because all of the key ingredients—maple syrup, soy sauce, rice vinegar, tofu—are pantry staples for me. If tofu hasn’t earned a permanent place on your grocery list, this recipe offers a compelling reason. It’s affordable, keeps unopened in the fridge for weeks, and becomes crispy and delicious under that maple-soy glaze. And, like Rihanna, it will bless anything it touches.About that glaze: It’s not as scary as you think. It’s a simple mix of ginger, soy sauce, rice vinegar, maple syrup, and mild chile flakes, which bastes crispy browned tofu until reduced in a sticky, delicious sauce. It delivers takeout-joint level satisfaction, but can be totally accomplished in your PJs at home.Really, the best thing about this tofu treatment is how versatile it is. I tend to follow a simple formula: tofu + grains + vegetables. Think white rice or even soba noodles, shaved daikon or crunchy Persian cucumbers. I’ve used this crispy tofu to round out a rice bowl with sautéed mushrooms and gomae, but you can’t really go wrong here. Just don't forget the sliced scallions, which are a must—they’ll tie together any fridge scraps into a next-level tofu bowl you’ll be stoked to eat any day.Get your glaze on:Crispy Tofu With Maple-Soy GlazeWhenever you’re cooking tofu, here’s one of our no-fail techniques: Draining the tofu, then squeezing out as much water as possible (without smashing it), is the key to the crispiest cubes.View RecipeExplore Bon AppétitBasicallyNever FailTofuRead MoreTofu and Mushroom Stir-FryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-09", "author": ["Condé Nast", "Aliza Abarbanel"]}