{"id": "b69c8fad8ecdf12e44df03b432ebde7e", "url": "https://www.bonappetit.com/story/dr-singhas-mustard-bath", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Why Is Dr. Singha's Mustard Bath the Wellness World's Favorite Remedy? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy Is Dr. Singha's Mustard Bath the Wellness World's Favorite Remedy?This sick-day remedy has no advertising—and legions of fans.By Priya KrishnaMarch 7, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Guide to Feeling Better Already, a collection of recipes, remedies, and distractions to get you back on your feet.You’ve probably seen the small, classic-blue container with the yellow-lined label and simple graphic waves at your local CVS. Or maybe you’ve spotted it on Goop (it’s one of Gwyneth Paltrow’s favorite detoxifiers) or CAP Beauty (owner Kerrilynn Palmer swears by it when she’s feeling sick). Or you read that Olympian Natalie Coughlin swears by it as her post-swim routine. Or you’ve perused the many rave reviews of it on the Internet. “I woke up with super-soft, glowy skin that—swear to god—had an ever-so-slightly spicy scent that lasted the whole next day,” declares one on marieclaire.com.That container is Dr. Singha’s Mustard Bath, a fine, beige, herbaceous powder that’s become the wellness world’s de rigueur sick-day cure. It contains eucalyptus, rosemary, wintergreen, and thyme (plus sodium carbonate, or baking soda, and gum benzoin, a medicinal tree resin), but the key ingredient is mustard seed, which, according to Ayurveda—the ancient Indian system of healthcare—rejuvenates your skin, decreases stress, and increases blood flow. Recently, products like Dr. Singha’s Mustard Bath have ballooned in popularity in the Western world. With cookbooks, consultancies, food products, speaking engagements, and skin ointments, Ayurveda is now a cash cow industry—ironic for a system of medicine that frowns upon materialism. And a lot of these products, many of which are named for gurus real and imagined, seem to have little to do with the practice itself. So when I heard about Dr. Singha and his mustard bath, I wondered who this guy was, whether he was legit, and most importantly, if his product was the magic bullet so many proclaimed it to be.I’ve forever been skeptical of cult ayurvedic products because I grew up on home remedies similar to the sorts of practices outlined in ayurvedic medicine—my aunt rubbed coconut oil into my hair to make it silky, my mom made face masks out of turmeric and yogurt to clear up blemishes, and my dad still swears by psyllium husk to regulate his digestive system. These remedies were inexpensive, they often took advantage of household items, and they weren’t wrapped in flashy packaging or faux-esoteric labels. Most importantly: these were techniques that had been passed down in our family over generations.The eponymous Dr. Singha\nPhoto courtesy of Dr. SinghaFirst I went in search of Dr. Singha. I called up Anna Searles, a soft-spoken British woman and longtime patient of Dr. Singha’s (he was, in fact, a real person) who founded the company with him in 1990, and has kept it running since his passing in 2000. She gave me an extensive history of Dr. Singha’s life—how he was raised in a spiritual community in the Himalayas, studied ayurvedic medicine in India, and opened the first School of Acupuncture in Great Britain in 1964, earning a loyal fan base for his healing method known as the mustard bath. In 1990, Searles suggested that Dr. Singha start selling the bath. As Searles tells it, Dr. Singha wanted little part of the mass commercialization of his practices: “He looked at me said, with a twinkle in his eye,  ‘You do it!’ So here we are.” Searles, on Dr. Singha’s wishes, hasn’t done any kind of advertising for the product—but it has experienced a meteoric rise since its launch, especially in the past few years, as sustainability and the organic movement gain even more traction.“It’s not rocket science,” she explains of the success of the bath. “There is just a hunger inside people to do the intelligent thing by creating wellness in their lives.”Anna spoke of Dr. Singha in an apotheotic way — like this figure who suddenly entered her life and transformed her entire outlook. So I have to admit: it’s hard for me to completely understand or believe everything she’s telling me about Dr. Singha’s miracle health solutions. That said, one thing that does resonate: unlike a lot of other Ayurvedic empires out there, Dr. Singha kept his business pretty small—just his practice and a few products like the bath, a health tonic, and a mustard rub.Dr. Singha's mustard bath\nSo I decided to give his mustard bath a chance, ordering it on Amazon for the refreshingly affordable price of 10 dollars for an 8-ounce container. The Dr. Singha’s label instructs you to add a scoop of powder to a hot bath, relax in it for 20 minutes, then “finish with a cold shower, dry with a rough towel, rest and keep warm for best results.” I drew a hot bath after a long workout (the kind that leaves your muscles extra achy), and poured the powder into the tub, as instructed. The water promptly turned an unappealing shade of lemon-lime Gatorade. It smelled nice, though, as Dr. Singha smartly thought to add the herbs to counter the potent smell of the mustard. As I stepped in, I started to feel like an Alka-Seltzer tablet being dropped into water. Everything fizzed, and, for a few moments, my whole body felt effervescent. Soon, my skin started to look glossy. I hung around in the bath for the prescribed 20 minutes, then took a cold shower and even dried myself off with a rough towel, per the instructions.Afterward, I felt… fine. My muscles felt no less achy. Even though my skin felt smooth and velvety in the bath, it didn’t look much different after I got out. If my blood flow had improved, I didn’t notice. The mustard bath, to me, was nothing more than a really satisfying bath bomb.I don’t doubt that, for many people, this bath is a total game-changer. For me, trying the bath was a good reminder that, as legitimate as Dr. Singha may be, what works for my friends or that person on the internet won’t necessarily do the same thing for me. And it’s okay to stick to the stuff that works when you’re feeling sick: Tylenol, a cup of green tea, a good, old-fashioned Netflix binge.So I’ll probably give the rest of this mustard bath to a friend. Because, for me, ayurvedic medicine will always be about those remedies I grew up on—the things you can make from the items you have at home. I suppose I could recreate the mustard bath with some hot water, baking soda, and ground mustard seed from my spice cabinet. But I’ll stick with my yogurt masks and chai for now.Explore Bon AppétitHealthyishGet WellTrendsRead MoreLifestyleThe Healthyish Guide to Feeling Better AlreadyGallery13 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-07", "author": ["Condé Nast", "Priya Krishna"]}