{"id": "b69e37124db5d7e5bae1d83ae54f64c1", "url": "https://www.bonappetit.com/story/egg-free-caesar-dressing", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Yes, You Can Make Caesar Dressing Without Raw Egg Yolks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYes, You Can Make Caesar Dressing Without Raw Egg YolksSwap the yolks out for one staple condiment and you’re good to go.By Antara SinhaAugust 16, 2021FacebookTwitterEmailPhotograph by Isa Zapata, food styling by Micah Morton, prop styling by Elizabeth JaimeFacebookTwitterEmailIf you’re nervous about making a classic Caesar dressing with raw egg yolks, you’re not alone. Plenty of people are squeamish about the idea of eating raw eggs in general, and on top of that making mayonnaise or aioli from scratch—which is essentially what you’re doing in this case—can be tricky for the uninitiated. At best, it’s an arm workout to get the oil, acid, and egg to completely emulsify; at worst, you end up with a broken emulsion that’s streaky, mucilaginous (sorry), and inedible.But here’s a secret: If you’re not striving for authenticity when it comes to your Caesar, you’re not missing out on much at all by swapping in a dollop of a store-bought mayonnaise for that raw egg yolk. You likely won’t even be able to tell the difference, and this fridge-staple shortcut makes for a dressing that’s quick and stress-free.Take, for instance, this peak-summer Tomato Caesar recipe. We’ve taken the easy way out and called for a tablespoon of mayonnaise to take the egg yolk’s place in the dressing. It lends just the right amount of richness and incorporates into a dressing more readily than the yolk—remember that jarred mayo is just a stabilized emulsion of eggs and oil—and you don’t miss it at all when juicy, vibrant heirloom tomatoes, fresh basil, and shards of nutty Parmesan cheese are in play.Make this dressing your back-pocket Caesar hack for when bottled dressing is out of the question but dealing with raw eggs feels too fussy. What’s more, you can blitz all of the ingredients together in a blender when whisking by hand feels like too much.Listen, if you’re really a die-hard fan of the very mild “yolky-ness” that raw eggs bring to the party, you are, of course, welcome to go the authentic route. But let’s be real, the other flavors in Caesar dressing—like deeply savory Parmesan and anchovies, bright lemon juice, garlic—are the true stars of your Caesar experience.A simple, speedy salad made with beautiful, peak-season tomatoes should be the epitome of effortless summer cooking—stressing over dressing shouldn’t be part of the process.Get the Recipe:Tomato CaesarAn extra-thick Caesar dressing gives this tomato salad its oomph—and keeps it from sogging out at the picnic.View RecipeExplore Bon AppétitFarmers Market ChallengecookingHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-16", "author": ["Condé Nast", "Antara Sinha"]}