{"id": "b6b0f300f0b6a78f5c7742c4558af0e3", "url": "https://www.bonappetit.com/story/softest-scrambled-eggs-technique", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "The Softest Scramble | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Softest ScrambleFood director Carla Lalli Music makes a case for slow-scrambled, custardy, buttery, spoonable eggs.By Carla Lalli MusicNovember 8, 2018FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.I’ve got a soft spot for this special scrambleScrambling an egg is like skinning a cat. There’s more than one way to do it.Maybe that’s too broad and/or too gruesome. If I had to put scrambled eggs into just two categories, there are scrambles you serve with a fork, and those that are best eaten with a spoon. The distinction is purely stylistic and a matter of personal taste, but for whatever reason, it seems like our society really puts the fork scramble on a pedestal. I say it’s time for that to change.Want this letter before it hits the website? Sign up for our newsletter!I grew up on fork scrambles, and I never had a reason to complain. I knew how to make my mom’s slow-cooked scramble, which is excellent, and I knew knew never to order scrambled eggs in a diner, because they’re always terrible. I was sure that covered it. Like all radical opinions formed late in life, I hadn’t given any thought to what I’d been missing until a seismic event caused me to reconsider my deeply held beliefs (about eggs). That milestone moment was the day I met and interviewed Jean-Georges Vongerichten, the famous French chef with the namesake restaurant and the very blue eyes.I went to see JGV, as he’s known, because I wanted to know how he made his legendary, buttery, very runny style of scrambled eggs. He complied, and invited me to come to Jean-Georges, the restaurant, in the middle of lunch service on a weekday, to make eggs for me in his open kitchen surrounded by busy cooks. I spent the first several minutes of our interview attempting to wedge myself into a narrow space between the end of a counter and a trash can. While I was doing that, Jean-Georges, the man, got out a small saucepan, a fat piece of unsalted butter, a whisk, and a container of whipped eggs. The eggs had to be completely smooth, he said, so that there were no visible bits of cooked whites in the finished dish, and he told me that they used an immersion blender to do big batches for service. The other trick, he told me, was to start the eggs in the pan with most of the butter—everything cold—and then slowly heat it up, whisking constantly.Photo by Ted CavanaughOkay, let’s pause right there. For everyone out there accustomed to making a standard batch of light-and-fluffies, dry-and-rubberies, or soft and ribbonies, you know they start the opposite way—in a preheated skillet with foaming butter. Non this time.Back to JG. The pan was over very low heat. The Frenchman was whisking. He added a pinch of salt. The butter was sort of mushing around. Nothing happened for a couple of minutes. While nothing was happening, he told me that this was how his mother used to make eggs. He told me that what he was doing would make them very light, since the whisking was incorporating air into the eggs. He said the movement would prevent the curds from forming long strands, and instead they’d take on an incredibly smooth, fluffy, finely textured finish. I watched as the egg mixture began to very gradually thicken. It looked like very loose polenta. He kept whisking. He told me that you could finish the eggs with crème fraîche, or cream cheese, or stir in chives or basil, but that the simplest way was with just butter. After a few more seconds, the eggs took on a porridge-y consistency. He immediately dropped another knob of butter into the pan and removed it from the heat… yes, still whisking.Now, because we were in a fancy restaurant, the next thing he did was spoon the scrambled eggs into an expertly hollowed-out egg shell, top them with whipped cream, and then he capped the whole thing off with a very generous spoonful of black Sturgeon caviar (from California) out of an impressively large tin. Then he gave the whole thing to me, with a spoon.Moi?! Oh boy, oh boy. I sunk that spoon right through the caviar, and the cream, and into the puddle of eggs, and the bite I got was rich and eggy and hot, cool and creamy, salty and slippery. Whatever JG was saying at that point, I wasn’t hearing, because spoon eggs were happening to me and the noise my brain was making was deafening.The bad news is that I never got to have the soft scramble like that again, because all the other times have been in my own house and there’s never been a giant can of caviar in this place and I would feel pretty crazy putting whipped cream on my morning eggs. The good news is that the spoon eggs are also very magical without any of these accoutrements, eaten without fanfare out of a bowl. I made them so often at one point after learning this technique that when I’d ask my son how he wanted his eggs, he’d say “the soft way,” and I knew what he meant.Lisa HubbardAt home, with practice, I learned that patience was key. You have to beat the eggs long enough to fully incorporate the yolks and the whites before you start cooking, and you can’t half-ass it. If you rush the cooking process by raising the heat, the bottom will scorch and the eggs will never take on that coveted custardy texture. Go low, go slow, and don’t stop whisking. Slide them off the heat if you feel like it’s going too fast, then slide them back on. A couple of minutes might go by and they may look almost the same as they did when you started, but suddenly the aroma of cooked egg will rise from the pan. You’ll smell it before you see it, and that’s when you should add the end-game butter (or creme fraiche, or cream cheese and chives). Make sure you’ve got buttered toast and a bowl and spoon ready. A fork would be about as useful as a cat in a snowstorm.Get the recipe:The Softest Scramble (aka Spoon Eggs)Explore Bon AppétitScrambled EggsEggCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Carla Lalli Music"]}