{"id": "b6b0df79adc4221cfcf9821f3b57d3df", "url": "https://www.bonappetit.com/recipe/fried-zucchini-and-butternut-squash-torta", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Fried Zucchini and Butternut Squash Torta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssueFried Zucchini and Butternut Squash TortaBy Wes Avila September 14, 2021EmailPinterestPrintPhoto by Emma Fishman, Food Styling by Rebecca Jurkevich, Prop Styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThis torta from L.A.’s Angry Egret Dinette is a riff on a fried squash blossom taco chef Wes Avila served up from his former street cart. Feel free to substitute the zucchini here with seasonal vegetables like broccolini or mixed mushrooms. Keep the beer batter on ice and don’t overcrowd the pan while frying to get the crispiest vegetables. Store-bought chili oil (Avila recommends the one from Only Pans L.A.) is a great replacement for the salsa macha and adds the right amount of spice.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonDeep-Fry Thermometer$29 $16 At AmazonLarge Straight-Sided Skillet$290 $199 At AmazonVegetable Peeler$10 At AmazonIngredients4 ServingsRicotta spread1lemon peel, finely chopped½oz. Parmesan, finely grated1cup fresh ricotta2Tbsp. finely chopped shallot2Tbsp. thinly sliced chives1tsp. Diamond Crystal or ½ tsp. Morton kosher saltSalsa macha¾cup plus 4 Tbsp. extra-virgin olive oil, divided4guajillo chiles, cut into 2\" pieces3dried chiles de árbol, stems removed1garlic clove, finely chopped2tsp. pine nuts½cup distilled white vinegar1½tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus moresalad3Tbsp. extra-virgin olive oil2Tbsp. sherry vinegar or red wine vinegar1tsp. Dijon mustardKosher salt4cups spring greens salad mixassembly1cup all-purpose flour½cup rice flour1Tbsp. Old Bay seasoning1tsp. baking soda2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, plus more¼tsp. freshly ground black pepper1large egg, beaten to blend112-oz. bottle or can pilsnerVegetable oil (for frying; about 8 cups)1medium zucchini, cut into 2x½\" pieces¼small butternut squash, peeled, seeds removed, sliced ¼\" thick4bolillos or hero rolls, halved, toasted2medium heirloom tomatoes, sliced ½\" thickspecial equipmentA deep-fry thermometerPreparationRicotta spreadStep 1Mix lemon peel, Parmesan, ricotta, shallot, chives, and salt in a medium bowl until smooth.Salsa machaStep 2Heat 1 Tbsp. oil in a medium skillet over medium. Toast chiles, turning occasionally, until slightly darkened and puffed, about 2 minutes. Add garlic and pine nuts, reduce heat to medium-low, and cook, stirring occasionally, until garlic is tender and nuts are golden brown, about 4 minutes.Step 3Transfer chile mixture to a blender and add vinegar, 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt, and remaining ¾ cup plus 3 Tbsp. oil; blend until smooth. Season salsa with more salt if needed.Do ahead: Salsa macha can be made 1 week ahead. Transfer to an airtight container; cover and chill.saladStep 4Whisk oil, vinegar, and mustard in a large bowl until emulsified; season with salt. Add greens and toss to coat.assemblyStep 5Whisk all-purpose flour, rice flour, Old Bay seasoning, baking soda, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and ¼ tsp. pepper in a large bowl to combine.Step 6Whisk egg and pilsner in a small bowl to combine, then pour into dry ingredients and fold gently until no dry spots of flour remain. Set batter over a medium bowl of ice.Step 7Pour oil into a large skillet to come 1\" up sides. Prop thermometer in pan so bulb is submerged and heat oil over medium-high until thermometer registers 365°. Working in 2 batches, dip zucchini into batter, letting excess drip back into bowl, and fry, turning halfway through, until golden brown and crisp, about 3 minutes per side. Transfer to paper towels to drain; season with salt.Step 8Working in 3 batches, dip squash into batter, letting excess drip back into bowl, and fry, turning halfway through, until golden brown and crisp, about 4 minutes per side. Transfer to paper towels to drain; season with salt.Step 9Spread 1½ tsp. ricotta spread over cut sides of each roll. Layer bottom halves with 2–3 tomato slices; season with salt. Top tomatoes with 2–3 fried butternut squash slices, then 3–4 zucchini pieces; drizzle 1 Tbsp. salsa macha over each. Mound salad on top and close up sandwiches.How would you rate Fried Zucchini and Butternut Squash Torta?Leave a ReviewTell us what you thinkExplore Bon AppétitZucchiniSquashVegetableButternut SquashRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Wes Avila"]}