{"id": "b6b6f86db9902282075e0468022f77d4", "url": "https://www.bonappetit.com/story/the-ten-bells-best-first-date-bar-nyc", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "The Ten Bells Is the Best First Date Bar in NYC | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Ten Bells Is the Best First Date Bar in NYCThe lighting, wine list, and vibe make this spot a Very Good first date location.By Rachel KartenApril 26, 2019FacebookTwitterEmailPhoto by Charles BillotFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’ve been on a lot of Very Bad first dates. Almost all of them were mostly doomed as soon as the location was chosen. There was the too-bright Spanish restaurant with a drink called “APHRODISIAC.” The trendy coffee shop that had no indoor seating on a frigid 40-degree day. And the piano bar that, you know, was a piano bar. So if there’s one thing that a lot of Very Bad first dates have taught me, it’s this: Find one Very Good first date location, and hold on to it as tight as you can. And for me, that spot is The Ten Bells on New York’s Lower East Side.Opened in 2008, The Ten Bells is a dark and vibe-y natural wine and tapas bar that feels more Paris than New York City. It’s anchored by a big horseshoe-shaped bar that’s operated by knowledgeable (but not in a snooty way) bartenders/wine freaks. Best of all, though, it meets all my qualifications for a Very Good first date location. First, the lighting is A+. I’m sorry, but I’m vain and don’t want to sit under interrogation-style fluorescent lights on a first date. The dim, red-ish glow here is straight up sexy. Next, the wine list rules. Feeling by the glass? They have over 20 options to choose from, with a huge focus on natural wines produced from organic and biodynamic grapes. Date going well and want a bottle? They’ve got a wide selection to choose from—and ones for as little as $39 (a rare and affordable price in this city). Finally, there is the option to order food, which is essential, because it’s VERY important to have options (read: escape routes) on a first date. Committing to an entire dinner pretty much erases all possible outs until dessert, which is why choosing a bar that has snacks (or tapas, in this case) is key. If—and only if—the conversation is flowing, order the Spanish tortilla, some croquettes, and marinated olives. Also important: There’s usually no wait, and if there is, you can camp out on the perimeter of the room with some wine until another couple gets up. They are very good about making sure you always have water in your cup (hydration while drinking multiple glasses of wine is honestly very important). The music is noticeably good (think: Velvet Underground) but not yell-over-it loud. And soon you can have your first dates in Brooklyn too, when they open their second location in Bushwick this summer.So, was this a PSA for all my future first date suitors? Maybe. But if I’ve managed to save just one other person from a Very Bad first date location… well, then my job here is done.Go there: The Ten BellsExplore Bon AppétitHighly RecommendNew YorkBarsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-26", "author": ["Condé Nast", "Rachel Karten"]}