{"id": "b6ba40fdb0728ed740f7110114b4bfc0", "url": "https://www.bonappetit.com/story/rice-bowl-with-flaky-fish", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "This Kedgeree Recipe Is Perfect for Any Meal of the Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWe'd Eat This Rice Bowl with Flaky Fish for Any Meal of the DayFlavorful rice, fish, and hardboiled eggs come together for a knockout flavor combination.By Chris MoroccoOctober 25, 2018FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Susie TheodorouFacebookTwitterEmailKedgeree is the kind of dish that prompts grunts of approval from people in England and blank stares on the other side of the Atlantic. An Anglo-Indian dish derived from kitchiri (an Indian staple consisting of lentils and rice), it usually involves rice with curry powder, smoked fish, and hard-boiled eggs. (In Victorian times—and sometimes even now—it was eaten as a breakfast food). This knockout flavor combination never took off in America...until hip neighborhood restaurant Chez Ma Tante in Greenpoint, Brooklyn put kedgeree on the menu when it opened last year. Finally, a clear statement that the dish's greatness would no longer be overlooked.I think the main reason that kedgeree never caught on in America is that we just don’t have the right smoked fish. In England, kedgeree recipes most often call for smoked haddock, which is virtually unheard of stateside. Chez Ma Tante’s approach is a great compromise, using lightly cured cod, which keeps the fish from overpowering the flavorful rice, eggs, and herby finish. Tasting their version, I realized that fresh fish wouldn't be out of the question, and that meant kedgeree could be a weeknight-friendly dinner with very minimal effort.Start by hard-boiling two eggs (but let’s face it: You should probably cook extra to have on hand this week). Next, lightly brown a couple cloves of smashed garlic in a couple tablespoons of ghee or olive oil. (Have we mentioned how much we like Ancient Organics ghee in the last 5 minutes?) Add a teaspoon of curry powder followed by the rice and water. Sorry for all the parentheticals but please note that the amount of water (1 ¼ cups) is assuming you have added (¾ cup) WELL-RINSED basmati rice. The residual water on the rice after washing actually makes a big difference, which our water measurement takes into account. We’re just looking out for you, okay?Bring that to a simmer, cover, and reduce heat to a low simmer. Let the rice steam until it has absorbed all the water and is nearly tender, about 15 minutes. Season the fish with salt and lightly sprinkle with more curry powder (how much is up to you). Place the fish on top of the rice and cover it again. Cook it just until the rice is fully tender and fish flakes apart when poked. Fish not flaking? You can always add another tablespoon of water and keep going a few minutes longer.Dollop some yogurt into bowls, top it with rice and fish, and serve the eggs alongside. Throw on a handful of thinly sliced celery and some cilantro leaves. Oh, and a lime wedge. I would love to tell you that the eggs are optional, but it wouldn’t be kedgeree without them.Get the kedgeree recipe right now:Rice Bowls with Flaky CodKedgeree often calls for smoked fish, but for a light weeknight meal, we prefer steaming fresh fish right on top of the rice.View RecipeExplore Bon AppétitHealthyishFishRiceDinnerLunchCodRead MorecookingThis Turmeric Fish Recipe Has All the Flavors I Crave the MostBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Chris Morocco"]}