{"id": "b6bf4b35d95dac06b88921d9980791e3", "url": "https://www.bonappetit.com/recipe/steak-with-grilled-pineapple-chow", "year": 2021.0, "month": 8.0, "day": 3.0, "content": "Skirt Steak With Grilled Pineapple Chow Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSkirt Steak With Grilled Pineapple ChowBy Lesley EnstonAugust 15, 20214.3(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis whole dish comes together quickly so you have more time for liming—that’s Trini for hanging out, preferably outdoors, with food, drinks, and plenty of laughter. Chow can be made with just about any fruit, and while you can substitute another pepper for the traditional Scotch bonnet, leaving out the heat isn’t an option. If your mouth isn’t burning, it’s just not chow. —Lesley Enston, recipe developerAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronWeber Propane Grill$569 At AmazonBlender$32 At AmazonInstant-Read Thermometer$35 At ThermoworksCitrus Juicer$7 At AmazonIngredients4 servingsSteak and Sauce⅓cup extra-virgin olive oil, plus more for grill1½lb. skirt steakKosher salt, freshly ground pepper10garlic cloves2scallions4culantro leaves or ¼ bunch cilantro½Scotch bonnet or habanero chile¼cup fresh lime juice1Tbsp. apple cider vinegar1Tbsp. sugarChow and Assembly1large pineapple4culantro leaves or ¼ bunch cilantro1garlic clove½–1Scotch bonnet or habanero chile1limeKosher saltPreparationSteak and sauceStep 1Prepare a grill for medium-high heat; oil grate. Cut 1½ lb. skirt steak into 4 pieces and pat dry with paper towels. Season both sides liberally with salt and pepper and place in a baking dish or large shallow bowl.Step 2Coarsely chop 10 garlic cloves. Remove dark green parts from 2 scallions; discard. Coarsely chop white and pale green parts of scallions. Coarsely chop 4 culantro leaves or the leaves and tender stems from ¼ bunch cilantro to measure ¼ cup. Remove stem from ½ Scotch bonnet or habanero chile; cut in half and remove seeds if desired. Transfer garlic, scallions, culantro, and chile to a blender and add ¼ cup fresh lime juice, 1 Tbsp. apple cider vinegar, and 1 Tbsp. sugar; blend until smooth. With motor running, gradually add ⅓ cup extra-virgin olive oil in a steady stream. Pour one third of sauce over steak and turn pieces to coat. Set remaining garlic sauce aside.Step 3Grill steak until an instant-read thermometer inserted into the thickest part registers 125° for medium-rare, about 4 minutes per side. Transfer to a cutting board and immediately pour half of reserved garlic sauce over. Let rest 5–10 minutes.Chow and assemblyStep 4Peel and core 1 large pineapple, then cut lengthwise into 8 wedges. Grill pineapple wedges until grill marks appear, about 4 minutes per side. Transfer to a clean cutting board and coarsely chop. Transfer pineapple to a medium bowl.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 5Finely chop 4 culantro leaves or ¼ bunch cilantro or the leaves and tender stems from ¼ bunch cilantro to measure ¼ cup. Finely chop 1 garlic clove. Remove seeds from ½–1 Scotch bonnet or habanero chile and remove seeds if desired, then finely chop. Add culantro, garlic, and chile to bowl with pineapple. Cut 1 lime in half and squeeze juice into bowl; toss to combine. Season pineapple chow with kosher salt.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Slice steak against the grain and arrange on a platter. Drizzle remaining reserved garlic sauce over. Serve with pineapple chow.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronHow would you rate Skirt Steak With Grilled Pineapple Chow?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI loved everything about this dish, and it was nice being introduced to Trinidadian cuisine. It was a flavor bomb - delicious. I couldn’t find scotch bonnets or habaneros, so I substituted serrano peppers. They aren’t nearly as hot, but they added a good amount of heat for my taste. The punchy sauce was a perfect complement to the steak. AmandaPhiladelphia, PA9/5/2021The steak was pretty good, although I'd love to try the sauce on something like fish or chicken where it can really  get absorbed during a longer marinating period. The real star here is the chow; we loved that stuff and found it to be awesome when we used the leftovers from this meal to make tacos. NytashaOakland8/31/2021Very easy dish to make, had to use rump as could not get skirt as late shopping. will do againDavidMelbourne Australia8/18/2021Explore Bon AppétitSteakBeefMeatPineappleFruitTrinidadianCaribbeanDinnerWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-15", "author": ["Condé Nast", "Lesley Enston"]}