{"id": "b6c6c7b52adfd25d92aae93bb32d016c", "url": "https://www.bonappetit.com/recipe/best-pesto", "year": 2021.0, "month": 3.0, "day": 2.0, "content": "Best Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best PestoBy Andy BaraghaniMarch 9, 20214.6(144)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintThis bright, herbaceous pesto makes pretty much everything taste better. More than just a booster for pasta, pesto is a truly versatile addition to any condiment arsenal, equally at home coating blistered green beans as it is swooshed under lamb meatballs with Greek yogurt or dolloped on top of scrambled eggs.You will need a food processor—if you don’t have one, we highly recommend making this an excuse to get one; it’s a good investment that you’ll use forever and ever and ever—and a handful of ingredients like basil, pine nuts, olive oil, Parmesan, garlic, and salt. The key for this classic pesto is to add the basil at the very end instead of blending everything all at once. That way the herbs will maintain their verdant color without bruising or losing flavor.Editor’s note: This recipe was originally published August 21, 2018.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonNordic Ware Naturals Quarter Sheet Pan$22 At Amazon (Pack of 2)Glass Storage Containers$36 At AmazonMicroplane$16 At AmazonIngredientsMakes about 1½ cups½cup pine nuts3oz. Parmesan, grated (about ¾ cup)2garlic cloves, finely grated6cups basil leaves (about 3 bunches)¾cup extra-virgin olive oil1tsp. kosher saltPreparationStep 1Preheat oven to 350°. Toast pine nuts on a rimmed baking sheet (or quarter sheet pan), tossing once halfway through, until golden brown, 5–7 minutes. Transfer to a food processor and let cool. Add cheese and garlic and pulse until finely ground, about 1 minute. Add basil and place the top back on. With the motor running, add oil in a slow and steady stream until pesto is mostly smooth, with just a few flecks of green, about 1 minute. Season with salt.Do Ahead: Pesto can be made 1 day ahead. Top with ½\" oil to prevent browning. Store in a covered container (an extra drizzle of oil on top will help prevent oxidation) and chill.Step 2If you want to use this with pasta, cook 12 oz. dried pasta (we prefer long pasta for pesto) in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving ½ cup pasta cooking liquid.Step 3Place pesto and 2 Tbsp. unsalted butter, cut into pieces, in a large bowl. Add pasta and ¼ cup pasta cooking liquid. Using tongs, toss vigorously, adding more pasta cooking liquid if needed, until pasta is glossy and well coated with sauce. Season with salt.Step 4Divide pasta among bowls. Top with finely grated Parmesan.Photo by Alex LauHow would you rate BA’s Best Pesto?Leave a ReviewTell us what you thinkReviews (61)Back to TopTriangleExcellent!  I have made this recipe with several variations, depending on season and what's on hand.  Today, I gave the basil a rough chop, and warmed it gently in olive oil on low heat, just until it wilts.  Immediately, I cooled the small pan it in snow (it's February).  Same with the garlic.  The pesto came out a stunning bright green, even the oil.  The basil and garlic are softer.  There is a bite that is missing from fresh.  A delicious change up for winter, but I will want that fresh bite again in the summer.  Betty Rubble01730Bedford, MA2/3/2022Just a message to Adam from El Paso Texas.\nWhat a nasty man you are.\nAnd to BA. Absolutely surprised that you would allow that hateful message to go through.\n\nThe recipe, btw, was delicious AnonymousCanada1/24/2022This was a super easy recipe. It was a hit with my family. They all loved it!AnonymousLos Angeles1/20/2022I agree that the salt should be decreased, at least for me. I've made this recipe a few times and it is wonderful. AnonymousBaton Rouge, LA12/5/2021This is the best pesto I have made in 5o years of cooking. Salt to taste not by measure. I increased the grated garlic to 4 cloves. Absolutely outstanding recipe. Thank you.Steve M.Clayton, NC11/14/2021Snowdrop is an idiot.  Use your hands, live life.  This person probably wears a mask in their own home and car😑Adam El paso,  Tx10/27/2021I have always started by pureeing the pesto leaves and thought my pesto was pretty good. Duh. Making a crumb of the solids works so much better and gave a wonderful creamy consistency. Thanks for this recipe.AnonymousWindsor  ON9/25/20211/2 cup of pine nuts equates to roughly 2.5 oz. Pine nuts where I live (US Midwest) are commonly sold in 8oz bags.GeoffMinneapolis, MN9/21/2021I've been making pesto since 1990. This is a tasty recipe. I didn't toast the nuts, but the result is still a big yum. FoodieforpeaceLewiston, NY9/17/2021Best pesto I've ever made. I want to drink it. It's almost nutty or creamy tasting - I assume from toasting the pine nuts. I salted to taste. Truly phenomenal, highly recommend! I can't wait to make more. Garlic is not overpowering. Just used it on a mozzarela/tomato/pesto sandwich for lunch. AnonymousWashington 8/31/2021I will test it. I have grown basil in a one-square-meter (10 square feet) patch in various places in my garden for twenty years. I'm picking this week, and making pesto. I'll let y'all know.\nPine nuts are expensive.\n AnonymousCanada8/22/2021I have made this recipe twice. Both times I halved it due to my basil supplies.  Made as written (just 1/2 everything) both times and it was perfect! Please note that all BA recipes are tested using Diamond Crystal kosher salt. If you are using Morton’s kosher or table salt then yes, this will be too salty. When in doubt start with half and you always add more to taste. SeanBoston, MA8/22/2021I followed this recipe exactly. I doubled it since I have so much basil in my garden. I agree that it could use less salt especially with the salty cheese. My pesto was far from green as the picture shows. It was more brown and then I even added a lot more basil leaves but I never achieved that vibrant green color. Perhaps the recipe calls for too many pines nuts as well. Taste is good but color is not. Disappointed. AnonymousWethersfield, CT8/19/2021Made this last night thanks to a neighbor's abundance of fresh basil. Probably used about a cup more of basil since it was so close to what I pinched and cleaned (using a salad spinner). Otherwise, did exactly as the recipe indicated. Since i did my mise en place first, I had the full tsp of salt pre-measured. Because it was late, I added it all in. I think I got lucky because it was perfecto! Maybe my parmasean wasn't as salty. It made 2 8 oz jars, which I topped with evoo and refrigerated. Nice simple recipe but yes, salt to taste unless you're feeling lucky!John TorresWest Sacramento, CA8/10/2021Was almost perfect then added only 3/4 top of salt not the top and absolutely ruined it. Added a bit lemon juice, more cheese and couldn't be savedDebora7/28/2021Explore Bon AppétitSauceCondimentBasilHerbs & SpicesEasyQuickWeeknight Meals5 Ingredients or FewerMainVegetarianGluten-FreeLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Andy Baraghani"]}