{"id": "b6cad7a274fd6bc3c108e6b87d0fd53a", "url": "https://www.bonappetit.com/story/how-to-make-popcorn", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "This Is the Only Way to Make Popcorn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Is the Only Way to Make PopcornIn her weekly newsletter, Carla Lalli Music shares her love for cheesy-spicy popcorn that tastes like Doritos.By Carla Lalli MusicOctober 4, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.This popcorn tastes like DoritosPopcorn is my favorite food and this might be the most important recipe we’ve ever published, but I’m sorry to say that it contains a very serious error.It’s an error of omission. The recipe calls for 8 cups of “just-popped” popcorn, as if everyone reading it was born knowing how to make perfect popcorn. In fact, no one knows how to make popcorn, because we live in a society that has turned us into passive popcorn consumers. Our supermarkets sell us pre-popped popcorn in bags, at a huge markup. It’s not even good! Our office microwaves spew pre-butter-flavored popcorn. Movie theaters hawk buckets of greasy, artificially scented stuff, which we eat nonetheless. No one even Jiffy-Pops anymore. Though making popcorn is a basic skill, it was wrong of Bon Appétit to assume you knew the best way to do it. You don’t.Want this letter before it hits the website? Sign up for our newsletter!Let me back up. Before you make the popcorn, which I’m about to tell you how to do, go ahead and make the spice mix, which is Nacho Doritos–level incredible. It is a simple, cheesy-spicy combination of nutritional yeast, Aleppo pepper, and salt. For those of you who never lived in a commune, college co-op, or are simply not yet awakened, nutritional yeast is a pale yellow flaky-sprinkly ingredient that is very important to vegetarians and vegans and other friends of the plant-based community. It doesn’t have leavening power, but it is nutritious—bunch of B vitamins and some other stuff. I’m not in it for the health benefits, guys: I’m in it for the glutamates. Nutritional yeast has savory, umami magic to it, like Parmesan but not Parmesan, and when it hits the aforementioned just-popped popcorn … I’m powerless. I die. (It makes a good vegan Caesar, too.)Hopefully, while your roommate was reading this out loud to you, you went ahead and ground up the salt, nutritional yeast, and Aleppo, or decided not to do that, but either way you’re probably ready for next steps. (For the record: grinding the spices helps them evenly and elegantly coat all the kernels, but if I’m being real, I’ve never once done that at home. Maybe it’s better—I don’t know. Moving on.)Photo by Emma FishmanTime to make popcorn. Get out your Dutch oven. If you don’t have a Dutch oven, get out a girthy stock pot with a lid. (If you don’t have either of those, go to the store and get a bag of white cheddar Smartfood, because that’s where this story ends for you.) Grab a bottle of olive oil, a jar of refined coconut oil, or good old vegetable oil (such as canola or peanut). For ½ cup popcorn kernels, you need to add 3 Tbsp. of oil to the pan. Yes, it seems like a lot of oil, but without it, steam won’t build up in the pot, and without steam, there will be no popping. Also, the oil particles coat the popped kernels and give the spices something to stick to. Why are we even arguing about this?Put the pan over medium heat and pour in ½ cup popcorn kernels. White, yellow, organic, regular—doesn’t matter. Stir to coat with oil and keep stirring occasionally until the kernels start to sizzle. Put the lid on the pan and nudge the dial halfway between medium and medium high. Take out your ear buds: You need to listen to what’s happening in that pot. Soon, but not too soon, there will be popping. After that’s been happening for a minute or two, pick up the pot with the lid closed and shake it up and down. This is to prevent the dreaded scourge of unpopped kernels—or maybe it’s superstition—but you have nothing to lose by doing it. Let the popping continue, but if you see any tendrils of smoke escaping from under the lid, immediately lower heat to medium.When the pops have subsided to an eruption every couple of seconds, turn off the heat. Set the lid askew so that some steam can escape. After a minute of steam release, pour the popcorn onto a rimmed baking sheet, or your biggest, widest bowl. Count how many unpopped kernels made it through, and then give yourself a hard pinch on the inside of your bicep for each one that didn’t pop. Don’t let that happen again, understand?!?!Immediately drizzle ¼ cup olive oil all over the popcorn. This needs to happen while it’s still hot, and then you have to toss thoroughly and with intention to coat the kernels with oil. The moment you feel satisfied, apply the spice mix, and toss again to coat. (Could you use melted butter? You could, but when butter cools off, it congeals, and the texture isn’t so nice. The oil doesn’t do that, and has a nice grassy, vegetal edge to it that plays nicely with the spice mixture.)I feel guilty about not having included these thorough instructions when this recipe was first published. That was bad. I’d like to make it up to you by offering a State Secret: This is extra-amazing topped with ground black pepper. There’s something about the bright, piney peppercorn flavor and the cheesy yeast and the spicy Aleppo that brings out the best in everyone. If you taste and don’t think these have the magic, add more salt, and taste again. You might then add more nutritional yeast, and taste again. If you have any interest in sharing this popcorn with anyone, you are a much better person than I am.Get the recipe:Popcorn with Nutritional Yeast and Aleppo PepperExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-04", "author": ["Condé Nast", "Carla Lalli Music"]}