{"id": "b6cdcd65e4a14c8885194a7d3cbb5460", "url": "https://www.bonappetit.com/recipe/grilled-chicken-banana-peppers", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Grilled Chicken with Banana Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueGrilled Chicken with Banana PeppersBy Commander’s Palace, New Orleans, LAFebruary 9, 20185.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintDon’t skip the banana peppers. They provide a vinegary and spicy finish to the chicken. This Caribbean-inspired recipe is from Commander's Palace in New Orleans, LA. Read more about the restaurant's legendary Family Meal here.Ingredients8 servings2garlic cloves, finely grated2Tbsp. fresh lime juice1Tbsp. fish sauce1Tbsp. cayenne pepper1Tbsp. dark brown sugar1Tbsp. garlic powder2tsp. crushed red pepper flakes2tsp. dried thyme2tsp. ground allspice2tsp. onion powder1tsp. freshly ground black pepper1tsp. paprika½tsp. ground cinnamon½tsp. ground nutmeg3Tbsp. vegetable oil, plus more for grill16skin-on, bone-in, chicken thighs (about 5½ lb. total)Kosher salt16banana peppers, thinly slicedCoarsely chopped cilantro and lime wedges (for serving)PreparationStep 1Whisk garlic, lime juice, fish sauce, cayenne, brown sugar, garlic powder, red pepper flakes, dried thyme, allspice, onion powder, black pepper, paprika, cinnamon, nutmeg, and 3 Tbsp. oil in a large bowl. Add chicken, season generously with salt, and turn several times to coat. Let sit, turning chicken pieces once, at least 2 hours, or cover and chill up to 1 day.Step 2Prepare grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, turn one or two burners to medium-low). Lightly brush grate with oil. Arrange chicken thighs, skin side down, on grate over hottest part of grill and grill, turning halfway through, until lightly charred, 5–10 minutes. Move chicken to cooler part of grill and continue to grill, turning several times, until an instant-read thermometer inserted into the thickest part registers 165°, 20–25 minutes longer. Transfer chicken to a platter and let rest 10 minutes.Step 3Top chicken with banana peppers and cilantro and serve with lime wedges for squeezing over.How would you rate Grilled Chicken with Banana Peppers ?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleHighly recommend this! Super flavourful and easy. I could not get banana peppers, so used Anaheim instead - excellent!Sharon LightfootOttawa, Canada8/7/2021Buenas noches... la receta dice que se usan muslos y en la foto se ven pechugas, ¿es esa foto realmente de está receta? Gracias.\n\nGood evening ... the recipe says that thighs are used and in the photo you see breasts,¿Is that photo really of this recipe? Thanks a lot.ocramzaidVenezuela5/20/2018Explore Bon AppétitChicken ThighChickenPoultryEasyMainDairy-FreeGluten-FreeNut-FreeKetoGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-09", "author": ["Condé Nast", "Commander S Palace", "New Orleans"]}