{"id": "b6d9803be81693608c755f242c69dba8", "url": "https://www.bonappetit.com/story/farm-sanctuary-instagram", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Are Farm Sanctuary Instagram Accounts Making Us Eat Less Meat? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleAre These Instagram Accounts Making Us Eat Less Meat?Farm sanctuaries are using social media to promote veganism, one cute goat video at a time.By Aditi ShrikantSeptember 17, 2018FacebookTwitterEmailIllustrations by Annalee SoskinFacebookTwitterEmailBaby goats frolicking through airbrushed pastures, a cow’s wide eyes and lengthy lashes staring into your soul, a pig sliding itself into a squishy mud hole: All of this is tailormade for Instagram likes. So it’s no wonder that farm sanctuaries—non-profits that house farm animals for protection rather than for work—have such loyal fan bases. See The Gentle Barn with its doe-eyed cows, Animal Place’s cuddling bunnies, and Catskill Animal Sanctuary and its floppy-eared goats.  But for most sanctuaries, it’s not just about getting people to smile, share, and double tap. It’s about promoting a lifestyle. It’s about veganism. And it’s working.Instagram contentThis content can also be viewed on the site it originates from.Most farm sanctuaries’ social media strategies are a far cry from the PETA-style protests, shock videos, blood-throwing, and judgemental messaging that dominated the vegan movement for decades. In large part, that’s because the way we think about veganism as a concept has changed. As everyone from Oprah to Mark Bittman to Miley Cyrus talk about how eating less meat and dairy has improved their health and their lives, veganism has shed its reputation as a stringent diet and has instead become a lifestyle, one that allows for some fluidity and often goes by the new, gentler name “plant-based.”Jenna Blumenfeld of New Hope Network, a media and research company that covers wellness business trends, says the shift from “vegan” to “plant-based” was a conscious decision by companies hoping to appeal to a broader consumer base. Plant-based goods are for anyone who is an environmentally conscious consumer, something 52 percent of millennials say they want to be, according to New Hope’s research.“Plant-based food sales have grown twenty percent in the past year, and that’s incredible because total food sales are growing at just two percent,” Blumenfeld says. “So that messaging is working.”According to New Hope, sales of almond and oat milk are skyrocketing while cow’s milk is in a decline, and Jenna says every product that comes across her desk has “plant-based” stamped somewhere on it.Purchasing healthy and environmentally conscious products is more important to millennials than to their parents. According to New Hope’s research, 55 percent of millennials are actively looking for ways to reduce their meat intake for health reasons (compared to 34 percent of boomers), and 52 percent consider climate change when buying products (compared to 27 percent of boomers). But one thing that all generations claim to care about is the animal: 67 percent of millennials and 62 percent of boomers say they are concerned with how livestock is treated. This is perhaps why farm animal sanctuaries have more power on the internet than they ever expected to have.New York’s Catskill Animal Sanctuary founder Kathy Stevens says that everything on CAS’s Instagram account is posted with an “ulterior motive.” They show how pigs also love a belly scratch, ducks wag their tails, and chickens fall in love.Instagram contentThis content can also be viewed on the site it originates from.“When we post happy animals, the text is usually comparing a pig playing to a dog playing or child playing,” she says. “They always have the intention of helping people understand that farmed animals are nuanced individuals with the same emotions and desires that cats, kids, and dogs have,” she says.The first farm animal sanctuary was founded in 1986 by Gene Baur, who had been investigating factory farming and slaughterhouses in an effort to raise public awareness. In its early days the Farm Sanctuary rescued some animals from the factory farms it was investigating and placed them in new homes. Now, Farm Sanctuary has three sanctuaries, two in California and one in New York, which house animals, give tours, and host events like vegan picnics, “plant-powered” walks and Turkey-absent Thanksgiving feasts.Farm Sanctuary has 294,000 followers on Instagram. A photo of pigs spooning racked up over 11,000 likes, a toothy grin from a baby goat got 6,700, and a video of a duckling’s shaky waddle was viewed more than 26,000 times. Instagram’s effect on people going vegan is hard to quantify, but Baur does know that the social media platform has drawn more people to events and tours, both of which frequently sell out. The mass appeal of cute animal photos gets people to engage with the farm, where they can see an idyllic society of animal-human coexistence.Instagram contentThis content can also be viewed on the site it originates from.And although you can find factory farming content on the Farm Sanctuary website, Baur says they are careful with the images they use. “If people see horrible image after horrible image, it can be depressing and even demoralizing,” he says. “People may feel they can’t do anything. Our key message on our Instagram posts is that these animals are somebody, not something, and that they want to live and enjoy life like all of us.”Until the early 2000s, Farm Sanctuary was the only organization of its kind. Now farm sanctuaries dot the country and appear in almost every state. Catskill Animal Sanctuary has saved 5,000 animals since it opened in 2001, and it has about 300 residents on the grounds today. Residents come from a variety of backgrounds including factory farms, hunting clubs, and local farmers.One such farmer, Bob Comis, used to raise pigs for slaughter until he became overcome with remorse from killing something so aware and present. He brought The Last Pig, named Mario, and a few others to the Catskill Animal Sanctuary and became a vegetable farmer instead. Anecdotes like this were peppered through a recent tour of the sanctuary while visitors pass various animals, including Mario, all in a deep slumber.Stevens says that she started offering tours almost immediately after opening the sanctuary, but social media has undoubtedly driven more traffic to all the services CAS offers—vegan cooking classes, talks on the ethics of veganism, a vegan mentorship program where those who want to be vegan are paired with a seasoned vegan to guide them into a plant-based life. Now events sell out and she gets visitors from all over the world.But farm sanctuary staff understand that the feelings they provoke on the farm don’t always last. After all, one study found that 84 percent of people who call themselves vegan have left the lifestyle within the year. That’s why Instagram has been so useful.“Farm sanctuaries are often a catalyst for transformation,” Baur says. “Then [people] go home, and if others around them are not supportive, they can maybe go online or go to our Instagram feed and see animals that are enjoying life and be reminded of the transformative experience they had.”Stevens knows some people are moved to action by shocking footage of factory farms, but she thinks taking a positive tone is more effective and reaches a wider audience, even if the audience is less militant about the cause. She hopes that followers who saw Mario relaxing in the mud during their morning Insta-scrolls will think twice before ordering the pulled-pork sandwich come lunchtime. Same goes for that photo of Tucker, a massive steer who’s huge body is a result of his mother being fed growth hormones, getting his chin scratched: Will that cheeseburger still taste as good?Explore Bon AppétitHealthyishVeganSocial MediaTrendsRead MorecultureChicago’s Forgotten Vegetarian Past—and the Woman Who Wants Us to RememberBy Jake MalooleyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-14", "author": ["Condé Nast", "Aditi Shrikant"]}