{"id": "b6e09045bb16a542ece4cd9a20492678", "url": "https://www.bonappetit.com/story/sole-di-capri-tablecloths", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I Eat at Sole di Capri in NYC for the Photo-Realistic Tablecloths | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Eat at Sole di Capri for the Photo-Realistic TableclothsHave you ever eaten Italian food on top of photos of...Italian food?By Lauren LarsonApril 16, 2019FacebookTwitterEmailPhoto by Cole WilsonFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.By night the vibe at Tribeca’s Sole di Capri is romantico-rustico with staid white tablecloths and cloth napkins. But at lunchtime the place transforms, like Lady Gaga taking off her makeup, into something even more resplendent. The tablecloths are replaced by worn-in flannel-backed vinyl covers, printed with a photo-realistic trompe l’oeil of a picnic table strewn with bowls of bland-looking orecchiette and fusilli pasta, accented by the occasional lost red onion or errant head of broccoli. Some tables are covered in cheeses, others in a riot of baguettes and ciabatta loaves that has been described by guests as “fantastic” and “so strange.”Eduardo Erazo, Sole di Capri’s owner of 13 years, told me that his wife found the one-of-a-kind coverings in a town in Northern Italy on their last trip there three years ago—they came from large rolls, which are then cut to size. She was particularly drawn to the coverings decorated in pastas and cheeses. “The bread is too cute.” The coverings have a global fan base, Erazo said. “Tourists come in from France and Italy, and they ask if they can buy them.”Sole di Capri’s placemats are only on view at lunch—at dinner they change to white tablecloths.\nPhoto by Cole WilsonErazo isn’t selling. He likes them for the daytime because they’re easier to clean than white tablecloths. When pressed to explain why he uses white tablecloths at all, Erazo said, “Our prices are lower during the day. At night people spend more!” But anyone who’s eaten at Sole di Capri can confirm the lunchtime tablecloths are reason enough to patronize the restaurant. They’re like the bright-orange flower-power slipcovers my mom used to whip off the furniture when guests would come over—everyone liked them better than whatever pattern was underneath. That must be why they give me a sense of uncanny nostalgia that traditional red- and blue-checked tablecloths fail to arouse. I find myself wondering: Did a beloved childhood friend have a pasta tablecloth? Was I born on a pasta tablecloth?Some people (heretics) have suggested it’s overkill for a restaurant that deals largely in pasta to cover its tables in pasta (and bread and cheese) art. I can see why detractors might feel overwhelmed while enjoying a bowl of tagliatelle alle acciughe mere inches away from a photo-realistic pile of un-sauced, underwhelming penne, but I think that’s the magic. At a time when reality is so rarely better than the picture, the food Sole di Capri serves looks so much better than the stuff that’s printed underneath.Lauren Larson is a writer and editor in New York City, aspiring to be a writer and editor in Bali.Explore Bon AppétitRestaurantsItalian AmericanRed SauceNew York CityRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Lauren Larson"]}