{"id": "b6e465135e23a94484983e3882ef77d4", "url": "https://www.bonappetit.com/recipe/macadamia-and-brown-butter-blondies", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Macadamia and Brown Butter Blondies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2020 IssueMacadamia and Brown Butter BlondiesBy Roxana JullapatJanuary 12, 20214.7(10)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintAt her L.A. bakery Friends and Family, Roxana Jullapat bakes these blondies in a round cake pan, which ensures that each slice has a chewy, toasted edge and a soft center. “This caramel-flavored treat demonstrates the powerful pairing of brown butter and barley,” Roxana writes in her cookbook Mother Grains (out April 2021). Barley flour gives baked goods a silky, chewy texture, dense crumb, and butterscotch-y flavor. Want to experiment? Make these with 3⁄4 cup (80 g) einkorn flour in place of the barley flour for an even chewier blondie.IngredientsMakes 12Nonstick vegetable oil spray½cup (65 g) whole raw or toasted macadamia nuts½vanilla bean, split lengthwise18Tbsp. unsalted butter¾cup plus 2 Tbsp. (105 g) all-purpose flour¾cup (85 g) barley flour1¾tsp. baking powder1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt1cup plus 7 Tbsp. (packed; 285 g) dark brown sugar2large eggs1tsp. vanilla extract2pints ice cream of choice (optional)PreparationStep 1Preheat oven to 350°. Lightly coat a 9\"-diameter cake pan with nonstick spray and line bottom with a parchment paper round. If using raw macadamia nuts, toast on a rimmed baking sheet, tossing once, until golden, 8–10 minutes. Let cool, then coarsely chop.Step 2Scrape vanilla seeds into a small saucepan; add pod and butter. Set over medium-low heat and cook, stirring occasionally, until butter foams, then browns, 6–8 minutes. Transfer to a medium bowl, scraping in all of the browned bits. Using tongs, remove and discard vanilla pod.Step 3Whisk all-purpose and barley flours, baking powder, and salt in another medium bowl. Add brown sugar to brown butter and stir to combine. Add eggs one at a time, stirring well after each addition. Stir in dry ingredients, then vanilla extract and nuts. Scrape batter into prepared pan; smooth top.Step 4Bake blondies, rotating halfway through, until top is golden brown and a tester inserted into the center comes out clean, 40–45 minutes. Let cool.Step 5Turn out blondies, remove parchment, and cut into 12 wedges. Serve each with a scoop of ice cream if desired.Reprinted from Mother Grains: Recipes for the Grain Revolution. Copyright © 2021 by Roxana Jullapat. With permission of the publisher, W.W. Norton & Company, Inc. All rights reserved.\n\nBuy the full book from Amazon.How would you rate Macadamia and Brown Butter Blondies?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI made these this morning. So good  and not hard to make. This recipe is a keeper.. LizGVancouver, BC3/28/2021So good! Mine collapsed a little in the middle but that was fine. So yummy. Would let cool allll the way before cutting just to minimize crumbliness.Emily Calgary, AB3/25/2021Seen this in the recent mag, and looked gorgeous. More importantly it looked quite simple and it was. I actually used the einkorn flour as I couldn't find barley flour. Nice, soft, and chewy. 👍Matt1/15/2021Explore Bon AppétitCookieDessertBar CookieMacadamia NutNutBarleyRice & GrainsEasyBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Roxana Jullapat"]}