{"id": "b6e54b1baf078b0b08cc33a8bab20dd0", "url": "https://www.bonappetit.com/story/pizza-stone-baking", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "A Pizza Stone Comes in Handy for So Much More Than Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’m Baking E-v-e-r-y-t-h-i-n-g on This Pizza StoneGalettes! Vegetables! A whole dang fish!By Carrie HonakerOctober 14, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Suffering from pandemic anxiety, I, like many others, turned to my one effective form of therapy: baking. My heart was set on a fluffy set of brioche cinnamon rolls, but with everybody consumed with making bread, yeast was nowhere to be found. I dejectedly went home to replan. I pulled out my Food52 Genius Desserts cookbook and started looking for non-yeast baked goods. A completely gorgeous galette (page 215, if you’re wondering) reached out and said, BAKE ME!My kitchen life changed that day. A little footnote to the recipe suggested something unorthodox—to bake the galette on a cold, parchment-covered pizza stone. It was the easiest, most beautiful galette I have ever made, a pseudo-pie of stunning plums and blackberries bathed in brown butter and encrusted in golden pastry. Because a pizza stone is excellent at retaining heat, it provides a hot, even surface that’s superior to that of a regular baking sheet. And it’s not just good for galettes and, well, pizzas. My success inspired a frenzy of bread, roasted veggies, hand pies, flatbreads, and on and on.When it comes to purchasing a stone, the landscape is vast. They’re made of everything from ceramic to cordierite to steel and can be rectangular, round, or square with varying temperature thresholds and price points. My tool of choice is the Emile Henry 14\" Pizza Stone, which is glazed in black or red.While I thought glazing would be counterintuitive to its moisture-reducing benefits, according to the packaging insert, this product is made from Burgundian clay and “micro-crazed.” That means the glaze has tons of tiny cracks that absorb moisture, thereby contributing to a crispy crust, per the description provided on restaurant supply store KaTom’s website. The proprietary glaze is designed to prevent chips or scratches, though I suggest moving your baked good to a cutting board before slicing in order to preserve the blade of your knife. And the best part? It has handles, making it possible to transport, even with oven mitts on.In addition to being easy to clean up, reliable, and sturdy, the Emile Henry stone is versatile. It can withstand up to 932°F  heat and comes with a 10-year warranty, which made the decision to use it on the grill an easy one. I started with a galette, moved onto pizza and flatbread, and then went all out with a whole red snapper stuffed with herbs and lemon. I rubbed the fish with olive oil, but everything else I grilled straight on the stone, and it easily lifted off when finished.Kitchen equipment comes and goes, but my love for this humble pizza stone is here to stay. Sometimes it pays to read the footnotes.Emile Henry Pizza Stone, 14\"$50 at Williams Sonoma$50 at AmazonCarrie Honaker is an educator and freelance writer based in Panama City Beach, Florida.Explore Bon AppétitShoppingPizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-14", "author": ["Condé Nast", "Carrie Honaker"]}