{"id": "b6fad842991092598168596ca9cea1b2", "url": "https://www.bonappetit.com/story/when-mise-en-place-matters", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "Why Mise En Place Is Only Sometimes Important | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMise En Place Looks Cute—But It Doesn't Always MatterThere's a time and place for mise en place.By Sarah JampelApril 21, 2020FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailI’m about to contradict a piece of advice we at BA have given you a hundred times by saying this: Most of the time mise en place is just not that important for the average home cook.If it isn’t already seared into your brain, mise en place is French for “put in place” and refers to the set-up wherein all of the necessary ingredients and tools are organized neatly and toeing the start line. Chopped garlic? Check. Toasted nuts? Check. Soy sauce in one tiny bowl and gochujang in another? Check, check. It’s sort of like how I used to make sure my fly was zipped and my shoes were tied and my fly-away hair was fully contained before entering the office building.But while there’s a lot of emphasis placed on mise en place as THE MOST IMPORTANT THING IN THE WORLD, it’s not always that critical for the average home cook—a person who isn’t plating a hundred meals over the course of a couple of hours. Of course if you’re making a super fast-cooking dish like a stir-fry where you don’t have time to pause, the mise en place will keep you on track. And if you’re building a stew with lots of spices, it will stop you from rummaging around in the pantry for ground coriander while the turmeric is burning.A cute set-up with a million tiny measuring cups!\nLet’s say you’re making a recipe, like this cheesy greens gratin, where the cooking happens in progressive stages, with inactive time between each part during which you could prep for the next. In that case, setting up your mise en place can actually waste time and, if you’re divvying ingredients into bowls, create a lot more dirty dishes.Here on Basically, our recipes are written to walk you through the mise en place process. We list all of the ingredients in their unprepared form, then tell you exactly when to slice, measure, or mix. But most of Bon Appétit’s recipes (and most recipes in the world at large) expect that you do that mental work yourself. If you’re thinking to yourself “uh, rude,” remember that recipes that do not incorporate all of the prep into the directions tend to be shorter and easier to digest.When you’re deciding whether to mise (and how to do it), first, read the recipe. Seriously though! This is so that you don’t get burdened with a three-hour marinade at 7 p.m. and so that you get a grasp of how quickly things come together. The faster the cooking process, the more important it is to mise. Otherwise, you risk over-cooking one ingredient while you prep the rest.And if you decide that you are going to mise, remember this:The ingredient list contains your prep list, too. Ingredients are numbered in the order they’re deployed. So when the first few ingredients come with a preparation note, like “3 garlic cloves, crushed,” check that off your list before you advance even to step one. Ingredients that come later can be prepped later, too—as long as there’s plenty of inactive cooking time in between.Combine anything that goes into the pot/skillet/pan at the same time in the same bowl. It might look cute to have the sesame oil in one tiny container and the soy in another, but early consolidation will save you from the dish-washing blues later.Use a sheet tray to stay organized. Arrange your bowls on a half- or quarter-sheet tray so that everything is contained and can move together from your prep space to your cooking space.Mise en place includes equipment, too. It’s just as important to take a roll call of your ingredients as it is to make sure that your one whisk isn’t buried in a dirty dishwasher before you get to the “whisk constantly” phase.If you've messed up, it’s (usually) okay to pause your cooking. Your chopped onion is burning on the stove as you’re frantically trying to peel ginger, grate garlic, de-seed a chile, and FaceTime with your best friend. In these circumstances, it’s usually okay to turn off the stove and move the pan off the heat. It’s often better to take a brief pause before returning the pan to the heat than to watch the whole thing go up in flames (metaphorically of course).And, of course, it helps if you’ve gotten your basic knife skills in order, too. You’ve got this!Ready, set, mise:Spicy Chicken Stir-Fry With Celery and PeanutsThis one-skillet recipe is fast and furious—ideal for those nights when you have 10 minutes to stand at the stove, tops. The cooking technique is in the tradition of Chinese stir-fry, in which proteins and vegetables are chopped small so that they cook quickly over high heat, then bound together with a cornstarch-thickened sauce.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-21", "author": ["Condé Nast", "Sarah Jampel"]}