{"id": "b702c4d5481b6e7fcfeb9cd5128731c4", "url": "https://www.bonappetit.com/story/all-day-cafes-changing-the-way-we-eat", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "All Day Cafés Are Changing the Way We Eat Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsAll Day Cafes Are Changing the Way We Eat OutHow did airy, stylish, veg-centric natural wine–pouring cafés become the iconic restaurant genre of 2018?By Christine MuhlkeJanuary 15, 2018FacebookTwitterEmailPhoto by Brandon HarmanFacebookTwitterEmailBy 9:04 a.m. I’m meeting over a bowl of chili-turmeric broth with oat-milk foam (yes, that’s a thing) at De Maria in New York’s Soho. Around us there are post-yoga friend dates and laptoppers and a few more two-tops over which hover word bubbles filled with “concept” and “brand.” Pretty much everyone stops to photograph their food on the colorful tabletops before taking a bite. By 10:30 a.m., I’m taking another meeting for a project with my food consultancy, this time at the light-filled breakfast-lunch-dinner spot L’estudio. I sip a matcha latte served in a ceramic cup that was made in the studio next door and nibble on a slice of zucchini-walnut bread. (I’m describing a real morning in my life, by the way—I couldn’t make this up.) Afterward, I bike up to Noho for a one o’clock, this time at Atla, a sunny corner spot helmed by award-winning chef Daniela Soto-Innes, where the brunch menu, with its painterly chia pudding and its fermented pineapple elixir, is served until 4 p.m.If I didn’t have so much actual work to catch up on, I could go back to any of these places after nature had flipped her dimmer switch for a glass of natural wine or a juice-y cocktail. I’d share a few plates of adventurous-hippie food, the chefs finally stretching out after a day of styling grain bowls and topping toasts. And I could have this experience not just in New York or L.A. but also in Nashville or Chicago, Austin or Sioux Falls, just, you know, drinking a turmeric tonic out of a wafer-thin tumbler and admiring succulents in their cast-concrete planters, absorbing all the new tropes under an affirmational neon sign.The midday scene at Kismet in L.A.\nPhoto by Brandon HarmanFor this is the all-day café, the Venn diagram of America’s current food moment, from the healthy-vibing menu to the curated decor to the need to eat while you work and meet. Part café, part restaurant, part workspace, part community center, this is the fabled “third place” between work and home that so many café owners strive to achieve. In the past, you went to diners or bars, Starbucks or coffee shops with single-origin pour-over menus. Now it’s one big happy hashtag, garnished with a watermelon radish—and it’s influencing how we eat, cook, decorate, work, and socialize.The FoodHow did we get here? Back in the aughts, being a buzzworthy restaurant meant serving decimating amounts of pork product, fried vegetables, and poutine, consumed with oceans of booze and finished with a shot of Fernet-Branca. It was an international bro-down as American chefs bowed to the likes of St. John’s nose-to-tail master Fergus Henderson and Pied de Cochon’s lethal genius Martin Picard. The most exciting things in food were sharing a plate of chorizo-stuffed bacon-wrapped dates at Avec in Chicago, and ordering poutine smothered in oxtail gravy at Animal in L.A. As a food writer, I loved the gonzo thrill of these epic food parties, with their loud music, louder chefs, and brazen screw-yous to fine dining (even though many of the chefs came from four-star kitchens). What I didn’t love was how I felt the next morning. Make that day.Sara Kramer (left) and Sarah Hymanson of Kismet.\nPhoto by Brandon HarmanAnd then a few shifts occurred in the food world. In L.A., paparazzi snapped athleisured celeb couples sitting down to raw vegan bowls at Café Gratitude, and, well, who doesn’t want to look like that? Lalito chef Gerardo Gonzalez, who grew up in Southern California, channeled menus like Café Gratitude’s when making the kale salad and raw falafel that put El Rey on the all-day map in NYC in 2015. De Maria chef Camille Becerra has always drawn upon her early training at macrobiotic restaurants and a Zen center. In recent years, though, her homages to the Dragon Bowls that she once made at the NYC macro pioneer Angelica Kitchen have really resonated, bringing her attention first at Navy in 2014 and then at Café Henrie before she joined De Maria last year. With her neon swooshes of, say, beet-tahini dressing and jazzy add-ons like turmeric-poached eggs, her fashionable bowls have tapped a nerve in the food world.Meanwhile, coffee bars ascended, driven in part by young Australians, who, along with flat whites, brought with them something called avocado toast. Both are an essential part of their all-day café culture, in which savory-leaning breakfast dishes are often served until late afternoon at such stylish pioneers as Bills in Sydney. That café’s influence can be seen at rising Aussie-owned chainlets like New York’s Two Hands and the always-crowded Bluestone Lane coffee shops.Over on the business side, higher rents meant that it made sense for restaurants to be open for more than one service.But more than anything, it’s the people running these restaurants who have made the all-day café what it is. All of the women I interviewed for this story—and women are the driving force behind this movement—could have gone the fancy-tasting-menu route when opening their own places but chose not to. Julia Jaksic, who opened the self-described “somewhat healthy” Cafe Roze in Nashville last year, staged at Charlie Trotter’s in Chicago, then grew to realize that the intensity of white-tablecloth restaurants wasn’t for her. A job with chef Missy Robbins was a turning point: “She was taking her inspiration from traditional Italian food,” Jaksic said. “I realized I didn’t need to be in big fancy kitchens.”Catching up at De Maria in NYC.\nPhoto by Alex LauWhich brings us to Sqirl. A former fine-dining pastry cook, Jessica Koslow opened the seminal East Hollywood daytime spot in 2012 as a pop-up with G&B Coffee to showcase her line of jams. When she first explored opening a restaurant in postcrash 2010, the economy in her Silver Lake neighborhood wouldn’t have supported a dinner-only spot. Besides, she wanted to open the place she felt was lacking in L.A.: something that combined the all-day cafés she’d experienced while living in Melbourne for a year with the “little cafés that make your neighborhood feel like a community” that she’d loved during a stint in Greenpoint, Brooklyn, in 2008. In L.A., “there wasn’t any place to go to feel like you could get some work done and feel like part of a neighborhood.” And there was nowhere making the kind of food she wanted to eat, no matter what her mood.The avocado toast that she wanted to eat was anchored by green garlic crème fraîche and electrified by pickled carrot ribbons and lacto-fermented hot sauce, a turmeric-ginger tonic at the ready. (Koslow had discovered the Ayurvedic brew, known for its anti-inflammatory properties, after hurting her ankle.) Or maybe she was in the mood for a slice of thick-cut toast with jam and ricotta—both house-made, of course. Whatever she wanted to eat was soon craved by Angelenos with a schedule flexible enough to allow for standing in line. Those Angelenos were eventually joined by food writers and chefs from around the world, and before you knew it, all anybody wanted was a Sqirl of her (or his) own.Chicken with curried yogurt at Cafe Roze in Nashville.\nPhoto by Luis GarciaThe StyleThe all-day café is as much an aesthetic as it is a cuisine. The first-wave iterations, which opened a few years ago now, were marked by brass accents, hot-pink neon, and welcome-to-my-house plants. In part, it’s a look that was ushered in by Amy Morris and Anna Polonsky of New York design firm the MP Shift when they slapped together Tilda All Day (now Otway) on a microbudget in 2015. The duo decorated the walls with geometric patterns inspired by painter Sol LeWitt and designed seating arrangements to accommodate meetings, friend dates, and freelancers alike. Tilda led to commissions for further cafés like De Maria and Golda.How soon until the design vibe becomes one pink cliché? That’s a full-time challenge now that the MP Shift has been hired to design all-day spaces like Vibrant in Houston and create the branding for “L.A.–style” café Echo in Paris—the concept of an all-day café in Paris being laughable, considering that the city’s had a lockdown on them since the 1800s.At Kismet, an L.A.–style café that former New York chefs Sara Kramer and Sarah Hymanson opened in Los Feliz last year, the now-familiar design elements—light wood furniture, desert greenery, cursive pink logo—have been refined. In this case, the neon sign is a subtler dusty quartz. As for the secret to designing a space that looks good at breakfast, lunch, and dinner? “Dimmers,” Morris and Polonsky say in unison.Natural wine and local produce on the shelves at Botanica in L.A.\nPhoto by Brandon HarmanThe CultureIf all-day cafés share menu and design philosophies that are quietly reshaping the way we eat, cook, and decorate our homes, they share mission statements, too. Behind this moment is a not-yet-cynical desire to be many things to many people, to reflect how they live, to give them a place to feel at home.“For us, it’s about creating a community space as opposed to fulfilling some highbrow creative vision we had,” Kramer said. In this sense, the restaurants meet the demands of the new freelancer economy, in which a lot more people—like myself—have opted out of office jobs, and, therefore, offices. We need a place to eat while we meet, whether that’s at 10 a.m. or 3 p.m.It’s not just about the atmosphere in the dining room; it’s also about what goes on in the kitchen. For Becerra, it was time to cook free of male egos. “I’d always worked in restaurants that were owned by men and had men chefs,” Becerra said. So when she was approached by the women behind De Maria to do something new, she was like, “ ‘Yeah! Sign me up!’ ”She wanted it to be a kitchen where other female cooks could learn from her, rather than be intimidated, hazed, or harassed. “When you’re a cook, you’re working in a kitchen ten hours a day,” Becerra said. “All you want for them to have is a good place to spend 70 percent of their life!”Chef Camille Becerra in the kitchen at De Maria.\nPhoto by Alex LauThese chefs want their restaurants to be places where people can come and have whatever kind of meal they want—rather than have a chef imposing his or her amazingness upon their clientele. “A space that is open all day gives more control to the diners; they’re able to use it in a more varied way,” Hymanson said. She’d had that experience the morning we spoke, after someone ripped the bumper off her old Honda. The garage was near all-day favorite Botanica, so she went in and got a hug from the co-owners along with her coffee. “I didn’t have to be performing, which is how I think many people feel when they go into a restaurant that’s open just for dinner,” Hymanson said. “I could just go there and take care of myself.”Just today, I understood what she meant. Exhausted by a crummy cold and hit with the realization that my son had a half day of school, we went to lunch at Nourish Kitchen + Table, Marissa Lippert’s all-day café in the West Village. Choosing from bounteous Ottolenghi-style platters, we sat down to caramelized sweet potatoes with pomegranate molasses, brown rice sautéed with ginger and coconut, and more. The service was so warm, the room so lovely, the food so…nourishing, it’s not an exaggeration to say that I left there restored.On the way out I noticed that Nourish serves natural wine by the glass. I’ve already scheduled back-to-back meetings there next week.For an all day café vibe, try our take on bacon and eggs:Turmeric Fried Eggs with Kale, Yogurt, and BaconBreakfast bowls shouldn’t take 2 hours to make; this one is ready in about 20 minutes.View RecipeExplore Bon AppétitHealthyishRead Morerecipes60 Vegan Dinner Recipes That We Just LoveGallery60 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-15", "author": ["Condé Nast", "Christine Muhlke"]}