{"id": "b707e7c3888dce623172d74c63208da7", "url": "https://www.bonappetit.com/story/bake-croutons-directly-into-soup", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "Bake Crunchy Croutons Directly into Your Soup, Win at Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBake Crunchy Croutons Directly into Your Soup, Win at LifeTurn your favorite soup into a savory crème brûlée.By Molly BazJanuary 22, 2019FacebookTwitterEmailFacebookTwitterEmailI think we can all agree that, more often than not, a bowl of soup, a hearty stew, or a saucy braise is only improved by the addition of bread. Sometimes that’s a hunk of freshly baked baguette. Other times a buttery dinner roll. Bread is the staff of life, as they say.But lately it feels like that phrase should be amended to “fried bread is the staff of life.” Everywhere I look somebody (myself included) is frying a thick slice of sourdough bread in a slick of olive oil until crunchy and golden brown on one side, soft and doughy on the other, and serving it alongside any saucy concoction worthy of soaking. If you’re not one of those people, I urge you to become one. Immediately. Fried bread for life.But, as I recently discovered, fried bread is not necessarily the end-all, be-all of carb-on-soup situations. One day recently, while working on a Basically recipe for ribollita—a thicccc Tuscan vegetable, bean, and bread stew—it occurred to me that there may in fact be a future beyond fried bread. Don’t get me wrong: I love the stuff. But perhaps the lone slice of fried bread, riding shotgun in most cases, could take center stage. An exploration seemed in order, and that already-bready ribollita seemed like the perfect place to start.Traditionally, Ribollita is made thick and hearty by cooking leftover stale bread directly into a broth-y combination of stewed tomatoes, beans, and other veggies. The bread falls apart and enriches the soup, adding stick-to-your-bones body to the final dish. I like that idea—bread as stew thickening agent. But I was missing the crispity-crunchity quality that fried bread lends, and I didn’t see any reason why I should have to choose one or the other.Bread that has a good ratio of crusty exterior to soft interior is what you're looking for here.\nRen FullerThus, the concept of torn-croutons-baked-directly-into-the-top-of-a-soup was born. Once my glorious, soggy bread-enriched ribollita was almost finished, I covered the entire surface of the stew with irregularly-shaped hunks of crusty sourdough bread and drizzled pleeeeenty of good olive oil overtop. Then I popped the whole Dutch oven into a 450° oven until the the stew was thick and burbling, the tops of those craggy croutons were deeply golden and crisp, and the undersides were soaked in thick tomato-y deliciousness. It was the best of both worlds—super-crunchy and soggy-rich at the same time—and I didn't even need to dirty another skillet or sheet pan to make it happen. Now that's living!Even better? This same technique can be applied to literally anything stewy and thick enough to support the bread. Beef stew.  Creamy tomato soup. Minestrone. Lentil soup. Split pea. The crout'-on-soup possibilities are truly endless.So go on: Crack into that crust like it’s a savory crème brûlée, and tell me you’d rather eat regular ol' fried bread on the side.Go forth and bake croutons right the hell into your soup:Simple RibollitaThis (vegetarian!) Italian classic is about as comforting as it gets, packed with hearty greens, meaty beans, and plenty of rich olive oil and umami-packed Parm.View RecipeExplore Bon AppétitCroutonBasicallySoupStewBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-22", "author": ["Condé Nast", "Molly Baz"]}