{"id": "b713358c3eacccd2dd6f8d0de7242c9c", "url": "https://www.bonappetit.com/story/2021-tiktok-trends-reviewed", "year": 2021.0, "month": 12.0, "day": 4.0, "content": "The Top TikTok Food Trends of 2021, According to an Elder Millennial Who Doesn't Know What's Going On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe Made a Not-on-TikTok BA Editor Review the App’s Unhinged Food TrendsThese are the top FoodToks of 2021, according to an elder Millennial who has no idea what’s going on.By MacKenzie Chung FeganDecember 23, 2021FacebookTwitterEmailIllustration by Geoff KimFacebookTwitterEmailHow do you do, fellow kids? It is I, a cool and relevant elder Millennial who knows lots of things about trends and slang. I own a lime-green eyeshadow from a DTC beauty company. Yesterday I complimented someone on their Jibbitz. So I was flattered but not surprised when our lifestyle editor asked me to write Bon Appetit’s year-end roundup of TikTok food trends, seeing as how I have my “finger” on the “pulse” of this cultural moment.I did have one slight hesitation. I’m not on TikTok. I have seen TikTok videos, of course—mostly via Instagram or the platform’s terrible desktop interface or this SNL documentary. Many creators are doing delicious, bizarre, wonderful things with food on the platform, and I work with at least one very talented person who is legitimately TikTok famous. And yet I remain unclear on whether the word TikTok is a noun, adjective, verb, or all of the above. I’m on top of FoodTok in the same way that I’m on top of professional sports—if I need to talk to your uncle about the Jets, I can do so for five minutes before I run out of material. And so, I present to you a very official critique of 2021’s TikTok food trends, written by someone who uses earbuds with a cord. (Wait, is that in again?)Pesto eggsThis one is clever! Without having tried this hack, I imagine that there’s enough oil in pesto to sub in for a knob of butter or a glug of olive oil, with the added bonus of bright herby flavor and a little frico action from the cheese. Would still recommend a nonstick skillet, but I’d try it. Nine out of 10 TikToks (it’s a scientific unit of measurement now too). Points off because that yolk is a little too done for my taste.TikTok contentThis content can also be viewed on the site it originates from.Drinking chlorophyll water for “wellness”This probably won’t kill you, but as a general rule, let’s not start ingesting supplements based on internet videos, yeah? Could we not just...eat spinach? Looks pretty, seems scammy, two out of 10 TikToks.Cooking in the woods, as ASMRI don’t get brain tingles from ASMR, but I did find this deeply satisfying. In an alternate reality where I’m on TikTok, the thing I like most about the platform is the feeling of being transported to locations very different from my own. Plaudits for strong knife skills (that ginger brunoise?) and the cleavers-as-tongs trick. An enthusiastic 10 out of 10 TikToks.Adding protein to coffeeCan we leave coffee alone? Wasn’t it fine without ghee and protein powder? I don’t support, but I also don’t think this one is TikTok’s fault—let’s blame protein bros and the “wellness” industry. One out of 10 TikToks.TikTok contentThis content can also be viewed on the site it originates from.Baked feta pastaFifty years from now, will baked feta pasta define our cultural moment in the same way that fondue did for the ’70s or flourless chocolate cake did for the ’90s? To me, this seems like the quintessence of FoodTok—there’s a hacky element, you need little to no cooking expertise, and it’s intensely cravable. Eight out of 10 TikToks.Emily Mariko’s salmon riceI’m on a roll, I know this one too! We wrote about Emily’s favorite knives. I admit to being befuddled by the virality of this video. Unlike the feta pasta or sushi bake trends, there doesn’t seem to be anything particularly novel about the recipe or preparation, but she seems nice, like maybe she’d let me sit with her if I were new at school. Six out of 10 TikToks.Dipping slices of raw onion as “chips” in salsaPass.TikTok contentThis content can also be viewed on the site it originates from.Adding dozens of garlic cloves to recipesMy grandfather was in the Les Blank film Garlic Is As Good As Ten Mothers (he’s the Chinese chef who makes a chicken stir-fry while reciting a poem about his love of America and jogging), so the Garlic Girl trend speaks directly to my soul. Also, the roasted cloves being squeezed out of their compartments is very Dr. Pimple Popper—extra credit. Eleven out of 10 TikToks.Inserting garlic up the, uh, noseWhile I believe in the healthful properties of garlic, per my last email, this I did not need to see. What’s with the drums in the background? Chaos out of 10 Tik Toks.Putting the entire block of cream cheese into the CrockPotIs this why there’s a cream cheese shortage? Can we hold CrockPot TikTok responsible? I give it a six.TikTok contentThis content can also be viewed on the site it originates from.Butternut squash and roasted garlic pastaDon’t know about this one. Cubed butternut squash, sliced mushrooms, and a halved onion are not going to all cook at the same time, and that sheet pan is crowded. I’d invest in some quarter-sheet pans, young ma’am. Four out of 10 TikToks.Whipped fetaSame person? She seems to be having a good year, I hope she’s doing something nice for herself. I’m starting to sense a FoodTok formula—feta, cream cheese, roasted garlic extractions. The algorithm wants what it wants.Focaccia charcuterie boardVery aesthetic. Compared to some of the more aggressive ASMR videos, the audio is pleasingly spare—good use of aural negative space. Deft with those tweezer tongs too. Seven out of 10 TikToks.TikTok contentThis content can also be viewed on the site it originates from.Eating salad with chipsOh, damn, the tiny cupcake lady is disrupting the salad space? She’s giving me tough-but-respected-high-school-soccer-coach energy. Also, she appears to have a very angry burn and/or wound on her left hand? Hope she’s okay. Six-point-five.Eating pickled garlic from the jarThrilled for garlic, she really seems to be thriving on TikTok. The woman in this video sort of sounds like a sleepy auto-tuned baby, which I find oddly soothing. Eight out of 10 TikToks.Thousand-layer, 15-hour potatoThis potato mille-feuille is essentially the incredible “butter-roasted hash brown” at Gage & Tollner in Brooklyn, which is a hash brown in the same way that the Grand Canyon is a hole in the ground. Shout-out to the Benriner mandoline! A thousand out of 10 TikToks.TikTok contentThis content can also be viewed on the site it originates from.Explore Bon AppétitLifestyleCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-20", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}