{"id": "b71769e5b8303e95718fdf2b35ed787f", "url": "https://www.bonappetit.com/story/no-fuss-salsa-recipe", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "This No-Fuss Salsa Is Our Star-Spangled Side | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis No-Fuss Salsa Is Our Star-Spangled SideIf you’re on chips and salsa duty, bring this homemade salsa and watch everyone swoon.By Elyse InamineJuly 3, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailRemember all those times you forgot to wash your hair (as a presentable adult, that is)? When I do, I pin back the bangs and twist up a bun, anything to draw less attention to all that. But then compliments start coming in from everyone around me—my boss, my coworkers, that random guy at the farmers market (it’s happened before)—as if I put in real, intentional effort to pull off this new look. If only they knew!Well, consider this recipe the didn’t-wash-your-hair-somehow-looks-amazing equivalent of salsa. Let me explain.Salsa recipes can be complicated, calling for different kinds of chiles, maybe a trip to a specialty store, and requiring some kind of toasting of things ahead of time (spices, nuts—and that can be amazing). All those steps add to up to salsas with depth, smokiness, heat, and a certain je nais sais quoi that watery store-bought salsas never have. But when you’re short on time and on chips and salsa duty for your friend’s upcoming Fourth of July barbecue, it’s easy to backslide into the jarred variety. Don’t, because Miguel Vidal, the pitmaster and chef behind Valentina’s Tex Mex BBQ in Austin, has got your back with this very low-effort, high-return salsa.These chips look lonely\nPhoto by Josh DickinsonThe ingredient list is short and gracious, like the golden days of Vine. (So much quality stuff in so little time!) There are only five ingredients (if you don’t count the requisite salt and olive oil): tomatoes, onion, garlic, serrano chile, cilantro, and lime juice. Since it’s early July, tomatoes might not be quite there yet at the farmers’ market, but Vidal’s recipe makes even mealy supermarket tomatoes shine. Cooking down plum tomatoes (or whatever you can find) concentrates all that sweet, tangy tomato-y flavor, plus it gives you solid time to watch a couple national anthems on YouTube (‘tis the season). If Whitney Houston’s 1991 rendition doesn’t have you in tears, you are not a true patriot.Then let your blender do the work, whirring together the slightly cooled tomatoes with all the aromatics (diced onions, torn cilantro leaves and stems, the whole garlic clove, chopped chile nubs). A nice pinch of sea salt goes a long way to finish the salsa, but hold back in case you picked up saltier tortilla chips.And in about 15 minutes flat, you’ve got your go-to-salsa not only for your upcoming barbecue—but the rest of summer. It requires zero planning ahead and really any cooking at all, but it delivers on giving all your chips, tacos, scrambled eggs, whatever you want a little acid, a little heat, a little smoke, and a lot of flavor.Get the recipe:Charred Tomato SalsaNothing beats serving this salsa still warm and freshly blended.View RecipeRelated: Which Tortilla Chip Is Best? A Very Salty Taste TestCarnitas love salsa just as much as you.Explore Bon AppétitSalsaFourth Of JulyappetizerRead Morerecipes48 Recipes for Mexican Foods That Aren't TacosGallery48 SlidesBy Bon AppétitrestaurantsIn a Land of Tortilla Factories, Enrique Olvera’s New Tortilleria Is Doing It Old SchoolBy Hilary CadiganOne-Skillet Corn ChilaquilesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-03", "author": ["Condé Nast", "Elyse Inamine"]}