{"id": "b7185b1f1bd39b09725163709ad3f803", "url": "https://www.bonappetit.com/story/embrace-the-granny-cart", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "It's Time to Embrace the Granny Cart | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIt’s Time to Embrace the Granny CartOh, the things you can carry in a rolling, folding cart.By Meryl RothsteinOctober 22, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIt's Get Organized week! Over the next few days, we'll be highlighting the products and methods we use in, out, and around the kitchen to get our lives together.In the surest sign yet that I’m becoming an old person, the purchase I’m most excited about right now is profoundly uncool. But some things are more important than being cool, and being able to carry home a 12-pack of LaCroix from the supermarket without hurting my back is one of them. And that’s why I bought a granny cart.I live in New York City, which means I do all my shopping on foot. I am the mule weighted down with every purchase. Before the granny cart, when I’d head to the market each week, I'd keep mental tabs on the weight of groceries as I walked the aisles. It didn’t matter how good the cantaloupes smelled; were they really worth the crick in my neck that would surely form if I bought more than one? It didn’t matter that I could easily go through three big tubs of Greek yogurt in a week (don’t judge)—that was a purchase for someone stronger than me. Canned tomatoes became a luxury. A big dinner party might require two trips.There was the time, on a beautiful summer day, when I decided to walk to a farmers’ market 30 minutes from my house. Just a few minutes into my return trip, my bags became too much to bear. You know those gym classes where they give you one pound weights that you can’t imagine being hard to lift, then 60 reps in you think your arms might fall off? Turns out juicy peak season tomatoes can have the same effect. I called my husband and asked him to meet me, like some damsel in distress.For months, the straps of my tote digging into my shoulders, that spot on my neck announcing itself, I swore I’d swallow my pride and buy a wheeled cart, but I never actually did it. Until one day, for no particular reason, I did. I chose one on the smaller side—I figured an extra-large one would be unnecessarily clunky and I wasn’t planning to lug giant bags of laundry in it. It fits enough groceries for a heavy-duty weekly shop for my household of two (plus a baby who doesn’t yet eat groceries). On occasion, like when I have loads of visitors for the holidays, I supplement with a couple of totes for lighter items.Now when I go to the supermarket, I skip the shopping basket and just load up my own cart as I go. I lay a tote bag on the bottom to prevent little items, like knobs of ginger, from falling through. (I’ve seen some savvy fellow cart rollers lay a cardboard square there, but I don’t love the look—I have granny cart standards.) And then I walk the aisles with the confidence of Iris Apfel. I can buy every last thing I came for. If seltzer’s on sale, I’ll stock up. I can get two weeks’ worth of yogurt at a time! The only limit to how much butternut squash I can buy is how many butternut squash I can eat.My new system isn’t perfect—getting up stairs with a loaded cart isn’t easy (I admit I sometimes still pull that damsel in distress card). And I’m now acutely aware of New York City’s terrible maintenance of cut curbs, as I struggle navigating some street corners with a full cart. But I wouldn’t trade these inconveniences for the burden of shopping bags any day.For urban dwellers without superhuman strength or farmers’ market regulars who want more than their totes can carry, I’m telling you: It’s time to embrace the granny cart. If fanny packs can become cool, why not this?Buy it: Helping Hand Folding Cart, $40 on AmazonGet the biggest butternut at the farmers' market, then make a squash steak:Butternut Squash Steaks with Brown Butter-Sage SauceApplying the classic steakhouse butter-basting technique to slabs of butternut squash turns it into a hearty vegetarian main.View RecipeAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitShoppingBA RecommendsGet OrganizedRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-22", "author": ["Condé Nast", "Meryl Rothstein"]}