{"id": "b71a42d1e357edd053896c003b3fe142", "url": "https://www.bonappetit.com/story/shortbread-christmas-cookies", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "These Shortbread Christmas Cookies Will Redeem All the Not-That-Careful Bakers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHey Imprecise Bakers, These Fancy-Looking Shortbread Cookies Are for YouKnow how to cream butter and sugar but avoid more complicated cookie recipes? This is your new (totally achievable! Totally impressive!) holiday baking mini-project.By Carey PolisDecember 11, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiFacebookTwitterEmailIt was very brave of Bonappetit.com senior editor Sasha Levine to assign me this article. Sure, I’ve made decent cookies and brownies many times before. But any dessert item that involves making two doughs, measuring the size of the dough based on 6x2” rectangles, and creating layers of said dough is a world beyond my pastry comprehension.Sasha, for unknown reasons, had blind faith that I could handle it. And ya know what, friends? I did okay! Better than okay even! A sugar-happy four-year-old and several colleagues confirmed that my cookies tasted great—like shortbread meets a not-too-sweet chocolate Oreo, minus the cream filling. Plus, they looked mostly like the professionally styled photo, minus some uneven blue sprinkles and a chocolate layer that didn’t make it all the way to the edges. I found myself eating “several” at a time.If I, a person who has stains on her shirt more often than not, can make these cookies, then I feel very confident that you can too. So bust out that pastry ruler and keep these things in mind:1. Don’t be intimidated by the swirl.It’s right there in the recipe headnote: “Here’s a fancy-looking swirl that novices can succeed at too.” This is a forgiving swirl. Let’s say, hypothetically, that you make your two doughs and discover that somehow you have a bit more vanilla dough than chocolate dough...and the vanilla dough is a little more pliable. Soldier on, comrade! As long as you can still stack the doughs per the recipe instructions (see more below), it’s all going to be fine. If you’re a perfectionist, I’m sure your cookies will look amazing. If you’re the kind of person who consistently discovers food in your hair many hours since you last ate (hi! Let’s be friends!), these cookies can still be part of your repertoire.2. You can make the dough three days ahead of time.Cookie projects are fun, but then life gets in the way—grocery shopping took longer than you thought, you have been meaning to go to the gym, that cheesy Netflix Christmas movie is beckoning you… It’s all good. Make the dough, put it in the fridge, and bake the cookies another day. These are cookies for sort of lazy—but not entirely lazy—people.3. These cookies can help you get out some rage.The step I was dreading the most was when you have to stack the vanilla and chocolate layers on top of each other to join them into one black-and-white log. My doughs were, um, not exactly the same texture (as previously confessed) and I was worried about that final swirl. In the end, though, this ended up being my favorite part. The instructions say to “pat into rectangles” but I interpreted “pat” as “aggressively mold the layers while working through some “feelings.” It was cathartic. May the layering offer you the same respite it did for me.Get the recipe:Zebra-Striped Shortbread CookiesHere's a fancy-looking chocolate-vanilla swirl that novices can succeed at too.View RecipeYou know what would make a pretty great holiday gift? Our magazine! And a cool tote bag, plus some great baking tools for holiday cookies. More details here.Explore Bon Appétitholiday2018Holiday CookiesCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Carey Polis"]}