{"id": "b7229b5f291f9ec4f56052dd54dab5c0", "url": "https://www.bonappetit.com/story/pulled-tea", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Pulled Tea Is the Party-Trick Drink You Can Totally Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestylePulled Tea Is the Party-Trick Drink You Can Totally Make at HomeThis drink is wonderfully frothy and comforting—and it puts on a show.By Natalie PattilloDecember 12, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailI remembered watching, almost hypnotized, as my mom hovered over our steel kitchen sink,  pouring steaming liquid from one cup into another, lifting it as high as possible. She was mixing bitter black tea with velvety condensed milk, popularly known in Malaysia and Singapore as “teh tarik”, or “pulled tea” in Malay. Without the comforting elixir, our roti prata and curry breakfast was incomplete, she cautioned. My brother and I gulped down our servings enthusiastically, getting a satisfying sugar high from the sweetened milk and a jolt from the caffeinated black tea—a perfect antidote for kids who dragged their feet while getting ready for school.These days, with Malaysian and Singaporean cuisine gaining popularity and recognition in the United States (and no longer being reduced or misunderstood by Westerners simply as “Asian food”), teh tarik is making its way into the bellies of nostalgia-thirsty immigrants and eager foodies. Moonlynn Tsai and Kyo Pang, the owners of Kopitiam, an all-day Malaysian cafe nestled in New York City’s bustling Chinatown, tell me that teh tarik is one of the most popular items on their drink menu.At Kopitium, pulled tea is made-to-order and poured between two mugs at least four times .\nPhoto by Chelsea Kyle“For many, [teh tarik] reminds them of their childhood and the generation above them,” says Moonlynn Tsai. “We’ve had many adult guests, around my grandparents’ age, who’ve come in and shared stories about how their grandparents would make it for them in the mornings and right before bed.”Even though teh tarik is a simple drink with only two or three ingredients (depending on the family recipe), the art of manually pulling the tea and milk into one luscious and frothy concoction comes with no shortcuts or machines. At Kopitiam, there are no pre-mixed batches of teh tarik; each drink is made-to-order.“We’re in a day and age where the goal of everything is to see what can make the drink faster and faster,” Tsai says. “Having to brew and wait while only using metal pitchers and tea sock strainers to create this delicious drink—there’s beauty in that.”Kyo Pang, the culinary mastermind behind Kopitiam, grew up in Penang, Malaysia and comes from a lineage of kopitiam owners. She teaches her staff to use the teh tarik recipe and technique she inherited from her family. Pang and Tsai explain that there’s a strong symbiotic relationship between the black tea and the condensed and evaporated milks. They use BOH Daun Teh,  which is comprised of the tea dust, not leaves; it’s steeped for about three minutes (the tea dust is strained using a tea sock). At home, you can pour the steeped tea into a stainless steel jug, large mug, or even small saucepan. Whatever vessel you choose, make sure it has a curved lip, which will ease pouring, limit spilling, and keep you from digging out the first aid kit to treat burns. Then add about two tablespoons of sweetened condensed milk and half a tablespoon of evaporated milk to your vessel of choice.The final drink is deliciously frothy.\nPhoto by Chelsea Kyle“Pulling” the tea involves pouring it back and forth briskly from one jug or mug into another at least four times so that air can mix with the liquid and create teh tarik’s trademark foamy head. More of a visual learner? Here’s a great demo of “pulling” with a saucepan and mug.  Maybe one day you’ll get to Mr. Teh Tarik's expert level. But, again, to avoid scalding yourself, ease into the pulling technique. Once you get a hang of it, you can gradually lift the mugs or pitchers higher. The more pulls you do, the fuller the flavor and the more the tea cools. (If you pull too many times, you might end up with a cooler than lukewarm tea. A maximum of five pulls seems to be the magic number.)So instead of reaching for that Keurig button to get your fix of caffeine, why not steep black tea— English Breakfast, Lipton, or Ceylon works great if tea dust is hard to find—and open up those dusty cans of condensed and evaporated milk in your pantry? Pulling tea is an excellent way to impress your holiday guests...or you could take it easy and order a round of warm teh tarik at a Malaysian joint near you.Explore Bon AppétitHealthyishTeaTrendsRead MoreLifestyleThe New All-Day Cafe That Feels Like It’s Been There ForeverBy Jasmine LeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Natalie Pattillo"]}