{"id": "b7262c2063ca787ba028d66fbe330c07", "url": "https://www.bonappetit.com/recipe/breakfast-rice-bowls-with-smoked-fish", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Rice Bowls with Smoked Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueBreakfast Rice Bowls with Smoked FishBy Chris MoroccoJanuary 9, 20184.0(4)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintWhether it’s part of a Japanese breakfast or a classic bagel spread, smoked fish is never a bad idea.Ingredients4 servingsScallion Jam1bunch scallions, chopped1½-inch piece ginger, peeled, finely grated2tablespoons extra-virgin olive oil1tablespoon unseasoned rice vinegar1teaspoon soy sauce1teaspoon toasted sesame seedsPinch of crushed red pepper flakesKosher saltSweet-and-Sour Pickles¼cup unseasoned rice vinegar3tablespoons sugar1teaspoon kosher salt, plus more2Persian cucumbers, thinly sliced14-inch piece daikon, peeled, thinly sliced4radishes, trimmed, thinly slicedYogurt Sauce and Assembly14-inch piece daikon, peeled, coarsely grated1cup plain Greek yogurt1tablespoon fresh lemon juiceKosher saltHot-smoked salmon or whitefish, cooked rice, salmon or trout roe, furikake or toasted sesame seeds, and/or pickled ginger (for serving)PreparationScallion JamStep 1Mix scallions, ginger, oil, vinegar, soy sauce, sesame seeds, and red pepper flakes in a small bowl to combine; season with salt.Sweet-and-Sour PicklesStep 2Stir vinegar, sugar, 1 tsp. salt, and 2 Tbsp. water in a medium bowl; set aside.Step 3Combine cucumbers, daikon, and radishes in another medium bowl. Season with salt and massage, squeezing out liquid, until softened; drain.Step 4Add vegetables to reserved brine and chill at least 10 minutes before eating.Step 5Do Ahead: Vegetables can be pickled 2 days ahead. Cover and keep chilled.Yogurt Sauce and AssemblyStep 6Using your hands, gather up and squeeze as much liquid as possible from daikon. Transfer to a small bowl and add yogurt and lemon juice. Mix well; season yogurt sauce with salt.Step 7To serve, assemble smoked salmon, rice, roe, furikake, pickled ginger, scallion jam, pickles, and yogurt sauce in bowls as desired. Use all the components, or skip the ones you don’t want!How would you rate Breakfast Rice Bowls with Smoked Fish?Leave a ReviewTell us what you thinkExplore Bon AppétitRice and Grain BowlJapaneseEast AsianAsianScallionOnionVegetableCucumberDaikonRadishSalmonFishSeafoodRiceRice & GrainsQuickEasyHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}