{"id": "b7288556773c742138a861055b76c0d4", "url": "https://www.bonappetit.com/story/cyber-monday-amazon-kitchen-deals-2021", "year": 2021.0, "month": 11.0, "day": 5.0, "content": "The Best Amazon Cyber Monday Kitchen Deals (2021) to Shop Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe Best Amazon Cyber Monday Kitchen Deals (2021) to Shop NowDutch ovens, blenders, robot vacuums, and our favorite air fryer—all on saleBy Tiffany HopkinsNovember 29, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Let’s skip the preamble—the best Amazon Cyber Monday kitchen deals 2021 are live right here, right now, ready for your hot little fingers to press “add to cart.” You’ll find sales on top of sales across the internet today, but there’s arguably no better place than Amazon to buy BA's favorite toaster oven, the most comfortable kitchen slippers, and the best hand mixer around all at the same time. (Don't worry, we've rounded up all the best kitchen deals from the likes of Sur La Table, Target, and Nordstrom right over here so you can check those out, too.) Yes I know, participating in this festival of tumultuous consumerism can be a lot. But that top-notch espresso machine isn’t going to buy itself, and you might as well save some money while you’re at it. Whether you’re on a holiday gift shopping mission (check out our 2021 gift guide if you need inspo) or you just want to treat yourself to some new cooking gear, the list below is a great place to start.Vitamix 5200 BlenderNow is the time to move that Vitamix from your virtual cart to your kitchen. From crushing ice to puréeing veggies to making nut milk, there's (almost) nothing the Vitamix 5200 can’t handle. Not sure if you need one? Take our quiz—it’s like Seventeen magazine but with blenders instead of boys.Vitamix 5200 Blender$480 at AmazonVitamix E310 Explorian BlenderThe Vitamix Explorian is similar to the 5200, but smaller and cheaper. It still packs 1400 watts of power and it comes with a 48-ounce container that's perfect for blending small to medium batches.Vitamix E310 Explorian Blender, 48 oz. Container$350 at Amazon$450 $350 at Sur La TableReusable Stasher BagsKicking your single-use plastic habit is easy when you have reusable dishwasher-, microwave-, freezer-, and oven-safe silicone bags that come in pretty colors like pastel blue and bubblegum pink.Photo by Emma FishmanStasher Bags$55 at Amazon (set of 4 small)$22 $15 at Amazon (half-gallon)Cosori Air Fryer Max XLAn air fryer is something you don’t need but absolutely want. How else are you going to master these super-crispy sesame chicken tenders and spiced potato wedges? The Cosori Max is one of the best air fryers in our book (associate food editor Rachel Gurjar used it to develop her air fryer recipes). It has a 6-qt. capacity and 11 cooking presets.Cosori Air Fryer Max XL$120 at AmazonLe Creuset Dutch Ovens and MoreThis Cyber Monday, bundle three Le Creuset items—including cast iron skillets, casserole dishes, and yes, Dutch ovens—and receive 20% off your entire purchase. See all eligible products here.Le Creuset 5.5 Quart Dutch Oven$340 $314 at AmazonGE Profile Opal Nugget Ice MakerEver wondered why your ice at home isn’t as good as the ice at Coffee Bean & Tea Leaf and Chick-fil-A? It’s because you don’t have the GE Profile Opal Nugget Ice Maker, which churns out a pound of perfectly chewable ice every hour (and doesn’t need to connect a faucet). Save $120 today and live that good ice life.GE Profile Opal Nugget Ice Maker$529 $499 at AmazonHarvest Bounty Loaf PanFact: You don’t need serious decorating skills to make a stunning cake. All you need is this festive Harvest Bounty loaf pan adorned with plump pumpkins and acorns.Harvest Bounty Loaf Pan$38 $25 at Amazon$36 at TargetFellow Electric Gooseneck KettleWant to up your pour-over coffee game? This is your chance. It also has unbeatable heating precision and will maintain your desired temperature for an hour.Fellow Electric Gooseneck Kettle$159 at AmazoniRobot Roomba i3Get a head start on cleanup with your new favorite cooking buddy. The Roomba i3—equipped with dirt-detecting sensors and multiple sweepers—cleans the floor while you make dinner.iRobot Roomba i3 Automatic Vacuum$400 $300 at AmazonCafé Specialty Drip Coffee Maker, 10-CupA chic coffee maker with smart technology that allows you to control the strength, size, and temperature of your brew from your phone. Bonus: The insulated carafe keeps your drink hot longer.Café Specialty Drip Coffee Maker$349 $279 at AmazonZeppoli Classic Kitchen Towels (15-Pack)Meet the best kitchen towels you’ll ever use. They’re super-absorbent, lint free, and—best of all—cost one dollar each. Take BA contributor Amiel Stanek’s advice and stock up on them ASAP.Zeppoli Classic Kitchen Towels (15-Pack)$22 at AmazonAeroGarden HarvestIt’s no wonder why the AeroGarden Harvest is the brand’s most popular countertop garden. It’s easy to use, has automatic LED lights, and lets you know when to feed your herbs.AeroGarden Harvest Indoor Garden$150 $90 at AmazonBreville Joule Sous VideWith this super-sleek (and dead simple) sous vide machine, you’ll never overcook chicken breasts, salmon fillets, and rib eyes again. Just lower it into a pot of water and set the controls via the Joule mobile app, which also provides cooking temps and cues for doneness.Breville Joule Sous Vide$236 at AmazonFoodSaver Vacuum SealerSpeaking of sous vide cooking, you’ll need a mechanism for locking in that steak as it cooks. We love this FoodSaver vacuum sealer, which also works wonders for meal prep (your vacuum-sealed food will keep in the fridge for about a month after it’s cooked).FoodSaver Vacuum Sealer$140 $122 at AmazonInstant Pot Duo Crisp, 6 QuartFinally decided to get an IP but don’t know where to start? Go with the 6-qt. Duo Crisp, one of the best Amazon Cyber Monday deals this year. It’s the perfect capacity for most recipes (and it’s the only Instant Pot that can also air fry).Instant Pot Duo Crisp, 6 Quart$149 at AmazonPresto FlipSide Belgian Waffle MakerGrab our favorite waffle maker on sale for Cyber Monday. The Presto Flipside sports a nonstick ceramic surface and a no-fuss rotating design to pop out extra-thick waffles in minutes.Photo by Emma FishmanPresto FlipSide Belgian Waffle Maker$55 at Amazon$73 at WalmartRiedel Wine Glasses, Set of 4This set of wine glasses features Riedel’s most functional and versatile bowl, good not just for wine but also spritzes and G&Ts.Riedel Red Wine Glasses$69 $49 at Amazon (4-Pack)Wine Saver Pump and Wine StoppersHow long does wine last after it's opened? It depends, but you can extend its lifespan with a vacuum pump and wine stoppers. Stainless Steel Wine Saver Pump and Wine Stoppers$20 $17 at AmazonHestan Stainless-Steel Titanium Sauté PanTest kitchen director Chris Morocco uses this pan more than any tool in his kitchen—and for good reason. It conducts heat flawlessly; it’s insanely durable; and it’s easy to clean.Photo by Emma FishmanStainless Steel Titanium Sauté Pan, 3.5 Quart$330 $264 at AmazonDyson V7 Animal Cordless Stick VacuumWith powerful suction and motorized brushes, this lightweight device transforms from a sleek and sturdy stick vacuum to handheld vac in seconds, allowing you to get under the kitchen counters or zap up crumbs behind the toaster. Switch between different power modes and tool heads for optimal cleaning, then store it on its docking station when you’re done.Dyson V7 Animal Cordless Stick Vacuum$391 at AmazonPurifYou Reusable Produce Bags (Set of 9)Every time BA senior cooking editor Sarah Jampel whips out these reusable produce bags at the farmer's market, she’s flooded with compliments. The swishy lightweight mesh is eco-friendly, yes, but also aesthetically pleasing.Photo by Chelsie CraigPurifYou Reusable Produce Bags (Set of 9)$15 $10 at AmazonHydro Flask Water BottleOur favorite insulated water bottle for long hikes is on sale now for up to 25% off. Find the Hydro Flask in a variety of sizes from 18 oz. to 40 oz. Photo by Chelsie CraigHydro Flask 32 oz. Water Bottle$45 $34 at AmazonZojirushi Rice CookerWe’ve said it before and we’ll say it again: If you’re serious about rice, you need this rice cooker. Equipped with a micro computer that practically erases human error, it’s the best route to perfect rice every single time.Zojirushi Micom 5.5-Cup Rice Cooker$189 at AmazonEscali Arti Glass Kitchen ScaleYou need a kitchen scale—even if you never bake anything. This one has a large weight capacity of 15 pounds and a sleek, easy-to-clean glass surface.Escali Arti Glass Kitchen Scale$47 $30 at AmazonBlack & Decker Dustbuster Handheld VacuumMeet our test kitchen’s most prized appliance: A humble cordless dustbuster that picks up dust, yes, but also spilled spices, onion skins, and carrot shavings.BLACK+DECKER Dustbuster Handheld Vacuum$80 $70 at AmazonChef’n FreshForce Citrus JuicerLooking for a good handheld citrus juicer? The Chef’n FreshForce is the best there is. With a heavy-duty design, it quickly squeezes out extra juice without getting your hands messy.Chef'n FreshForce Citrus Juicer$25 $14 at Amazon$25 $15 at Bed Bath & BeyondSodaStream Terra Sparkling Water MakerTurn flat water into a fun, bubbly bev in a flash. Keeping this easy-to-use fully automatic machine on your counter means your days of buying La Croix in bulk are over.SodaStream Terra Sparkling Water Maker$100 $60 at AmazonKyocera KnivesNo knife will remain sharp forever, but ceramic knives stay sharper longer—and they’ll never rust! Associate food editor Zaynab Issa loves this trio for chopping piles of veggies.Kyocera 3-Piece Ceramic Knife Set$85 at AmazonNutriBullet Personal BlenderThe compact yet powerful NutriBullet Pro+ works just as well for making silky smoothies as it does for chunky dips. This set includes a sturdy motor base, 32-oz. cup, 24-oz. cup, and more.NutriBullet Blender$120 $100 at AmazonLaguiole Steak KnivesThey're classic, they're colorful, they're incredibly French. Grab a set of six for 20% off.Jean Dubost Laguiole Steak Knives$90 at AmazonWaterproof Flickering Flameless CandlesYour holiday table needs these affordable, vibe-enhancing set of flickering candles that don’t drip and never need to be replaced. You can even adjust the brightness and flicker level from a simple remote control.Waterproof Flickering Flameless Candles$30 $23 at AmazonKitchenAid Cordless Hand MixerA sleek and modern cordless hand mixer that can power through four batches of cookies without needing a recharge? Yes, please.KitchenAid Cordless Hand Mixer, 7 Speed$100 $70 at AmazonSecura Wine OpenerSome enjoy the technique and lure of opening a wine bottle with a double-hinged corkscrew—I do not. This insanely easy-to-use, rechargeable wine opener is my saving grace.Secura Electric Wine Opener, 7-Piece Set$35 $30 at AmazonW&P Porter Portable Cocktail GlassCarry your wine in style with this cute and portable tumbler, equipped with a protective silicone sleeve and a slide-lock lid.W&P Porter Portable Cocktail Glass$25 $24 at AmazonExplore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Tiffany Hopkins"]}