{"id": "b72ad64fbd98b7bf79d30216d7b087d1", "url": "https://www.bonappetit.com/recipe/crispy-eggs-over-grains", "year": 2018.0, "month": 12.0, "day": 4.0, "content": "Grain Bowls with Eggs  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCrispy Eggs Over GrainsBy Chris MoroccoDecember 26, 20184.1(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Sue Li, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintFrying shallots and garlic with mustards seeds in ghee won’t necessarily change your life, but if you start putting the toasty mixture on everything from steamed or roasted vegetables to crispy fish, it just might. This recipe is part of the 2019 Feel Good Food Plan, our ten-day plan for starting the year off right.Ingredients2 servings¾cup whole grains, such as freekeh, farro, rye berries, and/or barleyKosher salt3Tbsp. ghee or extra-virgin olive oil, divided1shallot, sliced into rings2garlic cloves, crushed1½\" piece ginger, peeled, finely grated1tsp. mustard seeds½tsp. ground turmeric2Persian cucumbers, thinly sliced1Tbsp. fresh lime juice2large eggsCilantro leaves and lime wedges (for serving)PreparationStep 1Cook grains in a small pot of boiling salted water until al dente. Drain and let cool in a medium bowl.Step 2Meanwhile, melt 2 Tbsp. ghee in a small nonstick skillet over medium heat. Add shallot and garlic and cook, stirring occasionally, until shallot is beginning to brown and crisp around edges, 5–6 minutes. Remove from heat and stir in ginger, mustard seeds, and turmeric. Let cool slightly. Season with salt. Add cucumbers and half of shallot mixture to grains and toss to combine. Add lime juice; season with salt. Transfer grain mixture to a medium bowl. Wipe out skillet.Step 3Heat remaining 1 Tbsp. ghee in skillet over medium-high. Add eggs and cook, undisturbed, until very deeply browned underneath, 2–3 minutes; season with salt. Carefully turn (if desired) and cook until all of the whites are opaque, about 5 seconds.Step 4Divide grains between bowls. Top with eggs, remaining shallot mixture, and cilantro. Serve with lime wedges for squeezing over.How would you rate  Crispy Eggs Over Grains?Leave a ReviewTell us what you thinkReviews (11)Back to TopTriangleThe family thought this dish was pretty good though I thought it lacked the flavor I was expecting. Probably should have added more salt and done more of the shallots, maybe add some jalapeno too as someone else suggested. I subbed a mix of quinoa and green, brown & black lentils for the grains in the recipe as my wife if gluten free which worked fine. Might try again with some of the other recommended subs/adds.fitzrobAustin, TX8/7/2020As someone else in the comments suggested, I riffed on this a little (had no lime juice, subbed rice vinegar; had no shallots, subbed a bit of yellow onion; subbed mustard for mustard seed; added an island spice mix in addition to turmeric; didn't have or want cucumber so swapped in roasted sweet potato). It was delicious and a very satisfying breakfast. The crispy egg was the right texture to go with this. emonydaxmadison, wi1/1/2020Good vegetarian weeknight meal! Made exactly as described and loved it. I think it can easily be riffed on too- sweet potatoes, roasted broccoli or cauliflower, zuchinni, etc could easily be swapped for the cucumber. The only thing we'd change is adding two eggs per person instead of one. yum!AnonymousChicago10/29/2019I had some aging watercress and arugula in the fridge, so used greens instead of the cucumbers and mixed with the grains while they were still warm to wilt them a bit.  I also added some jalapenos to the shallot mixture for a little heat.  Other than that, I followed the recipe and it was DELICIOUS!  Even my husband who is not a vegetarian said it's a keeper.  Easy weeknight meal, and could easily be modified with whatever veggies you have on hand.  I will definitely make this again!  AnonymousMadison, VA3/12/2019Wasn't keen on cucumbers with my eggs for some reason so swapped them for some roasted sweet potato wedges. Perfectly satisfying, and easy for a weeknight.nah270Philadelphia1/15/2019This dish was pretty good. It seemed maybe a bit too basic on first glance, and even when we sat down to eat I was less than impressed. I ended up clearing my plate though. We both agreed that the flavors started to shine when the dish had cooled off a bit... not sure what to make of that. My shallots didn't really crisp up, which I think was operator error. I'll try using a bit less fat and maybe turning the heat a bit higher if I try again?austin738257923840921/13/2019I really like this dish. It's easy, fresh, and the flavors are beautiful. I love the crispy eggs, and I think the cucumbers go well with the lime and cilantro and make it nice and fresh. I also really like that it can be eaten cold or warm, which makes it great to eat for lunch the next day. AnonymousAL1/5/2019This swish was so easy and delicious! I will definitely cook more shallots and garlic next time because the flavor was amazing with the two spices. Definitely would make again! AnonymousChicago1/3/2019Not a huge fan of the cucumbers in this dish. If I were to make it again, I would sub out some sauteed zucchini or, if I wanted something fresh, halved cherry tomatoes. Otherwise, the flavors are beautiful.AnonymousQueens12/29/2018straight forward instructions, complex flavors - ALL I COULD EVER ASK FOR.HvrrysheehanBrooklyn12/29/2018Crispy eggs----ugh!!!!AnonymousPennsylvania12/28/2018Explore Bon AppétitFreekehRice & GrainsFarroBarleyEggQuickWeeknight MealsMainDairy-FreeVegetarianHealthyishSimmerFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-26", "author": ["Condé Nast", "Chris Morocco"]}