{"id": "b72f970b90345036be5e0259e28fef43", "url": "https://www.bonappetit.com/recipe/family-style-fish-tacos", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "Family-Style Fish Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFamily-Style Fish TacosBy Molly BazJuly 28, 20194.8(42)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolEmailPinterestPrintEmailPinterestPrintNo grill, no deep-fryer, no problemo. Our summery tacos rely on our go-to fish-cooking method—slow-roast, baby!—for tender, flaky fish every time. Because white fish (think cod or tilapia) is so mild, we took a cue from Contramar’s Red and Green Grilled Snapper and covered it in a garlicky cilantro-chile sauce before cooking. You’re not going to get the same char or crunch as you would in grilled or fried fish tacos, but a cabbage slaw (and the fact that you don’t have to deal with grilling or frying) more than makes up for it. Use any mild white fish you like, remembering that cook time varies based on the thickness of the piece. So keep an eye on the fish as it cooks and cook to the visual indicator, not the timer.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit Market13x9\" Baking Dish$20 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEABlender$32 At AmazonMedium Bowl$17 At AmazonSpoon$24.69 At AmazonForkPlatter$29 At AmazonIngredients4 servings11½-lb. piece white fish3tsp. kosher salt, divided, plus more2jalapeños⅓cup vegetable oil2garlic cloves1large bunch of cilantro, divided1pint cherry tomatoes¼white onion4limes, divided¼head of green cabbage1avocado24corn tortillas or 12 flour tortillasHot sauce (for serving)PreparationStep 1Place a rack in center of oven; preheat to 300°. Place 1 1½-lb. piece white fish in a 13x9\" baking dish. Season all over with 1½ tsp. salt.Step 2Trim and discard stems of 2 jalapeños, cut in half lengthwise, then coarsely chop. Coarsely chop three-quarters of 1 bunch of cilantro leaves with tender stems.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 3Transfer jalapeños and chopped cilantro to a blender or food processor. Add ⅓ cup vegetable oil and 2 garlic cloves. Blend on high speed until a coarse purée forms. Scoop out and transfer 2 Tbsp. sauce to a medium bowl (you’ll be building your pico de gallo in this.) Pour remaining sauce evenly over fish, spreading with the back of a spoon.Step 4Bake fish until it flakes away with light pressure from the tines of a fork in the thickest part, 18–25 minutes, depending on the thickness of fillet and what type of fish you’re using. Start checking on the early end of things so it doesn’t overcook!Step 5While fish bakes, work on the rest of your toppings. Quarter 1 pint cherry tomatoes and transfer to bowl with reserved cilantro sauce. Peel ¼ white onion, then finely chop. Add to sauce and toss to combine.\nCut 1 lime in half and squeeze juice of both halves into bowl. Season with 1 tsp. salt and toss to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 6Shave off core of ¼ head of cabbage. Thinly slice crosswise into shreds and transfer to a medium bowl. Cut another lime in half and squeeze juice into bowl; season with salt. Toss with your hands to combine.Step 7Cut remaining 2 limes into wedges for serving.Step 8Run knife around pit of 1 avocado lengthwise to split in half. Open avocado. Using bottom half of knife, remove pit by securing the blade in the pit, then turning it sideways to release. Using a large spoon, scoop out flesh, then cut into thin lengthwise wedges. Transfer to a large platter or board. Season avocado with salt.Step 9Arrange cabbage, pico de gallo, and remaining cilantro and lime wedges on platter as well.Step 10Warm 24 corn tortillas or 12 flour tortillas one at a time over a burner set to medium heat until blackened around the edges in some spots, about 30 seconds per side. Keep tortillas wrapped in a stack in a clean kitchen towel to keep warm until serving.Step 11Using a large spoon, gently flake apart fish into large irregular pieces and transfer to a plate. Serve fish along with all the accoutrements and your fave hot sauce for a DIY taco party.How would you rate Family-Style Fish Tacos?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleGot home late w/defrosted cod that had to be cooked...today! Had all the ingredients. Loved the oven-cooking of the fish. Had a bunch of starting-to-wilt cilantro. Spiced up your homemade pico with some ground habanero. Used up the half-cut avocado in the fridge. (PS: I always have a cabbage, some limes, jalaenos, and bag of tortillas around.) This goes on my emergency list..Loretta NY-BOS3/13/2022ZERO flavor. Won’t be making these again. AnonymousMonterey, CA9/2/2021This was delicious!  My guests raved about the flavor of  the fish! tomaMichigan 5/10/2021I am so impressed with this recipe: simple, quick, yet so impressive! I will definitely be making this again and again.\n\nA note about spice: I wasn't expecting much spice at all after reading the reviews, so I was surprised that the puree had the perfect amount of heat (and I love spicy food). My jalapenos were on the large side, so it makes sense in hindsight. I can't imagine a scenario where someone would eat this and think it's not spicy at all, though I suppose it's hard to predict how much heat each jalapeno will have.MeaganSan Francisco, CA1/23/2021These were pretty good! I followed the recipe exactly, and the fish came out perfectly cooked (I used Atlantic cod and it was a winner!) and it was not spicy at all (despite using 2 jalapeños w/ the seeds). My only complaint was it definitely felt like something was missing. Next time I make it, I'll probably add some finely chopped fresh jalapeños or serrano peppers to the pico de gallo to kick up the heat, some sort of aioli or crema on the cabbage instead of the lime juice and some cojita on top! But overall great fish taco recipe! LauraRockville, MD11/9/2020these were great! We added extra garlic, cuz why not, and the fish came out soooo tasty! The flavours were bright and delicious, everyone at the table enjoyed this recipeAnonymousQuebec, Canada7/22/2020These were fantastic and hit the spot! We only had barramundi, tobasco sauce, almond flour tortillas, no avocado, and no cabbage but the fish tacos came out amazing!!!! AnonymousManhattan, NYC6/2/2020Trying to add more fish into our diet.  This was very good!   Brocolli slaw (instead of cabbage) and Siracha for the hot sauce.  Make again for sure!!!AnonymousAnnapolis, MD1/20/2020This was fantastic, especially with homemade corn tortillas. We made it with cod, which released a fair amount of water as it was cooking and loosened up the sauce, but otherwise, it was great!AnonymousMontreal1/20/2020Fantastic, simple, and feels so healthy. Pulled two frozen tilapia fillets out of the freezer and swapped out green cabbage for red cabbage -- I salted it a bit and massaged beforehand to break it down just a little. I grabbed some perfect juicy-ripe cherry tomatoes from the farmers market and it turned what could have been a sad tilapia dinner into something I literally want to eat all the time. Nate GLos Angeles, CA9/27/2019I've made this recipe 4 times since it was published- it's quickly become a favorite in our rotation!\nThe recipe comes together really quickly and easily. It's nice to have 2 people make this and have one person in charge of all the chopping.\n\nIn addition to the standard recipe, it's easy to \"spin it\" (Carla's term from her cookbook). You can make a corn salsa or a mango salsa depending on what looks good at the market, top it with some chile sauce, replace the cabbage with a crunchy green, replace the tortillas with butter lettuce, etc. Make it your own with what you have & what looks good/is in season! \nI also love the addition of a tablespoon of greek yogurt to the cabbage for some creaminess.\nIf your jalapenos are too spicy, make sure youre removing the seeds AND the ribs- thats where the majority of the heat is. AnonymousChicago9/23/2019I thought - no cheese?? But this really was delicious. So fresh and limey. Make it!AnonymousBrooklyn9/15/2019This was sooo quick and easy - literally a 30 min meal! I ended up using tilapia, 3 jalapeños, red onion instead of white, threw in an extra Dorot crushed garlic cube, and used a purple cabbage slaw/habanero lime tortillas from TJs (just what I had on hand). They came out delish!! Tasted like something you’d get at a restaurant. Going to be making this one often. You rock Molly Baz!AnonymousFlorida9/2/2019Really good! I am sensitive to spice and found that the 2 jalapenos overtook all flavor. Next time I make it, I will likely only use one. Rhode Island8/21/2019Totally delicious! I added lime juice and some extra garlic to the cilantro pesto for a little extra pop. I might even double the amount of the sauce next time. This recipe was also outrageously easy, and a contained 30 minute meal. Thanks for the out of the park hit, Molly.AnonymousCambridge, MA8/16/2019Explore Bon AppétitTacoMexicanLatin AmericanFishSeafoodCilantroHerbs & SpicesJalapeñoChileVegetableQuickEasyWeeknight MealsMainNut-FreeRoastDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-28", "author": ["Condé Nast", "Molly Baz"]}