{"id": "b73985bd9cf177edf68da26ae4bd7309", "url": "https://www.bonappetit.com/story/crispy-glazed-tofu", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Tofu That’s Crispy and Glazed All at the Same Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingTofu That’s Crispy and Glazed All at the Same TimeIt’s a weeknight dinner FTW.By Adam RapoportJanuary 14, 2020FacebookTwitterEmailPhoto by Alex Lau, food styling by Chris Morocco, prop styling by Emily EisenFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Every now and then you come across a cooking technique that makes you wonder what the heck you’ve been doing all these years.Case in point, Bon App’s brilliant Crispy Tofu with Maple-Soy Glaze.I mean, come on—the dish delivers crispy and glazed all in one recipe. And you even get tofu, which makes it a bit healthy, right? Or, at the least, it provides you with a somewhat indulgent option for your Meatless Monday.Want this letter before it hits the website? Sign up for our newsletter!The first step is the key step: taking a block of firm tofu, wrapping it in paper towel, and pressing as much liquid from it as possible. This will allow the tofu, after you slice it into domino-like slabs, to fry up nice and crispy. A generous amount of neutral oil, such as grapeseed, is also essential. You don’t want the tofu scorching on a bare pan.Once your tofu achieves a golden-brown doneness on each side, you drain the oil from the pan and replace it with a soy/maple/ginger mixture. The tofu absorbs the salty-sweet vibes of the soy and maple syrup, while the thinly sliced ginger takes on a caramel-y crunch.Get yourself a pot of jasmine rice and a jar of kimchi and you’ve got dinner. Not to mention a new go-to technique in your weeknight cooking arsenal.Get the recipe:Crispy Tofu With Maple-Soy GlazeWhenever you’re cooking tofu, here’s one of our no-fail techniques: Draining the tofu, then squeezing out as much water as possible (without smashing it), is the key to the crispiest cubes.View RecipeExplore Bon AppétitAdam NewsletterTofuRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-14", "author": ["Condé Nast", "Adam Rapoport"]}