{"id": "b73bedc56b8e7adcfef51d3a48eb1f86", "url": "https://www.bonappetit.com/story/straight-sided-baking-dish", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "For Superlative Corner Pieces, You Need a Straight-Sided Baking Pan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingFor Superlative Corner Pieces, You Need a Straight-Sided Baking PanHappiness is a crispy edge.By Kendra VaculinOctober 6, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.If you prefer the middle piece of lasagna or the center brownie in the pan, please know that I respect you as a person. I care about you and wish you well on this wild journey through life. But I also do not understand you at all because I am the type of girl who would throw it all away for a crispy corner.I don’t think I’m overselling it: little delights like the spot where your baking project or casserole meets the side of the pan and goes crunchy and crisp, providing textural contrast to the rest of the dish. In my opinion, a baked ziti is only as good as the browned cheese along the side, and the caramelized sugar framing a snacking cake is without a doubt the best part. Therefore, because corner pieces have not one but two crispy sides to their name, they are twice as good as any edge, and absolutely worth fighting over. I’m serious about maximizing both crispiness and corner-ness when tackling recipes like these at home, so I turn to the only cooking vessel for the job—my straight-sided baking pan.I once thought my Pyrex collection covered all the bases, so I put off purchasing a straight-sided baking pan for years. The pretty glass dishes transitioned well from oven to tabletop, and could handle any cobbler or moussaka I threw at them. But with their rounded edges and sloped sides, these baking dishes can’t achieve a true corner, instead creating gently curved slices that are thicker in the middle than they are at the edge. You not only get less of whatever you’re scooping out of the dish by choosing a corner piece, you’re liable to lose some of that magical crispiness as well, as it’s inclined to stay stuck in the shallowest bit. For truly squared-off slices with no shortage of edge surface area, a more geometrically-minded pan is required. (And, yes, I know about the all-edges snake pan. No, I cannot bring myself to buy it. Imagine washing that thing! My love of crispy corners has a limit, and that limit is this very silly piece of cookware.)Enter the straight-sided baking pan. As the name suggests, it’s a 9”x13” piece of aluminized steel cookware with precise, 90-degree corners; it looks like a piece of industrial equipment and cooks with that same level of exactness. With it I can cut a sheet cake into picture-perfect squares and build right-angled sandwiches on slices from a lofty slab of focaccia. The metal construction aids in even baking and is made to handle years of use. Since adding one to my cart in a fit of baking blues last winter, I’ve pulled mine out constantly, most recently to make the Flip Side, a twist on the classic Hawaiian pizza that draws crowds at Philly’s Down North. The quick-proofing dough fills the pan from corner to corner and bakes up into an ideal chewy base for barbecue sauce, caramelized pineapple, beef bacon, and pickled jalapeños. The frico-like cheesy edges were absolutely the first to go, but it was so good I didn’t even mind eating a slice out of the center.Just buy one already:9 x 13 inch Non-Stick Baking Pan$22 at AmazonAnd make yourself a pizza pie:Hawaiian Pizza With Barbecue Sauce and Beef BaconFor anyone who has ever thought they hate Hawaiian pizza: This pie is for you.View RecipeExplore Bon AppétitcookingShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-06", "author": ["Condé Nast", "Kendra Vaculin"]}