{"id": "b742461e3129d99f5a26a3e52bc2c142", "url": "https://www.bonappetit.com/story/how-to-find-the-best-chefs-knife-for-you", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "The Best Chef’s Knife, According to BA Editors  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopBest OfHow To Find the Best Chef’s Knife for YOUBefore you find your dream knife, you have to know the two major styles.By Sarah JampelMarch 25, 2022FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Let’s get this out of the way: The best chef’s knife doesn’t exist. Well, the best chef’s knife for YOU exists—but the best chef’s knife for everyone is impossible to name. Whether you’re a home cook or a professional chef, choosing the best cutlery really comes down to your needs and personal preferences. In fact, when I pressed a few knife experts to recommend one knife for the title of Best Chef's Knife In All the Land, no one would do it. “What works for you is not necessarily going to work for someone else,\" said Mari Sugai of Korin in New York City. “You don't have to go with whatever the internet says [editor's note: I gasped]—chances are, you'll find something you like that will work for you.”The knife that is the best for you isn't the knife that's necessarily the best for your brother or cousin or next door neighbor. Before you shop, give a bit of thought to what kind of cook you are (rather than the kind of cook you want to be). “The most important thing I can tell people is to be introspective about how you cut,” explained Jon Broida of Japanese Knife Imports in L.A. Ask yourself, are you an aggressive cook who loves to speed through tasks (as in, there's always a bit of garlic peel in the pile of not-so-finely chopped garlic on your cutting board), or are you meticulous and careful, plucking each and every tiny thyme leaf from even the littlest stalks? Even if the difference isn’t that dramatic, think: Do you value speed or precision?Once you've taken a beat to self-reflect, consider the two major categories of knives available in the U.S.—Western and Japanese-style—and figure out which one best matches your personal style.Team Speed\nWhat are the characteristics of a Western-style knife?Sometimes simply called German knives, these double-bevel knives (meaning both sides are angled inward, meeting at the blade’s edge) originated in Western Europe. The blades are thicker than those of Japanese knives, with more of a curved shape to facilitate a rocking motion. Most have the same angle on both sides, which makes them easier to sharpen (and that’s advantageous, since you’ll need to sharpen them often).Are they right for you? These are what Broida refers to as “get shit done” knives. They’re made of a softer steel than Japanese knives, which makes them less brittle and more durable—so you’ll be able to accomplish nearly any kitchen task, from halving a kabocha to scoring pork belly to cracking open a watermelon.The caveats: They’re heavier and less sharp than Japanese knives, and, because the steel is softer, they need to be sharpened more often.What about Japanese knives?There are traditional Japanese knives, which are mostly single bevel (one side is straight while the other is angled), made of carbon steel, and used by professional restaurant chefs—and then there are the knives I’ll be discussing here: Western-style Japanese knives. These are double bevel, made of material that’s simpler to maintain, and versatile. Many have an asymmetrical edge (the edge is at a steeper angle on one side of the blade, i.e. 60:40 or 70:30), which contributes to sharpness. Two common shapes in the U.S. are the gyuto (chef’s knife) and the shorter santoku knife.Are they right for you? If you value sharpness and precision and often spend hours chopping and slicing, you might gravitate towards a light Japanese-made knife. Compared to Western knives, the blades are thin, super sharp, and hard, meaning they hold their edge for longer (so you won’t have to sharpen them as often). They excel at precision slicing.The caveats: Their hardness also makes them brittle, meaning they’re more prone to chipping or snapping if used improperly. And because their edges can be asymmetrical, these knives can also take a bit more finesse to sharpen well.The choice between Japanese and Western knives isn’t always so cut and dry, if you will, but that’s a good thing: Many of the great knives blur the line between the categories—sharp like Japanese, durable like Western. As Joanna Rosenberg of Zwilling told me, the advent of higher-quality steel, better finish, and innovative heat treatments means that knife makers are able to produce sharper knives that are more durable and stay sharp longer. “The good German knives are coming out sharper and the good Japanese knives are coming out with more durability, but they haven't met in the middle yet.”The easiest way to decide what you prefer is to take a trip to a store where they'll let you hold several different knives to see which feels best in your hand. If that's not possible, order from a site with a generous return policy and a big selection. The best chef's knife might not exist, but the best chef's knife for you is somewhere out there—you've just got to find it. To help point you in the right direction, I polled Bon Appétit’s editors on their favorite chef’s knives to use at home and in the BA Test Kitchen. See our top picks below.MAC Hollow Edge Chef Knife“Pound for pound, Mac knives (such as the 8\" scalloped chef's knife) are the best out there,” says food director Chris Morocco. “I’ve used mine for years, and they hit the sweet spot in terms of being heavy and durable enough to take some kitchen abuse, but refined and precise enough that you will never need another kitchen knife again.” Made with hard-but-not-brittle alloy steel, this one’s a hybrid of Western and Japanese-style knives, which means it’s strong but won’t easily chip. It’s got good heft and it’s among the sharpest you’ll find. Notice those little dimples across the knife’s blade? They help the knife glide through sticky foods like potatoes, onions, and apples.Mac Knife Professional 8 Inch Hollow Edge Chef Knife$142 at AmazonGlobal Classic Chef’s KnifeAssociate food editor Kendra Vaculin loves her collection of Global knives—and you can find the chef’s knife in both 8-inch and 6-inch variations. “They’re lightweight and really do feel like an extension of your arm when you use them,” she says. That’s, in part, because they're so well-balanced: The hollow handle is full of an exact amount of sand added to offset the weight of the blade. If you want supreme stability while cutting and the ability to make super thin, delicate slices—this is the knife for you.Global 8-inch Chef's Knife$109 at AmazonVictorinox Fibrox Pro Chef’s KnifeA great chef’s knife doesn’t have to be an expensive knife. BA editors are big fans of the Swiss-made 8-inch Victorinox Fibrox Pro, which costs less than $50. It’s the one that’s stocked in the Test Kitchen—and it’s also associate food editor Zaynab Issa’s favorite chef’s knife of all time. It’s a sharp knife with a stainless steel blade, and although it isn’t full tang—a.k.a. the blade doesn’t extend all the way into the handle—it’s a solid knife that’s easy to use, comfortable to hold, and sharpens nicely. It’s a good chef’s knife for both beginners and professionals, and Morocco says that it’s one of the best knives for your money.Victorinox Fibrox Pro 8-Inch Chef's Knife$43 at AmazonMiyabi Chef's KnivesAssociate food editor Rachel Gurjar’s favors this stunner from Miyabi. The blade is composed of 132 layers of MicroCarbide powdered steel, resulting in a stunning Damascus pattern, in which the blade is etched with various light- and dark-colored waves. “I love that the wooden handle is straight, as opposed to curved,” she says. “And my hands are small, so I love how light this knife is.” If you want an 8-inch chef’s knife with peak precision (that’s also a gorgeous work of art), this one is hard to beat.Miyabi 8-Inch Chef's Knife$330 at AmazonIf you’re looking for Miyabi quality at a gentler price point, this is the knife I reach for when I'm planning on doing a lot of prep work and want to make very precise, clean slices. It merges Japanese craftsmanship with German engineering for a knife that’s razor sharp, long-lasting, and corrosion resistant.Miyabi Evolution 8-Inch Chef's Knife$160 at Amazon$160 at Food52Bulat Chef KnifeComposed of 66 layers of “soft” stainless steel wrapped around a tougher, higher carbon core, the Bulat chef knife also boasts a beautiful Damascus finish. It’s a high-quality knife that works wonders for everything from dicing veggies to cutting meat. “I love my Bulat chef’s knife,” says cooking and SEO editor Joe Sevier. “The ergonomic olive wood handle is super comfortable (not to mention gorgeous) and the bolster is also ergonomic and makes detail work easier. Plus, the Damascus steel blade is well balanced and looks, ahem, sharp.” Add this one to your knife set and you won’t regret it.Bulat 8-Inch Chef Knife$125 at Anova$120 at BulatFive Two Chef’s KnifeThis classic 8-inch chef’s knife is made with carbon-infused Japanese steel and comes out of the box with a super sharp blade. As someone who is not the most diligent about knife-sharpening (even though I do know it's important), I appreciate how this knife seems to hold its cutting edge. It’s lightweight enough that I buzz through piles of herbs without tiring out my wrists, but it's also sturdy enough that I don't fear hacking into a butternut squash or watermelon. It’s a pretty knife but not a precious one.Five Two Essential Kitchen Knives$69 at Food52$48Takamura HSPS Gyuto 8.2\"“I switched exclusively to Japanese chef’s knives the minute I graduated culinary school because they're lighter, more ergonomic, and the blade tends to be thinner and more nimble,” says food editor Shilpa Uskokovic. “This one holds its sharp edge really well, but when you do need to bring it back to a point, it just takes a few swipes on a whetstone.” The Takamura knife brand is family-owned, and this knife’s thin blade is made with a core of high-speed powdered steel for edge retention. It’s a kitchen workhorse for all kinds of knife work: mincing vegetables, cutting meat (but never any bones—use your cleaver for that), and removing the skin from fish. Uskokovic adds, “The color of the pakkawood handle is an understated but distinguished dark cherry, which adds to its charm. After almost a decade of daily dinners, my knife feels just as special and important to me as it did the first time I removed it from the box.”Takamura HSPS Gyuto 8.2-Inch$180 at MTC KitchenOnce you’ve found your perfect chef’s knife, show it the respect worthy of a prized kitchen tool. Use a honing rod to align the edge of your blade and a knife sharpener—ideally a whetstone—to keep it gliding through onions like butter. And please—hand wash only.Looking for the best bread knife? Step this way:The Best Bread Knife Costs $22 But Is Worth Its Weight In Gold. GOLD!I use it twice a day (but not to brush my teeth).View StoryThis article was originally published in 2020 and was updated in 2022 by Tiffany Hopkins.Explore Bon AppétitKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-09", "author": ["Condé Nast", "Sarah Jampel"]}