{"id": "b78775a14d5edde3cfe1d8886d81fdf1", "url": "https://www.bonappetit.com/story/soups-ranked", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Soups, Ranked | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSoups, RankedAn arbitrary ranking of 16 soups. Some soups are bad. Some soups are good. By Alex BeggsJanuary 30, 2020FacebookTwitterEmailPhoto by Laura Murray, styling by Judy Mancini.FacebookTwitterEmailI read this at the Bon Appétit Live Foodcast in Brooklyn a few days ago (you can listen to it on the podcast in the coming weeks!) and I think it was funnier out loud because I grabbed my buttcheeks and made weird faces and was generally awkward as hell. But I still feel the same feelings. And on the internet, I’m a lot less sweaty. So here you go: 16 soups in order from worst to best.Cabbage. No.\nPhoto by Chelsie Craig16: Do you... like making eye contact with a coworker in the bathroom mirror and then rushing into a stall to rip a huge fart? NOoooooOooooo. It was cheap to start with a fart joke but you can’t have that kind of tension in the workplace. Cabbage soup—a laxative by any other name—you’re on the bottom rung.Missing something.\nPhoto by Chelsie Craig, Food Styling by Pearl Jones15: Sometimes a soup teeters too close to the line between being a soup and a pasta sauce. You know what would make those soups better? Noodles. I’m talking about tomato soup. Uh, what are these little bumpy bites I’m getting? So much...tomato. Why are we pretending to like whatever dried oregano tastes like? Where’s the spaghetti?!?! This soup is a scam invented during the spaghetti depression and I’m not buying it. Bad soup.Gravy.\nPhoto by Heidi's Bridge, styling by Anna Billingskog14: Contrary to popular belief, the phrase “I creamed myself,” does not refer to a weird rash you got from bathing in Cream of Mushroom soup. Apparently this is a soup people eat—perhaps mistaking it for watery gravy—and we really can’t have that.13: No soup thinks more highly of itself than Manhattan Clam Chowder. Your property value isn’t higher because you swapped heavy cream for low-cal tomato juice. And I don’t care how historically accurate it is. Sticking leeches on your buttcheeks is historically accurate, that doesn’t mean I wanna do it. Manhattan Clam Chowder needs to go back to wherever it came from, which is probably...Connecticut?12: I just want to take a quick pause to say: bone broth is not a soup.Nutritious.\nPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Sophie Strangio11: The following soups only seem like a good idea when I’m in a midtown Hale and Hearty: lentil, seven bean, and mushroom barley. In every other situation they’re undesirable. There’s a reason you don’t start a $300 dinner at Le Coucou with a pebbly bowl of mushroom barley. It’s edible, it’s nutritious, but it’s undesirable, like a Woody Allen movie in 2020.SEO bait.\nPhoto by Alex Lau, Food Styling by Yekaterina Boytsova10: Speaking of soggy noodles, chicken noodle is a dumb soup. Just roast a chicken and eat that. Make some buttered egg noodles instead. The chicken’s dried out and bland, the noodles are mushy, the carrot coins are trying to choke and murder me—there’s no redeeming ingredient here. I knowww Molly recently developed an actually-great-blah-de-blah recipe for Basically chicken noodle soup, which you can find at eatbasically.com, but between you and me, that was for SEO. Because y’all still want to make this. And I’m not stopping you.9: You can wine and fine dine me and I’ll probably perceive lobster bisque as a good soup. Until I step back and look at it objectively. You got your hands on some sweet and tender and EXPENSIVE lobster meat and you want to overcook it in hot cream? And I certainly don’t want to drink it from shooters at show-offy wedding receptions. This is why you’re in credit card debt, Stacy.Yes.\nPhoto by Emma Fishman, food styling by Pearl Jones8: Okay that was a lot of negativity and some of it I meant with all my heart, but my heart is big and can hold a lot, like a huge stock pot of gumbo. Oh you don’t like the slimy okra surprises? I do not care! This is a variety pack of soup. Tiny bouncy shrimp. Spicy spices. Rice joins the party. Andouille floats by. Man can in fact live on gumbo alone, just ask my 90-year-old grandpa Jim, who’s been making it every week since the Dust Bowl. Still kickin’!No.\nAlex Lau7: The following green soups are bad: celery, asparagus, chilled cucumber (shudders). The following green soup is good: split pea. We can forgive its mushiness because this is an entire soup that revolves around the making of a HAM. You have to have cooked an entire ham to make split pea soup, and ham is one of the greatest foods. Then you get little flecks of ham in the soup to remind you of how wonderful life was, a few days ago, when you had even more ham. (Sigh.)Luv u.\nMatt Duckor6: My heart goes a’flutter for tom kha soup, the spicy-sour Thai coconut milk and chicken soup that has no flaws whatsoever. It doesn’t coddle you with pure creamy coconut milk. It drops some Thai chiles in the bowl to wake you the hell up. Great soup.Steam me up.\nPhoto by Amber Fouts5: When my face is directly over a steaming basin of pho, my glasses fogging up and my pores opening, sometimes I get so distracted by temporary blindness I forget about the soup beneath. Then you get to start playing with it. Squeeze of lime here. Extra fish sauce there. I like to drop the bean sprouts in one sprout at a time saying “now your turn!” And unlike some OTHER soups mentioned earlier, you GET YOUR NOODLES.Refreshing!\nAlex Lau4: This opinion does not reflect the rest of the BA staff: Gazpacho is good. Yes, it’s cold and chunky and in the wrong bowl, might be mistaken for salsa. But I like it! Tangy tomatoes all mushed up. A puddle of olive oil on top. Croutons. Drinking it makes me feel like Daisy Buchanan in that scene in The Great Gatsby where everybody’s hot and sweaty and rich. Remember that? An entire chapter describes this lady fanning herself on a couch. Bet she’d love a bowl of gazpacho!Party!\nPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen Kaminski3: Posole: a soup that’s literally thousands of years old and still very much bangs. The Aztecs made posole on special occasions, which in their case, involved human sacrifices...uh...but for you... it could be the Super Bowl! This pork and hominy soup is inherently rich and filling but then you get the TOPPINGS: Chicharrónes! Tostadas! Avocado! How could you get bored in a world with posole in it?Package deal.\nPhoto courtesy of Veselka2: This one has conditionals. Borscht has to be eaten at a Ukrainian diner, slippery pierogies need to also be on the table, and YOU need to be wearing a white t-shirt. There is no greater flex. Please don’t tell me if there’s cabbage in it. I don’t want to know.WOW.\nEva Kolenko1: By now you’ve probably deemed everything I’ve said a lie, which is fiiine. But when you tuck yourself into bed tonight under a duvet you saw on a subway ad, think about how you’re recreating what it means to be French onion soup: the best soup. Some French chef, or a rat under one’s hat, was like, what if we made, like, a pot pie with a cheese crust instead of dough? Oui chef! Brilliant idea, little rat. And underneath, a pile of caramelized onions in beef stock and a sunken island of bread, not much else. WOW. Hell of a soup. Let’s follow that up with steak frites, too much wine, and tarte tatin and then go to bed and die happy.Explore Bon AppétitSoupRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-30", "author": ["Condé Nast", "Alex Beggs"]}