{"id": "b78f7530e4165ded66f88e5c9e5062c8", "url": "https://www.bonappetit.com/recipe/basically-noodle-kugel", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "Noodle Kugel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBasically Noodle KugelBy Sarah JampelSeptember 15, 20194.6(77)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintAfter an intense internal debate about how a noodle kugel should be—naked or cereal-topped? wide noodles or extra-wide noodles? souffléed or custardy? sweet or savory?!—this is where we landed. Our kugel is a touch sweet and a touch eggy, landing somewhere between airy and pudding-like. Don’t tell your guests, but we like the corner pieces—where the noodles get crispy from the heat of the pan—best. Save those for yourself.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketLarge Pot$55 At AmazonTongs$13 At AmazonColander$11 At Amazon13x9\" Baking Dish$20 At AmazonParing Knife$10 At AmazonSmall Bowl$13 At AmazonWhisk$10 At AmazonLarge Bowl$18 At AmazonLarge Basting Spoon$16.37 At AmazonIngredients10–12 servings12oz. extra-wide egg noodles2tsp. kosher salt, plus more½cup (1 stick) unsalted butter, plus more for pan8large eggs½cup sugar1lb. full-fat cottage cheese1lb. full-fat sour cream2tsp. vanilla extract1tsp. ground cinnamonPreparationStep 1Preheat oven to 350°. Cook 12 oz. extra-wide egg noodles in a large pot of boiling salted water, stirring occasionally, until al dente, about 4–5 minutes. Drain, leaving a little bit of water clinging to the noodles.Step 2Generously butter a 13x9\" baking dish (we prefer glass for even heating, but metal is okay, too).Step 3Make the creamy sauce: Cut 1 stick butter into a few big pieces and transfer to a small heatproof bowl. Microwave until butter is melted, about 1 minute. Let cool slightly. Whisk 8 large eggs and ½ cup sugar in a large bowl until sugar is dissolved and eggs are frothy, 1–2 minutes. Add 1 lb. full-fat cottage cheese, 1 lb. full-fat sour cream, 2 tsp. vanilla extract, 1 tsp. ground cinnamon, and remaining 2 tsp. salt to egg mixture. Whisk vigorously to combine. Pour in melted butter and whisk again to combine.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 4Add hot noodles to bowl and toss to coat with a spoon or spatula.Step 5Transfer noodle mixture to prepared baking dish, tipping dish to evenly distribute. For a really crispy top, pull a few noodles to the surface so that they’re poking out over the sauce.Step 6Bake kugel, rotating pan halfway through, until custard has souffléed, top is browned, and noodles on the surface are crispy, 50–55 minutes.Step 7Let cool at least 20 minutes before slicing. Fight over those almost-burnt noodles on top.How would you rate Basically Noodle Kugel?Leave a ReviewTell us what you thinkReviews (21)Back to TopTriangleI can't read the recipe with all the damn pop up ads that block it.\nTry getting rid of the ads.  Don't be so desperate for sponsorship that you loose readers.AnonymousSouthern California12/4/2021I made this kugel for RH 2021.  Turned out great!  I made a few mods: 6 eggs instead of 8, added about 1/2 cup raisins to general recipe, and in the bottom of the glass dish, I spread a few tablespoons of brown sugar on top of the butter with a few raisins before pouring in the batter.  Everything else, I did as the recipe specified and it was a huge hit!  The brown sugar in the bottom gave it just a little extra oomf (and sweetness, we like it sweet!) and despite all the food served at this dinner, many people had seconds!  Thank you!Robin Robins9/20/2021A big hit at my family's pre-Rosh Hashanah dinner last night. I knew I needed to amp up the sweetness for my family, but my kids dislike raisins (heresy!), so, in the RH spirt I sliced some apples. They were a hit, but they also express a LOT of water when cooking, so next time, I may pre-cook them, or use dried apples, or just cook a bit longer, as I did yesterday. Anyway, a keeper recipe!JT DaddioLos Angeles9/7/2021The constant pop-up ads made it impossible to read the article or recipe.Anonymouscosta rica9/5/2021The best kugel recipe around. I have made it at least two dozen times. The recipe has the ideal proportions of ingredients. It is neither to dry, wet or sweet. You can even add raisins for more sweetness. Yummy!Sarah M.San Jose, CA6/6/2021I love Noodle Kugel and wouldn't use any other recipe. I've tried others but they just didn't taste as good to me. And yes...put the salt in the water not in the custard.\nAnonymousCorunna, Mich5/1/2021yummmmmmmmmmyyyyyyyyyyy it taste like a nice eggplanthorn nudelweiner city2/9/2021This recipe is definitely not too salty if you use kosher salt. If you use table salt, then yes, you'll throw this in the trash. JesseNYC12/22/2020All y'all putting the all salt in your egg mixture? Please add it to the noodle water. Always think and don't do anything that will clearly not work. Typos happen, and miscommunication happens. If it was too salty, try putting the salt in with the noodle water and see how that works. MarthaIthaca NY12/18/2020Mine turned out great and I and my family ate it over 3 days. It was especially good for breakfast! I did use unsalted butter and regular cottage cheese, but switched the sour cream to non-fat Greek yogurt (Fage). Maybe that is why another person said theirs was too salty, from their sour cream? Because mine was more on the sweet side, if anything. Also, I used 6 eggs instead of 8 eggs, since other recipes appear to call for closer to 6. It turned out perfect with those two modifications (6 eggs instead of 8 and non-fat Greek yogurt instead of sour cream), otherwise followed it to a T. I will definitely use this recipe again!AnneSan Francisco, CA12/16/2020This recipe was way too salty and basically inedible. Used unsalted butter and only the required amount of salt, but still tasted savory instead of sweet. Ended up taking a few bites, and then throwing the rest out. I think it was because of the cottage cheese, so if you're making this recipe I would recommend omitting that.MaddieBoston12/13/2020We always put raisins into noodle kugel. Excellent that wayjoyce pustilnikNew York City11/21/2020If you lose the vanilla & cinnamon, this is nearly identical to my mother's luchen kugel. I detest kugels with fruit (pineapple or raisins),  and\nI prefer crunchy, slightly burnt noodles to corn flakes, but my mother insisted on the Kellogg's version that had never been seen back in the shtetl.\nOne year, in my youth, she inadvertently sprinkled on frosted flakes instead of the obligatory corn flakes.\nTo this nine year-old, it was the greatest thing since sliced bread. However, I was the only one with that opinion, so alas, that \"mistake\" was never to be repeated...Neil MorrisFlorida10/6/2020This is almost perfect. A couple more eggs than I usually but the article this came from that said cottage cheese or raisins but never both is a lie. Both raisins and cottage cheese please. Never pineapple or corn flakes, sometimes apple, sometimes topped with a little cinnamon/sugar/butter blend.AnonymousAlexandria, VA7/11/2020add raisins for an extra sweet punch.........AnonymousUSA 3/2/2020Explore Bon AppétitCasseroleJewishEgg NoodleNoodlePasta & NoodlesSideVegetarianNut-FreeHanukkahRosh HashanahBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-15", "author": ["Condé Nast", "Sarah Jampel"]}