{"id": "b7b628b6772f76089612a24a67fe8e70", "url": "https://www.bonappetit.com/story/how-to-make-crispy-tofu", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "How to Make Crispy Tofu | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Crispy Tofu in 5 StepsJust because it comes packed in water doesn’t mean you can’t get it golden brown.By Sarah JampelFebruary 9, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This week on Basically, we’re diving deep into one of our favorite ingredients: tofu. To get all of this (and more) way before it hits the web, subscribe to our print magazine.When I look at a block of tofu, all I see is POSSIBILITY. (Can’t say the same about looking at my Google calendar.) With a little ingenuity, a solid foundation of techniques, and a good recipe, tofu can be nearly anything I want it to be: simmered in a spicy stew like soondubu until soft and supple, warmed with dashi in a donabe, grilled and drizzled with chimichurri. And even though it might seem counterintuitive, since many types come packaged in water, tofu can also be “crispy” too.I put crispy in quotation marks because we’re not talking fried chicken– or Pringles–level crispy here. Rather, “crispy” tofu is golden brown all over with a distinct crust. It holds onto sauce but doesn’t get lost in it. You’ll want to pop a cube into your mouth like a tater tot.While tofu may not be born crispy—and, at times, may seem to resist all of your attempts to make it that way—follow these five steps and you can easily get it there. Here’s how to make crispy tofu:1. Press it.If you’re pan-frying your tofu, you’re probably using a firm, extra-firm, or super-firm variety (rather than silken). These have already been pressed in their creation—that’s how the coagulated soy milk becomes a block—but most could use a little more assistance. Because the drier you can get your tofu, the crispier it will become. You could pat tofu with a lint-free kitchen towel or paper towel before you start cooking (see No. 2), but even better to press some of that excess water out using a heavy weight.Expelling water compacts the block of tofu, which accomplishes two things: It creates a denser, heftier, and sturdier texture, making the pieces less likely to crumble to bits as you fry, stir, and flip, and it reduces spattering when the pieces hit hot oil.Tofu press, I love you.\nPhoto by Chelsea KyleYou can press tofu by using a tofu press (I’m a well-documented tofu press advocate—it just makes my life the littlest bit easier) or MacGyvering a DIY method: Place your tofu on a lint-free kitchen towel atop a rimmed baking sheet or cutting board. Blanket it with another towel, then place a cutting board on top and stack on all of your heavy objects, like cast-iron pans, cans of tomatoes, sleeping cats. To speed up the process, cut your tofu into thinner planks or smaller cubes before you weigh it down. By increasing the surface area, you create more pathways for the water to exit. Aim for at least 20 minutes or as long as you can muster. (You can also press your tofu for several hours or overnight—I usually just stick my whole tofu press in the fridge in the morning so that it’s ready to go at dinnertime.)Not every block of tofu that you plan to pan-fry needs to be pressed: If it’s dense and firm enough straight from the package, you may not need to press at all. This really depends on the brand—I find that high-protein tofu from producers like Hodo Foods and Phoenix Bean, which comes vacuum-sealed rather than sitting in liquid, often doesn’t need to be pressed. In that case, just move on to the next step.2. Pat it dry.Cut (or tear!) your tofu into its final shape. (Alternatively, you can fry the tofu in planks and rip or cut it into pieces after—fewer crispy edges, but less flipping! You make the call.) Dry off your sliced tofu on all sides using a lint-free kitchen towel or paper towels, then season with salt.3. Add starch.A light coating of cornstarch will absorb even more moisture from the tofu’s surface and contribute to a distinct coating. Sprinkle over the starch (potato starch, tapioca starch, and arrowroot all work too) a little bit at a time and toss the tofu, pressing gently so the starch adheres. At this point, you can also mix in ground spices and seasonings (ground garlic and onion, mustard powder, nutritional yeast, chili powder, black pepper) and/or, my favorite addition, panko, which gets crackly when fried.4. Use a nonstick pan.Now that you’re ready to cook, pull out a nonstick skillet, which will prevent your tofu from refusing to dislodge when you go to turn it. A very well-seasoned cast-iron skillet or wok will also work.P.S. We like this one:PHOTO BY CHELSIE CRAIGZwilling Madura Plus Nonstick Pan, 9.5-Inch$81 $65 at Zwilling$81 $65 at Target5. Be generous with the oil (and be patient).Coat the bottom of the pan with neutral cooking oil (you’ll need at least a few tablespoons), get it hot, and cook the tofu over medium-high heat. The layer of fat helps transfer heat from the pan’s surface to the tofu, contributing to that allover, even crust. Don’t turn the pieces until they release (I find a pair of tongs or a mini offset spatula to be a much handier tool than a big spatula), then repeat the process until they’re golden brown all over. This could take a few minutes per side, so be patient. Transfer the tofu to a plate or baking sheet lined with paper towels or to a cooling rack so that they don’t sog.Now that you’ve got your crispy tofu, you’re ready to take on the world—or, at least, the sauce:Sesame Tofu With BroccoliA riff on Chinese American sesame chicken, this recipe is super sesame-y from the sauce up: Tahini (an untraditional but logical addition) adds richness, and sesame oil and toasted sesame seeds hit the flavor home.View RecipeExplore Bon AppétitTofuIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Sarah Jampel"]}