{"id": "b7d010ba235ecb632eb1e180b2614bc8", "url": "https://www.bonappetit.com/recipe/bushs-fully-loaded-queso", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "BUSH’S® Fully Loaded Queso Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDBUSH’S® Fully Loaded QuesoFacebookPinterestTwitterEmailEveryone’s favorite dip gets an upgrade with tasty toppings.PrintIngredients2 tablespoons unsalted butter1 small white onion, minced (1 cup)2 large garlic cloves, minced2 large jalapeños, minced (½ cup)2 tablespoons all-purpose flour12 ounces shredded American cheese (4 ¾ cups)4 ounces shredded Monterey jack cheese (1 ½ cups)1 1/2 cups whole milk2 small tomatoes, diced (1 ½ cups, 8 ounces)⅓ cup sour creamChopped fresh cilantro leaves, for garnishTortilla chips, for servingRecipe PreparationMake the Chili Beans: In a large skillet, heat oil over medium-high. Add beef and season with salt. Cook the beef, breaking up with a spoon, until cooked through and browned, about 6 minutes. Carefully, drain off fat; discard fat. Add beans and their sauce to skillet and bring to a simmer. Remove from the heat and keep warm.Make the guacamole: In a medium bowl, smash the avocado with the back of a fork. Stir in the cilantro and lime juice. Season with salt.Make the Pico de Gallo: In another medium bowl, stir together the tomato, white onion, cilantro, jalapeno, and lime juice. Season with salt.Make the Queso: Melt the butter in a large high-sided skillet over medium. Add onion and cook, stirring occasionally, until soft, 4 minutes. Add garlic and jalapeño and cook, stirring, until fragrant, 1 minute more.Add the tomatoes to the skillet and cook, stirring occasionally, until the tomatoes start to break down and the juices mostly evaporate, about 2 minutes. Add the flour and cook, stirring, 1 minute.Stir the milk into the skillet and bring to a simmer. Add all the cheddar and monterey jack cheese and stir until the cheese is melted. Season with salt and pepper.Set aside 1 cup of the chili bean mixture for the top and spread remaining mixture in the bottom of a shallow serving bowl. Pour hot queso over chlii bean mixture and top queso with reserved chili bean mixture, guacamole, pico de gallo, and sour cream. Top with more cilantro, if desired.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitBUSH'S® BeansDipTex-MexPinto BeanCheeseStarterSnackSuper BowlMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Bon Appetit"]}