{"id": "b7d833f84255da9e68b7c0c85deee7aa", "url": "https://www.bonappetit.com/story/alder-and-co-linen-apron", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "Yes, I Splurge on Fancy Alder & Co. Aprons—and I Haven’t Regretted it Once | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYes, I Splurge on Fancy Aprons—and I Haven’t Regretted it OnceThese ones from Alder & Co. make me feel great, and that’s worth it!By Carla Lalli MusicJanuary 9, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I’m sure some women can tell you all about the day they bought their first expensive designer bag. I remember the day I splurged on my first fancy apron.I was in Portland, Oregon, and a friend told me to check out Alder & Co., an irresistibly adorable store that stocks a mix of luxe home goods (like linen bedding and quilted throws), cool-girl jewelry, gifty things like handmade beeswax candles and one-of-a-kind ceramics, and a wall of tantalizing skincare products in modern packaging. I had my hands full, but when I started browsing the womenswear section, I discovered a thing I had never seen before: an apron that cost more than $100. It was creamy white linen with narrow navy pinstripes, designed in a flowy cross-back style with two angled oval pockets. Considering an apron is a thing you expect to get dirty so your real clothes can stay clean, it seemed like a lot to spend. By the time I had that thought, I had already slid the apron off its hanger and was admiring its shape and also its weight.“How can I justify spending this much on an apron?” I whispered to the apron.“You wear aprons a lot,” the apron whispered back. “It’s for work.”For work! Yes! That was the ticket. This apron would be part of my ~uniform~, I thought, and since I don’t think twice about spending money on kitchen clogs—another essential piece of ~equipment~, why would I hesitate now!?? It was a professional investment! Like a wireless mouse, kind of!Would you just look at that apron! (Oh ya, and Natalie Portman’s there too.)\nI bought the apron, obviously. And I did wear it at work! I wore it when I cooked, and I wore it in my Back to Back Chef video with Natalie Portman. I felt like a million bucks that day. The apron basically became famous by association, in my mind at least, and every time I put it on, I felt not only professional, but special. I never for one second regretted that purchase.This is where the story takes a turn. That very apron was stolen from the test kitchen—or maybe it went missing? Either way, I never saw it again. Alder & Co. closed their Portland location, so I couldn’t get another one the next time I went out there.This is where the story has a happy ending: Alder & Co. reopened in upstate New York, and they still carry the same brand of aprons. When I caught wind of this, I didn’t hesitate: I am now the proud owner of two aprons (one in peach and one in blue; the colors vary with each season), and I love wearing them, whether I’m filming a video or not. I suppose this is what it’s like for other women who eventually buy multiple fancy bags and stack up their array of designer bracelets. That’s cool, too! I’ll be over here, collecting aprons—after all, they’re for work!Buy it: Alder & Co. Linen Apron, $110 at Alder & Co.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-03", "author": ["Condé Nast", "Carla Lalli Music"]}