{"id": "b7ea24add6095cc723a1d683bf65235b", "url": "https://www.bonappetit.com/story/lokass-lunch-bag", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "This Is the Best Insulated Lunch Bag I’ve Tried (and I’ve Tried A LOT) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis Lunch Bag Is So Cute That I Sometimes Wear It As a PurseWho says you can’t have form AND function?By Urmila RamakrishnanJanuary 7, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Back in the old days of commuting, I reveled in packing food for my workday: dal and rice with spinach for lunch, fruits and nuts for snacks between meetings, chocolate for stress relief, baked goods to share with my colleagues. All would be stuffed into a brown paper bag, à la elementary school.Rookie mistake. One time, I made goat curry with friends and excitedly packed up the plastic container, stuffed it in the “trusty” brown paper bag, and tossed it into my backpack. On my way into the office, I noticed that the bottom of my backpack was wet. I unzipped it to find a small pond of goat curry liquid at the bottom, clumped with soggy pieces of brown paper.It was time to graduate to a next-level lunch bag. One that would prevent strange pools of liquid that put my backpack (and work-issued laptop) in danger. But I didn’t want a Star Wars AT-AT lunch box from grade school. I wanted the best lunch bag that also made me look and feel like a working professional. After spending literal weeks combing through reviews and sites, making pro-con lists, and even experiencing a couple of failed orders, I finally found a lunch bag that didn’t necessarily look like a lunch bag.Lokass is the best insulated lunch bag I’ve tried. The key word being insulated: My old office fridge often resembled a museum of failed experiments, filled to the brim with fuzzy blue-and-white oddities, so I like to keep my food at my desk—where it’s easier to sneak a bite too. I have the navy blue floral one, and thanks to the shoulder strap, I can even wear the Lokass bag as a full-on purse (the front pocket also helps store my phone and wallet). I’ve popped inside a couple of ice packs along with a can of ginger ale, and things stayed nice and cool from early morning to about 2 p.m. The brand specializes in durable bags, and this one has three layers: PEVA, foam padding, and canvas. With its zipper compartment, everything is cozily locked into place, and the bonus? It’s waterproof. (So long food puddles, hello gorgeous gorgeous soup!)The bag comes in 17 styles and at least three different sizes, including one with separate compartments if you want to keep some things warm and other things cold. During these days of WFH, it’s also the best insulated lunch bag for a wintry hike, that trip to the ice rink, or stashing a bottle of bubbly on the way to a friend’s place. But I’m waiting for the day I can proudly take my very fashionable lunch bag with me to the office (with all its food intact!) and place it front and center on my desk for everyone to see.Photograph by Isa Zapata.  Food Styling by Pearl JonesLokass Insulated Lunch Box$20 at AmazonExplore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-07", "author": ["Condé Nast", "Urmila Ramakrishnan"]}