{"id": "b7ed8661152f1b7cfd9320e921018c49", "url": "https://www.bonappetit.com/recipe/meyer-lemon-margarita", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "Meyer Lemon Margarita Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredMeyer Lemon MargaritaUsing sweet and floral Meyer Lemons, Maricela Vega’s margarita takes advantage of citrus season. Produced in partnership with Patrón Tequila.By Maricela VegaFebruary 22, 20214.4(9)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintIngredientsCocktail:1½oz. Patrón Silver Tequila1Tbsp. sugar cane (raw brown, organic)½cup ice¼cup Meyer lemon juice (1-2 whole ripe Meyer lemons, depending on size.) Do not discard after juicingGood salt (pink Himalayan or regionally made salt)OPTIONAL: ½ of a ripe passion fruit, scoopedPreparation PreparationStep 1Set up your station: lay a wet paper towel down and a small cutting board over it; first, slice all your ripe meyer lemons in half (take 1 half and slice 2 pinwheels from it, juice what remains). Then, grab citrus juicer to juice approx. ¼ cup of liquid. Pour the juice into the shaker along with 1 tablespoon of sugar cane. Stir together for 30 seconds–until all sugar is completely dissolved. TIP: save your meyer lemon remains to rim your glass with and to later make a preserve.Step 2Gather your 1½ oz. of Patrón Silver Tequila, and add it into your shaker along with ½ cup of ice cubes. (OPTIONAL: to really jazz up your margarita, add half of ripe passion fruit into the shaker, you won’t be disappointed!) Lock in your shaker and shake for 45 seconds until outside of your shaker gets icy.Step 3Before straining over your glass, be sure to grab the remaining ½ of meyer lemon and fold it over the lip of your glass and around to salt the rim (have the salt on a small plate to spin the lip of the glass onto). Once the rim is salted, fill the glass up ½ way with ice then pour the strained drink over it. Garnish with a meyer lemon pinwheel.How would you rate Meyer Lemon Margarita?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDon't you mean cane sugar? Sugar cane would never dissolve...newberriesHouston3/5/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-22", "author": ["Condé Nast", "Maricela Vega"]}