{"id": "b7f13a663d6e617d11d08b04f4f88bbc", "url": "https://www.bonappetit.com/recipe/green-seasoning-baked-cod", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "Green Seasoning Baked Cod Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGreen Seasoning Baked CodHerbaceous, aromatic, fresh, and—maybe most importantly—simple, this Trini-inspired recipe from Brigid Washington is just the cure for those January blues.By Brigid WashingtonJanuary 10, 20214.1(21)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by D'Mytrek BrownEmailPinterestPrintEmailPinterestPrint“If you took the contents of nearly any bottle of green seasoning and broke it down to its component ingredients, you’d have the makings of this recipe,” writes recipe developer and cookbook author Brigid Washington. “Green seasoning is a bright, piquant, and herbaceous staple particularly beloved in Trinidad & Tobago, where it’s often used to inject complex and robust flavors into meat, poultry, and fish prior to cooking. The aromatic blend consists of cilantro (or culantro, which grows wild on the island), garlic, onions, scallions, a source of acid, and a source of heat. For this recipe, the core components of green seasoning aren’t puréed as they traditionally are but rather chopped by hand. Mild and mellow white fish—in this case, cod—is baked under this blanket of fresh herbs, and the end result is a simple yet comforting dish that also has bright bursts of tropical flavors and oomph. This is exactly the type of recipe I want during a very languid January.”All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron13x9\" Baking Dish$20 At AmazonMicroplane$16 At Amazon8-Inch Chef's Knife$47 At AmazonCutting Board$10 At IKEAMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonIngredients4 servings¼Vidalia or other sweet onion46-oz. skinless, boneless cod fillets1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, dividedFreshly ground black pepper¼cup plus 2 tsp. extra-virgin olive oil1lime4garlic cloves12\" piece ginger4–5thyme sprigs1small bunch cilantro2–4scallions1red bell pepper1habanero chileCooked brown rice or ramen noodles (for serving)PreparationStep 1Preheat oven to 300°. Thinly slice ¼ Vidalia or other sweet onion with a chef’s knife and place in a medium baking dish. Place four 6-oz. skinless, boneless cod fillets on top of onion slices. Generously sprinkle fillets on both sides with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and season with freshly ground black pepper. Pour ¼ cup extra-virgin olive oil over, then finely grate zest from 1 lime on top; set lime aside. Turn fillets to coat. Let cod sit while you prepare remaining ingredients.Step 2Smash, peel, and coarsely chop 4 garlic cloves. Peel one 2\" piece ginger with a spoon, then thinly slice; place in a small bowl. Cut slices into matchsticks; cut matchsticks into small cubes. Place garlic and ginger in a small bowl.Step 3Pick leaves off 4–5 thyme sprigs and chop; discard stems. You should have about 1 Tbsp. chopped thyme. Coarsely chop leaves and tender stems from 1 small bunch cilantro until you have ½ cup (reserve remaining cilantro for another use); add herbs to bowl with garlic and ginger.Step 4Trim and coarsely chop 2–4 scallions to yield about ⅓ cup and place in same bowl.Step 5Slice 1 red bell pepper in half lengthwise and remove ribs and seeds; discard. Finely chop flesh and add to bowl. Slice 1 habanero chile in half lengthwise and remove ribs and seeds; discard. Finely chop half of chile; reserve remaining chile for another use. Add bell pepper and chile to bowl and toss all ingredients with your hands to combine.Step 6Spoon mixture evenly over cod to completely cover. Slice reserved lime in half and squeeze juice over; sprinkle with remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt and drizzle with remaining 2 tsp. extra-virgin olive oil. Bake until fish is opaque and cooked through and red pepper and chile are softened, 25–35 minutes. Serve cod with cooked brown rice or ramen noodles.Photo by Emma Fishman, Food Styling by D'Mytrek BrownHow would you rate Green Seasoning Baked Cod?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleSoooo yummy. Someone asked about frozen cod, I used frozen cod and this is the perfect recipe because of the bright flavors. I used a whole habanero because half seemed too mild. I’m in love. AnonymousFlorida 9/10/2021I made this tonight, it was okay, not amazing.  For whatever reason there was no real zing to the meal even when adding fresh lime when serving.  I'd suggest adding a little bit of soy sauce when serving. Naomi San Francisco, CA 1/18/2021Made this last night. I expected it to to be good, but it was delicious!! I made it with Mahi Mahi since they didn’t have cod at my local grocery store. I also used finely chopped carrots instead of red pepper to stay seasonal for winter. Served over a salad. \n\nWould love to try it with cod as Mahi Mahi isn’t my fave, but the flavors of the sauce and lime all together were wonderful. Printed this out to keep in the rotation. SarahAustin, TX1/12/2021This is SO delicious and easy. I had to leave out bell peppers and ginger because of an allergy issue so I just did extra onions and garlic (I love my aromatics). The herbaceous greens on top was simple and so good. I’m obsessed, was just as good today out of my fridge. Growing ShortDallas, TX1/12/2021This looks delicious.  I am going to try it with BlackCod.   My answer to the question concerning the ginger.  I looked at the picture and think they used orange and red peppers to give the dish more color.   That much ginger would overpower everything else =.  Nana DragonPort Ludlow, Washington1/11/2021Can I make this ok with frozen, thawed cod fillets?Joe V.Durham, NC1/10/2021What are the small yellow chunks in the photo? Are they ginger?Madeline1/10/2021Explore Bon AppétitCodFishSeafoodCilantroHerbs & SpicesEasyWeeknight MealsSheet-Pan DinnersMainDairy-FreeNut-FreeGluten-FreeKetoDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-10", "author": ["Condé Nast", "Brigid Washington"]}