{"id": "b7f5a420db1143a0969cd46b53d0d1c8", "url": "https://www.bonappetit.com/story/remembering-anthony-bourdain", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Remembering Anthony Bourdain, Tony, Who Felt Like Everyone’s Friend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRemembering Anthony Bourdain, Tony, Who Felt Like Everyone’s FriendAndrew Knowlton on Bourdain’s legacy, influence, and the dinners they shared.By Andrew KnowltonJune 8, 2018FacebookTwitterEmailPhoto by Mike Pont/WireImageFacebookTwitterEmailIf you are having thoughts of suicide, please call the National Suicide Prevention Lifeline, at 1-800-273-talk (8255), or the Suicide Crisis Line, at 1-800-784-2433, or text 741741.It’s 8:42 a.m. on Friday, June 8, 2018 and I just heard the news. I scroll through my Instagram feed to see and read what my friends are thinking. Everyone is in shock. There’s his salt and pepper hair atop his long, chiseled face. There are his deep, intense eyes, which, considering this morning's news, seem to carry even more weight. There he is in Chiang Mai, Thailand with chef Andy Ricker eating Laap Kao Cham Cha. There he is is drinking beer with President Obama in Vietnam. There he is, post after post, eating something, drinking something, smiling with some chef, some farmer, some person who couldn’t be more happier than having their picture taken with the inimitable Anthony Bourdain. And now he’s gone.I fell in love with Bourdain on April 19, 1999. That’s when his now legendary article “Don’t Eat Before Reading This” appeared in The New Yorker and rocked the food world. Had anyone ever been so honest about what really happens at restaurants? I still have a hard time eating fish on Mondays because of what he wrote, despite the fact that he even updated his stance many years later. That article was the foundation for the groundbreaking Kitchen Confidential, the book that made restaurants and working in them cool. That book changed people’s lives. It made Bourdain an everyday hero who understood what it was like to spend 16 hours a day cooking. I wanted to be like Bourdain. I would hang out at Les Halles, a bistro on Park Avenue in New York City, eating steak au poivre and French fries and drinking Malbec hoping to catch of the glimpse of the man with the handkerchief tied around his neck.In the following years, I shared a few meals with Bourdain. I interviewed him a few times for stories and would text him with random thoughts or opinions. He always had an opinion and he always made time for people, even as his star rose with No Reservations on The Travel Channel and Parts Unknown on CNN. He wasn’t just a food industry idol anymore; the public had adopted him as their guide who would open windows into cultures that they themselves might never have the chance to experience firsthand. Bourdain made eating unfamiliar food cool. Eat first and ask questions later was his philosophy. Be fearless and always carry a fork or pair of chopsticks. He made traveling to far off lands and seeking out authentic experiences the only way to travel. When Bourdain featured a restaurant on one of his shows, it would be packed the next day and every day after that. I can’t tell you how many times I’ve been sitting at a bar or restaurant and someone would come up to me and say, “That’s where Tony sat when he was here.”Tony. That’s what most people would call him after just one face-to-face encounter. That’s because through his writing, his words, and his shows, Bourdain felt like your best buddy. He was unpretentious and open to whatever landed on his plate or in his cup or who he came in contact with. He was as quick to share a shitty beer in a styrofoam cup as he was a fancy-ass glass of bubbly. He could go high and he could go low. But no matter what it was, he did it with respect and class. I wanted to be like Tony. Everyone wanted to be like Tony. Even when he teased me, calling me Breck Boy because of my long hair on Iron Chef America, I felt flattered just that he noticed.A few years back after taping a video for Bon Appétit along with his pal Eric Ripert at Le Bernardin, Bourdain and I stepped outside on 51st Street for some fresh air. It was 10 in the morning but we were both sipping mezcal (Ripert made us do it!). Who knows what time zone his head was in. We talked for a half hour about fried chicken, our favorite pizza spots, and Norwegian black metal. Find the things that make you happy and do more of that, he told me toward the end of the conversation.I don’t pretend to have known Tony as much as other folks in the business, but I’d like to think that he was happiest when he was sitting at some table in some corner of the world drinking and eating with friends old and new. That’s how I will choose to remember him.I hope he knows how many people’s lives he transformed. Some people change the world through art, some through music and politics. Tony did it through food. The world is a less intriguing and less delicious place today now that he is gone. Tonight’s dinner and bottle of wine is for you, Tony.How Anthony Bourdain Came to Be Anthony BourdainAnthony Bourdain grew up to be one of the world's most adventurous (and opinionated) eaters. Here, he credits his father for the man he became.View StoryExplore Bon AppétitAnthony BourdainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Andrew Knowlton"]}