{"id": "b7fbb80e24daee903e76f2f245268ed0", "url": "https://www.bonappetit.com/recipe/garlic-fried-rice", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Garlic Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueGarlic Fried RiceBy Melissa MirandaFebruary 9, 20214.3(37)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintThis is one of those times when just a few ingredients pay out big, resulting in a rice dish that bursts with garlic flavor. This recipe is from Melissa Miranda, the chef-owner of Seattle’s Musang, a Filipinx community space and restaurant.Ingredients4 Servings¼cup vegetable oil8garlic cloves, finely chopped4cups cooled cooked jasmine riceJohnny’s seasoning salt or kosher saltFreshly ground black pepper (optional)PreparationStep 1Heat oil in a large wok or nonstick skillet over medium-high. Cook garlic, stirring, until golden brown, about 1 minute. Using a spider or slotted spoon, transfer garlic to a small plate. (Or strain through a fine-mesh sieve into a heatproof measuring glass and return oil to wok.)Step 2Break up rice and place in same skillet; season lightly with seasoning salt (or kosher salt and pepper). Cook, tossing occasionally, until rice is warmed through and crispy in spots. (In Tagalog that crispy rice is called tutong; it’s like the crispy part at the bottom of the paella pan.) Add garlic to rice and toss to combine.How would you rate Garlic Fried Rice?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleI’ve had this multiple times at Ate Miranda’s Musang restaurant many times and was so excited to see this as I’ve wondered how to make it. \n\nIt was very close and great with some chicken adobo, YUM!! So impressed to see our neighborhoods own Musang dish in Bon Appetit!!BeaconHill Bike DadSeattle, WA1/24/2022Made this rice to go along with the adobo chicken and winter greens, as shown in the March magazine.  Delicious!  What a simple way to amp up plain, boring rice.  I will say that mine never really crisped up, even after about 10 minutes, so I let it be.  All it did was kind of dry out the rice.  Either way, it was great and I'll definitely do again to replace plain rice in the future!LBinTXTexas3/25/2021So good and unfussy. We ate this with tocino (the only thing missing was a fried egg on top), and our lunch conversation was silenced because we were too busy eating. Put this on repeat!JessicaSan Francisco, CA2/24/2021Explore Bon AppétitFried RiceFilipinoSoutheast AsianAsianGarlicVegetableRiceRice & GrainsEasyQuickWeeknight MealsSideDairy-FreeNut-FreeGluten-FreeVegetarianVeganFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}