{"id": "b8025bd6b0bbf475a0a290c0e6d86f8f", "url": "https://www.bonappetit.com/story/these-people-are-changing-the-way-we-live-on-this-crazy-planet", "year": 2019.0, "month": 1.0, "day": 3.0, "content": "These People Are Changing the Way We Live on This Crazy Planet | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese People Are Changing the Way We Live on This Crazy PlanetHealthyish editor Amanda Shapiro breaks down how the Healthyish 22 happened.By Amanda ShapiroJanuary 18, 2019FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Between the holidays and the Feel Good Food Plan, it’s been a minute since we’ve talked. But I’m back now, and I’ve come with some extremely fun news.Okay, I admit it: Even as the Healthyish editor, I sometimes—okay, often—get wellness fatigue. The same two or three names always float to the top of the conversation, and it honestly gets pretty boring. So we decided to dig a little deeper.Today we launched The Healthyish 22, our roster of chefs, artists, entrepreneurs, and all kinds of genre-bending geniuses who are paving the way for a new kind of wellness in 2019.These aren't all people you've seen before. They aren’t celebrities with supplement companies or #influencers shilling products for a living. They don’t have restaurant empires (though Daniela Soto-Innes is well on her way). The Healthyish 22 are hustling, sure. They’re throwing ridiculously fun dinner parties, sourcing the absolute best turmeric, getting wild with mushrooms, and making eye-poppingly good natural wine. They’re making it easier to eat healthyish out in the world and bringing wellness to the communities that need it most. They’re doing it all, but on their own terms—and we want to celebrate that.We also want them to keep doing all the cool things they do. I hope you’ll follow these incredible folks and support their work. You could browse the virtual aisles of Jess Young’s online snack emporium, Bubble Goods, or scope these crazy face mirrors from designer Elise McMahon. I just got one of Steph DeAngelis’s prints framed for my room. You could check out Bini’s Kitchen next time you’re in S.F. or Toli Moli when you’re in D.C.Whatever you do, I hope you find these 22 people as fun, inspiring, and not-boring as I do.Sincerely,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThe Healthyish 22 Are Changing the Way We Eat, Shop, and Live on This Crazy PlanetGallery17 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-18", "author": ["Condé Nast", "Amanda Shapiro"]}