{"id": "b823ee1c03d0e1b858925f56937280d7", "url": "https://www.bonappetit.com/recipe/cinnamon-date-sticky-buns", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Cinnamon-Date Sticky Buns Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCinnamon-Date Sticky BunsBy Sohla El-WayllyApril 11, 20204.6(177)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Susan SpungenEmailPinterestPrintEmailPinterestPrintFor the final recipe in the Basically Guide to Better Baking, you get all of the glory of a gooey sticky bun without the over-the-top sweetness. Instead of the usual brown sugar and butter filling, the fluffy buttermilk-laced buns are filled with a cinnamon-scented date purée. To make these, you'll have to knead, fold, and work with yeast, but the end results are more than worth it. A quick note on substitutions: The places where you can tweak this recipe to suit your preferences (and the contents of your pantry) are the filling and the glaze. The ingredients for the dough, however, are non-negotiable. For more information and to ask questions, head to our baking forum.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketSmall Bowl$13 At AmazonInstant-Read Thermometer$35 At ThermoworksWhisk$10 At AmazonGlass Measuring Cup$19.99 At AmazonFood Processor$49 At AmazonSpatula$12.99 At AmazonRolling Pin$13 At AmazonMedium Bowl$17 At AmazonSmall Saucepan$155 At AmazonSpoon$24.69 At AmazonOffset Spatula$12 At AmazonSerrated Knife$54 At KorinCast Iron Skillet$30 At AmazonPastry Brush$9 At AmazonIngredientsMakes 9¾cup plus 3 Tbsp. buttermilk or plain whole-milk yogurt (not Greek)10Tbsp. vegetable oil, divided1large egg1¼-oz. envelope active dry yeast (about 2¼ tsp.)½cup (packed; 100 g) dark brown sugar, divided3cups (375 g) all-purpose flour1½tsp. kosher salt, divided¼tsp. baking soda1cup (packed; 180 g) Medjool dates2tsp. ground cinnamon¾cup (83 g) powdered sugar1tsp. vanilla paste or extractPreparationStep 1Combine ¾ cup buttermilk and 6 Tbsp. vegetable oil in a small microwave-safe bowl (it won’t get smooth and that’s okay) and heat in the microwave in three 10-second bursts until just about body temperature (it shouldn’t feel hot or cold to the touch; an instant-read thermometer should register about 98°). If you don’t have a microwave, you can heat in a small saucepan over medium-low, stirring constantly, about 1 minute.Step 2Whisk 1 large egg, one ¼-oz. envelope active dry yeast (about 2¼ tsp.), and ¼ cup (packed; 50 g) dark brown sugar in a measuring glass to combine, then whisk into buttermilk mixture.Step 3Pulse 3 cups (375 g) all-purpose flour, 1 tsp. kosher salt, and ¼ tsp. baking soda in a food processor to combine. With the motor running, stream in buttermilk mixture. Process until about 80% of dough comes together into a ball (mixture will look very wet at first, then begin to pull away from the sides of processor), about 2 minutes.Step 4Using a bowl scraper or rubber spatula, scrape dough onto an unfloured surface. (It should still be pretty wet and sticky.) Knead, pushing it away from you, then pulling it back toward you, until a smooth ball forms, about 3 minutes. The dough will grow silkier, tighter, and easier to work with as you knead. (Don’t be tempted to add flour; if dough is too sticky to work with, lightly oil your hands.)Step 5Roll out dough into a rough 8\" square. Fold dough over onto itself to make an 8x4\" rectangle, then flatten it slightly and fold over once more to make a 4\" square. Roll dough back out to an 8\" square and repeat folding process (you should be back at a 4\" square). Pour 1 Tbsp. vegetable oil into a medium bowl and add dough (still folded); turn to coat. Cover bowl tightly and chill dough until doubled in volume, at least 8 hours and up to 1 day.Step 6To make the date filling, bring 1½ cups water to a boil in a small saucepan. Tear 1 cup (packed; 180 g) Medjool dates in half and remove pits; discard. Place dates in a small bowl. Pour hot water over. Let soak until softened, about 10 minutes. Drain dates and transfer to clean food processor; discard soaking liquid. Add 2 Tbsp. vegetable oil, 2 tsp. ground cinnamon, and remaining ½ tsp. kosher salt. Purée, scraping down sides as needed, until smooth, about 4 minutes. (You should have about ½ cup purée.)Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 7Time to assemble the buns! Grease a 10\" cast-iron skillet with remaining 1 Tbsp. vegetable oil. Punch down dough, then transfer to a clean, unfloured surface and roll out to an 8\" square. Fold in half into an 8x4\" rectangle, then fold rectangle over itself to form a 4\" square (this is the same folding process you did before). If dough feels tough and uncooperative, let it sit about 5 minutes to relax and try again. Roll out dough to a 12\" square about ¼\" thick.Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 8Dollop date purée all over. Using a small offset spatula or spoon, spread evenly over dough, leaving a ½\" border without purée along edge farthest from you. Sprinkle remaining ¼ cup (packed; 50 g) dark brown sugar over purée.Step 9Starting at edge closest to you, roll  dough away from you into a tight log. Using a sharp serrated knife and long sawing motions, trim about ½\" of dough from both ends and discard. Slice log crosswise into 3 sections, wiping knife clean between slices. Slice each section crosswise into 3 buns (you should have 9 buns total that are each about 1\" thick). Transfer buns to prepared pan as you go. When you first place the buns in the pan, space them evenly. As they proof, the buns will start to touch (this is what you want so that when then bake they rise vertically in the oven.)Step 10Cover pan tightly with foil (or a domed lid if you have one) and place in a warm, dry spot. Let buns rise until they’re doubled in volume and spring back slowly when poked, leaving only a small indentation, 1–1½ hours, depending on how warm and humid your kitchen is. (If your kitchen is cold, you can let the buns rise in a turned-off oven with its light on.)Step 11Place a rack in middle of oven; preheat to 350°. Bake buns, still covered, until puffed, pale, and mostly set, about 20 minutes. Remove foil and continue to bake until golden brown, about 15 minutes if you prefer a soft and squishy bun and up to 25 minutes for a more toasted bun. Let cool slightly.Step 12Meanwhile, whisk ¾ cup (83 g) powdered sugar, 1 tsp. vanilla paste or extract, and remaining 3 Tbsp. buttermilk in a medium bowl to combine. (Vanilla bean paste will give you cute flecks, but extract offers the same flavor.)Step 13Brush glaze over warm buns (warm buns are key so that the glaze can soak into all the crannies) and serve from skillet.How would you rate Cinnamon-Date Sticky Buns?Leave a ReviewTell us what you thinkReviews (126)Back to TopTriangleVery good and easy with minimal active work.  Dough is best to mix by hand and comes together easily.  I added cardamom and vanilla to the dough. I couldn't find dates at my local grocery store, so I replaced them with 5 Larabars (flavor was Pecan Pie), ground up in the cuisinart.  Icing was made with a mix of buttermilk and yogurt, with plenty of salt and vanilla to offset the sweetness.    TovaChapel Hill, NC12/1/2021I love these rolls! I add a little turmeric to the dough to try and mimic the rolls from my favorite bakery, Sofra. I use my stand mixer with the dough hook instead of the food processor. I've made these in a pyrex pan but really prefer them in my 10'' cast iron for some great browning. I made them with a cream cheese frosting once (again to try and copy the Sofra rolls) and it was too much; the glaze in the recipe is perfect for me. Sometimes I also add a little cardamom in with the cinnamon.CeciliaCambridge, MA10/23/2021These buns are amazing! I have to agree with the other reviewers that you don’t need a food processor and that two tablespoons of sugar is lots. Yum. Lisa TCalgary, Alberta10/14/2021I loooove this recipe. I make it a few times a year and honestly don't even want to share. Thank you Sohla!maggieberkeley, ca9/23/2021Can't stop eating them! Super yummy and easy to make, my first time making any type of cinnamon roll/bun. My partner loved everything about them, but I thought the filling was a little bit sweet and would probably reduce the brown sugar to 2tbsp from 1/4 cup if I made them again. OliviaSydney, AUS7/31/2021I wish BA would clearly at the top write the amount of time everything takes and not make me read through everything multiple times to get a sense of how long it would take. I expected these to take awhile, but was thinking 2-3 hrs, not 8-24. I read this through last night but must have missed that single line and now I can’t make them for today - had they been clear up front I’d have started them last nightVictoriaCT1/20/2021Recipe calls for dark brown sugar but video shows light brown sugar, which is correct?Jim KNorth Carolina1/1/2021I was out to make orange cinnamon rolls, so I didn't use the date filling (which sounds great!), but instead a half cup of brown sugar, the zest of an orange, and probably a tablespoon of cinnamon. But the dough turned out great! Don't flour your board, lol!! I didn't use a food processor - easy to mix by hand.  I also got busy and so the second proof went another 24 hours, and they are SO good! Tender and gooey.  I thought there was going to be too much glaze, but it soaked right in.  (! subbed orange juice for the buttermilk in the glaze, in step with my theme.) I used a spring form pan, which made serving easy.  Perfect for Christmas morning, will definitely repeat next year!Bobby SLewisville, TX12/26/2020I too, like other reviewers, ended up with a broken professional grade food processor due to this dough, right before the holidays. Save your food processor and don't mix your dough in it. AnonymousSeattle, WA11/23/2020These are the first cinnamon rolls I ever make and they came out great. I subbed 1/2 tsp of cinnamon with freshly ground cardamom and it smelled heavenly. Since this is bread, I also used bread flour to great results; my dough was sticky (solved with oiled hands and bench scraper) but it had wonderful structure and elasticity. To cut the rolls, I found dental floss to be quite easy and mess-free. To do this, make light markings on your log identifying each roll. Then, cut a long string of floss and, with one end on each hand, carefully slide it under your log. In a swift motion, cross your hands over the log to slice it. Lift (the now cut) roll with your bench scraper and place on your greased skillet/pan. Lastly, I do not have a cast iron skillet, so I used a 9\" springform pan which fit the rolls perfectly (do use a baking tray or two under the pan in the oven to prevent the bottom for burning). Will definitely make again!armguzDominican Republic9/21/2020Loved these! So, so, so good. My dough wasn't too sticky, if anything it was worryingly rubbery, but they still turned out amazingly.  Urgh I already can't wait to make them again. \n\nThis was my absolute favourite of the series, but what an adventure it has been. Please do another series!Scotland9/13/2020These were definitely a labor of love, as other reviewers have mentioned, but I had no problems with the recipe and the buns turned out absolutely delicious. I even made them dairy-free by creating my own \"buttermilk\" — 1 Tbsp apple cider vinegar (white vinegar or lemon juice will also work) in a liquid measuring cup, then fill up to the 1 cup line with the milk alternative of your choice (oat milk for me). Yes, the dough was sticky. Yes, cutting the rolled-up dough into 9 slices gave me anxiety. But it was so worth the effort._kaoOakland8/10/2020Tasted great but so much work! Prob should have known that considering it's a recipe with yeast. Long process but the result is delicious.KatiehwalshAustin7/30/2020These were so awesome. My boyfriend \"hates\" dates and he loved these; they don't taste like dates, they just taste less terribly-sweet and more complex. I found the recipe straightforward and well-tested as everything went perfectly. I did use coconut sugar instead. I don't have a food processor so I just kneaded by hand. I prepped the night before and then baked the next morning for the most amazing weekend breakfast.natnatchiChicago7/30/2020These turned out so good! Making them was a long process. I didn't have a food processor so I mixed and kneaded the dough by hand and made the date paste in a blender. The dough was VERY sticky. It got a little better after kneading, but I still had to cheat and floured my counter and hands. I used yogurt instead of buttermilk in the dough, added extra cinnamon to the filling, omitted the salt in the filling, and used half and half in the icing. Took a long time but turned out delicious and I would definitely make again. Next time I may add some orange juice or zest to the icing for a little tang. AnonymousIndiana7/26/2020Explore Bon AppétitPastriesDateDried FruitFruitCinnamonHerbs & SpicesYeastOther IngredientsButtermilkNut-FreeBakingRamadanBreakfastBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-11", "author": ["Condé Nast", "Sohla El-Waylly"]}