{"id": "b84274b8e1957382cf7abd0a45923504", "url": "https://www.bonappetit.com/story/how-a-better-pan-can-make-you-a-more-adventurous-cook", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "How a Better Pan Can Make You a More Adventurous Cook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow a Better Pan Can Make You a More Adventurous CookThe easiest way to build more confidence in the kitchen is by using high-quality cookware.By All-CladSeptember 6, 2019FacebookTwitterEmailFacebookTwitterEmailCooking a new-to-you dish can be nerve-wracking: getting the timing right, making sure the sauce comes together properly, and hoping that it pops out of the pan at the end. But while there’s no way to know ahead of time if a recipe will turn out perfectly, using high-quality cookware can help safeguard against any potential errors as you navigate a new technique, ingredient, or cuisine, by giving you consistent, even heat, stick resistance, and little luxuries, like pour spouts.When you’re ready to take those next steps in the kitchen, here is the cookware—and recipes—that will help you do it with confidence.Crispy Skin, Not Crusted OnInstead of letting the rookie nerves get to you when you’re trying to master a new skill, have kitchen confidence with next-level stick-resistance. Cooking fish with crispy skin can be one of the most intimidating cooking tasks: non-stick pans won’t allow you to get the shatteringly crisp texture you desire, and other types of pans will cause that beautifully cooked skin to stick to the pan or tear when you lift the fish out—leaving some of the tastiest bits behind! Enter All-Clad’s stick resistant technology in the All-Clad D5 Brushed Stainless 10-Piece Set. The patented technology of five alternating layers of responsive aluminum and durable heat-diffusing stainless steel makes sure every speck of skin browns and crisps, while the interiors have stick resistance so you’ll be able to slide your spatula underneath, flipping the whole fillet in this crispy fish with brown butter sauce.Clean Pours for Killer CarbonaraHigh-quality cookware heats up evenly, so that you can be confident that the food around the edges will cook at the same speed as those in the center, and responds quickly to changes in temperature, both of which are so necessary for nailing the nuances of certain dishes. Spaghetti carbonara seems easy—it’s bacon and egg pasta, what could go wrong? But to make this renowned Italian specialty, there’s a lot of movement involved. You’ll want to start with a pan heavy enough to give you good browning on the guanciale without burning it, and light enough that you can easily pour off the excess fat—a step that will make you thankful for pouring lips on the All-Clad D5 Stainless 12\" Fry Pan. With the correct pan, you’ll be able to leave the fat right in the pan and keep it hot until you add back in the pasta and pasta water. The even, residual heat left from cooking will warm the egg mixture to just the right temperature resulting in the silky sauce that coats noodles and wows dinner guests.Control Your CaramelThere’s a reason that most people buy their ice cream—the process of making your own requires precise timing and impeccable temperature control. Making caramel is likewise a practiced skill involving heat changes at the exact right moment. That means that in this caramel ice cream recipe, you’re doing double duty on the most difficult part of the technique. Try using the saucepan from the All-Clad Copper Core 10-Piece Set: the five-ply construction gives you even, responsive heat, which means that you can stir your caramel and whisk in your eggs with confidence, adjusting the temperature as needed for that silky smooth ice cream texture that will remind you of all the reasons it’s worth the effort to make your own.Bake Outside Your Comfort ZoneTake your cakes around the world by experimenting with the textures you can get from different flours. Conventional wisdom will have you believing that one wrong move and your cake will look like something that should have the word “FAIL” stamped over its photo. But using All-Clad’s new Pro-Release Bakeware set means even a first-timer can nail a new recipe. And when you do make it, the durable ceramic-reinforced PFOA-free nonstick finish means that your cake will slide right out, so you can bake up a Greek-style crunchy-bottomed semolina cake without worrying that it will stick in the pan.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-06", "author": ["Condé Nast"]}