{"id": "b84461d38e1d1bfd8bc7a6324585ed53", "url": "https://www.bonappetit.com/story/best-vegan-ice-creams", "year": 2021.0, "month": 7.0, "day": 2.0, "content": "The 6 Best Vegan Ice Creams of Summer 2021, According to Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThe 6 Best Vegan Ice Creams of Summer 2021, According to MeWhether you’re Team Smooth or Team Chunky, there’s a pick in here for you.By Amanda ShapiroJuly 14, 2021FacebookTwitterEmailPhotograph by Isa Zapata FacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There came a point, sometime in late 2019 or early 2020, when the balance in the frozen aisle seemed to tip. In some parts of Brooklyn, anyway, vegan ice creams now outnumber the cow-made stuff. And unlike the ’70s era look that previously plagued these vegan options, the current roster of plant-based cartons looks goooood. But savvy branding doesn’t always equal delicious, as I must remind myself. I love an arbitrary food challenge, so I set out to try as many nondairy ice creams as I could get my spoon into. My freezer got pretty chaotic, but I persevered through the too hard, too watery, and too banana-y to find the best vegan pints out there. Whether you’re a fro-yo stan or an EVOO enthusiast or an eco-warrior looking to cut back on animal products, these have you covered.Sunscoop Vanilla Bean CreamI’ve said it once and I’ll say it again: This is the creamiest nondairy ice cream I’ve ever had straight from the freezer. This particular flavor is made with a coconut cream base and takes me back, waaaaay back, to when I lived a block from a Pinkberry and spent 50 percent of my grad student budget on cups of tart fro-yo with li’l mochi on top. Now I can spend $7 on this pint at the fancy bodega and feel young at heart.Photograph by Emma FishmanSunscoop$80 at Sunscoop (6 pints)$90 at Amazon (6 pints)$10 at Fresh Direct (1 pint)Runner-up: Toasted Coconut ButterWildgood MangoAs far as mouthfeel is concerned, Wildgood is a close second. And that makes sense, because Wildgood uses olive oil as the base in its fully nondairy line. If you’ve ever topped your soft-serve with EVOO and flaky salt, you’re probably as excited as I am about this new brand. I was expecting the savory undertones to work best with classics like chocolate and vanilla, but it was the mango I fell for. Have I become a “fruity ice cream” person after all these years?Photograph by Emma FishmanWildgood Mango$9 at WildgoodRunner-up: ChocolateCoconut Bliss Legendary Cookie DoughThe last time I tried Coconut Bliss, I was in my post-Pinkberry ~vegan phase~ and the packaging looked like that lower-back tattoo your friend got after her first yoga retreat. But now it’s 2021, I’m no longer vegan, and Coconut Bliss has rebranded its pints with bright Pixar-esque avatars! The only flavor I tried was cookie dough, and while I’m not sure if it reaches “legendary” status, it’s definitely the best nondairy version of the flavor I’ve tried. And in case you’re wondering, I’m definitely that person who meticulously digs out all the (oat-flour based) cookie dough bits with a spoon.Photograph by Emma FishmanCoconut Bliss Legendary Cookie Dough$6 at Fresh Direct$9 at Coconut BlissOatly StrawberryI didn’t think I liked strawberry ice cream until I tried Oatly’s silky pink number, but I’m a full convert now. The coffee flavor is ROBUST. The chocolate is more Hershey’s Milk than fancy dark, which is nice. The vanilla tastes like cold oats, and I’m not mad about it. What else is there to say? This Scandi brand is unstoppable.Photograph by Emma FishmanOatly Strawberry$8 at Fresh Direct$5 at TargetRunner-up: CoffeeN!ck’s Vanilj BeanN!ck’s branding makes me want to scream, “We get it! You’re Swedish!” The Oatly vibes, the “Swedish-style light ice cream” written prominently on certain labels, the insistence on calling the flavors by their Swedish names as if this were Ikea and not the frozen food aisle. As someone who is exactly one quarter Swedish, I feel that I can roll my eyes at all of this while also enjoying N!ck’s wholeheartedly. Yes, it’s “light ice cream” (including both vegan and non-vegan lines), but I believe there’s a time and a place for such things, like when you’re too busy screaming at the NBA refs to realize that you’ve eaten an entire pint. But while other light ice creams rely solely on sugar alcohols like xylitol, which make my digestive system unhappy, N!ck’s uses allulose, a lab-made version of a type of sugar that doesn’t cause insulin spikes, in addition to erythritol, and I haven’t noticed any digestive distress. As with all light ice cream, the more decadent options are bound to disappoint (Peanöt Butter Fudge is a shell of its full-fat, full-sugar self) but the vanilla—I mean *Vanilj*—is a refreshing delight.Photograph by Emma FishmanN!ck’s Vanilj Bean$75 at N!ck's (6-Pack)Runner-up: Strawbär KrämKIND Caramel Almond Sea SaltYou know them from airports, gas stations, and your mother’s pantry: America’s favorite mouthful of nuts in bar form now offers mouthfuls of nuts in ice cream form. The first ingredient is pear juice but I’m not complaining! These pints pay homage to their predecessors in terms of sheer quantity of nuts, so rejoice, people who like to chew their ice cream. (If you’re not on Team Chunky, try the strawberry flavor instead.) My favorite flavors were the ones that cut the nuts with swirls of caramel or peanut butter. These babies need a few minutes on the counter to get to a scoopable consistency, but they’re worth the wait.Photograph by Isa Zapata KIND Caramel Almond Sea Salt$7 at InstacartRunner-up: Dark Chocolate Peanut ButterExplore Bon AppétitShoppingIce CreamVeganRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-14", "author": ["Condé Nast", "Amanda Shapiro"]}