{"id": "b87d0666026f8f600efb1645ade29919", "url": "https://www.bonappetit.com/story/how-to-cut-an-onion-any-which-way", "year": 2021.0, "month": 5.0, "day": 3.0, "content": "How to Cut an Onion, With Videos for Thinly Slicing, Dicing, and Cutting Into Rings | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Cut an Onion (With Videos, Thank Goodness!)Finally, directions you can understand.By Sarah JampelMay 17, 2021FacebookTwitterEmailPhoto and Food Styling by Emma FishmanFacebookTwitterEmailCutting an onion can feel like trying to escape a maze, blindfolded. One wrong turn—or slice—can send you swiftly down the wrong path. And then there are all of the different verbs—you can slice an onion, chop an onion, dice an onion, cut an onion…. What is all what?! We say: Enough already! Let these step-by-step photos show you how to cut an onion, once and for all. Whether you need half-moons or slivers (scroll down to see the difference!), a rough chop or a fine one, we’ve got you covered.How to make half-moonsHalve the onion from top to root. Trim the top, leaving the root end untrimmed. Peel. Slice crosswise from top to root end. FYI: When a recipe calls for a “thinly sliced” onion, this is what it means.How to make slivers (a.k.a. french cut, frenching, julienne)Start like you’re making half-moons, but trim the root end too. Then, instead of slicing from top to root, slice lengthwise, from right to left, at an angle. This makes shallower, more delicate arcs, great for scattering over focaccia or pickling. Some people also prefer this style of cut for caramelizing as the onion pieces are more uniform in thickness and therefore cook more evenly. How to coarsely chop or dice (a.k.a. finely chop)Starting with peeled onion halves with root ends untrimmed, make your first set of slices parallel to your cutting board, moving up from the board toward your hand, which is holding the onion in place. Make a second set of cuts perpendicular to those, going lengthwise from the top of the onion to the root end. Make the final set of cuts, this time crosswise from top to root—you’ll come away with neat cubes. To turn this into a fine chop, either make more slices in each round or go over your pile with your knife once or twice after you’ve finished.How to finely chop, animal-styleWhen you’re looking for onion pieces that will practically disappear into a sofrito or bialy filling, skip the painstaking dice. Instead, grab your box grater. In a mere matter of seconds, your halved, peeled onions will be reduced to fluffy shreds. Run your knife through the pile to eliminate any larger pieces that escaped the grater, then get to cooking. Because the grater breaks down the onion more aggressively than a knife would, your pieces should reach a jammy, melting consistency in less time.How to slice ringsTrim the top of your onion, then peel. Next, create a stable surface by trimming a small piece from one of the curved sides to make a flat plane. Slice crosswise into circles. Only one thing left to do: Batter and fry.Photo by Emma Fishman, Food Styling by D'mytrek BrownChop, chop!Lemony Lentils and Rice With Caramelized OnionsThis recipe is inspired by mujadara, a simple combination of lentils, rice, and onions that exists in various forms across the Middle East. It's comforting but not too rich, and it's fresh and vegetarian without relying on many perishable ingredients. In other words, it's the perfect meal for the nights in between holiday parties.View RecipeExplore Bon AppétitKnife SkillsOnionRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-17", "author": ["Condé Nast", "Sarah Jampel"]}