{"id": "b8a7d9f7a9f38759d1f6a9095c0a0106", "url": "https://www.bonappetit.com/recipe/pickled-rice-tabbouleh", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Pickled Rice Tabbouleh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2019 IssuePickled Rice TabboulehBy Cortney BurnsJanuary 8, 20191.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex LauEmailPinterestPrintEmailPinterestPrintPickle brine lends a distinctive tang to the rice, giving the whole dish a nice, lively jolt. This recipe can work with any kind of pickling liquid, even the ordinary stuff from a jar of pickles or cornichons (we tested it with a few kinds). If brown rice isn’t your thing, use another grain: Try barley, farro, or freekeh.Ingredients4 servings Sauce6garlic cloves⅓cup plus 3 Tbsp. extra-virgin olive oil½cup cilantro leaves with tender stems⅓cup raw pumpkin seeds (pepitas)½serrano chile, chopped3Tbsp. fresh lime juice1Tbsp. pumpkin seed oil (optional)Rice and Assembly1½cups short-grain brown rice12x2\" piece dried kombu (optional)Kosher salt½cup pickle brine, divided½cup finely chopped tender herbs (such as cilantro, parsley, dill, and/or tarragon)3Tbsp. extra-virgin olive oilZest and juice of ½ lemonFreshly ground black pepperPreparationSauceStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Cook garlic and ⅓ cup olive oil in a small saucepan over medium-low heat, stirring occasionally, until garlic is soft enough to easily smash against the side of the pan, 12–15 minutes. Let cool.Step 2Meanwhile, toast pumpkin seeds on a large rimmed baking sheet on upper rack, tossing occasionally, until golden brown, 8–10 minutes. Let cool.Step 3Blend cilantro, pumpkin seeds, chile, lime juice, pumpkin seed oil (if using), and garlic oil (with garlic) until smooth. Add a big pinch of salt and blend again.Rice and AssemblyStep 4Place rice in a sieve or colander and rinse under running water until water runs clear (this removes surface starch and keeps rice from getting gummy). Combine rice, kombu (if using), and 2 cups water in a medium saucepan; season with salt and let sit 20 minutes.Step 5Bring rice to a boil, then reduce heat to low. Cover pan and cook until rice is tender, 30–35 minutes (you can also use a rice cooker; follow instructions for correct timing). Remove pan from heat and let sit (still covered) 15 minutes; fluff rice with a fork.Step 6Transfer warm rice to a large bowl and stir in ¼ cup brine. Let rice cool completely, then toss in herbs, oil, lemon zest and juice, and remaining ¼ cup brine; season with salt and pepper. Serve with sauce drizzled over.How would you rate Pickled Rice Tabbouleh?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladCilantroHerbs & SpicesParsleyDillTarragonRiceRice & GrainsSideVegetarianDairy-FreeVeganGluten-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-08", "author": ["Condé Nast", "Cortney Burns"]}