{"id": "b8d037cdccd7858f265e89988c5ca2f1", "url": "https://www.bonappetit.com/story/100-lunch-ideas", "year": 2021.0, "month": 2.0, "day": 4.0, "content": "100 Packed Lunch Ideas for Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking100 Lunch Ideas on What the Heck to Pack for WorkAre you in a lunch rut? We can help you out.By Alyse WhitneyFebruary 25, 2021FacebookTwitterEmailGentl & HyersFacebookTwitterEmailMany things in the office (virtual or otherwise) don’t go as planned. But coming up with excellent lunch ideas for work doesn’t have to be one of them. It’s just thinking ahead! That’s all lunch is. Keeping this list bookmarked, pinned to your corkboard, or saved as your desktop background (cute!) means that come midday you’ll have one less thing on your to-do list. Monday is a virtuous bowl of crunchy veg drizzled with peanut sauce eaten on a sunny stoop. Wednesday: an open-face caprese sandwich situation al desko. Friday: a warm glass of milk and a lie down. (Or a supremely easy-cheesy quesadilla and a cold one in the park.) If conjuring packed lunch ideas—yes, all of these recipes are geared to travel, or at least, stick around in the fridge and get better—isn’t part of your job description, consider this ‘upskilling.’\\A Big Ol' Bowl That'll Keep You Full for HoursOh, yeah, there's ranch dressing here.\nAlex Lau1. Chicken and rice bowl with gochujang ranch2. Top rice with roasted broccoli and pesto. Roasted broccolini is also great in this Brassicas Bowl (there's hummus in there!)3. Brown rice and crunchy veggie bowl with peanut sauce.4. Mixed roast vegetables with nutritional yeast + grains + miso-ginger turmeric dressing and plain Greek yogurt.5. Lentils, garbanzo beans, and barley with garlic, shallots, and harissa.Make a big batch of rice, farro, or quinoa—then have fried rice all week.\nAlex Lau6. Kimchi fried rice made with leftover grains (pictured above).7. Roast salmon for dinner, then use it to top grains and sautéed kale.8. Crispy corn + chickpeas with miso-jalapeño tahini.9. Easy falafel fritters with yogurt sauce and cukes.10. Acai bowls definitely aren't just for breakfast.Sandwiches That Aren't Just PB+JA pork sandwich with lots of cheese.\nPhoto by Laura Murray, styling by Judy Mancini.11. All of these ideas from chefs when they’re feeling lazy.12. Stacked California veggie sandwich.13. SALADWICH! Salad + bread = healthyish.14. Ricotta + smoked salmon + red onion. Cream cheese would be okay here too. With a bagel.15. Caprese situation with mozzarella + prosciutto + pesto + tomato.Pecan-Miso Butter and Jelly! Genius!\n16. PB+J, preferably toasted. Go classic, or upgrade with pecan-miso butter and homemade jelly (above).17. Make simple tuna salad or egg salad at your desk with packets of mayo and mustard.18. An Italian hero loaded with meat... or a vegetarian version that is pretty satisfying.19. Green Goddess crunch sandwich.20. Cold cut of your choice + cheese + too much mayonnaise + add the tomato at the office so it's not soggy + potato chips inside + Tupperware of pickles on the side.Snacky Things You Can Throw TogetherRicotta with herbs is like a single-serving cheese plate.\nPhoto by Alex Lau, Styling by Sue Li21. Fluffy ricotta, olive oil, red pepper flakes, and some herbs or vegetables on top.22. Full-on desk picnic! A little cheese (sharp cheddar or Parm), salami, a hunk of bread, and some apples or grapes.23. Bulgogi + whatever you're feeling: wrap, salad, rice bowl, bowl of meat, etc.Wasa to the rescue.\nMichael Graydon + Nikole Herriott24. Wasa crackers + smashed avocado + salt + sriracha.25. Curried peanut dip with whatever you have in the fridge (jammy eggs, rotisserie chicken, last-night’s sweet potato, cucumber wedges, etc.)26. Lazy quesadilla: tortilla microwaved with cheese inside.27. Inari sushi—little Japanese tofu pockets stuffed with seasoned rice and either fish, meat, or vegetables.28. Hummus with olive oil drizzle and at least three minimally crunchy things for dipping.29. Toast with whatever you keep at your desk, like nut butter, jam, or tahini.30. Pita + yogurt with some microplaned garlic and salt + a mint for afterward.Ways to Make Vegetables Seem Moderately AppealingEat chickpeas in a bowl, with vegetables, on toast, or even with noodles.\nAlex Lau31. Big batch of herby crispy chickpeas with yogurt and pita.32. An entire bunch of Tuscan kale that you sautéed before work somehow, sprinkled liberally with garlic salt. Add rice and protein of choice.33. Kale Caesar salad so it doesn't get super soggy.34. Panzanella, aka BREAD SALAD.35. Just...a ton of roasted vegetables.36. Whole roasted sweet potato + chorizo + rice. Or just butter + chives + salt.37. Make-ahead marinated lentils with broccolini and feta that gets better in the fridge and lasts alllll week.38. Chopped salad (dressed al desko so it doesn't get soggy).39. Green beans and cucumber with miso dressing.40. Greek salad: cucumbers, tomatoes, feta, olives.Leftovers That Don't Taste Like Giving UpLarb is crispy for dinner, but reheats well the next day.\nLinda Xiao41. Ground chicken (or beef or lamb) larb, but over rice instead of fragile lettuce cups.42. Chorizo with tomatoes and chickpeas. Greek yogurt swirled in if you remember to pack it.43. Pan-roasted chicken thighs. Simple salt and pepper, harissa, whatever you want. Serve with rice and greens.44. Five-ingredient soboro beef. No rice? Use tortilla chips to dip in it.45. TACO BOWLS!46. Make a big ol' lasagna. Cool, cut into squares, and freeze individual portions in Ziploc bags. Thaw in the fridge overnight, then microwave at the office.47. Zucchini and eggplant bake, portioned and frozen like lasagna.48. Mac and cheese works, too.49. Make a ton of roasted pork shoulder and use in sandwiches, salads, soups, or bowls.50. Enchiladas! Microwave at work and see who your real friends are.Pasta! Noodles! We! Love! Carbs!We're halfway there, so it's pasta time. Try veggie Cacio e Pepe.\nAlex Lau51. Roasted veggie Cacio e Pepe.52. Pork and bean pasta.53. Old-school pasta salad: Italian-style dressing, chopped veg, probably fusilli, maybe cubed cheese.54. Korean japchae, made with glass sweet potato noodles.55. Sausage, greens, and beans pasta.These cold noodle salad recipes are envy-inducing.\nPhoto by Alex Lau, Styling by Monica Pierini56. Cold noodle salads made with ramen, rice noodles, or soba.57. Stir-fried udon with pork and vegetables.58. One-pot baked pasta with sausage and broccoli rabe.59. Spaghetti and (weeknight) meatballs that you reheat carefully to prevent splattering.60. Boxed macaroni and cheese with cut up hot dogs. YEAH.Make That Rotisserie Chicken Work For YouRepurpose that chicken for a nice salad with miso dressing.\nAlex Lau61. Just...eat leftover rotisserie chicken. Or roast an easy one!62. Shredded chicken salad with creamy miso dressing.63. Chicken salad, as in chicken + mayonnaise + mustard + celery + salt + pepper (at minimum).64. BBQ chicken pizza: pickled onions, blue cheese, BBQ sauce.65. Mexican-style pizza: salsa verde, jalapeños, monterey jack cheese, chicken. Psst, make an extra pizza and freeze it for later!66. Fried rice with chopped up chicken.67. Summer rolls with chicken, shrimp, or both.68. Skillet chicken pot pie!69. Chicken and dumplings.70. Chicken and black bean tacos (or whatever fixins you like).Souper Duper ComfortMake big batches of soup or chili (like BA's best!) any time of year.\nAlex Lau71. Beef chili! Or chicken chorizo chili!72. Lentil soup with lots of vegetables and canned tomatoes.73. Celery soup (just try it!)74. All forms of tomato soup, like salmorejo or roasted tomato soup.Miso life.\nLaura Murray75. Instant miso soup: 1 spoonful of miso, add hot water. Doctor up with any greens in the house, scallions, sautéed cabbage, silken tofu, six-minute egg, seaweed snacks, furikake, or corn.76. Make any soup + pack in thermos + finish with lemon juice, olive oil, and something crispy.77. Green minestrone with pesto.78. Tortilla soup.79. Borscht, but if you're lazy, just cube beets and don't purée.80. Chicken stew with beans and dried cherries.Eggs Aren't Just for BreakfastHakuna frittata!\nAlex Lau81. A frittata with anything in your fridge. (We like this summer squash one.)82. Hard-boiled eggs smashed onto crackers with salt.83. Soft-boiled eggs—reheated in a cup of hot water so they're still runny—on toast.84. A breakfast sandwich that you're okay eating cold.85. Salmon niçoise salad.86. ELT sandwich.87. Quiche, which is good microwaved or cold.We have so many overnight oats ideas.\nAlex Lau88. Savory overnight oats or grits with an egg on top.89. A DIY protein pack with hard-boiled eggs, nuts, and some meats and cheeses.90. Scrambled eggs + ham + cheese wrapped up in a tortilla and microwaved.Desperate Times Call for Desperate LunchesWhat if you just ate these cashews for lunch?\nPhoto by Laura Murray91. Tupperware of sambal cashews, an apple, and yogurt because you forgot to grocery shop.92. A bag of Chex Mix and a banana.93. Tortilla with canned refried beans you pry open at your desk + shredded cheese melted together in microwave.94. Microwaveable packet of rice + olive oil + salt + pepper.95. Lettuce wrapped around lunch meat, dipped in hummus.96. An old doughnut sitting in the office shared kitchen.97. A can of soup that you try to make better with a drizzle of olive oil.98. Granola bar, wilted salad you brought in yesterday, and coffee.99. Steamable frozen bag of vegetables with a Parmesan + red pepper flake sprinkle.100. Triscuits and a block of cheddar. (Okay, no, that's the dream.)This sandwich will make lunch better:Explore Bon AppétitLunchLunch al DeskoMeal PrepSoupSaladSandwichRead MorecultureThe Crippling Problem Workplaces Are Facing: Not Enough Lunch DessertBy Alex Beggscooking5 Meal Prep Upgrades So You Can Have Healthier Lunches All WeekBy Alyse Whitneycooking55 Healthy Lunch Recipes and Only Some Are SaladGallery55 SlidesBy Anya Tchoupakovrecipes19 School Lunch Ideas That Are Healthy (Mostly)Gallery19 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-09-11", "author": ["Condé Nast", "Alyse Whitney"]}