{"id": "b8d33b4c3849c314a7765b1fdd7c0e69", "url": "https://www.bonappetit.com/story/missing-the-kitchen", "year": 2019.0, "month": 5.0, "day": 5.0, "content": "I've Been Missing the Kitchen | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI've Been Missing the KitchenSummer cooking recommendations and other thoughts from Healthyish editor Amanda Shapiro.By Amanda ShapiroMay 30, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie Theodorou, Prop Styling by Aneta FlorczykFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish readers,I admit I’ve been lax on the whole cooking thing recently. Now that it’s finally warm-ish in New York, I’ve been out and about a lot more, which means “dinner” might entail an 11 p.m. sabich at Queen of Falafel, a heavy graze at a park barbecue, or a Japanese sweet potato smothered with peanut butter, eaten at my kitchen counter at some absurdly late hour.That’s cool. I’ve gone through this ebb and flow enough times to know I’ll always come back to the kitchen, and luckily I have a job that’s constantly tempting me there. Today I’m eyeing Chris Morocco’s recipe for perfectly seasoned sushi rice with miso-caramel glazed salmon. It’s a dream recipe for people like me, who always wish their sushi came with more of that sweet, salty, sticky rice. I’ve also sworn to make Andy Baraghani’s asparagus stir-fry before it’s too late, and Christina Chaey’s spicy chicken lettuce wraps are the rare dish I could actually see myself throwing together after a long night out.Perfect fish, perfect rice.\nPhoto by Emma Fishman, Food Styling by Susie TheodorouI’ve also been salivating over the June/July grilling issue. I don’t have a grill these days, but I’m collecting friends who do and plying them with bottles of pét-nat in the hopes that they’ll let me grill swordfish or soy-sauce flank steak or summer squash with feta or turmeric-mojo shrimp. I want to try these jalepeño-marinated pork chops with the Superior Farms lamb chops I have in my freezer. And, on the side, I’ll be converting all you honeydew haters with this nutty, gingery melon salad.I’d love to claim that I have #dessertgoals too, like Claire Saffitz’s cherry biscuit cobbler, but the truth is you’re more likely to find me in line at the Mister Softee truck than rolling out biscuit dough. I’ll get back in the kitchen soon, but I can only promise so much.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead Morecooking55 Healthy Grilling Recipes to Make This SummerGallery65 SlidesBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-30", "author": ["Condé Nast", "Amanda Shapiro"]}