{"id": "b8da13c88e311953525220d0f4d09676", "url": "https://www.bonappetit.com/story/ramen-heads-documentary", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Watch a Clip from ‘Ramen Heads,’ a New Documentary for Food Obsessives | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWatch a Clip from ‘Ramen Heads,’ a New Documentary for Food ObsessivesThis film is as satisfying as a bowl of ramen.By Alyse WhitneyMarch 12, 2018FacebookTwitterEmailChristopher TestaniFacebookTwitterEmailThe only “cuffing season” I’m concerned with is me and a bowl of warm, comforting ramen. I’m always searching for the next best slightly-funky miso, rich pork tonkotsu, or soy sauce-based shoyu. While watching the new ramen documentary Ramen Heads, I found all three—and much more.A simple bowl of ramen only requires five ingredients.\nRamen Heads (which opens in select theaters March 16) mostly centers around Japan’s “reigning king of ramen,” Osamu Tomita, whose Matsudo shop, Tomita Ramen, draws five-hour lines until sold out regularly. He’s obsessive with the quality of his ingredients and shares some of his trade secrets with first-time director and ramen enthusiast Koki Shigeno throughout the film, like the grueling process of mixing three different days’ worth of broths to make the perfect blend for each customer and making “the best 100-yen eggs in Japan.” Tomita also guides viewers through his favorite shops in Japan—including one of the only female ramen masters, Kumiko Ishida of Ramen Ichufuku—to highlight how varied each bowl of ramen can be with different broths and styles of handmade noodles. There’s a meditative quality to watching the painstaking attention to detail, and super slowed down close-ups of broth may hypnotize you.The opening scene in the film is the most captivating, showing a journey through the back alleys leading to Ramen Ichufuku in Hatsudai, and then into the bustling restaurant at noontime, where customers slurp noodles and broth quickly. (Watch the exclusive clip below.) The rapidfire assembly and then consumption of a bowl is in stark contrast with the long broth-making process, which can take at minimum 8 hours and up to multiple days. This introduction explains that really great ramen is consumed quickly but crafted carefully so that it renders both the person eating and the person watching the scene unfold speechless.ContentThis content can also be viewed on the site it originates from.“The ultimate ramen is something that exists perfectly in the moment and then disappears,” says renowned ramen Chef Shôta Iida at the end of the clip. After watching this documentary, I ran to nearby Ramen Shack in Long Island City and made a bowl of Chef Keizo Shimamoto’s black garlic tonkotsu disappear. Ramen satiates a need for salt, warmth, carbs, and deep comfort all in one complex bowl. The “ramen heads” featured in this documentary are relatable not because I feel like I can emulate what they do, but because I understand the obsession and search for the next great bowl of ramen. This film raises the bar for what I expect in every bowl of noodles, and I hope it will inspire the same excitement for you.See Ramen Heads in NYC and LA starting March 16. It will expand into more cities through May.Some of our favorite bowls of ramen Stateside:Explore Bon AppétitRamenJapanesePop CultureMoviesJapanNoodleRead MorerestaurantsEverything You Need to Eat in Kyoto, from Chicken Skin to Tofu Ice CreamBy Carey PolisrestaurantsOur Ramen Changed Texas, and Texas Changed Our RamenBy Tatsu Aikawa and Takuya Matsumoto cultureInside the Sun Noodle Factory, Ramen Suppliers to Momofuku, Ivan Orkin, and MoreBy Mallory StuchinrestaurantsYour Next Great Bowl of Ramen Is Right Around the CornerBy Amiel StanekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-12", "author": ["Condé Nast", "Alyse Whitney"]}