{"id": "b8dc5a15b3bfa39d1f0100ca818dc8c1", "url": "https://www.bonappetit.com/story/what-is-cbd", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "What Is CBD, and Why Is It in Everything Right Now? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhat Is CBD, and Why Is It in Everything Right Now?You know it as the ingredient taking over the wellness world, but what is CBD, really, and is it right for you?By Aliza AbarbanelFebruary 14, 2018FacebookTwitterEmailPhoto by Alex Lau, Styling by Emily EisenFacebookTwitterEmailThis story is part of the Healthyish Pantry, a collection of articles breaking down the ingredients we love most. Click here to read the whole guide—then stock up.2017 was the year that weed went mainstream, and the \"green rush\" struck gold. But, while recreational marijuana is still technically illegal in most states, an industry has blossomed around CBD, a compound that's found in marijuana but legal to sell (in most forms) on its own. Presented in hyper cool packaging—and bolstered by hundreds of rave reviews—CBD supplements have captured the imagination of the wellness world. But what is CBD, exactly, and what’s the most effective way to use it? Here's what you need to know.Okay, what’s CBD?CBD is a non-psychoactive cannabinoid compound found in marijuana—and legal in 43 states. The cannabis plant contains at least 80 chemical compounds called cannabinoids. You’re probably already familiar with THC, the cannabinoid that prompts the psychoactive effects commonly associated with marijuana, like euphoria, relaxation, and, of course, the munchies. CBD is another cannabinoid, but, unlike THC, it's not psychoactive. This is the source of CBD’s popularity: the ability to provide some of marijuana’s therapeutic effects without the high.What are the benefits of CBD?Scientific research on marijuana is still limited, and CBD is no exception. Still, dozens of studies have found evidence that CBD can treat epilepsy, act as a therapy for schizophrenia, and alleviate joint pain, among other illnesses. “Many of my pediatric epilepsy patients are getting significant seizure reduction with ingested whole plant CBD oil,” says Dr. Bonni Goldstein. Dr. Goldstein is a former Chief Resident at Children’s Hospital of Los Angeles; she now runs L.A. medical cannabis practice Canna Centers and acts as a medical advisor for Weedmaps.“Many adults are finding relief of pain, better mobility due to less inflammation, and less anxiety and depression.”How is CBD made?CBD can be found in cannabis sativa (weed) and industrial hemp, a legal variety of the plant grown for paper, textiles, and non-dairy milk. The ability to extract CBD from industrial hemp has made it possible to sell CBD products across state lines—not just in states with legalized marijuana. The compound is currently legal in 43 states, and it’s currently up for debate in states like Texas and Indiana.Also, CBD's purported effects of reducing stress and anxiety have prompted many to adopt it as a wellness supplement. “CBD is like taking a daily dose of well being. You’re going to be a little bit more calm, a little bit more centered, and you know that you’re going to be able to function,” says Jewel Zimmer, founder of boutique cannabis company Juna. “It’s like the adaptogen of all adaptogens, the superfoods of all superfoods—and we’re learning more and more every single day.”Some of the many CBD products on the market\nPhoto by Alex LauHow can you take CBD?As people cash in on marijuana’s increasing legalization, the market is flooding with new CBD products. The options are truly dizzying, from chocolates and capsules to vaporizers and sublingual oils like Charlotte's Web Hemp, which are placed under the tongue to quickly diffuse into the bloodstream.\nUnsurprisingly, the dessert market has CBD cornered. There are an abundance of options, from CBD/THC blend chocolate bars to foraged Icelandic berry CBD gumdrops inspired by the music of Sigur Rós.CBD is also becoming a popular ingredient in products like skincare and lotions, from pain-relieving CBD bath bombs to body lotions like Cannuka, which pairs CBD isolate with Manuka honey.What you should know before buying:Some medical experts say that CBD derived from industrial hemp (as opposed to marijuana) is less potent, but it’s still possible to feel the effects from these products. \"As a rule, I do not recommend industrial hemp as medicine,\" says Dr. Goldstein. \"That being said, there are some “hemp” products on the market that, when tested, show that they contain medicinal amounts of cannabinoids and terpenes, albeit with very low THC that allows for the “hemp” designation.\" Really, the best course of action is to do some research. Check to make sure the company has a listed medical advisor, and don’t be afraid to ask for test results that show the cannabinoid content before purchasing a CBD product.With so many choices, it’s important to consider a few things before purchasing a product. It is possible to feel the effects of CBD right after consumption, but most products are meant for long-term use. Weigh your options: inhaled CBD is felt quickly but fades much faster than sublingual and ingested products. If you’re looking for a daily supplement with slow-releasing effects, ingestible products with clearly marked dosages like capsules or edible oils are easy to integrate into your daily routine. And as bars across the country start serving up CBD-laced cocktails, happy hour just got a whole lot happier.Explore Bon AppétitHealthyishCannabisRead MoreshoppingMondo Cannabis Powder Is Weed Made for Taking at WorkBy Brad LeoneRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-14", "author": ["Condé Nast", "Aliza Abarbanel"]}