{"id": "b8e2938dc5e4b2ae6e301c1de9042eee", "url": "https://www.bonappetit.com/story/glory-edim", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Glory Edim, Well Read Black Girl Founder, on the Stories That Change the World | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleGlory Edim on How Eggs Fuel Her Mornings and How Stories Change the WorldThe founder of Well-Read Black Girl defines herself more as an artist than an entrepreneur.By Ali FrancisNovember 27, 2018FacebookTwitterEmailPhoto by Kirby ElliotFacebookTwitterEmailIn Entrepreneurs Run the World, we get advice and insight from game-changing founders with big ideas. This week we talked to Glory Edim, creator of Well-Read Black Girl—a book club and festival celebrating the interior lives and identities of Black women. Edim recently published Well-Read Black Girl: Finding Our Stories, Discovering Ourselves, an anthology of essays by black female writers.“I think there are so many spaces where Black women are undermined and their stories are not valued, and if I can change that through a book, perhaps I can change that in a political election,” Glory Edim tells me over the phone, equal parts exuberant and composed. Edim is  the founder and creator of Well-Read Black Girl (WRBG)—a community celebrating Black literature and sisterhood. It started as a book club in 2015, with author Naomi Jackson and poet Natalie Diaz among the first attendees. In 2017, Edim organized a WRBG Festival, featuring writers like Jacqueline Woodson, Tayari Jones, and Rebecca Carroll (“foremothers of the Black women’s canon”). And this month she published and curated a collection of inspiring essays by Black women writers.But for the former digital strategist—she’s worked with Kickstarter, The Webby Awards, and the New York Foundation for the Arts—it all started with a t-shirt gifted by her boyfriend. “It said those words on it, ‘Well-Read Black Girl,’” Edim recalls. “And that became my first Instagram post of May, 2015; there's probably like 60 likes on it.” (She’s humble, it’s 65.)We chatted with Edim about her love for the humble egg, embracing imperfection in business, and why she’d prefer you call her an artist, not an entrepreneur.Beyond becoming the best shirt ever printed, what do you intend the words “Well-Read Black Girl” to symbolize?I want them to call people to action: Pick up a book, any book. It doesn't have to be that you need to read Shakespeare to be well read. You can read anything that empowers you and informs you to transform your personal world and the world around you.From that first Instagram post, how did WRBG develop?I wanted to make the idea more robust; to not just exist on Instagram. So I started writing and sending a regular newsletter in July of 2015. My first newsletter had a really simple message: \"Hey, books have really shaped my life, and I'm looking to start a book club and talk to more friends.\"You're like, \"Just putting it out there if anyone wants to chill?\"[Laughs.] Right. So I started doing that and then had the first actual book club in September of 2015 with Naomi Jackson. I met Naomi at a bookstore during one of her signings. I showed her my Instagram, which at the time probably had less than 100 followers. And she came. Like she came to the book club and brought Natalie Diaz with her. Natalie had just won the MacArthur Genius Award. I want to say there were ten women there. We sat in the garden space of Friends and Lovers, the bar in Brooklyn, and just talked. From there, the meetings grew bigger and bigger, and the conversations with the writers grew even richer. Then we had our first festival in 2017, and our second just happened this November.And now your book is out! Can you explain a bit more about the anthology? What can we expect from that?I like to think of it as an access point for people to experience what it's like to be in the book club. The essays range from feminist activist Barbara Smith talking about her first encounter with James Baldwin all the way to Lynn Nottage explaining the first time she read The Color Purple and what inspired her to build her craft and become a playwright. They feel like very close, intimate stories. It really embodies the essence of Black womanhood and identity.Have you found any time throughout all that to stay active?I am a big fan of spin.  I like the movement and the pace of it, the quickness. I do SoulCycle but also other things. I'm not, like, a diehard. I'm on the fringe. And I like to go for walks.What about downtime? What does a perfect day off look like for you?Going to a restaurant in the morning and having a lovely breakfast, then spending some time in a cafe reading, or maybe going to see a film with my partner. Good food, good company, good entertainment. I'm really simple.How do you stay productive? When and where do you do your best work?Unfortunately I'm such a night owl that I can just burn the midnight oil. But if I do work until 3 a.m., I sleep until nine and then wake up and start my day.What type of things do you eat on work days (or nights)?Oh, man. I have a weird obsession with eggs. I love making omelets with veggies. Or breakfast tacos. I live for a good breakfast taco. I love fruit and am a big berry person. So depending on what's in season, blackberries or raspberries are my favorites. Avocados, too.When you take a step back and look at what you’ve built, can you identify your “why”— the reason you’re dedicating your life to WRBG?I believe strongly in the potential of stories to change the world. The things that we read can really encourage and support activism. And I really think it's important to tell the stories of black women across the diaspora and share our identities. Everything I do is really about supporting the stories of Black women and making sure their voices are amplified and that they're rewarded for the hard work they do in the world.How much of you is your business?I have constantly been on this search for creative meaning and defining who I am. And so much about what has developed and grown from Well-Read Black Girl is a very clear personalized identification of who I am in the world. That’s why I'm kind of leaning away from the word entrepreneur and sitting with the word artist more. Because when you think of being a business, the bottom line becomes really important. It becomes about being scalable and making a profit.And that's not your end goal?My end goal really is to build up and help the women and the young girls in my community. And when I say my community, I mean the Black community. So I think I'm operating in a different mode than maybe someone with a traditional startup. There was a lot of organic interest and support through the Instagram feed. But it wasn't necessarily me thinking, \"Oh, I want to turn this into a business.\" So I'm learning. And it's really been a story of growing into my role and understanding things like operations, finances, and taxes.Did you have any relevant examples from which to model your business?Most of my professional ideals come from cultural institutions, like theaters. I'm on the board of Housing Works, and I love how they operate. They’re really the best in terms of how they generate revenue for the community and have a very feel-good mission around helping those affected by HIV and AIDS.What’s been the most personally rewarding part of building WRBG?It’s been so amazing to see the power of people believing in you before you even believe in yourself. I'm like, \"I don't know what I'm doing,\" to my editor and my mom, and everybody else is like, \"You're fine.\"What advice would you give to other artists and entrepreneurs struggling with similar feelings?Just keep moving. Keep moving away from perfection in favor of process. Keep working even when the thing that you're working on seems imperfect, for lack of a better word. Even now, so many things that I'm still working through, they're not perfect at all. I can't spell, I'm not going to be grammar queen, and people are probably like, \"How is she even a Well-Read Black Girl?” But I just put it out there, and I'm okay with the consequences of being a little messy in public.Buy Well-Read Black Girl: Finding Our Stories, Discovering Ourselves, $14All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishEntrepreneurs Run the WorldInterviewsRead MoreLifestyleMonk-Turned-Tech-Mogul Andy Puddicombe Still Eats the Same Breakfast Every DayBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-27", "author": ["Condé Nast", "Ali Francis"]}