{"id": "b8f3eb0d01249e89736de6985a6a086e", "url": "https://www.bonappetit.com/story/grocery-store-etiquette", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Grocery Store Etiquette: Is It Ever Okay...to Bring 11 Items to the 10 Items or Less Aisle? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...to Bring 11 Items to the 10 Items or Less Aisle?Solicited advice from Alex Beggs on how to behave at the grocery store.By Alex BeggsFebruary 19, 2020FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Can I remove individual items from a pack, like one can of beer or a single pudding cup...? —Lives-Alone LennyFirst you should know that it often costs more per unit when you do this. But stores have different policies, so ask before you crack into a sixer of Kozy Shack. And what’s the worst that would happen if you got the whole case? You’ll make some friends, Lenny. Make some friends.What do I do with a piece of produce I dropped on the floor? —Butterfingers BobbiPut it back in the pile or add it to your basket. If it’s a more delicate item, like an avocado, take it to the customer service counter or hand it to the nearest store employee. Too embarrassed? Buy it and bury it in the backyard and hope an avocado tree grows as a reminder of your flaws. Or, I dunno, eat it???Illustration by Cari Vander YachtWhat’s your stance on sampling grapes or little snickety snacks from the bulk bins, etc.?—Quality-Control QuincyYou can have ONE grape. Not a whole cluster. I’m looking at you, Andy Baraghani! I don’t care if you just came from the gym and are bulking up! On grapes! If you want to try something, ask. Did you know that at a lot of major grocers, a manager will let you sample ANYTHING your heart desires? Yes, even off-brand graham crackers. But do you really need to sample a roasted almond? Come on now.Can I bring 11 items to the 10 items or less aisle? Who’s really counting? —Mathematical MitziI’m not counting; GOD IS COUNTING. This is the honor system, do you have any? I don’t think 11 is a big deal; 14 is too far; 23 is outrageous. This is the only order we have left—don’t let it disintegrate into lawless chaos like Twitter and Congress.Illustration by Cari Vander YachtIs it ever okay to ride on the carts like a race car? —Whee! WesleyIf the aisle/parking lot is clear, YES. There are more dangerous things a person can do with a grocery cart. Once when I was a kid, I was riding in the cart while my brother pushed me as fast as possible through the outdoor garden section at the Walmart Supercenter and I stood up and yelled, “STOP!” and he did. I flew forward, landing on my head on the concrete. And look how I turned out!Please address the best way to abandon items you realize you don’t want/need, especially perishable ones. —Discarded D'AngeloThe road to hell is littered with vacuum-packed chicken breasts stuffed into magazine racks (a real thing I’ve witnessed). You know someone has to deal with that, don’t you? There’s no grocery store detritus fairy who taps it with her wand and makes it disappear. However, since 17 people asked this question, it’s clear we can’t stop leaving the unwanteds in our wake. Who has the time or energy to trek through an exceptionally air-conditioned labyrinth to return that wrong-flavored yogurt? You do. Return it! Or fine, hand it to the cashier and apologize.Illustration by Cari Vander YachtIt’s normal to take an empty bag of chips or an opened bottle of Dr Pepper to the checkout line, right? I’m going to pay for it; I’m just hungry. —Famished FelixThis was divisive. I’m strongly against it, but my editors are strongly for it. Plus, a Trader Joe’s employee told me there was no store policy against breaking open a bag of Elote Corn Chips, so it’s not illegal or anything. But please pay for what you snack on, and don’t leave crumbs all over the conveyor belt.If no one’s around to help, can you climb the lower shelves to reach an item on the top shelf? —Short ShelbyDo you want to die under a fallen shelf of canned queso? (Kind of.) Go find someone to help! It’ll only take a second.Explore Bon AppétitIs It Ever OkayEtiquetteRead MorecultureIs It Ever Okay...to Fake an Engagement for Free Dessert?By Alex BeggscultureIs It Ever Okay…to Bring a Plus-One to the Office Holiday Party?By Alex BeggscultureIs It Ever Okay...To Reject a Relative’s Offer to Cook Something?By Alex BeggscultureIs It Ever Okay…to Ask the Restaurant to Turn Down the Music?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-19", "author": ["Condé Nast", "Alex Beggs"]}