{"id": "b8fceb3783b5f700235703879af9addc", "url": "https://www.bonappetit.com/story/jorge-riera-frenchette-wine-list", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "How Jorge Riera Dreamed Up NYC’s Most Exciting Wine List at Frenchette | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsHow Jorge Riera Dreamed Up NYC’s Most Exciting Wine ListThe natural wine evangelist and sommelier behind Frenchette talks flavor profiles, price points, and the wines you're not drinking enough.By Marissa A. RossAugust 16, 2018FacebookTwitterEmailFacebookTwitterEmailEvery restaurant should take a hint from Frenchette: Put as much thought into the wine as you do everything else. At this new NYC bistro, you'll find a wine list just as detail-oriented as the immaculate Art Deco-inspired interior. And while the cuisine leans traditional, Frenchette’s wine list is a carefully curated and adventurous romp around the world with an international selection of bottles that may make you question the old adage, “Where it grows, it goes.” Best of all, every bottle is natural.We chatted with wine director and natural wine evangelist Jorge Riera (previously of Wildair, Contra, and the Ten Bells) about pairings, price points, and the countries wine lovers should be focusing on right now.Frenchette’s menu is totally a modern take on French cuisine, and your wine list is exclusively natural wines. What is so exciting to you about pairing these types of wine with this style of food?For over 20 years, I’ve been going to France and eating French food with natural wines. I think the food pops more with these wines than it does with conventional or traditional options because of the way the wines are made, with high acidity, low alcohol, and not-so-grippy tannins. The wine doesn’t overtake the food; it’s refreshing. It washes over your palate and the acidity cuts through the richness of some of the dishes, and that same acidity brightens a lot of the dishes as well.Something I love about your list is that although Frenchette is well, French, the wine list is very international. What country are you most excited about these days?The wines that are coming out of Catalonia, and Spain in general. They are really pushing back against the Americanization of wine from the ’80s and ’90s. People tell me they can’t believe the wine I’m serving is Spanish because they are used to highly extracted, vanilla-scented wines. But now Spain is making wines in a more traditional way—really bright, fresh, and energetic— and also taking a lot of risks. It’s very exciting to me.Is there a country you think consumers are overlooking?Georgia. Even though their wines have gotten more press of late, they’re intimidating to people because they have such a range of names we have no reference for, and there is also a misconception that all Georgia wines are macerated [skin-contact]. Also, they see a $20 or $30 bottle and think of it more as a fad. But those wines should be respected. People are afraid to go there, but once they taste the wine, they love it.Speaking of price points, you intentionally kept yours approachable. What was the thought process behind that?We wanted to have a real neighborhood restaurant where people could come in, have a snack and grab a bottle. Or if you come in with friends, you could have two or three bottles and you’re not breaking the bank. It’s all about the experience of eating and drinking and having a great time. And it’s an experience you can have once a month, not once every two or three months. We want it to be approachable. Wine is made for the people; it’s not made for exclusivity or priviledge.Are you seeing more customer engagement?Oh yeah. They’re seeing things they don’t recognize and going to different places than they ever thought they would. If they want a Pinot Noir, I introduce them to Pineau d’Aunis and Gamay. Many people stick with these traditional and classical concepts of wine, but when you take the grape out of the equation and give them an experience, they’re really grateful for it.How do you think consumers can get more out of their wine experience with a list like yours?Go with a descriptive of what you’re looking for. For instance, Pinot Grigio. People may say they want a Pinot Grigio because they’re looking for something dry with a bit of acidity, but they don’t realize Pinot Grigio can come in all grades of color, and even with tannins. It’s best to go with a flavor profile rather than a category or grape. Just open up, try something new, and have an experience. That’s what wine is about—the experience.Read more about the 25 restaurant trends we saw in 2018Related: So, What Exactly Is Natural Wine?Explore Bon AppétitHot 10 2018The Hot 10Read MorecultureWhat Is Carbonic Maceration in Wine, and Why Does It Taste So Damn Fun?By Marissa A. RosscultureMaking Wine With YodaBy Marissa A. RossLifestyleAlexis Schwartz Wants You to Pair Magnums of Natural Wine with TakeoutBy Emily SundbergRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-16", "author": ["Condé Nast", "Marissa A. Ross"]}