{"id": "b8ff5a5a6f7723831134bcbc30495e68", "url": "https://www.bonappetit.com/story/jaffle-maker", "year": 2021.0, "month": 9.0, "day": 4.0, "content": "A Jaffle Maker Will Revolutionize Your Toasted Sandwich Game | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureYou Haven’t Had a Toasted Sandwich Until You’ve Had a JaffleCrisp outsides seal in molten, gooey insides.By Ali FrancisSeptember 27, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I forgot about jaffles for a solid decade. But thanks to restrictive pandemic border policies and plain-old nostalgia, lately I’ve been craving home and going hard on these iconic toasted sandwiches from my Australian childhood.Each sanga, as we call ’em, comes together in a jaffle maker, an electric cooking appliance somewhat similar (in both theory and name) to a waffle iron. Here’s how it works: (1) Butter or mayo the outside of two pieces of bread and fill them with delicious foods. (2) Load your sandwich between the hinged, nonstick, concave plates. (3) Close the press, which clamps down on the bread, simultaneously warming the filling, toasting the outsides, sealing the crusts, and dividing the sandwich into two neat triangles. All this while you do a little jaffle jig in the kitchen.Photo by Isa Zapata, Food Styling by Pearl JonesCuisinart Jaffle Sandwich Press$25 at Amazon$25 at TargetBefore you roll your eyes at buying a single-use appliance—although people do make French toast and omelets in their jaffle makers—consider the platonic toastie. It’s golden and crispy on the outside, warm and tender on the inside, perfectly contained in a handheld pouch, and ideally angled for dunking in tiny ramekins of aioli, ketchup (known ONLY as tomato sauce in Oz), or mayonnaise. You can think of it like a lazy man’s pizza pocket or meat pie—which is also how you know the jaffle maker is an Australian invention. Who has time to toil over flaky pastry when the surf’s up, my dudes?Bondi-based doctor Ernest Smithers, the same gent who invented the surfoplane (a kind of inflatable rubber boogie board), is credited with popularizing and patenting the jaffle maker in 1949. Smithers’ original version, often referred to as a pie iron in the U.S., was a metal contraption with long handles for holding over a flame or barbecue. Later, in 1974, Sydney-based brand Breville released the first electric jaffle maker—the Snack ‘n’ Sandwich Toaster—which, supposedly, 10% of Australian households owned within its first year on the market.When I was growing up, jaffles were the ideal route to easy dinners or fridge clean-outs. We ate them stuffed with cheddar, baked beans, and Vegemite; ham and pineapple or banana; leftover Bolognese and parm; tinned spaghetti and mozzarella; rotisserie chicken with avo and Swiss cheese; and banana and Nutella. But there are no hard-and-fast rules when it comes to making jaffles, except this one: Though you’ll be tempted, don’t overfill your sandwich or it’ll explode like a mini volcano.Though the name, jaffle, isn’t always the same, the sealed sandwich has traveled around the world, making it Australia’s greatest cultural contribution (you know, aside from Milo, Tim Tams, Vegemite, and various other national treasures). My colleagues Rachel Gurjar and Antara Sinha grew up eating Bombay sandwiches, an Indian riff stuffed with variations like spiced potatoes and peas; crumbled paneer; and cucumber, tomato, and cheese with chutney. The Brits call them toasted sandwiches (so creative). And in South Africa you’ll find snackwiches or jaffles stuffed with savory mince that are often still made in the pie iron over direct heat.Of course, not all electric jaffle makers are created equal. The ones available in the U.S. typically aren’t concave enough to handle loads of filling (unlike the Breville Big One Sandwich Maker that Aussies can buy). But I do love the two-toasties-at-a-time Cuisinart, which, at 9.07x8.87\", is smaller than most hardcover cookbooks. It features all the good stuff: nonstick plates, a clamp that locks shut, sensor lights to tell you when your sandwich is done, and raised ridges to avoid overflow in the likely event you don’t heed my aforementioned advice.On those nights when the sanga’s siren song is strong, you’ll find me methodically buttering bread in my kitchen. I’ll open a can of beans, spoon on a layer, add a sprinkle of cheese, sneak a salty lick of straight Vegemite, and let the jaffle maker take it from there. At under $30, it’s a cheap ticket home.Bombay Sandwiches are calling:Bombay SandwichChef Preeti Mistry’s Bombay Sandwich is like a “grown-up grilled cheese,” made with jammy onions, potatoes, melty Monterey Jack, tangy cheddar, and Scallion Chutney.View RecipeExplore Bon AppétitShoppingHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-27", "author": ["Condé Nast", "Ali Francis"]}