{"id": "b902fcc648eafe6c0281bbbf53be63cd", "url": "https://www.bonappetit.com/story/in-praise-of-the-mighty-molcajete", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "In Praise of the Mighty Molcajete | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingIn Praise of the Mighty MolcajeteThe tool with a long history also makes the best salsa.By Megan Sanchez, as told to Julia BainbridgeJanuary 22, 2018FacebookTwitterEmailPhoto by Jules DaviesFacebookTwitterEmailMegan Sanchez is the chef of Güero, the food truck she and her husband, Alec Morisson, opened in Portland, OR last year. She's given us her best meal prep tips before, and here she talks about how she uses molcajetes to make the best salsas—and to connect to her past.Growing up in Southern California in an Hispanic family, molcajetes were just around. I never thought much of them other than that I found them intimidating. They’re these heavy, imposing kitchen tools made of volcanic rock, and I thought, “Oh, grandmas use that, but I can’t.”Then I met [my partner] Alec [Morisson], and we spent a month together in the Yucatan. Seeing women work their molcajetes so skillfully there made them even more intimidating to me, but I was also fascinated. These tools have been in continuous use across Mesoamerican cultures for thousands of years, and they’re still produced the way they always have been: Men go on these long journeys to find veins of porous, volcanic rock, they test pieces of it, and, if they find what they like, they remove chunks and carry them back. It’s a bit of an art form—both making them and using them.I read somewhere that they were originally used as a flint, and then it was discovered that they could break down things like spices and corn and it kind of evolved from there. It’s funny: One Mayan guy works in our kitchen and he’ll use the edge of a molcajete to strike a flame. He’s real old school.I have a small one that I bought on that trip, and then I added four more over time. I use my larger ones for making salsa and my smaller ones for making chili paste or cracking spices. The rough texture makes shearing the skins of slick chilies or even a blistered tomato go much faster. It also releases oils from ingredients, which is why blender salsa will never taste as good as if it were made with a molcajete.A new molcajete is much like a fresh cast-iron pan: There’s a little bit of work that goes into seasoning it, but it’s worth it. The traditional way is to grind raw rice into a powder to extract any bits of grit in its walls. And when you rinse it, the rice kind of pulls everything behind it. Next, you pound some garlic and salt into it. Eventually the bowl becomes layered with flavor from all the previous things you made in it.Alec and I are trying to go to Oaxaca soon. I’m already looking into a bigger suitcase, so I can bring more molcajetes back. It allows you to be part of that big, ancient cuisine, and that’s really cool.Sanchez’s Carrot-Chile SalsaCrush a bit of piloncillo (unrefined cane sugar), then toss with a bunch of peeled medium carrots and olive oil and roast on a rimmed baking sheet in a 425° oven until carrots are browned. Meanwhile, toast 6 unpeeled cloves of garlic, 1 sliced onion, and a few whole habaneros in a dry skillet until blackened on all sides. Stem habaneros, peel garlic, chop onion, and simmer in a saucepan with apple cider vinegar and water. Then mash it all in the molcajete until it has a salsa-like texture.Can't make it to Mexico? Sanchez also loves her 10\" molcajete from williams-sonoma.com ($60).Explore Bon AppétitHealthyishToolsMexicanCooking TipsShoppingRead MoreshoppingThe Tool That Changed the Way I CookBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-22", "author": ["Condé Nast", "Megan Sanchez", "As Told To Julia Bainbridge"]}