{"id": "b904e65edf34dd4e071a1ebaf4c30f30", "url": "https://www.bonappetit.com/recipe/vegetarian-carbonara", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Vegetarian Carbonara Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesVegetarian CarbonaraBy Carla Lalli MusicApril 27, 20204.3(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Bowl by Melien Ceramics EmailPinterestPrintEmailPinterestPrintSwapping traditional ingredients like guanciale and pancetta for vegetable-based umami bombs (hello, garlic and smoked paprika) isn’t the only thing to consider when making a vegetarian carbonara. Many hard cheeses (including Parmigiano-Reggiano) use animal rennet, so if you want to seek an alternative, ask your cheesemonger or check out this list.Ingredients4 servings 12oz. fettuccine or other long pastaKosher salt1lb. asparagus, trimmed, cut into 2\" –3\" pieces4garlic cloves, thinly sliced¼cup extra-virgin olive oilFreshly ground black pepper¾tsp. smoked paprika3large egg yolks¾cup pre-grated vegetarian Parmesan, plus more for servingPreparationStep 1Cook pasta in a large pot of boiling generously salted water, stirring occasionally and adding asparagus when pasta has 1 minute left to go, until pasta is very al dente, about 3 minutes less than package directions.Step 2Meanwhile, combine garlic and oil in a medium Dutch oven or other high-sided pot and set over medium heat; season very generously with pepper. Cook, stirring often, until garlic is light golden, about 2 minutes. Remove from heat and stir in paprika; set aside.Step 3Place egg yolks in a medium bowl. Scoop out 1 cup cooking liquid from pasta and, whisking constantly, gradually add to egg yolks to temper. Season with salt and pepper; set aside.Step 4Drain pasta and asparagus, reserving 2 cups pasta cooking liquid; transfer pasta and asparagus to pot with reserved garlic oil. Set back over medium heat and toss to coat. Tossing constantly, add 1 cup pasta cooking liquid, followed by reserved yolk mixture, then ¾ cup Parmesan. Cook, tossing constantly and reducing heat as needed to keep mixture below a simmer, until cheese is melted and liquid thickens enough to coat pasta in a glossy, silky sauce, about 5 minutes. (This might be easier on your hands if you use 2 wooden spoons, as though you were tossing a salad, rather than trying to do it with 1 hand and a pair of tongs.) Add more reserved pasta cooking liquid if needed to loosen.Step 5Divide pasta among shallow bowls and top with more Parmesan and a few grinds of pepper.How would you rate Vegetarian Carbonara?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleGood recipe overall, though I would caution against “generously” salting the boiling pasta water. Since the water is later used to make the sauce, it can very easily result in an overly salty carbonara. Sadly, that’s what happened for me. I will try again WITHOUT generously salting the pasta water. Sameer KanugaToronto, Canada11/22/2021Delicious! The smoked paprika is a must. I used bucatini and peas, and I added basil and lemon juice at the very end. Will definitely make again!CaseyArlington, VA11/18/2021I added kalamata Olives and used peas instead of the asparagus. Without the olives it didn't have that salty kick. Very good substitute and similar to an authentic carbonara without the pork. The smoked paprika is a must. OliveGalway4/12/2021This was excellent. I highly recommend serving each individual portion with its own egg yolk on top and a light sprinkling of the smoked paprika, along with extra parm and pepper. It made a big difference and upped the dish from good to great. Now just need a recipe for all these egg whites!CTCNew York, NY3/12/2021I love a good Carbonara, and this recipe is a great way to get the richness without the meat.  We didn't have any asparagus so we substituted broccoli and it worked out great.  This one is going in the recipe folder for sure.  Deadhead1974Saint Charles, IL2/4/2021Finally a recipe where my eggs didn't scramble! was super deliciousArianePerth, Western Australia1/7/2021The recipe looks very simple and appetizing. What’s the substitute for eggs ?Rhoda SundharPrinceton, Nj12/28/2020Ah, yes! Finally a recipe where my very meat-eater family didn't go \"eh, lacks meat\". I was really pleased to serve them a veggie meal they thouroughly enjoyed, especially when they asked for more. Surely isn't your healthy 5-a-day recipe, but it's comfort food at its best, which I loved. The recipe is clear and straight-forward, the result is exquisite and the sauce was extremely creamy. Bonus point for it being very quick! Just sublime. AméliaSaubusse, France12/5/2020I had never made carbonara before, although I love to order it, so I was very pleased this turned out! I used 8 oz bucatini (so it equaled half the box I had) and added 8oz frozen peas at the same time as the asparagus to help replace the missing pasta and add some more veggies which I thought worked well. I felt like it needed more garlic and smoked paprika; I would increase both by at least half again next time. My sauce took probably around 10 mins to come together. Perhaps my heat wasn’t high enough. But it all worked out in the end! AnonymousElkins Park, PA8/24/2020Delicious and easy, and pretty low-calorie (I used whole wheat pasta). I used peas instead of asparagus and added shrimp for protein. Trader Joe’s umami seasoning makes a great addition if you’re really missing the savoriness you’d get from guanciale. ckellenNashville TN7/13/2020So easy! The paprika does a lot of heavy lifting in this recipe, and it's supremely delicious.AnonymousBrooklyn6/29/2020The best vegetarian carbonara I’ve made, the smoked paprika is brilliant. Overall awesome dish and an actual 30 minute meal!AnonymousNew York6/15/2020BOMB recipe! It is very adaptable and diverse. Plus, since it's carbonara it feels like a step up from regular pasta. Would 100000% make again. It takes about 30 minutes to make and you can sub the asparagus for other veggies (I used zucchini).dani.n.kaye4088Haifa6/11/2020This was pretty good! I love having a use for egg yolks since I have a granola recipe (Alison Roman) that calls for 3 egg whites and I usually struggle to use up the yolks. This was really easy to make and you could definitely make this all year round just swapping out the vegetable. My sauce wasn't as smooth and glossy as I would have liked - I'm not sure if the yolks got scrambled (seems unlikely since I tempered them with the boiling water) or if I was just seeing bits of cheese. Either way, it tasted great. The only adjustment I might make is adding some lemon and/or lemon zest at the end to give it a bright pop.soapnanaChicago, IL6/2/2020SO good! 10/10! I've never had regular carbonara since i don't eat pork but this was so tasty. really creamy without any cream, feels pretty low cal and good for lactose intolerance since parm has very small amounts of lactose! definitely a new staple in my dinner rotation, extra bonus that you can cram whatever greens you've got into it. I did beans.dianasaurToronto5/29/2020Explore Bon AppétitPastaItalianEuropeanFettuccinePasta & NoodlesAsparagusVegetableParmesanCheeseSpringQuickEasyWeeknight MealsMainVegetarianHealthyishBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-27", "author": ["Condé Nast", "Carla Lalli Music"]}