{"id": "b90b5e886ce77be3e1e85adfb0d4b634", "url": "https://www.bonappetit.com/recipe/popcorn-chicken", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Harissa-Honey Popcorn Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesHarissa-Honey Popcorn ChickenBy Asha LoupyFebruary 10, 20225.0(13)Read ReviewsTriangleEmailPinterestPrintPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling by Stephanie De LucaEmailPinterestPrintEmailPinterestPrintSaucy and glossy with a crispy-gone-slightly-soggy bite, this glazed popcorn chicken is a great excuse to start watching sports. First, the chicken is marinated overnight in a buttermilk mixture that’s supercharged with finely chopped preserved lemon (if you don’t have preserved lemon, just double the lemon zest and add an extra pinch of salt). Then it’s dredged in a mixture of rice flour and cornstarch, which results in a shatteringly crisp exterior that stays audibly crunchy for hours. You could substitute all-purpose flour for rice flour if needed, but it won’t be as crunchy—or gluten-free. (Read more about why rice flour makes the best dredge here!) Finally, the chicken is tossed in a sweet, spicy, and sticky harissa-honey sauce.When it comes to the heat level, it all depends on the harissa you use. This condiment—originally from Tunisia but used in many dishes throughout North Africa and the Middle East—can vary from mild to fiery depending on the brand. For the glossiest popcorn chicken, look for a jarred version that is saucy and loose in texture. I love New York Shuk, Belazu, and Villa Jerada—or you can make your own. —Asha LoupyAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDeep-Fry Thermometer$29 $16 At AmazonLodge 6-Quart Dutch Oven$115 $80 At AmazonBamboo Handle 5\" Spider Strainer$9 At AmazonWire Cooling Rack$17 At Bon Appétit MarketWhisk$10 At AmazonMicroplane Grater$16 At AmazonSmall Saucepan$155 At AmazonCitrus Juicer$7 At AmazonIngredients6–8 servingschicken½preserved lemon, seeds removed1large egg4garlic cloves, finely gratedZest of 1 lemon1cup low-fat buttermilk⅓cup plus ¾ cup cornstarch, divided1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided2¼lb. skinless, boneless chicken thighs, cut into 1\" pieces1½cups rice flourVegetable oil (for frying; about 11 cups)sauce and assembly½cup (1 stick) unsalted butter3Tbsp. medium-bodied honey (such as orange blossom)6Tbsp. harissa paste2Tbsp. fresh lemon juice½tsp. Diamond Crystal or ¼ tsp. Morton kosher salt; plus more (optional)Crunchy raw vegetables (such as radishes, cucumber spears, and carrot sticks; for serving)special equipmentA deep-fry thermometerPreparationchickenStep 1Place ½ preserved lemon, seeds removed, on a cutting board and finely chop. Using the back of your knife, mash into a coarse paste and transfer to a large bowl. Add 1 large egg, 4 garlic cloves, finely grated, zest of 1 lemon, 1 cup low-fat buttermilk, ⅓ cup cornstarch, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt to bowl and whisk to combine. Add 2¼ lb. skinless, boneless chicken thighs, cut into 1\" pieces. Mix well to make sure each piece is coated in marinade; cover and chill at least 4 hours and up to 12 hours.Step 2Whisk 1½ cups rice flour, remaining ¾ cup cornstarch, and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a large shallow dish to combine. Remove one third of chicken from bowl, letting some of the marinade drip back into bowl, and arrange in a single layer on rice flour mixture. Gently toss chicken to coat, pressing down into mixture and turning to make sure every nook and cranny is covered. Transfer to a large plate. Repeat with remaining chicken in 2 batches.Step 3Pour vegetable oil into a large Dutch oven or other heavy pot to come 2\" up the sides. Fit pot with thermometer and heat oil over medium-high until thermometer registers 350°. Working in 3–4 batches, fry chicken, turning occasionally, until cooked through and golden brown, 7–10 minutes. Using a spider or slotted spoon, transfer to a wire rack set inside a rimmed baking sheet and let drain.sauce and assemblyStep 4While the chicken is frying, heat ½ cup (1 stick) unsalted butter and 3 Tbsp. medium-bodied honey (such as orange blossom) in a small saucepan over medium until butter is melted.Step 5Scrape honey butter into a large bowl, add 6 Tbsp. harissa paste, 2 Tbsp. fresh lemon juice, and ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt, and whisk until smooth and emulsified. Taste sauce and season with more salt if needed.Step 6Place fried chicken in sauce and toss until every piece is well coated.Step 7Arrange chicken on a platter and serve with crunchy raw vegetables (such as radishes, cucumber spears, and carrot sticks) alongside.How would you rate Harissa-Honey Popcorn Chicken?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis is was good but a little butter heavy. I’ll use less next time. AliceAustin3/13/2022Yum!! We loved it. We were even able to pull it off in the air fryer. Will be using again! Anna Banana2/16/2022Can we swap chicken for cauliflower?Ariel Q2/13/2022I don’t know if I’ll ever be able to convey how truly delicious this was….WOW Katie New York 2/13/2022Can this same process be applied to tofu? And can the frying part be done in an air fryer with similar results?Emily I2/10/2022Explore Bon AppétitSuper BowlStarterMainDeep-fryGluten-FreeNut-FreeFried ChickenChicken ThighChickenPoultryHarissaCondiments, Sauces & PastesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-10", "author": ["Condé Nast", "Asha Loupy"]}