{"id": "b935a3c48a49ae9dd46b7881571b9d7b", "url": "https://www.bonappetit.com/story/pour-over-gear", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Pour Over Coffee Gear - How to Make the Best Pour Over Coffee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingAll the Gear You Need to Brew the Perfect Pour OverThe simplest way to make coffee at home is also the best.By Alex DelanyMay 7, 2020FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThe pour over is a funny thing. It’s simultaneously the most low-tech way of making coffee and the method coffee snobs love the most. It also happens to be our favorite way to make coffee at home, which we’re doing quite a bit these days.But say you don’t typically brew coffee at home. You’ve never bought beans or thought about which size coffee filters to buy or whether glass or ceramic is better for a pour over cone. That’s totally cool—I’m here to hold your hand and get you situated with a killer pour over setup.Here’s everything you need to brew a pour over in the comfort of your own kitchen:A Pour Over ApparatusThere is no secret technology happening here. What you're looking at is quite literally a cone with a hole in the bottom. But there are two big factors—shape and material—that matter when it comes to the device in which your coffee is actually brewed. The size 02 Hario V60 meets our preferences for both.The first is shape: The V60 has an open bottom, meaning that the filter drips directly into the vessel below it without coming into contact with a flat surface. Pour over cones with a flat bottom, on the other hand, let the coffee pool before it drips down, which in turn extends the time water is in contact with the beans, thereby over-extracting them.Second is the cone’s material, which determines its heat retention. Without getting too nerdy, keeping your mixture of water and coffee warm while the beans brew makes for better-tasting coffee. Skip anything ceramic, which cools off the fastest. Instead, go for glass (which looks the nicest and has good heat retention) or plastic (which doesn’t look quite as nice as glass, but has better heat retention than glass).Buy it: Hario V60 Glass Coffee Dripper, Size 02, $20 on AmazonPaper Coffee FiltersYou know what a coffee filter does, right? It keeps your coffee from becoming sludge. Most coffee filters are made for specific brewing apparatuses, so since we like the size 02 V60, we also like the natural size 02 Hario V60 filters, which aren’t bleached and can be composted when you’re finished. If you don’t want to constantly be composting paper, there are plenty of reusable cloth and metal coffee filters out there. But if you’re all about the best pour over possible, nothing does the job quite like paper.Buy it: Hario V60 Paper Coffee Filters, Size 02, $7 on AmazonA Pour Over ServerOkay, you don’t actually need one of these: You can put your V60 right over a Mason jar or your mug or a sixteenth century Ottoman vase. But they’re nice to have if you’re splitting your coffee with someone or if you’re warming your mug with hot water before pouring coffee into it, which we absolutely recommend you do. The Hario carafe looks nice and makes us feel special.Buy it: Hario V60 Clear Glass Range Coffee Server, $27 on AmazonA Coffee GrinderWe are very much on Team Whole Bean Coffee over here at Basically—it’s the easiest way to level up the flavor in your cup. Coffee beans literally leak flavor once they’re ground, which means pre-ground beans are a shade of their former selves. But buying whole beans means you need to grind them yourself, and for that, you need a coffee grinder. We like burr grinders, which grind coffee beans with a rotating set of textured metal surfaces instead of a blade. Unlike a blade, the burrs allow the coarseness of your grind to be adjustable and consistent.For an affordable hand-powered grinder, the Hario coffee grinder does the trick. If you want a hand grinder with a bit more precision and portability, the Knock Aergrind is excellent but expensive. And if you want to grind coffee quickly and in larger batches, to serve more than just you, we suggest going for an electric grinder like the Barazza Encore. Your arms will thank us.Buy it: Hario Ceramic Coffee Mill, $46 on AmazonA Digital ScaleHardcore bakers will tell you that you need a scale if you really want to measure precisely, and hardcore coffee people will tell you the same. And they’re both right! When weighing coffee—which varies dramatically in how coarsely or finely its ground—the only way to know your coffee-to-water ratio is correct is to weigh the coffee and water you’re using. That means you should measure beans and brew your coffee on top of a digital scale that weighs in grams. We like the Escali Primo Digital Scale for an affordable, durable, good-for-anything scale. If you want to get a little fancier, the Acaia Pearl also includes a timer and measures down to the tenth of a gram.Buy it: Escali Primo Digital Scale, $23 on AmazonCourtesy of BonavitaA Hot Water KettleEvery coffee brewing method requires hot water, but how you heat it is up to you. Old-fashioned tea kettle? That works. Campfire? If that makes you happy, go for it. But we’re fans of an electric kettle for the ease and temperature precision. If you really want to go for the best of the best, the Fellow Stagg EKG Electric Kettle is what you’re after. It allows you to control the temperature down to the degree, heats up quickly, and looks beautiful. But a Hario V60 kettle that can be heated over the stove works as well. Whatever you end up with, make sure it has a gooseneck (that thin, long, curved spout), which allows water to flow slowly and intentionally.Buy it: Hario V60 Stovetop Gooseneck 'Buono' Coffee Kettle, $50 on AmazonAnd, Of Course, a MugDuh. Your pour over is worthless without something to drink it from. May we suggest a classic novelty mug? With a volumetric capacity of 11 ounces, it fits a 16:1 pour over of 22 grams of coffee perfectly.Need some bean recommendations? We’ve got a whole list of those right here:Where to Buy Great Coffee OnlineA regional list of roasters we love that ship straight to your door. View StoryAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitCoffeeShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-07", "author": ["Condé Nast", "Alex Delany"]}