{"id": "b93a9a185c27da4e43fe460a4f59c023", "url": "https://www.bonappetit.com/story/what-im-baking-easter-weekend", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "What I’m Baking This Easter Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat I’m Baking This Easter WeekendAnd more from Alex Beggs’s weekly roundup inside the BA offices.By Alex BeggsApril 20, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the* BA *offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Easter!!!It is Easter! The holiday I can never forget because I always get a text from my [unnamed family member] that says, “He has risen!” This weekend, if everything goes as planned in my rhubarb-shopping endeavors, I’ll be making Claire Saffitz’s famous rhubarb custard cake. No mixer required, custardy simple filling, beautiful fruit topping. My colleagues said that if I can’t find rhubarb, any fruit on top will do. How about that.Get the recipe: Rhubarb Custard CakePhoto by Amy Lombard...And hot sauce for allWhat I appreciate about this world and the people in it, is that there are gathering spaces where we can come together and try nearly 50 different hot sauces on a Sunday. It’s called the Hot Sauce Expo, and this was its seventh year running in Brooklyn. I went last weekend and had one of the best times of my life. It attracts a crowd of passionate, brave, hardcore fans—who own chile pepper–printed leggings and leather hot sauce holsters. Metal was blasting, people were chugging cartons of whole milk, and I met a man with a solid gold chicken wing necklace. There was a sauce so hot that nearly everyone who tasted it ran to the bathroom to puke, then run back to proudly tell me how awesome they felt. It was called Right Hand of Doom. I tried to relive the beautiful insanity of the event here.Want this letter before it hits the website? Sign up for our newsletter!The other sauceRed Sauce! Did you see our Red Sauce America package this week? I wrote about Carrabba’s Chicken Bryan, the entree with a cult following and a friendly name. But my favorite Red Sauce piece was Hilary Cadigan’s essay about working at Bertucci’s. I’d never heard of the restaurant, but she captures that teenage awful-but-at-least-it’s-something first job phase. The workplace crush. The free pizza scam. The cranky boss who can’t believe he’s still managing this place. I loved every word.Open a bottle of Chianti and explore Red Sauce America here.Photo by Rachel Tepper PaleyIt’s not actually pigeon, chillHave you attempted our “pigeon” pie? Writer and Bon Appétit contributor Rachel Tepper Paley made the recipe, the most challenging and epic recipe of Rick Martinez’s Game of Thrones menu (for the rest of you, Sansa’s lemon cakes are the easiest!), and I was IMPRESSED. Hot water crust! Blind bake! Elaborate meat filling (pork, prosciutto, and chicken)! Hers turned out beautifully. “It was a convergence of two great loves,” she said, “The Great British Baking Show and Game of Thrones.” Brava, Rachel! You’re our star baker on the Iron Throne this week.Get the recipes: Ceremonial \"Pigeon\" Pie and Sansa’s Lemon Cakes5 degrees of Nancy MeyersThis week, Alex Delany gasped. “I was just followed on Instagram by...Nancy Meyers?” The esteemed director, it turns out, follows a handful of BA staffers, so I asked them how it felt.Chris Morocco: “I am so honored!”Carey Polis: “Famous director/producer Nancy Meyers, potentially seeing what I cook for dinner! What a world!”Alex Delany: “It’s rad. Everyone likes to talk about Nancy Meyers’ movie kitchens, but the vineyard/cellars in The Parent Trap is better than any kitchen.”Carla Lalli Music: “Hi there, I am on the road until Friday, April 19, and my responses will be sporadic until then.”Picture dayWhile taking our staff photos this week, Alex Lau got a stunning shot of Emma Fishman, which is now his caller ID for her:“I’ve been looking all over for you”When I heard Cristina Martinez (our director of editorial operations) say that, I assumed it was because I haven’t done some important paperwork for months and was finally being called out on it. But no. She whipped out her phone and showed me a video of a raccoon eating cherries.Unnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Heather GreeneWe had a Red Sauce America–themed live podcast this week and onstage, Claire and Chris argued onstage about tiramisù (Chris developed a fantastic recipe for it too). Claire hates it because it’s “both wet and cold.” Chris loves it because it’s a balanced, layered, creamy nostalgia trip. It loosely translates as “cheer me up” or “pick me up”—how can you not love it?! But the staff is divided. Team Claire includes features editor Meryl Rothstein, who calls it “Nothing special, though I’ll eat it if it’s in front of me.” Alex Delany, a certified statistician, said, “five percent of tiramisù is great tiramisù.” “That math’s off,” said Carey Polis. Amanda Shapiro is team Chris, arguing that anything with coffee and booze can’t be bad. Sarah Jampel shakes her head, “I don’t like the dampness. It’s damp in there.” On Amiel’s birthday this year, his wife made a baby pool–sized tub of tiramisù that was served with a shovel—he loves it. “It’s pudding by another name!” said Amiel. We discussed whatever the texture of ladyfinger cookies are. At the podcast, Chris called them crispy-gone-soggy, but crispy-gone-soggy authority Amiel feels it’s more like “spongy gone soggy, and it’s perfect.” “Everyone likes Oreos dunked in milk,” preached Emily Schutz, her voice rising in exasperation. “It’s the same texture!” Voices cried out: “No it’s not!!!” And Delany waved his hands about saying, “No other dessert solves this problem. When you need coffee, cream, cookies, and booze—no other dessert will solve that.” And if those are the types of problems in your life, I wish you all the best.Get the recipe: Old-School TiramisùExplore Bon AppétitBeggs NewsletterRead MorecultureJoy, Pain, and Puke at the 2019 Hot Sauce ExpoBy Alex BeggsPhotography by Amy LombardcultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-20", "author": ["Condé Nast", "Alex Beggs"]}