{"id": "b93cfb7327ac966b0e46b3b261c95852", "url": "https://www.bonappetit.com/story/will-plant-based-protein-save-world", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "Will plant-based protein save the world?  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWill Plant-Based Protein Save the World?One butcher left her home on a farm in upstate New York and traveled to the heart of Silicon Valley to find out.By Sophia HamptonJuly 20, 2020FacebookTwitterEmailIllustration by GIACOMO GAMBINERIFacebookTwitterEmailFor the first time in a long time, I don’t smell like cow manure. Here in Oakland, California, 3,000 miles from my home on a farm in upstate New York, I’m walking into the Impossible Foods production facility, a massive polygon of beige rectangles that can squish out a million pounds of plant-based meat a month. I’m a farmer in training and butcher, which means this place threatens to render my entire field of work obsolete. There’s gotta be a punch line around here somewhere.To prep for my tour, I put on rubber boots, a snappable lab coat, a hairnet, a hard hat, and protective goggles. Someone gives me an X-ray detectable pen that can write in refrigerated temperatures. I wash and sterilize my hands about 3,000 times. There are automatic boot scrubbers and a machine that squirts out suds I’m supposed to stomp through on purpose. Along a yellow-painted pathway that indicates where pedestrians should stay to avoid the forklifts, I follow a man named Pierre whose official title here is Continuous Improvement Engineer.We start in a chilly room with stainless-steel tanks towering over us. Pierre says they’re for making the potato protein, one of the 20 plant-based ingredients found inside an Impossible Burger. I ask about the potatoes. Yukon Golds? Russets? Who grew them? He taps a computer monitor, which tells us they’re not actually potatoes at all, more of a potato derivative, sourced from an undisclosed supplier. The screen lists about seven other chemical-sounding ingredients, and on second thought Pierre thinks maybe I’m not supposed to see this and we follow the yellow path to the main production line.All Impossible products start with soy in two forms. There are sacks of textured soy protein, which looks like stale breadcrumbs, and barrels of soy leghemoglobin, aka heme, the genetically engineered red liquid that flavors an Impossible patty. I see a paddle mixer like the one I use back home to mix 30-pound batches of sausage, except there are six of them and each one can hold up to 2,700 pounds. They slap together all of the powders, goops, and particles that make up a substance resembling ground beef, and then another machine shoots it into a shaper that forms quarter-pound patties or five-pound wholesale bricks. The meatless ground beef is Impossible’s flagship product; the company has sold 25 million pounds of it in more than 15,000 restaurants and grocery stores worldwide. It moves on a conveyor belt through a freezer blast, becoming hard enough to slip squarely into vacuum-sealed plastic. Then each package is x-rayed (for quality control), labeled, weighed, boxed, and stored inside a freezer that could double as a parking garage.At the Impossible factory, a few dozen humans are there to push buttons, flip packages right side up, pull out defective ones, and drive forklifts, while machines do the rest. In under an hour the production line has converted thousands of pounds of soy. It is fast, efficient work. It is like nothing I’ve ever seen before.Illustration by GIACOMO GAMBINERIUntil I was eight I lived in rural New Mexico, and most of the meat I ate came from the woods. Sometimes bringing in the groceries meant helping my dad carry an elk from the back of his red pickup to the newspaper-covered dining room table, a makeshift butcher block. Everyone I knew—my mom, my brothers, the neighbor guy—crowded around to help. Watching the animal turn into stew and broth and jerky right in front of me, I thought it was magic: the way one elk could be so much to so many people.For real, though, I also thought microwavable mac ’n’ cheese was magic. I wanted to be a fairy princess when I grew up. Everything was magic. Then I moved to suburbia, where woods are decorative and chickens are nuggets and pigs don’t fly because they’re in gestation crates. Meat stopped being a fairy tale.Things got more complicated when I moved again—this time to New York City for college. My professors gave lectures with neat statistics that pegged livestock as an environmental menace due to its greenhouse gas emissions. But during those years I also started working on farms and in whole-animal butcher shops that had a different perspective on meat. On the farms, animals were understood to be as essential to a functioning ecosystem as herds of elk in the woods. I watched flocks of chickens and ducks literally make the grass grow as they pecked, their poop a chemical-free fertilizer. In the butcher shop I relearned how precious meat can be, and how with enough time and knowledge, all of it, down to the tendons, can be delicious. On a real butcher block, with a knife and a handsaw, it took me about six hours to turn one 800-pound cow into bone broth, roast beef, steaks, and hamburgers, which could then feed hundreds of people. The magic was back.Today I live and work on a 900-acre biodynamic farm in New York’s Hudson Valley. I’m here on a research residency to learn how farms can include animals in the most sustainable way possible. I wake up at 5 a.m. to milk 52 mama cows that I know by name and udder. I binge-watch newborn calves, sticky jumbles of limbs and fur, plopping into the world. And with this joy comes the complicated, messy work of turning life into food. This past fall I spent hours collecting acorns to feed the pig that is now pork in my freezer. I was also there on the quiet October morning when he died. Cue that scene in The Lion King where Mufasa tells Simba about the antelope and the grass and how we’re all connected in the great circle of life. It hits me in the heart every time.It’s also why I feel sad and helpless to know that America’s yearly slaughter supply is 9 billion chickens, 124 million hogs, and 33 million cows, most nothing more than a unit on a production line. The types of pastures I work on—with animals I spend months tending to in blazing sun and numbing cold—are just 1 percent of this bottomless pit. The average person eats 222 pounds of meat a year, and that’s not a number farms like mine can sustain.So when plant-based meat rocketed onto the scene, I paid attention. Start-ups like Impossible Foods and Beyond Meat are leading the charge in America, here to save the world from climate catastrophe by filling our excessive annual demand with meatless meat. Beyond—whose logo, a cow in a superhero cape, reminds you of the brand’s heroism—wants to replace animals as a protein source for humans. Impossible Foods’ mission is to end all animal agriculture by 2035. As its website proclaims, with these products you can do the seemingly Impossible: “Eat meat. Save earth.”It seemed like these companies had it all figured out over there in California. So I left my fleece-lined overalls in a heap on the floor, got on a plane, and set off to explore the great indoors of meat disruption—and taste the burgers they say will save the world.I arrive at Beyond Meat’s pristine test kitchen in El Segundo just in time for lunch. Like any other professional kitchen, it has a stainless-steel pass in front of a hot line with a griddle, deep fryer, and six-burner range. There’s a stack of cookbooks, cast-iron pans, and a sticker on the window that says, “Sous vide is not a crime.” Beyond’s head chef, Cris Sanchez, appears. “Are you ready to cook with me?” he asks.I stand there, useless, as Sanchez shows me how he prepares all of the packaged products sold by Beyond. He cooks up a Beyond cheeseburger, a Beyond bratwurst, the Beyond sausage patty created for Dunkin’ Donuts, and some empanadas with Beyond beefy crumbles. He plants a Beyond-flag toothpick in each dish as a final flourish, like Armstrong landing on the moon.I bite into the Future of Protein with Sanchez watching. The burger is sauced with something Thousand Island–y and nestled inside a toasted bun with oozy orange cheese, exactly three pickle coins, two tomato slices, and one crisp lettuce leaf. I say the word wow because I don’t know what else to say. My taste buds hunt through all the fixings to assess what is Beyond. It doesn’t taste like plants, but it doesn’t quite taste like meat either—at least not to me, someone who thinks about the stuff like it’s my job (because it is). The burger is good in the same way a Dorito is good, both products the sum of a complicated engineering equation.Plant-based meat start-ups are framing the way humans eat meat as a technology problem—an inefficiency that can be addressed with a better processor, like a software update on your laptop. Beyond’s R&D facility is staffed by people with doctoral degrees from name-droppable institutions who analyze everything from how much water a beef burger releases when it’s cooked to why a patty can go from pomegranate-seed red to ghoulish gray when it sits in a hot pan for too long. Using this data, their goal is to figure out how to get plants to be as un-plantlike as possible. So we’re not talking Field Roast barley-and-veggie patties here—we’re talking plant molecules spun through centrifuges and smooshed into meaty submission with a secret tech process of “heating, cooling, and pressure.”And now this kind of plant-based meat is everywhere: next to the organic sausages at Whole Foods and the bargain chicken at ShopRite. Impossible products are served in chili at school cafeterias, at Burger Kings across the country, and on the menu at David Chang’s Momofuku Nishi in New York City. In the 11 years since Beyond Meat launched (Impossible began two years after that), the products have moved from niche market items to curiosity to verifiable movement. Beyond was one of 2019’s most successful IPOs. According to a recent Gallup poll, 41 percent of Americans have tried plant-based meat. By 2025 the global plant-based meat market is expected to be worth $30 billion.Other corporations have noticed and followed suit. JBS, the largest meat-processing company in the world, is making plant-based burgers now. Tyson, the world’s second-largest processor and marketer of beef, pork, and chicken, released a plant-based nugget last summer. Kellogg, Cargill, Nestlé, Hormel, and Smithfield are all adding plant-based options to their protein menus. In this game of disruption, who ends up saving who?Illustration by GIACOMO GAMBINERIThe American food system is a tangled knot, built atop devastations such as stolen land, slavery, a mentality of “get big or get out,” and endless acres of crops that need to be tilled, planted, and sprayed with chemicals year after year. While too much livestock is certainly part of the problem, it’s more symptomatic than anything else.Just after WWII, in the so-called Golden Age of Capitalism, Midwestern farmers were planting and harvesting more grain than they knew what to do with. In an effort to create a market for the surplus, animals that once grazed outside started getting pushed indoors, becoming a dumping ground for a seemingly infinite supply of cheap grain. This type of industrial feeding operation was a win-win, if winning is a numbers game. More animals getting fat, faster. The cost of meat went down, and average meat consumption per person more than doubled.But the quietly dying elephant in the room is the soil. All of the tilling, fertilizer, and chemicals associated with these immense grain harvests are killing the very substance agriculture depends on. This is a big yikes, because healthy functioning soil is not only essential for life itself, it’s also the largest carbon sink on land. Imagine a sponge, soaking up carbon from the air via plant photosynthesis and storing it within its earthy depths; if soil is degraded, the carbon can leak right back out again, adding to our atmosphere’s already excessive greenhouse gas emissions.This is where Pat Brown, founder and CEO of Impossible Foods, comes in. As he points out, the way most livestock is raised makes the earth a worse place to live. The manure lagoons attached to feedlots are the size of football fields. They pollute waterways, stinking up the air so bad that people living nearby can’t breathe. The global livestock industry accounts for 14.5 percent of greenhouse gas emissions, and cutting down forests to make room for feed production destroys wildlife habitats. The land would be better off, Brown says, if we could just “stop having cows chomp on it and stomp on it.” Then reclaimed pasturelands could become lush wilderness, pulling down carbon emissions through photosynthesis.Brown insists that his company (with its $1.3 billion in funding and counting) is on track to replace every rib eye, chicken cutlet, and bacon strip consumed by humans by 2035. The only thing standing between plant-based meat and total acceptance is scale; with enough paddle mixers and soy leghemoglobin, Brown and his fellow disrupters can send one of the world’s oldest livelihoods the way of the flip phone. Bippity, boppity, boo.Back at Impossible Foods HQ, I’m sitting in a spotless conference room with Rebekah Moses, Impossible’s head of Impact Strategy. She’s talking about why she believes removing animals from the food system will save nature.I counter that not all livestock is bad for the environment; in fact, some of it is quite good. Consider Chris Newman, a member of the Choptico Band of Piscataway Indians and cofounder of Sylvanaqua Farms in Montross, Virginia. On his farm, cows, pigs, chickens, and ducks meander around pawpaw and persimmon trees with patches of vegetables interspersed—a multilayered 1,900-acre food forest. It’s a thriving and interconnected landscape, managed according to a system of indigenous ethics called ehakihe-sakamink. And it works. Research shows that all of Brown’s dreaded “chomping and stomping,” if properly managed in the right places, can actually help pastures draw CO2 down into the soil like a good clean sponge.Indigenous peoples around the world are protecting 80 percent of the earth’s remaining biodiversity. Even the UN’s Intergovernmental Panel on Climate Change agreed last year that indigenous agricultural knowledge is what will help us overcome the challenges of climate change, food security, and biodiversity conservation. And farmers like me are following their lead, stewarding ecosystems that mimic our planet’s natural patterns instead of fighting them.But Moses bursts my bubble: “Isn’t it kind of irrelevant? Look at the scale of beef demand in the United States.”She has a point. Farms like Sylvanaqua are tiny beans compared to 99 percent of mass meat production. (Impossible has clarified that their comment was not intended to refer to Sylvanaqua or indigenous land management, but to small-scale carbon capture in general.) Plant-based alternatives have billions in venture capital funding to disrupt all animal agriculture, and the 1 percent Newman and I are part of might just be collateral damage if Impossible achieves its mission.“People don’t like being told what to do,” Moses adds. “They don’t like giving things up. So we’re trying to meet the same needs and sustain that behavior, but do so with a much, much smaller environmental footprint.”I nod. On my way out of Impossible HQ, I pass a giant screen in the lobby flashing statistics in millennial pink and mint green: The Impossible Burger takes 87 percent less water, 96 percent less land, and 89 percent fewer emissions than any conventional beef burger in America. In the parking lot I slide into my rental car, thinking seriously about what those numbers could mean for our planet. How plant-based meat factories could offer an alternative to meatpacking plants, which have the highest rates of occupational injury and illness among any U.S. profession. By the time I hit Bay Area rush hour, I’m pretty much on board with a world of Impossible Whoppers.Then my phone bloops. The Google alerts I set up inform me that Impossible has raised another $500 million in VC funding. The company is using it to continue scaling up, putting it ahead of schedule for that 2035 deadline. And suddenly I remember what Pat Brown, wearing a shirt with a cow in a space suit, told me inside a different conference room at this same shiny Silicon Valley office park: “Effectively, the way we achieve our mission is by making it unprofitable to raise cows for food. It’s just that: Compete in the marketplace.”Consumers want cheap meat, but it’s not cheap to raise animals in a way that supports farmers and soil and animal welfare, because for the past 200 years, the market (along with government subsidies that pay farmers to keep growing corn and soybeans) has encouraged the opposite. Industrial animal operations have spearheaded a consumption pattern in which meat became nothing more than flavored and textured protein with a big environmental footprint. As a result, the farms and diets that include a small, sustainable animal element have been marginalized and misunderstood. No matter their intentions, what start-ups like Impossible and Beyond are doing feels to me like putting a plant-based Band-Aid on a broken food system.So what would it take to fix the system? And is there a way to do so by investing in farmers who already know how to care for the environment and produce nourishing food?Christine Su, cofounder and CEO of a tech company called PastureMap, says yes. Back when she was an intern at Impossible Foods, Su grew skeptical of a climate solution that disenfranchised the country’s 40,000-plus grass-based farmers and ranchers. So she left Impossible to spearhead a different approach. PastureMap is software that helps farmers make decisions about raising animals while caring for the land at the same time. It allows users to create organized grazing plans, evaluate their pastures, and even track soil carbon sequestration over time. Su believes we should be figuring out ways to invest in the climate crisis’s first responders, not put them out of business. Farmers, she says, are the ones who have the power to shift agriculture from a carbon source to a carbon sink.Illustration by GIACOMO GAMBINERIWhen I return home to the Hudson Valley, it’s March. The pastures are wispy sepia skeletons, waiting for the sun to hang around long enough to turn them green again. I wake up at 5 a.m. and milk some cows. It was supposed to rain, but it didn’t. I spend two hours trying to fix the salt bowls on the milking stanchions, because even cows need their food (in this case, hay) seasoned. I bottle-feed a calf because his mom was not in the mood for motherhood that day. I get pooped on. It’s messy, unpredictable work. But it’s what I know—a reminder that what I eat is connected to more than just thin air.Out here, far from the protein-molecule patties, lab coats, and rolly desk chairs, I can see how convenient plant-based meat is. I can see how its hyper-scalability makes it easy for people to move toward a diet that includes less sad animals. How the flashy marketing campaigns have people thinking hard about the impact of their grocery lists and getting excited to eat food that doesn’t contribute to the planet’s destruction.But I also worry about plant-based meat’s potential to displace the work of independent farmers, ranchers, and butchers while a few well-funded companies prosper. I worry that what’s being marketed as a substitution for meat will only compound our disintegrating food system and push consumers further away from the reality of where food comes from. And I think about what Chris Newman of Sylvanaqua Farms told me: “Whether you’re harvesting a wheat field or butchering a pig, these living things are giving themselves up to support you. I know that can almost come off as religious, and it’ll make Silicon Valley’s eyes roll back in their heads, but when you have that view of life, it causes you to slow down.”I smell like cow manure again. Aside from the bit on my boots, most of this poop will go into a pile full of hungry microscopic organisms that will spend months turning it into rich black compost. As the weather warms, I’ll rake buckets of it across long vegetable beds, juicing up the soil so it’s strong enough to grow plants that people can eat sans laboratory. Then in May I’ll plant some potatoes, and if I’m lucky and the sun shines, they’ll be fat, starchy tubers by July. I will dig them up, roast them, and eat them—just like that. Magic.Sophia Hampton is a New York–based farmer and whole-animal butcher. Her work explores the relationships between food, animals, and the environment within a changing climate.Explore Bon AppétitMeatRead MorecultureWhere To Buy Charcuterie, Salami, and Cured Meats OnlineBy MacKenzie Chung FegancookingHam Hocks Are My Secret IngredientBy Carla Lalli MusiccookingThe Most Delicious (and Cheapest) Pork Chop Isn’t a Pork Chop at AllBy Amiel StanekcultureThe More Boneless, Skinless Chicken Breasts I Sell, the Worse I FeelBy Sophia HamptonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-20", "author": ["Condé Nast", "Sophia Hampton"]}