{"id": "b9457ad7865fe66061a24ea9fb6d9ff2", "url": "https://www.bonappetit.com/city-guides/new-york/venue/ugly-baby", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Ugly Baby Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkUgly BabyLiterally the hottest Thai restaurant in Carroll GardensFacebookPinterestTwitterEmailAlex LauGO: to cry, sweat, sniffle, and repeat after euphorically eating all the chile-powered noodles, soups, whole fish, and more at 2018 Hot 10 winner Ugly Baby. It's addictive—just try to stop yourself from ordering another curry.ORDER THE: brothy whole fish, stir-fried squid, mushroom curry, and legendary khao soi, the iconic noodle soup that initially put chef Sirichai Sreparplarn on the map. You will probably be told you ordered too much food or that it will be very spicy—don’t give in; this is what you came for. Plus, you can wash it all down with the quirky list of wines and craft beers.THE VIBE IS: kind of wacky. Tables are crammed into every inch of the space, menus are printed on orange construction paper, and the staff will often dress up on the weekends—we loved Elvis night. You’ll find mostly locals who live in the area, sweating it out inside or ordering take-out.PRACTICAL STUFF: Open every day: Monday to Friday, 5 p.m. to 10:30 p.m., and Saturday and Sunday, noon to 3:30 p.m. and 5 p.m. to 10:30 p.m.WE ALSO LOVEMomofuku KoHang out with chefs at David Chang’s continually groundbreaking spot in the East VillageUncle BoonsBrave the spice at NoLiTa's best dinner-with-friends jointTanoreenThe bucket-list-worthy Middle Eastern destination in Bay RidgeExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-11-12", "author": ["Elyse Inamine"]}