{"id": "b94bdf210846431830fd3be3d3dd77b1", "url": "https://www.bonappetit.com/story/noodle-kugel", "year": 2019.0, "month": 9.0, "day": 3.0, "content": "We Need To Talk About Noodle Kugel | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWe Need To Talk About Noodle KugelTo know kugel is to argue about kugel.By Sarah JampelSeptember 16, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailFor some, the beginning of autumn is about apple-picking, or back-to-school, or the dread of seasonal affective disorder. For me, the beginning of autumn is about all that, yes—but also the beginning of noodle kugel season. The Jewish High Holidays fall in September or October and with them comes the opportunity to gather for large meals and eat servings upon servings of the stuff. We decided to publish our kugel recipe to coincide with Rosh Hashanah, but it is my culinary duty to convince you to make this even if you don’t celebrate—and then to make it again whenever you’re in need of comfort food later in the year.Maybe that’s a hard sell. The way I see it, there are three kugel camps: First, there are those who know kugel and love kugel and would happily eat it any time of year (I include myself in this category). These people often have have strong opinions about what kugel \"should\" be, from the size of the noodles to the composition of the topping. Then, there are those who know kugel but wouldn’t touch it with a 10-foot pole. These people think all kugel is bad (to this group, I say: You haven’t had a good one!). And finally, there are those who do not know kugel at all (if you received our kugel recipe in your inbox this weekend—you do subscribe to our newsletters, right?—and thought “noodle what?,” maybe you fit here).And I know I’m generalizing, but I’ve noticed that people who do not know kugel are not always, ahem, so excited about the concept. Slightly sweet noodles suspended in a creamy custard? Served with dinner but sorta reminiscent of dessert? Sometimes contains raisins, sometimes apples, sometimes pineapple? Simultaneously mushy and crisp?You're looking at the foundation of our kugel.\nAlex LauYes, I know you need some convincing!So let’s start at the beginning. What is kugel? The category of kugel, which basically refers to an Ashkenazi Jewish casserole where some sort of starch like noodles, rice, bread, or potatoes is bound together and baked is so broad that people have written entire books on the subject (and children’s books, too). And even once you get into the category of noodle kugel (a.k.a. lokshen kugel), you’ll find some are sweet, some are savory, and some are in limbo (Jerusalem kugel, for example, is flavored with lots of black pepper and caramelized sugar).Among people who became familiar with kugel at a young age, maybe at Shabbat luncheons or break-fast after Yom Kippur, kugel opinions run deep. Digital director Carey Polis believes that kugel needs to be either sweet or savory—not wishy-washy—and that it must have a crispy top, but not necessarily a crispy topping (a fine distinction!). It can have cottage cheese or raisins, Carey told me, but never both. Editor-in-chief Adam Rapoport will not under any circumstances condone a raisin but, hey, senior food editor Molly Baz, who grew up eating kugel at a close friend’s house, doesn’t mind them. Social media manager Emily Schultz advocates for a broiled top and a minimal amount of sugar. And you can read so many more seemingly-arbitrary-but-very-closely-held kugel preferences here, in your free time.What is a \"perfect\" kugel? The answer is up to you.\nAlex LauSince noodle kugel wavers between being incredibly nostalgic for some and incredibly unfamiliar for others, it was tricky to strike the right balance during the recipe development process. How could we come up with something widely appealing, appetizing to even the unfamiliar, while reminding others of the kugel they grew up eating?Through lots of trials and tribulations, that’s how. I made a Google spreadsheet (cleverly titled…“kugel”) in which I compared the various quantities of noodles, dairy (cream cheese, sour cream, cottage cheese, heavy cream, yogurt), butter, eggs, add-ins (vanilla, cinnamon, lemon zest, salt), along with baking dish, time, and temperature.My first variation had cottage cheese, plenty of sugar, and my mom’s signature cornflake topping. It was a non-starter. Too sweet, the tasters said. Not enough noodle crispage. So I took off the topping (you can email me for the recipe!!!). I nixed the cottage cheese. Then I reintroduced it. I cut back the sugar—too dramatically, it turns out—and increased the eggs so that the whole mixture puffed in the oven. I played with different kinds of dairy. I added lemon zest. I removed lemon zest. I putzed! I fussed! I schmoozed! I schlepped! I kvetched! I ate a lot of kugel until, finally, we landed on one (so soft! so bouncy!) we felt would please the fanatics, persuade the haters, and entice the uninitiated. Some kugel-naïve were excited to try round after round (Alex Delany and Chris Morocco, thanks for your enthusiasm), while others (I won’t name names) could never be convinced. And that’s okay. Not everything is for everyone.In the end, here’s how I’d describe our kugel: Just slightly sweet. Just slightly eggy. Definitely not diet food. Lots of surface area for crispy noodles. Curdy in the best sense of the word (from cottage cheese). Buttery. Balanced between airy (like a soufflé) and custardy (like a pudding). Sliceable. Very good cold the next day. Sort of like rice pudding, but firmer—and with pasta instead of rice. It’s beloved! It’s reviled! And it’s ready for you to taste and decide for yourself.Get the recipe:Basically Noodle KugelAfter an intense internal debate about what a noodle kugel should be—naked or cereal-topped? wide noodles or extra-wide noodles? souffléed or custardy? sweet or...savory?!—this is where we landed.View RecipeExplore Bon AppétitEgg NoodleNoodleKugelJewishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-16", "author": ["Condé Nast", "Sarah Jampel"]}