{"id": "b95898fb72fb293810f9ac1ae1ac416b", "url": "https://www.bonappetit.com/recipe/grand-aioli", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grand Aioli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrand AioliBy Chris MoroccoMay 22, 20184.2(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Chris MoroccoEmailPinterestPrintEmailPinterestPrintLet this recipe be the excuse you need to dip all your farm-fresh foods into garlicky mayonnaise.Ingredients4 servings 2large egg yolks1tsp. Dijon mustard1garlic clove, finely gratedPinch of kosher salt¾cup extra-virgin olive oil2Tbsp. fresh lemon juice2lb. vegetables (such as blanched long beans, wax beans, and/or sugar snap peas; sliced cucumbers; cherry tomatoes; radishes; and/or boiled fingerling potatoes)1½lb. protein (such as sliced ham, cooked shrimp, and/or boiled eggs)PreparationCombine egg yolks, mustard, garlic, and a pinch of salt in a medium bowl set on top of a kitchen towel laid across a small heavy pot (this setup will anchor the bowl while you whisk so you have a free hand for pouring). Whisking constantly, add oil to egg mixture, starting with just a few drops and gradually increasing amount to a fine steady stream. Stop adding if there is any unincorporated oil in the bowl; going slow is key. Keep whisking until emulsified, then whisk in lemon juice. Taste and season aioli with more salt if needed. Serve with vegetables and proteins of choice.How would you rate Grand Aioli?Leave a ReviewTell us what you thinkReviews (2)Back to TopTrianglePretty good but I thought there was a bit too much oil for the amount of lemon juice in here? Maybe I did something wrong but I followed instructions to a tee. After tasting I added some red wine vinegar to balance it out and another clove of garlic for some extra flavor. AnonymousIndianapolis, IN9/20/2019Time for you to get with the stick blender method for making mayo/aioli/aioli! No more faffing about with oil drips and elbow grease!elyssUK5/27/2019Explore Bon AppétitDipCruditéCondimentFrenchEuropeanQuickSnackStarterDairy-FreeGluten-FreeFourth Of JulyMemorial DayLabor DayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}