{"id": "b958bee4599a42d812d8ed63837589bd", "url": "https://www.bonappetit.com/story/stop-throwing-out-broccoli-stems", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Stop Throwing Out Your Broccoli Stems! They're Delicious! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingStop Throwing Out Your Broccoli Stems! They're Delicious!They're tasty and under-appreciated. You just have to know how to cook with them.By Alex DelanySeptember 25, 2018FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ANNA BILLINGSKOGFacebookTwitterEmailThere are certain 2-for-1 deals that people expect and rely on. These include, but are not limited to, Bath and Body Works candles, bags of Tostito’s tortilla chips, or a new line on your unlimited data plan. But then there are buy-one-get-one deals that go unrecognized. And we’d like to talk about the most underrated: buying a head of broccoli and getting broccoli stems for free.Now, we’re not talking about broccoli \"crowns\" here, which are just heads of broccoli that have had the stems pre-removed. (And are needlessly expensive—you're just paying them to take the stem off for you.). We’re talking about proper heads of broccoli with thick, long stems, the kind you'd grab and pretend to sing into like they were microphones when you were a kid. (Just me?)Broccoli stems are most often tossed in the garbage without any thought. The fluffy little florets—the buds at the top of the stalk that pick up texture and absorb flavors and seasoning beautifully—get all of the love. But the stems can absolutely be eaten if you treat them right, and are completely delicious—like the florets, but more mild and sweet, almost like kohlrabi.How do you \"treat them right,\" you ask? Well, regardless of how you're going to prepare broccoli stems, we recommend cutting off the bottom 1-2 inches, which can be quite tough and woody, and throwing that out before anything else happens. After that, how you prep your broccoli stems has everything to do with how you'll be cooking them, the biggest question being whether or not you'll need to peel them.Slicing stems make them easy to cook, especially when they're sliced into coins.\nPhoto by Caleb Adams, Food Styling by Rhoda Boone and  Jennifer OphirThe skin of the broccoli stem tends to gets tougher and more fibrous the farther away from the florets you get, but if you’re roasting your broccoli stems in a hot oven, you can usually leave most of the skin on, slice them, and be on your merry way. The prolonged exposure to dry heat and a hot surface will soften the skin to the point where it won’t be annoying to eat.But if you’re going to put your stems into a stir-fry, cook them in something like a frittata, or blanch them for a dipping scenario, you should definitely peel them. Basically, if they’re being cooked for a long time, leave the skin on, and if it’s just for a few minutes, peel it. And if you're eating the broccoli stems raw—which we highly recommend—peeling and chopping or slicing thinly as possible is non-negotiable.Peeling broccoli stems is easy. It goes exactly as you’d expect it to go. Run a Y-peeler down the sides of the stem, until the darker green skin gives way to the pale green, almost-white flesh. (Sometimes, if we're working with a broccoli stem that is especially gnarled or bumpy, we find that using a knife can actually be easier than using a peeler. You do you!) That’s all you need to do. Presto change-o!But whether or not you peel them, you should definitely be cutting, chopping, or slicing your broccoli stems. No one wants to eat a big log of broccoli stem. Not even us, the people telling you to eat broccoli stems. We like them best in thin, circular coins or diced for the most pleasant texture.We really just want you to use broccoli stems. It doesn’t matter how you do it. Forge your own path. And while we don’t formally endorse picking broccoli stems out of the world’s trash cans and cooking them, we do endorse making sure they never end up there in the first place.Need a roasted broccoli recipe? Here ya' go:Crispy Roasted Broccoli with Tahini SauceHigh heat and the simplest sauce ever make for roasted veggies that feel like a dish, not an afterthought.View RecipeExplore Bon AppétitBroccoliBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-25", "author": ["Condé Nast", "Alex Delany"]}