{"id": "b98275eef20a0afbe481d3aa753e717d", "url": "https://www.bonappetit.com/recipe/smoked-tofu-larb-with-lemongrass", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Smoked Tofu Larb With Lemongrass Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueSmoked Tofu Larb With LemongrassBy Lara LeeNovember 12, 20204.5(17)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'mytrek Brown, Props from Meilen CeramicsEmailPinterestPrintEmailPinterestPrintThis meat-free version of the Laotian and Thai dish from Lara Lee, author of Coconut and Sambal, combines smoked tofu with pops of crunchy sesame seeds and a kick of lime dressing. Toasted rice powder gives larb its distinct pebbled texture and nutty flavor. Making it is easy: Slowly toast uncooked glutinous (sticky) rice in a pan until it’s golden and deliciously fragrant, then grind in a spice mill until it’s the consistency of coarsely cracked black pepper. Make extra rice powder and keep the leftovers in a jar to add texture to noodles and salads…or another batch of larb.Ingredients4 Servings⅓cup (or more) fresh lime juice¼cup light soy sauce1Tbsp. palm or light brown sugar2tsp. (or more) chile powder1tsp. kosher salt, plus more¼cup glutinous rice2Tbsp. vegetable oil6small shallots, thinly sliced3–4lemongrass stalks, bottom third only, tough outer layers removed, finely chopped1½lb. smoked or firm tofu, drained, cut into ¼” cubes2Tbsp. black sesame seeds, plus more1¼cups chopped mixed tender herbs (such as Thai basil and/or mint)Tender lettuce leaves (for serving)PreparationStep 1Mix lime juice, soy sauce, palm sugar, chile powder, and 1 tsp. salt in a large bowl to combine; set dressing aside.Step 2Toast rice in a dry medium skillet over medium heat, stirring occasionally, until golden and nutty-smelling, 6–8 minutes. Transfer to a spice mill and let cool, then coarsely grind. Set rice powder aside. Wipe out pan.Step 3Heat oil in same pan over medium. Cook shallots and lemongrass, stirring often, until softened, about 4 minutes. Scrape into bowl with reserved dressing.Step 4Add tofu, 2 Tbsp. sesame seeds, and reserved rice powder to bowl and gently toss to combine. Season with salt and add more chile powder and lime juice if needed.Step 5Stir herbs into larb and serve with lettuce leaves and more sesame seeds for assembling.How would you rate Smoked Tofu Larb With Lemongrass?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleReally enjoyed this meat-free larb! I tweaked recipe slightly by crumbling the tofu and frying in two tablespoons of oil for about eight minutes (until browned). That really helped recreate the ‘mince’ found normally in larb. Katharine Australia9/26/2021I LOVE this recipe. Same with the smoked tofu though... I just use marinated tofu from Whole Foods. \nOne question I have is about the rice. Sometimes the rice is very grainy in the dish. Am I not grinding it long enough or not toasting rice long enough? AspenZAspen2/12/2021Super delicious, quick, easy. Used 16 oz regular firm tofu, short-grain Thai rice because I didn’t have glutinous, and a dash of cayenne instead of chili powder. Came out great. Used mortar and pestle for grinding rice. Used Thai basil (2 small Whole Foods packages), mint (half a small Whole Foods package), and cilantro (one small Whole Foods package).AnonymousIndianapolis, IN11/11/2020This  was wonderful. So delcious and  so easy to make.  I could  only find smoked tofu in 11oz packages. I made the same amount of dressing, just less tofu. 11 oz of tofu was plenty. I also didn't have the full amount of basil and mint as the recipe, but what I had worked just fine.  We ate it all and thoroughly enjoyed it. Will make this for friends.AnonymousCedar Grove NC11/10/2020Wow! So flavorful and relatively easy aside from grinding the rice powder. We didn’t have smoked tofu and added a tiny bit of liquid smoke instead, which I think was key to the other flavors. Herb wise we used basil and mint and it was great. Will definitely make again.FierybellySeattle, WA11/8/2020Explore Bon AppétitSaladLaotianSoutheast AsianAsianThaiTofuOther IngredientsLemongrassHerbs & SpicesWeeknight MealsQuickEasySideMainVeganVegetarianDairy-FreeHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-02", "author": ["Condé Nast", "Lara Lee"]}