{"id": "b987785c91c3ea448e3251b132b457fe", "url": "https://www.bonappetit.com/recipe/pork-and-scallion-dumplings-with-crispy-skirt", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "Pork and Scallion Dumplings With Crispy Skirt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPork and Scallion Dumplings With Crispy SkirtBy Sohla El-WayllyMay 10, 20204.6(33)Read ReviewsTriangleEmailPinterestPrintPhoto and Food Styling by Sohla El-WayllyEmailPinterestPrintEmailPinterestPrintIf the words crispy dumpling skirt don't send you running to your stove, we don't know what will. Instead of steaming these dumplings in water, we simmer them in a vinegary cornstarch and flour slurry that creates a lacy, crunchy golden crust as the water evaporates and the dumplings brown. The vinegar adds tang, but also creates the lightest and crispiest skirt, a pro move we borrowed from Dumpling Galaxy in Flushing, Queens. Let's talk swaps: If you don’t have rice vinegar, apple cider vinegar or white wine vinegar work, too. If you don’t have cornstarch, use another starch like tapioca, arrowroot, or potato, or use 100 percent flour. You can use beef or lamb in place of the pork; if you use a leaner protein, like chicken or turkey, add 1 Tbsp. oil to the mixture to compensate. Watch Sohla makes dumplings in her home kitchen here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMedium Bowl$17 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEASmall Bowl$13 At AmazonSpoon$24.69 At AmazonMicroplane$16 At AmazonMeasuring Spoons$10 At Bon Appétit MarketGlass Measuring Cup$19.99 At AmazonLarge Nonstick Skillet$50 At AmazonIngredientsMakes 248oz. ground pork (not lean)8scallions1\" piece ginger2tsp. plus 2 Tbsp. soy sauce1tsp. kosher salt, divided½tsp. freshly ground white or black pepper243½\"-diameter wonton wrappers5Tbsp. unseasoned rice vinegar, divided4tsp. all-purpose flour4tsp. cornstarch6–8tsp. vegetable oil, divided2tsp. chili oil (optional)PreparationStep 1Place 8 oz. ground pork (not lean) in a medium bowl. Trim roots and 1\" from tops of 8 scallions; discard. Thinly slice; transfer 2 Tbsp. scallion to a small bowl and set aside for dipping sauce. Coarsely chop remaining scallions and add to bowl with pork.Step 2Peel 1\" piece ginger with a spoon and finely grate into bowl with pork using a Microplane.Step 3Add 2 tsp. soy sauce, ¾ tsp. kosher salt, and ½ tsp. freshly ground white or black pepper to pork. Rake through pork with chopsticks or your hands to quickly but thoroughly combine ingredients.Step 4Get ready to form the dumplings: Place twenty-four 3½\"-diameter wonton wrappers on a work surface and cover with a damp kitchen towel to prevent them from drying out. Place a small bowl of water nearby.Step 5Place 1 wrapper in the palm of your nondominant hand. Scoop out a rounded teaspoonful of filling and place into center of wrapper. Use teaspoon to nudge filling into a football shape. (This will make it easier to fold the wrapper around it.)Photo and Food Styling by Sohla El-Waylly Step 6Dip a finger on your dominant hand in water and lightly moisten the half of the wrapper that is closest to you. Using your dominant hand, fold wrapper in half over filling and pinch closed using both of your hands. Using your fingers, make 6–7 pleats along the edge, pressing each pleat closed after you form it. Repeat process with remaining wrappers and filling.Photo and Food Styling by Sohla El-Waylly Step 7To make the slurry for your crispy skirt, whisk 3 Tbsp. unseasoned rice vinegar, 4 tsp. all-purpose flour, 4 tsp. cornstarch, remaining ¼ tsp. kosher salt, and 2 cups water in a large measuring glass to combine.Step 8Now you are ready to cook your dumplings. Heat 2 tsp. vegetable oil in a large nonstick skillet over medium-high. Arrange 6–10 dumplings in pan (steam fewer at a time if you want a more crispy skirt) and cook until they start to sizzle, about 1 minute. (You don’t want them to take on any color at this point.) Stir slurry well and add a generous ½ cup to pan. Cover and steam dumplings 5 minutes. Remove lid. Dumplings should be plumped and cooked through and most of the water should have evaporated, leaving a thin lacy layer of slurry beneath them. Cover and cook a minute longer if needed.Step 9Uncover dumplings and cook until all the liquid evaporates from slurry and it becomes a crisp, golden brown skirt, about 2 minutes. You may need to rotate your pan as some areas will brown faster than others.Photo and Food Styling by Sohla El-WayllyStep 10Invert a plate over pan and flip dumplings out onto plate. (You can also slide them out onto a plate if that’s more your comfort level.) Repeat cooking process with remaining dumplings and slurry (stirring well before each batch) in 2–3 more batches, adding 2 tsp. vegetable oil to pan after each batch.Photo and Food Styling by Sohla El-Waylly Step 11While the dumplings are cooking, make the dipping sauce. Add 2 tsp. chili oil (if using), remaining 2 Tbsp. unseasoned rice vinegar, and remaining 2 Tbsp. soy sauce to reserved sliced scallions and mix well.Step 12Serve dumplings with sauce alongside.Photo and Food Styling by Sohla El-WayllyStep 13Do ahead: Filling can be made 1 day ahead; cover and chill. Dumplings can be formed 3 months ahead; freeze on a parchment-lined rimmed baking sheet until firm, at least 12 hours. Transfer to an airtight container and keep frozen.\nCook from frozen (time will not change).How would you rate Pork and Scallion Dumplings With Crispy Skirt?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleI improvised with my own healhty version of Butterball turkey and veggie dumplings and did not follow that recipe. Used for 44 dumplings.\n1) 1 lb of ground turkey\n2) 1 lb package of Shanghai styled dumpling wrappers which are thicker vs the Hong Kong style ones, available at Asian markets\n3) Used 1/4 pack of frozen veggies (peas, carrots, lima beans, string beans)\n4) Improvised seasoning: avodcao oil, sesame oil, red pepper flakes, white pepper, soysauce, sake wine, garlic powder, sugar, corn starch\nI pan fried both sides of the dumplings until golden brown in a large TFAL non stick frying pan. Then added the slurry mixture and steamed covered for 5 minutes. Slurry was still not done then. Kept it going without the pan cover until the skirt looked like crispy thin chips. I didn't get the large holes in the skirt, they were like little ones (similar to when pancake batter bubbles as you cook them, before flipping them over in pan.) It tastes very crispy and reminded me of what chefs sometimes put on top of their entrees for visual presentaton, a piece of that lacy skirt.Haley100229/25/2021Followed the recipe and it nearly ruined the first pan we tried it in. It must need to be a very specific type of non-stick pan. The bottoms of all the dumplings were completely attached to the pan using low heatAnonymous7/12/2021We are obsessed with this recipe. It is a both fun and delicious hands-on kitchen project! The crispy skirt is uniquely wonderful, and the dipping sauce introduced us to the simple beauty of rice vinegar. We did find that it works best to eat the dumplings fresh out of the pan, so maybe don't plan to sit down and eat these with a complete meal. Eat as you go! HannahTexas1/22/2021The lacy skirt didn't really \"lace\" for me. I didn't get the big nice bubbles, mine was more flat and uniform. Anyone have any tricks for how to get it looking like the picture?dementoArizona7/5/2020The skirt didn’t work for me, burned right away. I tried another batch on a lower temp and it still burned. BUT, the dumplings were great and so was the dipping sauce! Maybe one day I’ll try this technique again. yagurlcarlyTucson, Arizona6/28/2020I tried the crispy skirt with frozen dumplings but did it in a well seasoned cast iron skillet instead of a nonstick. WOULD NOT RECOMMEND. Don't use a cast iron... I'll try again with a regular nonstick next time. AnonymousMinneapolis, MN6/20/2020I liked the “skirt” idea so I would make that again. Great idea! The recipe for the filling is seriously under seasoned, so would completely readjust that part as it is mediocre as is.Anonymous6/14/2020I loved this so much. The skirt was a revelation--I thought I had eaten a lot of dumplings but I'd never encountered this before. Thanks for sharing.GearsLA6/7/2020so so tasty, I've never made dumplings before but they came out delicious...if a little on the ugly side. I would ABSOLUTELY make again maybe in a little smaller of a pan to control the skirt a bit more but das it.AnonymousWyoming 5/27/2020These are good, but not great. The filling is a little plain. I found the skirt a bit tricky - I'd recommend using more of a 'medium' pan as opposed to a 'large' one, which helps prevent the slurry from spreading so thinly that it burns.AnonymousNew York5/26/2020Made this in the quaran-times, so used what I had in the freezer, ended up using turkey instead of pork and it still tasted great! Made the mistake on the first bunch of only using a little bit of the slurry, but you really do need to use at least half a cup. So good! Will be making this again soon. :)Lizzi OMinnesota5/23/2020Love! I made it with frozen dumplings so I haven’t tried the filling but the lacy skirt was such a hit. Will make the full recipe soon! Boston5/21/2020Yes! Love this recipe. Everyone loved the lacy crispy skirt! AnonymousBoston5/21/2020I made this from the video before this was posted! The wrappers were easier than I expected and these are delicious. Ham's recommendation to pinch the wrapper together in the center and then pleating helps me a lot. I loved adding some black vinegar to the dipping sauce. tysm Sohla!!hhiranoSeattle5/21/2020I already had frozen dumplings but decided to try out the crispy skirt from this recipe. Followed the instructions from the recipe instead of the ones on the dumpling bag and it turned out fantastic! Only trouble is if your pan is spotty with the nonstick in some places like mine is; I had to use a spatula and dig it up in places so it wasn't as pretty but still darn delicious.riceanyoneWichita, KS5/21/2020Explore Bon AppétitDumplingChineseEast AsianAsianGround PorkPorkMeatScallionOnionVegetableGingerHerbs & SpicesMainSideStarterDairy-FreeNut-FreeSteamLunar New YearDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-10", "author": ["Condé Nast", "Sohla El-Waylly"]}