{"id": "b98bfc35592cc5617040855d28d5d5f0", "url": "https://www.bonappetit.com/story/step-counter", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "My Step Counter Obsession Got Worse During Quarantine  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureConfessions of an Obsessive Quarantine Step CounterI knew the hallowed 10,000 steps a day marker was created by a company selling pedometers. But it was a metric I could control—until I couldn't. By Brodie LancasterDecember 15, 2020FacebookTwitterEmailIllustration by Alva SkogFacebookTwitterEmailYou're averaging fewer steps a day than last year.On average, last week's steps were less than the week before.Since the start of the pandemic, the alerts from the Health app on my iPhone have felt more pointed than usual. I know it's bleating out an emotionless statement of fact, but if it were a person, it'd be the parent who's not mad—just disappointed.Since March 2020, when I carried my laptop home from work for the last time and my social life dissolved, the daily incidental exercise I didn't even realize I was doing to get around my city evaporated. A week later my Pilates studio turned off its lights and turned on its webcam. I now had to walk only about five steps from the Zoom call to the mat where I tried to undo all the damage my new house-bound life was doing to my body, and the accelerometer inside my phone that calculates my movement had less and less to do.Meanwhile, almost overnight, peak-hour traffic was replaced with bicyclists, and people filled the parks and walking tracks around Melbourne. I became one of those people. We all had the same idea: spend some time freaking out and narrating news headlines with a friend under the guise of getting fresh air, and participate in the global activity of white people: Getting Our Steps In.For all my 30 years, my relationship to exercise has been a complicated one, especially when it's done in public. I've been fat my entire life, and for the first half of it I subscribed to what I was either told directly or absorbed through culture and conversations: people whose bodies are smaller are behaving \"right.\" They eat well and they exercise; fat people do not. They're healthy; fat people are not. To stop being fat by mimicking thin people's actions is to choose to pursue not just health but goodness.I was first exposed to the fat-acceptance movement online when I was nearing my 20s. I immediately felt drawn to the communities that sprang from it. Sometimes diluted by the more palatable tag of \"body positivity,\" fat acceptance means, among other things, divorcing of our size from ideas of health, goodness, and inherent human value. In more recent years I've read vital writing by people experiencing invisible illness and chronic conditions, proving that health is something that cannot be seen, no matter a person's weight.I came to understand that exercise could be something besides a punishment or path to a thinner, and therefore “better,” self.This newfound perspective made me appreciate my body’s worth and potential. I came to understand that exercise could be something besides a punishment or path to a thinner, and therefore “better,” self. In addition to a weekly Pilates class, a swim when the weather is good and the incidental exercise I get while living my life, going for a walk has always been my go-to.When walking endless laps around parks and trails became my only way to accumulate steps, it lost some of its appeal, but was still a welcome way to escape the monotony of life inside my apartment. Then Melbourne moved to a strict \"stage 4\" lockdown model, and outdoor exercise was restricted to an hour per day. Motion was an unspoken part of the rule; we couldn't stop and sit while outside. Instead, we were always moving, making the most of the time allowance. (These restrictions were first scheduled to last six weeks. They didn't begin to lift until fifteen weeks later.)Suddenly, every step felt heavier and more consequential. While the logical part of my brain knew that hallowed 10,000 steps a day marker was a figure cooked up by a company selling pedometers and not an indicator of optimal physical performance, it still acted as my white whale during those dormant months.In normal life I'd accumulate those steps running to catch a train or dancing at a concert. Now, I could walk to grab groceries on my lunch break—that would clock up around 4,000 steps. If I factored in time for a walk before work, I thought I was starting my day off on a good note. But I'd barely be 10 minutes from my house before I was checking my Health app to see how I was tracking. Only 1,500 steps? I'd come home from my hour of state-sanctioned constant movement to see I had only registered 6,500 steps and feel disappointed, as if I'd wasted the time by not pushing my body longer or testing the rules.I started carrying my phone everywhere: walking to and from the laundry room and mailbox, tucked in the waistband of my leggings as I weeded my small, inconsequential garden. One weekend I turned out the lights, blasted Dua Lipa remixes and danced on my own – clutching my phone in my hand the entire time. Terrifying my cat was a small price to pay to hit that sacred number.Then, just as the rules changed to allow more time outdoors, I stood up from my desk chair one morning and felt something tweak in my lower back. A few days later, I could barely sit on the couch without being in extreme pain.I feel a decent amount of shame that one of the first things I thought of was the graph that my Health app would offer up at the end of that week.An emergency appointment with an osteopath—one where I cried helplessly as she tied up my shoelaces for me—confirmed that I'd pulled a muscle, and it would get worse before it started to get better. I was told to limit my walks to no more than 10 minutes, and only do very gentle floor exercises. I feel a decent amount of shame that one of the first things I thought of was the graph that my Health app would offer up at the end of that week.After a few days of plodding walks and repetitive stretches, I started to feel more like my old self and decided to return to my hour-long constitutional. Almost immediately after arriving home, my body protested and I was back at zero again, barely able to leave the apartment without my back pain flaring up.The objectivity of the step-counter is both its blessing and failure: it doesn’t know the specifics of my body or the history of my health, it just tells me what it knows, which is how quickly or for how long I propelled it through the air. I was the one who assigned value to its reports. Despite knowing that 10,000 steps was not the ultimate marker of fitness the Pedometer Industrial Complex had made itself out to be, it was a metric I could control, to some extent, during a lonely and disorienting time—one when news headlines were all about health, sickness, and whether my weight put me at greater risk for COVID-19. It took injuring myself to realize I’d been using the Health app’s objective assessments of movement—against all that the teachings of fat acceptance had instilled in me—to characterize myself as good, well and healthy. Or not.Being forced to take things slow, in a painful way I do not recommend (Google 'hip flexor stretch' and do some for a few minutes right now, then come back and finish reading this), made the numbers truly meaningless. What good was a higher step count for a day if it was followed by a week on the couch? The lockdown rules already put me in competition with the clock; I didn’t want to also compete with my body and my ability to feel good. As I tuned in to what my body needed and was capable of, the pain tempered. I eased myself into the sweet spot between challenging myself and pushing my body too hard. Rather than tracking digits on a screen, I measured my success by the clear head I got from going on a walk, and the ability to go a little farther each day.And sometimes that feeling, it was important for me to remember, came when my phone was out of reach, not clocking what I'm doing. The hours I spend doing Pilates or clumsily following Forward Space dance classes or swimming laps in the pool don’t fail to exist just because there’s no record of them. It’s this kind of untracked, unmeasured exercise that taps me on the shoulder and reminds me that movement itself is the goal, not the graph that comes from obsessively recording it.Explore Bon AppétitHealthyishSelf CareessayRead MoreCoronavirusIt Took a Global Pandemic, But I'm Finally Calling My MomBy Phillip PicardiRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-15", "author": ["Condé Nast", "Brodie Lancaster"]}