{"id": "b98fd00c515530facb009bab2263a656", "url": "https://www.bonappetit.com/recipe/swedish-glogg", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Swedish Glögg Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2020 IssueSwedish GlöggBy Marcus SamuelssonDecember 1, 20204.7(24)Read ReviewsTriangleEmailPinterestPrintPhoto by Marcus NilssonEmailPinterestPrintEmailPinterestPrint“In Sweden the holiday season revolves around one beverage: glögg,” says chef Marcus Samuelsson. “Seemingly every single meal during the month of December begins (and ends) with a glass (or three) of this warm ruby red mulled wine. When I was growing up, the moment my grandmother started to cook up a batch on her stove signaled that the festivities were about to begin. I knew that delicious spreads of baked hams, herring prepared in a variety of ways, lutfisk, and gubbröra would be landing on the dining room table in no time. Oh, and I was amped to realize that it wouldn’t be long until I’d receive some Christmas presents too.” Packed with cinnamon, cardamom, and ginger, get ready for your entire home to be infused with the scent of the holidays. This recipe is adapted from the cookbook ‘Aquavit and the New Scandinavian Cuisine,’ by Marcus Samuelsson.IngredientsMakes about 1½ quarts2cinnamon sticks, broken into pieces1tsp. cardamom pods1small piece ginger, peeledZest of ½ orange6whole cloves½cup vodka1750-ml bottle dry red wine1cup ruby port or Madeira1cup granulated sugar1Tbsp. vanilla sugar½blanched whole almonds½cup dark raisinsPreparationStep 1Crush cinnamon and cardamom in a mortar and pestle (or put them on a cutting board and crush with the bottom of a heavy pot.) Transfer to a small glass jar and add ginger, orange zest, cloves, and vodka. Let sit 1 day.Step 2Strain vodka through a fine-mesh sieve into a large saucepan; discard spices. Add wine, port, granulated sugar, vanilla sugar, almonds, and raisins and heat over medium just until bubbles start to form around the edges.Step 3Ladle glögg into mugs, with a few almonds and raisins in each one. Keep any remaining glögg warm over very low heat until ready to serve (do not let it boil).How would you rate Swedish Glögg?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleAmazing Glögg recipe and a real crowd pleaser for our New Year’s socially-distanced outdoor celebration. One adjustment: made a sugar syrup at a 2:1 ratio with water, without boiling, to avoid sugar settling in the wine. Dannomanno Summit, NJ1/3/2021Missing the measurement on the almonds. I'm assuming it was supposed to be a half cup?Alex StewartAtlanta, GA1/2/2021Can you add vanilla extract in place of vanilla sugar? If so, how much would you recommend - 1/2 - 1 tsp?Shelby Texas12/8/2020So freaking good. Would make a tiny bit spicier next time. Ims 12/6/2020What is the calories, carbs, fats, etc., of this and any of your recipes? That would be most helpful. Knowing if it is, or can be adapted, Keto friendly, would be very nice. SusieOregon12/4/2020I haven’t had this yet so I won’t rate the recipe. But I love the raisins and nuts at the bottom of the cup. This is exactly how I had glögg in Copenhagen. It’s a nice wine soaked snack to enjoy once you finish your glass. AnonymousCleveland, OH12/4/2020Explore Bon AppétitHot DrinkDrinks AllCocktailSwedishScandinavianEuropeanPortAlcohol & Other DrinksAlmondNutRaisinDried FruitFruitWinterEasyDrinksChristmasNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}