{"id": "b99b4e23b8ec2a0c23f43fda97eee0c6", "url": "https://www.bonappetit.com/story/zooba-nyc-egyptian-food", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "I Came to Zooba NYC for the Design, but I Stayed for the Incredible Egyptian Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Came to Zooba for the Design, but I Stayed for the Incredible Egyptian FoodI’ve become the unofficial ambassador of this fast-casual chain.By Christa GuerraFebruary 11, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I first noticed Zooba, an Egyptian fast-casual joint that opened its first New York City outpost last September, because of the design. The graphic to-go bags that line the entrance. The fun food posters on the wall that remind me of works by famed Egyptian artist Hassan Hajjaj (he’s photographed Cardi B!). And have you seen the LED ceiling?! I had serious design envy.It's all inspired by the streets of Cairo, with the branding by playful brand agency &Walsh and the restaurant design by creative studio AE Superlab. When I first went to Zooba, I thought it would just be to check out the decor. But when I sat down to eat, I ended up falling in love. Every dish was so delicious and nostalgic for me, having grown up not too far from Egypt in Saudi Arabia. Eating ful medames—stewed fava beans and Egypt’s national dish—was my family’s Sunday ritual as a kid. Now, going to Zooba is my weekend ritual in my home away from home.All my friends are at Zooba: za'atar fries, baladi bread, and bessara (fava bean dip).\nFrom the oozy cheese hawawshi (fluffy baladi bread stuffed with a tender meat-veg patty and creamy roumy cheese) to the pickled lemon ta’ameya (freshly fried balls of mashed fava beans) to the za’atar fries, Zooba is my go-to spot for lunch. And dinner. And...really anytime I’m craving Egyptian food (which is often). I’ve basically become Zooba’s unofficial ambassador, taking any friend in town or the whole art team to the restaurant on a given day. Design might have been the gateway, but it’s really all about the Egyptian food here.Go there: ZoobaExplore Bon AppétitHighly RecommendRestaurantsNew York CityRead MorerestaurantsMy Favorite Sausage in NYC Is Served at a Ukrainian Joint Under a Chiropractor's OfficeBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Christa Guerra"]}