{"id": "b9ab5c4b9fdef41186a7246fd329f165", "url": "https://www.bonappetit.com/recipe/grilled-chicken-sandwich-with-mustard-mayo", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "Grilled Chicken Sandwich with Caesar-ish Dressing Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Chicken Sandwich with Caesar-ish DressingBy Molly BazAugust 23, 20184.9(87)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Judy ManciniEmailPinterestPrintEmailPinterestPrintDeeply charred mustardy chicken thighs are paired with a crunchy and refreshing fennel-basil slaw for the ultimate summer-night chicken sandwich.IngredientsMakes 41Tbsp. Dijon mustard2tsp. Worcestershire sauce2garlic cloves, finely grated2Tbsp. plus 2 tsp. fresh lemon juice2tsp. freshly ground black pepper, plus more⅓cup plus 2 tsp. extra-virgin olive oil, plus more for grill6Tbsp. mayonnaise¼cup chopped cornichons (about 9)Kosher salt4large or 6 small skinless, boneless chicken thighs (about 1½ lb. total)4brioche buns, split1medium fennel bulb, thinly sliced crosswise, fronds reserved1cup basil leaves¼tsp. crushed red pepper flakes (optional)1small head Little Gem lettuce1medium tomato, sliced ¼\" thickPreparationStep 1Whisk mustard, Worcestershire, garlic, 2 Tbsp. lemon juice, and 2 tsp. black pepper in a medium bowl. Whisking constantly, stream in ⅓ cup oil until emulsified. Transfer half of marinade to a small bowl, then whisk in mayonnaise and cornichons (this will be the special sauce). Season mayo dressing with salt; set aside.Step 2Season chicken thighs with salt and add to medium bowl with remaining marinade. Toss to coat. Let sit at room temperature, tossing occasionally, at least 30 minutes, or chill up to 4 hours.Step 3Prepare a grill for medium-high heat. Lightly oil grate. Grill chicken, turning once halfway through, until well charred and cooked through, 8–10 minutes. Transfer to a platter and let rest 5 minutes. If you have 6 chicken thighs, cut 2 of them in half and use 1½ thighs per sandwich.Step 4Grill buns cut side down until lightly charred, about 30 seconds. Transfer to platter with chicken.Step 5While chicken rests, coarsely chop fennel fronds. Toss fronds, sliced fennel, basil, red pepper flakes (if using), and remaining 2 tsp. oil and 2 tsp. lemon juice in a medium bowl; season with salt and black pepper.Step 6Spread reserved mayonnaise dressing on cut sides of each bun. Arrange 1–2 lettuce leaves and sliced tomato on bottom halves. Top each with chicken, then arrange fennel salad over. Close sandwiches with top buns.How would you rate Grilled Chicken Sandwich with Caesar-ish Dressing?Leave a ReviewTell us what you thinkReviews (46)Back to TopTriangleThis is just such a fabulous recipe. We’ve made it 3 times now and even people who swear they don’t like fennel absolutely love it. Thanks!Lisa TCalgary, Alberta10/25/2021THE BEST CHICKEN SANDWICH IN THE WORLDAnonymousNorfolk, VA9/18/2021Made this for a cookout this weekend (tripled the marinade/sauce and used a mix of chicken breast and thighs) and every single person asked for the recipe afterwards! It was so simple to make and so flavorful. There was a lot of skepticism about the fennel slaw but it was such a lovely addition and not at all overpowering or licorice-y. 10/10 will make again.AnonymousCambridge, MA7/26/2021This was so flipping good. It has a permanent place in my summer rotation.Anonymous7/25/2021Omg yummm! Love anything by Molly, but this was especially good! Added some mayo to the fennel slaw, other than that kept it the same. Cannot recommend this recipe enough!!!Gabs75New York, NY9/5/2020This recipe was easy and AMAZING.  A total hit, and the chicken was really flavorful.  I’ll definitely be making this again and again now that I’ve found it.  Go with the chicken thighs, you won’t be disappointed! Anonymous8/22/2020This is the best chicken sandwich I have ever eaten.  My wife said it's the best thing I've ever cooked.  Every ingredient complements each other perfectly. Total winner.  I made one small change.  The mayo dressing was too mayonaisy for me so I added a little more lemon, worcestershire sauce and dijon.  Anonymous8/3/2020Amazing! Simply amazing recipe! No doubt the BEST chicken sandwich EVER!!! Has become a staple in the dinner line-up and have made multiple times! Simple, easy to follow recipe if you are a beginner in the kitchen and would impress anyone with taste-buds that work! And folks... don't sell the sandwich short with boring chicken breast... give those thighs some LOVE... you won't be disappointed! Much more tender, juicy and flavorful! Thanks for the great recipe Molly! Elizabeth J MOhio7/28/2020Oh YUM! This sandwich was fantastic!  I used skinless, boneless chicken breast instead of thighs, and put them in the sous vide for a few hours before grilling.  The marinade is delicious and would make just a fantastic marinade on its own.  I thought it sounded like too many cornichons so I only added half the amount.  Sure nough, while eating I thought the sandwich use a bit more acid.  So don't be afraid of the pickle!  The fennel salad was a nice accompaniment and not strong in flavor at all.  Am saying that for all the fennel haters out there.  You'll love it - don't worry!  I ate the leftover dressing with celery stalks the next day and it was yummy.  Will absolutely make again!AnonymousLos Angeles, CA6/24/2020These were insanely good. Would 100% make again and not change a dang thing. I made them with chicken breasts because it was all I had on hand, but the thighs is the way to go so you don't have a sando gloriously falling apart in your hands. Either way it's a winner. Thanks, Molly.Los Angeles6/23/2020It was good but a little salty. I do not think salt needs to be added to each component as the mayo dressing and fennel salad already have flavour therefore I recommend only adding salt to the chicken and nothing else.AnonymousBahamas6/2/2020I mean just WOW. So good - would make double sauce next time and double chicken because bigger would have been better. But overall its soooo delicious AnonymousToronto6/2/2020This Chicken sandwich hits the spot. It does taste ceasar'ish. The Cornichons are awesome in the sauce which making more sauce is a must. Really really good overall.CalebRSalt Lake City, Utah5/20/2020Simply the best chicken chicken sandwich I’ve ever eaten. Stop looking at Chicken sandwich recipes.. make this one and save it because you will want this again. New York5/17/2020My son made this for me for Mother's Day - it was the BEST chicken sandwich I ever ate in my life.  The dressing was to die for, and each component was perfect. Just loved this - wouldn't change a thing!!!AnonymousCentennial, Colorado5/11/2020Explore Bon AppétitSandwichAmericanChicken ThighChickenPoultryFennelVegetableLettuceLeafy GreensBasilHerbs & SpicesSummerWeeknight MealsMainGrillingFourth Of JulyMemorial DayLabor DayLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-21", "author": ["Condé Nast", "Molly Baz"]}