{"id": "b9bcae1e2a6d508a6fdeea94c3dc3a47", "url": "https://www.bonappetit.com/story/how-to-safely-thaw-frozen-fish", "year": 2019.0, "month": 8.0, "day": 3.0, "content": "How to Safely Thaw Frozen Fish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll of Your Questions About Thawing Fish, Answered...but can I microwave it?By Emma WartzmanAugust 15, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailFantasy: You’re living your best life on the Cape, or in Maine, perhaps near the Gulf, spending the day acquiring a dramatic tan line and finishing a murder mystery novel. When you’re hungry for dinner, you pop by the local seafood market and grab whatever you want because it’s all straight from the ocean, caught earlier that morning.Reality: You’re living life in the city or the ‘burbs. Your tan is nonexistent and all you want is to get in and out of the grocery store as quickly as possible. Your best bet (as we have told you before) is to buy frozen fish. Because it’s flash-frozen at sea or immediately upon coming into port before transit, it doesn’t lose freshness or flavor. Plus it’s often less expensive than the “fresh” fish on ice—which, by the way, was likely previously frozen and thawed anyway. (Despite what it might look like, it’s not as fresh.)So you’ve got your frozen fish—but now what? How do you thaw it safely at home? We’re answering all of your burning questions below:I have frozen fish in my freezer that I want to cook tonight. What should I do?Pop it in the refrigerator. If you move it from the freezer to fridge the morning of, that should be enough time for the fish to thaw fully. (The night before definitely works, too.)I didn’t think that far ahead. Can I put it in the microwave on a defrost setting?Nope. While some risk-loving folks might thaw frozen fish on the defrost setting, we don't trust the sporadic heat of the microwave. The dramatic temperature change might shock your fish and mess with its texture, maybe even partially cooking the thinner parts of the fillet.Defrosting frozen shrimp works in much the same way.\nPhoto by Chelsie Craig, Food Styling by Pearl JonesThen can I leave it out on the counter at room temp?Unfortunately, no. While leaving it out won’t actually cook it, the difference between freezing and room temp is still a big enough change that you might end up with a funky texture. Plus, when you thaw fish at room temperature (or under warm water), you might encourage the growth of bacteria on the surface of the fish (needless to say, undesirable).Okay, fine. Then what should I do?Put your frozen fish—still in its packaging or in a plastic bag—in a big bowl and cover with water that's a bit cooler than room temperature. Ice-cold water won't defrost the fish quickly enough but warm or hot water will mess with the fish's texture (you got that message about avoid drastic changes in temperature, right?). If the fish is bobbing around, use a smaller bowl or a weighted plate to keep it submerged so that all parts defrost at the same rate.Does the water need to be running?No, it’s wasteful to run water the entire time. But change it out every 20 or 30 minutes until the fish is fully thawed, just to make sure the water stays cool.Is it okay to submerge fish directly in water or does it need to be separated from the water via packaging?Keep it separated by packaging. Fish might live in the sea, but right before you cook them, you don’t want them to be water-logged. A wet fish won’t caramelize or crisp (that’s why we often pat fish fillets dry with paper towels), plus it will release moisture into your dish, ultimately making the final product less flavorful.Is there any fish that can be cooked directly from frozen?While you technically can cook certain fish from frozen (the leaner varieties, like cod or tilapia, but nothing as fatty as salmon or swordfish), we don’t recommend it for the same reasons as above. More moisture leads to less flavor and increased sogginess, which you don’t want.You're ready for this:Family-Style Fish TacosNo grill, no deep-fryer, no problemo. Our summery tacos rely on our go-to fish-cooking method—slow-roast, baby—for all the flavor without the fuss.View RecipeExplore Bon AppétitSeafoodFishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-15", "author": ["Condé Nast", "Emma Wartzman"]}