{"id": "b9bca0c3891750f055f75885d4befe8d", "url": "https://www.bonappetit.com/story/test-kitchen-variety-show", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "Our Test Kitchen Is Going Live on YouTube! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureOur Test Kitchen Is Going Live on YouTube!Join us at 7 p.m. EST Friday May 1 for a live event benefiting World Central Kitchen.By The Bon Appétit StaffApril 29, 2020FacebookTwitterEmailFacebookTwitterEmailCome hang with Brad, Claire, Sohla, Chris and the rest of the BA Test Kitchen crew during our first-ever LIVE show. There will be cooking challenges! There will be cute pets! There will (possibly) be tears! And it’s all to raise money to support World Central Kitchen’s response to Covid-19: providing fresh meals to those in need, putting restaurants back to work, and feeding frontline healthcare workers.Follow along right here, beginning at 7 p.m. EST on Friday, May 1!Explore Bon AppétitCoronavirusTest KitchenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-29", "author": ["Condé Nast", "The Bon Appétit Staff"]}