{"id": "b9c079790abe823f968710cfca2302c0", "url": "https://www.bonappetit.com/story/treating-pcos-food", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "How to Treat PCOS With Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I'm Decoding My Period and Treating My PCOS Through FoodIt's called phase-based eating, and it's part of a lifestyle—not a diet.By Lauren KodiakDecember 18, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailI quit the pill two months ago. My doctor first prescribed it when I was a teen, after he diagnosed me with Polycystic Ovarian Syndrome or PCOS, an incurable (but treatable) hormonal condition that affects 10 million women worldwide. Before birth control, I got my period only twice a year, and I spent most of my adult life dealing with tell-tale PCOS symptoms: cystic acne, anxiety, and hirsutism (a fuzzy navel’s not just a drink).Then I found functional nutritionist and women’s hormone expert, Alisa Vitti and her bestselling book, Woman Code. After her own PCOS diagnosis, the John Hopkins University and Institute for Integrative Nutrition grad rejected the idea of pill-as-treatment and spent years researching and developing her Flo Protocol, a five-step plan that covers everything from naturally balancing blood sugar to lowering stress levels for women with period problems. The one step that’s changed my life: Cycle Syncing®.No, I’m not referring to the questionable phenomenon of women’s menstrual cycles syncing up when they spend a lot of time together. (Although wouldn’t that be cool if that were the answer to all our problems?) This is more of a mind-body connection, where you look to the specific phases of your menstrual cycle to make decisions about everything from food to exercise. It’s a habit shift: Rather than simply reacting to what our hormones are spelling out, we learn to anticipate and support our bodies’ needs based on where we are in our cycles.Now, if you blacked out during that one health class where the four phases of your cycle were outlined, don’t worry—you’re not alone. The very existence of period coaches like Erica Chidi Cohen of LOOM, wildly popular period-tracking apps like Vitti’s Flo Living, and posts about phase-based eating on lifestyle blogs like Lee from America and Camille Styles prove that women are cultivating our own version of the sex ed we never had.The basic premise here is that the concentration of five hormones (estrogen, progesterone, follicle-stimulating hormone, luteinizing hormone, and testosterone) changes four times during the course your menstrual cycle. This creates the four phases: follicular, ovulatory, luteal, and menstrual. In Vitti’s protocol, certain food, exercise, and lifestyle habits support your needs during each particular phase.Take premenstrual syndrome, or PMS, for example. Based on every rom-com ever, you’d think that a steady diet of ice cream, wine, and chocolate is the answer to cramps, bloating, and volatile emotions. But, according to Vitti, if you fill your diet with foods rich in B vitamins, calcium, magnesium, and fiber (like millet, sweet potatoes, apples, beef, and cod) in the week leading up to your period, you’ll stave off sugar cravings, mood swings, and fluid retention. You’re essentially biohacking your cycle to feel your absolute best.I started Cycle Syncing® on my last month of birth control pills. It was a training-wheels situation to get reacquainted with my body after being unfamiliar with its rhythms for so many years. That first month gave me a clear roadmap to navigate post-pill life, which made the transition more manageable. Since then, I’ve kept a journal to study patterns in how I feel.The most notable adjustment I’ve made is to embrace walks, gentle yoga, or full rest days during my menstrual phase. Old Me would’ve pushed through a high-impact workout, even if it felt like my feet were made of concrete. Now I relish these four days, and don’t feel guilty about skipping the gym. I also initially scoffed at the list of menstrual phase-suggested foods, but note in my journal that I feel “less like garbage than usual … dare I say, good?” during my period, so all the miso soup with mushrooms and seaweed; wild rice, beet, kale, and adzuki bean salads; and breakfast buckwheat kasha must be doing something right.I’ve learned to save spin class or running for after my menstrual phase, and it’s worth the wait—I actually leave with more energy instead of feeling like I need a three-hour nap after. I also resist the urge to roast everything and instead opt for lighter food preparations like sautéing and steaming during this time. I’ve been making things like a green lentil, butter lettuce, carrot, and parsley salad in my follicular phase and a red lentil coconut curry with chard and quinoa in my ovulatory phase. I also eat my weight in out-of-season raspberries and strawberries, and make a note in my journal that I can’t wait for summer.Surprisingly, I’ve learned it’s possible to have a favorite phase of your cycle (who knew?). Mine is the luteal phase. It’s the time of the month where I’m encouraged to indulge my homebody tendencies and focus on self-care and nesting. It gives me the agency to say “no” to various social engagements and stay home for more important things like cleaning my kitchen or starting a whole new skincare routine. And it doesn’t hurt that this phase features all my favorite foods—brown rice, chickpeas, cauliflower, cabbage, and winter squash.I’m now in my third month of Cycle Syncing®, and while I’m still managing some anxiety and excess hair (I may or may not have a waxer on speed-dial), my skin is clear and I have managed to bring a regular period back.I plan to stick with this phase-based lifestyle because the most appealing and encouraging part of it is that it’s a practice; it’s forgiving and flexible. “It’s not like a diet that we have experienced before as women, like ‘This is right and this is wrong,’” says Vitti. “The idea is that you’re supposed to use it as a guideline to get into a relationship with your body and figure out what really makes you feel your best.”And any eating plan that encourages me to eat avocados (to improve ovulation in the follicular phase) and complex carbohydrates (to help with mood swings in the luteal phase) is one I’ll happily stick with long-term.Explore Bon AppétitHealthyishSelf CareessayRead MoreLifestyle5 Ways a Menstrual Coach Could Help You Have Better PeriodsBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-18", "author": ["Condé Nast", "Lauren Kodiak"]}