{"id": "b9fa52861537a670014fd8129e64863f", "url": "https://www.bonappetit.com/story/do-you-actually-have-to-pick-herbs", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "Do You ACTUALLY Have to Pick Herbs? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingDo You ACTUALLY Have to Pick Herbs?Well, that depends. Are they hardy? Are they tender? And how lazy are you?By Alex DelanyMay 7, 2019FacebookTwitterEmailPhoto by TED+CHELSEA CAVANAUGH, Food Styling by Simon AndrewsFacebookTwitterEmailSpending your time meticulously plucking herb leaves off of their stems is pretty much nobody's idea of a good time. You’ve got better stuff to do! So do you actually...need to? Well, let's start with the good news: You don’t always have to. But there’s also some bad news: Sometimes you do. That’s just the way life works though, a constant mix of good and bad, plucking and not plucking.So how do you decide whether or not you need to spend time plucking? Great question. It really depends on what type of herb you’re working with, what you’re using it for, and also, how ambitious or lazy you’re feeling.The first question you should ask when approaching a bundle of herbs is, Can I eat the stem? For so-called \"hardy\" herbs the answer is usually no. When we say hardy herbs, we mean stuff like rosemary, thyme, oregano, and sage. These are herbs with a more woody flavor and stems that are tough, chewy, fibrous, and generally unpleasant to put in your mouth. For hardy herbs, you almost always want to pick the leaves from the stems. (We'll get to the \"almost\" part later.)Now let's talk about \"tender\" herbs—mint, dill, parsley, cilantro, and basil. And in this case, the answer varies. You should always pick mint leaves from the stem, because even though the leaves of the herb itself is tender, the stems are bitter and woody, more like the hardy herbs we talked about earlier. When it comes to basil and dill, the answer depends. You should use the stems when they’re soft and thin and remove them when they’re stocky. That’s a judgement call. When in doubt, give it a nibble.And then there are the truly tender herbs, parsley and cilantro. The stems will always be tender, edible, and—here’s the kicker—even more flavorful than the leaves. (It’s true!) Including the finely-chopped stems adds crunch to sauces, salads, and soups, which means you don’t have to pick the leaves from the stems. That’s a win-win.But there are times when, regardless of the texture or taste of the stem, you want to take the time to pluck those leaves. These instances are all dictated by how you’re using the leaves. If you want a more subtle flavor and a more elegant texture for garnishes or herb salads, pick your herb leaves. They’ll look prettier and give a gentler flavor to your dish.Making a pot of stock? You can just throw those sprigs in, stems and all—you'll just strain them out later.\nThere are also certain situations where you might end up adding any kind of herb to a dish—a braise, say, or a pot of stock—and then plucking them out, straining the liquid or oil they're in, or otherwise removing them before the dish is finished. In these cases, you can go ahead and throw a few sprigs in, stems and all—they'll infuse the dish with flavor, and those stems won't end up on anyone's plate.And that’s that. There's no tidy, one-size-fits-all answer to this whole herb picking question. It’s all circumstantial, and it’s up to you to know what exactly you’re looking for and working with. Do the stems taste good? Do you have the time? What kind of flavor are you going for? This could be some large metaphor for navigating your life and relationships. But it’s not. It’s about picking your herbs.In other news, meatballs!Pork Meatball Rice BowlsIn this weeknight recipe, magical, salty, umami-packed fish sauce is doing double-duty as a seasoning in the meatball mixture and as a part of the finishing sauce.View RecipeExplore Bon AppétitBasicallyherbCilantroParsleySageMintRosemaryRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-07", "author": ["Condé Nast", "Alex Delany"]}