{"id": "ba0c172f9862db4e7d7ecf4e0cb61f48", "url": "https://www.bonappetit.com/recipe/bella-paloma", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Bella Paloma Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesBella PalomaFacebookPinterestTwitterEmailA summer favorite gets an Italian twist featuring apéritif and Don Julio Reposado.PrintIngredients1.5 ounces Don Julio Reposado1 grapefruit1 ounce Italian apéritif1 Tsp. granulated sugar2 ounces seltzer1 Tbsp. lime juiceIceKosher saltRecipe PreparationSlice a thin round from the grapefruit. Slice the round in half (into a half moon). Juice remaining grapefruit.Pour kosher salt on a plate. Rub half of the rim of a highball glass with one of the slices. Dip rim of glass in salt. Fill glass with ice.Add 1.5 ounces of Don Julio Reposado tequila.Add 2 ounces of grapefruit juice and 1 ounce of Italian apéritif.Juice the lime into the glass (should be 1 tablespoon juice) and add sugar.Stir vigorously and strain tequila mixture into prepared glass.Top off with seltzer. Garnish with the remaining grapefruit slice.Recipe by Don Julio TequilaRelated VideoBella PalomaReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredDon JulioBasicallyMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Don Julio Tequila"]}