{"id": "ba10d2eae77e2a2eba54d1ba4bb3778b", "url": "https://www.bonappetit.com/story/vegan-cheese-sauce", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "How to Make the Creamiest Vegan Cheese Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make the Creamiest Vegan ‘Cheese’ SauceCashews to the rescue!By Carina FinnApril 7, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailSome of my fondest memories involve what is commonly known as plastic cheese: movie theater nachos, bowling alley cheese fries, theme park soft pretzels dipped in a vat of neon yellow goop. There’s something uniquely comforting about the combination of carbohydrates and warm, salty cheese-adjacent substances. When I’m hit with a wave of nostalgia, this is what I crave.My love of snack foods runs deep, but since I don’t always enjoy the feeling after eating loads of them (which isn’t to say that you won’t find several varieties of salty, crispy snacks in my kitchen, always), I’ve developed a parallel passion for re-creating less-processed versions of my favorites. Over the years, it’s become something of a hobby to figure out how to turn the stash of ingredients in my pantry—vegan staples like nutritional yeast, coconut oil, and vital wheat gluten—into the closest approximations possible. Often, the results are both better and more satisfying than their inspirations.On one recent night at home (of course), I was struck with an acute need to have this gooey, salty “plastic cheese” on the twice-baked potatoes I was planning to make for dinner. So I decided to doctor up something like it with what I had on hand. While plant-based cheese sauces are not a new idea, this one requires absolutely zero planning. No soaking the cashews overnight, no cooking and mashing a starchy orange vegetable, no preservatives or emulsifiers. It takes 15 minutes, start to finish, and can be adapted and applied in countless ways.Here’s how to make vegan cheese:Start by soaking ½ cup cashews in hot water for 10 minutes, then drain and add them to a blender with 3 Tbsp. nutritional yeast, 1 Tbsp. red miso, 1 tsp. turmeric, and 5 Tbsp. water, plant-based milk, vegetable stock, or even pasta water (that salty-starchy bath is ideal). I like to add ½ tsp. garlic powder, ½ tsp. hot paprika, and a few dashes of liquid smoke to spice things up. Blend this mixture until it’s very smooth (I use an immersion blender when I’m too lazy to break out my Ninja), and “cheese” is ready.I like to spread it cold, on crackers, or eat it warm—as a dip with pretzel nuggets or fries, slathered on plant-based burgers, drizzled over roasted veggies. I’ll stir in chopped jalapeños or Hatch chiles for a spicy variation that works perfectly with chips, tacos, or as a base for mac and cheese. Or sometimes I’ll add diced pimientos, cayenne, and veganaise and then pop it in the fridge for a pimiento cheese spread that makes a mean sandwich. When I’m feeling more on the healthy side, it’s the perfect addition to my crudités platter too.Is this vegan cheese sauce a 1:1 substitute for the “plastic cheese” my nostalgia brain wanted? Well, not exactly. While it doesn’t have the same odd stretchy texture as the kind of thing you’d find in a plastic tub with a peel-off foil lid, it’s packed with about 10 times as much flavor—and it’s every bit as comforting.VC’s time to shine:Mixed Nut and Seed CrackersThese crackers are gluten-free, Paleo, vegan.....and Whole30.View RecipeExplore Bon AppétitCheeseVeganHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-07", "author": ["Condé Nast", "Carina Finn"]}