{"id": "ba165041089563e76b4f8314c9f0531f", "url": "https://www.bonappetit.com/story/santigold-climbing-kilimanjaro", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "For Santigold, Climbing Kilimanjaro Was Easier Than Having Kids | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFor Santigold, Climbing Kilimanjaro Was Easier Than Having KidsThe iconic musician is tackling another role: motherhood.By Caitlin BrodyDecember 11, 2018FacebookTwitterEmailPhoto courtesy of Little Empire MusicFacebookTwitterEmailIn our series Person of Interest, we talk to the people catching our eye right now about what they’re doing, eating, reading, and loving. Up next, Santigold, the genre-bending musician who balances motherhood with monthly performances and always gets us on the dance floor.A lot has changed for musician Santigold since releasing her genre-bending debut album, Santogold, a decade ago. The 42-year-old, who has since launched three additional studio albums—including last summer’s dancehall-style I Don’t Want: The Goldfire Sessions—has moved from her homebase of Brooklyn to sunny Los Angeles, and is now mom to a four-year-old son and eight-month-old fraternal twins. “All I think about is that one day, I’ll have a vacation,” she says with that new-mom-exhausted laugh. But that doesn’t mean the music has stopped. Santigold, whose iconic indie-electro-pop-rock-dance style is impossible to categorize, still performs for her devoted fans monthly, though the days of not spending a night in her own bed for months on end are over at least for now. “I leave for two or three days at a time now,” she says. “I’m juggling a lot.”Wellness has always been a part of Santi’s life—she even climbed Mount Kilimanjaro in 2010 (that’s what we call ~ peak ~ wellness). But now she incorporates it in lower-elevation doses. Here’s how the musician-producer-mom-chocoholic brings sanity to her daily life.My perfect morning involves... A little bit of alone time. I have a house in Jamaica, but I haven’t been in quite a while. When I’m there, I eat breakfast on the deck overlooking a rainforest with a bird sanctuary, and the ocean is in the distance. That’s my idea of a perfect morning, but right now, a typical morning is waking up between 6 and 7:30 after having just been up at 5:30, trying to get my four-year-old off to school, pumping for the twins, and scrambling through emails. It’s 12pm and I still haven’t eaten breakfast.My dream evening is… Being in my own house, lying in my bed and watching a movie or Game of Thrones. I am a very, very late Game of Thrones fan—I watched it last year from start to finish because when I was pregnant, I couldn’t move. I started and finished it before the babies arrived.My drink of choice is… I try not to do caffeine because it affects me a lot, but I make this tea with raspberry leaves, nettle, and alfalfa. I grab handfuls of each loose tea, boil it, and strain it all together. It’s really delicious and good for you—I drank it every day for a year. My friend who is a naturalist and a veteran mom made it for me years ago, and then I started making it and everyone in the house started drinking it. Every time I would make it, it would be gone immediately.I stay healthy on the road by… Always taking vitamins. Dr. Schulze SuperFood vitamins are my go-to if I feel like I need to push my immune system to be a little stronger. They also make an Echinacea Plus that’s great. When you’re on tour, your voice is your instrument, and if you don’t keep up your body, it goes.The secret to hotel breakfasts is… Oatmeal—it’s a good, stable breakfast. I hate eggs and stick to a pescatarian diet, so American breakfast can be hard for me. I don’t want to eat pancakes or waffles everyday. But put some berries in oatmeal, and you know you’ll have a good breakfast.I can’t get enough of… Dark chocolate covered mangoes. A friend of mine brought some back from the Philippines. They were amazing, but she said that you couldn’t get them anywhere other than in the Philippines. I am a genius at finding things on the web, so I told her that I would find them, but I really couldn’t find them anywhere! Turns out, the one place that makes them here is Costco’s Kirkland. They’re actually sourced from the Philippines. They are delicious and I order them from Amazon all the time.I quiet the noise in my head by… Meditating. I studied Qigong meditation, and it’s amazing—it’s the best for keeping me grounded, calm, focused and connected. And, honestly, I love movies. When I’m really tired and my brain is dead, I like to watch romantic comedies. The ones you’ve seen over and over, like Sleepless in Seattle or You’ve Got Mail.I am the happiest when… I am able to be present in the moment and enjoy what I’m doing. There are so many things that bring me joy, whether that’s spending time with my family, making music, swimming, or being in nature. I recently moved to LA from Brooklyn, so now I just look at the palm trees and am happy.Good, healthy collaboration means… Stepping outside of your comfort zone, approaching things from a different angle, and trying something new. The most exciting collaborations come from something you wouldn’t have created by yourself.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitPerson of InterestHealthyishInterviewsRead MorecultureRachel Brosnahan's Winter Strategy Involves Bone Broth and Swaddling Her Dogs in BlanketsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-11", "author": ["Condé Nast", "Caitlin Brody"]}