{"id": "ba256ab625dd69cf256450c6f149815a", "url": "https://www.bonappetit.com/story/recess-cbd-drinks", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "These Sparkling CBD Drinks Have Replaced My La Croix Habit For Good | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThese Sparkling CBD Drinks Have Replaced My La Croix Habit For GoodRecess pairs CBD and adaptogens for a one-two punch of millennial chilled-out bliss.By Annie DalyNovember 6, 2018FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailI consider myself a fairly trend-adjacent person, enough in the loop to casually know what everyone’s obsessing about, but not so in the loop that I am actually one of the obsessors. Waiting until the hype has waned is my move, which explains why I am currently cruising through Mad Men on Netflix.But with trendy CBD—the non-psychoactive cannabis compound found in both cannabis and hemp plants that the New York Times recently called “the new avocado toast”—I’m more than adjacent; I’m a straight-up evangelist. And my latest CBD discovery is Recess.Launched in October, Recess is a La Croix-esque sparkling-water drink infused with CBD and adaptogens (herbs that help your body adapt to stress). While there are other CBD-infused drinks on the market, like Dirty Lemon’s +cbd, sprig, and Kickback CBD Cold Brew, Recess is the only one made with both adaptogens and the millennial Kool-Aid that is sparkling water.When I first heard about this drink,  it sounded a little too Peak 2018 for my liking: La Croix vibes, CBD, and adaptogens?! Even for a CBD obsessive, it was a bit much. But then I tried a can, and I was hooked..A can of Recess—which contains 10 mg of cannabidiol from full-spectrum hemp extract—simultaneously relaxes my body and gives me this low-key productivity buzz. I’m able to peacefully get my work done without checking Instagram every two seconds or taking a Very Important quiz to find out what my Zodiac sign reveals about what type of sandwich I am. And Recess’s founder, Benjamin Witte, says that’s no accident. For starters, using full-spectrum hemp extract as opposed to CBD isolate (the other option) means that the extract also has other cannabinoids found in the hemp plant, which some research has shown may help create a more potent product. He also sources the CBD from a high-quality farm in Colorado, where the hemp is grown under strict guidelines using only 100% organic farming practices. I love their slogan, too—“not tired, not wired”—because that’s legit how I feel when I drink a can.But, for me, Recess’ biggest draw is that, unlike other CBD products, there isn’t any sort of ick factor involved to get the benefits. When I take CBD oil pills, I end up burping up little tastes of weed throughout the day. And when I get a CBD latte from the place on my corner, the hemp oil also comes on a little too strong and then chills on my tongue, like when someone stares at you for just one second too long.With Recess, you don’t have to put anything under your tongue, you don’t have to worry about ~the linger,~ and let’s not forget, it’s water, so you’re also doing double duty by hydrating. It comes in three flavors—blackberry chai, peach ginger, and pomegranate citrus—along with concentrated juice and organic ginger to help mask the CBD taste. My favorite flavor is blackberry chai, because it reminds me of the chai that my fiance, who grew up in New Delhi, introduced me to on our first trip there.Because they’re so drinkable, I end up casually sipping on a can all day long, which sets me up to chill in my concentration cocoon throughout the day. And then, before I know it, I have magically conquered my to-do list, and it’s already time to chill in my other go-to cocoon: the pile of blankets on my couch.Buy it: $30 for a six-can variety pack; $39.99 for an eight-can pack of one flavor; $4.99 per canAll products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishCannabisSeltzerTrendsShoppingRead MoreLifestyleHow Drinking CBD Cocktails Really Makes You FeelBy Kelly DobkinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-06", "author": ["Condé Nast", "Annie Daly"]}