{"id": "ba2a4a4cbfaea194c2d6b9f692cbead1", "url": "https://www.bonappetit.com/story/arcosanti", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "A Photo Tour of Arcosanti, the Utopian Oasis in the Arizona Desert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Photo Tour of Arcosanti, the Utopian Oasis in the Arizona DesertThe artists' colony champions self-sufficiency and sustainability in a modernist paradise.By Bryan Fountain and Allie AyersJune 27, 2019FacebookTwitterEmailPhoto by Allie AyersFacebookTwitterEmailIt snowed in the days leading up to our arrival at Arcosanti, like more snow than New York City had seen all winter. The entire desert just north of Phoenix was covered in a heavy blanket, roads were closed, and we worried that everything we hoped to see would be out of range. We’d thought we were escaping winter; instead we flew right into it.Photo by Allie AyersMy partner has been going to Arizona with her family since she was young. When she asked if I wanted to come this year, my initial response was, “Yeah, I don’t really think I want to take a week of my vacation time to go to the desert.”Then she showed me photos of Arcosanti, a self-sufficient, planned community and Modernist oasis an hour north of Phoenix. I looked at the massive circles cut of concrete framing the mountains in the distance, interrupted only by cypress trees. It looked surreal.Photo by Allie AyersArcosanti was built in the 1970s, led by architect Paolo Soleri, who looked to push the boundaries of arcology—a word he coined to describe the ways in which architecture and ecology can coexist. Soleri’s intent was to combat the ever growing problem of urban sprawl by creating a contained and compact community that could sustain itself.The compound was built entirely by volunteers, and although the majority of the construction was completed within the first decade, people continue to add on to the structure today. The buildings were created through a process called silt casting, which used earthen forms as scaffolding to pour concrete. Today, resident artisans use this same technique to cast the famous Soleri wind bells that are made and sold at the compound.Photo by Allie AyersTwo month later, we found ourselves driving off an exit ramp on US Route 17, just past where the saguaros end and the mountains begin. It was so dark we could see nothing beyond what the headlights of the car illuminated. In front of us was a sign, sun bleached and weathered, that read “Arcosanti.”It appeared out of nowhere. An orange glow framed what looked like a UFO in the distance. As we got closer, the glow began to resolve itself into the small town we’d been obsessing over for weeks.Photo by Allie AyersWe slept in the Sky Suite, one of a few apartments in the compound that are rented out to visitors looking for an immersive experience. We woke to rays of pinks and oranges flooding over the desert and through the circular windows. We wandered the grounds before breakfast; most of the snow had already melted under the warm sun, but what remained transformed this already surreal landscape into something otherworldly. Ceramic wind bells littered the oil-producing olive trees and Escher-like stairwells of the compound.Today Arcosanti operates as an artist colony with a population between 50 and 150 residents, much fewer than the 5,000 that Soleri intended. Everyone contributes through general upkeep, cooking, and managing daily tours. Sales from Soleri windbells, workshop fees from artists in residence, and donations from visitors fund the operation and growth of the community.Arcosanti today may not be quite the “arcological” utopia Soleri originally envisioned, but, in a way, the current iteration is still doing what he set out to do: championing efficiency and sustainability with a small footprint.Photo by Allie AyersWhen we booked our stay at Arcosanti, we were mainly looking forward to exploring the grounds and seeing Soleri’s architecture up close. But our interactions with community members were just as memorable. From the woman who greeted us warmly to the group who served us breakfast the next day to the various artists selling work in the visitors center,  everyone had their own experiences to share about living at Arcosanti. We came to see that it’s the residents, not the architecture, who make the community what it is. And for two people trying to escape the chaos of urban living, Arcosanti was exactly the trip we didn’t know we needed.Explore Bon AppétitHealthyishArizonaRoad TripPhotographyRead MoreWhere to eatRoadtripping Through the Land of EnchantmentGallery10 SlidesBy Laura MurrayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-27", "author": ["Condé Nast", "Bryan Fountain", "Allie Ayers"]}