{"id": "ba3a2ed25b6cc7f4e7731c3d37a0b79f", "url": "https://www.bonappetit.com/story/lil-bucks", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "Crunchy Sprouted Buckwheat Is My New Breakfast Staple | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingI Can't Start the Day Without Crunchy Sprouted Buckwheat Lil Bucks has quickly become my go-to topping for yogurt bowls, oatmeal, and pancakes.By Amber GibsonOctober 9, 2020FacebookTwitterEmailPhoto by Maria Daniela MartinezFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Healthyish Loves It is our weekly column where we tell you about the stuff we can't live without. See our past recommendations here!I crave a good crunch in the morning. I’ve turned to everything from sugary cereals to homemade granola, but my new favorite staple is Lil Bucks sprouted buckwheat. The nutty, gluten-free, protein-rich seeds (also known as groats) have quickly become my go-to topping for yogurt bowls, along with fresh fruit, cacao nibs, and bee pollen. Come winter I know it’ll make a great garnish for oatmeal and pancakes—a final flourish after adding maple syrup.With six grams of complete plant protein and five grams of fiber per serving, Lil Bucks are certainly healthier than anything you'll find in the cereal aisle. Sprouting the buckwheat by soaking, then dehydrating at low temperatures allows for better nutrient absorption by neutralizing enzyme inhibitors and makes the groats easier to digest. The original variety has just one ingredient—organic sprouted buckwheat—while the cacao and matcha flavors are lightly sweetened with maple syrup and dusted with either organic maca root powder or organic hemp protein powder for an extra superfood boost.Buckwheat is also pretty sustainable. It’s a cover crop that improves soil quality by adding nutrients, attracting pollinators, and suppressing weeds. It grows quickly even in colder climates like Minnesota and North Dakota, where Lil Bucks has so far purchased 28,000 pounds—or 700 acres—of buckwheat from Minn-Dak Growers. Typically, Lil Bucks come in 6-ounce bags, but if you’re looking to minimize packaging, they also sell bulk one-pound bags with a year-long shelf life.Lil Bucks are such a versatile pantry staple that I’ve started sprinkling them into all my meals. They make a great substitute for croutons on salad or soup and are a wonderfully crunchy coating for hand-rolled chocolate truffles. But despite these occasional appearances in lunch, dinner and dessert, I’ll always save some for breakfast.Photo courtesy of Bubble GoodsLil Bucks Sprouted Buckwheat 3-Pack$17 at AmazonExplore Bon AppétitHealthyishShoppingBuckwheatBreakfastHealthyish Loves ItRead MorecultureI'll Never Run Out of Alt Milk Thanks to This ConcentrateBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-09", "author": ["Condé Nast", "Amber Gibson"]}