{"id": "ba4bc60811641ba34efaf31c3ea29c26", "url": "https://www.bonappetit.com/story/summery-grain-bowl", "year": 2020.0, "month": 7.0, "day": 3.0, "content": "A Summery Grain Bowl That Doesn’t Bore Me | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Summery Grain Bowl That Doesn’t Bore MeSo I bought too much at the market. This is the lunch that makes it okay.By Christina ChaeyJuly 18, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailEvery week, Bon Appetit associate editor Christina Chaey writes about what she's cooking right now. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Dear Healthyish friends,After weeks of feeling like every routine I’d established in my life had been completely upended, I’m slowly starting to once again prioritize the things that bring me peace. I’ve begun cooking again, something I found unimaginable a few short weeks ago but that I find I’m throwing myself into with joy and renewed creative energy. And I’m starting to make my beloved trips to the farmers market (with a mask on, of course). In the last month or so, the sugar snap peas and asparagus of early summer have bowed out to the heavy cherries and zucchini—a reminder that if I want in on the goods, my oversize tote bag and I have to hit the stalls now before those, too, disappear.Of course, the problem with “buying what looks good” at the farmers market is that in the peak of summer, everything looks good. The adorable palm-size pattypan squash. The heirloom tomatoes about to burst at their seams. The STONE FRUIT. It’s not until I get home and start unpacking the herbs, three kinds of lettuce, radishes, carrots, and scallions (and that’s all for a party of one, FYI) that I realize I just might have overdone it...again.In my panicked (but thrilling!) race to eat my bounty before it goes bad, the first step is to wash, dry, and properly store everything I can. I know lettuce technically lasts longer when you leave the whole head unwashed and uncut. But you know what I’m not reaching for when I’m raiding the fridge in search of a meal? That gritty head of lettuce. But when I open the fridge to neat piles of prepped produce, it’s easy to instantly visualize all the things I’m excited to cook in the week ahead: the kale and lentil salad, the broccoli-and-bacon fried rice, and so on.I'm always excited to eat this salad.\nPHOTO BY CHELSIE CRAIG, FOOD STYLING BY YEKATERINA BOYTSOVAWith these building blocks ready to go, turning a fridge full of seemingly random vegetables into a satisfying meal becomes a 10-minute task for the rest of the week. This was critical when I used to pack my lunch in the rushed mornings before biking to the office. Now that I’ve been working from home and the novelty of cooking lunch every day has worn off, I’ve found myself relying on quick meals that don’t require turning on the stove in the middle of the day.One such staple I’ve been turning to in the hot summer months is this veg-loaded grain bowl. It’s loosely inspired by bibimbap, the iconic Korean rice dish, and it checks all my boxes for lunch: It’s flexible enough to accommodate any crunchy and/or leafy vegetables you have; it’s loaded with whole grains and protein from jammy eggs and pan-fried tofu; and if you cook the individual components ahead, there’s no need for the stove or oven at mealtime. A spicy-sweet gochujang vinaigrette ties it all together, and you’re left with a batch of quick radish pickles (yes, you pickle now!) that are equally delicious slipped into tacos and salads.You can treat this recipe as a template for all kinds of swaps based on what you have. No farro? Use short-grain brown rice or barley. Not a fan of pickled radishes? Try virtually any thinly sliced crunchy vegetable in its place, such as cauliflower, fennel, or golden beets. And when it comes to the vegetables, I use a mix of whatever I picked up that week at the market: sugar snap peas, cucumbers, carrots, sprouts. I mix it all up by hand in a bowl, then make a point to plate it nicely in my favorite ceramic bowl and eat it at the dining table, ideally with screens off.Until next week,Christina ChaeyAssociate editorGet the recipe:Farmers Market Farro BowlsA little bit of prep work has a big payoff—a tasty, versatile lunch just waiting for its gochujang-lime dressing.View RecipeExplore Bon AppétitHealthyishWhat's Chaey Cooking?Read MoreLifestyleThe Chicken Salad I’m Eating on My Porch All SummerBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-18", "author": ["Condé Nast", "Christina Chaey"]}