{"id": "ba5690a0e31db56c0323bd2aa7139ce3", "url": "https://www.bonappetit.com/recipe/blistered-cheesy-peppers", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "Blistered Cheesy Peppers Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBlistered Cheesy PeppersBy Molly BazAugust 4, 20204.9(25)Read ReviewsTriangleEmailPinterestPrintPhoto by Molly BazEmailPinterestPrintEmailPinterestPrintIt’s almost silly how easy this dish of impossibly delicious, ooey-gooey cheesy chiles is to execute. But that’s also what makes it so great. Inspired by the must-order fried, cheese-filled peppers at Gregory’s Corner Taverna in Astoria, Queens, it all comes together in about 10 minutes. Just broil poblano chiles until charred and softened, stuff them with pepper Jack (though any melting cheese will work great here), and then finish with topper of quick-but-mighty marinated shallot dressing. Serve alongside some grilled sausages to make a full meal of it.Ingredients4 servings1large shallot, halved, thinly sliced lengthwise2Tbsp. red wine vinegar1tsp. sugar¾tsp. kosher salt, plus more3Tbsp. extra-virgin olive oil, divided2large poblano chiles or 3 large Cubanelle peppers or Anaheim chiles (about 8 oz. total), cut in half lengthwise, seeds and ribs removedFreshly ground black pepper8oz. pepper Jack, cut into ½\" cubes2garlic clovesPreparationStep 1Using your fingers, toss shallot, vinegar, sugar, ¾ tsp. salt, and 2 Tbsp. oil in a small bowl to combine. Let sit while you prepare the chiles.Step 2Heat broiler. Arrange chiles on a small rimmed baking sheet. Drizzle all over with remaining 1 Tbsp. oil; season with salt and black pepper. Turn chiles cut side down and broil until slightly softened and skins are blistered all over, about 5 minutes.Step 3Remove from oven and, using tongs, turn chiles cut side up. Divide cheese evenly among chile cavities. Finely grate garlic over, frequently tapping grater against baking sheet to help release garlic somewhat evenly over everything.Step 4Return chiles to broiler and broil until cheese is melted and browned in spots, about 3 minutes.Step 5Transfer chiles to a platter. Spoon shallot dressing over and season with more black pepper.How would you rate Blistered Cheesy Peppers?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThis recipe is bomb! Have made this at least 5-6 times. Added some goat cheese and roasted corn kernels last time, Chile crisp would be a good addition as well. KellyCayman Islands 8/31/2021So good. Didn't have red wine vinegar, so did half white wine vinegar, half balsamic vinegar. Anonymous3/16/2021A regular dish in my rotation! Tonight I also roasted cauliflower and made some quinoa. Put all of that on top of spinach for an amazing salad! Great recipe!Kate L.New Orleans, LA1/20/2021This is one of my all time favorites! I make it with refried  beans and Spanish riceBend, OR10/22/2020Amazing. Made as written.Who would think of the shallot vinaigrette? Molly would. Delightful krogers1Chicago9/6/2020Have made this 3x. Really like it. Yum. Just have to figure out how to make it pretty to serve to guests as an appetizer. Liked the reviews with the personal input AnonymousMD8/31/2020This was delicious! Followed the recipe exactly as directed except I used red onion instead of shallot. Served it on rice. Felt very indulgent and summery - the vinaigrette cuts through the richness of the cheese beautifully. MelodieRBroomfield, CO8/31/2020I normally hate reviews that completely change the recipe; HOWEVER, I think this is necessary, because this is a genius way to make a very easy chile relleno. I followed the technique completely, but stuffed the peppers with roasted eggplant, oregano and garlic (Bobby Flay's chile rellenos) before topping with monterey jack and garlic. Drizzled with a balsamic glaze (a la Flay), but mainly because I completely forgot a shallot! I was looking forward to the vinaigrette. Will try again for sure with the vinaigrette and with other stuffings to make this more of a full meal vs needing substance from something else. All the stars for the technique - and there's no doubt this would be delicious just as written. AnonymousIndianapolis, IN8/16/2020Got my hands on some fresh Hatch chilies this weekend, and riffed on this recipe. Filled with shredded leftover rotisserie chicken breast and shredded pepper jack cheese. Subbed enchilada sauce for vinaigrette.  Made an excellent healthyish version of Chile rellenos. Hubby and I loved them! Sprinkled with a little allepo pepper right before serving 😋jroz5529Kirkland WA8/15/2020A cheesy, (mildly) spicy, vinegary sidedish that pairs well with anything reminiscent of outdoor cooking. The dish is very quick to prepare and the shallots introduce much-needed complexity to offset the cheese.sheakToronto, ON8/13/2020I followed the recipe exactly including pairing it with sausage. It was amazing. The shallot dressing was delicious. I will definitely make this again. To bad I can’t post picture of the completed dish. SSMalleyWeatherford, Texas8/12/2020So good! Made these over grill and they were amazing. Instead of garlic, topped with a local garlic scape pesto. Shallots made the dish.  Oh, also used our garden fresh hot hungarian wax peppers! Thanks for recipe!!berryee4341Bovina center, NY (catskills)8/9/2020Made these tonight with grilled corn, crusty bread, and BA grilled shrimp and sausage skewers with smoky paprika glaze.\nIt was a perfect yummy match!\nThanks again BAAnonymousAustin Tx8/8/2020Explore Bon AppétitPoblano ChileChileVegetableCheeseQuickEasyStarterSideGluten-FreeNut-FreeVegetarianKetoBroilDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-04", "author": ["Condé Nast", "Molly Baz"]}