{"id": "ba583717e0276954b16832138afc63f4", "url": "https://www.bonappetit.com/recipe/spiced-sweet-potato-sandwich-with-feta", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Spiced Sweet Potato Sandwich with Feta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2018 IssueSpiced Sweet Potato Sandwich with FetaBy Claire SaffitzFebruary 13, 20185.0(38)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintEach component in this sweet potato sandwich recipe is seasoned really well, which makes everything pop.IngredientsMakes 21large sweet potato (about 12 oz.), peeled, sliced lengthwise into ¼\"–½\"-thick planks1tsp. ancho chile powder½tsp. ground cumin3Tbsp. extra-virgin olive oil, plus more for drizzlingKosher salt, freshly ground pepper1medium beet, peeled, cut into thin matchsticks or grated on the large holes of a box grater½small red onion, thinly sliced3Tbsp. seasoned rice vinegar½cup mayonnaise1large garlic clove, finely grated1Tbsp. plus 1 tsp. fresh lemon juice2sesame kaiser rolls, split1½cups parsley, mint, and/or cilantro leaves5oz. block feta, thinly sliced into planks, dividedPreparationStep 1Preheat oven to 400°. Combine sweet potato, ancho chile powder, cumin, and 3 Tbsp. oil in a medium bowl; season generously with salt and pepper and toss until sweet potato is evenly coated. Heat a dry large skillet, preferably cast iron, over medium. Arrange sweet potato in a single layer without overlapping (you will most likely be able to fit them all at once, but work in 2 batches if needed). Cook, undisturbed, until blackened in spots, about 4 minutes. Turn slices over and transfer skillet to oven. Roast until tender, 10–15 minutes. Remove from oven.Step 2Meanwhile, combine beet, onion, and vinegar in a medium bowl; season generously with salt and pepper and toss well. Let sit to allow beet to soften. Mix mayonnaise, garlic, and 1 Tbsp. lemon juice in a small bowl; season generously with salt and pepper.Step 3Heat broiler. Toast rolls, cut side up, on a rimmed baking sheet until golden brown, 30–60 seconds. Remove rolls from oven.Step 4Toss herbs with remaining 1 tsp. lemon juice in a medium bowl to coat. Drizzle with oil, season with salt and pepper, and toss again to combine.Step 5To build sandwiches, pour off any accumulated liquid from beet mixture. Spread seasoned mayonnaise over cut sides of reserved rolls, dividing evenly (yes, it’s a lot, but you don’t want to skimp here). Arrange feta slices over bottom halves of rolls. Top with sweet potato slices and pile some beet mixture on top. Mound herbs over beets; close up sandwiches with top halves of rolls and cut in half.Step 6Do Ahead: Sweet potato, beet mixture, and seasoned mayonnaise can all be made 2 hours ahead. Store sweet potato and beet mixture separately, tightly covered, at room temperature. Cover and chill mayonnaise.How would you rate Spiced Sweet Potato Sandwich with Feta?Leave a ReviewTell us what you thinkReviews (23)Back to TopTriangleSO good!  I read the reviews and couldn't believe it could be THAT good, but it was!  I used mostly arugula instead of all of the herbs (that is what I had) and I also used a feta/goat cheese mix.  Amazing!  I think next time (because there will be one) I will add cayenne as another reviewer suggested, bc I felt like it needed more spice, and def more lemon.  The mayo totally makes it!  AnonymousAtlanta, GA2/10/2022Wow, all the other reviews were right. This sandwich is OUT OF THIS WORLD! So so so good! I am sharing the recipe with friends and making it again. Thank you, Claire!AnonymousMountain View, CA1/25/2022I can’t believe how good this sandwich is - really such a great recipe. I used goat cheese instead of feta but, besides that, followed the recipe exactly. I think it’s one of the most delicious things I have ever made. ❤️JennyMinneapolis 10/9/2021Made this sandwich a few times now! I don't like the beets, but I LOVE onion so I just double up on the helping.  I sub curly kale for the herbs, and slice my sweet potato ultra thin so I don't have to throw it in the oven.  The seasoning is super key, and sometimes if I'm in the mood I add a little cayenne with the chili powder for a kick that combats the creamy mayo/feta components.  JeannineNew Haven, CT3/17/2021Subs included non-herb microgreens and goat feta, and this sandwich was out of this world. This seems like one of those recipes that's hard to mess up - next time I might use veganaise and \"parm\" crumbles to keep it vegan, and I know it will still come together beautifully. Plus this might be my best cross-section sandwich to date! FaithNashua NH1/19/2021I basically made this sandwich because I had a beet and curly parsley in my CSA I didn’t have other plans for and it really blew me away. Super super tasty and pretty darn easy to put everything together. The only annoying part for me was box grating the beets. I used a spelt sourdough and an herbed Parmesan Romano cream cheese blend in place of the feta because it’s what I had. That worked great, so don’t be afraid of subs. I was unsure of the spices on the sweet potato, not to mention all the salting and peppering, but nothing stood out it was a fantastic melange of flavors. I have about half the mayo leftover even though I fed three adults lol but I’m happy to have some on hand. BananaMartiniElkins Park, PA12/8/2020*whoops 1/8 teaspoon to 1/4 teaspoon sarahmgasca6652London 7/30/2020Also to add on to my previous review — noticed a lot of people said this takes a lot of prep and dishes. I cook a lot so this was minimal for me but a couple suggestions that help. I don’t mix the sweet potatoes with the seasons in a separate bowl. I do it right in the pan. It does have the potential to burn more this way but just keep an eye on it and don’t make your sweet potato too thick so it cooks quicker. Also, I usually use raw garlic religiously but as I make this for quick lunch I don’t want to dirty a grater. I used about 1/4 teaspoon of garlic powered instead (I didn’t measure it - just an eyeball guess). sarahmgasca6652London7/30/2020Soo good! This is about to become a staple in my weekly meals. I like ideas here about using goat cheese and such. I found the feta I used to be delicious but I do love goat cheese. I add a little spinach too for some greens. sarahmgasca6652London7/30/2020I have made this sandwich at least six times during quarantine with little tweaks along the way.  Goat cheese for the Feta is a good sub but less salt factor.  I've also used arugula in this a few times and that's a new must. DO NOT SKIMP ON THE MAYO its what makes this sandwich a homerunLong Island6/10/2020I made this for dinner today and it was absolutely delicious. A little time and effort are required but totally worth it. Highly recommend it!AnonymousMiami, FL5/8/2020omg this was delightful and absolutely worth the work to prepare each individual component. I felt like I was eating at a hip restaurant. I encourage you to take the time to cut the beets and onions thinly, as well as the sweet potato. kelseylmcmahonOntario, Canada5/5/2020So delicious, and super easy to make with standard pantry items. I used canned beetroot, and only pickled the onions with apple cider vinegar (I didn't have rice vinegar on me), but next time I'll try with pickled beet too. I also threw in some baby spinach for more fun. It's such a well-balanced sandwich that I'll 100% make again and maybe even meal-prep some bits as suggested.AnonymousAustralia4/29/2020I left sandwiches behind when I went vegetarian, certain that nothing except grilled cheese was worth my time. Like, chickpeas in a sandwich or whatever?? EW. Years passed with few exceptions (egg salad) until lo and behold!! I found this recipe. Less feta + more mayo for sure, but otherwise I feel that I have finally achieved a the impossible: a worthwhile vegetarian sandwich. TY Saffitz <3NatWatAustin, TX4/13/2020Delicious. Dreamy.AnonymousBrooklyn, NY4/7/2020Explore Bon AppétitSandwichSweet PotatoPotatoVegetableFetaCheeseVegetarianHealthyishRoastLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-13", "author": ["Condé Nast", "Claire Saffitz"]}