{"id": "ba59f37cfd37d2da5cba6424fb550052", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/cafe-medina", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Café Medina Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverCafé MedinaThe city’s downtown brunch institutionFacebookPinterestTwitterEmailAmy Ho GO HERE: for the brunch spread of your dreams: Mediterranean–inspired dishes, golden Liege waffles, and citrus-forward cocktails encouraged at any hour. You’ll wish Café Medina was in your hometown.ORDER THE: fricassée, a.k.a. saucy short ribs (a Medina favorite), and the flavor-bomb harissa “burger,” a spiced meat-stuffed pita with two eggs, Parm, many garlicky sauces, and seasonal greens. Every table finishes the meal with a few waffles and dipping sauces—the white chocolate-rosewater-pistachio is a classic.THE VIBE IS: meaty and lemony. The sunny space is filled with aromas of long-simmering stews and preserved lemons, and you’ll find fresh-faced nicely coiffed friends waiting patiently in line. In other words, this is not a place for those with bad hangovers in need of cheap bacon. If you’re in need, order one of Café Medina’s famous lavender lattes (available until late afternoon) to hold you over.PRACTICAL STUFF: Open every day: Monday to Friday, from 8 a.m. to 3 p.m.; and Saturday and Sunday, from 9 a.m. to 3 p.m. No reservations. Can’t wait? At the very least, ask for a coffee and a waffle to go.—Lindsay AndersonAmy HoWE ALSO LOVEAlibi RoomVancouver’s original craft beer bar in a quiet corner of GastownThe Pie ShoppeEast Vancouver’s beloved, scrappy, and downright delicious bakeryChambarCivilized debauchery for breakfast, lunch, and dinner in CrosstownExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}