{"id": "ba61b947a25b2b4d23e7f3497b5cd557", "url": "https://www.bonappetit.com/story/heal-haus", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Heal Haus Founders Darian Hall and Elisa Shankle on Building a New Kind of Wellness Studio in Brooklyn | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleDarian Hall and Elisa Shankle on Building a New Kind of Wellness Studio in BrooklynHeal Haus aims to be a intersectional space where everyone can see themselves reflected.By Fariha RóisínApril 2, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Who Is Wellness For?, writer and activist Fariha Róisín interviews people who are reshaping narratives about wellness for themselves and their communities. Here she speaks with Darian Hall and Elisa Shankle, co-founders of the Brooklyn wellness space Heal Haus.There’s something instantly magical about HealHaus, the wellness studio that opened last spring in Bed Stuy, Brooklyn. I had heard the name a few times, and I could tell it was something important from the way people were talking, but I wasn’t sure what exactly it was . Was it a yoga studio? A spa? A community space? I soon found out when I walked through the sunlit doors of the bright, mustard-yellow building and instantly noticed the feelings of warmth and acceptance. The majority of the people inside were black and brown. Immediately, I felt a sense of calm.I spent much of my last summer there, sweaty in the outdoor patio doing sun salutations while listening to harp strings, drinking their delicious smoothies alone in the front cafeteria, meditating in their hallowed yoga room. The studio felt like a much-needed space for folks who may feel uncomfortable, or unwanted, in more white-dominated studios. At the same time, there was an inclusivity to it as well—all were welcome, a healing mantra in and of itself. After I met the owners, it began to make sense: Darian Hall and Elisa Shankle wanted to create a space for growth in all its forms. And their own exceptional backgrounds and talents have made it possible for that space to exist.You both started HealHaus not too long ago, and it’s already been met with such success because it was a space that so many of us needed. What was your intention creating this space?HealHaus fills the need for an inclusive and accessible wellness space where everyone could see themselves reflected. A lot of existing spaces don’t have many people of color that walk through their doors, and it’s because these spaces are having a hard time speaking to them. POC don’t see practitioners that look like them and that can be a barrier for many people. With HealHaus we want people to feel like they can come as they are with no expectations. It was intentional for us to create a space that welcomes everyone—including men, people of different cultures, sexual orientations, race etc. We don’t consider HealHaus to be predominantly for black people. As owners, we just happen to be black and creating a space that naturally reflects our community.  We’re very proud of our diverse group of practitioners and even more proud of the diverse community that has supported us thus far.You both found a rolodex of incredible healers and practitioners that are also largely black and brown folks. Did it happen intuitively?Not only are our practitioners incredible and experienced healers, but they are also absolute rock stars and very relatable and transparent. We started with our original network, and then the trickle effect started to happen.  Believe it or not, we both interviewed each person and shared our story on how we came together probably a hundred times. It was important for us that everyone was aligned with our mission and what we were trying to create. The question we asked everyone was, “What is your greatest healing offering? Because we want to be the space that holds it.”What kind of struggles have you faced, if any?With any new business, there is a learning curve.  We often say that HealHaus is like running five businesses at once. We are managing the wellness cafe, daily classes, workshops, and the private practitioners services.  In addition to the daily programming, we are also building our retail product line, as well as gearing up to launch our corporate wellness program. The hardest struggle has been trying to balance it all between just the two of us.  Neither one of us has owned a brick-and-mortar store and, unless you have, it’s hard to explain all of the complexities that come with it.Sometimes it feels frustrating that wellness has been co-opted by white people, when so many of its roots—turmeric, yoga, ayurveda—are from people of color. What’s it been like navigating the wellness space as non-white entrepreneurs?We think it’s a breath of fresh air for people to see the owners be people of color and the dynamic of us being a male and female. We’ve received a lot of support from our growing HealHaus community, and we try to keep our tunnel vision goggles on and just create and be the message we want to see realized.  We’re focused on building our own narrative. And yes, the wellness world does take from different indigenous cultures without providing reference and context.  It’s a sad reality because integrating the culture and people where these things are from actually reinforce the healing properties and experience.Darian, I remember talking to you about the idea of a space for black men, who are often left out of conversations about care, and how HealHaus is a space to encourage them to look after themselves. Can you talk about that a little bit more?Much of this journey for me started from conversations I was having with my friends.  I had opened up on social media about personal situations I was going through at the time. By me opening up, it allowed my friends the space to be vulnerable. This lead me to question how, as men, we communicate and take care of ourselves.  I’m very conscious of the “feel” of HealHaus. What type of music is playing when you walk in? Who are the faces you see? What are the conversations you overhear?  I want it to always feel like a place that guys would want to hang at and also a safe place for them to check-in on themselves.Elisa, what was the catalyst for you, personally, to have this space?It all started in my early twenties when I did not know how to express what I was feeling, and through my own self-realization (with help, of course), I was able to pinpoint that I have depression and anxiety.  Working a corporate job and having panic attacks in the bathroom wasn’t going to cut it, so I set out to heal myself naturally. I ended up seeing a naturopathic doctor to understand how, through food and medicinal herbs, I could heal myself. I learned a lot from that experience and started diving more into my own personal knowledge of plant medicine and sharing remedies with my friends and family to heal themselves. For example, I got my grandma on hibiscus tea to manage her high blood pressure, and something so small does wonders.  I started to ask myself, “Why is this knowledge not available to my community? Why is my community dying slowly, relying on pharmaceuticals and sticking to the narrative that we just don’t talk about our mental and physical health?” From that point forward, I knew that I was going to facilitate community healing. I often say I will feel like I have succeeded when kids start talking about healing like they do Nike sneakers.What do you both do for self-care?Darian: Every evening I try to decompress by listening to music. I have a very personal relationship with music, and before I heard the word “wellness,” that was always my escape. I’m also going to start seeing one of our therapists at HealHaus.Elisa: My number one go-to is always an Epsom salt bath with lavender oil to detox my body, mind, and spirit.  I am super empathic, and being in a healing space all day and interacting with people, I need to constantly drain myself and ground my energetic field. Additionally, I try to do Reiki on myself at least a couple of times a week to clear myself.  Nervines are a must in the form of tinctures and medicinal teas to keep my nervous system strong and to stay connected to my body. Mediation always works, and I reconnect with my therapist whenever I need some extra support.  What advice would you have for someone else wanting to create a space similar to Heal Haus that’s an inclusive space for all?First and foremost, your intentions must be pure, and you must always move with integrity.  When you are working with people and their holistic health, be prepared to hold space and know what that entails.  We are walking in our divine purpose so, even though we are tired at times, it does not feel like a job. It feels natural to us. Also be honest about what you’re getting into, because it’s extremely challenging to not only get something like this off the ground, but for it to be successful.Tell us something that’s inspiring for the both of you right now.Darian: We're inspired by the community that we’ve built up in less than a year. We’re also very encouraged by seeing young men of color come into the space... and be open to trying some of the services we provide. When we see people that have never taken a yoga or meditation class come out for the first time excited, it lets us know we’re on the right path.Elisa: I am starting a monthly panel discussion series called HH Healthy Conversation, and the topic is Vulnerability is Sexy.  We encourage authenticity, curiosity, and transparency to break down stigma and address topics that would normally be considered taboo or even controversial to speak about.Explore Bon AppétitHealthyishWho Is Wellness ForNew York CityBrooklynInterviewsRead MoreLifestyleAngela Dimayuga on Taking Time for Self-Care and Learning to Say NoBy Fariha RóisínRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Fariha Róisín"]}