{"id": "ba84a666545f478e5630e5621dfac2ac", "url": "https://www.bonappetit.com/story/lets-talk-about-sobriety", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "The Healthyish Newsletter: Let's Talk About Sobriety | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLet's Talk About SobrietyHealthyish editor Amanda Shapiro on how alcohol abuse has compounded an already toxic culture of masculinity in the restaurant industry.By Amanda ShapiroSeptember 20, 2018FacebookTwitterEmailFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish readers,We ran a story last week about a dinner hosted by five much-lauded chefs, all of whom are sober, and all of whom are men. I'm grateful to Julia Bainbridge for writing this story and proud of how it came out. It's a story about a dinner, but it's also about how alcohol and substance abuse has compounded an already toxic culture of masculinity in the restaurant industry.We got some really nice feedback on the post, particularly from people in the industry who've dealt with addiction themselves or among their coworkers. And we got some criticism too. People wanted to know why, if we were referring to #metoo, the story didn't include quotes from women who'd gotten sober. And they asked why the dinner, which Portland chef Gabe Rucker organized, didn't include any women on the bill.I think these are important questions to ask, and I want to respond to them from my own perspective (and with Julia's blessing).In the post, Julia writes, \"the food industry is having its own reckoning, and drinking is a big part of that conversation.\"What could've been said more plainly is that alcohol takes the negative power dynamics that already exist in a lot of kitchens and makes them worse. Men who abuse power will likely do so even more blatantly and dangerously when alcohol is involved. We need to have more conversations about what happens when men in kitchens drink, and what happens when they choose to stop. And in this piece, we certainly could've acknowledged that women also deal with substance issues (As Julia wrote in an earlier draft, \"Addiction certainly doesn't discriminate; Zimmern calls it 'an equal opportunity destroyer'\"). But ultimately we focused this story on men because that's where the root of the #metoo problem lies.As for the second question—where were the women chefs at the dinner?—here's a line from an early draft of the piece, where Julia asks this exact question:Is there something to take from the fact that they’re all men? \"The only thing that it says is that I couldn't think of any women I knew who were prominent chefs and [publicly] in recovery,\" explains Rucker. \"I would love to have some women come forward be part of this if it goes well and we do it next year.\"I cut this line for the same reason I mentioned above: I wanted the piece to grapple with the connection between men drinking in kitchens and men abusing people in kitchens. In hindsight, I should've kept it in.Do I think that the organizers of this event could've done more to find a woman to join their ranks for this dinner? Definitely. But the attention it would've generated for those women might've come with a cost. Stigmas around addiction still plague women much more than men. As one Instagram commenter wrote, \"We are definitely out there! Most colleagues, myself included, choose to be more discreet about our lifestyle choices. If I felt men and women were judged on a level playing field, it would be different.\"Rucker couldn't think of a prominent female chef who is publicly in recovery. Those women almost certainly exist, but it's not up to him or us or anyone else to out them.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletterRead MoreLifestyleMy Race Week Diet: Pizza, Lobster, Falooda, and MoreBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-20", "author": ["Condé Nast", "Amanda Shapiro"]}