{"id": "ba8870f49d5be688edf04fa5baf3944b", "url": "https://www.bonappetit.com/recipe/miso-butter-pecan-ice-cream", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Miso Butter Pecan Ice Cream Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueMiso Butter Pecan Ice CreamBy Sarah JampelJune 2, 20204.9(10)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintImagine a cross between butter pecan ice cream and salted caramel ice cream, except that the “salted” part comes from miso, which makes it less cloying and more complex. Red miso is going to give you the biggest punch, but yellow or white would also work—they’re just milder in flavor.IngredientsMakes about 2 quarts½cup (55 g) pecans¼cup (50 g) light brown sugar2Tbsp. unsalted butter2tsp. plus 1 Tbsp. red miso2¼cups heavy cream, divided¾tsp. kosher salt, divided114-oz. can sweetened condensed milk½tsp. vanilla extractPreparationStep 1Preheat oven to 350°. Toast pecans on a rimmed baking sheet until slightly darkened and fragrant, 6–8 minutes. Let cool, then coarsely chop.Step 2Heat brown sugar, butter, and 2 tsp. miso in a small skillet or saucepan over medium, whisking often, until butter is melted and no clumps of sugar remain, about 2 minutes. Add ¼ cup cream, bring to a simmer, and cook until mixture is thick enough to coat a spoon, about 2 minutes. Transfer to a small bowl and stir in pecans and ¼ tsp. salt. Let butterscotch cool.Step 3Place remaining 1 Tbsp. miso in a small bowl. Heat ½ cup cream in a small saucepan over low or in a  microwave just until warm; pour over miso and whisk vigorously until no large clumps remain (some small speckles are okay). Chill until cold, about 30 minutes.Step 4Mix together condensed milk, vanilla, and remaining ½ tsp. salt in a medium bowl.Step 5Combine chilled miso mixture and remaining 1½ cups cream in a small bowl. Using an electric mixer, beat cream in a small bowl, starting on low speed and gradually increasing to medium-high as it thickens, until billowy and stiff peaks form, about 5 minutes.Step 6Add a dollop of miso whipped cream to condensed milk mixture and mix in with a rubber spatula (this is just to lighten it so that the next stage—folding—is easier). Add remaining miso whipped cream and fold in, running spatula down sides and along bottom of bowl and lifting up through center and over top while rotating bowl to integrate without deflating, until very few streaks of condensed milk mixture remain. Add butterscotch in large spoonfuls, then incorporate in just 3 or 4 strokes so that big streaks remain.Step 7Scrape ice cream base into a loaf pan that’s at least 8½x4½\". Cover with plastic wrap or an airtight silicone lid and freeze until solid, at least 8 hours.Step 8To serve, transfer loaf pan to refrigerator and let ice cream soften 10 minutes before scooping into bowls.Step 9Do ahead: Ice cream can be made 1 week ahead. Keep frozen.How would you rate Miso Butter Pecan Ice Cream?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleTruly sensational. I make ice cream a lot, and this is now rivalling ube as my number one flavour. Like another reviewer I used white miso as it's what I had in the fridge, and I dissolved white sugar in whole milk as I didn't have canned condensed milk to hand. And I made it in an ice cream machine. But apart from that I followed the method! It shows it's a strong recipe that it can be adapted. I will be making this for years to come.SamuelGlasgow, Scotland12/11/2021Amazing. Easy to make, but very complex tasting. Vine of the few recipes I didn’t tweak after making it once. AnonymousHalifax, NS8/31/2021this recipe is so good! one of the best ice creams i've made without a machine. it's pretty sweet, though I used white miso, which gave it less savoury flavour. I will note that even with the whipped cream forming peaks, my pecans and butterscotch all sunk to the bottom  of the tin, which made it more of a classic butterscotch flavour for the first few scoops that didn't get to the bottom.toronto8/4/2020Delicious and creamy!tracyschifDenver, CO7/29/2020So yummy! Made this yesterday using vegan butter, coconut cream and coconut-based sweetened condensed milk. I followed the recipe process exactly but knew that my cream wouldn’t whip to stiff peaks, so after whipping five minutes (and just getting froth) and folding in the mix, I refrigerated until 50 F and then churned it for 35 minutes in my ice cream maker. After freezing overnight, it is soft and scoopable straight from the freezer, when most homemade dairy free ice creams aren’t. I’d definitely make it again! AnonymousRedmond, WA7/14/2020This turned out fantastic! The flavor was very rich and complex, and consistency was just like a creamy, store-bought ice cream! I might experiment with reducing either the miso or the salt JUST a tad, but the first time through I made it exactly as directed and I was very happy with the results. I chilled mine overnight. AnonymousUpstate NY 6/24/2020This is so so good! Highly recommend! I made double the caramel so there was extra big pockets of it! Becky RossUK6/7/2020This is so delicious! The salty funk of the miso balances out the sweetness of the condensed milk really nicely. Next time I might chill the butterscotch mixture a bit, so it holds together in distinct streaks a better when it gets folded in. If you haven't made no-churn ice cream before, know that it melts fairly quickly and has quite a soft texture even straight out of the freezer. I like this, but it's definitely not the same as 'true' ice cream.AnonymousNew York6/5/2020Explore Bon AppétitFrozen DessertDessertIce CreamMisoCondiments, Sauces & PastesPecanNutSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Sarah Jampel"]}