{"id": "ba903cfdd703d73237ae496f35b1dbfa", "url": "https://www.bonappetit.com/story/healthyish-way-to-do-summer", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "This Is the Healthyish Way to Do Summer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Is the Healthyish Way to Do SummerHint: It's not a two-month timed obstacle course.By Amanda ShapiroJune 28, 2018FacebookTwitterEmailH. Armstrong Roberts/ClassicStockFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Last week was the summer solstice......aka the longest day of the year, aka a day when I always feel slightly annoyed. It's not even the end of June, and we've already hit peak sunlight? I just stopped wearing my spring jacket! My summer, so far, has consisted of waiting for the A/C repairman to show up, spending way too much money at Juice Press, and 45 minutes at the beach (before it started raining).I recognize that this is a very New York mentality to have, to treat summer like a two-month timed obstacle course: \"Gotta get to the barbecue! And to the beach! And eat the arepa and drink all the frozen drinks! Gotta book the place upstate, and go to the music festival...wait, there's another barbecue!\"So I'm trying to remind myself to chill out. I've gotten back to meditating after a years-long hiatus. I'm sticking to my a.m. ashwagandha routine. I'm tackling summer haircare for frizzy types. (Got a tip? Help a girl out.)I'm settling in with my CBD cocktail and a #longread, like Mayukh Sen's search for the woman who changed the way his family cooked. And Hilary Cadigan's profile of the next barbecue king.Can I also recommend this no-bullshit skincare newsletter from Le Culture Club? And this grain-free granola that is clustery AF? And the web show Home: A Queer Cooking Series?And if you're like, \"Summer is NOT the time for television, I am MUCH TOO busy for that,\" just remember: You're having a summer—summer's not having you. And that, my friends, is BDE.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyish NewsletterHealthyishessayRead MorecookingThe Healthyish Drink of the Summer is HereBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Amanda Shapiro"]}