{"id": "baa6d514d3b4998b71b14e5f13565cc9", "url": "https://www.bonappetit.com/story/brins-marmalade", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "This Lemon Marmalade Is the Only Jam I Keep on My Condiment Shelf | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Is the Only Jam I Keep on My Condiment ShelfIt's perfectly sweet, ever-so-salty, and mouth-puckeringly tart.By Amanda ShapiroOctober 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I've never really found a place in my life for jam. I prefer my toast with salted butter and a soft-boiled egg, and I'll take a PB&B (that's banana) over a PB&J any day. It's not that I don't have a sweet tooth; it's just that I prefer my fruit in its pure and un-jammified form.The one exception to this rule is citrus. Because, come on, I'm not about to layer whole lemon slices into my sandwich or on top of toast. That's why BRINS Lemon Saffron Marmalade is the one jam that's found a place on my fridge's condiment shelf. This perfectly sweet, ever-so-slightly salty, mouth-puckeringly tart marmalade works great on toast—and on warm, buttered blueberry muffins, on stacks of pancakes with a scoop of Greek yogurt, or even between two defrosted waffles, eaten like a sandwich while I'm running out the door.In case you didn't know (I didn't), marmalade is just jam made with citrus fruits, traditionally bitter orange. The only ingredients in BRINS' version are lemon, cane sugar, pectin, sea salt, and saffron—and at 8 grams per tablespoon, there's less sugar than your average store-bought jam.BRINS, a Cajun-French word meaning \"little bit,\" is a small-batch jam company founded by architect-turned-jammaker Candace Ross. Her unique blends combine ingredients like strawberry and lemongrass, grapefruit and rosemary, and cherry and chai, inspired by her travels through Asia, Europe, and the Middle East.I want to try adding a scoop of the lemon saffron to a marinade for pork or lamb, or stirring it into a whiskey-based cocktail. I'm still no jam person, but there's definitely room for this marmalade in my life.  —Amanda Shapiro, Healthyish editorBuy it: Brins Saffron Marmalade, $15.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItMarmaladeShoppingRead MoreLifestyleThis Jarred Sauce Changed Our Grain Bowls For GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-18", "author": ["Condé Nast", "Amanda Shapiro"]}