{"id": "baa8a0c9f638fecf2b003ab4f31abfdc", "url": "https://www.bonappetit.com/story/kirsten-kirby-shoote", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Can Urban Farming Keep Indigenous Food Practices Alive? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureCan Urban Farming Keep Indigenous Food Practices Alive?The Tlingit food activist Kirsten Kirby-Shoote tends to Native crops in the pursuit of food sovereignty.By Esra ErolNovember 24, 2021FacebookTwitterEmailPhotographs by Rosa Maria ZamarronFacebookTwitterEmailKirsten Kirby-Shoote didn’t have a plan when in 2015 they booked a one-way ticket from Portland, Oregon, to Detroit. But they knew they wanted to work on an urban farm—and eventually start one. So they volunteered on farms as part of the Worldwide Opportunities on Organic Farms (WWOOF) network for a few years until they came up with the idea for their own agriculture project: Leilú Gardens. In Tlingit, they say, “Leilú” means “butterfly.”A seed keeper and member of the Tlingit Nation, Kirby-Shoote today tends to 1.5 acres of land in Detroit, the ancestral homelands of the Anishinaabe Nations. The seeds that they grow, such as Cherokee White Eagle corn and scarlet runner beans, make up fertile ground for Indigenous food sovereignty. The U.S. government’s forced relocation of tens of thousands of Indigenous peoples onto barren lands has resulted in a long legacy of little Native access to traditional foods, and Kirby-Shoote is looking to change that.They provide traditional foods and medicine to Detroit’s communities of color through an accessible garden and work with I-Collective, a group of Indigenous chefs, activists, herbalists, and seed keepers dedicated to food sovereignty and providing educational resources for food justice. And their work is not for profit. For them food is medicine, and it shouldn’t be sold or used for monetary gain but to heal—literally, as so many health issues, such as heart disease, arise from food insecurity and lack of access to crops, including Native ones. Kirby-Shoote’s own father died due to health complications.Kirby-Shoote shared about their work in urban agriculture, what set them on their path to food justice, and their vision for a future in which Indigenous practices shine.My life changed forever when… my father passed away from a preventable disease. I knew it was the quality of food he was given and the food systems that did him in, for better lack of phrasing. I had become aware of the nutritional and spiritual aspects of food at the same time, and I was always trying to convince him to eat healthier. There was a huge financial obstacle, a huge time obstacle. I couldn’t be stagnant after he passed away. That’s when I signed up for WWOOF. I sent out so many emails to farmers. It was the beginning of winter so there was not much work in agriculture, but someone in Detroit hit me up. I landed here and never looked back.This year I was able to grow… a field of corn as opposed to, like, 12 beds. I grew the Cherokee White Eagle seed for corn. And for beans I grew scarlet runner beans. I think those seeds were brought on the Trail of Tears when the Cherokee endured forced relocation from Georgia to their current Reservation in Oklahoma. When you’re deciding what to carry with you on a journey that might not end with you surviving, the importance of that seed really comes through in terms of taking care of future generations.One thing I’ll never do is... sell or use seed and food for monetary gain. That’s not to say trades are off the table. Trading is beautiful and has, in the past, connected so many nations across Turtle Island (North America). But I don’t sell food and I don’t make any money. I think that’s integral to changing the system.I recently took the big step of… acquiring permanent farming land for the community. Community ownership is very important and can exist outside of the capitalist system. That land will be eventually put into a trust because I know it doesn’t end with me. The trust will eliminate a huge barrier to access to land.Our Black relatives deserve just as much to know about… their seed memory. Every culture has seeds their ancestors relied on, relevant to both survival and tradition. That variety and scope that seeds have is really meaningful and I hope to bring everyone into that picture. We’re a mostly Black city. The land I acquired will also be used as a teaching space for the community.One way to start honoring Indigenous people… is to see who has been on the land that you occupy. Who has their ancestral, current, and future presence there, because a lot of people like to view Indigenous people as relics of the past. It’s easy for people to think, “These ancient people did X, Y, and Z,” but it’s harder for them to come to terms with modern-day Indigenous people and future Indigenous people. It’s a huge visibility issue and a huge lack of imagination for what the future will look like.My vision for the future… revolves about abundance for everybody. What if Indigenous knowledge is able to shine? And what happens if restorative practices continue? I think that the future looks like feasting and having abundance. I see abundance projected from the garden everyday. I always think, “Why isn't it like this for everybody?” Because it could be.Explore Bon AppétitPerson of InterestCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-24", "author": ["Condé Nast", "Esra Erol"]}