{"id": "bad1bbbfbb9c858fbffb8b556bfb5862", "url": "https://www.bonappetit.com/recipe/oven-barbecued-chicken", "year": 2018.0, "month": 8.0, "day": 2.0, "content": "Oven-Barbecued Chicken Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOven-Barbecued ChickenBy Claire SaffitzAugust 14, 20184.6(36)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintNo backyard? No problem! With the help of a quick spice rub, your favorite store-bought barbecue sauce, and a blast from your oven’s broiler, you can the sticky-sweet goodness of barbecued chicken—no grill necessary. It takes a little patience for the skin to crisp and the meat to tenderize, so don’t try to rush those steps (it’s worth it!).All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonMedium Bowl$17 At AmazonSmall Bowl$13 At AmazonTongs$13 At AmazonChef's Knife$34.53 At AmazonCutting Board$10 At IKEARimmed Baking Sheet$20 At Bon Appétit MarketHeavy-Duty Aluminum Foil$10 At TargetPastry Brush$9 At AmazonIngredients4 servings8pieces skin-on, bone-in chicken thighs and/or drumsticks (about 3 lb.)3tsp. kosher salt, plus more1½tsp. light brown sugar1½tsp. ground cumin1tsp. freshly ground black pepper, plus more1tsp. sweet paprika1tsp. garlic powder2medium onions2Tbsp. extra-virgin olive oil1Tbsp. apple cider vinegar1cup store-bought barbecue saucePreparationStep 1Arrange a rack in top third of oven; preheat to 350°. Pat 8 chicken thighs and/or legs dry with paper towels, then transfer to a medium bowl.Step 2Toss 3 tsp. salt, 1½ tsp. brown sugar, 1½ tsp. cumin, 1 tsp. pepper, 1 tsp. paprika, and 1 tsp. garlic powder in a small bowl. Sprinkle entire spice rub over chicken in bowl. Toss with tongs until pieces are coated.Step 3Peel and halve 2 onions through the root end. Place onion cut sides down on cutting board, then thinly slice lengthwise.Step 4Cover a rimmed baking sheet with foil. Transfer onion to baking sheet and drizzle with 2 Tbsp. oil; season with more salt and pepper. Toss to coat.Step 5Spread onion mixture on baking sheet and place chicken legs over skin side up, spacing evenly.Step 6Roast chicken on top rack until skin is rendered and meat is tender all the way to the bone, 40–45 minutes. Turn on broiler and continue to roast until chicken skin is blistered and crisp in spots, 2–4 minutes depending on the strength of you broiler. Remove from oven and let chicken rest 5 minutes to allow juices to settle.Step 7Stir 1 Tbsp. vinegar and 1 cup barbecue sauce in a small bowl with a pastry brush.Step 8Turn chicken pieces over with tongs. Push onions toward center of baking sheet to form a pile. Paint a generous layer of barbecue sauce over surface of chicken. Using tongs, arrange chicken over onions. Broil until sauce is caramelized in spots, 2–4 minutes.Step 9Remove baking sheet from oven and turn chicken one more time, placing in same position as before, only sauced side down (the skin should be facing up). Paint skin sides of chicken generously with barbecue sauce mixture (you most likely won’t use all of it). Return to top rack and broil until skin is bubbling and charred in spots, about 4 minutes.Step 10Let rest 5–10 minutes. Serve chicken over onions with remaining barbecue sauce mixture.How would you rate Oven-Barbecued Chicken?Leave a ReviewTell us what you thinkReviews (24)Back to TopTriangleExcellent! I'm surprised there were any negative reviews. Not only was the chicken delicious, it took no time or effort to prepare, and it didn't make a mess of my oven! I used drumsticks and followed the recipe for the most part. Based on other reviews I only used 1 tsp salt in the rub. I also reduced the cumin to 1/4 tsp and added 1 tsp sumac. Doing the dry rub a few hours ahead helps to season the chicken. I followed the recipe for the basting and resting steps and the results were amazing. The skin had a beautiful char, the meat was moist and fell off the bone, both the skin and meat had lots of flavor and the caramelized onions were fantastic.Canadian CookCanada5/17/2021Simple and delicious. Read the reviews before cooking and cut the salt down to a teaspoon. With the prepared BBQ sauce you get all the salt required. Added a little hot sauce and extra garlic, will definitely do this again.George WharrySherwood Park, Alberta 1/12/2021Overall, this was quite good and certainly worth the meager prep required.  The only drawback (and one that I later saw in several comments) is that the rub is WAY too salty.  I say this as someone who is hard to over-salt: I would recommend 1 tsp if you are sensitive to it and 2 tsp for anyone else, vs. the 3 tsp suggested in the recipe.  Aside from that, the rub was excellent and mixed nicely with just your standard Sweet Baby Ray's BBQ sauce.  The chicken came out extremely juicy with a perfectly crisped skin.  KatLouisville1/10/2021Amazing. Made this twice in the space of a month. First for a small family dinner, second for the extended family. For larger portions, we pre-cooked all the chicken to the first stage, then basted in sauce and broiled just before eating so everything was warm and just out of the oven! The suggestion to add pineapples by another comment below was gold - added them in at the broiling stage with some sauce over. \n\nTo make the flavours really sink in, we actually rub the spice mix onto the chicken overnight and then let the chicken dry out on a rack a bit an hour or so before roasting. Amazing recipe, thank you! AnonymousSingapore9/24/2020Awesome easy to also tweak to personal taste added sliced garlic and finely cubed butternut to bedding.  Will sure do this one again! Thanks 🙏 Juicy JohnCanada9/17/2020I have no clue who Anonymous is, who posted right beneath this comment one in which they gave it all of one star, but nothing could be further from the truth. This is absolutely wonderful. The onions alone are worth making the dish. And what a gift to people who have no access to a barbecue! Every element of great barbecued chicken is here--the savory sauce, tender chicken, crispy skin and the absolute ease of oven cooking. Bravo Ms. Saffitz! You have done it again. rsmmathewsBridgehampton NY8/16/2020Umm. This is really not good. The rub is really bad - too salty and something is off. Anonymous5/24/2020This is absolutely delicious. I live in Spain and I think salt here is \"stronger\" so this turned out too salty for me. Made it a second time reducing the amount of salt and worked perfectly. Will definitely make this againisalarawBarcelona, Spain4/22/2020Suuuuuuper delicious!!! Really loved it definitely will make againlilylipfordNorth Carolina4/18/2020Didn't taste very bbq-y. It tasted more like Indian flavor. It was okay, but very strong. Just not what i expected with the name.BuggsbunnayPoconos, PA4/7/2020Ridiculously easy (dare I say, foolproof) recipe to follow that yields a TON of flavor at the end. Thanks Claire!AnonymousPhoenix, AZ4/7/2020This was the best oven baked bbq chicken that I have made in a while! I will make this again.Adrake78CT - USA11/5/2019I made it and it turned out awesome. I will definitely be making it again. AnonymousTwin Cities MN5/28/2019This is SO easy and SO delicious! Will make over and over again.AnonymousMemphis5/19/2019Made it TWICE this week! Soooo good and made it originally with onions and then pineapple the last go around! BOTH ways were lip smacking good! No leftovers! Can not upload pics so I will hashtag #bonappetit on FB & INFLUENSTER! Momma AprylmaiAkron,Oh4/18/2019Explore Bon AppétitAmericanSouthernChicken ThighChickenPoultryPaprikaHerbs & SpicesChicken LegChicken DrumstickMainGluten-FreeDairy-FreeRoastGrillingJuneteenthFourth Of JulyMemorial DayLabor DayDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-14", "author": ["Condé Nast", "Claire Saffitz"]}