{"id": "bad6b7dad5426eb4a9ef5379be7c2078", "url": "https://www.bonappetit.com/recipe/make-ahead-mashed-potatoes", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Make-Ahead Mashed Potatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueMake-Ahead Mashed PotatoesBy Chris MoroccoOctober 16, 20184.1(30)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintYou can make and chill these mashed potatoes (Yukon Golds make for a creamier, glossier mash) up to two days before the big night. Two days! Just reheat gently with a little more dairy and they'll be as velvety as if you had whipped them only moments ago. How does it work? When you combine the butter and the hot taters and then add the dairy, the butterfat coats the potato starches, preventing the dish from ever getting sticky, gluey, or gummy. True story.Ingredients8 servings4lb. medium Yukon Gold potatoes, scrubbedKosher salt⅔–1cup heavy cream⅔–1cup whole milk1¼cups (2½ sticks) unsalted butter, cut into pieces½cup sour creamFreshly ground black pepperSpecial EquipmentA potato ricer or food mill fitted with fine diskPreparationStep 1Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–40 minutes. Drain and return potatoes to warm pot to dry (off heat).Step 2Meanwhile, heat ⅔ cup cream and ⅔ cup milk in a small saucepan over medium until just about to simmer. Reduce heat to low and keep warm until ready to add to potatoes.Step 3Pass hot potatoes and butter through ricer into a large bowl (this will help combine them quickly; most of the skins should stay behind but pick out any small pieces that get through if you want); season generously with salt. Mix with a potato masher until butter is melted and combined.Step 4Mixing constantly, gradually add warm cream mixture to potatoes, then mix in sour cream. Taste and season with salt and pepper as desired.ChevronChevronStep 5Do Ahead: Potatoes can be made 2 days ahead. Let cool; cover and chill. To serve, transfer potatoes to a small pot and add ⅓ cup heavy cream and ⅓ cup whole milk; reheat over medium-low, stirring often to prevent scorching.How would you rate Make-Ahead Mashed Potatoes?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleThis makes sad, gloopy, grainy potatoes. A waste of potato and butter. Just make good mashed potatoes the day of. AnonymousDallas TX11/29/2021Perfect. Just as good the next day as the day I made them. The only thing I would do differently next time is to peel the potatoes. Some skins did sneak into the mash. AnonymousWashington, DC11/26/2021I am so confused right now. I followed the recipe as written, except doubling all ingredients. I haven't even added the sour cream yet and it is basically potato soup. I'm really really bummed. Does it thicken overnight?? I'm not sure if I should run to the store for more potatoes to thicken it up. Very sad.KassiaSacramento, CA3/21/2021The butter and the potato through the ricer makes the dish, all the difference. It’s a mustAnonymousMiami 11/28/2020I peeled the potatoes before boiling them in salted water.  I skipped the ricer step and just mashed the potatoes & butter with the potato masher.  I may have added too much milk & cream, but the potatoes are fabulous.  I made them the day before Thanksgiving since I have to work on Thanksgiving.  Now the potatoes will be reheated just before serving time.  If there are any left after \"sampling\"! JenniferDenver11/25/2020haven,t tried this do ahead method used my kitchenaid for years. I now use a ricer and get help (grand kids and daughters)with the process. Ok. but if you serve apps like a veggie tray, dump the leftover ranch dip into the potatoes. DUH! An any cheese ,green onion etc.  that's my frugle kitchen.Patt QuinnLaGrange, IL11/27/2019A HUGE hit at Thanksgiving dinner.  AND, don't let the skins go to waste.  After pushing each batch of potatoes and butter through the ricer, remove the skins and save them for a future meal.  When you're ready, pan fry the skins in butter until browned then salt, pepper and serve with some of the sour cream.  The pan-fried leftover skins are nearly as good as the mashed potatoes!  St. Louis, MO11/28/2018Took these wonderful potatoes to Thanksgiving dinner yesterday and everyone loved them.  Definitely were NOT gummy and the best recipe that I’ve tried for taking mashed potatoes to an event in a crock pot.  I ended up making them in the morning then putting them in crock pot while still warm.  Worked perfectly.   Next time I do think I will try removing some of the potato skins after cooking (using silicon mitt) before ricing to make the process easier.  This recipe is a keeper.  Thank you, Bon Appétit!AnonymousAshland, KY11/23/2018Perfect!  I made these exactly as written.  I thought they were just perfect.AnonymousPhoenixville, PA11/23/2018Not sure if some of these others didn’t follow the recipe correctly, but these were a big hit at Thanksgiving today! Very easy, even though digging the peels out of the ricer was a bit messy. Was a nice way to “peel” the potatoes quickly though, and the flavor/texture was great.Anonymous11/22/2018Made this for a Thanksgiving potluck and I was asked if something had gone bad due to the amount of sour cream in it (pretty embarassing). After a ton of work, no one ate it. Flora KimNYC11/22/2018Horrible! The ricing of the butter with the potatoes made the whole thing impossibly difficult and greasy. All the skins ended up in. DO NOT MAKE. AnonymousDetroit11/22/2018No thank you.  Leaving the peels on is a HUGE mistake.  The ricer gets clogged, and it is a royal mess.  Definitely peel the potatoes first.  The final product is very rich.AnonymousTwin Cities11/21/2018When do you peel the potatoes?AnonymousFL11/20/2018These were sooooo good! I halved the recipe for two people and it came out perfect. I appreciate the tip about adding the butter before the cream! I’ve made a lot of gummy potatoes before. And I didn’t know that skin on is a. easier and b. keePs moister out of the potatoes. Thanks Chris!heatherkirk0927New York City11/12/2018Explore Bon AppétitAmericanPotatoVegetableYukon Gold PotatoSideVegetarianSimmerThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Chris Morocco"]}