{"id": "bad6b8c402a55235e436b9e2c623b103", "url": "https://www.bonappetit.com/story/jessica-seinfeld", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Jessica Seinfeld Eats Vegan Most of the Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJessica Seinfeld Eats Vegan Most of the TimeIn her new cookbook, Vegan, at Times, the home cook advocates that plant-based diets don’t need to be perfect.By Dawn DavisNovember 23, 2021FacebookTwitterEmailPhotograph by Mark WeinbergFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Jessica Seinfeld is working on eating vegan most of the time. A home cook with a family and four cookbooks under her belt, she’d be the first to tell you she’s a work in progress. She doesn’t always get it right, but guilt is not in her playbook. She and I sat down to talk about her new cookbook, Vegan, at Times, which shares over 120 vegan recipes, and the pleasure and privilege of eating a plant-based diet.This interview with Jessica Seinfeld has been lightly edited for clarity.How did the book come about?The idea behind this book is simple: I’m on this journey of trying to eat less animal protein and products. Join me.The book is subtitled 120+ Recipes for Every Day or Every So Often. So how “every so often” are you vegan?If I do the math, I’d say I’m 80 to 85% vegan, and every month it keeps increasing.What about during the holidays?The math will probably change. I don’t want to use the word setback because I hate these negative terms that we use around eating. Food is a pleasure. Food is a privilege. When we start shaming ourselves and, most important, shaming others around food, it just turns people off. I think that’s what caused a barrier around eating vegan—people feel like if they can’t do it 100%, then they’re a failure. I’m not always perfect. It’s a process.Vegan, at TimesVegan, at Times: 120+ Recipes for Every Day or Every So Often by Jessica Seinfeld\n$30 $17 at AmazonWas it hard to move a whole family to a vegan diet?It’s very hard to transition a whole family. That’s why I think it’s really important to set the intention of eating less meat and less dairy as a family. Of being conscious of our bodies and of our planet. It’s going to be a challenge. But we all know what’s going on with the environment. Since going to college, my daughter has realized that I am one of many who are challenging this idea that we need this much animal protein every day. In my household, we’ve committed to eating four weeknights of vegan food. Again, it’s a process.One of your cookbook recipes is Apple Blackberry Pie. When folks taste it, do they suspect it doesn’t have conventional butter?That is exactly the recipe I think about when I think about how we can make really delicious, traditional, cozy comfort foods using vegan substitutes. In fact, it’s one of the recipes that got me interested in vegan products. There are so many amazing, high-quality ones out there now. And they are widely available in regular grocery stores as well as at Walmart and Target. This Apple Blackberry Pie calls for Miyoko’s plant-based butter, which is so delicious. People love this pie.Many recipes in the book are made with whole foods too. For example, we make our own queso using boiled cashews, canned chipotle pepper in adobo, water, salt, and pepper. We use this Chipotle Cashew Queso to top our Smoky Bean Chili, Mexican-Style Grilled Street Corn, and our Roasted, Smashed Potatoes.If, after reading your book, a person is inspired to incorporate more vegan recipes into their diet, what are five pantry items you recommend they have?Olive oil, lemon, garlic, fresh herbs, and flax meal. The last one is really helpful as an egg substitute.What about something specifically vegan?Nutritional yeast. It is full of vitamin B12 and has a Parmesan-like flavor. And it’s great on pastas, risotto, popcorn, salads, and anything featuring breadcrumbs.And for baking?Aquafaba, which is the liquid that comes from chickpeas. You can use it to make whipped cream. Also, coconut oil, coconut milk, plant-based milks, and a plant-based butter, as I mentioned.I’m craving your book’s Breakfast Cookies, made with just six ingredients: flaxseed meal, peanut or almond butter, rolled oats, dried cherries or cranberries, vanilla, and maple syrup. Do the kids register them as cookies or healthy foods moms make them eat?It depends on what your kids are used to, how you talk to them about it, and, most important, how you as a parent model it.Your Stewy White Beans call for cannellini or Great Northern beans. Do you cook your own beans or buy them canned?I am not so organized as to have thought through soaking the beans overnight. So I’m a big canned bean person, but my culinary partner, Sarah, prefers to cook her own beans. We compromise. My recipes are developed with the busy home cook in mind.What are your favorite recipes in the book? One savory and one dessert.The Macaroni and Cheese is a hallmark in that it really convinced me that my family is movable around this issue. It tastes like any other macaroni and cheese. And the Chocolate Chip Chickpea Cookie, which is in my first book, is very popular. We remade them as vegan for the new book, using flaxseed meal, coconut oil, and canned chickpeas and rolled oats. It’s easy to make, delicious, really wholesome, and kids love them.Explore Bon AppétitCultureCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Dawn Davis"]}