{"id": "baecddda4ee430b1c258892e1b4860ec", "url": "https://www.bonappetit.com/story/poulsard-wine-for-thanksgiving", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Poulsard Is the Drinkable Goes-with-Everything Wine You’ll Want on Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopculturePoulsard Is the Drinkable, Goes-with-Everything Red You Need on ThanksgivingYou really only need one type of wine at Thanksgiving. This is it.By Marissa A. RossNovember 14, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is the part when I’m supposed to recommend easy-drinking Pinot Noir or Gamay because it’s Thanksgiving. But this year I’m not. With wine you can veer from tradition a bit more easily than the time you snuck jalapeño into the cornbread stuffing and Aunt Annette nearly had an aneurysm. So let me introduce you to the Thanksgiving wine of 2018: Poulsard.Poulsard (sometimes spelled Ploussard) is a lesser-known but totally delicious red wine from France’s Jura region. For years the grape was mostly used for blends because its light body and pale color weren’t as “powerful” as other French red varieties, the equivalent of always being seated at the kids’ table because your politics aren’t “strong” enough for the grown-ups’.It’s cloudy garnet in color, echoing the crimson cranberry sauce across the table. It pairs well with everything from turkey to vegducken without freaking out anyone or distracting from the precious (and jalapeño-free) stuffing. It smells like a walk down a pine-lined hometown street, past a berry bramble, leaves crunching underfoot. A sip will bring you back to life with a shock of cherry, pomegranate, and strawberry. It finishes like a smoky cedar plank with a hint of red currant and that one chair (every family has one).But what makes Poulsard such a special holiday wine is that it’s unexpected; it sparks a new conversation. If Thanksgiving is the ultimate excuse to eat too much in good company, Poulsard is all the justification you need to linger around the table and open up another bottle—or several.Now get some recipes to serve with that wine:1 / 69ChevronChevronSpatchcocked Turkey with Anise and OrangeView RecipeRead MorecultureThe One Time I Actually Cooked a Thanksgiving Meal On ThanksgivingBy Chris Moroccoculture7 Simple Rules for Mastering the Thanksgiving PotluckBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-14", "author": ["Condé Nast", "Marissa A. Ross"]}