{"id": "baf3b46448cf229cbb6542de27b7668a", "url": "https://www.bonappetit.com/story/chinese-cleaver", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "A Chinese Cleaver Is The Only Knife You Need, Says My Mom | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Chinese Cleaver Is the Only Knife You Need, Says My MomLeave it to cleaver.By MacKenzie Chung FeganNovember 10, 2020FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Want to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.What scared you as a child? Was it clowns at the circus? Monsters under the bed? That scene in Return to Oz where the witch takes off her head and screws on a new one? (How was this a children’s movie?!)For me, it was chicken.More specifically, the sound of my mom cutting a whole chicken into pieces. It startled me so much that I required a heads-up before she set to work, much as a parent might need to warn a child before a booster shot: “This will be unpleasant, but it’ll be over soon.”If you use a chef’s knife or a pair of kitchen shears to dispatch your poultry, this may be confusing. But my mother took apart her chickens with a Chinese cleaver, removing the breast and legs and then sectioning the thighs and drumsticks into smaller pieces, chopping through the bone. The thwack thwack of hefty steel meeting cutting board could be heard even over my afternoon cartoons, making me jump.A cleaver is still her tool of choice and not only for meat but also for vegetables. “Growing up, we had a small knife for fruit and then a cleaver for everything else,” my mom told me. She likes the ease with which the large heavy blade smashes garlic, slipping it out of its skin, and flattens ginger for soup so that more surface area is exposed. Unlike with a Western chef’s knife, this doesn’t require pressing down on the flat side of the blade with your palm. My mom just slams the broad side of the cleaver down with a satisfying, startling thud, like Gallagher smashing a watermelon. The wide blade also makes it easy to transport the vegetables she just diced to her pot or pan. No reaching for a bench scraper or trying to balance an entire chopped onion on the side of a chef’s knife—just scoot it all onto the cleaver.If you honed your knife skills using a German or Japanese-style Western chef’s knife, it may initially feel awkward to chop scallions or mince garlic using a cleaver; instead of a gliding elliptical motion, a cleaver calls for a steady, rapid up-and-down movement. But even if you don’t fully convert, consider keeping one on hand for specific tasks. It’ll make quick work of prepping tough fruits and veggies like corn cobs, butternut squash, and pineapples. If you’re slicing pork shoulder for a stir-fry, a cleaver’s broad blade will give you the thin pieces you need for optimal marinade absorption. And how does anyone cut a melon without a cleaver?The specific Chinese cleaver my mom (and everyone else in our family) uses is this affordable, wooden-handled model by Dexter. It’ll last ages, and, my mom told me, she never had to sharpen it! I expressed skepticism. “Oh,” she reconsidered. “Maybe Dad did it. Still a great knife though.”The cleaver does it all:Photo by Emma FishmanDexter 8\" x 3-1/4\" Chinese Chefs Knife with Wooden Handle$63 at AmazonExplore Bon AppétitShoppingKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-10", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}