{"id": "bb0f26cbc3a3edd903d653a5e04866da", "url": "https://www.bonappetit.com/story/kitchen-gifts-you-want-but-dont-need", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "12 Kitchen Gifts I Really Want But Definitely Don’t Need | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopcooking12 Kitchen Gifts I Really Want But Definitely Don’t NeedI don’t want a nonstick pan. I want beauty! I want marble! I want…a lazy Susan?By Alex BeggsNovember 20, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailHAPPY HOLIDAY$$$$$$$. If you came here for a sweet little ditty about the “true spirit” of the holidays, you might be in the wrong department. Unless that true spirit is SPENDING! Jingle jingle jingle! Ho ho hoooo! (That’s me ringing a set of reindeer bells and cackling wildly in the aisles of Target.)Ladies and gents, we’re here to celebrate the best part of the holiday season (other than the cheese balls): OPENING PRESENTS. Receiving presents. Thinking about what presents others have yet to bestow upon me. Exchanging mediocre presents for what I really wanted. But before I get to that last part, you could just buy me exactly what I desire from the get-go—these 12 unnecessary-but-beautiful-and-often-useful kitchen items. Stuff I want! Stuff I might need at some point! And I can’t be the only one.Do you need any of these items to successfully make a Basically recipe? No. But will you be glad to have them? Will you show them off to your friends, family, and pets? Will you sleep with them by your side? Yes, yes, and yes.Find the rest of our 2019 gift guides right here.All products featured on Basically are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.A Cheery Red Cherry PitterOnce a year I make a cherry pie. Once a year I make a cherry galette. Once a year I make cherry clafoutis. And a few times a year I need to pit Castelvetranos. That rough math comes out to: JUST GET ME A PITTER.Buy it: $12 from TargetA Moody Mortar and PestleI wanna smash some stuff. A mortar and pestle has utility, yes—it brings out your spices’ freshest, boldest flavors. But it’s also great for crushing nuts (for this omgawwwd romesco sauce) and cramming garlic into a paste. Let’s now focus on where it really functions, and that’s lookin’ pretty on open shelves. This big black marble one portrays a cook who is serious and glamorous. Me me me! I could also smash any home intruders over the head with it. Now that’s useful!Buy it: $150 from Food52A DonabeSpeaking of things that look pretty on open shelves, I don’t need a donabe! But I WANT one. Oh yes. Handmade earthenware. Even heat and insulation and “far-infrared ray-distribution.” Think of all the healthy soups and steamed black bass fillets I’ll whip up in this when I have the upper arm strength to get it down from the shelf.Buy it: $180 from JinenPhoto by Chelsie Craig A Tiny Tomato KnifeI have a big serrated knife, but life is too short for such long knives. I need a small guy to cut tomatoes from the months of July through October and grapes from January through December. You don’t cut grapes year-round? You do now!Buy it: $9 on AmazonAn Expensive ApronThere comes a time in every cook’s life when she knows that her smash burgers will be crispier, her pasta glossier, and her potato slices thinner—if only she had the right apron for the job. The kind of apron that will manifest into better cooking. If you look the part, you’ll become the part. Years of experience? Who has the time? This deep denim-looking apron from Freitag is sturdy yet lightweight and already broken-in (it’s linen and hemp, something eco-friendly called F-ABRIC that can go weeks without washing). It hides oil and food stains. It has pockets. It has cool and adjustable stripe-y straps. It’s $150?!?!! It’s COMPOSTABLE. Worth every penny, of someone else’s pennies.Buy it: $150 from FreitagA Set of Frenchy Steak KnivesLaguiole is a style of knives made in the village of, you guessed it, Laguiole in central France. It’s largely ripped off at tourist shops in New Orleans and on the internet at large because it has no trademark. So this set, in olive wood with an unnecessary holder with a prominent metal seal sold by trustworthy Williams Sonoma, is how you say, l’égit. But the absolute pleasure of a Laguiole knife is the tiny bumblebee on the handle. That’s what we’re here for.Buy it: $100 for 6 from Williams SonomaA Rectangular—I Said Rectangular!—Tart PanIf I had my very own tart pan, I might bake three to five tarts annually. That’s 65 tarts a decade, adjusted for inflation! But it’s gotta be rectangular. Long-legged rhubarb was born for this moment. Every tart made in a rectangular pan is like buying a work of art already custom-framed. Pleaseeeee!Buy it: $18 from Williams SonomaA Pretty Green CasseroleLike the donabe, whatever you cook in a pretty casserole can go straight from oven-to-table. As a person who could tone it down a notch, I dig the calming minty green of this one made by BergHOFF. Sure, I have an oil-splattered Lodge Dutch oven (thanks, Santa!) that serves the same functional purpose. But the Lodge, at this point, looks like it’s survived a ride on the back of Mad Max’s Interceptor. It’s been through some shit. The BergHOFF is like changing out of your overalls into your church clothes. Nice.Buy it: $180 from Food52A Speckly Spoon RestOh, you think I could just wipe the counter after? Are you crazy????Buy it: $28 from SchoolhouseA Lazy MF-ing SUSANFood on the table is meant for sharing, but I can’t stop everything I’m doing to keep passing the salt and chile crisp. But if there’s going to be a slab of spinning wood on the center of the table, it needs to look as good as a vase of flowers. This one from Terrain is mango wood (?!) and brass with a scrolling subtle leaf pattern.Buy it: $100 from TerrainA Salt, I Mean “Sel,” JarPut this salt cellar on the lazy Susan, call it a day. It’s glass and has a nice riveted pattern and a wooden lid that nestles in. Classy. I like the “SEL” label because my guests will think, “Oh, she must speak French,” increasing my worth in their judgmental, Francophile minds. Fooled ‘em!Buy it: $18 from Magnolia MarketTrivets That Looks Like Cute-Ass LeavesJUST LOOK AT THEM.Buy it: $64 from GarmentoryExplore Bon AppétitShoppingGift GuidesHoliday GiftsHoliday 2019Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-20", "author": ["Condé Nast", "Alex Beggs"]}