{"id": "bb24b0c75eac7e1dde7bd6858bd75d89", "url": "https://www.bonappetit.com/story/kristyn-leach-restaurant-diary-4", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Seeds Are Our Future, but We Need a New System | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSeeds Are Our Future, but We Need a New SystemIn her fourth Restaurant Diary, farmer Kristyn Leach explains how the pandemic destabilized supply chains, emphasizing the importance of reimagining the seed-growing system.By Kristyn Leach, as told to Aliza AbarbanelMay 26, 2021FacebookTwitterEmailIllustration by Jackson GibbsFacebookTwitterEmailRestaurant Diaries is a weekly series featuring four people working in the industry. Each week you’ll hear from one of them: bartender turned brand ambassador Jenny Feldt, wine educator Kyla Peal, line cook Peter Steckler, and farmer Kristyn Leach. Here Leach explains what she does beyond running Namu Farm in Winters, California: seed saving. It’s a crucial part of the agricultural system but has been upended by the pandemic, climate change, and aging seed growers. Now Leach is thinking about what change can look like for farmers, seed growers, and seed companies. Read Leach’s previous diary entries here.Seed Stewards, my CSA partnership with five other small BIPOC farmers on the West Coast, came out of the seed production I do for Kitazawa Seed Co., a seed company that’s mostly focused on breeding Asian crops with better drought and heat resistance. So many of the foods we enjoy and venerate as cultural touchstones are vulnerable at this time. If we don’t have seeds or our seeds aren’t adapted to survive in our climates, the crops can’t exist.Last year was record-breaking across the board for small regional seed companies. More people than ever wanted to get into growing their own food. It was great from a profit standpoint for these companies, but some people were buying too much out of fear of food insecurity, and it cleared everybody out. The demand was so great that it threw off inventory—and a sense of being able to accurately forecast. Some companies seemingly ended up with no seed to sell this year.Beyond seed shortages, a lot of seed companies are struggling to fulfill orders. They’re shutting down for several weeks at a time just to catch up. This hurts small-scale farmers who prioritize buying seeds from smaller entities. If the capacity is blown out, farmers have less latitude to forego planting something one season or plant later in the season.On top of that, some seed growers aren’t continuing to sell seeds to companies. This is why we’ve got a new seed contract at Namu Farm. We’re helping replenish stock seed for a company in Maine because a lot of their growers are stopping due to climate conditions and age. It’s been an interesting opportunity to go beyond my work for Kitazawa Seed Co. and my own seed project with them, Second Generation Seeds. It’s made me realize that small farmers need to figure out how we can bulk up all of our resources so we can create decentralized seed systems.Photo by Eugene Kan of MaekanThat’s why we created Seed Stewards to also operate as a small fellowship where Second Generation Seeds can support BIPOC farmers who mainly grow food for markets and don’t do much seed saving. The families participating in our CSA get delicious, culturally relevant produce, and the farmers in the fellowship can receive technical assistance and support from Second Generation to help structure seed growing on their farms. For example, Second Generation can share good farming practices with these farmers if they want to instill more heat and drought tolerance into their favorite summer squash variety. We collectively pick the crops for the CSA by asking each farmer: What’s a crop you really love, one that you’d feel heartbroken if the varieties you care about weren’t available? The goal is to preserve these culturally significant crops for the future and also help farmers build skills in seed saving. This way we start seeing more BIPOC representation in commercial seed growers, because a lot of seed contracts don’t go to them.The type of agriculture that is the cornerstone of our food system as a whole is mostly focused on the logic of industrialization. It's highly centralized and highly consolidated—most of the farmland in the U.S. is held by very few entities which curate what crops are grown. Biodiversity is being winnowed out of our corporate food structure because it’s not efficient to scale. Food has been made into a trade commodity.My farm is situated in the context of big agriculture, and the most terrifying thing isn't that we've received alarmingly little rain—it's that people's responses are so varied and the prevailing sentiment seems to be a race to the bottom. What kind of subsidies and policies could be enacted to manage our resources, instead of continuing to pump water and installing expensive, impactful water treatment filtration systems so big farms can hit numbers for what they’re contracted to grow? Those economic pressures mean farmers are making terrible long term decisions that affect our landscape.Earl Butz, President Richard Nixon’s U.S. secretary of agriculture, is famous for saying, “Get big or get out.” It’s the definitive statement of that industrialized American, Western agriculture paradigm. Another farmer told me we should actually be saying, “Get big, get out, or get weird.” So at Namu Farm, we’re trying to get weird through being more collaborative.Being a farmer, I feel like the matriarch of this ecosystem and worry about how everything will survive. It’s humbling to be reminded of my place by looking back on previous seasons. When 50 percent of our Korean melons got decimated by a soil pest last year, it felt devastating. But by August, the 50 percent that survived had spread out, and the gaps in the field were less noticeable. You care for these things and watch them die, but whatever is left is learning and adapting. From a seed-saving perspective, that’s the kernel of hope we hold onto. If just five seedlings survive and we prioritize saving those seeds, that might mean 15 survive next year and 50 the following year.Explore Bon AppétitRestaurantsRestaurant DiariesCoronavirusFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-26", "author": ["Condé Nast", "Kristyn Leach", "As Told To Aliza Abarbanel"]}