{"id": "bb31fa93c407d954060e7b2083616fd5", "url": "https://www.bonappetit.com/recipe/panna-cotta-with-cherries-and-lemon", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Panna Cotta with Cherries and Lemon Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2018 IssuePanna Cotta with Cherries and LemonBy Ignacio MattosApril 17, 20184.5(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThe panna cotta is delicious on its own but pairs even better with the maraschino cherries and lemon. Feel free to use whatever fruit preserve you like. Just make sure to cut it with something acidic so that it’s got some zing.Ingredients8 servings 1Tbsp. unflavored powdered gelatin4¼cups heavy cream⅓cup sugarPinch of kosher salt½vanilla bean, split lengthwise1cup maraschino cherries in syrup2Tbsp. fresh lemon juiceFlaky sea saltSpecial EquipmentEight 6-oz. glasses or ramekinsPreparationStep 1Place 3 Tbsp. cold water in a large bowl and sprinkle gelatin over; let stand until gelatin is softened, 5–10 minutes.Step 2Bring cream, sugar, and salt to a simmer in a medium saucepan over medium-low heat, stirring to dissolve sugar. Scrape in vanilla seeds; add pod. Remove from heat and let sit to infuse cream with vanilla, 15–20 minutes; discard pod.Step 3Pour cream mixture over gelatin and stir until gelatin is completely dissolved. Pour evenly among glasses, then chill panna cotta until set, at least 3 hours.Step 4Just before serving, mix cherries and lemon juice in a medium bowl. Spoon a bit of cherry mixture over each panna cotta and sprinkle with sea salt.Step 5Do Ahead: Panna cotta (without cherry topping) can be made 2 days ahead. Cover and keep chilled.How would you rate Panna Cotta with Cherries and Lemon?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis was a pretty, simple dessert. Overall easy to make. Unfortunately mine had a \"skin\" on top that I found unappealing. Not remarkable but worked for my dinner and some guests liked it a lot. CalTexas12/23/2020Explore Bon AppétitPanna CottaPuddingDessertItalianEuropeanCherryStone FruitFruitEasyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Ignacio Mattos"]}