{"id": "bb337ef64e7dc740d2f56f31f6610e74", "url": "https://www.bonappetit.com/story/adda-masala-fried-chicken", "year": 2020.0, "month": 1.0, "day": 3.0, "content": "Forget Hot Wings, I’m Making This Masala Fried Chicken From Now On | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingForget Hot Wings, I’m Making This Masala Fried Chicken From Now OnCrispy, funky, and extra spicy, this recipe from chef Chintan Pandya of New York’s Adda restaurant has everything I want in a finger food.By Molly BazJanuary 20, 2020FacebookTwitterEmailPhoto by Laura Murray, Food styling by Yekaterina BoystovaFacebookTwitterEmailYou know that delicious magic dust that makes Doritos great? That flavor-packed powder that gets stuck to your fingers and stains them orange—but you’re never actually mad because half the joy is licking it off?Well, picture that impossible-to-resist seasoning five times spicier, funkier, and brighter. Picture it smothering tender, crispy strips of fried chicken. Picture it hot and fresh and still sizzling. Picture it not as a mysterious nacho cheese “flavoring,” but a combo of vibrant hot chilis, sour amchur, and sweet chaat masala. That, my friends, is Masala Fried Chicken at Adda in Long Island City, NY. And it’s really, truly, absolutely something.The first time I tried the dish from chef Chintan Pandya, I couldn’t get over it. How could it be SO juicy, SO crunchy, SO mouth-wateringly flavorful, SO vibrantly neon red? Chintan, being the gentleman that he is, not only answered all of my questions by way of sharing the recipe with us, but he also came into the BA Test Kitchen to demo it. He could hardly keep up with our appetite for them: As soon as one batch hit the plate, we’d grab it with our fingers, devour it, and wait for more, our lips still tingling from the irresistible combination of sweetness, sourness, and heat—kind of like the way wings (or Doritos) get you hooked.And they should.Here’s how Chintan got there, and how you can too:1. That Tenderness!First, he uses boneless, skinless chicken thighs, which he cuts up into strips. That dark meat gets thrown into a marinade made of yogurt and distilled white vinegar (plus puréed garlic and ginger, and some dried spices, which we’ll get to later). If you’ve ever marinated chicken in yogurt you know the tenderizing power it possesses. Adding vinegar to the equation doubles down on that effect.2. The Crunchy, Crispy Texture!After a few hours spent in said marinade, the chicken gets rolled around in a mixture of both all purpose flour and potato starch. This ain’t no run of the mill fried chicken. This is super crispy fried chicken. Potato starch (also used in Karaage, japanese fried chicken, and in this Tawainese pork cutlet) helps that outside coating reach that ideal fried texture, without weighing it down.3. The Flavor!Building that complex, can’t-stop-eating-it flavor starts with the marinade. Fresh garlic and ginger, plus garam masala and ground turmeric (which need that hot oil to bloom), infuse the chicken with a delicious aromatic base. Then, immediately after being fried, the hot, hot, hot chicken gets tossed in fiery red kashmiri chili powder, sweet-acidic chaat masala, and mouthwateringly tangy amchur powder, all of which contribute to that finger-licking-good coating we just discussed.The key to this transformative spice blend is to procure the freshest spices you can find. When they’re fresh they’re fragrant, flavorful, and blindingly vibrant. When they’re stale they’re….well… not. Go the extra mile, we promise you won’t regret it. The old, stale, stodgy stuff just isn’t worthy of this chicken.Get the recipe:Masala Fried ChickenThe vibrant flavor and color of this spicy, finger-licking-good fried chicken comes from an abundance of ground dried spices, so be sure to use the freshest ones you can find.View RecipeExplore Bon AppétitNew YorkFried ChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-20", "author": ["Condé Nast", "Molly Baz"]}