{"id": "bb39f9c37b5526f7fea6a16aad24db45", "url": "https://www.bonappetit.com/story/instant-pot-split-pea-soup-recipe-tips", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Instant Pot Split Pea Soup with Bacony Croutons Because It’s Still Ham Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingInstant Pot Split Pea Soup with Bacony Croutons Because It’s Still Ham Season12 minutes under pressure—okay, plus 20 minutes to pressurize—instead of hours simmering on the stove.By Alex Beggs and Carla Lalli MusicApril 9, 2018FacebookTwitterEmailPhoto by Chelsie Craig, styling by Molly BazFacebookTwitterEmailFind the Instant Pot split pea soup recipe here.Split pea soup needs to taste like it was simmering for hours in a concentrated ham atmosphere, something biologists would take samples of back to the lab to examine in a quest to apply a formula to perfection.The key here is taste like. You can also make it in a pressure cooker or Instant Pot, with the same, hammy results.In this new recipe, Carla Lalli Music has a ham strategy: Cut slits in the ham skin (sorry) to help the ham tenderize and for fat to render faster. When we first tested the recipe, we kept it as-is and the ham was slightly tough when the rest of the soup was ready to eat. The cuts solve that problem.The MethodBut First, AromaticsSauté your aromatics (leeks and onions) in the IP until softened. This is a great excuse to buy the clear glass Instant Pot lid to see what’s going on in there. If you don’t have one, you can use the clunky machine lid, but keep an eye on the leeks so they don’t get browned. Then you’ll season them with cumin, cayenne, and turmeric.Ham TimeWelcome to the Instant Pot, ham hock. You’ve got to keep cooking the ham in the pot for three minutes or so, though, to give the oozing ham fat a head start. What a beautiful, beautiful image.Add the Split PeasWhether you’re using green or yellow split peas—all are cool with this recipe—you don’t need to soak them. After the ham fat scene, add in your split peas, salt, and add six cups of water.Press Some ButtonsAnnnd action. Set the timer for 12 minutes at high pressure. As you know by now, that doesn’t mean the soup will be ready in 12 minutes. Allow 20-ish minutes for it to come to pressure, and then once done, manually release.Shred the HamTake the ham hock out (with tongs, hello!), and let it cool for a few on a cutting board. When you can handle it, cut chunks off and put back in the pot to stir in like ham Lucky Charms.Season the Soup with LEMONYou need acid to cut through the fatty wonderfulness of split pea soup. Lemon works wonders in this department. Don’t skip it!The Bonus RoundWhen we first talked about this recipe, Carla tried to convince me to photograph the soup with yellow split peas, because she felt the green sludgy look was unphotogenic somehow. Psh! Our photographic solution: decorate the soup with BACON CROUTONS. While the soup is under pressure, cook bacon, add croutons, and toss ‘em around for five minutes or so. This is optional, sort of like how breathing is.I Have a SecretMy favorite thing to order at Katz’s Deli in New York is...the split pea soup. I’ve been called a grandma for this, a badge, or brooch I guess, that I wear with pride because my grandma is AWESOME. (She adds bran to all of her soup, from a container she keeps in her purse.) It’s a very good bowl of soup. And guess what? It’s VEGAN. Rich, delicious, completely HAM-less. Wow. As such, you can make this Instant Pot split pea soup recipe without the ham hock and absurd bacon croutons and still have a flavorful, hearty soup. Hoorah!Get the recipe:Instant Pot Split Pea SoupSplit pea soup is a lot like your favorite pair of slippers—it might not look like much, but boy does it make you feel all warm and fuzzy inside.View RecipeAnother easy Instant Pot recipe:Explore Bon AppétitInstant PotSoupHampressure cookerRead MorecookingThe Instant Pot Dal Formula That Makes Dinner In MinutesBy Priya KrishnacookingHow to Make Coconutty Pressure-Cooker Short Ribs in 1 HourBy Alyse WhitneycultureHow to Clean Your Smelly Instant Pot Sealing RingBy Alex BeggscultureThe Instant Pot’s Master Plan to Invade All of Our KitchensBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-09", "author": ["Condé Nast", "Alex Beggs", "Carla Lalli Music"]}