{"id": "bb519e5e75bf319f9d8c6d91a58c4124", "url": "https://www.bonappetit.com/story/how-to-drink-and-snack-italian", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "How to Drink and Snack Like an Italian on Vacation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Drink and Snack Like an Italian on VacationThere will be spritzes, and there will be nuggets of milky mozzarella di bufala.By Amiel StanekApril 25, 2018FacebookTwitterEmailPhoto by Michael Graydon and Nikole HerriottFacebookTwitterEmailThe Italians understand that you can’t have drinks without snacks, and you can’t have snacks without drinks. But when you’re on vacation, both the snacking and the drinking should be easy with a capital “E.”A spread of beautiful things to nibble on isn’t about cooking; it’s about curating. You pick up the best product you can find—be it prosciutto di Parma, pimiento cheese, or smoked trout dip—and set it out in a way that facilitates maximum deliciousness. Gently warming the olives. Draping spears of dripping-ripe melon with gossamer slivers of ham. Arranging a few morsels of provolone with pearl onions on toothpicks to ensure that everyone gets a perfect bite. See, snacks make it all possible. They’re what afford you the flexibility to roll with this whole lunch-at-three, dinner-at-nine, no-schedule-but-your-schedule thing. They’re the key to making sure that the second Negroni of the afternoon doesn’t put anyone under the (still-to-be-set) table. And if you serve enough of them, nobody’s going to complain when the dinner hour comes and goes.That dip is basically... cheese and cream.\nPhoto by Michael Graydon + Nikole Herriott. Prop Styling by Kalen Kaminski.5 Incredibly Easy and Casual Snack IdeasA sweet little pickled pepper wrapped around an anchovy wrapped around an olive? Briny and beautiful, it’s the ideal foil to a tall, bittersweet Campari and soda.Cheese, please! Nuggets of milky mozzarella di bufala paired with bits of mostarda— chunks of fruit preserved with a touch of fiery mustard oil—make for a study in contrasts.Tiny jarred cocktail onions are good for more than just Gibsons. Add a cube of tingly provolone piccante, a bit of parsley, and a few grinds of black pepper, and it’s practically a salad!Few things taste as unmistakably of summer as sun-warmed cantaloupe coupled with the salty funk of dry-cured ham. Just drizzle with grassy olive oil and eat. It’s a classic for a reason.Think of this as an Italianate queso dip: soft, spicy Gorgonzola dolce mashed with a little heavy cream until it reaches the ideal dippable consistency (see above).Your bar can look like this no matter where you’re vacationing.\nPhoto by Michael Graydon and Nikole HerriottAnd Now CocktailsCocktails on vacation present a conundrum. Everybody wants them; nobody feels like mixing them. That’s the genius behind the spritz bar: Set out plenty of ice, sparkling wine, and a few aperitifs, and let people go to town. It’s the ideal DIY cocktail because there’s no right way to make one. (Go ahead: Google it.) It’s a formula. Fill a glass with ice, add a slug of your spirit of choice, fill it most of the way with bubbly, and top with club soda. Slip in a strip of citrus peel and take a sip. Too boozy? More soda. Too sweet? More Prosecco. Sip, adjust. Sip, adjust. Spritz the afternoon away. Here's how you should stock your cart.Whether you’re spritzing, highballing, or hydrating, an ample supply of fizzy water is key. Buy by the case.An aromatic strip of citrus peel (or whole wedge if you’re into that) makes the simplest drink feel deluxe.Crisp, affordable sparkling wine (think Prosecco) is the vacation pour of choice— keep the bottles poppin’.Bittersweet aperitifs like Campari and Aperol are the backbone of the spritz— and useful for stronger drinks too.This is part of our May travel issue, devoted to Italy, subscribe here.Try this Rosé Aperol Spritz, too:Explore Bon AppétitTravelItalianCocktail PartySummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-25", "author": ["Condé Nast", "Amiel Stanek"]}