{"id": "bb5620e00fabb724afddb69f2deac2dc", "url": "https://www.bonappetit.com/recipe/crispy-skinned-fish-with-herb-sauce", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Crispy-Skinned Fish Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2018 IssueCrispy-Skinned Fish with Herb SauceBy Chris MoroccoMarch 20, 20184.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Stephen Kent Johnson, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintYou don’t need a culinary school degree to cook fish with skin as crunchy as a potato chip. Grab your nonstick skillet, start the fish skin side down, and slowly raise the heat. The skin will lie flat, gradually rendering fat like a strip of bacon, while the flesh gently cooks through. You can do this. Anyone can do this.Ingredients4 servings 2oil-packed anchovy fillets (optional)1small garlic clove, thinly sliced1cup chopped tender herbs (such as parsley, dill, and/or basil)1Tbsp. chopped pickles (capers, cornichons, or chile)2Tbsp. fresh lemon or lime juice or white wine vinegar6Tbsp. (or more) extra-virgin olive oil, dividedKosher salt, freshly ground pepper45–6-oz. skin-on black bass, striped bass, snapper, or salmon filletsFlaky sea saltPreparationStep 1Using the side of a chef’s knife, mash anchovies (if using) and garlic on a cutting board until a coarse paste forms. Mix in a medium bowl with herbs, pickles, lemon juice, and 5 Tbsp. oil. Season green sauce with kosher salt and pepper.Step 2Swirl remaining 1 Tbsp. oil in a large nonstick skillet to coat. Season fish generously on both sides with salt and lay, skin side down, in cold skillet. Place skillet over medium heat and let it gradually heat up until fat starts to cook out of fish, about 4 minutes. At this point you may press gently on fish so that the skin is flat against the pan. Continue to cook until skin is super-crisp and flesh is mostly opaque (you can increase or decrease heat slightly if needed, but don’t try to rush it), 8–12 minutes longer, depending on the thickness of the fish. Less fatty fish won’t release as much fat on their own, so you may need to add a splash more oil to the skillet if the skin isn’t getting crisp enough. Turn fish and cook just until opaque all the way through, about 1 minute.Step 3Spoon green sauce onto a platter and carefully set fish, skin side up, on top. Sprinkle with sea salt.Read More: The 29 New Essential Recipes from the Bon Appétit Test KitchenHow would you rate Crispy-Skinned Fish with Herb Sauce?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleMy fish turned out PERFECT! Thanks for this recipe.LillyVienna7/26/2021For the people in the comments, what’s the best type of fish to use?Anonymous7/20/2020I’ve made this twice in three weeks! So delish and so easy! You end up with such a spectacular plate. 10/10\n(To the person who’s fish didn’t release... you gotta use a non-stick skillet. Also, your fish might have needed extra oil. I had zero issues both times)AnonymousSunnyvale,ca4/15/2020My fish never released from the pan. :(Anonymous10/3/2019Life changing! Thank you!phdm10/3/2019This turned out fantastically! The acidity of the green sauce pairs super well with more oily fish. My whole family loved it!recarlsColorado6/29/2019Explore Bon AppétitSalmonFishSeafoodSnapperBassQuickEasyWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeKetoHealthyishFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-20", "author": ["Condé Nast", "Chris Morocco"]}