{"id": "bb6242b9f9ebc3571218517cc1d9b811", "url": "https://www.bonappetit.com/recipe/shawarma-spiced-beets-with-garlicky-labneh", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Beets with Garlicky Labneh Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueShawarma-Spiced Beets with Garlicky LabnehBy Yewande KomolafeNovember 15, 20183.8(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintThis recipe would also work with a large head of any color cauliflower, cut into ¾\"-thick steaks, in place of the beets. To transport, bring the labneh in a separate container. This recipe is presented to you by Samsung.Ingredients8–10 servings½tsp. coriander seeds½tsp. cumin seeds½tsp. fennel seeds¼tsp. cayenne pepper¼tsp. ground cinnamonKosher salt, freshly ground pepper3lb. golden beets, scrubbed, tops trimmed, bulbs halved and sliced lengthwise ½\" thick2medium fennel bulbs, fronds reserved, bulbs halved and sliced ½\" thick½cup plus 2 Tbsp. extra-virgin olive oil1head of garlic, halved crosswise1lemon plus 2 Tbsp. fresh lemon juice2shallots, peeled, thinly sliced1Tbsp. honey1tsp. crushed red pepper flakes1cup labneh or whole-milk Greek yogurt1cup mint leaves1cup parsley leaves with tender stemsSpecial EquipmentA spice mill or mortar and pestlePreparationStep 1Preheat oven to 400° Lightly crush coriander, cumin, and fennel seeds in spice mill or with mortar and pestle. Transfer to a small bowl. Add cayenne, cinnamon, and a 4-finger pinch of salt; season with black pepper.Step 2Toss beets, fennel, and ½ cup oil in a large bowl. Add spice mixture and garlic and toss again to combine. Divide beet mixture between 2 rimmed baking sheets. Roast, tossing occasionally, until beets are tender and golden brown around the edges, about 30 minutes.Step 3Meanwhile, using a vegetable peeler, remove lemon peel in wide strips, avoiding the pith. Thinly slice peel and transfer to a small bowl. Trim both ends of lemon so you can set it upright. Using a sharp knife, cut away lemon rind, exposing flesh. Cut lemon crosswise into ½\" rounds; remove seeds. Finely chop lemon flesh and add to bowl with lemon peel. Add shallots, honey, red pepper flakes, 2 Tbsp. lemon juice, and a 4-finger pinch of salt. Stir in 2 Tbsp. oil; season with black pepper. Let dressing sit until ready to use.Step 4Pop out garlic cloves into a medium bowl. Add labneh, season with salt and black pepper, and stir to combine.Step 5Spread garlicky labneh onto 2 platters. Arrange roasted beets and fennel over, then spoon dressing over. Chop about ½ cup fennel fronds. Scatter fronds, mint, and parsley over vegetables. Serve warm or at room temperature.Step 6Do Ahead: Vegetables can be roasted and garlicky labneh can be made 1 day ahead. Transfer to separate airtight containers and chill. Let vegetables come to room temperature before assembling.How would you rate Shawarma-Spiced Beets with Garlicky Labneh?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleDelicious! I didn't follow the recipe exactly, but it was very similar. I tossed everything with some greens to make it a salad and used red beets instead of gold. I also didn't have a lemon, so I used apple cider vinegar. Definitely would recommend -- especially if you're looking for a way to eat beets other than with goat cheese! The spices cut the sweetness and earthiness of the beets very well. AnonymousCambridge, MA6/14/2019Explore Bon AppétitMiddle EasternBeetVegetableGarlicFennelSideGluten-FreeNut-FreeVegetarianRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Yewande Komolafe"]}