{"id": "bb68fcd3f0a682aa5fc83cc9e88c07ed", "url": "https://www.bonappetit.com/story/how-to-make-the-most-of-your-trip-to-the-sundance-film-festival", "year": 2018.0, "month": 12.0, "day": 1.0, "content": "How to Make the Most of Your Trip to the Sundance Film Festival | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHow to Make the Most of Your Trip to the Sundance Film FestivalWe’ve got the inside scoop on your Park City excursion.By Chase Sapphire®December 6, 2018FacebookTwitterEmailFacebookTwitterEmailFor more than 30 years, the Sundance Film Festival has provided a platform for original storytellers. The experience is a hotbed of creativity, new ideas, and fresh conversation. At this annual gathering in Utah, the Sundance Film Festival shows feature-length, as well as short films, series and episodic content, and other emerging media. Daily filmmaker conversations, panel discussions, and live music performances also punctuate the agenda. To help you best navigate your time at the renowned film festival, Bon Appétit has teamed up with Chase Sapphire® to ensure every moment is as memorable as the films you’ll see. Here’s what to do.BUT FIRST, THE FOODOf course you’ve come to the Sundance Film Festival to see films! But you didn’t think we’d leave you to fend for yourself with some mediocre culinary experience, did you? In the Cardmember Lounge at Chase Sapphire on Main, Sapphire cardmembers have access to the Bon Appétit dining concierge, there to help make reservations at the hottest restaurants in Park City. In the Cardmember Lounge, attendees and their +1s can grab a coffee from the coffee bar between showings or stop in for happy hour to mingle with other festivalgoers. Not a cardmember? Chase Sapphire on Main is open to the public, and all SFF19 guests have access to the cooking demo led by a celebrity chef as well as daily sampling menus.ALL-ACCESS Q&ACurious as to why the director chose a specific ending? Wonder how the writers created that complex character arc? Fall in love in five minutes during your favorite short? Get behind-the-scenes details on the SFF19 films that captivate you. At Chase Sapphire on Main, all festivalgoers get insider access to intimate Q&As with actors, directors, and writers from featured films. It’s a once-in-a-lifetime opportunity that any film lover would covet.George BurnsMAKE A PLANRoughly 124,000 people will attend the Sundance Film Festival, which is spread across Park City, Salt Lake City, and the Sundance Mountain Resort near Provo. Each city is separated by a 30- to 75-minute drive, so be sure you know when and where your screenings are––and how you’re going to get there. Shuttles are offered between sites or you can rent a car to get around. When it comes to fashion, layer up! Your days will likely be jam-packed, starting with coffee at Chase Sapphire on Main, and ending at one of Park City’s best restaurants. Wear something comfortable that can take you effortlessly from day to night and keep you warm. Finally, take advantage of the cardmember-only lines at the box office on the second floor of the Gateway, located at 136 Heber Ave. —where you can secure your tickets for the festival's most-anticipated movies.George BurnsENJOY THE PERKSChase Sapphire sets the tone for an exciting and inspiring week with unique programming exclusively for cardmembers: experience wine and chocolate pairings, and twice during the week, attend the cardmember-only parties, where you’ll enjoy hors d'oeuvres with other attendees. And don’t forget, Chase Sapphire Reserve cardholders can earn 3x points on travel and restaurants worldwide—those places near, far, and in between.LEARN ABOUT MORE CHASE SAPPHIRE CARDMEMBER PERKS HERE.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-06", "author": ["Condé Nast", "Chase Sapphire"]}