{"id": "bb6ba21d191c845ca14ddb5055e95647", "url": "https://www.bonappetit.com/story/how-to-shop-for-a-knife-like-you-know-what-youre-doing", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "How to Shop For a Knife Like You Know What You're Doing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Shop for a Chef’s Knife Like You Know What You’re DoingThe bright side: It's definitely easier than shopping for a car.By Sarah JampelNovember 9, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Want to get Basically content way before these articles hit the site? Subscribe to our print magazine, where we explore a single subject every month. This time around: knives.Just like when you're buying a car and suddenly you need to understand terms like MPG (okay, that one's basic) and “Harmon Kardon\" (okay, that one's esoteric), buying the right knife requires learning a few terms and variables. Reading this article will certainly not make you an expert—sorry, it's just that people devote their entire careers to learning about knives. But it will give you a lot of the vocabulary you need to ask the right questions to yourself and in some cases to the very nice salesperson helping you (maybe on the other side of the internet).Whether you're angling for a Japanese-style or Western knife, browsing the web or shopping IRL, keep these elements in mind:How much should I pay?What makes some knives sooo much more expensive than others? It comes down to the materials used (is the handle plastic or wood? how is the steel treated?), the way the knife is crafted (is it finished by hand or by machine?), and the level of detail and perfection (some knives are essentially works of art).That doesn't mean you can't find a great knife within your budget. You might need to focus on the element (like size, steel, or durability) that means the most to you, and save the custom-made, hand-forged blade for another year.And if what you want is a relatively inexpensive knife you can start using today, no research required, we recommend the Western-style 8-inch Victorinox Fibro Pro Chef’s Knife. For a Japanese knife, try the 21-cm Tojiro DP Gyutou.Photo by Emma Fishman8-Inch Chef's Knife$47 at AmazonPhoto by Emma FishmanTojiro 21-cm (8.2\") DP Gyutou$85 at AmazonWhat kind of steel do I want?Avoid carbon steel—which requires a ton of care!—and go for stainless steel. Remember, though: Stainless doesn’t mean it will never stain. Every time you use your knives, clean and dry them. This prevents rusting and corrosion.Illustration by Tim LahanWithin the family of stainless steels, consider the steel formula. Because stainless steel is an alloy (i.e., a mix of metals), its exact make-up will vary among knives. A good rule of thumb: If the manufacturer doesn’t advertise what steel they’re using (sometimes it’s etched right into the blade), they’re not proud of it.At the very least, look for (or inquire about) the words “high carbon” (confusingly, that's different from carbon steel). High carbon is an indication that the knife will be hard and sharp.What is its Rockwell Scale rating?Illustration by Tim LahanIn general, the harder your knife, the sharper it can get; ask about its Rockwell Scale rating before buying—according to Chad Ward, author of An Edge in the Kitchen, anything above 56 will hold its edge without dulling too quickly (and Japanese-style knives tend to be 60+).How long should my knife be?Blade length is a personal choice—many people opt for an 8\" chef’s knife, but it's not the only option! A longer model is useful for tackling hefty vegetables (hello, squash) and cuts of meat. If you’re intimidated by large knives (or you’ve got a shoebox-sized kitchen or tiny hands), consider a santoku, a Japanese knife that’s usually no longer than 7\", with a flat cutting edge.What about the width?Chef’s knives with wide blades are ideal for smashing (ginger, garlic, lemongrass, spices), scooping up piles of chopped stuff, and cutting through tall ingredients like melon, cabbage, and a standing roast. If you don’t also own a paring or petty knife, though, a thinner blade might be a better choice: it’s easier to maneuver when coring tomatoes, pitting peaches, or slicing raw fish.More essential reading:The Best Chef’s Knife, According to BA EditorsThere’s no one perfect knife—but we’ll help you find the best one for you.View StoryExplore Bon AppétitKnivesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-09", "author": ["Condé Nast", "Sarah Jampel"]}