{"id": "bb72fc92109573533a031fc4165ebe92", "url": "https://www.bonappetit.com/recipe/oven-roasted-chicken-adobo", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Oven-Roasted Chicken Adobo Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueOven-Roasted Chicken AdoboBy Melissa MirandaFebruary 9, 20214.4(65)Read ReviewsTriangleEmailPinterestPrintPhotograph by Chona Kasinger, Prop styling by Callie MeyerEmailPinterestPrintEmailPinterestPrintIn a traditional Filipino chicken adobo, the meat is braised in soy sauce and vinegar until it collapses into slippery submission. This version is from Melissa Miranda, chef-owner of Seattle’s Musang, a Filipinx community space and restaurant. Her adobo is oven-roasted, leading to tender meat on the bottom of the pot as well as crispy skin on the top—“the best of both worlds,” Miranda says. Johnny’s Seasoning Salt, a blend of salt, garlic, pepper, and other spices, is a shortcut for adding flavor to sauces, stir-fries, and meats. Johnny’s is a Pacific Northwest brand, but Lawry’s Seasoning Salt will also do. If you can’t find Knorr liquid seasoning, look for Maggi seasoning instead. Either will add tons of extra umami to the chicken.Ingredients4 Servings6skin-on, bone-in chicken thighs (about 2½ lb.)Johnny’s seasoning salt or kosher salt½tsp. cracked black pepper; plus more freshly ground (optional)2Tbsp. vegetable oil1small onion, thinly sliced8garlic cloves, smashed½cup cane vinegar (preferably Datu Puti)¼cup soy sauce (preferably Silver Swan)3Tbsp. Knorr liquid seasoning3bay leavesGarlic Fried Rice and Winter Greens Laing (for serving)PreparationStep 1Preheat oven to 375°. Pat chicken thighs dry, then season very lightly all over with seasoning salt (or kosher salt and pepper). Heat oil in a large skillet over medium-high. Arrange chicken, skin side down, in pan and cook until deeply browned underneath, 8–10 minutes. Turn chicken over and cook until lightly browned on the other side, about 3 minutes. Transfer to a roasting dish just large enough to fit chicken in a single layer and arrange skin side up; set aside. Pour out and discard all but 2 Tbsp. chicken fat from the pan.Step 2Set skillet over medium heat. Add onion and garlic and cook, stirring occasionally, until garlic is golden and onion is translucent, about 3 minutes. Add vinegar, scraping up any browned bits stuck to bottom of skillet with a wooden spoon, then add soy sauce, liquid seasoning, bay leaves, ½ tsp. cracked pepper, and ½ cup water. Bring to a simmer, then remove from heat and pour over reserved chicken in baking dish (chicken should be mostly covered with only skin left exposed).Step 3Bake chicken, adding a splash or so of water if dish is looking dry at any point, until meat is almost falling off the bone, 60–75 minutes.Step 4Divide rice among plates and nestle chicken thighs alongside, dividing evenly. Serve with laing.How would you rate Oven-Roasted Chicken Adobo?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleFollowed the recipe exactly, loved the way it turned out, and now, THIS is my new way of making Adobong Manok hands down! I’ve made this many times before—as a child with my grandmother in the kitchen and then as an adult for my own family—so I was curious with Chef’s version; especially since it’s baked vs stewed on the stove. The crispy skin was amazing and the sauce’s flavor had a depth and richness (hot steamed rice is  must) you can’t deny! Selfishly, I love the baking part because I can completely set it and forget it. If you make this and for some reason are not a fan of the crispy skin, you can alternatively bake it skin side down so it just braises in the dish. Otherwise, recipe is a winner!Kathy C.Irvine, CA1/24/2022Delicious and easy!  I used coconut aminos that we had on hand from another BA recipe instead of searching around for the liquid seasoning.  Nor could we find the seasoning salt.  But it still turned out fabulous.  I've browned skin-on chicken thighs in a pan and put them in the oven afterwards for other recipes, but they still turn out flabby, at least on the bottom.  The key I think here, is that the top half is out of the liquid.  It was dark golden and super crispy.  Leftovers the next day, though not crispy, were still excellent.  Went very well with the rice and greens on the side.  Flavor explosion for sure.  Will definitely do again!LBinTXTexas3/25/2021I'm making this for the second time but doubling the recipe. We were disappointed that it didn't last through dinner and into tomorrow's lunch!\njojobeVero Beach, FL3/22/2021O M G!  This recipe is so simple and flavourful!  My kids loved it, my husband, but most importantly - I loved it!  Oddly I had cane vinegar in my pantry.  I used \"better than bouillon\" because I didn't have the knorr.  I assume its the same premise!  Highly recommend.  I will be making this again, and again!Jackie KennedyBrightwaters, NY3/18/2021This was so good. I only did the chicken and not the sides. I didn't have some of the ingredients. I used rice vinegar instead of cane and threw in some hoisin sauce because we didn't have the Knorr liquid seasoning. This would be a great meal for guests when we can finally have some over!KimWashington, DC3/15/2021I enjoyed the way this recipe turned out! Usually I shy away from using skin-on chicken because of the gummy texture it gets while being braised, but placing it in the oven makes a huge difference. The garlic rice was the perfect complement to a classic Filipino dish. \n\nUnfortunately I did not have liquid seasoning (or the recommended brands), so I added the listed amount but with water. Someone else in the comments mentioned swapping Datu Puti for ACV, and I second that. This is DEFINITELY a recipe I look forward to making again, next time with the liquid seasoning and laing.SpennyBrooklyn, NY3/8/2021I've made a few chicken adobos in my day. None of them have ever blown me away like this recipe. The depth of flavor is incredible. I made exactly as directed down to the recommended brands, and I think this is what makes the difference. Well worth the trip to my nearby Asian supermarket. It's also incredibly easy. I added a few extra cracks of pepper (I like my adobo peppery) and paired it with jasmine rice and the winter greens laing by Melissa Miranda, which was also divine. 10/10!!! GemWashington DC3/7/2021I want to try this but my husband is allergic to soy. Does anyone know what I can substitute?COVID Made Me a CookNew York3/6/2021Great recipe. I went to a local filipino store and got all the ingredients recommended. It was so worth it. Other ingredients may work, but going the extra mile for the recommended is worth it. Especially the shrimp paste in the greens recipe. That may have been the best thing I've made in my kitchen 11/10 would make again. AnonymousDavis, CA3/3/2021Too many ingredients not readily available. You should make the recipe more accessible. Knorr Liquid Seasoning? Maggi Seasoning?kenmarkham ontario3/2/2021this was so good! had to substitute fish sauce for shrimp paste and worcestershire for the knorr, but it was really, really excellentAnonymousNew York2/26/2021For us who are International readers and would like to follow the recipe, please do help us with ingredients / alternate ingredients that we will be able to find locally and use, keeping the taste and the preparation intact. \n\nSome examples like\nCane vinegar\nKnorr liquid seasoningSantanuIndia2/25/2021I liked this recipe mostly because of the skin -- soooo crispy! It's the bomb straight out of the oven. What I miss because of the preparation style (oven roasting) is the tender, fall off the bone quality you get via braising on the stove top or via slow cooking. (This method makes the skin flaccid, sadly.) That said, the meat is tender. Personally, I would keep the other ingredients the same, except for the liquids I would only use soy (maybe half?) and vinegar. I used Maggi seasoning in place of what Miranda suggests (and at 3T); to me, this muddled the flavor. I prefer the pure pungency of vinegar & garlic. Note to other cooks: you can use apple cider vinegar in place of Datu Puti cane vinegar. Silver Swan soy sauce is probably better, but I only had Kikkoman -- and it works! (Caveat: I got Covid and I don't think my taste buds are back 100%) JessicaSan Francisco, CA2/24/2021Loved it. Having trouble reading the less than stellar reviews, but I thought it was fantastic. It’s a bit salty, but just what you’d expect braising meat in soy sauce. Definitely recommend the suggested sides as well. MikePortland, OR2/14/2021Explore Bon AppétitFilipinoSoutheast AsianAsianChicken ThighChickenPoultryEasyWeeknight MealsOne-Pot MealsMainDairy-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-09", "author": ["Condé Nast", "Melissa Miranda"]}