{"id": "bb7483e13e46d82c35238db0ab0e10fe", "url": "https://www.bonappetit.com/story/working-from-home-eating-strategy", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "How to Stop Snacking and Not Eat Everything in the Fridge When You Work From Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Not Eat Everything in the Fridge When You Work From HomeWorking in close proximity to a fridge is a dangerous business.By Jillian KramerMay 25, 2018FacebookTwitterEmailPhoto by Carsten/Three Lions/Getty ImagesFacebookTwitterEmailWorking from home is dangerous business—a five-minute break can turn into a day-long Parks & Recreation binge-fest, and the perils of online shopping are ever present. And then, there’s the refrigerator, the place you go to cure stress and boredom, and to stretch your legs and stomach.As a freelance writer who works from her apartment, I know all too well the siren call of the refrigerator: It beckons throughout the day, whether I’m hungry or not. With recent estimates counting some 55 million U.S. freelance workers and a 2016 Gallup poll finding 43 percent of Americans work from home some of the time, I’m confident I’m not the only home worker who is caving to my cravings.“Working from home can be a serious luxury,” admits Brigitte Zeitlin, M.P.H., R.D., owner of BZ Nutrition in New York City, “but it also comes with pitfalls, like making over-snacking all too easy.” That’s in part because, “work sometimes means you’ll be stressed or bored—and either of those emotions can make it hard to resist the call of the refrigerator,” she explains.In writing these brief paragraphs, I’ve walked to the fridge no fewer than three times, just to break up the monotony of sitting at my desk alone. But we who work from home don’t have to be slaves to our refrigerators. We can break free of our chair-to-fridge cycles, Zeitlin says, and curb our constant cravings. Here’s how.Set meal times.“Eating on a schedule will help you fight cravings and stay satisfied throughout the day,” says Zeitlin. Plus, it will help you be mindful of whether you’re eating “because you’re genuinely hungry, or because you’re bored,” she says. Start your day with a filling breakfast of protein and fiber—think: a vegetable-egg scramble with a side of Greek yogurt and berries, plus a slice of whole-wheat toast topped with avocado mash. Then, commit to not eating lunch for three hours, Zeitlin says. Lunch can be followed by a snack another three hours later, and dinner three hours after that, she says.Drink water—and a lot of it.According to Zeitlin, “Staying well-hydrated throughout the day is a key defense against cravings.” (And, she points out, at home “there’s no issue with finding an open bathroom or passing the same coworker’s desk for the tenth time.”) Aim for eight to 10 glasses of water each day, though more is totally fine, too. Make it more appealing by adding a lemon or lime wedge, or swapping in sparkling for still.Take a break outside.You may value that fact that you don’t have to leave home—or the comfort of your couch—to work. But not stepping outside “can easily contribute to a kitchen fog, because your only mobility is a path from your chair to the refrigerator,” Zeitlin warns. So, “get out of your home at least once during the day for a walk, a cup of coffee, or an errand,” she encourages.Stock up on nutrient-dense snack foods.When the call of the refrigerator is too strong to resist, make sure it’s stocked with foods you won’t later regret eating. “Look to stock snacks in your home that are nutrient-dense, such as edamame, hummus and baby carrots, a banana with nut butter, a cheese stick with whole grain crackers, or an apple with almonds,” Zeitlin suggests. “These snacks combine protein and fiber, the two things that will help fill you up and keep you full and focused until your next designated meal time. If you have certain trigger foods that you can’t stop yourself from eating,” like potato chips or pretzels, “then do not keep them in the house.”Explore Bon AppétitHealthyishRead MorerestaurantsHow One Chef Broke Her Late-Night Eating HabitsBy Naomi PomeroyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-25", "author": ["Condé Nast", "Jillian Kramer"]}