{"id": "bb857e3a2d974ce15edf62da413a51a2", "url": "https://www.bonappetit.com/story/stella-bugbee-loves-gabriela-camara-tortillas", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Stella Bugbee Perfected Her Tortilla Technique This Summer, What Did You Do? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureStella Bugbee Perfected Her Tortilla Technique This Summer, What Did You Do?She owes it all to chef Gabriela Cámara’s first cookbook, “My Mexico City Kitchen.”By Stella Bugbee, as told to Emily SchultzSeptember 9, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailEarlier this summer, we noticed something going down on Stella Bugbee’s Instagram Stories. For a few months, The Cut’s editor in chief traded shots of mini purses and bright-red Valentino Birkenstocks for a whole lot of tortilla content. The inspo? Mexican-Italian chef (and Contramar owner) Gabriela Cámara’s first cookbook, My Mexico City Kitchen. The 360-plus-pager is a masterpiece of personal storytelling, colorful photography, and all the recipes you could ask for (yes, now you too can make The Tuna Tostada and two-toned grilled snapper). Stella dubbed it the cookbook of the season, and said she’d be practicing her Tortilla Technique ™ until she got it right. Many, many iterations later, we got in touch with Stella, who claims she’s “not a food person” (reader, she’s very much a food person), to find out what about Gabriela’s cookbook had her spending all summer with a fire engine–red tortilla press in hand. —Emily SchultzStella’s summer bible.\nPhoto by Chelsie CraigMostly, I keep cookbooks by my bed. I read them and read them and read them without ever feeling like I need to cook from them. I generally treat them more like literature, not as a bunch of recipes to follow. That’s been true of this cookbook from Gabriela Cámara: I keep looking at it. I keep enjoying it being around me. If I have five minutes, I'll just sit down and flip through it. I love that she shows her home kitchen, and it's really accessible and not fancy. I mean, I love a fancy kitchen, and there are cookbooks that I keep around the house just so I can look at the kitchens in them. But hers has a lived-in quality that I can relate to. And even though her food is excellent, it's pretty down to earth. It’s restaurant food, but it isn’t “restaurant food.” Somehow though, after all summer reading her book, all I really wanted to cook were the tortillas.One of my favorite meals of all time is one that feels very much like what inspired Gabriela to open Contramar in the first place: Tacos, made from fresh tortillas and freshly caught fish. I was 12 years old, on a beach on an island off of Mazatlan in Mexico. My dad and I spent the whole day body surfing and then ordered tacos by the piece from a fisherman and his wife. They were the freshest, most delicious thing. I thought, this is what cooking should be. It was just one of those meals that imprints on your brain.Cámara in her kitchen.\nPhoto by Chelsie CraigAs I was reading Gabriela’s descriptions of learning to make tortillas as a kid (the thing that got her into cooking, at seven years old), I thought, There’s no excuse not to try that. She makes them seem very achievable, like something that you can whip up on a weeknight. So I ordered a bright, shiny, red tortilla press on Amazon and started experimenting.I got a lot of tips—it seems nearly everybody on Instagram has an opinion. No lard. Yes lard. Lots of lard. I tried vegan versions, coconut oil, flax oil. I wasn't really nailing it, but that was a great excuse to just keep messing around. In the end, I went back to the plainest recipe she had in the book. I like my tortillas—Bob’s Red Mill Masa Harina with water and a little bit of oil on a skillet, which you don't really need but I do like the fat. I’m pretty sure my obsession has ruined tortillas for the rest of the people in my life, but I don’t care.Tortillas so good, they’re perfect with butter and anchovy spread.\nGabriela made making fresh tortillas sound like it’s just this easy life improvement. And it is. I love this book for that reason: It's as much about the lifestyle as it is about the food. I like her attitude. Her approach. She started her restaurant to create community and to have experiences that reflected how she felt about the world. I love that.The impetus to have a restaurant to call your own is not that dissimilar from having a magazine in which you're trying to articulate something about the moment you're living in. My favorite cookbooks are the ones that come out of that desire. Get the recipe for Contramar’s Red and Green Grilled Snapper:Contramar’s Red and Green Grilled SnapperWe modified Contramar’s whole-fish method with individual fillets, which are easier to handle—but the flavor is the same!View RecipeBuy it: Gabriela Cámara's “My Mexico City Kitchen,” $25 on AmazonAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon Appétitcookbook clubCookbooksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-09", "author": ["Condé Nast", "Stella Bugbee", "As Told To Emily Schultz"]}