{"id": "bb8d9dd5106a7e3787cec534fa0f7947", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/kissa-tanto", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Kissa Tanto Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverKissa TantoChinatown’s critically acclaimed Italian-Japanese restaurant worth dressing up forFacebookPinterestTwitterEmailIan LantermanGO HERE: for Kissa Tanto’s inventive Italian cuisine with Japanese influences. Chef and co-owner Jöel Watanabe, whose own heritage is Japanese and Corsican, finds an extraordinary equilibrium between these two culinary canons that you won't find anywhere else.ORDER THE: tajarin, a take on a classic Piedmontese pasta with hand-cut, butter-slicked miso-laden noodles showered with miso-cured egg yolk and Parmigiano; the frittelle di melanzane, crunchy garlic-and-eggplant fritters with yuzu gribiche; and the seasonal whole fried fish with a delicate, sweet daikon-soy dipping sauce.THE VIBE IS: genteel, an occasion worth dressing up for. Just inside the restaurant’s inconspicuous entrance, an inscribed mirror invites you to “Please fix your hair, and remove the mud from your boots.” One steep staircase later and you’re in a space inspired by jazz cafés in 1960s Tokyo as well as elements from the Hotel Okura.PRO TIP: Follow the industry folks: They like to snag seats at the bar later in the evening, a clever way to avoid the always-present queue for tables.PRACTICAL STUFF: Open Tuesday to Saturday, from 5:30 p.m. to midnight. Closed Sunday and Monday. The bar is first come, first served, and a portion of the room each night is kept for walk-ins (we don’t recommend groups larger than four). Otherwise, your best bet is reserving ahead of time (maximum of six guests), though they’re often booked up weeks or months in advance.—Lindsay AndersonIan LantermanWE ALSO LOVEThe Ramen ButcherUmami heaven and house-made noodles in ChinatownPhnom PenhA boisterous Cambodian-Vietnamese institution in Chinatown that’s still going strongBeaucoupAn outstanding bakery worth the (slight) trek to KitsilanoExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-17", "author": ["Lindsay Anderson"]}