{"id": "bb9b69900530efd81829c97eec3af27a", "url": "https://www.bonappetit.com/recipe/brussels-sprouts-with-pistachios-and-lime", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Brussels Sprouts With Pistachios Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueBrussels Sprouts With Pistachios and LimeBy Christina Chaey and Claire SaffitzOctober 15, 20194.6(43)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintThese roasted whole brussels sprouts get so crispy on the outside you’ll worry they’re burnt (they’re not!). Inside though, they’re perfectly, deliciously mushy—which, according to us, isn’t a bad thing. Of course, it gets even better when you coat them in a date molasses–brown butter glaze. Typically made from dates and nothing else, date molasses has a thick consistency and brings a deep, fruity sweetness and a bit of tartness. The Test Kitchen likes Al Wadi Al Akhdar brand or Just Date Syrup. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8–10 servings2lb. small brussels sprouts, trimmed3Tbsp. vegetable oilKosher salt, freshly ground pepper3Tbsp. unsalted butter3Tbsp. raw pistachios2Tbsp. date molasses or honey1tsp. honeyZest of ½ lime2Tbsp. fresh lime juice½tsp. crushed red pepper flakesLime wedges (for serving; optional)PreparationStep 1Place a rack in lower third of oven; preheat to 450°. Toss brussels sprouts and oil in a large bowl to coat; season with salt and pepper. Roast brussels sprouts on a rimmed baking sheet 15 minutes, then shake baking sheet to loosen them. Continue to roast until deeply browned all over, 5–10 minutes longer. Reduce oven temperature to 350° and roast another 10 minutes. Shake baking sheet again, then roast brussels sprouts until the tip of a small knife easily slides through, 5–10 minutes longer (total cook time will be 35–45 minutes).Step 2Melt butter in a large skillet over medium heat. Once butter starts to foam, add pistachios and a pinch of salt and cook, stirring often, until nuts are golden brown and butter solids are browned, about 4 minutes. Remove from heat.Step 3Using a slotted spoon, transfer nuts to paper towels; let cool. Coarsely chop.Step 4Meanwhile, bring date molasses, honey, and lime juice to a simmer in same skillet over medium heat (this will happen quickly), swirling pan to emulsify. Add 1 Tbsp. water and swirl to emulsify, scraping up browned bits with a wooden spoon. Add brussels sprouts; toss to coat.Step 5Transfer brussels sprouts to a platter. Toss nuts, lime zest, red pepper flakes, and a pinch of salt in a small bowl to combine; scatter over brussels sprouts. Serve with lime wedges if desired.Step 6Do Ahead: Brussels sprouts, glaze (without water), and pistachio mixture can all be made 3 hours ahead. Do not combine. Reheat glaze over medium heat until bubbling before adding water and brussels sprouts.How would you rate Brussels Sprouts With Pistachios and Lime?Leave a ReviewTell us what you thinkReviews (20)Back to TopTriangleCan the whole recipe made before hand and then just reheated the next day? because I’m not going to be able to have access to the oven… thanks AnonymousPortland, Oregon 11/24/2021Just ate it and it was delicious.  I baked flounder fillets in the oven when I turned the Brussels sprouts down to 350. Highly recommend!AnonymousAmericus, Georgia11/6/2021I am obsessed with Brussels sprouts. This is a brilliant version and one that I will use again. Thanks to  CHRISTINA CHAEY AND CLAIRE SAFFITZ!\nI did use real maple syrup instead of molasses, I smashed the BSprouts to get more crunchy texture (works!). had to use lemons which was fab, but will use key limes next time. Also love the pistachios, I also love walnuts with BSprouts. And loved the chili peppers. Perfect flavors. I think people who need to make adjustments should go ahead and do it, don't wait for someone to write in the recipe:::  \nNUM NUM NUMCyatsoHouston, TX5/2/2021Our new family favorite. This is a huge crowd pleaser whether you are a brussel sprout fan or not.JoyousamiHuntington Beac, CA12/27/2020The flavors are good overall, but there are better recipes for this ingredient on Bon Appetit. The glaze detracts from all the good crispiness (some reviewers suggest not using all the glaze, so maybe try adding the glaze to the sprouts to taste instead of following the instructions), but if you like softer sprouts this will definitely speak to you. I don't think the topping added much - maybe the pistachio crunch has to make up for what's lost in the sprouts. Raw red pepper flakes on top, where every now and again you get a bunch of spice on one spot of your tongue, doesn't work as much as warming them in the glaze could have. BreeHouston, TX12/26/2020Best brussel sprouts I have ever made or eaten! So yum! Can't wait to make it for Christmas again.AnonymousToronto, Canada12/22/2020Made this for Thanksgiving this year and it was a hit! Probably the best Brussels sprouts recipe I've ever made. The lime was a perfect balance with the honey (we didn't have date molasses, so we used honey for all of it). The sauce does brown REALLY quickly, so keep an eye on it. All of the flavors in this dish put together were so unique and worked together super well. AnonymousNorth Carolina11/27/2020A bit mushy but overall a great taste from the glaze, would make again and highly recommend for those sprout-haters out there.AnonymousVirginia11/27/2020Beautifully crunchy and flavorful, not overly spicy or tangy from the lime. I would maybe do a bit less of the date molasses or honey because I found the sprouts to be a bit too sweet. Also, you could totally do more brussels with the amount of sauce this provides. Instead of pistachios I used pine nuts (it's all I had) and it came out totally fine! Didn't even need to chop them after toasting in the butter. Biggest tip would be to monitor that sauce closely- do not let your butter, nuts, or honey burn!LuciaMcLean, VA11/27/2020I would like to see a few recipes WITHOUT chilis of some sort. I am very allergic to all of them and find that simply leaving them out makes a quite bland recipe. There are other spices you could use!MadknitterMonona, wi11/21/2020I have never liked Brussel sprouts until I had these. Absolutely sharp flavor from the glaze, and brings a much needed green to a very homogeneous looking Thanksgiving spread. Forget about salad. Thanks to Christina and Claire!XavierMadison, WI11/17/2020Another BA winner! This is my go-to Brussels sprouts recipe which I make often-absolutely delicious and so easy to make! AnonymousManhattan, NYC4/11/2020Followed the directions almost exactly and I got an excellent dish.  My pistachios were already roasted organic pistachios so I didn't cook them as long as specified - used all honey.  Perfect blend of flavors (not overly done) and easy to make.AnonymousNew London, PA3/2/2020Followed the recipe exactly as written, and it turned out great! My guest all told me they used to hate brussels sprouts but they loved these! canhovaFrance12/15/2019Too mushy for my taste. Would try again with the Brussels sprouts halved and the cooking time reduced to match. I just like my sprouts with a more solid texture.ohmystarsNew York, NY12/9/2019Explore Bon AppétitBrussels SproutVegetablePistachioNutFallSideVegetarianGluten-FreeHealthyishRoastThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Christina Chaey", "Claire Saffitz"]}