{"id": "bba8e647171da4d1b19dba2949776c0a", "url": "https://www.bonappetit.com/story/pita-chip-salad-for-kids", "year": 2020.0, "month": 1.0, "day": 2.0, "content": "How a Giant Tray of Roasted Vegetables Becomes “Pita Chip Salad” | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Get Your Kids to Eat a Giant Tray of VegetablesMake like Deb Perelman and call it “Pita Chip Salad.”By Deb PerelmanJanuary 8, 2020FacebookTwitterEmailPhoto by Laura Murray, food styling by Mariana VelasquezFacebookTwitterEmailWelcome back to Picky Eaters’ Club, where Smitten Kitchen’s Deb Perelman reveals what she actually cooks for her two kids.A giant tray of roasted vegetables, no matter how expertly cooked and seasoned, will never send my children running to the dinner table. And yet the recipe I’ve given you this month is exactly that: a giant tray of roasted vegetables. Let me explain.My general philosophy when it comes to feeding my kids is to cook what I crave, then find ways to add bait that will bring them to the table. This warm sheet-pan salad takes inspiration from fattoush, the bright, juicy-crunchy Levantine salad of tomatoes, cucumber, herbs, and crispy pita bread we love to eat during the summer. In the middle of winter, I opt for a seasonally appropriate cast of squash, cabbage, and red onion, which get roasted on high heat until the squash caramelizes, the cabbage frizzles and crisps, and the onion becomes toasty and mellow. I finish them with cider vinegar, which adds complex sweetness, and sumac, the tart spice that’s essential in classic fattoush.Who can resist the chip?\nPhoto by Laura Murray, food styling by Mariana VelasquezSure, Deb, you’re thinking, but it’s still a tray of vegetables. At this point I’m not above adding some kid bait. First are the aforementioned crispy pita chips, which are so delicious and easy that I’ll often toast extra pitas to entice the salad-hesitant among us. The second is Halloumi, a feta-like salty brined Cypriot cheese that’s often grilled, but when roasted becomes golden brown and pillowy soft.Which leads me to my final piece of bait: marketing. When the kids ask what’s for dinner, “pita chip salad” will beat out “winter vegetables with Halloumi” every time. When it’s time to eat, the adults can take satisfaction in the fact that we got exactly what we wanted: a big bowl of vegetables, with no one under the age of 10 any the wiser.Get the recipe:Warm Winter Vegetable Salad With HalloumiDeb Perelman’s fattoush-inspired, picky-eater approved salad with creamy squash, crispy pita chips, and chewy, charred cheese salad.View RecipeExplore Bon AppétitWinter SquashCabbageOnionPitaPicky Eaters’ ClubVegetableRead MorecookingFor Dinner That Comes Together in No Time, Make Red Bean Soup with Taco FixinsBy Deb PerelmancookingWhen in Doubt, These Hummus Bowls Are the AnswerBy Deb PerelmancookingFor a Kid-Friendly Cacio e Pepe, Just Add CornBy Deb PerelmancookingWhen It Comes to BLTs, There Are No SubstitutionsBy Deb PerelmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-08", "author": ["Condé Nast", "Deb Perelman"]}