{"id": "bbaabe6ed76ffcb861e09d0e0e136b09", "url": "https://www.bonappetit.com/story/floating-drink-holders", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Summer’s Hottest Accessory Is... an Inflatable Drink Holder? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureSummer’s Hottest Accessory Is... an Inflatable Drink Holder?If your Barq’s isn’t floating around in a hot pink flamingo this summer, reconsider every decision you’ve made up until this point.By Alex BeggsJune 24, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailLittle buttons on the back of our iPhones to keep them steady in our grips. Transition lenses. Compostable straws made of hay. There are many inventions in this modern era that deserve our respect, adoration, and credit card numbers, but none are as utterly silly and wonderful as the inflatable flamingo drink holder. It’s literally full of hot air. And I’m 100 percent on board. I don’t even have a pool.I’m obsessed with these things. I keep seeing them everywhere. Even at the BEACH, which is INSANE. The waves—are you crazy? I don’t need saltwater in my CANNED CUPCAKE CHARDONNAY. (Maybe I do?) Still, I’d like to believe that somewhere on a distant island, someone is sending a long love letter rolled up into a can of Canada Dry via an inflatable flamingo drink holder.This is the perfect invention in this bullshit digital age with no end in sight. It provides a service you didn’t know you needed while only really existing in order to be photographed. I love that. Like a lot of things in life, it’s ridiculous and hollow, but the second that bothers you, you’re dead. Embrace the frivolity! You know what problems I have? One: Getting thirsty when I’m in a giant body of water. PARCHED. Two: I’m physically attached to my phone, so much so that I have it with me in and around giant bodies of water. Cut to: Me in a full-coverage bikini, capturing the moment when my Barq’s floats by in a pink flotation device. Posts to Instagram 🏖️🍉🌤️🌊I am, however, a woman of little influence. But each time a real celebrity or Instagram influencer type posts a pool selfie with a drink floatie, 100 more spawn and pop up in every above-ground pool from here to Corpus Christi. These things are more viral than that weird rash the entire swim team got in 2006, which was VERY VIRAL. A pack of 36 goes for $23 on Amazon right now. How many do you need?“How many do you need,” Sharon Hershkowitz, who owns Manhattan’s iconic inflatable paradise Balloon Saloon, asks me when I inquire how many flamingo drink floaties she currently has in stock. (MANY.) She told me that they sell these floaties for your Fresca by the THOUSANDS.“Celebs use them in their pool videos, their Instagrams, when they’re in the Hamptons or wherever,” she says in a heavy New Yawk accent, and then they sell faster than happy hour frosé at a rooftop bar. She wouldn’t tell me the company that makes them (“you think I’d give away our secrets?”), but the flamingos are the most popular, with unicorns coming in at a close second. She’s tested them out and they never topple over, she swears to me, and they’re “always at your beck and call.” Assuming, I guess, there isn’t a gust of wind or an unexpected cannonball. She owns a few puppy floats and a hunk, a grimacing inflatable muscle man in sunglasses and sailor pants who straddles your Spiked Seltzer. “Who wouldn’t want a hunk floating next to them?”Coincidentally, I spoke to Peter Tanoury, a partner at GoFloats, which manufactures flamingo drink floaties (and their larger, human sized flamingo inner tubes are beloved by the Kardashians, Dave Navarro, and Moby, per Peter). He told me that they started selling the drink floaties in 2014. Other companies made them before, but cheaply (cough, that 36-pack). You can tell it’s budget kind when someone has their hand on their drink, keeping it from capsizing. GoFloats increased the size and made them sturdier, a public service. “Our sales of GoFloats® authentic drink floats are still up year over year,” he said, explaining that the original flamingo drink float was so popular that they came out with an entire line of designs. But not the hunk, he disclosed. They’re not responsible for that one.So please, do yourself a personal party favor and stock up on these inflatable drink holders before it’s too late. Soon—not sure if you’ve heard—the planet will be covered in rising waters, coffee tables will be deemed irrelevant, and the only option we’ll have is to rest our weary refreshments on floating flamingos. And you thought they were silly.Buy it: GoFloats Inflatable Pool Drink Holders (3 Pack), $10 on AmazonExplore Bon AppétitTrendsSummerShoppingSummer DrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Alex Beggs"]}