{"id": "bbb6a5d2123f7c1877634e6fc773f84c", "url": "https://www.bonappetit.com/recipe/grilled-pork-chops-with-pineapple-turmeric-glaze", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Pork Chops with Pineapple-Turmeric Glaze Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Pork Chops with Pineapple-Turmeric GlazeBy Chris MoroccoMay 22, 20184.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this grilled pork chops recipe, don’t be afraid of getting a good char here. It just means the sugars in the glaze are caramelizing (not that the meat is burning), resulting in deep, complex flavor. Try this glaze on shrimp, whole fish, chicken breasts, slab bacon, or beef skewers.Ingredients4 servingsVegetable oil (for grill)½cup pineapple juice (from a can)¼cup honey¼cup unseasoned rice vinegar3Tbsp. Dijon mustard1tsp. crushed red pepper flakes½tsp. toasted sesame oil½tsp. ground turmeric41\"-thick bone-in pork chopsKosher saltPreparationStep 1Prepare a grill for high indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side); oil grate. Bring pineapple juice, honey, vinegar, mustard, red pepper flakes, sesame oil, and turmeric to a simmer in a small saucepan over medium heat and cook, swirling occasionally, until reduced to ¾ cup, 10–15 minutes. Let cool. Transfer half of sauce to a small bowl and set aside for serving.Step 2Season pork with salt. Grill over direct heat until browned all over, about 3 minutes per side. Continue to grill, turning several times and basting with remaining sauce, until charred and coated with a thick layer of glaze, about 4 minutes. Move to cooler part of grill and take internal temperature of pork. If needed, continue grilling over indirect heat until an instant-read thermometer inserted into chops near bone registers 130°, 1–4 minutes more. Transfer pork chops to a wire rack and let rest 10 minutes before slicing. Serve with reserved sauce alongside.How would you rate Grilled Pork Chops with Pineapple-Turmeric Glaze?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleAbsolutely amazing. I used fresh juiced pineapple. chloehalonenUpper Michigan6/4/2020Explore Bon AppétitPork ChopPorkMeatPineappleFruitTurmericHerbs & SpicesEasyWeeknight MealsMainDairy-FreeGluten-FreeGrillingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Chris Morocco"]}