{"id": "bbbabec38d0268f2069cb81597696ad4", "url": "https://www.bonappetit.com/story/how-to-use-dry-spices", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "The Only Dry Spices You Need in Your Spice Drawer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Probably Have Way Too Many Spices in Your Spice DrawerRight this way to the stuff you should actually be keeping around—and exactly how to use them.By Carla Lalli MusicMarch 4, 2019FacebookTwitterEmailPhoto by Gentl and Hyers, Food Styling by Susie Theodorou, Prop Styling by Nina LalliFacebookTwitterEmailSpices aren’t for special occasions, and they’re not doing you any favors languishing in your kitchen cabinet. Whenever you’re seasoning with salt and pepper, that’s an opportunity to introduce a dry spice, which will add aroma and another layer of flavor to complicate (in a good way) your everyday cooking. Edit down to seasonings that are multipurpose (no more esoteric types you use twice a year!) and dip into those jars regularly, even when a recipe doesn’t explicitly tell you to. Half a teaspoon added anywhere won’t ruin anything; as you gain confidence, increase that amount or try combining two or three. Anytime you’re roasting or grilling meat, sautéing  garlic and onions for a sauce or soup, baking, or making stock or a pot of beans, try adding a spice.Bay leaf: simmer in any stock, soup, or batch of beans; tuck into the cavity of a chicken or onto a tray of vegetables before roasting.Cardamom: Buy the pods or seeds and grind before using. Add to pie fillings and quick bread batters or to rice dishes.Cayenne: Straight ahead spiciness. Use for dry rubs, to add zing to mashed potatoes or egg salads, or in slow-cooked pork and beef stews.Cinnamon sticks: Can go sweet or savory. Finely grate into pancake batter and infuse into custards. Add whole sticks to the braising liquid for lamb, pork, and beef, or use it finely ground to season pork and lamb chops and vegetable curries.These Spice-Drawer Chicken Wings are the perfect excuse to dig into your cabinet.\nPhoto by Gentl and Hyers, food styling by Susie Theodorou, prop styling by Nina LalliCoriander seeds: Citrusy and cooling, essential in pickle brines, spice pastes, and many curries. A light dusting is great for pan-roasted fish, especially cod, striped bass, and salmon.Crushed red pepper flakes: Keep a little jar on the dining table for sprinkling onto pasta dishes, soup, and beans.Ground cumin: Essential in Mexican black beans, also great with lentils. Add to dry spices for grilled meat and stir into yogurt sauces.Fennel seeds: Coarsely grind and use along with salt and pepper on turkey, chicken, and pork.Flaky sea salt: Adds crunch, sparkle, and a last pop of seasoning on salads, fried eggs, Caprese salad, and meats.Granulated garlic: Sharp and pungent, granulated garlic is no substitute for fresh but is great in creamy dressings and on roasted potatoes.MSG: Undeniably delicious despite being divisive. Use as a finishing, salty-ish condiment for fried rice, cucumber or watermelon salads, and breaded cutlets.Pimenton: The smoky, Spanish ground red pepper ranges from mildly spicy to hot and is completely harmonious with eggs, potatoes, any and all pork dishes, and rice.Explore Bon AppétitSpiceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-04", "author": ["Condé Nast", "Carla Lalli Music"]}