{"id": "bbc253642ba42d853f042b131bfba205", "url": "https://www.bonappetit.com/story/steak-or-chicken-wedding", "year": 2019.0, "month": 5.0, "day": 1.0, "content": "The Springy Spring Salad I’m Making This Weekend | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Springy Spring Salad I’m Making This WeekendPecans, in salad dressing, are you crazy? Yes and yes.By Alex BeggsMay 4, 2019FacebookTwitterEmailMichael Graydon + Nikole HerriottFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Good salad alertI picked up some crispy romaine hearts (they never let me down! Except with the salmonella!) because I was craving one of my favorite springy salad dressings, which is Vivian Howard’s pecan butter-honey vinaigrette. You essentially make pecan butter, then sweeten it with honey, loosen it up with olive oil, add lemon juice for acid, and that’s it. Now I need to track down some sugar snap peas.Get the recipe: Romaine and Sugar Snap Peas with Pecan DressingPhoto by Gustavo VivancoThis was cut from the storyAbout halfway to the airport I realized I forgot to pack underwear. I’d been so anxious and sleepless before I went to Peru to write about this magnificent restaurant next to an Inca ruin (pictured above) that I made detailed lists of every outfit. To be prepared. But in those lists, I’d failed to mention the unmentionables. In Lima, I set off on an underwear mission. “Ropa interior?!?!” I pleaded. I ended up with several boxes of sporty but too small Jacky Forms. My favorite Peruvian undergarments came from a boutique where I’d held up a pair of XS undies on hangers and asked the saleswoman if they came in Medium. Then she took them off the hanger, stretched the waist as wide as she could, and said, “Look, medium!” Sold.Want this letter before it hits the website? Sign up for our newsletter!Alex LauEmpanadas!!!One of my favorite new BA videos is this one, in which Gaby Melian teaches Brad Leone how to make Argentinian empanadas. Gaby doesn’t let Brad get away with anything, and it’s glorious. And hey, we have the recipes! Watch it and make empanadas this weekend and then bring me one.Get the recipe: Argentinian Beef EmpanadasBrad’s big fishBrad keeps getting surprise gifty deliveries of huge fish from far-flung places. (Rachel Karten for scale, above.) These are the kind of work perks you get when you’re Brad. On Thursday, he kept showing off this baby shark-sized thing, taking his time to wash it slowly, filet it thoroughly, and offer as many opportunities as possible for people to gawk at his big (40 lb.!) fish. So congrats Brad, you got a big fish! Here’s to many more in your future.Oh lord what have you doneBody sweatsAlex LauI went to the Hot Sauce Expo a few weeks ago, but nothing makes my whole body increase temp like the food at Ugly Baby. And yet my body NEEDS IT. This week I got takeout from the phenom Thai spot and discovered a new technique. After I ate the funky-sour-crispy duck salad, I felt my insides burst into flames, swallowed a gulp of beer, and then chased it with a bite of string cheese. This is not a patented technique, nor is it glamorous, but it worked in a way that milk/bread/white rice never has. Which means more duck salad for me, for you, for all of us (within the tri-state area).Guacamole cheese existsThe pallor of the Wicked Witch of the West. The flavor of overripe avocados and preservatives. I’m gonna sit this one out.Read this instead“...if there’s a population that is underserved, there is one that’s overserved too. We can order takeout on our phones, have entire meals delivered to our doors. We can eliminate certain foods from our diets because we are flush. We seek out the most magical olive oil, argue about the best wood for grilling, whisper about which clandestine corner to meet the raw milk guy. I care about these things too. But we need to find balance in our love affair with food.”Read it: Why I Gave Up on the New York Food Scene to Work in a Soup KitchenCherry tomato ChaeyWhat's for lunch?Hey friends, I need your etiquette questions about office lunch, and not just the one about microwaving fish. Is a lunch beer acceptable if your boss is paying? What about a second? This is for the September issue of Bon Appétit! Send your questions my way at staff.bonappetit@gmail.com.Unnecessary food meme of the weekUnnecessary food feud of the weekPhoto by Lisa Larsen/The LIFE Picture Collection/Getty ImagesThis week, Sarah Jampel made a plea for better vegetarian options at weddings, which got us talking about the more-often-than-not sorry state of all wedding food. (Except for Molly Baz’s: “You should have seen the raw bar!”) A tiny postcard appears and you have to circle your doom. So what is it, I asked the (meat-eating) staff, the chicken or the steak?“Here’s a cheap thing you can have for free, or an expensive thing you can have for free,” said Alex Delany. “I’ll take the expensive one.” I’ll put you and “I’m not payin’” Molly down for steak, then. Emma Wartzman would rather have dry chicken than chewy steak, but Jesse Sparks would rather have bad steak than unseasoned chicken. Sasha Levine and Chaey will be too busy dancing. Geography nut Adam Rapoport asks, “Is the wedding in Tuscany or Texas?” Because “if so, I’m the steak. Everywhere else, the chicken.” Andy Baraghani is “a tequila on the rocks with a side of chicken.” Carla Lalli Music is under the impression that steak offers less opportunity for “cross-contamination,” which, okay, Carla. Elyse Inamine will have the fish. And Meryl Rothstein doesn’t care. “I’m there for the apps,” she said expertly. “I’m going to fill up on apps, and then the chicken is irrelevant.”(Or opt for pineapple salad, like the Kennedys!)Explore Bon AppétitBeggs NewsletterRead Morerecipes20 Rules For Making the Best Salads of Your LifeGallery20 SlidesBy Sarah JampelcultureJoy, Pain, and Puke at the 2019 Hot Sauce ExpoBy Alex BeggsPhotography by Amy LombardcultureWhat Happened When I Asked My Friends to Recipe Test My CookbookBy Priya KrishnarestaurantsWhere Potatoes Pass From the Ice to the SunBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-04", "author": ["Condé Nast", "Alex Beggs"]}