{"id": "bbcee4fb5e347c4a3f351e0a197c8aef", "url": "https://www.bonappetit.com/story/pantry-pasta-koshari", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "This Koshari Recipe is Easy to Make and Comes Together With Whatever Leftover Grain and Beans You've Got | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingKoshari Is the Cozy Pile of Carbs I Make to Clean Out the FridgeAll my people out there saving an ounce of pasta or a spoonful of cooked lentils, this one's for you.By Sohla El-WayllyApril 21, 2020FacebookTwitterEmailFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.When my fridge is packed with the annoying kind of leftovers—none of which make a meal but all of which I’d feel guilty getting rid of—I know it’s time to make this fridge-clean-out, pantry-raid koshari.Koshari is a cozy pile of warm carbs—traditionally, cooked rice, lentils, macaroni, and chickpeas, all mixed together—smothered in perky tomato sauce and buried in fried shallots. Sometimes it’s stuffed in a pita, for an extra layer of starchy comfort. When my half-Egyptian (and half-Bolivian) husband first made it for me, I thought he’d lost his mind with all the carbs on carbs on carbs. But then I tasted it and couldn’t get enough. The dynamic textures of chewy pasta, fluffy rice, creamy beans, and crunchy shallots had me hooked.To make it, start by cooking that last handful of pasta in the box. You want something small and spoonable like ditalini or macaroni. If you don’t have a short pasta, simply break up some spaghetti—easy! While the noodles boil, warm up a scoop of cooked lentils, that half-can of beans, and some leftover takeout rice or any cooked grain. It’s easiest to just zap in the microwave, but you can get fancy and heat it on the stovetop with a splash of bean broth, water, or stock to keep it from drying out.Meanwhile, sauté some chopped onion and garlic in olive oil until tender, then add your chile of choice: good ol' chile flakes, fruity Kashmiri red chile powder, hot-stuff cayenne, or even smoky chipotle. You can go off the rails here if you want, adding a hit of cumin, coriander, or a warm spice blend like hawaij. Give the spices a minute to bloom, then add whatever tomato product you have on hand: tomato purée, leftover marinara, hand-crushed canned tomatoes, or even diced fresh plum tomatoes. Simmer for a few minutes and then, once everyone has gotten to know each other, add a few glugs of any vinegar that catches your eye. Don’t be shy, you want this sauce to slap you in the face with spice and acid. It’s the only thing keeping you from taking a nap in the carb bed you're about to make.To bring it home, mix up the pasta, beans, and grains in a bowl (or pita) and pour on your perky tomato sauce. Finish with a big, generous handful of crispy fried shallots, or any frizzled allium, and dig in.Once you know how to make koshari, you’ll never think twice about whether to save those last few scoops of rice or the half-cup tomato passata. Because the answer is always YES!Explore Bon AppétitIt's That SimpleBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-20", "author": ["Condé Nast", "Sohla El-Waylly"]}