{"id": "bbd5e0c9b6d7ae2835f85b74068c1e27", "url": "https://www.bonappetit.com/story/what-is-giardiniera", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "What Is Giardiniera, the Pickle-y Condiment We Put on Everything? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is Giardiniera, the Pickle-y Condiment We Put on Everything?No, it's not a made-up Italian-American pasta dish.By Alex DelanyJuly 2, 2019FacebookTwitterEmailFacebookTwitterEmailGiardiniera sounds kind of like a made-up dish that would be served at a nationwide chain of Italian-American restaurants. To the best of our knowledge, it is not. It is, however, a food with Italian roots that has been adapted by Americans. So, what is giardiniera? Let’s get into it.Short answer: Pickled vegetables. Slightly longer answer: There are two types of giardiniera. Italian giardiniera refers to vegetables pickled in vinegar and originated as a method for preserving the bounty of a big harvest. Chicago-style giardiniera is a medley of chopped vegetables—most commonly, cauliflower, carrots, bell peppers, celery, and chile peppers—joined together and preserved in a two-step process: First, they're pickled vinega and then they're marinated in olive oil. Chicago-style giardiniera, which likely has origins with the wave of  late 19th century Chicago, is most often eaten as a condiment (like on the classic Chicago sandwich, the Italian beef), whereas Italian-style is most commonly served straight-up as part of an antipasto platter.Photo by Chelsie CraigChicago-style is what you’ll see most commonly in the States, packaged in glass jars and possibly marked with a sticker depicting the face of Hall of Fame Chicago Bears coach Mike Ditka (if you’re lucky). Most brands that make giardiniera make a regular and a hot variety. The hot variety picks up a higher level of spice from added chile peppers.So, maybe you read those three paragraphs, left your computer, and bought some giardiniera. Welcome back to this article. The next logical question is what the hell do you do with it?Plain ol’ giardiniera is a world class condiment when used by itself. Anything you’d put a pickle on, you can put giardiniera on without a moment’s hesitation. Sandwiches. Burgers. Pizza. Tacos. Katsu. Literally whatever you want.But we like to take giardiniera one step further and make a condiment out of a condiment—condiment inception, if you will. Chopping giardiniera more finely and mixing it with mayo creates a creamy spread with major amounts of tang and, depending on the variety, heat. It transforms a sandwich in a very flavorful way.So whether you’re grabbing the regular or the hot, mixing it or eating it in its pure form, just know that giardiniera is a condiment and not a made up pasta dish with six kinds of cheese.And here's a sandwich to put it on:Big Ass Beach HoagieYour answer to the age-old question \"What can I make ahead of time and throw in my bag to feed myself (and, okay, my friends) when we finally make it to the beach/park/festival/fireworks?\"View RecipeExplore Bon AppétitBasicallyPickleVegetableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-02", "author": ["Condé Nast", "Alex Delany"]}