{"id": "bbe23b830768968e1e01b27e2d9cc4c4", "url": "https://www.bonappetit.com/story/kfar-philadelphia", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "KFar Philadelphia's Breakfast Sandwich Is the Only Reason I'm Up at 8 a.m. on a Saturday | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Breakfast Sandwich Is the Only Reason I’m Up at 8 a.m. on a SaturdayI will take the incredible egg and cheese at K’Far over an extra hour of sleep any day. By Elyse InamineJanuary 29, 2020FacebookTwitterEmailPhoto by Mike PersicoFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.I had every reason to sleep in that one Saturday a few months ago. The night before, my husband, some friends, and I drove from New York City to Philadelphia after a long day of work and dipped in for a late dinner at Pizzeria Beddia and went out for a drink after that. I’m too old for this! But that didn’t prevent me from waking up unreasonably early (okay, 8 a.m.) the next day, ditching everyone deep in their REM cycles, to book it for K’Far, a new-ish Israeli-inspired all-day café from the Zahav restaurant family.I was a woman on a mission, and that mission was shoving K’Far’s egg-and-cheese sandwich into my mouth. It’s a thing of textural beauty. The bun, a Jerusalem bagel, is cotton-y on the inside and crackled and pleasantly burnt on the outside, thanks to a vigorous smash in a panini press. Inside, I don’t know where the airy soft-scrambled egg begins and the melty Cooper Sharp cheddar (Philly’s answer to Kraft singles) ends: They fuse together into one jiggly, delicious breakfast unit so each bite is fatty and velvety. Between the bread and the egg-cheese stack is a slick of schug (a Yemeni condiment made with serranos, cilantro, coriander, and garlic) and za’atar, an homage to delis in Jerusalem that serve their giant bagels with a packet of the spice mixture for dipping. The double condiment is chef Camille Cogswell’s way of giving the sandwich “some pop.”She and her team tinkered with every little element of this breakfast sandwich—aerating the eggs then baking them to get that light texture, testing different cheeses, even making the bagel vegan because why not?! It all adds up to a breakfast that I can’t stop thinking about. But I guess I’m not the only one losing sleep over it: Cogswell typically makes about 75 in a given day, and they can sell out before 10 a.m. on weekends. Consider yourself warned!Go there: K’FarExplore Bon AppétitHighly RecommendRestaurantsPhiladelphiaRead MoreWhere to eatHow to Spend a Big Fat Weekend in Fishtown, PhiladelphiaGallery15 SlidesBy Alex DelanyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-29", "author": ["Condé Nast", "Elyse Inamine"]}