{"id": "bbed53ea468c87795aad29d2db361349", "url": "https://www.bonappetit.com/recipe/brothy-steamed-clams-with-corn", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Steamed Clams with Corn Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueBrothy Steamed Clams with CornBy Kelly MarianiJuly 9, 20195.0(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintIf some of the clams have opened when you lift the lid to stir them, pluck those clams out and transfer them to a bowl while the others finish cooking, then combine them at the end. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients4 servings¼cup extra-virgin olive oil, plus more for drizzling½fennel bulb, very thinly sliced1small leek, halved lengthwise, thinly slicedKosher salt1garlic clove, thinly sliced1cup fresh corn kernels (from about 1 ear)¼cup dry white wine36littleneck or Manila clams, scrubbed½cup finely chopped parsley2Tbsp. finely chopped chivesCrushed red pepper flakes and grilled or toasted bread (for serving)PreparationHeat ¼ cup oil in a medium Dutch oven or other heavy pot with a lid over medium-high. Add fennel and leek and season with salt. Cook, stirring often, until vegetables are starting to soften, about 3 minutes. Add garlic and corn and cook, stirring, until garlic is translucent, about 1 minute. Add ¼ cup water and simmer until corn is bright yellow and starting to soften, about 2 minutes. Add wine and simmer until slightly reduced, about 30 seconds. Add clams, cover pot, and reduce heat to medium. Cook, stirring occasionally, until clams open, 8–12 minutes. Discard any clams that have not opened. Top with parsley, chives, and a few pinches of red pepper flakes and drizzle with oil. Serve with grilled bread for soaking up pan sauces.How would you rate Brothy Steamed Clams with Corn?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is one of my favorites! Made it with pasta to serve more people. I've subbed fish for mussels. I'm growing bulb fennel this year so I can make this more, more, moreAnonymousNew Mexico5/6/2020One of those \"yeah, I'm making this again\" kind of recipes.yoshi998/27/2019Made this after seeing it in an issue. Amazing! I went a lot heavier on the herbs and got some toasted baguette to soak up all the clam juices. It was so easy to throw together. DarrahPState College, PA8/23/2019Explore Bon AppétitNew EnglandAmericanClamShellfishSeafoodCornVegetableSummerQuickEasyOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeNut-FreeHealthyishSteamDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}