{"id": "bbee975aad528078b7d19c9dfc8e4a09", "url": "https://www.bonappetit.com/story/roasted-aloo-gobi", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "The Sneaky, Easy Trick to My Mom’s Perfect Aloo Gobi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Sneaky, Easy Trick to My Mom’s Perfect Aloo GobiToo often aloo gobi is mushy or greasy. Here’s how to make crisp, crunchy, cumin-coated morsels of cauliflower and potato.By Priya KrishnaJune 10, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI’ve noticed that aloo gobi is the one Indian dish (aside from butter chicken and anything that’s labeled “tikka masala,” which...don’t get me started) that even people who don’t know much about Indian food have heard of.They’ve eaten it at an Indian restaurant, or at a wedding. It’s the dish in the seminal romantic comedy Bend it Like Beckham that Jasminder’s mother wants her to learn to make instead of playing soccer (they’re not mutually exclusive activities, Aunty!!).But from my experience, aloo gobi, which is potatoes (aloo) and cauliflower (gobi) sautéed in onions, turmeric, and a few other spices, can be a soggy, bland letdown.Where things go wrong is in the preparation of the vegetables. There are two traditional ways of making aloo gobi: deep fry the potatoes and cauliflower before sautéing them in the seasonings, which often yields a greasy mess. Or sauté everything in one pan, which can result in mush.But as she always does, my mom came up with a method that solves these mushy, greasy problems: ROASTING.Priya makes aloo gobi.\nShe roasts the cauliflower florets and sliced potatoes in a 425 degree oven for about 30 minutes, tossing halfway through. You’re looking for them to crisp up and char at the edges, so they won’t get soggy once they hit the pan. Because you’ve pre-roasted the cauliflower and potatoes, all you need to do now is quickly toss them with the spices. (Important: Don’t forget about the charred, burn-y bits in the pan! Those are the best!). The mush and grease problems are solved. You’re left with crisp, crunchy, cumin-coated morsels that dazzle with brightness and are also hearty and nourishing. Salt, lime juice, and chopped cilantro finish it off.The other trick to my mom’s aloo gobi is the whole cumin seeds. Perhaps you are nervous about cooking with whole spices, and are used to seeing cumin in its ground form. Let me tell you a few things about cumin seeds! They: (1) are less work, because you don’t have to grind anything, (2) are more aromatic than the pre-ground stuff, which has probably been sitting on a shelf for a while (3) have a smokier, more complex flavor than ground cumin and (4) add crunch and interest to a dish that might otherwise feel too homogeneous.And if you love a good make-ahead, my mom’s move is to pre-roast the potatoes and cauliflower and then pop them in the fridge until she’s ready to cook. Then, just toss the veggies in the pan with the seasonings, and the dish is ready in 15 minutes.When done right, roasted aloo gobi is straightforward to make but hard to forget: the potatoes and the cauliflower are slightly soft, with this beautiful salt and spice crust. You can taste the inherent flavor of the vegetables, accented by acid and char. Every bite is a little different—you might get a tater tot-like potato piece in one, a lime-soaked piece of ginger in another.Aloo gobi is the embodiment of what makes Indian home cooking so special to me. It’s the idea that with a short amount of time and a few spices, anyone can make a dish that tastes this complex.Get the recipe:Roasted Aloo Gobi (Potatoes and Cauliflower)This classic (and familiar) potato-and-cauliflower dish is a great make-ahead party dish.View RecipePriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, is now out from Houghton Mifflin Harcourt! Follow her on Instagram @PKgourmet.Explore Bon AppétitIndianishVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-10", "author": ["Condé Nast", "Priya Krishna"]}