{"id": "bbf94d30c38a5ed10d0d94dc84e4e720", "url": "https://www.bonappetit.com/recipe/turkey-meatballs-with-romesco-sauce", "year": 2021.0, "month": 2.0, "day": 2.0, "content": "Turkey Meatballs With Romesco Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2021 IssueTurkey Meatballs With Romesco SauceBy Sara FrostFebruary 9, 20214.2(67)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'Myrtrek BrownEmailPinterestPrintEmailPinterestPrintThese are true weeknight meatballs: You pan-sear them in a skillet to develop a golden-brown crust, then pop them in the oven to finish cooking for the final few minutes. Once they’re in the oven, blitz together a quick romesco sauce made from toasted almonds and roasted red peppers for dinner in half an hour. The versatile, nutty sauce adds rich flavor to other lean proteins like fish or pan-roasted chicken breasts and also makes a great dip for raw veg. (For a gluten-free dish, simply leave out the panko.)Ingredients4 servings1lb. ground turkey1large egg, beaten to blend⅓cup panko1tsp. ground cumin1tsp. onion powder1tsp. paprika¼cup finely chopped parsley, plus more coarsely chopped for serving¾tsp. kosher salt, plus more2Tbsp. plus ½ cup olive oil½cup toasted almonds116-oz. jar fire-roasted peppers in water, drained2small garlic cloves, crushed1Tbsp. red wine vinegar¼tsp. cayenne pepper½lemonPreparationStep 1Preheat oven to 425°. Using your hands, mix ground turkey, egg, panko, cumin, onion powder, paprika, ¼ cup parsley, and ¾ tsp. salt in a large bowl. Working one at a time, scoop out small amounts of mixture and roll into 1½\"-diameter balls (you should have 18–20 meatballs).Step 2Heat 2 Tbsp. oil in a large ovenproof skillet over medium. Wo rking in batches, cook meatballs until golden brown all over, about 2 minutes per side. Transfer skillet with meatballs to oven and bake until cooked through, 5–7 minutes.Step 3While the meatballs are baking, pulse almonds in a food processor until coarsely ground. Transfer to a medium bowl. Pulse fire-roasted peppers, garlic, vinegar, and cayenne in food processor until almost smooth. Transfer to bowl with almonds and stir in remaining ½ cup oil; season romesco sauce with salt.Step 4Spoon romesco sauce into shallow bowls and arrange meatballs on top. Finely grate lemon zest over and scatter coarsely chopped parsley on top.How would you rate Turkey Meatballs With Romesco Sauce?Leave a ReviewTell us what you thinkReviews (17)Back to TopTriangleThese look wonderful but am allergic to nuts.  What is a good substitution in this recipe or can you recommend another sauce that will work..thank youAnonymousArkansas2/2/2022I have made this several times, and everyone likes it. It’s different enough to stand out and impress, but still looks familiar. When mixing the peppers and pulsed almonds, I took a little bit of both in a bowl and mixed, then added about half of the peppers so they would combine more easily - I had no problem with the texture of the almonds doing this. I also warmed the sauce in a saucepan before serving. 10/10AnonymousLondon, UK5/6/2021This has become one of my favorites. Very easy but really love the flavor. Some tweaks I've found that make it better: aim for a size that gives you 8-10 meatballs, go finer on the ground almonds, add lemon juice to sauce, and whisky in olive oil to sauce slowly until you get the consistency you want (as others have stated the called for amount is too much for me)AnonymousAtlanta, GA5/2/2021This was good at first, but even better on day 3.  I agree with one of the reviewers below that there is too much olive oil in the Romanesco sauce - would cut it to 1/4 cup next time..  Also, I didn't really care for the texture of the coarsely ground almonds and would grind them finer next time. That being said, I would make this again.AnonymousVienna, VA4/27/2021I’m disappointed that after reading the reviews my husband and I both said “It’s OK. Not bad but don’t need to make it again.” Nothing objectionable but not great. Tried to give it 3 ⭐️ but it insists on making me game give it 5. Editorjane Atlanta4/11/2021Loved this! It's so simple that it's easy to make modifications if you want/need to, and you pretty much can't mess it up. I followed the recipe (almost) exactly, and it only took 25 minutes start to finish and the cleanup was simple. \nI added a preserved lemon to the romesco and it was *chef's kiss*. If you have them use them! izaPortland, OR3/26/2021This Romesco sauce is mighty fine.  I would have preferred it warmed over the meatballs, but my guy likes foods of differing temperatures on the same plate, so for him this room temp sauce was perfect!  Chalking it up to a cook's error, but I found the meatballs to be slightly bland.  Next time I'd add a touch more salt and seasoning.  also, the store only had extra-lean ground turkey, so next time I'd source a higher fat content, or find a way to add some fat into the grind.  \nWe served the meatballs and romseco over roasted cauliflower steaks.  Delicious!  \n\nI can see this Romesco sauce being used as a dip, watered down with some stock and turned into a soup, warmed and served over pasta, drizzled over crostini and soft cheese, added to a casserole...  Just really lovely flavor.  Thanks, BA!Spatula City 123Los Angeles, CA3/26/2021This recipe is excellent!  I followed it exactly.  I don't know how a recipe can be reviewed accurately if it is not followed.  I got 24 meatballs out of mine.  Yes, the romesco sauce is meant to be room temperature, and is the bomb!  The meatballs tasted similar to Mexican chorizo to me and were a definite winner.  I served this meal with roasted green beans and it was perfect.  I can't wait to make this recipe again and would love to turn this into a meatball sandwich at some point as well.  AnonymousNY3/17/2021Every so often I make a recipe because it is just so unusual and I cannot get my head wrapped around the flavor mix.  This was one of those times and I love the results.  I used what I had on hand so I substituted ground chicken.  I am not a fan of cumin so I used a curry powder that had a tiny bit of cumin.  The results were amazing!  I will definitely use this sauce with other meats and veggies.  It was so easy to make that I could easily do this for family events with a dozen people.\nJamileAtlanta3/15/2021My husband loved this recipe so much that next time he was at the store, he bought a two-pound bottle of roasted red peppers so that I could make this recipe again and double the sauce.  I made this once following the recipe exactly and a second time with a couple of changes.  For the meatballs, I doubled the spices.  For the Romesco sauce, I added one-half teaspoon of smoked paprika (actually since I was doubling the sauce, I added a full teaspoon).  I'm not sure if the sauce is supposed to be served hot or room temperature, but I warmed it up. MaryDeeLaguna Hills, CA3/9/2021This was great, and so easy! A few mods: I used pork instead of turkey and didn’t have paprika so I used cayenne in the meatballs in place of that. For the sauce I used half the amount of olive oil, and I think I could probably use a tad less next time. I also cooked the meatballs in my airfryer (first time for me!) and they turned out fantastic! Topped with some parm, arugula, and pepper. Perfect chill weekend meal! Will add to my rotation if BA recipes :) AlexandraVancouver, BC 2/28/2021I made this as written and thought the cumin was a bit overpowering. Also, I'd use less olive oil in the romesco sauce.CeoraAnnapolis MD2/25/2021I enjoyed this recipe. You can’t get much simpler than this sauce. I poured the sauce over the meatballs and heated to serve. Served over risotto and it felt comforting and hearty, even though it is pretty healthy and light. \nI didn’t brown the meatballs in a pan, just roasted them in a hot oven and hit them with a broiler at the end. Katie2/23/2021Wonderful recipe. Followed Bendway’s modifications. Served over Gnocchi. *chef’s kiss*slaughterwaterSan Diego, CA2/22/2021This recipe was excellent but I modified it slightly.  Did the meatballs as directed but substituted ground chicken and made them larger (I had eight to a pound).  Browned them in a cast iron pan, which then went into the oven.  Made the sauce as directed but added about 2 tablespoons of heavy cream to lighten it (mine was much darker red than in the photo) and add richness.  When the meatballs came out of the oven I poured the Romescu sauce over them and brought to a simmer for a few minutes. Grated lemon zest over them at finish. Served with some rigatoni.  bendwaychampaign, IL2/21/2021Explore Bon AppétitMeatballBell PepperVegetableAlmondNutGround TurkeyTurkeyPoultryQuickEasyWeeknight MealsMainGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-02-05", "author": ["Condé Nast", "Sara Frost"]}