{"id": "bc1118f37a654bbe7e5e48fbdf5cbe8f", "url": "https://www.bonappetit.com/story/shrimp-ceviche", "year": 2020.0, "month": 8.0, "day": 1.0, "content": "How to Make Shrimp Ceviche With Frozen Shrimp | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Mom Was Wrong About the Secret to CevicheNo offense, Mom!By Patricia AzzeAugust 5, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My whole life, my mom told me that the secret to good ceviche is Panamanian corvina. Our summer trips to the isthmus that links the Atlantic and the Pacific were guised as family trips, but they were really ceviche-eating expeditions. We ate it back home in Miami, too. A standard appetizer at restaurants around here, it also pops up at family parties, ordered in large heavy-duty foil trays to feed a crowd and served with saltine crackers, the Panamanian way. At the fast-casual ceviche place less than a mile from my house, my order strayed from the flaky white flesh of the corvina into shrimp, octopus, or generic “fish.” No matter how often I ate ceviche, I never ever dared to make it at home. Without the corvina, I figured, why bother? The always-evolving ceviche at Lil Deb's Oasis is made with shrimp, snapper, watermelon, and red onion.\nPhoto by Heidi's BridgeBut then, on a Saturday in the midst of my quarantine hunker down, I was hit with a hankering for the acidic fish salad. Ceviche is the rare comfort food that’s both delicious and healthy (well, except that I wanted it paired with french fries, a nostalgic nod to the Panamanian beach resorts we used to visit). Ceviche was all I could think about but corvina I did not have, and a trip to the grocery store wasn’t in the cards.Determined to make something work with what I had available, I pulled a bag of large peeled and deveined shrimp from my freezer and set them aside to defrost in a bowl of cold water. After all, I like plenty of ceviche—all ceviche, really. Using frozen shrimp isn’t ideal—in the perfect world, I would shop for a fresh flaky white fish like yellowtail, grouper, fluke, flounder, hogfish, corvina, or fresh Key West shrimp. But I was making do with what I had, and most shrimp from the grocery store would have been frozen at some point anyway, I rationalized. What makes a ceviche a ceviche is the way the fish is cooked, or—to be more accurate—the way it isn’t cooked. The fish, or shrimp, is doused in lime juice and left to “cook” in the acid, a process called denaturation. I’d been needlessly weary of trying it at home, but it requires almost no work.Hold your skepticism!\nPhoto by Chelsie Craig, Food Styling by Pearl JonesI took the tails off the now-thawed shrimp and chopped them into quarters, big enough pieces for meaty bites but small enough that the lime would cook it fairly fast. I put it in a small bowl and squeezed all of the limes I had over top (I used four, but if you don’t have enough to cover the seafood, you can come back every ten minutes or so and give it a stir). Then, I covered the bowl with plastic wrap and left it in the fridge to “cook.” When the shrimp had turned from raw and grey to cooked and pink (this took about 45 minutes, but I recommend you check early), I mixed in red onion and a spicy pepper fresh from my backyard garden (a jalapeño would work just fine), both chopped small, and cilantro, left chunky and leafy. My plan was to keep it simple, the way it’s prepared in Panama, but then I went kind of rogue and added a few chopped hearts of palm from a can I found in my pantry to bulk it up a bit. Peruvians eat ceviche with corn and sweet potato on the side, and I’ve seen tomato, avocado, and mango mixed in before, so I thought I could take some liberties—and you can too. Toss it together and give it a gentle stir and then add salt to taste. I served it in a fancy cocktail coup, because I’m trying to find ways to entertain myself in isolation, but any bowl will do. Be sure you keep the juices in there—getting the lime and fish in each bite is essential.Suffice it to say, the ceviche did not suffer without the Panamanian corvina as the key ingredient—the impromptu frozen shrimp worked out great. (If you’re going to do the same, be sure to go for the best quality and biggest shrimp that you can find, and chop it uniformly so that it cooks evenly.) I went all in and served it with french fries, but the most typical accompaniment in Panama are some good old, reliable saltine crackers. It’s also great with plantain chips—their long thin shape is a perfect vehicle for scooping fish and juice. To turn it into a main, serve it over coconut rice or a bed of greens, even wrap it up in a burrito. Once you’ve got seafood cooked in lime juice, you’ve got a ceviche. Make it your own from there—despite what my mom would tell you, there’s really no secret. Patricia Azze is a freelance writer and social media strategist in Miami.Explore Bon AppétitIt's That SimpleShrimpSeafoodSummerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-05", "author": ["Condé Nast", "Patricia Azze"]}