{"id": "bc1a0e17f3e00e785ce5c17193f89be9", "url": "https://www.bonappetit.com/recipe/pantry-pasta-with-vegan-cream-sauce", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Pantry Pasta With Vegan Cream Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesPantry Pasta With Vegan Cream SauceBy Sarah JampelNovember 12, 20214.2(127)Read ReviewsTriangleEmailPinterestPrintPhoto by Laura Murray, Food Styling by Kat BoytsovaEmailPinterestPrintEmailPinterestPrintMany vegan cream sauces rely on blended nuts or steamed cauliflower, but this sauce is made of beans and pasta water alone—no soaking or blending necessary. It’s important that the beans are adequately hydrated: Once you start mashing, make sure there’s plenty of pasta cooking liquid in the pot and don’t let it evaporate.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonSpider$6 At AmazonMicroplane$16 At AmazonWooden Spoon$6 At AmazonIngredients4 servings½cup plus 2 Tbsp. extra-virgin olive oil, divided, plus more for drizzling1cup walnuts, finely chopped½tsp. crushed red pepper flakes5garlic cloves, 1 whole, 4 thinly sliced2sprigs rosemary215.5-oz. cans cannellini (white kidney) beans, rinsed12oz. paccheri, rigatoni, or other large tubular pastaKosher salt1lemon2Tbsp. finely chopped parsleyFreshly ground black pepperPreparationStep 1Heat ¼ cup oil in a large Dutch oven or other heavy pot over medium. Add walnuts and red pepper flakes and cook, stirring often, until nuts are deeply golden, about 5 minutes. Transfer to a small bowl and grate in whole garlic clove; set aside.Step 2Wipe out pot. Combine ¼ cup oil and remaining sliced garlic in pot and cook over medium-low heat, stirring occasionally, until oil around garlic is bubbling vigorously and garlic is beginning to brown, about 5 minutes. Firmly crush rosemary in your hand to bruise; add to pot along with beans and stir to coat. Increase heat to medium and cook, stirring occasionally, until beans are just beginning to take on color, about 3 minutes.Step 3Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.Step 4When pasta is about 4 minutes away from being done, transfer 1 cup pasta cooking liquid to pot with beans (make sure to keep heat on medium so that the liquid doesn’t evaporate too quickly). Using a wooden spoon, gently mash about three-quarters of beans into a creamy sauce.Step 5Using a spider or slotted spoon, transfer pasta to pot with beans and add 1 cup pasta cooking liquid and 2 Tbsp. oil; mix well to combine. Increase heat to medium-high, bring to a simmer, and cook, stirring gently with a heatproof rubber spatula, until sauce coats pasta, about 2 minutes. (Sauce might look soupy but will thicken as it sits so don’t worry!) Finely grate in about one-quarter of zest from lemon, then cut lemon in half. Squeeze in juice from 1 lemon half and add parsley; mix well to combine.Step 6Divide pasta among bowls. Drizzle with oil, season with black pepper, and top with reserved nut mixture. Slice remaining lemon half into wedges and serve alongside for squeezing over.How would you rate Pantry Pasta With Vegan Cream Sauce?Leave a ReviewTell us what you thinkReviews (72)Back to TopTriangleBland and boring. No one in my family of five enjoyed it - including my vegetarian. I am unafraid of salt  but even salt couldn’t save this.  The remains remain in a container in my fridge. Think I’ll toss them today. AnonymousNYC2/4/2022This is now one of my favorite pasta recipes and will be a go-to!  The flavor is wonderful, making you want to eat more and more.  I'm also thankful for the large amount of garlic, helping ward of the ills of winter.\n\nI needed to swap the parsley for cilantro -- worked perfectly.  Also used gluten free penne -- be mindful of the cooking time as al dente is harder to achieve with gluten free blends.KimSeattle, WA1/17/2022honestly not very good! tasted like pasta & beans. not much flavor — added much more salt, heat, lemon, parm, and nutritional yeast to beef up the flavor. don’t waste your time mashing the beans — better to purée the beans in a food processor beforehand and make the sauce that way. disappointing ! anna s broooklyn, ny1/17/2022My husband and I love this recipe and make it probably once a week. The creamy sauce and earthy walnuts are a divine duo. You can play around with the sauce too, by adding hot pasta water, olive oil and lemon juice to make a velvety sauce. We like this recipe best when we...\n-use really nice olive oil\n-smash the beans and rosemary springs really well.\n-season with salt and fresh ground pepper along the way\n-use extra large rigatoni (and add it to the bean mixture with a full 4 minutes left until al dente)\n-add a good bit of extra pasta water while the pasta is cooking and the sauce is thickening up.\n-use extra lemon zest, maybe microplane a clove of garlic in at the end, and add a good handful of chopped flat-leafed parsley. \nTopped with those walnuts...it's really something else. (There isn't any reason to use so much oil to prepare the walnuts, a little will do.)\nThanks for a great recipe! \nKarenMN1/3/2022This was awful!! I added a extra cup of pasta water and it was dry and did not have good flavor.  AnonymousSeattle wa12/18/2021so i read the reviews and decided to give this recipe a try anyway, expecting it to be better than the negative reviews advertised. it wasn't bad but it wasn't as delicious as other pasta recipes by BA. it was tasilty bland...an interesting territory. since it lacked flavor, i ended up adding some nutmeg, cinnamon, and more salt than the recipe called for. once plated, i squirted on some balsamic glaze to give it a flavor boost. again, it ended up being pretty good, i got some compliments on it but overall the consensus was: good but bland.AshChicago, IL11/14/2021This is an excellent recipe. I made it with fresh bean from my garden  (shelled beans) - but otherwise followed the recipe faithfully. It is very good.Sheila HendersonNova Scotia10/11/2021Really nice dish, the toasted walnut topping adds a lot of flavor. You can absolutely make it with homemade (non-canned) beans if you want. The second time I made it I topped with some diced preserved lemon for a little extra kick.Cathy ZBoston, MA6/22/2021ONE STAR.  The program automatically changed my rating.   Recipe calls for canned beans, which are mushy, salty, and taste of chemicals.  Disgusting.  It is not hard to soak beans overnight, change the water, and boil.One StarManhattan4/22/2021I made this twice, and it still wasn't great. The walnuts and lemon are excellent, but definitely essential to enjoy this, as well as heavily salted pasta like others note. Blending the beans, all of them, made it immensely better the second time, but it still tasted pretty bland, and I'd even upped the garlic and added shallot. Maybe I am learning I hate white beans? Or maybe (most likely) this is way better with presoaked beans, rather than canned ones, but I want this to be a spontaneous weeknight option. HannahSeattle, WA3/12/2021This dish is de-friggin-lightful. I made it for the first time after hearing Sarah Jampel discuss it on the podcast about a year ago. I cannot recommend this dish highly enough. My sweetheart is a meat and potatoes man; he previously thought “vegan” was a euphemism for “tofu scramble,” but he requests 2nd and 3rd helpings of this pasta every time. The texture of the sauce is certainly creamy (if you are finding it pasty, add more pasta water), and the walnuts are the most hard-working topping, providing crunch and so much more dimension to the overall flavor profile. The only alteration I make to this recipe is that instead of slicing the garlic, I chop it up more finely because we like the garlic to be more fully immersed in the sauce rather than getting a big slice at a time. Do note that because the garlic is more fine, it browns more quickly (2-3 min rather than 5).Perry the PyreneesPortland, ME2/1/2021Oh boy this is not a pretty dish, gray upon gray. It tasted fine but  I don’t think I’ll make it again. Amanda StringerDundas ON1/20/2021I read the other comments and fearlessly added a bit less than a quarter cup of kosher salt to the pasta water.  I was worried it would be too salty but it wasn't.  Just right, and everyone loved the walnut topping.  A keeper!  I wish the recipe had advised me earlier that I would need to zest a lemon and juice it as well.  I like to have everything done going into cooking.  Also,  I didn't really know what to do with the rosemary sprigs.  I put them in as the recipe suggests but it never seems to mention them again, or whether they need to be removed.  The bright green of the rosemary became dull and unappetizing looking eventually  so I took it out as best I could before serving.  I also used a full pound of pasta and it seemed fine.  AnonymousNaples, FL1/20/2021It was definitely way too bland and i should have read the comments before hand.... needs a TON OF SALT and i think using just one jar of beans is way more than enough. JennyNYC1/12/2021This is a delicious, flavorful and filling pasta dish.Vegan pasta, flavorful and delicious King of Prussia, Pa1/3/2021Explore Bon AppétitPastaWalnutNutRigatoniPasta & NoodlesCannellini BeanWhite BeanBeanVegetableMainDairy-FreeVeganVegetarianHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-24", "author": ["Condé Nast", "Sarah Jampel"]}