{"id": "bc241d7ada480700bca160bf93239e06", "url": "https://www.bonappetit.com/recipe/clams-arrabbiata", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Clams Arrabbiata Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueClams ArrabbiataBy Chris MoroccoFebruary 11, 20204.8(16)Read ReviewsTriangleEmailPinterestPrintPhoto by David Malosh, food styling by Rebecca Jurkevich, prop styling by Cindy DiprimaEmailPinterestPrintEmailPinterestPrintTaking the time to cook out and concentrate each wave of ingredients (slowly rendering the pancetta, gently toasting the garlic, and letting the tomatoes get concentrated and jammy) puts three pots’ worth of flavor in one.Ingredients4 servings3Tbsp. extra-virgin olive oil2oz. thinly sliced pancetta (Italian bacon), chopped1medium onion, finely chopped4garlic cloves, thinly sliced¾tsp. crushed red pepper flakes128-oz. can whole peeled tomatoes24littleneck clams, scrubbed4oz. ditalini (about 1 cup)Handful of torn basil leavesCountry-style bread (for serving)PreparationStep 1Cook oil and pancetta in a medium Dutch oven over medium heat, stirring occasionally, until pancetta begins to crisp, about 5 minutes. Add onion and cook, stirring occasionally, until softened but not browned, 6–8 minutes. Add garlic and cook, stirring occasionally, until softened and fragrant, about 5 minutes. Stir in red pepper flakes.Step 2Add tomatoes, crushing with your hands as you go; increase heat to medium-high. Bring to a simmer and cook, stirring often, until tomato liquid is reduced by half and tomatoes take on a jammy consistency, 12–15 minutes. Add clams and 2 cups water. Cover pot and cook, stirring occasionally and reducing heat as needed to maintain a simmer, until clams begin to open, 8–10 minutes. Uncover pot and transfer opened clams with a slotted spoon to a plate. Re-cover pot and continue cooking clams until they open, up to 15 minutes longer; discard any clams that haven’t opened by this time.Step 3Add ditalini to pot and cook, stirring often (pasta will want to settle and stick to the bottom of the pot), until al dente, 8–10 minutes. Add clams back to pot.Step 4Ladle clams and sauce among bowls; top with basil. Serve with bread alongside for dipping.How would you rate Clams Arrabbiata?Leave a ReviewTell us what you thinkReviews (7)Back to TopTriangleEasy and delicious.  I’ve accidentally left the eye on after we served the meal.  We ended up preferring the excess that had cooked 10 minutes longer.  It’s a great recipe and I’m sure I’ll make it again.  Personally, I prefer clams in a white sauce, but my husband thought this was the best ever.  The fresh basil garnish is an absolute must.AnonymousChattanooga TN7/19/2021I have come back to this time and time again - just so delicious. SamanthaSan Francisco3/1/2021Amazingly simply dish with lots of great flavor! Lisa M. Providence, RI2/2/2021Made this last night for our NYE dinner and it was delicious! I was worried that it wouldn’t be salty enough since there’s no salt but the bacon (sub for pancetta) flavored it perfectly. I could have licked my bowl clean and saved myself the dish washing. That’s how good it was!VannyCalifornia1/1/2021F me, this was so good. This was so easy and tasted amazing! Thanks Chris!!AnonymousVancouver5/11/2020This was one of the most memorable meals I've made in a while. Seriously, so delicious. Serve with a red wine and Dean Martin for the ultimate red sauce vibes. Can't wait to make it again!alizaraeNew York4/23/2020Thank you, Chris Morocco! This is unquestionably the most delicious seafood pasta dish I’ve ever cooked and among the very best I’ve ever eaten. I didn’t have pancetta, so we used bacon, but I’m sure it didn’t hurt that the clams were dug on Sunday morning. nschmiBoothbay Harbor, ME4/15/2020Explore Bon AppétitStewSoups and StewsItalianEuropeanClamShellfishSeafoodPancettaCured MeatMeatCanned TomatoTomatoVegetableOne-Pot MealsMainDairy-FreeNut-FreeHealthyishSimmerDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-11", "author": ["Condé Nast", "Chris Morocco"]}