{"id": "bc2b30a6f5785fb03ca8e2672caa2fc8", "url": "https://www.bonappetit.com/story/time-for-chile-lime-clams", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "A Dish Your Guests Will Love...and a Backup Just in Case | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Dish Your Guests Will Love...and a Backup Just in CaseChile lime clams and a back-pocket pasta.By Dawn DavisJune 17, 2021FacebookTwitterEmailPeden + MunkFacebookTwitterEmailWelcome to You’ve Got Time for This, a column where Bon Appétit’s editor in chief Dawn Davis highlights recipes from our archives that are delicious and accessible, and work every time.I’m here to rhapsodize about a dish from the BA archives that offers a big payoff with minimal effort, but first let me tell you about a dinner that party went awry.When my friend Greg graduated from law school, a celebration was in order. I turned to Second Helpings from the Union Square Cafe because the main courses are consistently delicious and foolproof, though admittedly a bit involved. I selected the Indian “bouillabaisse,” monkfish and shellfish cooked in a fragrant broth accented with cardamom, coriander seeds, and fenugreek that have been bloomed in mustard oil. For a starter, I served a hearty lentil and celery salad, which I figured could double as a main, should a dinner guest be allergic to shellfish. What could go wrong?Plenty. One of Greg’s friends, let’s call her Madeleine, was allergic not only to shellfish but also to lentils. As far as dinner parties go, it was an embarrassing bust. Back then, I didn’t know how to pivot, so it fell to Madeleine to save the day. Unfailingly polite, she pretended she’d eaten a late lunch. I could hear her stomach growling with hunger.Since that day, I always ask if anyone has any allergies, and I always have a backup plan, one I had to use this weekend.On Friday, I hosted a dinner party and chose a different recipe starring shellfish: Chris Morocco’s Chile-Lime Clams with Tomato and Grilled Bread. This dish is over-the-top delicious, enhanced by restaurant-level amounts of butter and sambal oelek, a chili paste that lends flavor but not, in this instance, lots of heat. With autumnal hues, this dish is gorgeous, especially with a smattering of red onions (which I used in addition to the shallots the recipe calls for) and multicolored cherry tomatoes. The skillet goes right on the direct heat of a grill, though you can use your stovetop instead. Everyone loved it so much, we jockeyed to get the little bit left in the skillet. (If you like clams, I strongly recommend it.)I noticed, however, one friend was eating around the clams, choosing instead the garbanzo beans, the jammy, caramelized onions, and the grilled bread. I’d asked beforehand; she wasn’t allergic to shellfish. So what was the problem? Cilantro, with which the dish is finished.  This time, instead of panicking, I turned to my go to: Fridge-Dive Pesto Pasta. It’s great for a spontaneous plan B because, as the name implies, you can make it with “any leftover hardy green, lettuce, or herb you don’t know what to do with.” I had fresh arugula and basil and some wilting escarole and parsley on hand, though I suspect it hardly matters because it’s the sesame seeds, which I toasted in the skillet while the greens were boiling, and the ricotta salata that make it memorable. (Ricotta may not be a pantry item, but it lasts awhile, so good to have on hand.) Twenty minutes later, the pasta was done and, this time, no one left hungry. So if a surprise allergy or aversion pops up, don’t panic, open another bottle of wine, and get your water boiling. Get the Recipes:Chile-Lime Clams with Tomatoes and Grilled BreadSure you can cook clams right on the grill grate, but getting a skillet involved means capturing all of their delicious briny juices.View RecipeFridge-Dive Pesto PastaThis pesto pasta recipe is the solution for any leftover hardy green, lettuce, or herb you don’t know what to do with. Cleaning out your fridge has never been so rewarding!View RecipeExplore Bon AppétitYou’ve Got Time for ThisSummerRead MorecookingYou’ve Got Time For ThisBy Dawn DavisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-17", "author": ["Condé Nast", "Dawn Davis"]}