{"id": "bc340978d12af06062b5193e01dd79e1", "url": "https://www.bonappetit.com/story/how-to-cool-down-leftovers-fast", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "How to Cool Down Leftovers, Fast | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Fast Way to Cool Down LeftoversConsider it the reverse ice bath.By Amiel StanekOctober 28, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailWhen I worked in restaurant kitchens, cooling down leftovers was serious business. The importance of getting big batches of cooked food—think giant pots of stocks, sauces, and stews—out of what’s known as the “danger zone” (40°–140°) as quickly as possible before getting it into the refrigerator was drilled into every cook on the line. This was a matter of food safety, enforced by the ever-present fear of a surprise health inspection; if the inspector showed up and dipped their dreaded thermometer into a container of 90° beans in the walk-in, your day was about to get a whole lot worse.For home cooks, who are usually cooking in much smaller quantities that cool down much more quickly, this isn’t as big of a concern. The FDA recommends putting most leftovers in the fridge as soon as possible, and definitely within two hours, rather than waiting for them to reach room temp. That said, there are still times when I find myself staring down a stockpot of broth or a hulking Dutch oven of chili and I want to cool it down rapidly to avoid getting burned and/or raising the temperature of everything else in my fridge. In these cases I use a handy tool I learned about in restaurants years ago: an ice paddle.Ice paddles are commonplace in professional kitchens and are essentially little more than giant refillable tubes made from food-grade plastic. They get filled with water, capped, and frozen, and then can be placed in a vessel of hot food to speed up the cooling-down process. (You can also wield them like frosty medieval weapons if you want, but that’s a different story.)At home I obviously don’t have a need for something quite so large, but I can accomplish the same thing with clean quart containers I’ve filled with water and frozen. I try to keep a few of these bad boys stashed in the freezer so that they’re always ready to go, and then all I have to do is plop one directly into a big pot of soup and stir it around occasionally while I tidy up the kitchen. After 45 minutes or so the food in question is no longer piping hot and I can let the fridge do the rest of the work.And while this use-case might seem a bit rare, I find that having quart-size blocks of ice in the fridge can be useful in other ways too. I basically always forget to make simple syrup until I’m jonesing for a cocktail, so I often use one of these DIY ice paddles to cool it down rapidly before adding it to a batch of margaritas. (Yes, I could use an ice bath—but then I’d be wasting all of those precious cubes I need for the drinks.) I’ve also used them when I’ve made a batch of punch or large-format cocktail and forgotten to make an ice mold—just warm the quart container under some hot water until the chunk of ice releases and drop that ’berg right into your Big Drink. And they’re always ready to function as an ice pack for a small cooler or to soothe a pesky bug bite, burn, or minor sprain.See for yourself: Stash an ice paddle or two in your freezer and you’ll be surprised how often they come in handy.Explore Bon AppétitcookingLeftoversRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-28", "author": ["Condé Nast", "Amiel Stanek"]}