{"id": "bc563e0514df3a2b402a27ef0be7cf88", "url": "https://www.bonappetit.com/recipe/salted-strawberry-daiquiri", "year": 2021.0, "month": 7.0, "day": 1.0, "content": "Salted Strawberry Daiquiri Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2021 IssueSalted Strawberry DaiquiriBy Nahiel NazzalJuly 6, 20214.5(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintSalt: it’s what your cocktail has been missing. “Salt in drinks is underrated,” says Nahiel Nazzal, bar director and partner of San Francisco’s Pearl 6101. “It adds balance, opens your palate, and makes you want to take another sip.” Nazzal loves stirring a pinch into classics like Negronis as well as drinks with fruitier notes, like this strawberry daiquiri, which relies on an easy berry-infused simple syrup and just a sprinkle of salt. You won’t even know the salt’s there—but you’ll be glad to have it.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Shaker$20 At AmazonHawthorne Strainer$7 At AmazonMesh Sieve$13 At AmazonCitrus Juicer$7 At AmazonIngredientsSyrup8oz. strawberries, hulled, halved, quartered if large1cup sugarAssembly1½oz. white rum½oz. Aperitivo Cappelletti¾oz. fresh lime juiceKosher saltStrawberry, hulled (for serving)PreparationSyrupStep 1Bring strawberries and 2 cups water to a simmer in a large saucepan over medium-high heat. Reduce heat, cover partially, and simmer gently, swirling occasionally, until strawberries are softened and have lost most of their color, 15–20 minutes.Step 2Strain into a small saucepan, pressing on berries to extract as much liquid as possible; reserve berries for another use. (You should have about 1 cup liquid.) Add sugar to liquid in saucepan and return to a simmer. Remove from heat and stir until sugar is dissolved. Let cool, then cover and chill until cold, at least 1 hour.Do ahead: Syrup can be made 2 weeks ahead. Keep chilled.AssemblyStep 3To make 1 cocktail, combine rum, Cappelletti, lime juice, ½ oz. strawberry syrup, and a small pinch of salt in a cocktail shaker. Add 4–6 ice cubes, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds. Double-strain into a coupe glass. Garnish with a strawberry.How would you rate Salted Strawberry Daiquiri?Leave a ReviewTell us what you thinkExplore Bon AppétitCocktailDrinks AllStrawberryBerryFruitRumAlcohol & Other DrinksLimeCitrusSummerDrinksSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-06", "author": ["Condé Nast", "Nahiel Nazzal"]}