{"id": "bc566ef7a27559749f046d5b7a37b1b9", "url": "https://www.bonappetit.com/recipe/herbal-mushroom-broth", "year": 2022.0, "month": 2.0, "day": 2.0, "content": "Herbal Mushroom Hot Pot Broth Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2022 IssueHerbal Mushroom Hot Pot BrothBy Eric SzeFebruary 8, 20225.0(6)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThis comforting hot pot base gets plenty of umami from mushrooms and alliums, which means there’s no need for meat. Chef Eric Sze of New York City’s 886 and wenwen likes pairing a mild, refreshing broth like this one with a spicier broth in a divided pot because switching between the two “makes your palate dance,” Sze explains. If you want to spice up this broth, however, you can add 4 Tbsp. Pixian chili bean paste and 15 dried chao tian jiao (or dried chiles de árbol) and cook for 2 minutes before adding the onions. Even if you aren’t making hot pot, you can use this broth as a flavorful (and vegan!) base for stews, soups, braises—or just something comforting to sip on.Read our ultimate guide to making hot pot at home here.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMesh Sieve$13 At AmazonLadle$27 At AmazonWooden Spoon$6 At AmazonIngredientsMakes about 2½ quarts4Tbsp. vegetable oil1lb. assorted mushrooms (such as shiitake, king oyster, and/or portobello), thinly sliced2large onions, cut into 2\" pieces5large shallots, thinly sliced1head of garlic, cloves separated, peeled2bunches scallions, coarsely chopped, plus more cut into 3\" pieces for serving½large head of Napa cabbage, sliced crosswise ½\" thick2large leeks, cut into 2\" pieces13\" piece ginger, scrubbed, cut into 1\" pieces½cup Shaoxing wine (Chinese rice wine), michiu, or dry sake1oz. dried shiitake mushrooms (about 8 large)½oz. white rock sugar or 1 Tbsp. granulated sugar3pitted dried jujubes (Chinese red dates), plus more for serving⅛oz. dried sliced dang gui (angelica root), plus more for serving2Tbsp. dried goji berries, plus more for serving1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt, plus morePreparationStep 1Heat oil in a large Dutch oven or other heavy pot over high. Cook fresh mushrooms, stirring occasionally, until browned, 5–8 minutes. Add onions, shallots, garlic, and chopped scallions. Cook, stirring occasionally, until onions are softened and lightly browned, 12–15 minutes.Step 2Add cabbage, leeks, ginger, and wine; cook, stirring, until cabbage is softened, 5–8 minutes. Add dried shiitakes, rock sugar, 3 jujubes, ⅛ oz. dang gui, and 2 Tbsp. goji berries. Pour in 10 cups cold water and bring to a boil. Reduce heat to medium-low; cover pot and cook, adjusting heat as needed to maintain a gentle boil, 1 hour.Step 3Scoop out solids from broth with a fine-mesh sieve, pressing with a spoon to extract as much liquid as possible. Pick out mushrooms and set aside in a small bowl for serving; discard remaining solids.Step 4Stir 1 Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt into broth; taste and season with more salt if needed. Top with more jujubes, dang gui, goji berries, and scallions.Do ahead: Broth (without toppings) can be made 3 days ahead. Let cool; cover and chill, or freeze up to 3 months.Why serve hot pot with just one broth when you can have two? Get the recipe for Eric Sze’s Mala Beef Broth here.\nPhotograph by Jenny Huang, Food styling by Tyna Hoang, Prop styling by Nicole LouieHow would you rate Herbal Mushroom Hot Pot Broth?Leave a ReviewTell us what you thinkExplore Bon AppétitDinnerVegetarianVeganStockTaiwaneseEast AsianAsianShiitake MushroomMushroomVegetablePortobello MushroomNapa CabbageCabbageLeafy GreensLunar New YearMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-08", "author": ["Condé Nast", "Eric Sze"]}