{"id": "bc63cf5060a18fa88b2855918881c5da", "url": "https://www.bonappetit.com/recipe/shrikhand", "year": 2020.0, "month": 7.0, "day": 1.0, "content": "Shrikhand Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesShrikhand By Priya KrishnaJuly 7, 20204.7(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrintShrikhand is yogurt in its dreamiest, creamiest dessert form, and it is one of my favorite sweets of all time. This impossibly smooth, thick, saffron-studded, I-can't-believe-I-made-this-with-yogurt treat is typical of the Indian state of Gujarat. When I'm back home in Texas, I make shrikhand with my dad’s homemade yogurt, but you can get that same silkiness with good-quality store-bought Greek yogurt. In what turned out to be a real game-changer, my friend Khushbu suggested putting shrikhand in a graham cracker crust and refrigerating it, like a no-bake pie. Shrikhand pie is an excellent idea, but I'm just as happy spooning it out of the bowl as is.Excerpted from Indian-ish © 2019 by Priya Krishna with Ritu Krishna. Photography © 2019 by Mackenzie Kelley. Reproduced by permission of Houghton Mifflin Harcourt. All rights reserved.Ingredients4-6 servings4cups plain whole-milk Greek yogurt½tsp. saffron threads, divided4green cardamom pods, seeds removed, or 1 tsp. ground cardamom½cup sugarSpecial EquipmentA mortar and pestlePreparationStep 1Line a large colander with coffee filters (unfolding if needed) or paper towels, overlapping them so they cover sides, and set inside a large bowl. Place yogurt in colander and let drain in refrigerator at least 8 hours and up to 12 hours; discard drained liquid in bowl. Yogurt should be very thick—like an even creamier, richer Greek yogurt.Step 2Crush ¼ tsp. saffron threads to a powder with a mortar and pestle; transfer to a small bowl. Finely grind cardamom seeds.Step 3Transfer strained yogurt to a large bowl and mix in crushed saffron, cardamom, and sugar (yogurt should turn a pale yellow color). Top with remaining ¼ tsp. saffron threads (don’t mix, as you want that stained effect) and chill at least 2 hours and up to 8 hours before serving.How would you rate Shrikhand ?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleWe also add blanched and slivered almonds and chopped pistachios. The crunchy nuts contrast nicely with the smooth shrikhand. Finely diced fresh mangoes work well too.AnonymousOrlando,Florida 11/14/2021Shrikhand originated from both Gujarat and Maharashtra. The strained yogurt is called “Chacca” and that is what gives Shrikhand it’s distinctive taste.. Back in India there are many varieties and flavors of Shrikhand. AnonymousSeattle, WA10/30/2021Priya, you’ve done it again! The flavour is delicate and decadent all at once and I’m going to be making this forever. AnonymousVancouver, BC8/30/2021Oh my! Delicious. L.i.s.a.Australia 7/11/2020Wow! I cheated and used thick Olympic 11% Greek yogurt (available in BC, Canada) right out of the container then added the other ingredients - it may not have been as thick as a strained yogurt but it was creamy and the combination of cardamom and saffron were delicious. Also cut the amount of sugar by half. I loved this .gerri1Vancouver, BC Canada7/9/2020Can also use a cheese cloth/muslin cloth instead of the coffee filters or paper towels - wouldn't want to waste -  jsookhaJohannesburg, South Africa7/8/2020Brilliant! I piped shrikhand into profiteroles and popped them in the fridge! Divine 😋SheenaloItaly7/7/2020This is an easy and amazing summer treat! I'm Gujarati and just made this last weekend from hung, plain whole-milk yogurt. It's creamy and delicious! Love the graham cracker crust twist! It had me thinking... what about traditional Indian biscuits like Parle-G or Good Day Pistachio biscuits? That would be amazing! Thanks Priya for another awesome recipe!!Sweta DhariaBethesda, MD7/7/2020Explore Bon AppétitDessertIndianSouth AsianAsianSaffronHerbs & SpicesCardamomEasyGluten-FreeNut-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-07-07", "author": ["Condé Nast", "Priya Krishna"]}