{"id": "bc77b4e9da3142e7cad5d2165174678c", "url": "https://www.bonappetit.com/story/janelle-monae-eating-habits", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Janelle Monáe Eats Like an Android | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLOOK INSIDE »holiday issue 2020Janelle Monáe Eats Like an AndroidAs part of a new series, Table 13, our guest editor talks to the Turntables singer about the four stages of quarantine, eating on tour, and more.By Marcus SamuelssonDecember 1, 2020FacebookTwitterEmailPhoto by Alissa AshleyFacebookTwitterEmail“I’m a huge Janelle Monae fan,” says chef Marcus Samuelsson. “There’s an honesty and fierceness in her work that I admire.” So Samuelsson (who also happens to be guest editor of our holiday issue) asked the singer and actress to meet—virtually, of course, with him in New York and her in L.A.—to share a meal and conversation, and deliver a special gift (check out that video below).Marcus Samuelsson: So, how’s quarantine been for you? What have you been up to?Janelle Monáe: It’s gone in different stages. When there was a mandate to stay in the house, I was like, Oh, it’s going to be a snow day. When you don’t have school and you have your friends over and you have a good time. Then it turned into something worse. I have been depressed. I’ve cried. I’ve accepted. I’ve adapted. I’m just putting my energy into figuring out how I can be of service, how I can help.MS: Let’s talk about food. Growing up, who was the cook in the family?JM: My mom was the cook—and actually my grandmother was the cook too. My grandmother served food in the county jail for 25 years. They knew her as Mama. Some of the people, when they got out and wanted to get their lives on track, she would let them stay with her and cook. She was that type of incredible, empathetic, amazing woman. I remember her picking up a hot cast-iron skillet with her bare hands. Like if she had cornbread cooking in the oven, she would just pick it up. No gloves. I’m like, you are just incredible, who are you?MS: You have a big extended family. What was it like when your grandma cooked for all you guys?JM: People out on the porch, people standing up in the kitchen, people in the living room, on the couch, watching TV. She was definitely that grandmother who had the plastic on her couch. You were not about to mess it up, you know what I mean?MS: What was your favorite thing that she’d make for you?JM: I Stan her oatmeal raisin cookies. She used to put them in a little box and mail them to me. That was her way of sending me some comfort. MS: You used to work at Office Depot. How did you cook and eat then, before you hit it big?JM: I had six roommates, and honestly, I used to eat a lot of ramen noodles. I’d heat up pizzas. I did not eat well. I’m very picky. I don’t like onions. I just started to appreciate tomatoes.MS: Now you’ve traveled the world. What’s your favorite place to eat outside the U.S.?JM: I’m gonna say Japan, hands down. Have you seen the documentary Jiro Dreams of Sushi? Oh, of course you’ve seen it. Watching that, I was like, I will travel just to go there.MS: How do you eat when you’re on the road touring?JM: Because our shows are so high energy, if I eat too close to performing I can get a cramp. So I try to eat maybe three hours before. I used to eat the same meal before every show: chicken, rice, and green beans. People were like, You really are some sort of android robot.This interview has been edited and condensed for clarity.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-01", "author": ["Condé Nast", "Marcus Samuelsson"]}