{"id": "bc7c952c0f27e20dff30b6bfa8e48318", "url": "https://www.bonappetit.com/recipe/spicy-chicken-katsu-sandwiches", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Chicken Katsu Sandwiches Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2019 IssueSpicy Chicken Katsu SandwichesBy Chris MoroccoMarch 25, 20194.8(85)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintThese sandwiches combine the shattering panko crispiness of katsu-style cutlets and the fiery heat found in Nashville-style hot chicken with some cooling shredded lettuce to put out the fire.IngredientsMakes 4½cup mayonnaise¼cup chopped bread-and-butter pickles2Tbsp. plus ¼ cup hot sauce, such as Crystal1tsp. kosher salt, plus more½cup all-purpose flour3Tbsp. cayenne pepper2tsp. garlic powder1large egg2cups panko (Japanese breadcrumbs)4skinless, boneless chicken thighs, lightly pounded to ½\" thick¼cup (or more) extra-virgin olive oil8slices milk breadShredded iceberg lettuce (for serving)PreparationStep 1Combine mayonnaise, pickles, and 2 Tbsp. hot sauce in a small bowl. Season with salt; set aside.Step 2Combine flour, cayenne, garlic powder, and remaining 1 tsp. salt in a medium bowl. Whisk egg and remaining ¼ cup hot sauce in another medium bowl. Place panko on a large plate. Working one at a time, dip chicken into flour dredge, turning to coat. Shake off any excess. Dip into egg mixture until coated, shaking off excess. Dredge in panko, turning to coat. Transfer to a large plate or a small rimmed baking sheet.Step 3Heat oil in a large skillet over medium-high until shimmering. Working in 2 batches, cook chicken, reducing heat to medium if it’s browning too quickly, until golden and very crisp on both sides, about 3 minutes per side. Transfer to a wire rack.Step 4Spread reserved spicy mayo on one side of each slice of bread. Top with chicken and shredded lettuce, then close up sandwiches.How would you rate Spicy Chicken Katsu Sandwiches?Leave a ReviewTell us what you thinkReviews (58)Back to TopTriangleAbsolutely one of my go-to staples. Chris Morocco is a legend at mastering and enhancing basics. Highly recommend finding or making some milk bread. Best bread I've had in my life comes from Takahachi Bakery in NYC – worth the trip.AnonymousMemphis, TN2/9/2022Absolutely delicious. My husband asked, \"Can we make this again tomorrow?\"ClairePA, USA6/10/2021What type of pickles I can use please. suniaLondon, UK5/5/2021As everyone has already said this is great. Just popping in to say it worked great using tofu in place of the chicken. Get a block that’s pretty firm, press for about 30mins. I cut my block into 6 slices. Also we have a spice baby in the fam so I cut the hot sauce by half and the cayenne back to 1T and that still read as spicy but tolerable for the spice baby. If making it for self I would use the original amounts though. Everybody loved it! We’ll be back. BananaMartiniElkins Park, PA 3/22/2021This recipe is insanely good.  Perfect amount of heat and crunch.  The whole family loved itMirjana VukasWestern Springs, IL2/8/2021Great recipe! I used some homemade pickles and served this to my parents while visiting home. Big hit and will be making it again soon! The type of sandwich I crave in the middle of the workweek when I'm sick of eating leftover curry or stir fry.Izzy SiedmanPortland, ME12/11/2020DELICIOUS! Intense heat and amazing crunch. A regular dish around our house. I sometimes reduce the cayenne by about half depending on who is eating with me. We collect hot sauces in our house and have used a few different ones in this recipe. My favorite was a pineapple/habenero sauce. Tangy!AnonymousLos Angeles10/12/2020Amazing flavor. Made this a few weeks ago,\nSuch a big hit the family requested this tonight. Thanks Chris!AnonymousWorcester,ma7/23/2020I made this with chicken, obviously amazing. I used the crunchy bits of Romain and it was worth it. Well done Chris. However I made the sauce for my burgers with pepper jack cheese- also amazing! MrsKC03KC 7/7/2020Incredible. 10/10. Will be making again in the future. Made it exactly how is, except for I substituted the sauce for a mayo, ketchup, sriracha sauce. New favorite chicken recipe for sure!AnonymousChicago, IL6/1/2020Super tasty! AnonymousBk, Ny5/30/2020Made this with college age grandson, his recipe find:)  We both thought it was amazing, even with the absurd amount of heat!  It just works, the iceberg lettuce, the creamy sauce and white bread.  Made exactly as written and wouldn't change anything.  Thanks for another great recipe and video.LschmidtSt. Paul, Mn5/7/2020These were an ABSOLUTE DREAM. I can't remember the last time I bought iceberg lettuce but it's such a balancing factor for the heat, as is the milk bread. In Love.Jenna VarmegaWA&WV5/4/2020Quite pleased. My wife is not as picante tolerant as I am, and she didn't think it was too hot. A success. An addition to my dinner rotation.bdwootCoastal Oregon5/4/2020Just made these sandwiches tonight, however the only substitute I made was using pork instead of chicken. It’s just what I had one hand but HOLY. CRAP. I do not regret the sub at all. This recipe has the perfect amount of spice. The sauce is awesome. The combination of soft and crunchy textures is great. Will absolutely make again, and will try chicken next time. Definitely recommend trying this out with pork. BrittanyBeshelPhiladelphia4/29/2020Explore Bon AppétitSandwichCutletChicken ThighChickenPoultryIceberg LettuceLettuceLeafy GreensVegetableMainNut-FreeFryLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-25", "author": ["Condé Nast", "Chris Morocco"]}