{"id": "bc7cd2ebb832393cad29186dfc5dfb54", "url": "https://www.bonappetit.com/story/sam-anderson-marathon-training", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "These Products Get Sam Anderson Through Marathon Training | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Products That Get Sam Anderson Through Marathon TrainingThe beverage director at some of our favorite NYC spots is gearing up for his fifth consecutive New York City Marathon.By Sam Anderson October 26, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailOn top of running the wine and beverage program at Wildair, Contra, and Una Pizza Napoletana, Sam Anderson is logging up to 80 miles a week. Yes, 80. That’s because he’s training for his fifth consecutive New York City Marathon. Which means between pouring you a glass of frizzante skin contact wine and making a new spritz recipe, he’s probably downing water and taking electrolyte pills so he can run 15 miles the next day. So how does someone whose career revolves around wine and alcohol manage to work until midnight then get up the next morning and hit the pavement? Well, for starters, by avoiding the hot dogs during family meal. Here, Anderson talks to us about the five things that help get him through training season. (Yes, natural wine is one of them.) — Rachel KartenMaurten Energy DrinkI use this sports drink religiously. It is an extremely high carbohydrate drink mix that has been used by nearly all the world's top marathoners including Eliud Kipchoge, who just set the world record, and Mo Farah, who just set the European Record with his win at Chicago. Maurten is unique because it delivers so much carbohydrates but these carbohydrates are encapsulated in pectin, which controls the rate that the nutrients are absorbed by the digestive system. This keeps you from getting stomach cramps or digestive issues. I mix it with some matcha tea powder, and that’s basically my training juice.Kettl MatchaI am a huge proponent of tea—it's one of the healthiest ingredients we can put into our system but I really love the gentle caffeination it provides when I mix it into my Maurten fuel.  Additionally, it has very high levels of theanine, which is one of the few amino acids which can cross the blood-brain barrier and has a great ability to reduce stress and promote a sense of well-being. It’s simultaneously relaxing, but also energizing. As a result, the mind is better suited to keep the body relaxed and performing freely. If you’re stressed out about running 22 miles, your body is going to tense up. Anything you can do to promote a state of relaxation and peacefulness, be it meditation or a tea ingredient, is definitely important.Ashwagandha fresh from Furnace Creek Farm.\nPhoto by Alex LauAshwagandha and ArjunaAshwagandha is the lion of all roots. It is incredibly powerful in its ability to reduce inflammation, lower cortisol (stress) levels and improves brain function and ability to focus. Arjuna, which in Sanskrit means “shining,” is a tree bark that is the ancient herbal hero of the cardiovascular system, increasing the efficiency of heart contractions. When these two ingredients are taken together systematically and regularly, they have been shown to greatly enhance endurance athletes VO2 max and cardio-respiratory performance. When I’m dosing with these, I make a tea with ashwagandha, arjuna, cinnamon, lemon, and honey and drink about two liters of the tea daily. I get my ashwagandha in whole root form from Furnace Creek Farm at the Grand Army Plaza Farmers’ Market. Arjuna is available online from herbalists.Honey ambrosiaHoney ambrosia is basically a mixture of bee pollen, honey, propolis, and royal jelly. And it’s all mixed together into this crazy paste. This stuff is like the fountain of youth. It’s sourced from just outside of NYC, so it has a great effect on your immune system, cardiovascular system, and keeping your lungs healthy.This Château de Béru Côte aux Prêtres is made by Athénaïs de Béru.\nPhoto by Alex LauBeer and natural wineI drink alcohol very sparingly when I am training heavily. I will have some wine or beer on the weekends, but I don't drink during the week at all. Evil Twin \"Race Day\" is a beer that I designed with my good friend and fellow runner Jeppe Bjarnit-Bjergso of Evil Twin with post-race refreshment in mind. It's a sour IPA brewed with pineapple and aloe-salt, which is a natural full-spectrum electrolyte replacement. Additionally, I designed the label, which is a racing track.Recovery also definitely involves plenty of natural wine the day after Saturday training. I’m tasting wine all day long for work but I don’t actually drink during the week. As a wine director, it's easy to have pick of tons of delicious natural wines, but I tend to favor wines that are fresh, bubbly, and balanced. And made by producers who farm and make their wine transparently—not adding anything or taking anything away. My favorite producers at the moment are: Tom Lubbe of Matassa, Baptiste Cousin, __ Athénaïs de Béru__, René and Agnès Mosse, Nacho González, Envínate, Christian Tschida, Laurence Manya Krief, Le Coste, Cantina Giardino...this list could probably go for miles.Explore Bon AppétitHealthyishNew YorkRead MoreLifestyleThese Are the Supplements Seamus Mullen Swears ByBy Seamus MullenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-26", "author": ["Condé Nast", "Sam Anderson"]}