{"id": "bc876693b91aa56dbb084a9074e5357c", "url": "https://www.bonappetit.com/story/choosing-the-best-tahini", "year": 2020.0, "month": 3.0, "day": 4.0, "content": "The Best Tahini for Cooking and Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Buy the Best Tahini For the JobIt's worth it to seek out the good stuff.By MacKenzie Chung FeganMarch 24, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.My worst kitchen injury can be attributed not to a mandoline or an immersion blender, but to tahini. I had purchased the kind that comes in a metal can. As I was vigorously stirring the tahini, trying in vain to get the oil and the chalky paste to coalesce, my hand slipped, and I sliced my finger open on the sharp edge of the metal lid. There was no hummus that day. Only blood.Now is not the time to be going to the hospital for tahini-related accidents. If you’re purchasing a jar to make these Tahini Billionaire Bars or another baking project, seek out a brand that requires minimal or no stirring—like Seed+ Mill, Soom, or Beirut.“Fresh, good-quality tahini will be much more homogenous than an older, low-quality one,” says senior food editor and tahini fanboy Andy Baraghani. “Oil is inevitably going to rise, and you shouldn’t necessarily be put off by separated tahini. But if it’s been processed properly and hasn’t been sitting on a shelf for months, you’ll see less of that.”For baking, homogeneity is key. “If you’re measuring out half a cup and it’s all oil or all chalk, you’ll get an incorrect result,” says Basically editor Sarah Jampel, who not only developed the recipe for Tahini Billionaire Bars but also wrote an entire ode to Soom tahini. “You either need to buy tahini that is nice and smooth or stir the heck out of it beforehand.” If you’re averse to stirring and find your tahini has separated like Harry Styles and whoever he was last dating, Sarah suggests dumping the whole jar in the blender or food processor.In addition to texture, flavor is another indicator of tahini’s quality and freshness. “Tahini has a slight bitterness that most other nut or seed butters don’t,” says Andy. “It’s quite savory. You want it to taste earthy, nutty, and rich.” But if that bitterness tips over into astringency—that mouth-drying sensation that you get from a tannic red wine—that is not the tahini for you.In addition to Soom, Andy and Sarah like Seed+Mill—which, like Soom, is made from Ethiopian sesame seeds and processed in Israel—and Beirut brand tahini from Lebanon. And, luckily for me, all of these come in jars with screw-top lids.Organic Tahini 16 oz$12 at Seed + Mill$13 at SnukSoom Foods Single-Source Pure Ground Sesame Tahini Paste 11oz (2 Pack)$17 at AmazonBeirut Tahini Sesame Paste 32 Oz$12 at AmazonExplore Bon AppétitShoppingBasically BakingTahiniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-24", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}