{"id": "bc957a30e295916bffab76b606bf6296", "url": "https://www.bonappetit.com/story/vegan-pho", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "After Years of Tinkering, I Finally Developed a Vegan Pho That Tastes Like Childhood | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAfter Years of Tinkering, I Finally Developed a Vegan Pho That Tastes Like ChildhoodThe perfect vegan pho doesn’t exi-By An UongFebruary 16, 2022FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Kat Boytsova.  Prop Styling Stephanie De LucaFacebookTwitterEmailEvery time the weather report forecasts a snowy, rainy, or even slightly cloudy day, my fingers twitch at the thought of slurping pho—a mouthful of snappy rice noodles on a soup spoon with a basil leaf placed gingerly atop the pile, a sip of smooth, aromatic broth. Growing up, pho was the dish my family gathered around every Sunday whether we were at home or at our favorite spot in L.A.’s Chinatown. When the pho arrived, I loved to lean over my bowl and let the steam hit my face. The rest of the day I would walk around accompanied by the lingering scent of star anise, cloves, and cinnamon.At college and far away from my family, I spent four years searching for a pho that would compare to the one I had at home. This was further complicated when I decided to pursue a mainly vegetarian diet. Every bowl of vegetarian pho I tried at restaurants was lackluster at best. The broth was too watery, the vegetables were haphazardly thrown together. It wasn’t until I had the vegetarian pho at Di An Di in Brooklyn that I felt something shift in my understanding of what a meatless pho could be, the nuances it could encapsulate. Instead of being watery, or worse, overly salted to make up for the lack of depth, Di An Di’s vegetarian broth was complex. Earthier than most bone-based pho broths due to the use of mushrooms, this one managed to layer the journey of flavors in the same way, from the first hit of spices to the delicate sweetness lingering at the end. Their pho toppings also leveraged wok-seared mushrooms as a stand-in for the thin slices of beef I was used to. Theirs was the pho that took me back to those Sunday meals with my family. I can’t tell you how intensely I stared at the tasting notes trying to tease out the sorcery from the minimalist description. Today the menu highlights the toppings: mushrooms, egg yolk, scallions, pickled garlic. But when I ate there in 2018, I took away two main hints: Utilize mushrooms in the broth and leverage mushrooms in the toppings. (Basically, mushrooms are everything.)When I left New York and said a sad goodbye to Di An Di, I knew that if I wanted a vegetarian pho that tasted like home, I would have to make it myself. I started out researching pho recipes that draw from beef or ox bones because it felt necessary to learn the path in order to divert from it. Growing up, I knew vaguely about the spices necessary for a good pho broth, but I sought clarity around the foundations. I went first to Andrea Nguyen, who changed Vietnamese home cooking with her approachable recipes. I studied her work on pho, including her vegan broth for emulating chicken pho, the lighter, less earthy sibling to beef pho. I also sought out premade pho spice packets from Southeast Asian grocery stores when my mom tipped me off on her shortcut for making broth (thanks, Mẹ!). After sitting at my kitchen table sifting through the packets, I landed on what seemed to be the most common combination: cloves, star anise, cinnamon, coriander, and fennel seeds.Once I learned the fundamentals of beef phở, I looked at vegetarian recipes to see what others were doing to achieve similar umami in the broth. While Andrea Nguyen leverages apple and nutritional yeast in her “chicken” broth, I was on the hunt for ingredients that would add more body to the finished dish. Some vegetarian pho recipes I found online listed dried mushrooms, others utilized kombu, but none brought both to the party. Neither are traditional to pho broth, but they bring necessary nuance when there aren’t bones to impart complex marrow flavors.Over the years of Frankensteining recipes and tinkering with ratios, I felt my way toward a vegetarian pho recipe that could achieve a similar all-encompassing warmth and tenderness that I knew my childhood pho bowls to have. My trusty stockpot has seen me through the litany of experiments: Too many dried mushrooms made the broth medicinal; not enough rock sugar and the whole thing fell flat, lacking a delicate sweetness to round out the spices. A feeling that something was still missing in the dance between salt and sweet led me to white miso. Milder than its siblings of yellow, red, or barley miso, it lends an extra layer of complexity to the broth without confusing the flavors. (I have Japanese cooking to thank for the miso in the pho, which complements the kombu, another Japanese pantry staple.)I saw that other home cooks grill their onions and carrots before adding them to the broth, but since I don’t have a grill, I took to charring my vegetables in the bottom of the pot instead. I also tossed in some celery for additional brightness. Once the water gets added, the caramelized vegetable bits release into the broth, infusing it with a slight hint of smokiness that tones down the natural sweetness. All of these layers add up to something that takes on its own life as vegetarian pho, a relative of bone-based pho that’s finally found a separate identity. The truth is, I know it will never taste exactly like a meat-based pho broth that has spent hours soaking up marrow from bones and fat from thick cuts of brisket. But at the end of the day, who am I to say what an authentic vegetarian pho should taste like? I didn’t set out to create an exact replica of the pho that’s made with beef or ox bones, even if the allure of fall-apart brisket that’s been sitting in the broth for hours still pulls at me from time to time. I set out to make a pho that warms my belly in the same way, with a complex broth that lingers on my clothes long after I’m done eating it.There was a time when I thought it wouldn’t be possible to have a vegetarian pho with a similar dance of flavors. But the trifecta of funky mushrooms, briny kombu, and rich miso creates a complex broth that intermingles with the warm spices and smooth rock sugar. When crowned with pan-seared tofu and heaps of soy-sauced mushrooms, the perfect spoonful of vegetarian pho isn’t too far away.Get the recipeVegan PhoThis vegan pho broth gets its rich, umami-packed flavor from a medley of well-toasted spices, charred veg, dried mushrooms, and miso for a soul-edifying soup.View RecipeExplore Bon AppétitcookingVietnameseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-16", "author": ["Condé Nast", "An Uong"]}