{"id": "bc992ae057eae026f4d1fa4da2b79292", "url": "https://www.bonappetit.com/recipe/chill-out-honeydew-cucumber-slushy", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Chill-Out Honeydew Cucumber Slushy Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesChill-Out Honeydew Cucumber SlushyBy Molly BazJune 20, 20185.0(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Molly Baz, prop styling by Emily EisenEmailPinterestPrintEmailPinterestPrintHigh in B vitamins, cucumbers both cool and calm you. This recipe is part of the Healthyish slushy trifecta. Check out the other two here and here.Ingredients6 servings4cups honeydew (from about 1 small), rind removed, flesh cut into 1\" pieces, frozen2½cups coconut water⅓cup mint leaves2Tbsp. fresh lime juice½tsp. kosher salt6oz. English hothouse cucumber (about ½ cucumber), peeled, cut into 1\" pieces, plus more sliced for garnishPreparationStep 1Blend honeydew, coconut water, mint, lime juice, salt, 6 oz. cucumber, and 2 cups ice in a blender until smooth. Divide among glasses, then garnish with cucumber slices.Step 2Do Ahead: Slushy can be made 1 hour ahead. Store in blender jar in freezer, then reblend on high speed to reincorporate.How would you rate Chill-Out Honeydew Cucumber Slushy ?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is my summer drink obsession- it is extremely delicious and scratches that I’d-like-a-pina-colada-but-don’t-want-to-get-day-drunk itch. It’s vegetal and creamy at the same time, like if a garden turned into a vegan milkshake. I add a dollop of honey because I’m a sugar fiend, but it really doesn’t need it. FaithLambertville, NJ6/6/2021This is SO GOOD.  Omg.  Best smoothie I've ever had.  So fresh and tasty.  maddiebohonew york7/21/2019I would totally make this recipe again! I used it for a school project, and it was fantastic! A+!bobmaltigAntarctica9/14/2018Explore Bon AppétitCold DrinkDrinks AllSmoothieHoneydewMelonFruitCucumberVegetableMintHerbs & SpicesSummerEasyQuickDrinksSnackDairy-FreeGluten-FreeVeganVegetarianRawNonalcoholicHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-20", "author": ["Condé Nast", "Molly Baz"]}