{"id": "bca48bc9e210692aa2012ae2f23f1b0c", "url": "https://www.bonappetit.com/story/kin-slip-cbd-strips", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "These CBD Strips Are Perfect for Busy, Anxious People, Which Is All Of Us Really | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThese CBD Strips Are Perfect for Busy, Anxious People, Which Is All Of Us ReallyIt’s a breath strip that chills you out in more ways than one.By Aliza AbarbanelJuly 17, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailI was an unenthusiastic Girl Scout, but I’ve always found a great deal of joy in feeling prepared for the unexpected. The ability to make any situation a little more comfortable is, well, comforting, especially now that I’m armed with a new tool: dissolvable CBD strips.I know, I know. Everyone is going crazy for CBD these days. I suspect this is because living on this flaming fireball of a planet is rough, and, between scrolling through breaking news updates and trying to make it to yoga on time, we're constantly searching for ways to chill the F out. I keep several CBD oils at my desk to mitigate the stress of deadlines and to-do lists, but those little (and expensive!) glass bottles don’t bode well for chilling out when you're, say, trapped on the subway or in traffic or waiting in line at Trader Joe's.Kin Slip's Park Life blend.\nPhoto by Emma FishmanThat's where Kin Slips come in. The sublingual strips provide a precise dose of CBD without you having to fiddle with a dropper, and they come in a palm-sized pack that’s easy to shove into an overcrowded purse or jacket pocket. Their CBD blend, cutely named \"Park Life,\" has 10 mg CBD and 1mg THC per strip, along with terpenes like Beta caryophyllene, limonene, and linalool. And no, that 1mg of THC won't get you high. It's there to boost CBD's potency through something known as the \"entourage effect,\" which uses the whole cannabis plant (including small amounts of THC) to purportedly improve the effectiveness of CBD.I also love that the strips are flavored with mango and turmeric for a pleasantly earthy, slightly sour flavor.They're also sugar-free, vegan-friendly, non-GMO, and very easy to use. Place a small, moss-like square under your tongue and let the sweetness seep out, filling your mouth with the taste of mango and sending CBD directly into your bloodstream. (Sublingual products enter your body through the thin membrane under your tongue, allowing them to kick in much faster than edibles, which are broken down in the liver.) The tiny square dissolves in a minute or two, and I tend to feel the effects about ten minutes later.I find that it helps ease some of the sensations of anxiety—tight chest, tense back, clenched stomach—that I tend to feel in high stress situations. A sense of calm sets in behind my eyes, and the sharp, anxious edges of my mind soften. And because these strips are individually wrapped like sticks of gum, it's easy to share the chill. It’s thought that CBD works best when taken daily, so I still rely on my tinctures to reap those long-term effects. But once I’m out in the world, in all its beautiful and messy and sometimes stressful glory, it’s nice to know that I have CBD in my pocket.Before you buy, consider consulting a medical practitioner and checking cannabis laws in your area. And remember: Everyone’s experience is unique. To learn more about how CBD works, check out our guide.Explore Bon AppétitHealthyishCannabisShoppingRead MoreLifestyleWhy I Take Cannabis Terpenes Instead of Smoking WeedBy Zan RomanoffRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-17", "author": ["Condé Nast", "Aliza Abarbanel"]}