{"id": "bcadaf01046b9ef0b2dee7dc7c25c653", "url": "https://www.bonappetit.com/story/virtual-cookbook", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "How to Cook With Friends When You're in Self Isolation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscookingThere's No Better Time to… Start a Virtual Cookbook With Your FriendsHow to cook together while remaining, technically-speaking, alone.By Ella QuittnerApril 2, 2020FacebookTwitterEmailChelsie CraigFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. Today: Crowdsource recipes to share among friends.When I entered curve-flattening hibernation the week before last, I didn’t stock up on essentials or learn how to work Zoom. Instead, my foremost act as a socially distant human was to circulate a Google document of my deeply treasured, foolproof recipes. (Yes, this means I’m almost out of toilet paper.)“Add your own comforting favorites!” I wrote, as I shared the doc broadly. At a time when restaurants are shuttered but for takeout, grocery store lines stretch down city blocks, and we’re all being encouraged to spend as many hours in our homes as possible, the ability to feed oneself with limited provisions is more necessary than ever before. And since many of my Most Important People essentially use their ovens to store shoes, The Doc was the best way I could think of to care for them from afar.It began as a wimpy thing: Lazy Quarantine Chili, Marcella Hazan’s Tomato Sauce, and “Three Ingredient Peanut Butter Cookies I Make With Five Ingredients Because I’m Troubled,” all featured prominently, along with ideas for swaps and riffs. But over the past week or so, as I dropped in more quick dinner ideas, and as it’s been shared with my Most Important People’s Most Important People, The Doc has grown. My friend Amanda, down in Puerto Rico, added “The Only Salad Amanda Can Make.” Timor, in the Bay Area, contributed his reverse-engineered take on those hulking, under-baked Levain cookies. From Boston, Lauren bestowed upon us the Alice Waters's sherry-garlic vinaigrette that reminds me of the years we spent laughing and cooking together in a tiny East Village kitchen (scroll down for the recipe).And while I can’t say for sure whether it’ll turn out to be as useful for my oven-fearing friends as I intended—Ajay, for example, recently copped to “mostly buying prepared things and stacking them on top of one another,” and Jaquén admitted she accidentally turned sushi rice into an “unpleasant take on risotto”—I can confirm that The Doc has been unexpectedly useful for me.Like any of my sauce-splattered, dog-eared, real-life cookbooks, this virtual one is now a place I can go to feel like I’m hanging out with friends even when I haven’t spoken to anyone but Siri for days. Comments have begun to crop up in the margins: “Jaquén… do you not like avocados? I'm… concerned,” wrote Allegra recently, alongside the recipe for Soft-Scrambled Egg Sandwiches. “I’m a monster,” replied Jaq, almost immediately.The next day, Allegra logged back in to note that, “I’ll… never forget this.” Solemnly, she resolved the comment so the exchange would disappear.This is definitely fancier than any egg sandwich I've ever made. \nPhoto by Chelsie Craig, Food Styling by Kat BoytsovaThat didn’t stop me, hours later, from dropping into the versions archive, where I could restore their exchange. I was a little bored, a little lonely, a lot freaked out about the news. But to see my friends hanging around and joking with one another in the margins? And to imagine them tying on aprons to cook different versions of the same egg sandwich at the same time, in their disjointed kitchens? That made me feel better, at least for a bit.Afterward, I logged off and set out to make Amanda’s salad. With Lauren’s dressing.Lauren’s Alice Waters Dressing That Ella Would Happily DrinkMince one or two cloves of garlic. I use one clove for a small-ish amount of dressing (enough for two big salads), and two cloves when I’m making enough to save. All the chefs say garlic presses are blasphemous and I’m not going to argue with that, so I chop with a knife.Transfer the garlic to a container, and add sherry vinegar and olive oil (dressing quality will scale in proportion to olive oil quality) in a 1:2 ratio. Ideally this should be done in a clear container so you can watch proportions. The absolute amount doesn’t matter much. The trick is the ratio. Add a few pinches of salt and grind in some black pepper. Stir with a fork to combine.Done! You can store on the counter. Alice Waters says the dressing starts to go rancid after a while, but I’ve never noticed. I keep mine in a big container, sometimes for two weeks or more.  Having extra on hand makes salads close to effortless. Don’t store in the fridge or it will solidify.Notes for use:The dressing—be warned!—is assertively garlicky. Not to taste, exactly, but I often feel after that I’m distinctly garlicky. If you’re going on a date, this is a poor lunch option.If you’re putting it on salad, make sure your leaves are bone dry. If they’re even slightly damp the dressing won’t stick and you will have a limp, flavor-bereft bowl of greens. Alice suggests you rinse lettuce and dry it the moment you bring it in from the store, so you’re never in the position of needing to wash a salad on a tight timeline.Salads need seasoning too. Ideally, you’d dust with very roughly cracked pepper and very fancy salt (for me, Maldon).Put this on apples! As an afternoon snack, I often chop an apple, dress with this, and add Maldon and pepper. Sometimes, I spoon a can of good Italian tuna in oil over the apple, with a generous handful of chopped scallions and a dash of lemon juice. The result is a quick, healthy-ish, and beautifully salty afternoon meal that an ex of mine dubbed “kitty snack.” Pink Ladies are the best, in my view, for their sweet-tart balance.A favorite salad combines this dressing, arugula, chopped apples, and smoked salmon. Another favorite combines this dressing, arugula, endive, really a lot of chopped scallion, and—optionally—blackberries. Best practice is to dress items in heavy salads separately and then combine—but I often throw them all in and dress together.Ella Quittner writes about culture, food, and obscure pockets of the internet. You can read more of her writing here.Explore Bon AppétitThere's No Better Time CoronavirusBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-02", "author": ["Condé Nast", "Ella Quittner"]}