{"id": "bcb1ba6439c5097253cc528cd3d0055b", "url": "https://www.bonappetit.com/story/what-does-deglaze-mean", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "What Does \"Deglaze\" Mean? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Does \"Deglaze\" Mean? And Do I Need a Degree to Do It?Deglazing sounds fancy, but it is literally NBD. You could be deglazing at home. Right now.By Alex DelanyFebruary 23, 2018FacebookTwitterEmailPhoto by Laura Murray, food styling by Judy ManciniFacebookTwitterEmailWhen someone says that they're “deglazing” a pan, it really sounds like they're accomplishing something, doesn't it? Like they're a big deal. Like they're throwing an “M.D.” or an “Esq.” after their name. It’s a flex. But what does \"deglaze\" mean, anyway? Well, we're here to tell you that while it might sound quite impressive, it’s actually dumb-simple. You've almost definitely deglazed a pan before. And you don’t need to go through seven years of schooling or a brief stint on a cooking competition show to do it.Deglazing is simply the act of adding liquid to a hot pan, which allows all of the caramelized bits stuck to the bottom to release. Here's the thing about those bits: They're treasure. (And if you want to get even more fancy, call them\"fond.\") Whether you're sautéing onions and other aromatics for the base of a soup, sizzling out tomato paste for a vodka sauce, or searing a piece of meat, that stuck-to-the-bottom stuff has lots of complex flavor that you want; deglazing is just how you get it off the bottom of the pan and into your mouth.This what deglazing looks like. Yeah, it's easy.\nYou can use just about any liquid to deglaze a pan and get up all that deliciousness. Wine. Vinegar. Beer. Cider. Juice. All of those things work, and are a great way to get some extra flavor in the mix, but water will work in a pinch. The process is simple. When you've got some stickiness happening in that pan, keep the burner up high. (If you're searing a piece of meat, you're going to want to transfer it to a separate plate before proceeding.) Add your deglazing liquid of choice, which will bubble furiously. Scrape the bottom of your pan with a spoon to get all of those tasty bits up. Let the liquid you added reduce some, which will concentrate its flavor (and cook off any alcohol if you opted for booze). And there you have it: You've deglazed.After you’ve finished eating dinner, you can call your mom and tell her you’ve learned to deglaze. And she’ll be proud, because she either has no idea what deglazing is, but is impressed with the word. Or because she’s been deglazing for years and wants to welcome you to the Cool Kids Club.Steak and pan sauce are in the Cool Kids Club, too.Easy Steak with Pan SauceA juicy, buttery, steakhouse-worthy dinner in 30 minutes flat.View RecipeExplore Bon AppétitBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-23", "author": ["Condé Nast", "Alex Delany"]}