{"id": "bcbadacd93519faa9b2d781c5e8b47d4", "url": "https://www.bonappetit.com/story/the-ruby", "year": 2018.0, "month": 8.0, "day": 5.0, "content": "The Ruby Is the Women's Co-Working Space with a Serious Food Focus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Women's Co-Working Space With a Serious Food FocusThe Ruby in San Francisco wants women to vote with their forks.By Elena KadvanyAugust 30, 2018FacebookTwitterEmailPhoto by Miha MateiFacebookTwitterEmailIt’s shortly after noon on at The Ruby, a six-month-old women’s work and gathering space in San Francisco’s Mission District, and women are hovering around a long communal table, hungry. They descend on a Vietnamese feast prepared by a local mother-daughter duo: colorful spring rolls, garlic-fried tofu, nuoc cham, pickled veggies.In past weeks, they’ve eaten a Mexican immigrant’s local tamales; succulent Nepalese momos prepared by a native of Kathmandu; and curries and sambal made with love by an Indonesian transplant. They’ve drank the famed pinot noir of Merry Edwards, one of California’s first female winemakers.Women’s clubs abound in 2018—New York has The Wing and San Francisco The Assembly, The Hivery, and others—but none so intentionally celebrate womanhood through the cuisines and cultures of their city as The Ruby. Founder Rachel Khong says The Ruby is far more than a coworking space. The food and beverage program is a way to help women “vote with their forks and wallets,” she says. Want to find a woman to cater your next work event? Check The Ruby’s online rolodex. Searching for inspiration for your next dinner party? Peruse the upstairs cookbook library, filled with female authors.Lunch at The Ruby: Vegan ribs, sisig, macaroni salad, and garlic rice from Nick's Kitchen.\nPhoto by Miha MateiAnd, every Friday, female-identifying artists of all kinds working at the homey, two-story space gather for a meal like the recent Vietnamese one prepared by Jessica Nguyen, who left her job as a statistician at the Federal Reserve to sell banh mi with her mother. Reem Assil, whose Oakland bakery and restaurant are channels for both activism and Palestinian-Syrian cuisine, was a recent guest chef. Another week, Siska Marcus, who runs an Indonesian supper club in San Francisco, answered members’ questions about Indonesian food over beef rendang, shrimp curry (made with shrimp paste that she ferments herself with local baby shrimp) and gado gado, a blanched-vegetable salad dressed in roasted peanut sauce.Growing up in Jakarta, Marcus was unofficial sous chef for her caterer-mother, but she moved to San Francisco to study a different craft: journalism. Later, feeling stifled by the confines of a 9-to-5 job, she returned to her roots and started hosting pop-up dinners out of her home. She now runs Chilicali, her supper club, and produces a line of jarred Indonesian sauces out of a commercial kitchen two blocks from The Ruby. Her food is personal, celebrating the spices and dishes of an underrepresented cuisine in the Bay Area.After Marcus’ first lunch at The Ruby, members started following her on social media. Then, they came to her dinners. And again, and again.“We became friends and family almost,” she said. “I think when women are empowering each other it’s just a beautiful thing.”For Marcus—a small business owner with no marketing budget, trying to move from a pop-up to a food truck or a potential brick-and-mortar—this support is invaluable.“People don't get why we as females need that type of place, but the support, the camaraderie, the sisterhood,” Marcus said. “But that’s what we need, especially for small businesses like me.”This is Khong’s vision in action: to have an impact beyond the walls and members of The Ruby.“It's a thing that we say a lot, that we should be spending money on the sorts of businesses that we want to support and to create the world we want to live in,” Khong said. “People can be very well-intentioned and still not really have the time to seek out a woman-made wine or even a woman-run lunch spot.”Khong, soft-spoken and food-obsessed, started The Ruby after leaving her job as an editor at Lucky Peach shortly before her first novel, Goodbye Vitamin, was published. She felt disheartened by the lonely nature of freelancing and the rate at which she saw artists, writers, and chefs being priced out of a rapidly gentrifying city overrun with tech companies and homogenous food catering to them.The Ruby seeks to remind us that San Francisco is still colorful, offbeat and rich with food and people of all kinds. Many of the club’s 130 members—self-described “Rubies”—are creative Bay Area women of all definitions, including transgender and nonbinary individuals. Many have become ardent supporters and customers of the chefs and food businesses who’ve come to the space.On Friday evenings, there’s a weekly happy hour, always featuring a women-made wine, beer, or liquor, like Stevie Stacionis of community-focused Oakland wine shop Bay Grape. Recently she brought in three female-produced wines from around the world (California, France and Argentina) and talked Wine 101 with curious members.Stacionis feels at home at the gritty, open-minded co-working space, where vulnerable conversations about race, politics, literature and motherhood take place over spritzes and noodles. She feels a particular kinship with Khong, another woman building something she loves from the ground up.The spirit of The Ruby, in Stacionis’s words? “I’m a woman trying to get shit done.”Explore Bon AppétitHealthyishSan FranciscoTrendsRead MoreWhere to eatWhat’s for Lunch at N.Y.C.’s First Women-Only Coworking SpaceBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-02", "author": ["Condé Nast", "Elena Kadvany"]}