{"id": "bcbc30c53b9ced2a914b98424f533792", "url": "https://www.bonappetit.com/recipe/broccoli-and-egg-fried-rice", "year": 2018.0, "month": 12.0, "day": 5.0, "content": "Egg Fried Rice Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBroccoli and Egg Fried RiceBy Kat BoytsovaDecember 30, 20184.7(151)Read ReviewsTriangleEmailPinterestPrintEmailPinterestPrintEmailPinterestPrintA pan full of veggie-packed fried rice is one of the easiest and most satisfying weeknight dinners we know of. And once you get the hang of this basic method, you'll be able to turn leftover rice and whatever odds and ends you have in the fridge—some rotisserie chicken, roasted veggies, a wedge of cabbage, kimchi—into a quick and delicious meal. If you don't have a well-seasoned cast-iron skillet, using a non-stick pan is your best bet; you won't get the same char on the veggies, but you don't want the eggs to stick to the pan. And don't be tempted to leave out the sugar—as weird as it may seem, it's the secret to getting color on the rice in a hurry.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Bowl$17 At AmazonWhisk$10 At AmazonSmall Bowl$13 At AmazonMicroplane$16 At AmazonCast Iron Skillet$30 At AmazonSpatula$12.99 At AmazonIngredients4 servings1small head of broccoli1large bunch scallions4large eggsKosher salt1Tbsp. sugar4tsp. soy sauce11\" piece ginger2garlic cloves4Tbsp. vegetable oil, divided3cups cooked, day-old sushi rice2Tbsp. toasted sesame oil2Tbsp. unseasoned rice vinegarPreparationStep 1This fried rice comes together really quickly, so it's important that all of your ingredients are prepped and ready to go before you start cooking. First up: broccoli. Holding onto broccoli stem, shave around the head with a chef’s knife and let the florets fall onto cutting board. If the pieces seem too large, break them down further into bite-sized pieces. Remove an inch or so of woody end of the stem. Use a vegetable peeler or paring knife to peel the remaining stem, then coarsely chop into pieces about the same size as florets so they'll cook at the same rate. Transfer broccoli to a medium bowl.Step 2Trim 1 bunch scallions on both ends, then cut crosswise into 1\" pieces. Transfer to bowl with broccoli.Step 3Whisk 4 eggs in another medium bowl to combine and season with ½ tsp. salt.Step 4Whisk 1 Tbsp. sugar, 4 tsp. soy sauce, and 1 tsp. salt in a small bowl. Grate 1\" piece ginger and 2 garlic cloves into bowl and give the sauce another whisk.Step 5Time to cook! Bring all of your prepped ingredients to the stove. Heat 1 Tbsp. vegetable oil in a large cast-iron skillet—or non-stick if you don't have one—over medium-high until just beginning to smoke. Add broccoli and scallions, season with a good pinch of salt, and toss with a spatula to coat in oil. Cook, undisturbed, until well charred on one side, about 5 minutes. When we say \"undisturbed,\" we mean it! You need consistent, direct contact with the hot pan in order to get color on the veggies, so resist the urge to constantly fuss with them. Mix with spatula and continue to cook, tossing occasionally, until broccoli is crisp-tender and scallions are wilted, about 2 more minutes. Transfer veggies back to the bowl they came from.Step 6Heat remaining 3 Tbsp. vegetable oil in skillet over medium-low. Add eggs and cook, stirring constantly with a rubber spatula, until large curds begin to form, about 30 seconds. The eggs will cook very quickly, so try to err on the side of runny and less-cooked because they can become spongy if overcooked.Step 7Add 3 cups rice and soy sauce mixture to eggs. Toss well to combine, then press down evenly into skillet. Cook, undisturbed, until rice is slightly crisped on one side, about 5 minutes. (Remember: undisturbed!)Step 8Return veggies to skillet and toss well to combine. Remove from heat, add 2 Tbsp. sesame oil and 2 Tbsp. vinegar, and toss once more.Step 9Divide fried rice among bowls and serve.How would you rate Broccoli and Egg Fried Rice?Leave a ReviewTell us what you thinkReviews (70)Back to TopTrianglePerfectly balanced fried rice! Simple but so yummy! Have been making it basically every week. Been using brown rice - long grain or short grain, it all works. Petit ChouCA3/3/2022Follow the directions exactly and you will have a wonderful fried rice!  I threw in ~10 raw shrimp (cut in half) right before returning the vegetables to the pan.  RedheadChicago, IL2/11/2022Make this often. I have altered the recipe various times. Sometimes I make as is and other times I add chicken, Chinese green beans, snap peas or snow peas as well. Always use broccoli though. Love this recipe!LaurelSouthern California11/23/2021Very good and easy to makeJ gibson11/17/2021Love this recipe! I usually add a bit more ginger and garlic but it's so easy! AnonymousPhilly11/5/2021I make this all the time !! I usually add a little more garlic and ginger thoughCadeNew York, ny 11/2/2021This is delicious! So easy to make for lunch.  And it uses a bunch of ingredients I already have on hand. I used a Tbsp less sesame oil, because it was a bit too oily for me.  But otherwise, great!Anonymouslos angeles, ca10/29/2021I am going to be making this recipe tonight for the 2nd time in a little over a week.  Although I was nervous about the charred veggies, their unique flavour really makes the recipe. I added some leftover roast chicken for a little more protein and reduced the sesame oil a bit because I find it can be a bit overpowering.  Overall, really delicious recipe and a great way to use up leftover rice and other meat/veggies you have around!! LMG TorontoToronto4/25/2021I LOVE THIS RECIPE! It's one I come back to again and again to refresh myself on how to make. It is absolutely delicious, and a great way to turn odd-end leftovers into a restaurant quality meal. I appreciate the step-by-step instructions for getting all the ingredients to sing just so. KatieMadison, WI4/23/2021We all have those few recipes that we think are so perfect that we need to memorize...I think this is just the best! My go-to Saturday evening meal, to myself or shared with my friends. The charring of the veggies is amazing and works in so many other applications. (Btw...almost any other veggie you might like sweeps right into this recipe perfectly). Two cautions: low sodium soy sauce leaves this recipe a little \"less than\", use really good quality real stuff, and, it really does make a difference to cook the rice well in advance...do a double batch of rice, once a week or even the night before, cool a bit & put right into the fridge (or in a pinch, cook & spread onto a large baking sheet to \"air dry\" a bit in advance!Dan SchmidtSt. Petersburg, Florida3/7/2021Great recipe, I don't eat eggs, so I adapted the recipe and used about 2/3 cup (100g or so) of firm tofu, crumbled and seasoned with a little turmeric, pepper and black salt (kala namak) instead.  I always make a big batch of rice in the rice cooker and freeze in individual portions, so it's handy for recipes like this.LauraLondon, UK3/3/2021Easy to prepare and delicious.  We used only 1T of sesame oil per the reviews.  Also made 2 C (vs 3) of instant rice and it was plenty.  I think it is more like 5 or possibly 6 servings as we also added shrimp.  Would be great with other veggies like carrots and celery.  Tossing in a few cashews would also be very nice.Mother GailWA1/15/2021Good recipe however mind turned out oily. Would recommend less oil!Chelsea KMinneapolis,MN1/13/2021Delicious! I would make it again but would remove some of the oil used because we found it a bit too oily. My husband didn't like the rice vinegar but I quite liked it.KristinaHamilton, ON, Canada 1/4/2021This was really good--the best fried rice recipe that I've found. Subbed cabbage, and onions, as I didn't have scallions.  Also I used black vinegar.AnonymousWoodglen NJ12/22/2020Explore Bon AppétitFried RiceChineseEast AsianAsianBroccoliVegetableRiceRice & GrainsEggQuickEasyWeeknight MealsOne-Pot MealsMainVegetarianLunchDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-30", "author": ["Condé Nast", "Kat Boytsova"]}