{"id": "bcc314e6ff266a94155ee30431f4d7fd", "url": "https://www.bonappetit.com/story/badaone-dried-seafood-packs", "year": 2020.0, "month": 12.0, "day": 1.0, "content": "Dried Seafood Packets Are My Secret to Fast, Flavorful Soups and Stews | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDried Seafood Packets Are My Secret to Fast, Flavorful Soups and StewsThey’re a must for any serious (and somewhat lazy) soup fanatic. By Joy ChoDecember 7, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.A few weeks ago, on a chilly and rainy Monday, I texted my friend: “Today is soup or stew weather, we will eat accordingly.” And that we did—with a healthy dose of nostalgia. I love a flavorful vegetarian chili or rich tomato soup, but there’s a specific comfort that Korean soups and jjigae (stews) provide for me. I used to think I could only eat doenjang guk (soybean paste soup) or dduk guk (rice cake soup) if my mom, grandma, or someone at the local Korean church had made it, but it turns out that Badaone’s dried seafood packets allow me to reproduce these earthy, wonderfully pungent, and hearty-but-not-heavy dishes in my tiny Brooklyn kitchen right when I crave them.Simply toss one of these “tea” bags filled with dried anchovy, shrimp, and kelp into a pot of water, boil for 5–8 minutes, remove the bag, and bam—you have a flavorful stock that’s the starting point for soups, stews, and even sauce for tteokbokki (spicy stir-fried rice cakes, also spelled ddukbokki). The ease of producing such flavor is pretty magical. Badaone’s ingredients are roasted, which provide an additional layer of depth to the stock base, and the bags are conveniently packaged for quick use—each 15 g bag makes about 4–5 cups of stock. Any dish derived from seafood stock is just a little baggie away—my mom recently made a simple mushroom soup using a Badaone tea bag, a bottled udon soup base, and mushrooms. Each spoonful was so richly savory that I was only mildly surprised when she said she used a seafood packet. (Oh? Ohhh.)I’ve always felt that buying big bags of dried seafood was intimidating, not just for space and storage reasons but because it launched a series of annoying questions like, How much of this do I use for one soup? and Do I really need to buy both dried anchovy and dried kelp to get a good stock? Sometimes it felt easier to trek to Koreatown for my jjigae craving than to attempt to make it at home. Now I can just grab a palm-size pack preportioned with all three dried seafood elements from my freezer whenever I need something soul-warming, stat. On that particularly dreary Monday, after making a quick stock from a Badaone packet, I piled in green onions, potatoes, onions, and mushrooms before mixing in soybean paste and a healthy sprinkling of gochugaru for some kick. A steaming antidote to the bleak rain outside, on my (coffee) table in 20 minutes.I never thought dried seafood packets were the key to kitchen confidence, but now they have a dedicated space in my freezer next to ice cream pints and frozen fish fillets. The most thinking I have to do is decide what comfort dish I’d like to whip up and what vegetables to use up from my crisper drawer—no last-minute take-out order necessary.Badaone Chef’s Recipe Dried Seafood Packets$9 at Asian MartExplore Bon AppétitHighly RecommendShoppingproductRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-07", "author": ["Condé Nast", "Joy Cho"]}