{"id": "bcd2c69ed56b2ae8469b020ffeacc29c", "url": "https://www.bonappetit.com/story/queer-eye-antoni-porowski", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "‘Queer Eye’ Star Antoni Porowski Will Guide You to Dinner Party Greatness | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture‘Queer Eye’ Star Antoni Porowski’s 9 Tips for Dinner Party GreatnessEven if you've never hosted one before.By Alyse WhitneyMarch 2, 2018FacebookTwitterEmailCourtesy of NetflixFacebookTwitterEmailThe smoke alarm is blaring. Roast chicken skin is burnt to a charcoal black. It’s 10:30 p.m. and your eight guests are still waiting on a salad course. Sound familiar? A disastrous dinner party is a rite of passage as a seasoned home cook, and a recurring nightmare for those who haven’t hosted before. But it doesn’t have to be so frightening—Antoni Porowski is here to chase away any Freddy Kruegers from the kitchen.On Netflix’s Queer Eye, food and wine expert Porowski teaches basic cooking skills to men who are hapless in the kitchen. Before the show, he worked in restaurants and as a sommelier before becoming private chef for OG Queer Eye for the Straight Guy culinary expert Ted Allen. Porowski describes himself as a passionate self-taught cook who is an “entertainer by nature and not a chef,” enjoys learning new skills every day, and wants to pass along any and all advice he’s learned along the way. Offscreen, he hosts seated dinner parties for six in his tiny Brooklyn apartment regularly, even though he can practically touch both sides of his kitchen at once. Everything has to be at arms’ reach because he only has one drawer and a $99 IKEA kitchen island to store and prepare everything, forcing him to be almost as creative as someone living in a college dorm.Just as he guided small-town Georgia cop Cory through making a grapefruit-avocado salad and taught AJ, a guy who survived on mostly almond milk smoothies, to make queso fundido-stuffed arepas, Porowski can be your Dinner Party Coach. Here are his nine tips to take you from the grocery store to the well-lit, family-style dinner table without breaking a sweat. Clear counters, sharp knives, can’t lose.When in doubt, roast veg and top with labneh and pesto or some sort of herby sauce.\nJoseph Krietemeyer via @antoni on Instagram1. Be Ready to Adapt Your Grocery List“It’s important to go into the grocery store with a plan and a list. But it’s a skeleton—you need to know how to deviate from it and adapt it to what ingredients are available and fresh. If they don’t have radicchio, then know you can get endive, which is also really bitter but not exactly the same. Or if you want to roast Brussels sprouts but they’re dirty or wilted at the store, you can grab haricot verts or another vegetable to substitute. When in doubt, I’ll use frozen peas—frozen at peak freshness, or Trader Joe’s fresh shelled petite peas in the summer—and  saute with bacon, a lot of butter, and Maldon salt.”2. Never Attempt a Brand-New Dish“A big mistake that I’ve made for many years is that I always decide, ‘Hey, you know what crazy new thing I’m going to try tonight?’ Don’t get too ambitious because you’ll be stressed out, sweating bullets, and not have fun because you’re panicking about getting this new dish right. Stick to something that’s simple and easy that you have existing comfort with, because the night is really about entertaining and spending time with the people you’re hosting. You don’t want to welcome people when you’re in the middle of a meltdown.”3. Upgrade a Standby with 1 Luxe Swap“Upgrade with one simple thing if you are going to try something different for a dinner party because you want to be a little extra. Instead of making mashed potatoes or simple roast potatoes, make duck fat-roasted potatoes. It’s one new ingredient that you can pick up at Whole Foods, and you’re still going by the same traditional rules that you’re used to. But this small change makes it feel more special with a new flavor and elegance.”Porowski says cheese plates are a teaching moment to show people how to pair sweet, salty, and different textures.\nJoseph Krietemeyer via @antoni on Instagram4. Give Guests a Bite the Minute They Walk In“Make a simple bite for guests as soon as they walk in. It should be served at room temperature and prepared ahead. I always make Devils on Horseback with a Medjool date stuffed with a Marcona almond and Gorgonzola (or a goat cheese if anybody’s a little picky), all wrapped in prosciutto for a nice salty kick. You throw it on a baking sheet ahead of time, and then their first bite has a crunch from the almond, sweet and sticky caramelization from the date, fat from the pork, and tangy sharp umami from the blue cheese. You also can’t go wrong with a cheese board. Make sure to assemble things like how you want people to pair them: dried apricots go next to blue cheese because they go well together, and cornichons are far away because they’re too salty and not cohesive with a blue.”5. Create a Chill, Comfortable Vibe“I love a little darkness at the table with juuuust enough light from IKEA white candlesticks. Seriously! They look elegant but are simple and unscented and create mood lighting. Miles Davis is my go-to for music. There’s something so relaxing and ambient about it, and it can be a little manic in a good way.”On Queer Eye, Porowski taught a dad named Bobby how to make slow-cooker chili. At home, he often serves big bowls or sets a Dutch oven in the middle of the table.\nJoseph Krietemeyer via @antoni on Instagram6. Always Go Family Style“I want people to be comfortable and ready to break bread. I’ll set the whole loaf in the middle of the table and let people tear into it and sop up stews and sauces with it. For entrées, I love a simple chicken Milanese with plenty of Parmesan. Make a nice spread of that with a whole bunch of arugula, kumato tomatoes, and torn basil. That’s such an easy way of making fried chicken without having to do with the brining and frying, and everyone loves crispy chicken. A slow-roasted meat like short ribs are great because it makes the whole apartment smell amazing and feeds so many people.”7. Cook and Serve in the Same Vessel“I like to create a bountiful spread that everyone shares, and at the center is usually something that you can cook and serve in the same dish. A stew is perfect for that, and you can do less dishes! Beef bourguignon is a great recipe to know, and then you can swap in any protein or even make it vegan if you have to using butternut squash. That isn’t about presentation—it’s about flavor. I’ll use my big Boos Block wooden cutting board for presentation too since I don’t have a ton of dishes to serve in. If you’re slicing up some hanger steak, add some arugula to the board, finish with olive oil and salt, and you have a beautiful little pastiche that you can eat from.”One of Porowski’s most famous Queer Eye dishes is a simple grapefruit-avocado salad that uses the citrus two ways: in the salad and in a zesty vinaigrette.\nJoseph Krietemeyer via @antoni on Instagram8. Try 5 Ingredients or Less for Apps and Sides“You can be as complex as you’re comfortable with for the main dish, but keep the appetizers and sides more simple. Aim for five ingredients or less. Sometimes I’ll roast radicchio, make a really nice balsamic fig reduction and then add some toasted pine nuts. Or use ingredients in two ways, like roasted carrots with carrot top pesto. Even without Parmesan and pine nuts, you can make a nice herby oil to drizzle. Finishing sauce is something that’s oily, acidic, that has a bit of a sweetness or a tang or even a bit of a spice to heighten it. It’s like a brooch for a dress—to complete a dish and tie everything together.”9. Don’t Fuss with Desserts or Wine Pairings“It’s been a long day of cooking. You’re tired. Don’t bother with baking. Grab a store-bought pastry from a bakery you can trust or make an easy chocolate mousse. In the summer, make whipped cream and serve with fresh berries—you won’t even need any plates or silverware. Lastly, let people bring whatever alcohol they want and don’t worry about wine pairings. There should be no rules at your dinner party, except for people to eat a lot and enjoy a long night where they feel like they could fall asleep at the dinner table at the end. Mood lighting helps with that.”How to build a cheese board like Queer Eye’s Antoni Porowski:Explore Bon AppétitDinnerPartyCelebritiesNetflixRead MorecookingThe $50 Dinner Party You Can Completely Make AheadBy Amiel StanekcultureWine Calculator: How Many Bottles of Wine Does Your Dinner Party Need?By Marissa A. RosscookingHow to Throw a Dinner Party Without a Kitchen TableBy Alex DelanycultureThe Secret to Throwing a Dinner Party with Zero StressBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-02", "author": ["Condé Nast", "Alyse Whitney"]}