{"id": "bcd317a43673935c7d6a6dc1aea7cc0f", "url": "https://www.bonappetit.com/story/spicy-fish-stew", "year": 2020.0, "month": 4.0, "day": 3.0, "content": "This Spicy Korean Fish Stew Recipe Is Super Easy to Make—and Even Better the Next Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Make This Spicy Korean Fish Stew When I Just Need to Sweat It OutA bowl of this is better than a virtual hot yoga class.By Paul WangApril 15, 2020FacebookTwitterEmailPhoto and Food Styling by Paul WangFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Koreans have an expression, “shiwonhada” (시원하다)—literally, “intensely refreshing and cooling”—that describes the sensation when you feel cool after eating something hot in temperature. Add spiciness to that party and you'll take shiwonhada to the next level. To me, the dish that perfectly captures this experience is the spicy fish stew called maeuntang (매운탕). There’s nothing better than dipping a spoonful of this spicy, savory stew into a bowl of steaming white rice.When I was growing up in Seoul, I remember my grandmother hurrying home from the local fish market to prepare this stew for our family. As she prepared the dish, its scent would waft through the house, making my stomach rumble. Because the current Stay At Home order has given me more time to revisit dishes that bring back fond memories, I recently committed my grandmother’s recipe to paper (with a few phone calls to my mother for moral support).The two components to the stew are broth and seasoning paste. To make the broth, take 2 pounds of cleaned whole fish (bass, perch, cod, pollock, or flounder) and cut into 2\" pieces, including the head. Cut about 1 pound Korean radish into bite-size slices. Add the fish and radish to a pot along with the whites of 1 leek, thinly sliced, 1 serrano pepper, thinly sliced, and a big pinch of dried anchovies (approximately 10 pieces). Cover with cold water (about 4 cups) and set over high heat. Once it comes to a boil, reduce your heat and let it simmer for 20 minutes.Everything you need for the broth.\nPhoto and Food Styling by Paul Wang While your broth is simmering, make the seasoning paste: In a bowl, add 2 tablespoons gochugaru, a couple turns of ground black pepper, ½ tablespoon soy sauce, 1 tablespoon fish sauce, 1 tablespoon doenjang or miso, ½ tablespoon gochujang, and 4 cloves finely grated garlic. Whisk it all together until it forms a nice paste. (I like to double up on this paste and save the other half to use in a pasta dish for a kick! The paste will keep in your fridge for up to two weeks. You’re welcome.)Now back to the broth: Once it’s been simmering for 20 minutes, gently strain out the pieces of fish into a separate bowl, leaving the fish head in the pot. Add your seasoning paste into the simmering broth and gently mix to disperse. Turn your heat to high and boil your broth for 15 more minutes. Remove the broth from from heat and discard of that fish head. Your liquid should now look like a velvety stew. Finally, take the fish you saved earlier and gently submerge them back into the stew. That’s it!You can eat it right then, but I will say that it’s so much better the next day, once all of its contents have had time to marinate overnight (a very crucial step in developing flavors in anything stewed). So consider making it for your future self. Put a lid on your stew and leave it overnight. (Don’t worry, it won’t go bad—Korean grandmothers don’t refrigerate stews.) The next day, bring it back up to a simmer for a few minutes and serve alongside a bowl of steamed rice. Insider’s tip: Taste the radish prior to heating the soup back up. I love sinking my teeth into the cool, marinated radish straight out of the pot.Most of the ingredients in the seasoning paste are shelf-stable pantry items that are great building blocks for many Korean dishes. You'll be able to find these ingredients at a local Asian market, which could really benefit from your business right now. Most have a seafood section in the back where you can choose your fish and they will generously clean it for you, so you don’t even have to get your hands dirty. But if you're trying to reduce trips to the store, here are a few substitution ideas (only if you must!):Instead of a whole fish, use 1 can of sardines in oil (add your sardines and the oil at the very end)Use a few extra dashes of fish sauce instead of dried anchoviesSlice up turnips in place of the Korean radishThere’s no other dish that makes my mouth water just at the thought, that brings a sense of togetherness with my family members who live thousands of miles away, or that gives that “shiwonhada” sensation. May it keep you cool and refreshed during this heated time.Paul Wang was one of the opening chefs at Nonesuch, BA's best new restaurant of 2018. He is currently working as a private chef in Seattle.Explore Bon AppétitIt's That SimpleFishKoreanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-15", "author": ["Condé Nast", "Paul Wang"]}