{"id": "bcdfc5a70e0ff0f93e507f54f5c7887c", "url": "https://www.bonappetit.com/story/summer-mood", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "A Summer Mood Board | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Summer Mood BoardLet these images from scorching hot summer’s past inspire the long weekend ahead.By Alex BeggsJuly 5, 2019FacebookTwitterEmailPhoto by Keystone/Getty ImagesFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.[Crickets]Is anyone even reading this thing? It’s a holiday weekend and hopefully you’re at the beach, or inside a freezing movie theater, or hosting an illegal lemonade stand. I won’t tell! And since no one’s looking, I put together a brief summer mood board for this week’s newsletter. Nothing links back to a Bon Appétit recipe, or teaches you a cooking tip, or reveals which BA staffer is a snow-cone-hating monster. And I definitely wrote this in the bathtub. My editor’s on vacation!!!Want this letter before it hits the website? Sign up for our newsletter!Photo by GraphicaArtis/Getty ImagesPhoto by BettmannDenver Post via Getty ImagesPhoto by Found Image Holdings/Corbis via Getty ImagesBettmannPhoto by Hulton Archive/Getty ImagesPhoto by GraphicaArtis/Getty ImagePhoto by Dr. Paul Wolff & Tritschler/Corbis via Getty ImagesPhoto by Underwood Archives/Getty ImagesJim Heimann Collection/GettyBettmann/GettyPhoto by Minnesota Historical Society/CORBIS/Corbis via Getty ImagesPhoto by WATFORD/Mirrorpix/Mirrorpix via Getty ImagesOkay, okay, here are some recipes:Drink a southside. Pass around slices of this tomato pie during cocktail hour. Grill some tamarind-glazed ribs. A side of ice water salad. Consider custard. Return to icebox cake. Make plans for cheese balls. Coat your insides with buttermilk ranch. And please don’t sleep on this GRILLED CABBAGE.Explore Bon AppétitBeggs NewsletterSummerRead MorecultureSummer Pies Should All Be Deep DishBy Alex BeggsLifestyleThe No-Brainer Corn Salad We’re Eating All SummerBy Aliza AbarbanelcookingHow to Pick the Right Charcoal for Your Summer GrillingBy Alex DelanycookingA Spritz Is My Only Summer Drink of ChoiceBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-05", "author": ["Condé Nast", "Alex Beggs"]}