{"id": "bcea453970fc74080ad1f96d32b820c1", "url": "https://www.bonappetit.com/story/how-to-find-your-amaro-soulmate", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "All About Italian Amaro, the Bitter Digistif That's the Perfect After-Dinner Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Find Your Amaro Soulmate (It's Out There!)Bitter or bittersweet? Medicinal or citrusy? Whatever your preference, there's a bottle for you.By Al CullitonApril 23, 2020FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailTired of cocktail recipes that call for expensive, obscure bottles and fancy-pants techniques? We got you. Welcome to Happy Hour with Al, a monthly column where Al Culliton, Basically’s resident bartender, sets you up to get the most bang for your booze with the fewest possible bottles.During this strange and difficult time, when I’m staying in except for weekly grocery shopping, I’ve gained a new appreciation for my liquor cabinet as a passport to far-away places. Today, I’d like to take you with me—and we’re going on a little jaunt to Italy. I’ll put on some Italian pop from the ’60s—like Mina, Gino Paoli, Ornella Vanoni—and set out a bunch of little glasses, each filled with a different Italian amaro. Suddenly I’ve turned my desk into a café table on a piazza. The sun’s shining and I’m watching the pigeons peck at crumbs on the cobblestones. Now imagine your fabulous outfit. I’m wearing a vintage knit polo and pleated linen trousers. Put on your shades, hop into my 1965 Giulietta, and let’s go!I’ve mapped out our trip to visit six different Italian regions, each the birthplace of a different amaro. Amari (that’s the plural of amaro) are digestifs, or digestivi in Italian, meant to be consumed after dinner, and can range from low-ABV (around 15%) to the ABV of a regular spirit (45%). Amari originated in the medieval monasteries of what is now modern-day Italy, where monks created healing and soothing tonics using roots, herbs, flowers, and spices. Amaro means “bitter” in Italian, and that quality pulls the whole category under one broad umbrella, though the level of bitterness can vary wildly. An amaro can be citrusy, herbaceous, floral, coniferous, medicinal, vegetal, earthy, savory, and so on. These flavors are imparted through the process of maceration and/or distillation of botanicals in wine or a grain spirit, followed often by blending and resting to synthesize the elements. Italians typically drink amaro neat after dinner, but you’ll learn a few other ways to enjoy it as we make our journey.The great thing about amaro is that all of the different personalities in the category make it a lot of fun to explore. If you’re not an expert in spirits, amaro might just be an ideal starter category for you. Unlike bourbon or Scotch, you don’t have to be an experienced spirits taster to understand the differences between the subcategories or individual products—they’re all quite distinctive. So let’s hit the road:Fernet-Branca: Minty, Medicinal, DivisiveWe’re going to start out in Milan with something bracing and strong. A lot of people think that fernet is a brand, but it’s actually a subcategory within amaro (Fernet-Branca, however, is a specific brand of popular fernet). Fernet is characterized by deeply bitter flavors, and sits at the high end of the ABV scale. The category’s flavor profile is medicinal (think aloe and eucalyptus) with intense menthol qualities. Because of its strong flavor profile, most people love it or hate it. But if you love it, you’ll love it forever (like I do).The “ferrari” is equal parts Fernet-Branca and Campari.\nPhoto by Laura MurrayBràulio: Coniferous, Alpine, AffableLet’s head northeast from Milan to the town of Bormio in the Alps to meet my favorite amaro of all time, Bràulio. (Probably the only brand to which I’d happily plead “sponsor me!”) Ask any of my friends and they’ll tell you that I serve it after dinner, drink it with espresso, and use it alongside rye in Old-Fashioneds and Whiskey Sours. Technically, Bràulio is part of a larger category of alpine amari, but it’s the only example of the genre that’s easy to find in the U.S. Bràulio exhibits flavors that play into the terroir of the region, pulled from pine, rosemary, juniper, and mountain roots and flowers. What you end up with is notes of spearmint, conifer and white flowers.Sfumato Rabarbaro: Smoky, Fruity, DarkHeading southeast from Bormio, we’re off to Aldeno in the region of Trentino. Fans of Mezcal and peaty Scotch will enjoy Sfumato Rabarbaro, an amaro from Distilleria Cappelletti. Rabarbaro is a subcategory of amaro made from the root of Chinese rhubarb, which gives it a smoky quality that comes not from how it’s made but from the plant itself. If you prefer more mild smoky flavors, the Milanese amaro Zucca is a bit gentler than Sfumato and gives you citrus notes and cardamom, too.Combine equal parts Bràuilo and Sfumato Rabarbaro and magic happens.\nPhoto by Laura MurrayCynar: Earthy, Herbaceous, VersatileJump back into the car and let’s head to Venice, the birthplace of Cynar (though it’s now produced by Milan-based Gruppo Campari). Cynar is the most famous and widely available carciofo, another subcategory defined around a key ingredient. This time it’s artichokes! It’s a delicious amaro with a savory, vegetal earthiness that amplifies its bitterness. This one’s low on the ABV spectrum at just 16.5%, which might be why it’s at home for both aperitivo and digestivo, i.e. before or after dinner.Try 1 oz. Cynar plus 1 oz. Laird's Applejack brandy.\nPhoto by Laura MurrayAmaro dell’Erborista: Bitter, Complex, ChallengingAnd speaking of bitterness, we’re going to go for the strong stuff as we drive south to Muccia, just an hour inland from the Adriatic coast. There, the fantastic Distilleria Varnelli produces one of the most bitter amari available, Amaro dell’Erborista. With notes of warming spice, dried fruit, and honey, it’s the perfect thing to drink after a big meal and it’s unfiltered, giving it a cloudy appearance and some sediment in the glass. The botanicals are fire-roasted before maceration, lending it a subtle smoky quality. (This distillery also produces excellent liqueurs, like their famous anisette, L’anice Secco Speciale.)Make a Little Ripper with Cynar, Meletti, or Averna.\nPhoto by Laura Murray, Food Styling by Rebecca Jurkevich Averna: Citrusy, Coca-Cola-Esque, BalancedFinally, we head all the way down to Sicily to try some Averna. This not-too-bitter amaro shows a pronounced flavor of orange peel along with vanilla and cola notes. It’s not part of any specific family of amari, but that combination of citrus and spice is common in many amari with light-to-medium bitterness. The citrus influence typically comes from bitter orange peels, and that flavor is often paired with spice notes of clove, cinnamon, chocolate, and root beer, among others. Other great examples of this loosely-defined group are Amaro Ciociaro and Ramazzotti. If you want to start out even lighter, I’d recommend the gentle, herbal Amaro Nonino or Amaro Montenegro. Our own Alex Delany calls Montenegro “TSA”, The Starter Amaro.Well, we’ve certainly added a few stamps to our amaro passports today. If you’re looking to branch out from neat pours, may I suggest the easy 1 oz. to 1 oz. mixtures below? They’ve been my go-to at home for the last few months, and the possibilities are endless—plus, there’s no way you can screw these up! Choose an amaro and pour 1 oz. into a small glass. Then search your liquor cabinet (maybe you’ve got Mezcal or Irish whiskey?) or fridge (that open bottle of vermouth or sherry?) and add 1 oz. of whatever you find to the amaro you poured. (You can even mix two amari together!) These are great with or without ice, and you can garnish with an orange slice, lemon twist, or Luxardo cherry if you like, but it’s not at all necessary. Here are a few 50/50 combos I love:Fernet-Branca + CampariSfumato Rabarbaro + BràulioAmaro dell’Erborista + Carpano Antica vermouthCynar + Laird’sGarnish equal parts Amaro dell’Erborista and Carpano Antica vermouth with a Luxardo cherry.\nPhoto by Laura MurrayAnd if you’re looking for a more complex cocktail, here are three easy ways to add dimension to your favorite cocktails with amaro:Amaro Old Fashioned: 1½ oz. aged rum + ¾ oz. amaro (try Sfumato) + 1 barspoon simple syrupAmaro Sour: 1¾ oz. rye + ¾ oz. amaro (try Bràulio) + 1 oz. lemon juice + ½ oz. simple syrupBlack Manhattan: 2 oz. bourbon + 1 oz. amaro (try Averna or Cynar)Cin cin!Al Culliton is a writer, bartender and consultant living in western Massachusetts. She is an alum of the beloved Red Hook bar and restaurant Fort Defiance and owns her own cocktail company, Al’s Bar. Al enjoys poring over menus and cocktail books from bygone eras, touring the New English countryside, and cooking for her partner at home.Explore Bon AppétitHappy Hour with AlRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Al Culliton"]}