{"id": "bcf03d4ff43cb84428681725509a5f1e", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/bells-and-whistles", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Bells and Whistles Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverBells and WhistlesA Fraserhood sports bar that doesn’t feel like a sports barFacebookPinterestTwitterEmailGrant HarderGO HERE: for Bells and Whistles’ extensive ever-rotating beer list and a solid food menu. Yes, the bar plays big matches on the huge screen behind the horseshoe-shaped bar, but unlike most sports pubs, that’s the only TV (and their nachos are legitimately good).ORDER THE: craft beer of your choice from their predominantly Canadian list (ask for something from Persephone or Dieu du Ciel; nachos grande, which easily makes for a saucy, meaty, cheesy meal for two; one of their half-dozen burgers served on a milk bun; and a marshmallows- and sprinkles-crowned soft-serve sundae.THE VIBE IS: noisy and casual, all the makings of a reliably good time. In addition to all the sporting events, there’s often live music and a games area in back (Skee-Ball!). Hot tip: There’s also a seating area entirely separate from the big screen.PRACTICAL STUFF: Open every day, from 11:30 a.m. to midnight, with weekend brunch served Saturday and Sunday, from 11:30 a.m. to 3 p.m. No reservations.—Lindsay AndersonGrant HarderGrant HarderWE ALSO LOVEGrapes & SodaKitsilano’s blink-and-you’ll-miss-it destination for cocktails and natural wine Explore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-14", "author": ["Lindsay Anderson"]}