{"id": "bcf20c2a6ecec9c6e1c26067e075b40d", "url": "https://www.bonappetit.com/story/the-final-table-netflix", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Watch a Clip from ‘The Final Table,’ Netflix’s New High-Stakes Cooking Competition | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWatch a Clip from ‘The Final Table,’ Netflix’s New High-Stakes Cooking CompetitionOur very own editor at large Andrew Knowlton hosts this global cooking show, featuring respected chefs from all over the world.By Alyse WhitneyNovember 20, 2018FacebookTwitterEmailAdam Rose/NetflixFacebookTwitterEmailGuess what? There’s another new cooking competition show hitting Netflix, but The Final Table (streaming in full today, November 20) has something others don’t: our editor at large Andrew Knowlton on hosting duty. In the new series from MasterChef creators Robin Ashbrook and Yasmin Shackleton, 24 acclaimed (and many Michelin-starred) chefs compete for a spot at the Final Table. What is that, exactly? A chance to sit as an equal amongst legendary chefs like Enrique Olvera of Pujol in Mexico City and Cosme in NYC; Grant Achatz of Alinea in Chicago; Clare Smyth of Core in London; and Yoshihiro Narisawa of Narisawa in Tokyo.The show starts with the 24 contestants paired into teams of two with former colleagues, friends, or a protege with their mentor. However, by the end of the series, only one chef will be crowned the winner, meaning that the teams will eventually be split up. Each episode centers around preparing a national dish of a country. For example, in the Mexico episode, chefs put their twists on tacos, and in the UK episode, they attempt variations on a full English breakfast; there are nine countries in total. The teams have one hour to shop from the well-lit mini grocery store (that has everything from whole suckling pigs to baskets of fresh truffles), cook, and plate. The bottom three teams then have to battle it out in the Final Plate Challenge, a last-chance, quick-fire second round, before one is eliminated.Formatting-wise, The Final Table combines various elements from several cooking shows. There’s a bit of Iron Chef (where Knowlton judged before, back when he had longer hair) with a massive, glitzy, stadium-like kitchen and a captive live audience; the elimination style is reminiscent of MasterChef (but with actual master chefs instead of amateurs); and the cinematography of sweeping overhead shots and close-ups of chefs intricately plating dishes have a Chef’s Table vibe. Knowlton provides commentary as he walks around to each chef’s station, learning about their personal history with the dish and how they plan to execute, while the judges observe from a sky-high balcony above the work floor.ContentThis content can also be viewed on the site it originates from.There are very specific parameters to exactly what chefs can cook on The Final Table. Each episode highlights one country’s national dish, decided by a food critic and two celebrity judges, presumably to give a more relatable experience to the viewer at home. In the exclusive clip above from the show’s fifth episode, comedian Hasan Minhaj (star of Netflix’s talk show Patriot Act), Indian food critic Rashmi Uday Singh, and actor R. Madhavan critique Amninder Sandhu (chef of Arth in Mumbai) and her teammate Monique Fiso’s (of Hiakai in Porirua, New Zealand) take on murgh makhani (aka butter chicken). The challenge for this dish was that it had to be vegetarian, so Chef Sandhu made paneer kofta meatless meatballs covered in the classic makhani gravy and served with amritsari kulcha (flatbread stuffed with paneer cheese and potatoes). They were the first to be judged on the India episode, setting the bar high for the other contestants later in the episode.Chef Amninder Sandhu (R) and chef Monique Fiso (R) were both familiar with Indian cuisine before joining the show.\nGreg Gayne/NetflixSingh was initially ready to be more critical of Sandhu because of their shared experiences with Indian cuisine, but the judge ultimately was so impressed by the dish that she couldn’t give anything but praise. This gave Sandhu goosebumps, and was an emotional high point of the episode as she was close to tears. A deep personal connection between judges and chefs isn’t seen often on competition shows, but certain moments of A Final Table are meant to tug at your heartstrings. You’ll have to watch the show (streaming in full today, November 20, on Netflix) to see who impresses Chef Vineet Bhatia in the Final Plate elimination challenge. And perhaps just as importantly, to find out what color pocket square Andrew Knowlton is wearing. Psst, it changes every episode.Explore Bon AppétitTvNetflixFood TVCelebritiesIndianRead MorecultureThe Indian-ish Grilled Cheese That’s Even Better Than Grilled CheeseBy Priya KrishnacookingThe Raita Formula I’ve Memorized for Yogurt Sauce SuccessBy Priya KrishnacultureRoti Is the King of All Indian BreadsBy Priya KrishnaButter ChickenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-20", "author": ["Condé Nast", "Alyse Whitney"]}