{"id": "bd0322ec25bfc581723fe727983743cc", "url": "https://www.bonappetit.com/story/claudette-zepeda-wilkins", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Claudette Zepeda-Wilkins on What It Means to Open a Matriarchal Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsClaudette Zepeda-Wilkins on What It Means to Open a Matriarchal RestaurantThe former Top Chef contestant is running the show at El Jardín in San Diego and still finding time for the gym.By Zan RomanoffJuly 26, 2018FacebookTwitterEmailPhoto courtesy of Becca PRFacebookTwitterEmail“If you don't mind, I'm gonna be turning pork cheeks while I talk to you,” Claudette Zepeda-Wilkins says on the phone. I’m surprised she has time to chat with me at all: It’s just 72 hours after the opening of her San Diego restaurant El Jardín, and a new restaurant tends to suck up a chef’s time and attention with black-hole-grade intensity.Luckily, as a chef and a mother, the former Top Chef contestant and San Diego native has plenty of practice at multi-tasking. She answered my questions about matriarchal cooking and Mexican regional cuisine with honesty, humor and warmth—and without missing a beat in the kitchen, I’m sure.The last time you were giving interviews, it was about your time on Top Chef. [Zepeda Wilkins competed on Top Chef Mexico’s first season in 2016 before becoming a contestant on the U.S. edition’s 15th season, filmed in Colorado.] What have you been up to between now and then?I'm super grateful for the experience. You become part of a family, for better or worse. You love to hate all your brothers and sisters; now I love them, and it's cool.When we were filming Top Chef Mexico, we had the crazy honor of meeting these women who are regional culinary ambassadors. They've been traveling all over the world, women that don't have gas and running water inside their homes, traveling to France and Russia to promote Mexican food. Meeting these woman solidified that we need to preserve something, whatever it is. If your roots are in food, preserve your roots.So I spent the last two years traveling to little remote towns and meeting amazing women. Some of them I'm fortunate enough to have a part of in the restaurant. I have the woven textiles from the women in Oaxaca and Chiapas in the lounge of El Jardín.The scene at El Jardin\nPhoto by Antonio Díaz de Sandi.You’ve called El Jardín ‘a matriarchal restaurant.’ Can you talk about what that means to you?I've gotten some comments—usually from guys—who aren't comfortable with me putting that word out there, matriarchal. I got one comment that said \"Oh, congratulations, you're putting women back into the kitchen, what a novel idea.” It's like, you're missing the point. The point is that we highlight the mothers and the grandmothers. A thing I learned from the women [I’ve met] is that if they have sons and not daughters, recipes that have gone generations and generations and generations will never be made again.Is there anything on the menu that you’re particularly excited about?My aunt had a restaurant in Guadalajara my entire life growing up. She raised six kids, a single mom, on the back of pozole. So that's one of my favorite dishes, not because it's pozole but because of my connection to it. I grew up at her restaurant cutting vegetables for it. It's near and dear to my family. I have my own spin on it, but the meaning of the dish is very special to me.A lot of the stuff you’re cooking with isn’t available in American supermarkets. How do you source your ingredients?My Oaxacan ingredients—things like the papilla mixe, which I use in the sauce for my tamal con mole poblano—are from a woman I met in Oaxaca at a market. She is tough as nails, crazy mean, but it's part of her magic, you know? She runs her stall like—imagine the busiest, craziest diner, and you have that salty waitress who has no time for nonsense—that's who she is. She's like an auctioneer in her soul.I also get pixtli, the pit of the mamey fruit, to flavor the ice cream in the No Mamey’s dessert, and rosita for the brunch chocoatole from her, plus tons of other stuff: chicatanas, chile costeño, piñon rosita.I really love pulque [a traditional Mexican alcohol made from fermented agave], so I asked one of my friends to introduce me to some of the men that siphon honey water from the agaves to make it. He took us to this super remote pueblo out by the volcano, and the person that ended up making the biggest impact on my life was his mom. I bought 40 pounds of her mole paste, which she made for me, for the restaurant.El Jardin's No Mamey’s with pixtli ice cream, almond brown butter cake and heirloom corn pinole crumb\nPhoto by Antonio Díaz de SandiWhat about San Diego was exciting to you as a place to open a restaurant?I grew up in Imperial Beach, which is near San Diego. I had my kids very young; I had my son when I was 18 and my daughter by the time I was 21. I understood that I couldn't move them around. I knew that my kids needed some sort of stability. When I worked for Gavin [Kaysen] here in San Diego, he went to New York to go work at Cafe Boulud and I was like, “I really want to go work with you over there.”I remember I stayed in Chelsea. I didn't have any money, so I stayed at a hostel right above a Subway restaurant. My room smelled like the Italian subway bread. To this day that smell takes me back.The head of hiring, she kind of dug it out of me that I had kids. She said, “Do you have anyone here?” And I said no, and she said, “You probably don't want to do this. It's going to be a lot of long hours, and you're never going to see your family.” I would’ve had to uproot everything. So [San Diego] became home base for the next 18 years.I love that El Jardin reflects not just the idea of matriarchal cooking, but also the realities of your life as a mother. Are your kids interested in the restaurant industry?My daughter's been here since [we opened]. She hasn't left. She's twelve years old, and she knows where all my tables are.We had a conversation with my general manager, as young moms do, talking about the struggle: When you open a restaurant, you're giving it your all. My daughter was overhearing this, and she's like, “You know, I didn't get it until the other day. But I get it now; I see how much we need to give to this place to make it work.” I kind of choked up a little bit.You’ve talked about how you power lift in your spare time. How did you pick up that hobby?I've always been kind of freakishly strong. I'm only 5'3, but I can lift a lot of things. I'm bottom heavy, like a lot of Hispanic women, so my legs are crazy strong.When I started doing CrossFit, I needed an outlet. We now have a little bit better understanding of the mental health issues that come with the territory of [being a chef]. I got into Olympic lifting, and then it was power lifting, because it was cool to be able to lift a keg over my head. Power lifting for me was my way to show off that side of me, that women can be little and mighty.One of my favorite people on earth is the lead singer of Black Flag [Henry Rollins]. He basically says, “A pound is a pound is a pound.” Iron will never lie to you; if it says one pound, it's one pound. It's the only thing that calls you on your shit. You think you're tough shit? That iron will tell you, \"Nuh uh, I don't think so.\" There's something really poetic and humbling about lifting weights.Explore Bon AppétitHealthyishChefsMexicanCaliforniaRead Moreculture\"You’re in a World Where the Rules Are Made by Men\"By The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-26", "author": ["Condé Nast", "Zan Romanoff"]}