{"id": "bd07d4ea6705ab8a4f8c7ef95cf30db4", "url": "https://www.bonappetit.com/recipe/strawberry-black-pepper-gandt", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Strawberry Black Pepper G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredStrawberry\nBlack Pepper G&TTiffanie Barriere shows us her own spin on a Bombay & Tonic with a strawberry and black peppercorn syrup for a sweet and spicy G&T.By BOMBAY SAPPHIRE® GINApril 3, 20213.7(3)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire3oz. premium tonic water2cups water1cup granulated sugar1cup hulled and chopped strawberries1Tbsp. black peppercorns, crushed1oz. strawberry black pepper syrup (recipe follows)LimePreparationStep 1Combine water, sugar, strawberries and crushed black peppercorn in a small saucepan. Cover and bring to a simmer for 5 minutes. Remove from heat and allow to cool. Strain off solids.Step 2In a large balloon glass, squeeze the lime into the glass, then add the strawberry syrup and Bombay Sapphire Gin. Stir. Fill the glass with ice. Add tonic, stirring as you pour. Step 3Garnish with strawberry and lime. Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Strawberry\\\nBlack Pepper G&T?Leave a ReviewTell us what you thinkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-03", "author": ["Condé Nast", "Bombay Sapphire"]}