{"id": "bd0bc546b2200b6c011be894dedc9b47", "url": "https://www.bonappetit.com/recipe/maple-glazed-doughnuts", "year": 2021.0, "month": 9.0, "day": 1.0, "content": "Maple-Glazed Doughnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMaple-Glazed DoughnutsBy Samantha SeneviratneSeptember 1, 20215.0(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat BoystovaEmailPinterestPrintEmailPinterestPrintThese light and fluffy yeasted doughnuts are coated with rich maple glaze for an effect reminiscent of a pancake breakfast. The key to making these—or Samantha’s Cardamom-Cream-Filled Doughnuts—is using a pot that’s deep enough to hold a couple inches of oil and still has another inch or two of empty space above it. Pro tip: Try to lay the dough into the oil gently before letting go so it slides right in and doesn’t splash! (Watch Samantha make the doughnuts here!) All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonDeep-Fry Thermometer$29 $16 At Amazon4\" Circle Cutter$7 At AmazonRolling Pin$13 At AmazonSpider$6 At AmazonAteco Bowl Scraper$3 At AmazonDutch Oven$80 At AmazonIngredientsMakes 10 plus holesDoughnuts¾cup whole milk1Tbsp. active dry yeast¼cup sugar, plus more3½cups (or more) all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt2large eggs2large egg yolks6Tbsp. unsalted butter, cut into pieces, room temperature, plus more for bowlGlaze and assemblyAll-purpose flour (for dusting)1cup pure maple syrup1cup powdered sugarPinch of kosher salt1–2Tbsp. whole milkSpecial EquipmentA 4\"-diameter and 1\"-diameter biscuit cutter; a deep-fry thermometerPreparationDoughnutsStep 1Heat milk in a small saucepan over medium just until warm to the touch (110°–115°). Transfer to a heatproof measuring glass. Top off with water to bring volume back to ¾ cup if needed. Immediately stir in yeast and a pinch of sugar; let sit until mixture begins to bubble and foam, about 4 minutes.Step 2Mix flour, salt, and remaining ¼ cup sugar in the bowl of a stand mixer fitted with the dough hook on low speed to combine. With motor running, pour in milk mixture, then add eggs one at a time, followed by egg yolks one at a time, mixing well after each addition. Continue to mix, scraping down sides of bowl as needed, 3 minutes. (Dough should be workable but somewhat sticky at this point. You can add a little more flour by the tablespoon if needed, but resist the urge to add too much; you don’t want your dough to be tough.) Add 6 Tbsp. butter, a piece or two at a time, mixing after each addition until incorporated. (You might have to stop the mixer and knead butter in by hand to get it started.) Increase speed to medium and mix until dough is smooth, supple, and elastic (it will still be a little sticky), 6–8 minutes. (Alternatively, if you don’t have a stand mixer, mix dough with a wood spoon in a large bowl, then knead in bowl about 6 minutes, dusting with additional flour if needed. Turn dough out onto a lightly floured surface and continue to knead by hand until smooth.)Step 3Lightly butter a large bowl and transfer dough to bowl. Cover with plastic wrap or a kitchen towel and let sit in a warm, draft-free spot until doubled in size, about 1 hour. (Alternatively, you can cover and chill at least 3 hours and up to 12 hours.)Glaze and assemblyStep 4Turn out dough onto a lightly floured surface and roll out to ½\" thick. Line 2 rimmed baking sheets with kitchen towels; dust towels well with flour. Punch out as many dough rounds as you can with 4\"-diameter cutter, then cut out centers with 1\"-diameter cutter. Transfer doughnuts and holes to prepared baking sheets. Gather scraps, reroll, and punch out additional rounds; transfer to baking sheets (you should have 10 doughnuts and 10 holes). Lightly cover with plastic wrap and let sit in a warm, draft-free spot until nearly doubled in size and dough springs back slowly when gently pressed, at least 30 minutes and up to 2 hours, depending on temperature of your room (watch the dough, not the clock).Step 5Just before you are ready to fry doughnuts, cook maple syrup in a small skillet over low heat until reduced by half, 6–10 minutes.Step 6Whisk powdered sugar, salt, and 1 Tbsp. milk in a small bowl until smooth. Whisk in reduced maple syrup and another 1 Tbsp. milk if needed. Glaze should be about the consistency of heavy cream.Step 7When ready to fry, line 2 rimmed baking sheets (or a few plates) with paper towels. Fit thermometer to sides of a medium heavy pot and pour in oil to come 2\" up sides. Heat over medium until thermometer registers 350°. Working with 2 doughnuts at a time and adjusting heat as needed to maintain temperature of oil, carefully slide doughnuts into oil with a spider or slotted spoon and cook until golden brown, about 2 minutes per side. Transfer to prepared baking sheets and let cool slightly. Working in 2 batches, repeat process with doughnut holes.Step 8Dip tops of warm doughnuts and holes in maple glaze and transfer to wire racks. Let sit to allow the glaze to set slightly before serving, about 3 minutes.How would you rate Maple-Glazed Doughnuts?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleOkay, I made these after having worked on a number of other doughnut recipes- mostly sourdough raised and sourdough cake style. This dough was WAY different: it was hyper stiff as compared to my previous doughs tending toward the extremely slack. The good news is that was way easier to work with and I was gratified to see it rose well in the fridge overnight. Super stiff out of the fridge, but still able to to roll it out with some muscle. Then I let them rise. With my cutter, I got WAY more than 10 doughnuts and 10 holes-- more like 18 each although I don't think it's that small a cutter, like I'm pretty sure it's about 4\" as the recipe calls for. ANyway- one sheet rose much better than the other (I have a small kitchen, and maybe one was on a warm side of the room?) They all fried up really nicely, but the puffier ones are a bit yummier. They also happen to be the wonkier ones from the multiple re-rolling of the dough (Could it be that they rose faster because the dough was more warmed up out of the fridge by the re-rolling and hand kneading back into a ball 2-3 times?) I made the glaze, although I turned out to only have about 2/3cup of maple syrup left, so I roughly reduced all the proportions. They look and taste amazing, especially fresh after cooling from the oil. I feel like a kitchen rockstar.KVLos Angeles1/17/2022Explore Bon AppétitDoughnutDessertMapleSnackBreakfastBakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-01", "author": ["Condé Nast", "Samantha Seneviratne"]}