{"id": "bd1bde3efd44fcf5d9feee92324736ef", "url": "https://www.bonappetit.com/story/extremely-french-carrot-salad", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "This French Carrot Salad Is the Simple Side That Goes With Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis “Extremely French Carrot Salad” Goes With EverythingCall it carottes râpées because grated carrots doesn’t sound quite as elegant.By Rebekah PepplerApril 8, 2021FacebookTwitterEmailPhoto by Joann PaiFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This carrot salad is everywhere in France. You can buy it by the kilo or prepackaged at boucheries and supermarkets. It’s on menus at both classic bistros and the kind of spots you walk into and think you’ve accidentally touched a Portkey to Los Angeles. The first time I had it was from a train station kiosk during an especially long transfer at the Gare d’Avignon en route to meet friends in Provence. I paired it with a croissant because, balance. It was fine (the croissant was better), but that’s part of the simple beauty of the Extremely French Carrot Salad or “carottes râpées” in French: It is at its best—and most cost-effective—when made at home.“Carottes râpées” translates to the decidedly less chic sounding “grated carrots,” and that’s mostly what it should be: grated raw carrots, lightly dressed with oil and lemon, a bit of cumin, and little else. If you want to riff, keep it uncomplicated: Use a mess of colored carrots, replace lemon juice with lime, up the cumin, or add in a touch of ground coriander.Making it is simple: In a medium bowl, whisk together 3 Tbsp. extra-virgin olive oil, 3 Tbsp. fresh lemon juice, 1 tsp. light honey, and ½ tsp. ground cumin. Season with salt. Add 1 lb. carrots, grated on the large holes of a box grater or in a food processor, fitted with a grating attachment, and toss to coat, adjusting the dressing to taste. Stir in ½ cup coarsely chopped flat-leaf parsley or cilantro and set aside to marinate for at least 30 minutes and up to 2 hours before serving.I made this salad many times throughout the process of writing my cookbook À Table, and I’ve become especially taken with its ability to pair with pretty much anything else on the table. It’s on the book’s cover alongside Coq au Vermouth (page 111), Salade Verte with Cornichon Vinaigrette (page 210), and, maybe predictably, very good butter, bread, and wine. In fact, I’ve eaten it as a meal alone with very good butter, bread, and wine. I love it paired with the Cider Pork (page 141). I eat forkfuls of it as bright, palate-cleansing breaks while eating the rich, cheese-heavy Croque Madame (page 169) or the equally rich Raclette, or Cheese Dinner with Carbs (page 171). I’ve eaten leftovers for lunch, standing fridge-side as a snack, and I’ve tucked it into Tupperware and brought it to picnic in Parc des Buttes-Chaumont or for apéro on the Canal Saint-Martin. And now that I know better, I pack it for every train ride to Provence.À Table: Recipes for Cooking and Eating the French Way$30 at Amazon$28 at BookshopRebekah Peppler is a Los Angeles– and Paris–based writer and food stylist.Adapted from ‘À Table’ by Rebekah Peppler with permission by Chronicle Books, 2021Explore Bon AppétitIt's That SimpleFrenchSaladCarrotRawRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-08", "author": ["Condé Nast", "Rebekah Peppler"]}