{"id": "bd23af0b6c9c832b5eefe36a007e6a30", "url": "https://www.bonappetit.com/city-guides/vancouver/venue/the-acorn", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "The Acorn Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginvancouverThe AcornFine-dining in Mount Pleasant that just happens to not include meatFacebookPinterestTwitterEmailTyson Fast GO HERE: for refined vegetable-forward cooking that showcases the best of what’s grown and foraged in British Columbia. This ain’t no hippy joint with cashews in everything; rather, The Acorn is fine dining that puts plants first.ORDER THE: dishes heartily built around singular ingredients, like the simply titled “morel” with wild greens, fried cauliflower, pickled morels, sautéed morels, and red wine jus, and the beer-battered fried Halloumi, a dish so popular it’s the only one that survives the menu’s seasonal upheavals. Otherwise, consult your server on what’s current and fresh. If you’re new to the West Coast, take advantage of the restaurant’s forest-centric cooking (you’re unlikely to find candied lichen elsewhere) and its truly British Columbian ingredients, like blushy salmonberries and Haida Gwaii kelp.THE VIBE IS: artfully clad 30-somethings in a stylish room with dark-wood detailing. Not particularly kid-friendly, as you might imagine.PRACTICAL STUFF: Open Sunday to Thursday, from 5:30 p.m. to 10 p.m. (bar service until midnight), and Friday to Saturday, from 5:30 p.m. to 11 p.m. (again, with bar service until midnight). Brunch is served Saturday and Sunday, from 10 a.m. to 2:30 p.m. Reservations are available for groups of six to eight guests, otherwise walk-ins are welcome.—Lindsay AndersonSean DavidSean DavidWE ALSO LOVEBurdock & Co.A Mount Pleasant go-to that shows off the best of British Columbia33 Acres BreweryCalifornia meets the Pacific Northwest and the result is this breezy Mount Pleasant breweryDon’t Argue! Very good pizza and people-watching at this casual Mount Pleasant jointExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-09-14", "author": ["Lindsay Anderson"]}