{"id": "bd269baac42e19bc4b0fb9f3e97bf876", "url": "https://www.bonappetit.com/recipe/soba-noodles-with-crispy-kale", "year": 2019.0, "month": 8.0, "day": 2.0, "content": "Soba Noodles With Crispy Kale Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2019 IssueSoba Noodles With Crispy KaleBy Heidi SwansonAugust 13, 20194.6(72)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Michelle GattonEmailPinterestPrintEmailPinterestPrintHeidi Swanson, the vegetarian cookbook author and blogger behind 101 Cookbooks, is behind this hearty weeknight noodle bowl. The nutritional yeast acts like a vegan version of parm, adding a hit of umami flavor that plays well with bitter kale and earthy buckwheat noodles. We suggest using curly kale, which roasts into light, crispy chips, instead of Tuscan.Ingredients4 servings1medium bunch curly kale, ribs and stems removed, leaves coarsely chopped (about 4 cups)1¼cups unsweetened coconut flakes⅓cup nutritional yeast½tsp. kosher salt, plus more2Tbsp. plus ½ cup extra-virgin olive oil8oz. dried soba noodles3Tbsp. tahini2Tbsp. plus 2 tsp. soy sauce1Tbsp. honey2tsp. toasted sesame oil, plus more for drizzling½tsp. crushed red pepper flakes, plus more for serving1limePreparationStep 1Place racks in upper and lower thirds of oven and preheat to 375°. Toss kale, coconut, nutritional yeast, ½ tsp. salt, and 2 Tbsp. olive oil in a large bowl to coat. Divide mixture evenly between 2 rimmed baking sheets and roast, tossing and rotating baking sheets halfway through, until kale is crisp and coconut is golden brown, 15–20 minutes.Step 2While kale is roasting, cook noodles in a large pot of boiling water according to package directions. Drain and rinse under cold running water. Shake off any residual water and place noodles in a clean large bowl.Step 3Combine tahini, soy sauce, honey, 2 tsp. sesame oil, ½ tsp. red pepper flakes, and remaining ½ cup olive oil in a small bowl. Finely grate zest from lime directly into bowl; halve lime and squeeze in juice (about 2 Tbsp.). Whisk dressing until smooth, then pour about half of it over noodles; toss to coat.Step 4Add half of kale mixture to noodles and toss to incorporate. Drizzle in more dressing as needed, tossing until noodles are creamy; season with salt. Pile remaining kale on top. Drizzle with additional sesame oil and sprinkle with more red pepper flakes.How would you rate Soba Noodles With Crispy Kale?Leave a ReviewTell us what you thinkReviews (36)Back to TopTrianglei make this almost once a week- it's one of my favorite dinners. i use shredded coconut instead of flakes, only 1/4 cup oil for the sauce, and generously sprinkle the finished plate with gochugaru flakes. once full, i dunk my colander in ice water, gently separating the noodles, and that keeps them from getting slimy. crispy curly kale is heaven but dino works in a pinch.moonbeamsanta cruz, ca1/9/2022This was a winner. Followed the recipe. Shortened the time in the oven to 10 minutes, but everybody loved it. AdelbertChicago IL9/19/2021After making this the first time, I immediately ordered more soba noodles and tahini, to be sure I can make this wherever the craving hits. It's unlike anything else I've ever tasted, and I just love it. That said, I do make the dressing with only 1/4 c oil, which is plenty for me. HalleSeattle4/12/2021All the people talking about slimy noodles - why are almost all soba noodle instructions on the package so wrong? You should never cook soba noodles for more than three minutes, some say that you should boil the water and turn it off before putting the noodles in the pot. Then they should be at the very least rinsed in cold water, or better yet - drain and submerge in ice water for a minute. You will never have slimy noodles again! Otherwise, delicious recipe - definitely will enter my regular rotation. Lisa GAlexandria, VA3/3/2021I get that some people find this combination odd - the noodles are slightly slimy with really crispy and sort of cheesy tasting kale and coconut -  but I really like it. So long as I remember to keep stocked up on coconut flakes all the ingredients are things I normally have around so its an easy addition to the repertoire. My experiments to substitute the type of noodles have been unsuccessful though - far too slimy with rice noodles. AnonymousLondon, UK1/4/2021Yum! This soba noodle salad was an excellent lunch and seems as though it will keep for at least a couple of days as leftovers. I omitted coconut flakes, purely based on the fact that I didn't have any on hand, but threw in some crispy onions to keep a good crunch. Very creative way to enjoy soba noodles and get your greens in.KristyWashington, DC11/16/2020This SUPER tasty! Highly recommended, and of course is great with crispy tofu. I've made it with and without the coconut depending on whether or not I have some handy, and I definitely recommend with—if you don't have coconut, consider subbing it for something else crunchy. The texture is fantastic! Definitely putting this in my regular meal rotation.\n\nOne thing I will say is that the noodle sauce can turn out really oily. I made it once and felt it was perfect, but the second time it was especially greasy and I had a hard time keeping the sauce from splitting (I would have to re-whisk it a bunch to get it to recombine). Not sure what the deal with that was, but in the future I would maybe even halve the olive oil, or even just add a little at a time to get it the right volume and consistency.wizardlingBerkeley, CA10/8/2020This recipe was SO good! I didn't have coconut flakes, but used about 3/4 cups of unsweetened shredded coconut. I toasted the shredded coconut separately, as I was worried about it burning.  I also reduced the oil in the dressing from 1/2 cup to 6 tablespoons (2 tbsp shy of 1/2 cup). Next time I'll add some crispy baked tofu as well.  I loved the brightness the lime adds to the dressing. I'll definitely be making this again!AnonymousOntario, Canada8/9/2020Amazing. One of the best things I've ever made and a something different to add to the dinner rotation. Highly recommend!!! AnonymousLos Angeles7/29/2020The sauce was too oily for me and the kale + soba was an odd combo. Overall, not into it. Anonymous7/18/2020AMAZING ! !!!! I learned a soba noodle recipe just like this in my middle school cooking class years ago and haven't found a better one since. Had basically all the same ingredients plus rice vineager in the sauce and ginger. Highly recommendAnonymousBerkeley, Ca5/27/2020Great for a packed lunch or midweek mealAnonymousMiami, FL5/24/2020I love this recipe, my boyfriend loves this recipe and asks for it all the time. I’m planning on making the kale tonight as a side for our veggie burgers. My main problem is I have a hard time getting my coconut to turn out right. It usually gets a little too done, but I don’t really mind it. AnonymousPortland, OR5/21/2020We eat an oil-free plant based diet and this recipe was recommended by friends who don't.\n\nI substituted aquafaba (the liquid form canned chickpeas) as follows: \n\nTossed the kale with 3 Tbsp aquafaba to coat.  Mixed the coconut, salt and nutritional yeast together than added to the coated kale and tossed to incorporate.\n\nUsed aquafaba in place of both sesame oil and olive oil in the sauce and added in 1 Tbsp toasted sesame seeds.\n\nThis was OUTSTANDING!!  Will definitely be making this again.loves2cookfor6Chicago5/11/2020I love this recipe. I love the nuttiness and creaminess of the sauce and the texture of the noodles. Very good. AnonymousDenver, CO3/30/2020Explore Bon AppétitSoba NoodleNoodlePasta & NoodlesKaleLeafy GreensVegetableNutritional YeastOther IngredientsQuickEasyWeeknight MealsMainDairy-FreeVegetarianHealthyishRoastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-13", "author": ["Condé Nast", "Heidi Swanson"]}