{"id": "bd2a1ffa1af4a369a4f0c095d2bd059f", "url": "https://www.bonappetit.com/story/hoosier-mama-savory-pie", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "Hoosier Mama Pie Shop Turned Me Into a Savory Pie Guy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Pie Shop That Turned Me Into a Savory Pie GuyAfter sinking into Hoosier Mama’s gravy-laden, flaky crust-covered pies, I finally saw the light.By Jesse SparksJanuary 2, 2020FacebookTwitterEmailPhoto by Brad SnyderFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.If I had to choose between a sweet or savory pie, the old me would always go sweet. No exception. They were what I knew best. After years devouring them, I synonymized the subtle sharpness of mace in my grandmother’s sweet potato pies and the deep warmth of my mother’s cinnamon-tinged apple pies with the pinnacle of comfort. I was so fond of the sweet stuff that I didn’t feel any real need to explore the world of savory pies. But that all changed once I stepped into Hoosier Mama in Evanston, Illinois.During my freshman year of college, right as the temperatures began to plummet below zero and the distance from my home in Houston started to feel real, I stumbled upon owner Paula Haney’s Chicago-based mini chain. I found it during a delicate time in my life, a time when so many of my peers were reimagining themselves for an entirely new environment. But while they dyed their hair or picked up a new hobby, I chose to rebrand myself in a very specific way: As a savory pie person. That fateful, frigid day, I ordered Hoosier Mama’s chicken pot pie and never looked back.The pie arrived in a flaky double crust laced with fresh thyme. Inside was shredded dark meat, tender from simmering in a rich cognac-spiked stock, and delicate bits of onions, carrots, and sweet peas, all swirling in a silken, peppery béchamel. Warming and complex yet familiar and approachable, it was a pie that was new and exciting and made me forget all about my sweet tooth.Over the next three and a half years, I became a regular at Hoosier Mama, trying a new pie, from the smoky barbecue pork pie to the warming curry lamb one, every time a visited. With each first bite, I couldn’t help but laugh at myself. I had been missing out on savory pies for so long. I know better now.Go there: Hoosier MamaExplore Bon AppétitHighly RecommendRestaurantsChicagoPot PieRead MorecookingPuff Pastry Exists To Make You Look Very Impressive By Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-02", "author": ["Condé Nast", "Jesse Sparks"]}