{"id": "bd31fb116b404686742024e61d845902", "url": "https://www.bonappetit.com/recipe/honeydew-jicama-and-mango-salad", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Honeydew, Jicama, and Mango Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueHoneydew, Jicama, and Mango SaladBy Anna StockwellMay 21, 2019EmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintDon’t worry about removing all of the melon seeds in this take on the popular Mexican street snack—they’re edible and add a little crunch.Ingredients4–6 servings ½small honeydew or Snow Kiss melon (about 1½ lb.)1small or ½ large jicama (about 14 oz.), peeled, thinly sliced into rounds1ripe but firm mango, peeled, thinly sliced¼cup fresh lime juiceKosher saltTajín Clásico seasoning and lime wedges (for serving)PreparationStep 1Using your hands, pull out some seeds from melon half (you don’t want to ruin the round shape of the inside by scooping with a spoon). Place a cut side down and remove rind by slicing down along the curve of the melon with a sharp knife, rotating as you go.Step 2Using a mandoline or a sharp knife, thinly slice melon into rings.Step 3Toss melon, jicama, and mango on a platter with lime juice; season generously with salt. Sprinkle with Tajín, and serve with lime wedges and more Tajín.How would you rate Honeydew, Jicama, and Mango Salad?Leave a ReviewTell us what you thinkExplore Bon AppétitSaladMexicanLatin AmericanHoneydewMelonFruitMangoStone FruitJicamaVegetableSummerSpringSideStarterDairy-FreeGluten-FreeNut-FreeRawVeganVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Anna Stockwell"]}