{"id": "bd32e162275db6ef299405b6be928652", "url": "https://www.bonappetit.com/recipe/raspberry-mint-gandt", "year": 2021.0, "month": 4.0, "day": 1.0, "content": "Raspberry Mint G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredRaspberry Mint G&TJoseph Stinchcomb shares his special take on a classic gin & tonic with raspberry simple syrup, muddled mint, and lime juice for a super refreshing G&T.By BOMBAY SAPPHIRE® GINApril 3, 20214.7(4)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½oz. Bombay Sapphire5mint leaves3oz. premium tonic water1cup granulated sugar1cup raspberries1cup water¾oz. raspberry syrup (recipe follows)½oz. lime juiceRaspberries and a mint sprig, for garnishPreparationStep 1To make raspberry syrup, add 1 cup of water, 1 cup of sugar, and 1 cup of raspberries to a pot. Step 2Bring to a simmer for 3-5 minutes. Allow to cool. Strain off solids.Step 3Gently muddle mint in glass with raspberry syrup and lime juice. Add Bombay Sapphire Gin and top with tonic water. Give a little stir to incorporate mint throughout the drink.Step 4Garnish with raspberry pieces and mint sprigs.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Raspberry Mint G&T?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleCould i use strawwberrys instead of raspberries????MissyPhiladelphia  Pa4/4/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-03", "author": ["Condé Nast", "Bombay Sapphire"]}