{"id": "bd3675e91fc177b040ae2428e1777c9b", "url": "https://www.bonappetit.com/story/ravenous-pig-orlando", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "The Ravenous Pig Is Orlando’s Mickey Mouse-Free Restaurant Oasis | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Ravenous Pig Is Orlando’s Mickey Mouse-Free Restaurant OasisAll preconceived tourist trap or “Florida man” notions you might have of Orlando, and Florida in general, go out the window once you enter the restaurant.By Jason DiamondJune 6, 2018FacebookTwitterEmailCourtesy of the Ravenous PigFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.When I lived in South Florida in my early twenties, I would sometimes suffer the four-hour drive to the theme park capital of the world—Orlando—to visit friends. At the time, I was convinced the only things they ate in that town came from diners or whatever they served in the Magic Kingdom. Denny’s was the only non-Disney restaurant to sit, talk, and eat. I was sure of it.That is, until I discovered the Ravenous Pig in nearby Winter Park, 15 years after I moved away.  It felt like the one place within a nearly 20-mile radius where you couldn’t find a pair of Mickey Mouse ears and didn’t see the Disney logo everywhere. In a city where the lunch and dinner options feel limited to the Biergarten at Epcot, Publix subs, and yes, Denny’s, the bustling James Beard–nominated restaurant and brewery is there for the year-rounders. All preconceived tourist trap or “Florida man” notions you might have of Orlando, and Florida in general, go out the window once you enter the restaurant.I first happened upon the place when I needed somewhere to regroup by myself with a stiff drink and a bite to eat. Not long after I sat down at the bar, I was served up a formidable Black Angus short rib and brisket burger topped with a smattering of crisp lettuce, tangy blue cheese, and caramelized onions. The whole thing was laid out on a slab of pinewood accompanied by a small cast-iron skillet filled with crispy fries. I drank two gin and tonics on tap. At some point, before switching to wine, I made friends with the bartender, then the people next to me. Everybody at that bar, it seemed, wanted to talk.Opened in 2007 by husband-and-wife duo and Orlando-area natives Julie and James Petrakis, the Ravenous Pig is full of locals ranging from university professors to Orlando Magic players. You could sit in the handsome dining area with the white linen tablecloths, but the long bar is the place to be. While the food is definitely the best I’ve had in the area, the variety of clientele is why I keep returning.During that first visit, a pair of 80-somethings struck up a conversation with me. The husband spoke with a mid-Atlantic accent, like a Roosevelt or George Plimpton, but claimed his family settled in central Florida at some point during the early 20th century, lured by all the warm air and sunshine promises of a better life. He could remember before Walt Disney set up shop and when Jack Kerouac had lived in the nearby neighborhood of College Park toward the end of his life. The wife rattled off a number of fascinating locations all over the globe where they could have moved, but they chose to stay in Orlando to raise their kids and retire there. Yet after all that, the man looked around the bar and said, “I’m glad a place like this opened up,” with a wide smile.Jason Diamond is the deputy editor of Punch.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Jason Diamond"]}