{"id": "bd38c06b8ee82821ff8a84595ce038f0", "url": "https://www.bonappetit.com/story/hope-and-work", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "Healthyish Newsletter: Hope and Work | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHope and WorkElection day thoughts from Healthyish editor Amanda ShapiroBy Amanda ShapiroNovember 8, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish humans,Yesterday I ran around in the pouring rain, from the gym to a coffee meeting to my polling place to the Brooklyn neighborhood of Bay Ridge, where I spent the afternoon and evening knocking on people's doors. It was something I should've done a lot sooner this election season. If I had, I would've remembered what a simple and powerful choice it is, to show up in a place where the stakes are high, to stand face-to-face with people (or, uh, their closed doors), and talk about the most basic civil right we have: the right to vote.Election Day is the easiest time to canvass because it's not the time to argue or convince. I spent my hours talking to registered Democrats, asking if they had a plan to vote, if they knew where to go, if they needed help getting there. By 7 p.m., the people answering their doors had mostly voted already. A lot of them were excited and hopeful. They offered me water and asked where the Gounardes campaign would be celebrating that night.Bay Ridge is not the Brooklyn that most people think of when they hear the word. It's whiter and wealthier than the NYC average. It's a small town in the big city with the politics to match. Being there was a reminder that \"the other side\" is never as far away as we think. It's in our boroughs, our counties. It's a short drive or a train ride away.I don't say this in a threatening way; it's actually empowering to do the work in your own backyard. In recent weeks, New Yorkers flooded Bay Ridge to campaign for two Democrats, Andrew Gounardes and Max Rose. And, last night, both of them won, both unseating Republican incumbents. On a night filled with disappointing news out of Texas, Florida, and North Dakota, these two victories—not to mention Alexandria Ocasio-Cortez's—gave me hope.Today I've been thinking about Eva's tweet, Erika's post, and Zan's newsletter. For what it's worth, I voted in my grandmother's black trench coat, and it was no match for the rain.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyish NewsletterRead MoreLifestyleThe Keto Diet, Sweet Potato Season, and the Perks of VotingBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Amanda Shapiro"]}