{"id": "bd3989a4a1fd43b64f56d514881465aa", "url": "https://www.bonappetit.com/story/instant-pot-tomato-soup", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "This Instant Pot Tomato Soup Is Liquid Luxury Without Any of the Labor | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Instant Pot Tomato Soup Is Liquid Luxury Without Any of the LaborJust when you thought the OG couldn’t get any easier.By Jesse SparksMarch 1, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailIf you’ve been following along with us, then it’s no secret that we at Bon Appétit love to riff on classic recipes—you know, the ones you take for granted because they’ve always been there for you. Take, for instance, cozy, comforting tomato soup: We’ve used roasted tomatoes and topped it all with hunks of crusty bread, packed the broth with cream, drizzled it over buttery grilled cheese, dressed it up with melty pecorino and vibrant arugula, made it suitable for summer with peak produce, and on and on and on. But sometimes, all you want is the good old OG, maybe made slightly easier.Lucky for us, Carla Lalli Music created an Instant Pot Tomato Soup that captures the timeless excellence of the staple, all with a little bit less of the fuss.Using her eponymous recipe as a base, Carla set out to make a robust version that didn’t require the babysitting of a stove-top preparation—that means no stirring, no scraping the pot, no worrying about evaporation. Instead, this version draws on canned tomatoes and tomato paste for a double dose of tomato-y flavor, plus fennel, smoked paprika, and cayenne to bring a lightly sweet and smoky depth. Just sweat the veg for about 10 minutes right in the pot, then lock it down, and forget about it for another 12 minutes while the pressure does the work for you. Hit it all with an immersion blender at the end and finish with a swoosh of heavy cream or a dollop of greek yogurt for some extra velvety goodness. The end result will make you wonder why you ever needed any of the frills in the first place. (Though a grilled cheese sandwich does pair nicely.)Ultimately, it’s quick, comforting, but most importantly, it tastes like everything you loved about tomato soup to begin with. No substitutions, no gimmicks. Just as a classic should be.Get the Recipe:Instant Pot Tomato SoupA straight-down-the-middle, nostalgic-tasting tomato soup with long-cooked flavor and a short cook time.View RecipeExplore Bon AppétitSoupRecipeTomatoCanned TomatoesInstant PotRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-01", "author": ["Condé Nast", "Jesse Sparks"]}