{"id": "bd39a08ec6a748f40ac614ffc4251492", "url": "https://www.bonappetit.com/story/what-is-carbonic-maceration-in-wine", "year": 2018.0, "month": 7.0, "day": 3.0, "content": "What Is Carbonic Maceration in Wine, and Why Does It Taste So Damn Fun? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhat Is Carbonic Maceration in Wine, and Why Does It Taste So Damn Fun?This fermentation technique makes zippy, juicy wines that we can’t stop drinking.By Marissa A. RossJuly 16, 2018FacebookTwitterEmailPhoto by Tim Graham/Getty ImagesFacebookTwitterEmailTrying to explain carbonic maceration is like trying to explain a song you heard on the radio when you have no idea who sang it or what they were singing about or why you even enjoyed it. The song was just upbeat and felt good. Does that sound kind of like the light red wines you’ve been loving with that fruity, poppy quality you can’t quite put your finger on? Yep. That’s carbonic maceration, the pop music of wine fermentations.Like any Top 40 hit, carbonic maceration follows a formula. Most wines are made by picking the grapes, stemming those grapes, crushin’ dem grapes, and then putting the juice in steel fermentation tanks before aging the juice in the winemaker’s vessel of choice (oak, concrete, amphora, etc.). But with carbonic maceration, a winemaker skips stemming and crushing and instead puts full bunches of grapes into steel fermentation tanks that are sealed and filled with carbon dioxide, creating an anaerobic atmosphere without any oxygen. Minus the oxygen, fermentation—yeast eating sugar and producing alcohol—begins inside the individual grapes. Eventually the grapes end up crushing themselves under the weight of the alcohol they are producing. The result is an irresistibly juicy fruit-forward wine with bright acidity, low tannins, and a snap-crackle-pop Rice Krispies texture that is meant to taste fresh and be drunk young.If carbonic maceration rings a bell, then chances are you’ve had a few bottles of Beaujolais. The French region may have popularized the method but confining it to Beaujolais and Gamay would be like saying pop music applies only to the 1950s rock ’n’ roll that started the craze. These days Drake can be just as poppy as Ariana Grande. You can get carbonic Cabernet Francs from the Loire, carbonic Valdiguié from California, and even carbonic white wines such as Trebbiano from Umbria. It can be used in any region with any grape variety.Wine is constantly evolving though, and the practice of carbonic maceration is no exception. There are also semi-carbonic wines; wines that are put through carbonic maceration for only a short period before going through the more traditional fermentation, typically in steel tanks without carbon dioxide. You might also hear the term whole cluster, which means that full clusters of grapes were fermented but not in a sealed tank pumped with CO₂. These wines are exposed to more native yeasts, giving them more complex flavors and a better expression of terroir. I’ve been in cellars where dudes are doing whole cluster in a fiberglass tank covered with only a tarp. Even though carbonic maceration is formulaic, it’s like any other style of winemaking in that a winemaker has tons of options and ways to make that wine unique and their own.Read more about Beaujolais and wine vintages here.\nStephen LewisCan you taste the differences between carbonic, semi-carbonic, and whole cluster wines? It depends. I compared a semi-carbonic Beaujolais Gamay, a fully carbonic California Zinfandel, a whole cluster Jurançon Noir from Cahors. They each have slight differences based on their variety and region—the Beaujolais Gamay is lighter, the California Zinfandel is punchier, the Cahors Jurançon is heavier. Whole cluster definitely offers more flavor, but overall these wines are still fruity, poppy, and downright juicy.This is why carbonic maceration, like pop music, has its haters. A lot of people think it’s formulaic and lazy, that it strips the wine of any original expression of terroir and leaves a singular, fruity, juicy, Fun Time USA flavor. And it’s true. Many carbonic wines do taste similar because during fermentation the grapes and their juice are sealed off from their natural environment; whereas pressed grapes and their juice are fermented in open tanks and receive oxygen, native yeast, and other bacteria that can all enhance the wine’s flavor. Carbonic maceration is also a safe way to make wine because you’re less likely to experience flaws from those same outside influences, which circles back to some critics considering it lazy.And I agree. It can be formulaic, and it can be lazy. But here I am, a person who prizes terroir-driven wines whose taste transports me to another place, with three bottles of carbonic wines in front of me and I am not mad about it one bit. Because here’s the deal—carbonic wines are delicious. I want to drink these, I want to share these with friends, and I want to have fun, which is what these wines are for. And just because something is fun doesn’t mean it isn’t good. It’s called pop for a reason, so if you dig it, drink it.Read more: Making Wine With Yoda, Danilo MarcucciMarissa Ross is the author of Wine. All the Time. Pick it up on Amazon for $14 and read more of her wine columns for Bon Appétit here.Explore Bon AppétitWineFermentationRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-16", "author": ["Condé Nast", "Marissa A. Ross"]}