{"id": "bd46ea4ad381df44abb18ff4856dda87", "url": "https://www.bonappetit.com/story/slab-pie-is-for-crust-lovers", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "Slab Pie Is For Crust Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSlab Pie Is for Crust LoversI’d never met a pie crust that didn’t stress me out—then I tried this magnificent creation.By Mehreen KarimJuly 20, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailWhen I need to clear my mind and fill my stomach, I stress-bake. After a tedious day there’s nothing that heals my soul more than making dessert into the late hours of the night while New Girl reruns play in the background. But some recipes are better candidates for a stress-baking session than others. The techniques employed must induce joy and offer a hefty return on investment. Kneading milk bread dough? Therapeutic. Folding egg whites into a chiffon cake? Pure catharsis. Pressing cold butter with my hot hands into flaky pie dough? Yeah, not so much. For that reason, pie has just never been something I turn to when I’m trying to relax. Because let’s face it, pie crusts—arguably the best part of any pie—are finicky and technical, requiring just the right touch and a carefully-followed recipe. I never thought I’d see the day where baking a pie brought me peace and good vibes only—that is, until I gave Samantha Seneviratne’s slab pie a chance.I can hear you thinking, “slab pie…?” Just imagine a Pop-Tart as vast as your sheet pan, but made with decadent, flaky pie crust instead of the crumbly processed stuff. Straightforward and stress-free, it’s as if this recipe was designed for bakers, like myself, who feel like they’d been personally victimized by pie dough in the past. Upon learning that the dough comes together in a food processor, I exhaled a resounding sigh of relief and watched as a butter-studded dough came together in just a few minutes. No fuss pie crust? I was sold.The second best thing about this crust is how unbelievable the filling tastes with it. Sam’s ingenious blackberry and apricot filling has no chance of sogging up the pie because it’s pre-cooked and utilizes dried apricots rather than fresh ones. They’re the key to this fruity pie’s supple and, well, apricot-y flavor that you simply cannot achieve with the fresh ones. And now that I’ve been enlightened, I wouldn’t have it any other way.The recipe calls for cooking the chopped dried apricots in a bath of dry white wine, a vanilla bean, and its scraped seeds. (Since I don’t drink alcohol, I used grapefruit juice instead.) Bath and Body Works should bottle the aroma that filled my house as vanilla commingled with the fruit. Heaven! Once the dried fruit was plump and saucy, blackberries joined and offered their puckery juices to the party. Lucky for me, the recipe yielded more than enough fruit filling for me to sneak in as many “just a little taste” bites as my heart desired.The assembly was a no-brainer. Crust, filling, crust. And a fork to seal the sides shut. No lattice? No problem. (Just remember to cut a few vents on the top layer of pie dough to prevent Mount Blackberry from erupting.)Once baked and cooled, I prepared to offer the finished pie to my husband and his group of very hungry friends. But once I snuck myself a bite of warm crust painted with apricot-blackberry sauce, I shamelessly bailed on all my plans to share. The crust had baked to golden brown perfection and was sturdy enough to hold the heaps of fruit filling in place—even as I walked around my apartment with a slice in hand. When I asked Sam how she landed on her impeccable crust to filling ratio, she told me she believes that “the crust is as big a player as the filling.” Retweet, Sam, retweet. Now that I have these pie tricks up my sleeve, I’m proud to announce that my “Sweets to Make When Stressed” Google doc now hyperlinks this slab pie recipe right at the top.Get the recipe:Blackberry and Dried Apricot Slab PieA craveable, shareable, crowd-pleasing pie for every summer picnic and party.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-20", "author": ["Condé Nast", "Mehreen Karim"]}