{"id": "bd5d2e4fd12078bb1c3f8cf75e71a638", "url": "https://www.bonappetit.com/story/cranberry-sauce-indian-thanksgiving-staple", "year": 2018.0, "month": 11.0, "day": 2.0, "content": "How Cranberry Sauce Became a Staple of My Indian Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Cranberry Sauce Became a Staple of My Indian ThanksgivingIn my family, there’s no better accompaniment to matar paneer and puri than jammy cranberries.By Priya KrishnaNovember 8, 2018FacebookTwitterEmailIllustration by Jan BuchczikFacebookTwitterEmailMy Thanksgiving bears very little resemblance to the scene you’ll find on the cover of a glossy food magazine. There’s no hulking turkey at the center of the table. No undulations of snowy mashed potatoes. No assorted vegetables studded with bacon. There is, however, always cranberry sauce.Around the time we moved from one suburb of Dallas to another when I was nine years old, my family’s Indian vegetarian Thanksgiving tradition was born. Our new house came with a nice dining room, and my parents purchased a long extendable table with wings. This seemed like cause enough to invite our large contingent of relatives over for Thanksgiving dinner.My mom grew up near New Delhi, so she had few preconceived notions about what Thanksgiving was supposed to look like. She prepared the kind of food she would serve at any dinner party in the fall: matar paneer, redolent with cumin, ginger, cardamom, and coriander seeds; butternut squash sabzi stewed with brown sugar, fenugreek, and tomatoes; chhole, or spiced chickpeas, cooked with cinnamon sticks and cloves until the whole pot smelled of the holidays; and puri, hot puffs of just-fried bread. Yes, my mother made—and still makes—an entire Thanksgiving feast by herself. It miraculously takes her only a few hours, she never lets anyone bring anything, and she usually cooks the whole meal wearing a white linen shirt that she has never once stained.Indian food is often accompanied by chutney, and my mom wanted to make one that felt seasonal. She thought back to the only traditional Thanksgiving she had ever attended, where she couldn’t eat most of the dishes because they were nonvegetarian. The cranberry sauce, however, interested her. It wasn’t the jellied stuff from the can; it was homemade: sweet, sour, good on everything. Kind of like a chutney!So at the last minute my mom dumped a bag of frozen cranberries, some white sugar, and orange zest into a saucepot, cooked it down, and put it in the freezer to thicken up quickly. Nothing fancy.It was a revelatory addition to our spread. It cut through the richness of the chickpea stew and even tasted great simply rolled up in a puri. The elemental tang of cranberries and oranges, it turns out, pairs perfectly with Indian food.Sometimes my mom will try to omit the cranberry sauce, saying she wants to cut down on leftovers (a curious sentiment considering that, well, this is Thanksgiving we are talking about). But no one in our family will let her.After we realized we liked cranberry sauce, we started auditioning other Thanksgiving dishes for our table. We now have both apple and pumpkin pies for dessert instead of just shrikhand, a sweetened cardamom yogurt, and last year my cousin Isha boldly decided to bring a turkey for the non-veg contingent of the family. (It was delicious, except that none of us actually knew how to carve a turkey.)From time to time people will suggest adding cumin or red chili powder to the cranberry sauce to “Indian-ize” it. But as far as I’m concerned, it doesn’t need any of those elements to be Indian. Every year our enormous family comes together to smush cranberry sauce into puri with a scoop of squash sabzi, then follow it up with shrikhand drizzled atop apple pie. What could be more Indian than that?Explore Bon AppétitThanksgivingCranberry SauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-08", "author": ["Condé Nast", "Priya Krishna"]}