{"id": "bd6d164b5c4fac32d27aec62ebd65703", "url": "https://www.bonappetit.com/story/non-alcoholic-cocktail-quest", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "I Made Non Alcoholic Cocktails I Actually Want to Drink | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMy Intrepid Quest for a Non-Alcoholic Cocktail I Actually Want to DrinkFirst I decided to stop drinking alcohol. Then I had to find something to drink instead.By Rachel Sugar April 18, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailLast spring, two things happened at once that made me think that I should, perhaps, stop drinking. The first was an article by Stephanie Mencimer in Mother Jones that traced the link between alcohol and breast cancer. The second was that it began to occur to me that I might—not now, but at some point—like to have children, and that would necessitate being pregnant. “But then I couldn’t drink,” I thought, standing in the kitchen where I was cooking, drinking a glass of wine. I was sad, and also alarmed that I was sad. It had not occurred to me before that moment that I might miss drinking, because I had not thought of drinking as something I cared about enough to miss.But I did, apparently, and I didn’t like that, and so I decided maybe I should stop. I wasn’t going to not drink; I just wasn’t going to buy it. Alcohol would be for special occasions only, like when someone else served it to me.I’ve never been a big drinker, which I used to say was because it made me sleepy. The twist is that it also makes me sneezy, which I like to think is charming, and it would be if I were a French bulldog. Because I am a person, it mostly makes other people ask if I’m contagious.I was drinking a single glass of wine most but not all nights. Four nights out of seven. It wasn’t a lot, I thought. I use very small wine glasses! I was well within the USDA guidelines, which advise no more than one drink a day for women (98 grams per week). I rarely even got tipsy. And I was hardly a connoisseur. I mean, I have preferences, but I could not exactly tell you what they are. I like the one with the horse on it? For a while, I’d gotten very into rating beers on the notes app on my phone, where my boyfriend and I made incisive tasting notes such as “hoppy” and “makes me very sod.”Since I’d started working from home, the line between work and not-work had felt tenuous, and wine was very, very clear.This should not have been hard. In fact, part of the point was to prove to myself how not hard it would be.And it wasn’t hard, at least in some ways. I said I wouldn’t drink, and then I didn’t. But I missed it. Why did I miss it so much? It wasn’t the buzz, I was pretty sure, although it’s possible it was that a little bit. Mostly, I missed the ritual. I liked the way it demarcated the end of the serious workday. Since I’d started working from home, the line between work and not-work had felt tenuous, and wine was very, very clear. More than the taste, which I also liked, I liked the slow and celebratory nature of it. I especially liked sipping a glass of wine while I cooked dinner, because it made me feel carelessly glamorous. I wasn’t me, stirring lentils, so much as a character in a movie (about stirring lentils).A fleet of non-alcoholic drinks.\nPhoto by Chelsie CraigOnline, I found many suggestions for what I should drink instead. People on internet forums evangelized tea. Or, for a change of pace, iced tea! Also, seltzer. Seltzer with a splash of fruit juice? People talked about kombucha.These are all great drinks. That is the problem with them. They are too great. They are so great, in fact, that I drink them all the time. None of them felt special.It is, suddenly, a fantastic time to be a non-drinker in public: The world, seemingly all at once, has finally woken up to the possibilities of not drinking. “Whether this has to do with an increasing focus on wellbeing, a decreasing taboo around acknowledging substance abuse issues, or both, people are drinking less or cutting out alcohol entirely,” observed Julia Bainbridge for this site, and the result is a great renaissance of zero-proof cocktails. In January, USA Today called them “the hot trend.”But none of these were what I wanted. As Bainbridge, who’s working on a book about non-alcoholic drinks, wrote to me, non-alcoholic drinking can have “a lot of fuss involved that’s not realistic for a home cook.” My life is already very fussy. Ideally, I wanted a drink that took approximately the same amount of fuss as opening a wine bottle. I was willing to settle for something with very few ingredients. I wanted a drink that posed some kind of challenge to my palate, but I didn’t want that challenge to be making it.The best thing about investing in non-alcoholic drinking is that it is a wild west of possibility. There are so many liquids that exist, and you can mix them! “What’s sort of fun about non-alcoholic drinks is that you can be a lot more playful,” said Arley Marks, co-owner of the Brooklyn mead bar Honey’s. I love fun! Did fun mean sweet and fruity, though? I worried. But no, Marks assured me, it doesn’t have to mean that at all.“There are other worlds of flavor that are really fun that are not citrus and sugar,” he said. For example: vinegar. Had I considered specialty vinegars? I had not. “You dilute them with some soda water, and it really brings out the flavors!” His list kept coming: What about verjus? What about sauerkraut juice? What about ginger bugs? (What?!) I could just take fresh, organic ginger and mix it with honey and water and “let it spontaneously ferment,” and when he said all this, it sounded great and easy—yes, let’s ferment spontaneously!—but then I read the recipe. It had so many steps that I had to sit down.Verjus, on the other hand, felt extremely doable, because it required doing nothing. Here is how you drink it: You open the bottle, then you pour it into a glass with ice. According to this very magazine, verjus is “the pressed juice of unripened grapes,” with a “sweet-tart taste that is often used to heighten the flavor of many sauces or mustards.” But, according to Marks, you can also sip it straight. “It’s so refreshing,” he said. “And it feels like you’re opening a bottle of wine.” It did. It was. It was so refreshing, in fact, that I found it was possible to happily drink a lot of it very quickly. You can spend a lot on drinking, but the twist is that you can also spend a lot on not drinking.One of Seedlip's core flavors.\nPhoto courtesy of SeedlipI’d heard of Seedlip, a line of distilled non-alcoholic spirits that comes in very attractive bottles. The packaging is very good. It feels like something that should cost almost $40, and it does. It’s a trailblazer in the world of bottled drinks for not-drinking. Ben Branson, creator and founder of the brand, sees it less as in imitation of an existing spirit than a whole new category. But it functions like a spirit, in that it can help balance out a n/a cocktail, and give it, if not exactly body, then at least a certain level of complexity.Seedlip now comes in three varietals, but I picked Garden 108 because it felt aspirationally seasonal, with notes of peas and hay and rosemary and other idyllic flavors meant to evoke an English spring. The label recommended I mix it with tonic water and garnish with fresh peas. I used frozen. It tasted a lot like tonic water. This is not a criticism of Seedlip so much as of my palate, which I often worry is not very sensitive. Also, the peas.In the hands of Kieran Chavez, the beverage director at the Spanish tapas mini-chain, Boqueria, Seedlip is much better. At the time we met, he was making two drinks with the stuff: a lime leaf collins—like limeade, only more interesting—and a carrot-juice-based concoction with Seedlip, saffron, and banknotes of India pepper. They were beautiful and tasted like sophisticated juices, juices with style but also substance.There is so much to drink, when you’re not drinking. And I had ignored it all.Since an n/a cocktail cannot get its weight and texture from alcohol, you have to find it somewhere else. Like sugar. “We need to not be afraid of sugar,” he says. This had not occurred to me before, that I have spent so much time avoiding sugar that I have ignored what it can do.Jillian Vose, the Beverage Director at Dead Rabbit, agrees that for my new n/a life, I should get into syrups.“Yeah, it might take you about 20 minutes to make at home,” she says, but then I could have a syrup—a whole bunch of different syrups—which I could keep in my fridge for a week, at least. “Just like you would go food shopping on a Sunday and prep everything for the week.” I like this idea very much, of becoming a woman who prepares syrups. To celebrate my new identity, I go on Amazon and buy a pack of restaurant-style plastic quart containers.What should I be doing with my new syrups? Like pretty much everyone else I’ve talked to, Vose suggests I look to tea. “Yeah, tea can be boring,” she says, preempting my concerns. “But I’m not saying black tea. There’s some beautiful tea companies out there…I mean, it’s endless.”For my first foray into tea-based non-drinking, we decide I’ll do a blend of iced hibiscus tea and iced Earl Grey, then I’ll sweeten it with cane sugar syrup. “It’s really eye-appealing,” she points out, noting that, if you put it in a wine glass, it has the advantage of kind of looking like a wine. And it is cool and crisp and not at all boring, and just the right amount of sweet. Also, it’s easy. I brew a batch of hibiscus tea and another batch of Earl Grey, then I mix them 50/50 and add some of my syrup and serve it on ice, or sometimes, without ice, or mixed with seltzer for a spritzer.There is so much to drink, when you’re not drinking. And I had ignored it all.Before my experiment with non-alcoholic drinking, I drank water. I drank seltzer (plain). I drank coffee (black). I drank ginger tea (unsweetened). I like all of these drinks. They taste good and they hydrate and sipping them gives you something to do while you’re on phone calls. Also they have no calories, and I am still programmed to see this as a virtue. If there’s one piece of pop-nutritional advice I have internalized, it is that you aren’t, under any circumstances, supposed to drink your calories. “Indulgences” are fine, but only if you eat them.For some reason, though, I’d made an exception for alcohol. It wasn’t that I didn’t know alcohol had calories. I knew it wasn’t nutritious. It’s just that I’d decided it was fine. A glass of wine was a considered and reasonable choice I was making. Wine was okay, I think, because it did something—I felt it!—to justify its caloric value, whereas juice was just irresponsible water. The idea that you could drink something because it tasted good, and that the valid justification of its existence could be pleasure, was very new.I liked my new refrigerator filled with jars of liquids; it made me feel like a scientist, or a witch. I liked the sense of adventure. I liked the ritual of deciding what to drink, and mixing it. Also, I liked feeling competent. Oh this little hibiscus spritzer? Just something I whipped up from my collection of refrigerated potions!Non-alcoholic drinking didn’t convince me to permanently give up all alcohol (I gradually started drinking again six weeks later). If anything, not drinking made me appreciate booze more. It’s amazing, alcohol! It doesn’t just make you tipsy; it literally changes how a drink feels in your mouth! This is obvious, retrospectively, but I had taken it for granted until I cut it out.But I do drink less often now. There’s the whole cancer thing, still. But also, my experiment introduced me to the revelatory idea that you can, sometimes, drink things for the sensual delight of taste alone. That delight, in itself, is doing something, which is maybe the most important thing to remember about non-alcoholic drinking, or alcoholic drinking, or anything we consume for pleasure alone. They’re all momentary disruptions, escapes from the tedium of everyday life.Explore Bon AppétitHealthyishNonalcoholicSummer DrinksessayRead MoreLifestyleBig Alcohol Is Bracing for a More Sober FutureBy Julia BainbridgeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-17", "author": ["Condé Nast", "Rachel Sugar"]}