{"id": "bd79981368b0fe997557523ac1ac4295", "url": "https://www.bonappetit.com/story/waiting-for-gus", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "These Spring Recipes Are What I Cook When I'm Impatient For Asparagus | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow I Cook When I'm Impatient for SpringWaiting for 'gus.By Christina ChaeyApril 11, 2021FacebookTwitterEmailPhoto by Emma Fishman, Bowl by Meilen Ceramics FacebookTwitterEmailEvery other week Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the Healthyish newsletter, you’ll get the scoop before everyone else.Every year around this time I revisit a handful of poems about spring that I bookmarked when I was in college and very into National Poetry Month and smoking Djarum Blacks. I have left my clove cigarette days behind, but my love for “The Seven of Pentacles” by Marge Piercy remains. It’s all about appreciating the waiting period before a harvest, when all you can do is be patient and trust that things are happening, even if you can’t see or hear or feel them at work:Connections are made slowly, sometimes they grow underground.You cannot tell always by looking what is happening.More than half the tree is spread out in the soil under your feet.Penetrate quietly as the earthworm that blows no trumpet.Fight persistently as the creeper that brings down the tree.Spread like the squash plant that overruns the garden.Gnaw in the dark and use the sun to make sugar.At the end of the longest season of the longest year, in the throes of late-stage pandemic burnout, it’s tempting to look back at the last 12 months and feel like I’ve done a whole lot of nothing. But then I remind myself that’s just the burnout talking. My little earthworm army has been hard at work all along, and perhaps it’s time to give them some credit.'Gus it up!\nPhoto by Alex Lau, food styling by Rebecca JurkevichWhat I'm Cooking Now:For those of us who love to cook, it’s not really spring until the arrival of your favorite early-season produce. For Basically editor Sarah Jampel, it’s hot pink stalks of rhubarb (make her Rhubarb-Brown Butter Bars as soon as you find some). For many chefs it’s fussy fava beans and even fussier artichokes. And for me it’s my beloved asparagus, or ’gus, which I always think is going to show up at the markets here in New York in early April but never seems to until late in the month. If you’ve got a hot ’gus tip for me, please drop me a line so I can make this Black Pepper Tofu and Asparagus ASAP. In the meantime I’ve been loading my plate at every meal with lots and lots of greens: bitter dandelion greens and mature spinach wilted into a bowl of Mina Stone’s perfect chickpeas; broccoli fritters; big green salads with every meal; Samin Nosrat’s spinach and cilantro soup thickened with a scoop of tahini. They all more than do the job.I’ve also been buying whole chickens and making lots of stock to add to my favorite brothy, spring-y soups (like this minestrone verde with pistachio pesto). Right now, my favorite thing to do with all the leftover tender poached poultry is to turn it into a spring-ified chicken salad to pile on top of toast. I like to forego the mayo and dress the chicken with extra-virgin olive oil, lemon juice, white wine vinegar, salt, and pepper, and mix in a variety of crunchy, tender, or leafy green things: chopped dill, chives, or parsley; thinly sliced scallions and fennel; a handful of pea shoots; celery leaves and diced stalks. I’ll lightly toast thin slices of a dense health loaf (I love Bread Alone’s Nordic loaves or this recipe for Super Seedy Gluten-Free Bread), then spread them with crème fraîche and top with lots of chicken salad, flaky salt, and more pepper and lemon. They’re so messy that I eat them at my kitchen island as I stand over the cutting board, which means I have one fewer dish to wash. And because it’s impossible to eat these toasts in the vicinity of a laptop, I’m forced to step away from my computer for lunch. A win-win.Lean Into Spring Cooking:PHOTO BY LAURA MURRAY, FOOD STYLING BY SUSIE THEODOROUHealthyish Chicken SaladPea and Little Gem Salad with Farro and PecorinoBlack Pepper Tofu and AsparagusSpring Minestrone Verde with Pistachio PestoPasta with Baby Artichokes, Mascarpone, and HazelnutsSpring Hot-and-Sour SoupExplore Bon AppétitHealthyishWhat's Chaey Cooking?AsparagusSpringessayRead Morerecipes53 Spring Recipes to Get You Really Excited for the SeasonGallery53 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-11", "author": ["Condé Nast", "Christina Chaey"]}