{"id": "bd7a541d005142273d788088befb743a", "url": "https://www.bonappetit.com/story/black-friends-check-in", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "How to Check In With Your Black Friends Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Check In With Your Black Friends Right NowThere’s a better way to reach out to your friends than sending a “How are you?” text.By Jesse SparksJune 4, 2020FacebookTwitterEmailFacebookTwitterEmailHow are you? It’s a seemingly simple question, but, for me, it’s become increasingly fraught. Each time my phone chirps, as it seems to every other minute, I brace myself. Is it going to be another announcement about a Black death? A new state-enforced curfew? Or another message asking me to excavate my pain and discomfort, morph it into something digestible, and slap a “lol” at the end so things don’t get too real too quick for whomever’s on the receiving end? I’m not the only Black person experiencing an influx of these kinds of messages. Sure, the intentions are good, but in a moment like this, intentions aren’t enough. Actually they never were.For a lot of non-Black people, now feels like a crucial time to reach out to Black friends and loved ones who are grappling with the weight of the moment. Many of you may have good intentions and mean well. “Why not check in?” you wonder. After all, it seems like the right thing to do, and sometimes it is. But if your friend is anything like me, they’re probably processing a lot right now. So, before you send that text, shoot that Instagram DM, or release a carrier pigeon with an ornately written dispatch for your friend, here a few questions to consider:What’s your relationship?Avoid romanticizing your connection or trying to bond with someone under stressful circumstances. Are you and the person you’re thinking of reaching out to actually friends, or have you just been friendly with them in the past? Do you intentionally spend time together or do you just happen to (involuntarily) share space with them? Is this someone you feel comfortable talking to and sharing comfortable silences with? The answers to these questions will all point to whether you’re really the right person for a check-in. And it’s okay to not be the best person for this moment. We all have acquaintances who aren't quite friends. There’s no shame in this. But, if during your reflection, you notice that you don’t have any Black friends, despite working, living, or otherwise existing around Black people, that’s something you should interrogate further.Are you prepared to provide real support?Checking in is about ensuring someone’s well being or providing support. The point is not to feel better about yourself—and frankly, there’s a good chance you might walk away feeling worse about the state of things. Before picking up the phone, take a moment to think about where you are emotionally. It’s crucial that you don’t center yourself in a conversation that isn’t about you. Be mindful of what you’re unintentionally asking or expecting by asking yourself a few questions: How are YOU feeling? Are you looking for ways to talk about everything going on? Are you trying to meet your own emotional or psychological needs (support, guilt, a shoulder to cry on, someone to grieve with, etc.)? Are you truly prepared to offer support if someone asks for it? While your feelings, uncertainty, and grief are all valid, how you act on these feelings and place a burden on someone else can be unjustified. These conversations aren’t the time for you to start unpacking your emotions, qualify someone else’s, or look for an absolution of guilt.What else are you doing to help?Oftentimes, check-in messages act as stand-ins for other intentions. To gauge whether a check in is really necessary, first look to see if the person you’re thinking of has already asked for specific means of support. If they shared a post asking people to donate to a mutual aid fund instead of DM-ing them, donate to the fund if you can. If they are asking you to support Black-owned businesses right now, look at ways you can sustainably do so. If they ask you to read the resources they’ve shared, then read them and share them with other people in your circle who could benefit from the materials. All of these are ways that you can support this person without needing to engage them emotionally. It sounds simple, but skipping this step can be incredibly frustrating for the person being checked in on.Are you expecting or projecting?The best way to care for someone is to consider their specific feelings and the situation they're in. Basic enough, right? Apparently not. There have been numerous stories about people sending generic “How are you feeling?” texts or swiping through their Venmo contacts and sending money to everyone Black, regardless of whether they’re actually close or not. Though it should go without saying, Black people are not a monolith, and, thus, our responses to trauma or the ways we request support are not going to be the same. Don’t try to offer money if I haven’t asked for it or bring up a hard moment if I haven’t prompted it. Sure, you may want to do good, but these acts have roots in expectation and projection. Be careful not to assume you know what someone else needs or try to be a savior to someone who never needed saving.What can you say besides “How are you?”I’m obviously Not Great, Sherlock! Instead, you could ask, “How can I support you right now?” Or, “Have you been able to find time for rest? What does rest look like for you right now?” Now could also be the time to bring practical offerings to the table (literally): Could you bring food to a neighbor, or help out with socially distant childcare if your friend needs alone time to recharge? There are many ways to ask about someone’s wellbeing. Regardless of which questions you choose, be open to whatever the response may be: long, short, or none at all. Each of these responses is valid.How are you going to take action after?A check in should be followed up with action. If the person you interact with doesn’t need your support, you’re not necessarily off the hook. Sometimes the best way to truly be supportive is to do internal and communal work with other non-Black people: educate yourself on anti-Black police brutality, consider your own privilege, talk to your loved ones about why protests and the Black Lives Matter movement are so important, support Black owned businesses, or donate. What you say matters far less than what you do. Find a way to get involved, and stay involved. Your friends and I will appreciate it.Explore Bon AppétitHealthyishessayRead MoreLifestyle7 Virtual Mental Health Resources Supporting Black People Right NowBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-04", "author": ["Condé Nast", "Jesse Sparks"]}