{"id": "bd7c39a2a8e7f366ca5c6d65264f3a21", "url": "https://www.bonappetit.com/story/jane-bakes-cookies", "year": 2022.0, "month": 1.0, "day": 3.0, "content": "Jane Bakes Cookies May Be \"Healthy\"—But More Important, They're Delicious | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingJane Bakes Cookies May Be “Healthy”—But More Important, They’re DeliciousCome for the fiber, stay for the melt-in-your-mouth texture.By Tiffany HopkinsJanuary 18, 2022FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what food people are obsessed with eating, drinking, and buying right now. Next up, Tiffany Hopkins makes the case for Jane Bakes cookies.Judge me if you will, but I initially bought these hazelnut and dark chocolate cookies from Jane Bakes because of their fiber content. We could all use a little help, OKAY? Made with just a handful of ingredients, these cookies are not only high in fiber, but also lower in carbs than standard store-bought cookies. I’ve tried a lot of healthyish snacks, and let’s be honest, they usually aren’t as good as their sugar-and-saturated-fat-filled counterparts. So I wasn’t expecting these to be delicious, but surprise! Their rich, nutty flavor and delicate, melt-in-your mouth texture had me hooked.Photo by Isa ZapataJane Bakes Hazelnut and Dark Chocolate Cookies$27 at Amazon (3-Pack)Most store-bought chocolate-speckled cookies fall into two camps: Team Crispy (Tate’s) and Team Chewy (Pepperidge Farm). But Jane Bakes treats are something different altogether, sitting somewhere between a crumbly chocolate chip cookie and a buttery shortbread—sort of like, you know, those cookies. With a small bite-size shape, they’re perfectly tender, have just the right amount of sweetness, and embody the perfect butter-to-chocolate-to-nut ratio. They’re the captain of Team Delicate.So what, exactly, makes them healthy? The base of these cookies consists of a mixture of 100% organic whole wheat flour fortified with something called Hi-Maize, a fiber-packed resistant starch that’s made from corn. The cookies get their sweetness from Whey Low, a low-glycemic blend of natural sugars, including fructose (fruit sugar) and lactose (milk sugar). While I don’t know if a “healthy cookie” actually exists, I can vouch for the deliciousness of Jane Bakes offerings.I immediately regretted buying only one pack—a mistake I haven’t made since. These days I always keep a couple sleeves of Jane Bakes cookies on deck. Sometimes it’s the whiskey and rye chocolate chip flavor or the maple pecan variety, but the hazelnut and dark chocolate cookies are incredibly hard to beat. I can’t be sure that eating a cookie a day will keep the doctor away, but it’ll sure keep me happy.Jane Bakes Maple Pecan Cookies$27 at Amazon (3-Pack)Explore Bon AppétitShoppingHighly RecommendCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-18", "author": ["Condé Nast", "Tiffany Hopkins"]}