{"id": "bd8122d656c565c8472b057f37a902bb", "url": "https://www.bonappetit.com/story/bean-broth", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Bean Broth Is My Bone Broth | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingBean Broth Is My Bone BrothWhen the broth is as good as the beans.By Adam RapoportApril 14, 2020FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Like everyone else this past month, I’ve spent a lot of time making beans. Which sounds simple enough. But for whatever reason, I’ve never made them well. Mine always seem to lack flavor, or they fall apart, or I can never figure out whether they are overdone or underdone. Simple has never been simple for me.But then I watched Carla Music’s brothy bean video and I realized two things. 1) The reason my beans lacked flavor is because I was woefully under seasoning them (hello salt and fat). 2) My beans weren’t brothy enough.The former point is pretty straight ahead—the more salt and fat you add to something, the more depth of flavor it will take on. But that latter point had never even occurred to me. In the past, I had simmered and simmered my beans until they took on a stewed, almost refried-like consistency. The notion of cooking them at low heat in an abundance of water wasn’t something I had tried. They would just end up too watery, right?Well, not if you do like Carla and chef Patch Troffer, who inspired Carla’s bean technique. In the beginning of the cooking process, they coddle the beans with salt and olive oil (or whatever leftover fat you have jarred in your fridge), casting aside that age-old advice about waiting until after the beans are cooked before salting them. Except they do that too. When the beans are cooked, they add more salt and fat to taste.Want this letter before it hits the website? Sign up for our newsletter!The result is not only delicious, flavorful (pork-free) beans, but broth as rich and satisfying as any soup. The last batch I made yielded an extra quart of broth, in addition to the quart of beans I stowed in the fridge.One day for lunch, I heated a pot of the broth, added some leftover farro to it, and topped it with grated parm, chopped parsley, and a drizzle of extra virgin. It was exactly what I needed on a damp, cold, not-quite-spring afternoon. Another day, I heated some broth and beans together and ladled them into a small bowl to accompany two fried eggs and a warmed tortilla and plenty of hot sauce. Breakfast for lunch.And one day around 3 p.m., when I was tempted to reach for a bag of tortilla chips, I drank some hot bean broth straight from a coffee mug. I felt like one of those wellness folks who extol the virtues of bone broth. Except I’m preaching my own kind of broth—no bones about it.More ideas for what to do with all those beans:1 / 86ChevronChevronKale Minestrone With PistouView RecipeExplore Bon AppétitAdam NewsletterBeanRead MorecookingHow to Cook Dried Beans (the Tastiest Beans of All, if You Ask Us)By Alex Delanycooking7 Tips for Making Your Best Pot of Dried Beans, Even If It's Your FirstBy Caroline LangecookingIf Loving Beans Is a Crime, I’m Officially ScrewedBy Carla Lalli MusiccookingWhen You're Cooking Dried Beans, You're Already Halfway to SoupBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Adam Rapoport"]}