{"id": "bd939356277d29a7a969806bd54e400f", "url": "https://www.bonappetit.com/story/best-biscuit-tips", "year": 2020.0, "month": 3.0, "day": 3.0, "content": "Tips for Making Flaky Biscuits at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make Flaky Bakery-Style Biscuits at HomeThey've got more layers than that poem you had to analyze in high school. By Molly BazMarch 16, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan Spungen FacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.Ask anyone what distinguishes a superlative biscuit from a mediocre one and I guarantee you they’ll say it’s the tender, flaky striations. Distinct, pull-apart layers are synonymous with biscuit success, yet somehow you’re more likely to see them in a bakery display than a home kitchen.Well, that’s enough of that. I’m taking matters into my own hands and putting a stop to sub-par homemade biscuits once and for all. These simple tricks of the trade will ensure that your biscuits come out flaky AF every time, no need to cross your fingers and hope for the best.1. Use cold butter (and keep it that way)By keeping your butter as cold as possible as you work it into the dough, you'll guarantee that the distinct pieces create pockets of steam that push the layers apart. If the butter is too warm when you’re working with it, it will melt too quickly, seeping into the biscuit dough rather than turning into steam. To keep the butter cold, work with it straight from the fridge and move quickly so that the warmth of your hands doesn’t make the butter too soft. For extra insurance, some bakers even chill their bowl and their flour before incorporating the butter just to make sure everything stays calm, cool, and collected.2. Peas and lentils, peopleAs you work the butter into the dry ingredients by pinching, squeezing, and flattening between your palms, be careful not to over-incorporate. Aim for pieces between the size of a pea and a lentil—and no smaller. If the pieces are too itsy-bitsy, the butter won’t create enough steam to cause puff-age.3. Fold, pat, repeatAs you’ll find in this recipe for Sour Cream and Onion Biscuits, we’ve included a dough folding trick that will guarantee success, even if you fail to succeed at the other two tips. You’ll pat your biscuit dough out into an 8x4\" rectangle and then fold the rectangle in thirds by bringing the short sides into the center, just like you would fold a business letter (or swaddle a baby?). You’ll pat the dough down again, and repeat the letter fold once more.The physical folds you create translate into distinct layers before the biscuits even hit the oven. Magic! Perhaps you’ve heard the word lamination thrown around in the context of croissants or puff pastry. This letter folding technique is essentially a very chill and simplified version of exactly that. We use a similar manual method in BA's Best Buttermilk Biscuits.Now go forth and make biscuits. They'll have more layers than your mom on a chilly day. They'll be flakier than your flakiest friend on a Friday night. And they'll look like they came straight from a bakery.Get the recipe:Sour Cream and Onion BiscuitsIf you've ever had trouble making biscuits in the past, consider this recipe your saving grace. While many other methods count on pockets of butter and an angel’s touch for pull-apart flakiness, we weren't willing to leave it to chance. Our simple folding technique manually multiplies the number of layers for guaranteed, no-risk success. View RecipeExplore Bon AppétitBiscuitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-16", "author": ["Condé Nast", "Molly Baz"]}