{"id": "bd9b3af2b221cee72ef8c40b528606c8", "url": "https://www.bonappetit.com/recipe/picarones-with-fig-chancaca-syrup", "year": 2021.0, "month": 9.0, "day": 2.0, "content": "Picarones With Fig Chancaca Syrup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2021 IssuePicarones With Fig Chancaca SyrupBy Hender GonzalesSeptember 14, 20215.0(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma FishmanEmailPinterestPrintEmailPinterestPrint“You could say that picarones are like a sweet potato-and-squash doughnut, but that doesn’t pay enough respect,” says Hender Gonzales. “Doughnuts are, what, Dutch? This is something we Peruvians came up with ourselves.” Gonzales’s version, which they doled out during their pop-up at Ursula in Brooklyn, is made of a sweet potato–based dough that’s fried until crispy and soaked in spiced syrup. The syrup is sweetened with chancaca (also known as piloncillo and panela), which is a type of unrefined whole cane sugar that you can find in most Latinx grocery stores, in the Latinx section of supermarkets, and online.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronFood Processor$49 At AmazonDeep-Fry Thermometer$29 $16 At AmazonCheesecloth$9 At AmazonDutch Oven$80 At AmazonWire Rack$23 At BA MarketVegetable Peeler$10 At AmazonIngredientsMakes about 12Syrup1small apple, halved½medium orange, zest removed in wide strips with a vegetable peeler13\" cinnamon stick2whole cloves8oz. chancaca (piloncillo) or 1 (packed) cup light brown sugar½cup dried figs½cup plus 2 Tbsp. (125 g) granulated sugar1tsp. aniseedDoughnuts1Tbsp. cardamom pods2tsp. aniseed2medium sweet potatoes (about 1 lb.), peeled, coarsely chopped2tsp. active dry yeast1½tsp. granulated sugar2cups (250 g) all-purpose flour1¼tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, dividedVegetable oil (for frying)Special EquipmentA layer of cheesecloth; a deep-fry thermometer; a wooden chopstick or skewerPreparationSyrupStep 1Bring apple, orange zest, cinnamon stick, cloves, chancaca, figs, granulated sugar, aniseed, and 1¼ cups water to a boil in a medium saucepan over medium heat. Reduce heat to medium-low and simmer, stirring occasionally and scraping bottom of pan, until reduced by about a third, 40–50 minutes. Strain syrup into a medium bowl; let cool.Do ahead: Syrup can be made 1 week ahead. Cover and chill. Bring to room temperature before using.DoughnutsStep 2Bundle cardamom and aniseed in cheesecloth and tie with kitchen twine. Place sachet in a medium saucepan; pour in 2 cups water. Bring to a boil, then reduce heat to medium-low and simmer 5 minutes to infuse.Step 3Add sweet potatoes to pan; cook until fork-tender, 17–19 minutes. Remove sachet and drain sweet potatoes, reserving ¼ cup cooking liquid. Let cooking liquid cool slightly.Step 4Meanwhile, purée sweet potatoes in a food processor or blender until smooth. Scrape purée into a large bowl.Step 5Whisk yeast and sugar into reserved cooking liquid, then whisk into purée. Add flour and ¼ tsp. Diamond Crystal or Morton kosher salt. Mix with a wooden spoon until a sticky dough comes together, about 5 minutes. Cover bowl with plastic wrap and let dough rise in a warm, draft-free spot until doubled in volume, about 1 hour, or chill overnight.Step 6When ready to fry, fit a medium heavy pot with thermometer; pour in oil to come 2\" up sides. Heat over medium-high until thermometer registers 325°.Step 7Stir remaining 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt and ¼ cup water in a small bowl until salt is dissolved. Dip your hands in salt water, then punch down dough. Pinch off a golf-ball-size piece, roll into a ball, and flatten slightly. Push your thumb through the center to create a hole. Carefully slide into oil. Stick chopstick or skewer through hole and spin doughnut around to widen hole slightly and set shape. Fry until deep orange-brown and crisp, about 5 minutes per side. Transfer to a wire rack set over a baking sheet. Repeat process with remaining dough, dipping your hands in salt water to prevent sticking and adjusting heat as needed to maintain oil temperature. (Pan should fit 3 or 4 doughnuts at a time.)Step 8Generously spoon syrup over doughnuts to coat.How would you rate Picarones With Fig Chancaca Syrup?Leave a ReviewTell us what you thinkExplore Bon AppétitDoughnutDessertFigFruitPeruvianSouth AmericanLatin AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-09-14", "author": ["Condé Nast", "Hender Gonzales"]}