{"id": "bd9f7f3a50c0522c25f5f7e978324883", "url": "https://www.bonappetit.com/recipe/roasted-corn-and-red-pepper-soup-with-cheesy-croutons", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Roasted Corn and Red Pepper Soup with Cheesy Croutons Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginhealthyishRoasted Corn and Red Pepper Soup with Cheesy CroutonsSponsored by VitamixFacebookPinterestTwitterEmailJerrelle GuyServes 2 peopleIt’s so simple to make this delicious roasted corn and red pepper soup with Vitamix. Oh, and don’t forget the cheesy, toasted croutons for the perfect finish.PrintIngredientsFor the soup:1 roasted ear of corn1½ roasted red bell peppers, skins discarded (about 1½ cups)½ cup vegetable broth1 large garlic clove2 Tbsp. olive oil3 Tbsp. butter½ tsp. chipotle chili powder¼ tsp. paprika¾ tsp. saltFresh lime juice, to taste (about 1–2 Tbsp.)For the croutons:4 slices of bread (from a French baguette)2 Tbsp. olive oil1 garlic clove4–5 basil leaves1 sprig of fresh oregano (stem removed)Small handful of fresh parsley2 oz. goat cheeseRecipe PreparationCut kernels from cob, and add to the Vitamix A3500 Blender with roasted red peppers, vegetable broth, garlic, olive oil, butter, chili powder, paprika, and salt. Use the Vitamix soup function, and blend until completely smooth. Divide between two bowls, and add lime juice to taste. Rinse the Vitamix Blender.Back in the Vitamix Blender, pulse the olive oil with the garlic and herbs on level 1 until chunky. Add in the goat cheese, and pulse 3–4 times on level 1 until combined. Set aside.Preheat the oven to broil.Place bread under the broiler and cook for about 2 minutes or until dark and toasted on one side. Remove and spread goat cheese mixture on the untoasted side of the bread, and place back under the broiler for another 2-3 minutes or until the cheese is bubbly. Place croutons on top of the soup and serve.Sponsored by VitamixGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredVitamixHealthyishMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}