{"id": "bda10eec32b79bd55a193972ee68e3d4", "url": "https://www.bonappetit.com/story/the-skin-and-gut-microbiome-connection", "year": 2018.0, "month": 9.0, "day": 4.0, "content": "Your Skin Microbiome and Gut Are Connected | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen It Comes to Better Skin, Food Matters More Than You ThinkIt's all about that microbiome.By Mandi NyambiSeptember 26, 2018FacebookTwitterEmailFacebookTwitterEmailI have a lot of questions about my skin, most of which are not easily answerable on the internet. Cool people's skincare diaries give me FOMO. r/SkincareAddiction feels like trying to study for a vocab quiz by reading the dictionary. That's why I've been crushing on the Le CultureClub newsletter. Since subscribing, I've learned which serum is worth the splurge, the difference between BHA and AHA acids, and other genius tips.Le CultureClub just launched an at-home kit that lets you test your face's microbiome, so you can figure out which products work best for you (aka skincare gamechanger!). In honor of that, I asked Le CultureClub co-founder and CEO Mandi Nyambi to tell the Healthyish fam more about how the food we eat shows up on our skin.  – Amanda Shapiro, Healthyish EditorYou’ve probably heard about the gut microbiome, but bacteria actually live everywhere in our bodies, from our elbows to our ear canals, all working to help us live our best lives. At Le CultureClub, which I co-founded and run, we love to talk about the skin microbiome. Spoiler: Much of the bacteria on our skin are great, and we want them to stay! And, lucky for you, your skin microbiome and your gut microbiome LOVE to chat. They’re so connected, and THAT, friends, means that you can eat your way to healthier, more dewy skin.Okay, back up. What is the microbiome again?The microbiome is the bacteria, fungi, and viruses that live in and around our body. Given everything we were taught growing up, it probably sounds like a hot mess. But the bacteria that live symbiotically (hey roomie!) actually help to fight off infection, digest our food, and keep acne at bay. At Le CultureClub we like to think of it as a micro-ecosystem.Reasons to care about your microbiome include: immune function, weight control, bowel improvements, and glucose tolerance. Translation: You get sick less, get just the right amount of Rihanna thick, have more fulfilling poops, fewer sugar crashes. But also… your skin will glow.So the bacteria on my skin is good?We’ve long been taught that p.acnes causes acne on the skin and so products were created to eliminate it. Now we also know that some strains of p.acnes can reduce acne symptoms and eruptions. It’s not just about what bacteria are on the skin, it’s about how they work together. Instead of eliminating bacteria, we should be striving for balance in our skin microbiome.For example, Staphylococcus Epidermidis is a microbe associated with moisturized skin. It has specific antibacterial properties that guard against the microbes that cause dry skin and irritation. Likewise Lactobacillus is a bacterium that has been shown to have a positive relationship with the gut, but it also works on the skin to repair the skin barrier, reduce water loss, and produce anti-inflammatory proteins that can help fight acne.What are my gut and my skin bacteria talking to each other about?The microbiome across your gut and your skin work together and affect one another. Your gut bacteria sends messages to your brain, which can translate that information into a mood (like irritability) or a feeling (like cramps), but also a change in the texture or appearance of your skin. For example, in people with IBS, the microbiome is out of balance and that can lead to not only discomfort in the gut but also anxiety, depression, and skin problems like acne and rashes.Likewise your skin microbiome sends signals to your gut about the outside environment, so taking a holistic approach to your diet and your skincare regimen is what we’re all about.So how do I feed my skin microbiome?When it comes to skincare, look out for products with probiotics like lactobacillus and bifidobacterium in their ingredients. Mother Dirt is one brand I love; their cleansers, mists and moisturizers are specifically formulated with the microbiome in mind. Minimize the number of products you use with preservatives like phenoxyethanol. And a big glaring sign that a product isn’t great for your microbiome is the term “anti-bacterial.” Remember, you want those little guys around!But, just as importantly, look at what you eat. Food absolutely changes your microbiome, including your skin. For instance, fiber fermentation in the gut has been shown to shape the bacteria on the skin. Short-chain fatty acids, which are made from breaking down fiber, lead to less acne-causing bacteria on the face and also keep protective bacteria intact.So eat that yogurt parfait and nosh on your favorite kimchi. Or go old-school with some fiber-rich fresh fruits and veggies. If you’re lazy or just on the go, there are tons of probiotic supplements that can keep things balanced until your next skin-friendly meal.Explore Bon AppétitHealthyishNatural BeautyRead MoreLifestyleWhat Are Prebiotics and Do We Really Need to Take ANOTHER Supplement Every Day?By Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-26", "author": ["Condé Nast", "Mandi Nyambi"]}