{"id": "bdaa6de188077e6d459ba8939d29693b", "url": "https://www.bonappetit.com/story/ramadan-date-cookies-anissa-helou-feast", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "A Recipe for Ramadan Date Cookies from Anissa Helou’s Feast Cookbook | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Recipe for Ramadan Date Cookies from Anissa Helou’s ‘Feast’Make these irresistible date and cinnamon filled cookies in a fragrant, rose water and orange blossom-scented dough.By Anissa HelouMay 15, 2018FacebookTwitterEmailPhoto by Kristin PerersFacebookTwitterEmailRamadan is the most important time of the year for Muslims all over the world, a holy month of fasting; those who are fasting are not allowed any food or drink from sunrise to sunset. However, as soon as the sun sets and the fast is broken, the night is given over to feasting with family and friends.In my new cookbook, Feast: Food of the Islamic Word, I spent over three years researching, studying, and cooking over 300 recipes that span the countries of the Middle East, and beyond. Ramadan is one particular time when sweets makers in Muslim countries show off their skills, preparing Ramadan specials as well as classics in industrial quantities because of the increased demand. In Lebanon and Syria, the absolute Ramadan essential is a selection of nut or date-filled cookies, shaped in beautiful hand-carved wooden molds called tabe’ in Arabic (عَفَن قالَب). The women in most families pass on their molds from one generation to the next, but you can still buy them in the souk of Damascus in Syria and watch young men carve them by hand—I have my mother’s, which I guard jealously as they have acquired a lovely patina over the years.Photo by Kristin PerersThese Ramadan cookies and other sweets are offered to guests when they visit after sunset, and they are snacked on throughout the night and just before the fast starts again at sunrise. They are also taken as gifts to family and friends during the nightly visits—social life increases considerably during Ramadan.I grew up in Beirut, Lebanon, and lived there until just before the civil war and I still remember how during Ramadan, sweet makers would set up tents or stalls outside their stores to increase their production. And every day, a little before sunset the streets would get busier as people rushed to buy all that they still needed before returning home for iftar (the Arabic name for the first meal to break the fast).However, my most vivid memory from those long ago years is that of the daily dawn chorus of drumbeat as the tabbals (drum beaters) walked the streets before sunrise, beating on their drums to wake those fasting so that they could have their suhur (the Arabic name of the last meal before the fast would begin again at sunrise).The tabbal who walked our street was old and wizened and the sound he made was haunting, made all the more eerie in the dark silence of the night. I often jumped out of bed as soon as I heard his drum in the distance to hang out of the window and watch him walk by beating his drum and calling out to the faithful to remind them to partake in their last meal of the day. We didn’t fast because my family is Christian but we visited our Muslim neighbors to wish them well during that sacred month, and I loved snacking with them on whatever they offered us, which more often than not would be Ramadan date cookies.Nothing has changed much about the way Ramadan is observed now in Beirut except for the tabbals. There are very few now, if any as most people nowadays rely on their smartphones to wake them up for their last meal before they begin their fast. But the sweets makers still crank up their production of sweets, including Ramadan date cookies, which they arrange in irresistible beautiful pyramids on large metal trays.Get the recipe:Ramadan Date CookiesThese date-ﬁlled cookies are a typical Ramadan sweet.View RecipeBuy the cookbook: Feast: Food of the Islamic World by Anissa Helou is available for pre-order on Amazon for $60Anissa Helou is a chef, food writer, and journalist focusing on the cuisines and culinary heritage of the Middle East, the Mediterranean, and North Africa. She is the author of several award-winning cookbooks including Sweet Middle East, Levant, Offal: The Fifth Quarter, Café Morocco, and Lebanese Cuisine.Explore Bon AppétitCookbooksRamadanDateCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Anissa Helou"]}