{"id": "bdb2a7fd16c92aa050aadd8464c680ce", "url": "https://www.bonappetit.com/story/gourmet-makes-ferrero-rocher-claire-saffitz", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Claire Saffitz Makes Even Gourmet-ier Ferrero Rocher Hazelnut Chocolates | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingClaire Makes Even Gourmet-ier Ferrero Rocher Hazelnut ChocolatesAnd she wants you to, too.By The Bon Appétit StaffMay 28, 2020FacebookTwitterEmailPhoto by Claire SaffitzFacebookTwitterEmailClaire is back at it with yet another Gourmet ReMakes, taking her Test Kitchen-ifed version of Ferrero Rocher hazelnut chocolates into her own kitchen for an at-home spin. (Watch her make the treat in the OG episode below!) And just like last time (and the time before that, and the one before that) we’re posting the recipe below, so you can cook along with us—and maybe even make an appearance on the show.For a chance to be featured in an upcoming episode, follow the recipe below and send a video with subject line “Homemade Ferrero Rocher” to gourmetmakes@gmail.com showcasing your final product, explaining how well they turned out, or any snags you hit along the way. Please keep videos to 60 seconds, shot in landscape with NO music, sent in mp4 or .mov form. Submissions accepted through 12 p.m. Monday, June 1!No one misses the Test Kitchen more than Claire...\nGourmet Ferrero RocherThese crunchy, creamy, hazelnutty chocolate candies don’t have the signature spherical wafer of the original Ferrero Rocher, but the layer of crushed up hazelnut wafer cookies comes pretty darn close. You don’t have to temper the chocolate for the outer coating, but it’s recommended to mimic the snappy texture of the wafer.Makes 12Ingredients1 cup raw hazelnuts, preferably blanched¼ cup chocolate-hazelnut spread6 oz. hazelnut wafer cookies (such as Loacker)8 oz. semisweet chocolate, coarsely choppedInstructionsPlace a rack in middle of oven and preheat to 350°. Toast hazelnuts on a small rimmed baking sheet until golden brown, 10–12 minutes. If your hazelnuts are unblanched, wrap them in a clean kitchen towel and rub them vigorously to loosen any bits of papery brown skin; discard skins. Let nuts cool.Set 12 hazelnuts aside for the filling; finely chop remaining nuts. Transfer to a fine-mesh sieve and shake to sift out any tiny particles; discard. Then, working over a medium bowl, press nuts through the holes of a colander, letting the mid-size pieces fall into the bowl and reserving the large pieces in the colander. Chop larger pieces again, then repeat sifting process in sieve and colander until all of the nuts have passed through the colander and are free of fine particles (they should all be about the same size). Set chopped nuts aside.To make the centers of the Ferrero Rocher, dollop a level teaspoonful of chocolate-hazelnut spread onto a 3” square of plastic wrap. Repeat process until you have 12 dollops, each on its own square of plastic wrap. Press a reserved whole hazelnut into each dollop. Working one at a time, gather corners of each plastic square up and over filling to meet in the center to form a little purse, then pinch all of the edges together, squeezing out any air, and twist to force the filling into a tight, round-ish bundle. Place bundles on a plate or rimmed baking sheet and freeze until solid, 30–40 minutes.Meanwhile, place cookies inside a large resealable plastic bag and close, pressing out any air. Using a rolling pin or a wooden spoon, lightly crush cookies until you have small pieces no larger than a lentil. Transfer crumbs to a medium bowl.Melt 2 oz. chocolate in a medium heatproof bowl set over a small saucepan filled with 1” of barely simmering water, stirring with a heatproof rubber spatula until smooth. Remove bowl from heat and place on work surface next to bowl of cookie crumbs. Reserve saucepan with water.Transfer a heaping tablespoonful of cookie crumbs to a small bowl, then add 1 tsp. melted chocolate and stir until evenly mixed and chocolate has bound crumbs into a moldable consistency. Remove 1 filling bundle from freezer and carefully unwrap on work surface. Set filling on surface to the side of the plastic; carefully spread crumb mixture onto the square to make about a 2”-diameter circle. Place still-frozen filling in center of circle, then use plastic wrap to work and mold crumb mixture up and around filling, enclosing it completely in a rough sphere. Wrap plastic around cookie mixture, then roll between your palms to form into a smooth sphere. Place sphere in refrigerator. Repeat process with remaining crumbs, melted chocolate, and filling. Chill balls until chocolate is set, 25–30 minutes.Scrape any remaining melted chocolate into another bowl or airtight container; cover and set aside for another use. Place 4.5 oz. chocolate in bowl. Bring water in reserved saucepan back up to a simmer, then remove from the heat. Place bowl of chocolate over saucepan and stir chocolate often with spatula, scraping sides, until melted and an instant-read thermometer registers 113°. Remove bowl from saucepan and add remaining 1.5 oz. chocolate. Stir vigorously until most of seed chocolate is melted and thermometer registers 82°. Place bowl back over saucepan and stir constantly until thermometer registers 90°. Chocolate should now be tempered and ready to use.Leaving bowl of chocolate over saucepan to keep chocolate warm, tilt bowl so chocolate pools to one side. Remove balls from refrigerator and, working one at a time, unwrap and dip in chocolate to coat completely. Using a fork, lift out of chocolate, allowing excess to drip back into bowl, then carefully transfer to bowl of chopped nuts. Toss in nuts until fully coated, then transfer to a wire rack. Repeat with remaining balls, tempered chocolate, and chopped nuts.When all the balls are coated, dab about 1 tsp. chocolate in one of your palms (it’s helpful to wear gloves for this) and roll a ball between your palms to completely cover nuts in a thin layer of chocolate, adding more chocolate as needed; return to rack. Repeat until all of the balls are coated. Let sit at room temperature until chocolate is set, which, if it’s well tempered, should only take a few minutes. Reserve any leftover chocolate for another use.Do Ahead: Homemade Ferrero Rochers can be made 5 days ahead. Store airtight at room temperature.Explore Bon AppétitChocolateGourmet MakesRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-28", "author": ["Condé Nast", "The Bon Appétit Staff"]}