{"id": "bdb247fac716076b3d7a31ebbf7d11f6", "url": "https://www.bonappetit.com/recipe/choros-a-la-chalaca", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Choros a la Chalaca Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueChoros a la ChalacaBy Danielle Bell and Pablo OsorioJanuary 4, 20225.0(8)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Caroline Hwang, prop styling by Aneta FlorczykEmailPinterestPrintEmailPinterestPrintThis take on the classic Peruvian seafood dish of steamed mussels is always a hit at Danielle Bell and Pablo Osorio’s de Porres Dinner Series events. The bright, fresh topping is a kind of salsa criolla, a Peruvian red onion relish with chile and lime. Arrange the mussels on a platter cup side up for a cocktail snack that’s easy to grab one-handed. At their parties Danielle and Pablo sometimes nestle the mussels into coarse salt, like they’re sitting in sand, to keep the cups upright.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronKamenoko Tawashi Scrubber$9 At East ForkMedium Saucepan$39 At AmazonTongs$13 At AmazonCitrus Juicer$7 At AmazonMicroplane Grater$16 At AmazonIngredients2garlic cloves, 1 smashed, 1 finely grated1½tsp. Diamond Crystal or ¾ tsp. Morton kosher salt, divided1lb. mussels, scrubbed, debearded1small plum tomato, finely chopped½habanero chile, finely chopped3Tbsp. finely chopped red onion1Tbsp. fresh lime juice2Tbsp. cilantro leaves, plus sprigs for \tservingPreparationStep 1Bring smashed garlic, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and 3 cups water to a simmer in a medium saucepan over medium heat. Add mussels and cook, uncovered, until opened, about 3 minutes. As mussels open, use tongs to transfer them to a medium bowl; discard any mussels that remain closed after 5 minutes or so. Chill mussels 15 minutes.Step 2Meanwhile, stir grated garlic, tomato, chile, onion, lime juice, 2 Tbsp. cilantro, and remaining ½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt in a small bowl.Step 3Remove and discard top shells from mussels. Arrange mussels on a platter; top each with a spoonful of salsa. Scatter cilantro sprigs over.How would you rate Choros a la Chalaca?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleGet a nice bag of mussels and you're set. This is an easy appetizer that will look stunning. Just be sure to finely chop the salsa, or it can be too chunky to really fit on the half-shell. chrispbaconBrooklyn, NY1/17/2022Explore Bon AppétitDinnerStarterPeruvianSouth AmericanLatin AmericanSeafoodMusselShellfishDairy-FreeGluten-FreeNut-FreeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Danielle Bell", "Pablo Osorio"]}