{"id": "bdba3fd52c9f2da21493210086b86eb5", "url": "https://www.bonappetit.com/recipe/spicy-chicken-lettuce-wraps", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "Spicy Chicken Lettuce Wraps Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2019 IssueSpicy Chicken Lettuce WrapsBy Christina ChaeyMay 21, 20194.8(75)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintLow investment and high reward, this not-so-traditional larb is the unofficial late-night meal of much of the BA staff.Ingredients2 servings2Tbsp. soy sauce1Tbsp. dark brown sugar1tsp. fish sauce1Tbsp. sambal oelek or Sriracha, plus more for serving2Tbsp. vegetable oil3scallions, white and pale green parts only, thinly sliced2garlic cloves, finely chopped1lb. ground chickenKosher saltBibb lettuce leaves, lime wedges, and tender herbs (for serving)PreparationStep 1Mix soy sauce, brown sugar, fish sauce, and 1 Tbsp. sambal oelek in a small bowl; set aside.Step 2Heat oil in a skillet over medium. Add scallions and garlic and cook, stirring occasionally, until softened (a little color is okay), about 3 minutes. Add chicken and lightly season with salt. Cook, breaking up with a wooden spoon and tossing occasionally, until chicken is cooked through, 5–7 minutes. Add reserved soy sauce mixture and cook, tossing occasionally, until liquid is almost completely reduced, about 2 minutes.Step 3Serve chicken mixture with lettuce, herbs, lime wedges, and more sambal oelek for making lettuce wraps.How would you rate Spicy Chicken Lettuce Wraps?Leave a ReviewTell us what you thinkReviews (38)Back to TopTriangleMade a chicken and tofu version. Couldn’t be easier and very flavorful! Did not salt chicken based on reviews, but next time would also cut the soy sauce a bit as it was still a tad too salty. Delicious, though! AnonymousColumbus, OH1/21/2022This takes 20 minutes to make and it RULESAnonymous9/28/2021So salty!!! I followed the recipe, but it turned out as an absolute salt bomb. Fish sauce and the added salt was wayyyy too much.  Adding fresh carrots and cucumbers couldn’t save it...\n\nDon’t add any additional salt and maybe cut the fish sauce by half? \n\nNo way this should have the rating it does?!\n\n\nJason Boston, Ma5/28/2021Sooo tasty and quick to make! I didn't have ground chicken so I diced a chicken breast and it worked perfectly. I also only used a teaspoon of sugar. Definitely going to make again MarthaDublin, Ireland4/27/2021Surprised by how good this was. Truly low effort HIGH reward. I added some canned baby corn to mine which was MWAAH!  Have some celtuce I picked up at the Chinese grocery that I'm stoked to add to tonight's version. Might also add an egg, some nuts... Probably would make an awesome spring roll filling. So many possibilities to keep this meal \"new\" week-to-week :O AnonymousNew York4/25/2021Has become a regular meal on our list of favorites.Randy CanadaCanton GA3/8/2021This is a household favorite and I finally decided to show some love with a review -- this recipe is the PERFECT meal for literally any night. It's highly customizable, easy, quick, delicious, and flavorful. Chaey is a hero <333AnonymousChicago, IL3/4/2021Wayyy too salty even after being cut with the lime juice. Recipes also needs Hoisin sauce or something. AnonymousChicago, IL2/9/2021This recipe has become a beloved regular in my home. I’ve made it as-is, I’ve deconstructed it and turned it into a rice bowl topped with lettuce and herbs, I’ve made it with several different proteins, and I’ve even taken the absolutely-to-die-for sauce and added it to different Asian inspired dishes. My dinner tonight just might be this sauce on some noodles and shrimp. It truly is a delicious recipe.Nicole KCT11/17/2020I love this! I've made it many times, but recently I've started adding a punnet of diced shiitakes and some grated carrot for more veggies. We usually have this with rice and some sliced cucumber, cherry tomatoes, and the dark green parts of the scallions on top. (If adding mushrooms and extra veg it will need more seasonings.) Quick, delicious, and versatile. Next time I'll try it with tofu instead.AnonymousMontréal8/16/2020Super easy and really tasty. The given recipe is a great base but as others have suggested, you definitely want to double the sauce as well as add other veggies to lighten it up. I did shredded carrots, but onions and mushrooms would be delicious too. I also added some toasted sesame oil and ginger. AnonymousSan Mateo, CA6/15/2020Most excellent, easy dish! I like to sauté thinly sliced cabbage with the scallions and garlic. Lightens the dish, adds more vegetable, and for those caring about frugality, makes a little pork/chicken go a long way! Like others said, double sauce (but not the sugar).\n\nDeborahNYCNYC5/12/2020Made this for dinner tonight and LOVED IT! Pretty easy and super delicious. Love the spicy chicken, almost like an easier version of Thai larb gai. Definitely serve as recommended with extra sambal and I added some sambal cashews for a little extra crunch. adamleclairOsaka, Japan 5/9/2020I cannot tell you how delicious this recipe is; or how often I make it. I often double the scallions, and will sometimes add finely diced mushrooms when I add the ground chicken to extend the recipe. Tonight I’m going to try adding a little msg! I usually serve this with lime wedges and fresh torn herbs over rice, but it’s also good tossed in noodles (I know it’s not authentic but I had soba noodles on hand), although I try to make it a little saucier with the noodles. STL5/4/2020I added a lot of finely chopped mushrooms and water chestnuts, so had to nearly double the sauce. I think the add-ins made it! Will be making again. AnonymousHouston, TX4/30/2020Explore Bon AppétitLarbSaladWrapLettuceLeafy GreensVegetableGround ChickenChickenPoultryQuickEasyWeeknight MealsSideStarterMainDairy-FreeGluten-FreeNut-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Christina Chaey"]}