{"id": "bdbe391dfacf0b2522a82520c3125c70", "url": "https://www.bonappetit.com/story/chef-jay-foster-closing-restaurants", "year": 2019.0, "month": 9.0, "day": 1.0, "content": "Running Restaurants in San Francisco Made Me Rethink Everything I Thought I Knew About Success | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureRunning Restaurants in San Francisco Made Me Rethink Everything I Thought I Knew About SuccessChef Jay Foster had two landmark restaurants in the Bay Area. Then, suddenly, they both closed.By Jay Foster, as told to Jesse SparksSeptember 5, 2019FacebookTwitterEmailPhoto by Aubrie PickFacebookTwitterEmailLast fall, chef Jay Foster owned and operated three restaurants in San Francisco: the critically acclaimed, 11-year-old soul food mainstay Farmerbrown, a brand-new Afro-Caribbean counter-service spot called Isla Vida, and a recently opened outpost of Farmerbrown at the SFO airport. Today, all but the latter have closed. In his own words, Foster shares what happened, what it means for San Francisco, and what he’s doing next. —Jesse SparksI’ve always loved San Francisco. I always wanted to have my own soul food restaurants there. So when I had the chance to open Farmerbrown, what would become a soul food institution in the Tenderloin neighborhood, I leapt for it. I was lucky enough to find a mentor, André Larzul [owner of Alamo Seafood Square Grill], when I was first finding my way in the San Francisco food scene. André trained me to open a restaurant without my realizing it, like Mr. Miyagi. He’d be in the middle of working, drop a one-liner, then go about his day: “Always monitor your margins, especially when they’re as thin as ours are going to be,” or, “Know the value of every penny.” At the time, I didn’t say much, but that advice helped me avoid the kinds of financial pitfalls that would’ve killed most restaurants before they got off the ground.After six months of preparation, we opened Farmerbrown at what felt like the perfect time: It was before the tech boom, before Twitter moved into the Tenderloin, before rents in the area nearly quadrupled. And the community seemed to really like us. Of course, the first year of running the restaurant was hard—it always is. We didn’t have rich parents or a giant windfall to lean on. We were opening the restaurant on a prayer. There were times when we had to use our personal credit cards to pay our team members. My current business partner and ex-wife, Deanna Sison, and I started taking out loans to try and get ahead of the expenses of daily operations. But we never could. We just kept digging a bigger and bigger hole.Still, we were able to settle into what felt like a really good rhythm that lasted for 11 years. During that time, Farmerbrown became more about exploring what soul food is and what it can be. For me at the time, soul food meant all the people that came in to eat, to work, to find community over a meal. As we were attracting more and more people, our landlords, formerly San Francisco natives who lived nearby, had to sell the property to a multinational real estate company. Within the span of one year, our rent went from $3,500 per month to nearly $14,000. We were working harder and later to keep up. We were still doing well and had consistently busy crowds, but the rent increase and taxes hung over us.While all of this was going on, I started to put a lot of pressure on myself to succeed, to be one of the few Black restaurant owners and chefs left in San Francisco’s historically Black Fillmore neighborhood. I would pray to the city to let me find a way to be everything that the city’s African American population needed, in terms of representation, visibility, and influence. Some people pray to god, I pray to the city.So in some ways, the opportunity to open Isla Vida, our Afro-Caribbean rotisserie chicken concept, felt like a way to do more for San Francisco. My partners pushed me to take advantage of the chance. I saw it as the opportunity to correct some of the mistakes we’d made while opening Farmerbrown. Unlike before, we went smaller for everything: smaller space, smaller team. But I knew from the start that things felt different. We could feel the neighborhood changing. We could see the tech companies coming in and raising rents. We didn’t have the  community support like before. The spaces the Black community had carved out, the restaurants we’d established, the communities we’d become a part of, were all fading out. The San Francisco that I fell in love with was not the city we were living in. The new crowd that replaced them wanted Instagrammable food delivered to their doors without having to wait. At that point, it was even more important for me to do this, to make something for the Black community in a city that used to be composed of nearly 15% Black people, but now is less than six percent. I felt like San Francisco needed this restaurant now more than ever.The spreads at Isla Vida draw on foster's love for Afro-Caribbean cooking and feature sticky-sweet barbecue ribs and juicy, crispy-skinned chicken quarters.\nPhoto by Aubrie PickWe were several weeks into Isla Vida’s opening when we knew we’d have to close Farmerbrown. We couldn’t keep funding it, despite everything we’d done. We’d taken out loans, we’d gotten the city involved to help stave off the steep rent increases. Closing was the only thing left we knew to do. We were lucky that the San Francisco airport reached out about wanting to create an outpost of Farmerbrown in one of the terminals, but that didn’t lessen the pain of having to close the restaurant. I was happy to be able to save some people’s jobs, but I was still devastated. We were a $3 million company at the time, but even that wasn’t enough to survive in San Francisco. When your landlord is a multinational company based out of Boston, you feel like the only thing they really care about is making sure their shareholders get their profits. You feel they don't really care about what it is you bring to the community, how many magazine covers you've been on, or how many people come to the restaurant everyday. There's the bottom line and that's it. But I didn’t have time to mourn; I had another restaurant to run.Isla Vida drew crowds, but it never felt like it had the same chance Farmerbrown had to establish itself. Simply put, we were out of options. There was no more money, no tight-knit community of San Francisco natives to lean on or tap into. Realizing this, I knew that Isla Vida wouldn’t be far behind. Our landlords were trying to turn a profit; we were just trying to stay in business. And we weren’t alone. Because San Francisco’s chef and restaurant-owning community is so small and tight-knit, we all knew we were struggling to make it. This is a community of people who are from San Francisco and love the city. Many of them never would have thought they’d want or need to leave, but now, they’re being forced to abandon it. I was facing the same decision. Ultimately, I chose to close. When I made the decision, I wanted nothing more than to disconnect, but there’s no disconnecting when you’re responsible for other people’s livelihoods.When I told my team, I was bracing for the worst responses possible. I was expecting people to curse me out, to blame for everything that happened, for all of the mistakes I made. It felt like I’d let my entire team down, like I’d failed each of them. Instead, I got the exact opposite response: People were empathetic. Staffers thanked me for the time we had together, asked me if I needed anything. They made sure I didn’t have to carry this grief alone. That restored some of my faith in people, faith I’d lost after more than 23 years working in the industry.Looking back to when I first started out in the restaurant industry, I had defined success as becoming established, having your restaurants, and being a pillar in your community. Now, success merely means surviving.It’s discouraging to see all the wealth, all the Teslas coming into the city, and then seeing marginalized and even middle-class people who just can't make it here anymore. It makes me want to tell anyone who asks me whether they should open a restaurant not to do it. I don’t think it’s worth it anymore. What’s worse is that this is happening across the country; it’s not just here.Now, I’m just trying to get back to that love I had for the city and for cooking. I finally have the time to try and grieve the closure of my restaurants, whether it means cooking through the grieving process or searching for whatever's next. I’ve also started writing more—experimenting with a cookbook as a way to as a way to get back to the fire I once had for cooking. But I still need time to figure out what comes next. All I do know is that whatever comes next will have to be something that I can’t not do. At least, that’s what I ask everyone else: \"Is this something that you cannot live without?\" If you can't answer that question in a very definitive way, you know then whatever you’re doing will not resonate because it's not centered in your soul. I guess it’s time I took my own advice.Explore Bon AppétitFirst PersonChefsBay AreaRestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-09-05", "author": ["Condé Nast", "Jay Foster", "As Told To Jesse Sparks"]}