{"id": "bdcb5f22b6864a012c8470f8130222fd", "url": "https://www.bonappetit.com/story/fruit-candles", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "I Want These Food Candles For Myself and Everyone Else in My Life | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Want These Food Candles For Myself and Everyone Else in My LifeCould they be more perfect? No! By Alex BeggsNovember 20, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.My stepmom keeps a basket of fake fruit on her kitchen ledge. The bananas are a little green, the apples ruddy—they look real. She puts the stickers from real apples on the fake ones to throw you off even further. It’s hilarious and delightful. My sister falls for it every time. Plastic banana, foiled again!Fake fruit as decor takes many forms, and I love what it represents: the edible made inedible. It can’t satisfy the appetite, and yet it’s somehow still so...satisfying. It’s biblical, you know, because forbidden fruit. A bowl of fake fruit is an illusion of abundance; it will never feed you.My latest obsession are these beautiful Italian wax food candles sold at John Derian, the eccentric, expensive home goods store that has no equal. (On my last visit to the store, there was a robotic black cat waving in the window.)High-rollers can get the two-wick, red-wax cheese wheels with a wedge missing. Elaborate faux-frosted cakes in an array of tier options ($58 to $68). The fruit candles, however, are some of the most affordable things in the shop, and I want all of them. The bulbous eggplants and spiky artichokes. Firm bananas and shiny apples. Those are all around $18 to $25, depending on the size. They’re expertly painted. It looks like they were plucked from a fruit bowl in a Renaissance still life and made 3D. I don’t like to have things that go unused, so I’d probably burn them when people are over to watch them melt into colorful puddles.Do people give “host/hostess” gifts still? If so, this is a great one—better than any random bottle of wine that’s gonna gather dust in a cabinet. It fits into a stocking, if that’s your kink. It’s perfect for the person with better taste than you who is impossible to buy for. And when’s the last time you saw a pillar candle, anyway? Lighting is always in demand. Or you can gather an assortment in a bowl and wait for unsuspecting guests to take a bite.Buy them: Cereria Introna Candles, $15 to $68 at John DerianAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendGiftsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-20", "author": ["Condé Nast", "Alex Beggs"]}