{"id": "bdd1abc8336fdc31912393727b66d4f2", "url": "https://www.bonappetit.com/story/best-juicy-lucy-minneapolis", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Who Makes the Best Juicy Lucy in Minneapolis? I Ate at 9 Spots to Find Out | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWho Makes the Best Juicy Lucy in Minneapolis? I Ate at 9 Spots to Find OutThe Juicy Lucy isn’t your average cheeseburger. And this wasn’t your average trip to Minnesota.By Alex DelanySeptember 13, 2018FacebookTwitterEmailFacebookTwitterEmailI am a burger purist. I have unrelenting opinions about cheeseburgers, and none of them have budged for years. I know what I like in a cheeseburger. Or at least I thought did, until I started doing research for my trip to the Twin Cities to find the best Juicy Lucy (also spelled Jucy Lucy) in town. I started questioning my burger beliefs. The Juicy Lucy has that power.If you’re not familiar with the Juicy Lucy, let me introduce you. A Juicy Lucy is a cheeseburger, with cheese inside of the burger, instead of on top of it, two ground beef patties sealed around a small stack of cheese.The Juicy Lucy at The Groveland Tap\nYeah, the rest of it goes pretty much as you’d imagine. It gets thrown on a griddle, put on a bun, and when you bite into it, well, you get a beautiful waterfall of cheese. It’s a spectacle to behold (and especially dangerous if you’re wearing a white shirt). But like all burgers, some Juicy Lucys are better than others. These are the factors I considered when judging the best:The CheeseI don’t want any new-school cheese options. I don’t want anything fancy. I want American cheese, the not-quite-cheese that melts like no other. (I share this preference for regular burgers too.) The American cheese in a Juicy Lucy should be melted all the way through and get a little bit messy when you bite into it. It’s that moment when you bite into the burger, revealing a cascading river of dairy that seems to only exist in slow motion, that the joy of a Juicy Lucy becomes visible. You can see the looks on people’s faces: They are enjoying this.The BeefThe patties present the largest possibility for error in the Juicy Lucy equation. To start, they have to be beef patties, and they have to be well-seasoned. There’s nothing more disappointing than good but under-seasoned ground beef, and adding more cheese won’t distract from that. Then there’s the griddle technique. A deep sear is crucial for a Juicy Lucy. The sear provides some crunchy, textural variety, making the burger more interesting to eat.Me, probably delivering some trivial opinion about a cheeseburger\nThe ToppingsSince we’re not putting cheese on top of the patty, a Juicy Lucy looks pretty barren. But that’s the way it should be. Our focus is on the simplicity of the creation, but pickles and, less frequently, onions are the most commonly seen additions to cheese, beef, and bun. The topping selection isn’t necessarily about what is best, but what adheres to tradition. A Juicy Lucy is not about an array of toppings. It’s about the execution of the core ingredients.The BunThere is no place for a fancy bun in the Juicy Lucy world. Like the cheese, the bun should not be trying to prove anything. I don’t want brioche or ciabatta or sourdough whatever. I want a soft, simple bun that will let the glory of the meat and cheese do the talking. The bun is there to soak up grease and give you something to hold onto.The beautiful, cheese-heavy Juicy Lucy at The Nook\nAnd The Best Juicy Lucy in the Twin Cities Is…Served at The Nook, a St. Paul sports bar. The burger has a crispy, brown sear that gives the American cheese some sturdy walls to live in. And inside, the cheese is melted to 100 percent of its gooey, oozy potential and applied with a heavy hand, while the bun is as humble and unassuming as I could hope for. The Juicy Lucy at The Nook was a master class in the art of simplicity, and if you know anything about the simple stuff, you’ll know that these are the hardest things to pull off. When I was eating this burger, I wasn’t thinking about anything else. My brain was filled with beef, cheese, and bread. It was the burger in its finest form.But my love for The Nook didn’t stop at the Juicy Lucy. The decor or vibe of a place doesn’t factor into my overall judging of the food, but the atmosphere at The Nook was special. When you walk in, The Nook looks like any small, local sports bar. At the front of the space is a curved wooden bar, surrounded by a television, clean pint glasses, a seasoned bartender, and a mix of American and Irish tap handles. But if you bang a quick left and take a jaunt down the set of stairs, you’ll end up in an eight-lane bowling alley (the old school kind, without any kind of computerized scoring system), where there’s a skeeball machine, vintage neon signs, and a narrow bar surrounded by walls completely covered in dollar bills.This is where I want to be on every Friday night for the rest of my life, eating the best Juicy Lucy in the Twin Cities. But I live halfway across the country, so for now, I’ll just have to reminisce fondly on the time that I shared with The Nook’s Juicy Lucy, until we meet again.Want to make some Juicy Lucy sliders? Here ya go:Juicy Lucy SlidersMagical mini versions of Juicy Lucys, cheese-filled burgers that hail from Minnesota.View RecipeExplore Bon AppétitMinneapolisBurgersCheeseBeefTravelVideoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-13", "author": ["Condé Nast", "Alex Delany"]}