{"id": "bde77205dcaae0ae0059102d669c90db", "url": "https://www.bonappetit.com/story/dawn-summer-is-sweet", "year": 2021.0, "month": 6.0, "day": 1.0, "content": "This Summer Has Been a Long Time Coming | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Summer Have Your Sundae and Eat it TooEverything I'm cooking to kick off the season.By Dawn DavisJune 3, 2021FacebookTwitterEmailPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeFacebookTwitterEmailI work with the most food-obsessed group of chefs, home cooks, journalists, and designers you’ll ever meet. They have strong opinions on everything from what constitutes a well-stocked pantry to which brand makes the best Dutch oven. Yet even we are ready to banish those Dutch ovens to the back of the cabinet, not to be seen again until the fall. We’re ready to get out and explore the great outdoors as Nicole A. Taylor implores us to do in her Juneteenth article.If you, like us, are balancing the impulse to be outside with the desire to transform all those colorful, seasonal fruits and vegetables overflowing at the farmers markets into delicious meals, you’ll be delighted by what we’ve been cooking up. With blue skies calling, we challenged ourselves to design two dozen recipes that will get dinner on the table in 30 minutes, give or take.We have a grilled chicken dish in which tomatoes mix with fragrant oregano, tangy yogurt, and salty feta, which transported me to Greece after a single whiff. This dish will be in heavy rotation at my place this summer. We’ve got crowd-pleasing carbs inspired by Italian traditions; the raves for the Sheet-Pan Gnocchi are already spreading like wildfire through the office. Taiwanese ingredients lend wonderful complexity to a Watermelon Salad with Snap Peas created by a new member of our test kitchen, Jessie YuChen. Meanwhile Ned Baldwin, chef-owner of Houseman in New York City, shares a recipe for a cold shrimp salad influenced by his childhood in the Pacific Northwest. I would be remiss not to mention two dishes that highlight the essence of what summer has come to mean to me now that I’ve spent so much time in Cape Cod: a seafood boil and a grilled swordfish with tomatoes and briny Castelvetrano olives—my favorite—that tango for attention.Desserts are harder to make in a time crunch, but chef Chrissy Tracey, a host on Bon Appétit’s YouTube channel, shares a flavorful workaround: the Rum-Soaked Fruit Sundae pictured above. (If the kids don’t go to bed on cue—do they ever on a lazy summer night?—you can skip the rum.)With all of the inspiration in this issue, it turns out you can have your sundae and eat it too; you can cook delicious food and still hike, swim, surf, and read in a beach chair (Danielle Dreilinger’s The Secret History of Home Economics is up next for me).Explore Bon AppétitLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-03", "author": ["Condé Nast", "Dawn Davis"]}