{"id": "bdefefb02cc5e84c72f6525e1b474911", "url": "https://www.bonappetit.com/story/making-perfect-pizza", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "The Bon Appétit Test Kitchen Made the Perfect Pizza | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureNobody’s Perfect, Except for This PizzaComing up with all the recipes for each component was such a mega-mindmeld, we had to make a TV show about it.By Carla Lalli MusicApril 25, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.People ask me all the time if working at Bon Appétit is as fun as it looks in our videos, and the answer is yes. I just got back from a 10-day trip to sunny California to promote my cookbook, and I actually missed my coworkers. That’s not supposed to happen! But if you’re going to spend more time at the office than you do anywhere else, you need to love the people you work with, and I love the heck out of these people.I think that’s why I laughed so hard throughout the filming of our new five-part video series, “Making Perfect Pizza,” which is the first time that the entire Bon Appétit food team has ever worked together to create one single recipe. Lucky for you, we caught it on tape.Doesn’t that look good?\nPhoto by Molly BazWant this letter before it hits the website? Sign up for our newsletter!For the new series, which is now streaming on your TV through our Bon Appétit channel, we formed a many-headed kitchen monster to devise perfect recipes for all of the components that go into making the ultimate pizza, from the charred crust on the bottom to the fresh basil fluttering on top. In the first episode (which is now available on YouTube), Claire Saffitz tackles the dough, then hands off to Brad Leone and Andy Baraghani, who tasted dozens of canned San Marzano tomatoes in their quest for the most delicious pizza sauce. (The winning brand will definitely surprise you.) Molly and I felt it was important to go all the way to Campania, Italy, to taste and make fresh mozzarella cheese—and in the third episode you can see us do exactly that, then hit rock bottom as we try to recreate what we learned back in the test kitchen (with jetlag, to boot). Don’t worry, we nailed it before passing the baton to Chris Morocco and Andy to go to work on toppings. I’m still mad that they rejected both spicy sausage and n’duja.Photo by Alex LauFor the final episode, we drove up to Connecticut to cook in an actual wood-burning oven (at my parent’s house!) and take votes on the final pie. Behind the scenes, there was some Survivor-ish alliance-building in the works, but the final pie was a unanimous winner.If you think great minds think alike, you’re wrong—we judged, we needled, and we pushed each other during each phase of development, the same way it always works when there’s a new recipe in the works. But my coworkers are.Get the recipe:Bon Appétit's \"Making Perfect\" PizzaWith the amount of love, time, and research that went into making what constitutes the “perfect” pizza, you’ll definitely want to share. Welcome to the best-ever excuse to invite people over for a pizza party.View RecipeExplore Bon AppétitCarla NewsletterPizzaRead MoreCast-Iron Pizza with Fennel and SausageSalad PizzaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Carla Lalli Music"]}