{"id": "be05258cf4f5eb81b43b1f4912860c30", "url": "https://www.bonappetit.com/story/spatchcock-chicken-lessons", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "I Learned Some Lessons Spatchcocking a Chicken | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Learned Some Lessons Spatchcocking a ChickenA flat bird is (usually) a good bird—except when you ignore the directions.By Adam RapoportFebruary 12, 2019FacebookTwitterEmailPhoto by Alex Lau, styling by Claire SaffitzFacebookTwitterEmailEvery Monday night, Bon Appétit editor in chief Adam Rapoport gives us a peek inside his brain by taking over our newsletter. He shares recipes he's been cooking, restaurants he's been eating at, and more. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.“They don’t always behave!”That’s what’s Carla Lalli Music texted me after I made her famous, skillet-roasted spatchcocked chicken, and it completely didn’t turn out how it was supposed to.Which is to say, crackling crisp skin, with juicy—never dry!—meat, and a pan sauce redolent of salty drippings, white wine, fresh herbs, and butter. All in 30 minutes flat, as Carla frequently advertises, like some late-night infomercial host.Now, in Carla’s defense, I will admit this: I didn’t exactly follow directions. Nor a recipe. Nor anything other than my not-so-correct instincts.It was this past Friday night. I went to the butcher after work and asked the guy behind the counter to spatchcock a three-pound bird—that is, remove the backbone, and flatten it like an opened-up history textbook.Want this letter before it hits the website? Sign up for our newsletter!Spatchcocking accomplishes two things: A) It allows the skin—all of the skin—to crisp up beautifully when the bird is roasted in a skillet, chicken-under-a-brick style, as the Italians call it. B)  Because the chicken lays flat, it cuts the cooking time in half compared to a typically roasted whole chicken.An even smaller cut means an even smaller version.\nPhoto by Chelsie Craig, Food Styling by Dana BonaguraA win-win all around, right?Well, except that I should have let the pan heat up far more, so when you lay the bird in, skin-side down, it immediately and aggressively sizzles like some ASMR video.I set the oven to 400 degrees instead of the prescribed 500. I never reached for a digital thermometer so I would actually know when the chicken was done (160 degrees internal temp is your aim). Failing to do all this meant I had to finish the chicken on the stove top, which worked okay, I guess, but was far from ideal.Paired with potatoes, what could be bad?\nPhoto by Adam RapoportI still made a literally finger-licking pan sauce, my wife and I still polished off a bottle of wine, I got the gram (see above!), and Friday night dinner was saved.But I guess the moral of the story is, do like Carla, not like Rapo. Take 3 minutes and watch this clear-as-day video. Or follow this recipe for a modified chicken under a brick, using boneless (but skin-on) chicken thighs. And impress your husband or wife or dinner guests or whomever. Guaranteed.Oh, and one more thing—after you remove the screeching-hot skillet from the oven and it’s sitting on your stove top, make sure you keep a dish towel draped on the handle so you don’t unwittingly grab it with your bare hand. Yes, I learned that lesson the hard way, too.Get the recipes:Chicken Under a Skillet with Lemon Pan SauceChicken Under a Brick in a HurryExplore Bon AppétitAdam NewsletterChickenRead MorecultureCast-Iron Skillets: How to Season, Clean, and Cook with Them FOREVERGallery7 SlidesBy Christina ChaeycookingThe Secret Ingredient Your Weeknight Pasta Is MissingBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-12", "author": ["Condé Nast", "Adam Rapoport"]}