{"id": "be230065d8bb981f2a52b78ee20924f3", "url": "https://www.bonappetit.com/story/piccata-anything", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "Piccata Sauce is a Lemony, Briny, Buttery Topping for Any Roasted Winter Vegetable | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPiccata Makes Any Winter Veg Taste Like It's on Spring BreakMiami, here we come! By Caroline LangeJanuary 24, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina Boytsova FacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.It’s the time of year when my cooking brain mirrors the market: stolid but boring, grasping for any kind of sparkle. I want bright, not braised. I want the easy effortlessness of summer eating, but here we are, in slushy midwinter, when almost everything demands the low-and-slow treatment. It will be a long time before it’s salted-tomatoes-and-nothing-more season, and this makes me feel almost desperate, as though upon sight of  another stew or grain bowl I might drop everything and run.While no one would call lemony piccata sauce summer eating exactly, it doesn’t feel that far off in February, when you’re wearing three sweaters and can’t remember the last time you saw blue sky. Piccata is true to its name, sharp and puckery, but it’s also quick and luxurious, a sunbeam to sit in while waiting for spring. It’s essentially a warm vinaigrette that you sizzle together in a frying pan: fat (butter, in this case), acid (lemon juice and slim half-moons of lemon, which you cook in the butter to ease their bitterness), biting alliums (minced shallot and garlic), and capers for briny funk. There’s a good chance you already have all those things on hand—so as long as you’ve got something to piccata, making it won’t require a trip to the grocery store.That “something to piccata” is traditionally chicken or veal, often served over spaghetti. Long pasta is ideal for catching and tangling with the sauce, but the meat is negotiable: Lately, I’ve been swapping it out for simply cooked veg like roasted squash or cauliflower, crisp-tender sautéed broccoli, even wilted greens. It isn’t really about the vegetables here; it’s about the sauce, which I personally could sip from a soup spoon, directly out of the pan.About that sauce: Once you’ve started your “something to piccata”—either in the oven or on the stove—the sauce itself takes less than 10 minutes start to finish.Here’s how I do it:Add 4 Tbsp. unsalted butter, 1 finely chopped shallot, 1 clove minced garlic, ½ lemon, cut into thin half-moons, and a fat pinch of salt to a medium skillet set over medium heat.Cook, stirring occasionally as the butter melts, until the shallot is soft, about 3 minutes. Lower the heat if the garlic or shallot begins to brown—your goal is only to soften them.Stir in 3 Tbsp. lemon juice (from 1 lemon) and 1½ Tbsp. roughly chopped capers and cook another 2 minutes, stirring constantly, then add ¼ cup broth or water and bring to a gentle simmer, stirring until the mixture is emulsified and glossy.Remove from the heat and taste. Adjust salt and pepper as desired.Drizzle on the roasted or sautéed vegetables, sprinkle with chopped parsley, and serve immediately.With piccata in your arsenal, the prospect of yet another hardy winter veg is a lot less bleak, and a ho-hum crisper-drawer clean-out can be a proper dressed-vegetable side dish. Or present it over pasta or with crusty bread for swiping and dipping. Suddenly, you’ve got a full-fledged meal that’ll take you all the way to spring.Caroline Lange is a recipe tester and developer, private chef, and food stylist living in Brooklyn.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-24", "author": ["Condé Nast", "Caroline Lange"]}