{"id": "be2441971ae6ca16767d88245749f016", "url": "https://www.bonappetit.com/recipe/super-lemony-olive-oil-cake", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "Super Lemony Olive Oil Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSuper Lemony Olive Oil CakeBy Mina StoneOctober 5, 20213.8(155)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThe name gives it away, but it’s true: Mina Stone’s olive oil cake is super fragrant with lemon, extremely moist thanks to extra-virgin olive oil, and the interior is as yellow as the sun. This recipe comes (fittingly) from her new cookbook, Lemon, Love & Olive Oil, which revisits dishes throughout Stone’s life, especially ones she learned from her Greek grandmother. “The most important thing I’ve learned from the women in my family is to cook with love, abandon, and an absence of fear,” writes Stone. Traditionally, Greek olive oil cake uses orange juice and zest, but on a day she ran out of oranges, Stone substituted in lemons and the rest is history. Or, er, this recipe.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevron9\" Springform Pan$17 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonIngredients10–12 servings1½cups extra-virgin olive oil, plus more for pan3large eggs1¼cups (250 g) plus 1 Tbsp. granulated sugar1¼cups whole milk2tsp. vanilla extractZest and juice of 2 lemons; plus more zest for serving (optional)2cups (250 g) all-purpose flour1tsp. Diamond Crystal or ½ tsp. Morton kosher salt½tsp. baking powder½tsp. baking sodaPowdered sugar (for serving)Special EquipmentA 9\"-diameter springform panPreparationStep 1Preheat oven to 350°. Lightly oil pan with a pastry brush. Line bottom with a parchment paper round and brush parchment with oil. Whisk eggs, 1½ cups oil, and 1¼ cups sugar in a medium bowl until smooth. Add milk, vanilla, and zest and juice of 2 lemons and whisk to combine.Step 2Whisk flour, salt, baking powder, and baking soda in a large bowl to combine. Make a well in the center and gradually pour egg mixture into well. Whisk, using circular motions to slowly incorporate egg mixture, until batter is mostly smooth (some lumps are okay). Scrape batter into prepared pan and smooth surface. Sprinkle remaining 1 Tbsp. sugar over.Step 3Bake cake until top is golden brown and a tester inserted into the center comes out clean, about 50 minutes. Transfer pan to a wire rack and let cake cool before unmolding.Step 4Just before serving, dust cake with powdered sugar and top with more lemon zest if you have it.Do ahead: Cake can be baked 3 days ahead. Store tightly wrapped at room temperature.From the book Lemon, Love & Olive Oil by Mina Stone. Copyright © 2021 by Asimina Stone. Published by Harper Wave, an imprint of HarperCollins Publishers. Reprinted by permission.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Super Lemony Olive Oil Cake?Leave a ReviewTell us what you thinkReviews (57)Back to TopTriangleAn amazing cake. I decorated it with crushed pistachio, lemon rind and rose petalsIzzyHudson Valley 3/13/2022I absolutely loved this recipe. Followed the instructions to a T, but had to bake for 20 min longer (the cake was still jiggling a bit after 50 min). The end result was an incredibly rich, moist lemon pound cake-like cake that stores super well. The only change I would make next time is increasing the lemon juice and zest to 3 lemons, since I expected a stronger lemon flavour based on the title. AnonymousOttawa2/16/2022Has anyone tried this recipe using yogurt, instead of milk?Ann T. NJ1/31/2022I made this cake exactly per the recipe, but had to use a square pan since I didn't have a springform pan. Only after I stuck it in the oven did I bother to look at the comments and was immediately worried I had wasted time and ingredients on a bad recipe. Nonetheless, I was pleasantly surprised! I used a Wegmans EVOO and very fresh lemons, so the lemon flavor is excellent. I did have to bake it for 20 minutes longer than the recipe says as the middle will completely uncooked after 50 minutes. If I make this again, I will try the 1c of EVOO and 3 lemons variation suggested in the comments but all in all I'm happy with my result.JulianaArlington, VA1/30/2022I am usually not a desserts person, and I love this cake. It’s not too sweet, and the lemon and olive oil are wonderful contrasts of bright and early. I usually use slightly less oil (1.25 cups) and replace the missing .25 liquid with lemon juice. I’ve been making it with 1:1 gluten-free flour with fabulous results. Thanks, BA! Andrea Brooklyn, NY1/23/2022I wouldn't make this cake again. \n\nI listened to the guidance of the reviews and reduced the oil to one cup and upped it to three lemons. The texture was nicely dense and moist, but the flavor was strange. No issues with the cake being oily, likely because of the reduced amount of evoo, using room temp ingredients, and whisking well to ensure emulsion.\n\n I will say, I forgot to put in the the vanilla extract. Once I realized the omission, I referenced other recipes and found many don't include vanilla. To be on the safe side, I made a vanilla drizzle to put on top, which did negate the strange aftertaste a bit. \n\nOverall  I'd give it a Prue Leith, \"not worth the calories\".\n\nFor reference I made it with a single estate Palestinian olive oil.CassieMichigan1/23/2022I have generally found bon appetit's recipes to be reliable and good but in this case, I'm sorry to say I was sorely disappointed.\nIt took over an hour to bake and then it was crunchy around the sides and still mushy in the middle.\nWorse yet, it oozed oil from the bottom of the pan and when I ate a piece, it was disgustingly oily and \nsimply inedible. I ended up throwing the whole thing into the garbage.\nThe recipe is simple and I know how to bake, so I know I didn't make a mistake with it.\nWhat a waste of time and ingredients!\nVivianCanada1/14/2022Awesome soup!!! Gwen GleasonMilwaukee, WI1/13/2022Awful ! Wasted one and a half cups good olive oil it’s so heaven and tastes way to oily Maryann KuehlIL1/10/2022Excellent recipe! I just made this with a beautiful extra virgin oil from Portugal, Bob’s Red Mill 1to1 gluten free flour AND Oatly oat milk. It still (with all the weird substitutions for my weird sensitivities) came out incredibly DELICIOUS. More like a sumptuous pound cake/lemon bar. Will be in heavy rotation for me from here on out.GretchenBend, Or1/4/2022I absolutely loved it! It came out exactly as pictured.  I, like other reviewers, used 1 cup EVOO and juice of 3 large lemons. There is no oily taste and it's very lemony and fragrant.  It is not a chiffon or airy type of cake. Its dense, very moist, and will remind you more of a cheesecake... exactly as described and pictured.  Perhaps those with negative experiences were using cooking olive oil instead of rich, green EVOO? I was making this along with a couple other cakes for a holiday party so my springform pan was already in use. I used a regular 9\" round cake pan with parchment paper and it worked just as well. The cake doesn't rise much so it didn't overtop the pan while baking.  Guests loved it!Suzanne Charlotte NC 12/30/2021This is the best lemon cake I have ever had, so moist with a beautiful burst of lemon flavor perfect amount of sweetness! I roped mine with a homemade lemon glaze! ❤️ This is my favorite recipe. Blake GMinnesota 12/29/2021Beautiful cake, made exactly as written. Important to whisk very well to emulsify oil, eggs, and sugar completely before moving on to next steps. Large, ripe lemons are also must. I ended up with about 3/4 cup juice and zest. Batter will be foamy and almost suspiciously thin, but trust the process. Final product is rich and delicious. Sara S.Philadelphia, PA12/22/2021Too much oil, very heavy, not at all the light, refreshing cake I was hoping for. I ended up throwing most of it away. Liz San Diego, CA12/22/2021I wanted to like this cake but it was just not very pleasant. For whatever reason, it wasn't quite lemony enough. I felt like perhaps there was too much olive oil in the cake. It was not as light or refreshing as I wanted it to be. I would have appreciated a nice glaze or something, too. Unfortunately, I ended up throwing most of it away in the trash can. AnonymousSan Diego, CA12/22/2021Explore Bon AppétitOlive OilLemonCitrusFruitCakeDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-05", "author": ["Condé Nast", "Mina Stone"]}