{"id": "be251b21d3f870644c5de5ececd46ac0", "url": "https://www.bonappetit.com/story/soggy-sandwich-love", "year": 2018.0, "month": 2.0, "day": 4.0, "content": "In Defense of the Soggy Sandwich | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIn Defense of the Soggy SandwichSometimes wetter is better.By Tyler KordFebruary 26, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailFor some reason, people, including the editors of this magazine, get stressed by the word soggy. That’s ludicrous. It’s not like commercial sandwich bread is so good it can’t benefit from being partially saturated by the tasty things you’ve piled on top. Plus, trying to keep bread from getting soggy is like building fences at Jurassic Park: Nature will find a way. Your sandwich will get soggy, like the roll of a meatball sub soaked in marinara, or a hot roast beef sandwich that’s dunked in beef broth or covered in gravy. Bread soaked in deliciousness—that doesn’t sound so bad, does it? If anything, I should give tips on making sandwiches soggier! Here are three:Close ContactPut wet ingredients directly onto the bread so the moisture has access to its bread sponge instead of building up on a stupid piece of lettuce you foolishly used as a sog guard and then running onto your lap.Use That LiquidStop draining everything so well! Tomato juice and pickle brine can make a dry sandwich just as juicy as a fatty piece of meat.Under PressureDon’t have time to let the juices naturally soak through your bread? Make like a muffuletta and apply pressure with a heavy book or a handful of dry sandwiches.Try some of these soggy sandwiches:Broccolini CheesesteaksA healthyish take on the classic Philly cheesesteak, these party-ready sandwiches are packed with roasted broccolini, a tangy romesco sauce, and of course, lots of cheese. View RecipeSausage, Peppers, and Onions SubsAin't no party like a sandwich party.View RecipeSausage Meatball SandwichesView RecipeCheesesteaksLook for short ribs with the most marbling possible for these cheesesteaks; if you really want to splash out, use boneless rib eye.View RecipeThe BA MuffulettaThere is no better beach, picnic, or party sandwich: It feeds a crowd, gets better as it sits, and is a hearty meal built inside a loaf of bread. View RecipeTyler Kord is the author of A Super Upsetting Cookbook About Sandwiches (Clarkson Potter).Explore Bon AppétitSandwichRead MorecookingThis Broccolini Cheesesteak Is the Sandwich You NEED Right NowBy Mike SolomonovcookingA Homemade Cheesesteak Is a Thing of BeautyBy Chris Morocco and Brad Leonerecipes18 Grilled Cheese Recipes That Prove Perfection Does ExistGallery18 SlidesBy Rochelle BilowRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-26", "author": ["Condé Nast", "Tyler Kord", "Brad Leone"]}