{"id": "be364647f9507a8461522e98deb12d0f", "url": "https://www.bonappetit.com/recipe/ginger-grapefruit-gandt", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "Ginger Grapefruit G&T Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredGinger Grapefruit G&TMelissa Miranda shares her version of a Bombay & Tonic taking inspiration from the Philippines with a riff on the Gin Pom. With grapefruit, ginger, cardamom bitters, a squeeze of lime, and Bombay Sapphire, this drink will remind you of being on the beach. By BOMBAY SAPPHIRE® GINJune 22, 20215.0(4)Read ReviewsTriangleEmailPinterestPrintTed + Chelsea CavanaughEmailPinterestPrintEmailPinterestPrintIngredients1½ oz. Bombay Sapphire3large grapefruit peel strips, plus 1 more for garnish2oz. premium tonic water1½ oz. fresh grapefruit juice1packet sugar in the raw (1 tsp.)1dash cardamom bitters½tsp. freshly grated peeled ginger¼oz. fresh lime juicePineapple leaf, for garnishPreparationStep 1In the bottom of a cocktail shaker, add the sugar and three strips of grapefruit peel and muddle together to bring the natural citrus oils out. Step 2Add the Bombay Sapphire Gin, grapefruit juice, lime juice, dash of cardamom bitters, and ginger. Stir to combine.Step 3Fill a balloon glass with ice and strain the grapefruit and gin mixture into the glass. Pour in the tonic water. Step 4Garnish with a skewered piece of grapefruit peel and pineapple leaf.Click to Shop Bombay Sapphire NowBE BRILLIANT AND INSPIRED. DRINK RESPONSIBLY!©2021. BOMBAY SAPPHIRE AND ITS TRADE DRESS ARE TRADEMARKS.IMPORTED BY THE BOMBAY SPIRITS COMPANY U.S.A., CORAL GABLES, FL. GIN - 47% ALC. BY VOL.How would you rate Ginger Grapefruit G&T?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleLoved the fresh ginger.  It really made it a treat.Anne PomerSacramento ,CA7/25/2021Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-22", "author": ["Condé Nast", "Bombay Sapphire"]}