{"id": "be39c0894aff240fdaf73f8b06e1c6dc", "url": "https://www.bonappetit.com/story/i-think-about-these-a-lot", "year": 2019.0, "month": 12.0, "day": 3.0, "content": "I Think About These a Lot | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Think About These a LotEnd-of-year reading recommendations from Healthyish editor Amanda ShapiroBy Amanda ShapiroDecember 19, 2019FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie TheodorouFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’m a sucker for a good “best of” list. In fact, every year around this time I wonder why I bothered consuming anything in the 11 months prior, when I could’ve just waited for someone else to sift through the crap and tell me what’s worth my time. But, as someone who puts daily content into the world like it’s literally my job, I have a hard time pulling together “best of” lists of my own. Sure, we can crunch the numbers and come up with the most popular Healthyish recipes of 2019 (you’ll hear about that later this week), but when it comes to choosing my favorites, well...I love all my Healthyish children! So instead of a list of “bests,” I want to talk about the things we published in 2019 that, for one reason or another, I still think about all the time.I’ve always wanted Healthyish to be a platform for people to tell their own stories. T. Wise’s piece about his dependency on weed was one of the most honest and vulnerable things I’ve read about cannabis. David Tamarkin’s essay on cooking through his obsessive-compulsive disorder (and the gorgeous illustration by Daniel Salmieri) made me consider my own relationship to cooking and mental health in a new way. In her essay about vacation photos, Zan Romanoff managed to capture an entire generation’s ambivalence toward documenting our lives on camera—and having our lives documented by others. Every I Did the Thing column that Rachel Sugar writes makes me laugh and/or cry, but I think most often about her foray into the Wim Hof method, and the line, “There is a certain openness that comes from misery.” And speaking of crying, Amiel Stanek and Lauren Schaefer’s goodbye-to-New-York essay masquerading as a dinner-party guide truly did bring me to tears, and not just because they don’t live six blocks up the street from me anymore.I think a lot about escaping to this tropical bubble outside of Berlin.\nPhoto by Jenny PeñasThe headline of Alex Ronan’s great reported essay (along with Jenny Peñas’s haunting photos) pops into my mind every time there’s another bout of freezing rain in NYC. Profiles are tricky to write, and double profiles are near-impossible, but David Tamarkin wrote the hell out of this one. And I think about Arielle Gordon’s feature on wellness at the club (ahem, the clurb) every time I order a house-made celery soda or a coconut water to sip while I dance.I love writing this newsletter so much, and I’m grateful to you for reading it. I felt a lot of emotions while writing this ditty about the restaurants that define New York for me. The Healthyish Guide to Your 30s was planned months before my own thirtysomething crisis kicked in, but this essay, a version of which went out as a newsletter, was very cathartic to write and, judging by the messages I got, it hit home for you guys too.I think about this steamer all the damn time. This tumbler too.I make Chris Moroccco’s miso-glazed salmon recipe so often it should have its own line item in my budget. And speaking of budgets, listen up: An entire skillet of Big Flavor Broccoli (another Morocco hit) will run you about $5 as long as you have anchovies and Parmesan on hand. The first time I made Sohla El-Waylly’s squash bowls with yogurt sauce, I complained about it (so many ingredients in that sauce, so much tossing of onions)...then proceeded to make it three times in a month. And speaking of squash, some people handle the onslaught of winter with SAD lamps and antidepressants. I make Lauren Schaefer’s Butternut Squash Parm.Okay, time to stop dwelling on the past and start thinking about the decade ahead...or at least those presents we still have to buy. This newsletter will be back on January 1st. Until then, enjoy some never-before-seen footage of me dining out.Until 2020,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyle10 of My Best Holiday Gift Ideas Because We’re All STRESSED About ItBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-19", "author": ["Condé Nast", "Amanda Shapiro"]}