{"id": "be3a23781e9831c25dfcc8a25a194e07", "url": "https://www.bonappetit.com/recipe/champurrado", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Champurrado Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueChampurradoBy Yewande KomolafeNovember 23, 20213.7(4)Read ReviewsTriangleEmailPinterestPrintPhotographs by Josephine Schiele. Food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintChampurrado is a type of atole, a hot Mexican drink thickened with masa. Chocolaty and spiced (with cinnamon and just a pinch of cayenne), it’s the perfect way to warm up on a cold day, and a little cup goes a long way. This recipe comes from Yewande Komolafe in the Waffles + Mochi cookbook. (Read more from the creators of the children’s food show here.)All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronLarge Saucepan$60 At AmazonLadle$27 At AmazonWhisk$10 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients8 Servings¾cup masa harina4oz. Mexican chocolate or dark chocolate, coarsely chopped½cup chopped piloncillo or ¼ cup (packed) dark brown sugar1tsp. ground cinnamon½tsp. Diamond Crystal or ¼ tsp. Morton kosher saltPinch of cayenne pepper (optional)1cup milk, heavy cream, or nut milk of choiceChocolate shavings (for serving; optional)PreparationStep 1Place masa in a large saucepan. Gradually stream in 6 cups water, whisking constantly. Set pan over medium heat and bring mixture to a gentle simmer. Cook, whisking often, until thickened, 13–17 minutes.Step 2Reduce heat to low and add chocolate, piloncillo, cinnamon, salt, and cayenne (if using) to masa mixture. Cook, whisking, until chocolate is melted and sugar is dissolved. Stir milk into champurrado and ladle into mugs. Top with chocolate shavings if desired.Excerpted From ‘Waffles + Mochi: Get Cooking!’, by Yewande Komolafe (Clarkson Potter). Copyright © 2021.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Champurrado?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleI want to make this, but it sounds like it makes a LOT.  I'm just one person.  How long will it keep?KarenSisal, Mexico1/28/2022Explore Bon AppétitDrinks5 Ingredients or FewerHot DrinkDrinks AllChocolateOther IngredientsHot ChocolateMasaRice & GrainsCinnamonHerbs & SpicesGluten-FreeMexicanLatin AmericanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Yewande Komolafe"]}