{"id": "be499ca9a2e68d30f63b6acbf34b94bb", "url": "https://www.bonappetit.com/story/hakka-shallot-sauce", "year": 2020.0, "month": 10.0, "day": 4.0, "content": "This Hakka Shallot Sauce is Simple to Make and Goes With Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Plan My Meals Around This Hakka Shallot SauceMy grandma's simple sauce goes with practically everything.By Jenny LiaoOctober 26, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Hakka cuisine is the epitome of comfort food. It’s abundantly saucy, deliciously salty, and unapologetically fatty. This trifecta of richness stems from the nomadic farming origins of Hakka people; constantly on the move, they needed simple dishes that could provide hearty sustenance for field work and heavy doses of salt and sauce in order to preserve food during long periods on the road. To escape war, they made their way from northern to southern China in the 13th century in search of a safe space to settle down and as a result were seen as perpetual visitors without a homeland. It’s even evident in the name—Hakka written in Chinese is 客家, which means “guest people.” The Hakka formed communities in South China but never fully adopted the customs of the native population. Ongoing feuds led to more forced migrations around the world to countries including Taiwan, Malaysia, Canada, the U.S., and Jamaica.My Hakka family eventually immigrated to New York City, and throughout my childhood I was spoiled by the huge spread of traditional Hakka dishes prepared by my grandma, Ah Po. I always gravitated to her hom gai, which translates to “salty chicken.” It’s a whole poached chicken soaked in a salty brine that makes the meat unbelievably tender. And while I always looked forward to the chicken itself, my favorite part was the shallot sauce that Ah Po served on the side.In true Hakka form, the sauce is predominantly salt and fat, with soy sauce and oil as the base. It’s a simple recipe that calls for an abundance of roughly chopped shallot and ginger, which is steeped in the soy sauce and vegetable oil until the mixture becomes irresistibly fragrant from the infused flavors. My grandma always added a touch of honey too, which she said balanced out the salt from the chicken. Making the sauce was always the last step in Ah Po’s dinner prep, and when the scent of it wafted into my room, I knew it was time to eat.Before I even sat down at the table, I would swirl plump pieces of dark meat chicken into the savory concoction, lay it on top of my bowl of white rice, and wait a few minutes for the sauce to soak through before digging in. The chicken’s texture was enhanced by the oil, turning every bite into a slick, juicy morse with an umami taste I craved incessantly.As I grew older and moved out on my own, I had fewer opportunities to eat hom gai, and poaching a whole chicken for myself wasn’t practical. Instead, I learned Ah Po’s shallot sauce recipe and decided to pair it with whatever I had in my fridge when I found myself feeling homesick.Usually, people select sauces to complement meals, but I started planning meals to complement this sauce. I’ve used it to dip dumplings, dress pasta, glaze green beans, and marinate burgers. It goes well with a variety of different foods and is easy to make with just five ingredients: shallot, ginger, soy sauce, vegetable oil, and honey. Its versatility lends itself to fusion cuisine, which reflects the duality of my Chinese American identity.To make a serving of the sauce, roughly mince 1 medium shallot and a ¼\" piece peeled ginger. Transfer to a small bowl and add ¼ cup soy sauce with 1 tsp. honey and stir to combine. Pour 2 Tbsp. oil into the bowl and give it a final quick stir. For bolder flavor, prepare the sauce before your meal and set aside to marinate for 1 hour before serving. You can store the leftovers in an air-tight container in the fridge for 2–3 days.I can’t claim that this sauce is exclusively Hakka. The Hakka diaspora meant that the cooking style was woven into food culture throughout China, with other Chinese ethnic groups featuring a variation of this sauce in their cooking too. And even though my ancestors didn’t find an official home, I found mine in Ah Po’s shallot sauce. It takes me back to the dinner table at my childhood home in New York City no matter where I am in the world.Jenny Liao is a writer based in L.A. whose work focuses on food as a means to understand and embrace cultures—both others and our own. She is also currently working on her debut children’s book about Chinese foods and the traditions behind them. You can find her on Twitter @jeliao.Explore Bon AppétitIt's That SimpleSauceRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-26", "author": ["Condé Nast", "Jenny Liao"]}