{"id": "be4cd2e890ade347039fe36eb9cd885a", "url": "https://www.bonappetit.com/story/ginger-garlic-paste", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Ginger Garlic Paste - How to Make It and Use It On Everything | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingGinger-Garlic Paste Is the Ultimate Base-Marinade-Batter-RubChef Meherwan Irani on the two-ingredient mixture that makes almost everything taste better.By Sonia ChopraMarch 1, 2021FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.“People ask me, How do I replicate the depth of flavor of really good Indian food at home?” says chef and restaurateur Meherwan Irani, whose growing empire includes six restaurant locations and a spice company across Atlanta, Asheville, and Charlotte. “And the number one thing I tell them is to make a ginger-garlic paste and fry it in oil until you get this beautiful caramelization.”Ginger and garlic are found together so often in South Asian dishes that many cooks keep a jar of homemade ginger-garlic paste in their fridge, both to save themselves the step of peeling and mashing ginger and garlic every time they go to cook and to incorporate flavor more smoothly and evenly. “If I cook just with ginger, I always end up with little fibrous bits of ginger in the food, and you have to be really careful with how you use [chopped or sliced] garlic since it burns so quickly,” Irani says. “This paste is the perfect marriage of both. It has its own taste and smell, but it’s just ginger and garlic.”The formula is as simple as it comes: equal parts peeled ginger and peeled garlic, blitzed together in a food processor with a preserving element. Irani’s recipe is more of a mandate than a list of instructions: Don’t overthink it. “If someone asks, ‘How much?’,” he says, eyeballing it in one of his Instagram Lives, “I’d probably say a cup and a half of ginger, a cup and a half of garlic, and a half cup of liquid—a quarter cup of white vinegar and a quarter cup of water.” On the phone, he tells me that folks could instead add a little oil and a tiny bit of lime juice, just enough to get the food processor going; in my own apartment, I also add a little salt, which Irani doesn’t necessarily recommend himself: “I want control of my seasoning as I’m cooking, and that would be just one more variable that [already] has salt in it.”Before the pandemic, I rarely made it in large quantities because I feared I wouldn’t go through it in enough time—I just wasn’t cooking all that much at home. But these days, I make it by the jar, using it as a base to build flavor. Most often, I’ll throw it into a pan with some oil and spices, maybe a chopped onion, then adding vegetables and whatever else.Ginger-garlic paste, Irani says, is also an incredible marinade. Some Indian dishes like tandoori chicken call for it as the first of two: “The first marinade is usually ginger-garlic paste and/or lime juice, turmeric, and chili powder. And then you come in and do your second marinade, which is your tandoori marinade. That ginger-garlic paste in that first marinade adds such a beautiful foundational layer.”It also works as a batter. At his restaurant Chai Pani, Irani makes a crispy masala fish roll that has a crunchy, golden exterior without any breadcrumbs, panko, or cornstarch—there’s only ginger-garlic paste, plus some spices, oil, and lime juice. “The ginger-garlic paste fries around the fish and forms something almost like a batter, which gives this wonderful crispy, crunchy texture.”So when is it best to play with ginger-garlic paste? If a dish just calls for garlic and it makes sense for it to have the background flavor of ginger, use it. But, as Irani is quick to warn, it’s not a substitute. “It’s not a garlic-plus,” he says. “But anywhere where you think that a touch of garlic or a touch of ginger wouldn’t hurt use ginger-garlic paste.” He recommends adding a tablespoon to marinara sauce after the onions are sautéed, or a teaspoon anytime you’re doing a classic mirepoix. “Slow-braising something? Rub that piece of meat down with some ginger-garlic paste first and then proceed with whatever else you were doing. It helps transform tough cuts by tenderizing the meat even more.”When you’ve hauled down the food processor, you might as well make a big batch: A jar keeps in the fridge for a few weeks and it freezes well in ice cube trays or frozen tablespoon-size scoops for a couple of months, and it works into practically everything.Try Priya Krishna’s Garlic-Ginger Chicken With Cilantro and Mint.\nPhoto by Chelsie Craig, food styling by Kat BoytsovaIf you’ve never used it before, Irani recommends starting here: To ¼ cup paste, add ¼ tsp. chili powder and/or turmeric and some salt and rub down a chicken, then roast or stir-fry it, depending on whether you have a whole chicken or something like 4 chicken breasts. Or take some frozen shrimp, defrost them, and make a batter using ginger-garlic paste, oil, lime juice, salt, pepper, chili powder, and ground turmeric. Dredge the shrimp in the batter and pan-fry them to make a little popcorn shrimp appetizer.“Are there any two more perfect ingredients that are not spices that add flavor to food?” Irani muses to me. “These are building blocks of flavor all over the world. By themselves, they’re both remarkable things to work with. But purée them together and this alchemy happens.”Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-01", "author": ["Condé Nast", "Sonia Chopra"]}