{"id": "be4eb55b132067edec4042e0cfca2c14", "url": "https://www.bonappetit.com/story/zesty-z-zaatar-spice-blend", "year": 2020.0, "month": 1.0, "day": 1.0, "content": "The Za'atar Seasoning I Like Better Than My Teta’s (Sorry, Teta!) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Like This Za’atar Better Than My Teta’s (Sorry, Teta!)Whether on eggs, dips, or avocado toast, Z&Z za’atar makes everything betterBy Brittany ArnettMay 25, 2021FacebookTwitterEmailPhoto by Isa Zapata, food styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Growing up as a first-generation Middle Eastern American, my grandparents drilled into me a few lessons: (1) you must be smart, (2) you must be smart enough to become a doctor, and (3) za’atar makes you smarter. To my Teta and Baba, the logical flow of these arguments would inevitably help me succeed in life, but to me it seemed like little more than a ploy to get me to eat the zayt ou za’atar on the breakfast table (and then go to medical school). Although za’atar is such a staple in Arab regions that it’s practically considered a food group, I seldom touched the dry herb mix my Teta made at home; even when doused in olive oil I could not help but feel like I was eating stale grass.Fast-forward to college in D.C., where I avoided both science courses and za’atar—against my Teta and Baba’s wishes. That is, until I found Z&Z za’atar at a local farmers market. The brand’s particular blend of wild thyme, sumac, and sesame seeds was completely unlike the dry herb mix I ate throughout childhood. It was earthier, tangier, and nuttier—thanks to the freshness of each ingredient and the touch of sunflower oil, which seemed to preserve and enhance the flavor of the herbs and seeds. Compared to my Teta’s, which had a chalky mouthfeel and single-note flavor profile, Z&Z’s za’atar has a complexity and body I never knew a herb mix could have.Z&Z’s za’atar is harvested from various farms around Jenin in the West Bank of Palestine. The plant is called Origanum syriacum—or, Syrian oregano—which Z&Z refers to as wild thyme. In Arabic, the word za’atar is used to describe a number of plants in the Lamiaceae family, like Syrian oregano, wild marjoram, wild thyme, and hyssop—the latter of which makes appearances in ancient texts, like the Bible, and was lauded throughout Western Asia for its flavor and superfood properties (hence the old adage that za’atar makes you smarter). Depending on the source, any of those herbs can be considered za'atar. This might be confusing because in the U.S., oregano is not the same thing as thyme, but it’s a testament to how Middle Eastern food varies greatly from region to region.Z&Z is family-owned and operated by the Dubbaneh brothers, who have made it their mission to bring the cultural symbolism of za’atar from the Middle East to the U.S. In the Arab world, za’atar is present at almost every meal and most often enjoyed with warm bread and olive oil (like man’oushe, which is a round flatbread covered in za’atar and typically topped with cucumbers, tomatoes, and mint). With no exaggeration, I sprinkle this za’atar on practically everything; eggs, chicken, mezze dips, popcorn, and, when I’m feeling especially millennial, avocado toast. Sometimes I even eat it by the spoonful right out of the jar. (My IQ must be off the charts by now!)Although I wasn’t a particular fan of my Teta’s za’atar growing up, tasting Z&Z’s in my first year at college brought back those memories of breakfast with my family and instantly made me feel at home. Eating za’atar and sharing it with my peers was—and still is—a way to make me feel connected and proud of my Middle Eastern roots. So, while I may not be a doctor like my grandparents had hoped, their za’atar wish did come true.Photo by Isa Zapata, food styling by Micah MortonZ&Z Za'atar$11 at AmazonExplore Bon AppétitShoppingHighly RecommendSeasoningRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Brittany Arnett"]}