{"id": "be61816c1df650dac3767bbe0f44c688", "url": "https://www.bonappetit.com/story/just-a-little-meat", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "How I Cook Healthyish When All I Want Is Meat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow I Cook Healthyish When All I Want Is MeatA little goes a long way.By Christina ChaeyOctober 10, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Styling by Dana BonaguraFacebookTwitterEmailEvery other week, Bon Appétit associate editor Christina Chaey writes about what she’s cooking right now. Pro tip: If you sign up for the newsletter, you’ll get the scoop before everyone else.Dear Healthyish friends,Although my normal diet is largely pescatarian, I go through phases a few times a year when, out of nowhere, I develop an overwhelming Flintstonian craving for red meat. When this happens, I typically splurge on a steak or pork chop from a good butcher shop, make myself a medium-rare dinner, and put my carnivorous cravings to bed for the next month or two.I don’t know if it’s the recent chilly spell in New York or the fact that I’m not going out to restaurants (where I tend to do most of my meat-eating) right now, but recently my urges have gone into overdrive. You can only make so many pots of beans and grains and braised greens before you want to give them a little boost in the form of a little bacon or a crumbling of sausage, something to make you forget that this is the 27th pot of beans you’ve cooked for yourself in quarantine. (Or is that just me? Also, no shade to beans. It’s just that between my roommate’s Rancho Gordo bean club subscription and my own beany whims, our pantry is positively drowning in legumes.) And, as I’m sure I don’t need to tell you, willing yourself to eat tofu when what you really desire is skirt steak simply...does not work.I’m using little bits of La Quercia’s pancetta all winter long to flavor soups, greens, and more\nChristina ChaeySo many of my favorite cookbooks (Made in India by Meera Sodha, Every Grain of Rice by Fuschia Dunlop, Six Seasons by Joshua McFadden) espouse a style of cooking and eating that puts vegetables front and center with a bit of meat or fish used almost like a seasoning, the idea being you don’t need much meat to truly satisfy your stomach. Revisiting them recently, I’ve been inspired to start accumulating a small collection of meat products to cook with over the next few months. I’ve frozen a couple of packages of chuck for stews (heavy on the carrots, turnips, and potatoes, please) and a half-rack of pork ribs to flavor a future pot of posole. And after revisiting one of my favorite vegetarian-ish cookbooks (and past BA Cookbook Club pick) Almonds, Anchovies, and Pancetta by Cal Peternell, I impulse-ordered a huge hunk of La Quercia pancetta. That beauty is currently sitting in my fridge, where it’ll keep for weeks as I cut off little hunks of it to season greens, pastas, soups, etc. I’m definitely saving some to make crispy lardons for this Lyonnaise salad, and yes, I will be saving the drippings left in the skillet—how else will I make chef Anthony Salguero’s Salvadoran Super-Refried Beans from our October issue?Have a just-meaty-enough winter,Christina ChaeyAssociate editorUse a li’l meat:Greens with Braised Pancetta and GarlicThis satisfying veg-forward dish proves that sometimes the role for meat is as a supporting actor helping to make green things shine.View RecipeExplore Bon AppétitWhat's Chaey Cooking?HealthyishMeatVegetableVegetarianessayRead MorecultureI Never Loved Oatmeal Until I Started Making It Like ThisBy Christina ChaeyLifestyleThe Summer Drink I’m Bringing Into FallBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-10", "author": ["Condé Nast", "Christina Chaey"]}