{"id": "be71d6519156aa9d005007a8bfc27590", "url": "https://www.bonappetit.com/story/pink-radicchio", "year": 2018.0, "month": 3.0, "day": 2.0, "content": "Pink Radicchio Is Ready For Its Close Up—And Your Plate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingPink Radicchio Is Ready For Its Close Up—And Your PlateMillennial pink just got a whole lot healthier.By Aliza AbarbanelMarch 9, 2018FacebookTwitterEmailFacebookTwitterEmailIt's long been said that we eat with our eyes, and, under the reign of Instagram, it seems truer than ever. Colorful foods are always trending, from activated charcoal ice cream to spirulina-laced smoothies. Last summer, it was all about purple produce. But once pink became millennial, we knew it was only a matter of time before pink radicchio had its moment, too.Radicchio is known for leaves that are hardy, multihued, and bitter in the best of ways. But, out of all its chicory cousins, pink radicchio is one of the least bitter. These days, you'll find it on fashionable menus across the country, like Cafe Altro Paradiso and King in NYC. It’s easy to spot pink radicchio on Instagram, too too. “I don’t know what millennial pink is, but someone told me it’s having a moment right now,” says Zach Zeidman, executive chef at Cafe Altro Paradiso. “This radicchio is not a new thing, but the color is having such a moment, so it’s interesting to see that trend coming into play.”Also known as Radicchio La Rosa del Veneto, pink radicchio is a chicory, which Bon Appetit named \"vegetable of the year\" in 2017. In the United States, the most common kind of radicchio is Radicchio di Chioggia, which sports a cabbage-like bulb of waxy purple-red leaves, studded with thick white veins. However, many varieties exist, some of which have even sought protected geographical status. Lane Selman, an agricultural researcher at Oregon State University and the founder of the Culinary Breeding Network, first noticed pink radicchio several years ago, at the famous T&T Seeds in Chioggia, Italy. Now, she says, she's spotting it across the United States. \"I think it has so much to do with the appearance,\" Selman says. \"Chefs always want something novel, so when something like this radicchio hits the shelf, it takes off. Everyone wants to take a picture of it, and it’s pretty approachable too.\"As its name suggests, Radicchio La Rosa del Veneto is most commonly grown in Veneto, Italy. Accordingly, many restaurants like Altro Paradiso import their pink radicchio straight from the source. Increasingly, however, it’s being grown at farms in California and Pennsylvania, like Campo Rosso. Selman notes that one major obstacle for American radicchio growers is seed variability—seeds from Italian farmers are grown for a different climate and can vary in size and shape when grown in large crops. American farmers are meeting this challenge by a process known as selection, growing crop after crop of pink radicchio and removing the plants with unwanted traits until a more refined seed is produced. Selman estimates that fewer than ten people are growing pink radicchio in the United States, a number that will change in the near future as better seeds develop.For now, look for pink radicchio at your local farmer’s market, Eataly, and the occasional Whole Foods produce aisle. It's slightly sweeter and more mellow than its overtly bitter cousins, and pretty much perfect for salads. “It’s still a very sturdy green, so you can season them pretty aggressively and they’ll really hold up to other ingredients,” says Zeidman. “Start with drier ingredients, like salt and lemon zest, so they get spread out evenly, then add wet ingredients like lemon juice, vinegar, and oil to coat the leaves.” For a finishing touch, Altro Paradiso adds in fresh herbs and a raw egg, which makes for a heartier, creamier salad.And, once your pink salad is assembled, feel free to go ahead and skip the silverware. “If you’re not eating those salads with your hands, you’re not doing it right,” says Zeidman. \"It’s almost like veggie nachos.\" You don't have to tell us twice. Just grab a leaf, snap a pic, and dig in.This radicchio recipe is rad:Radicchio Salad with Pickled Grapes and Goat CheeseView RecipeExplore Bon AppétitHealthyishRadicchioShoppingRead MorecultureThe Lettuce That Chefs Go Crazy ForBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-06", "author": ["Condé Nast", "Aliza Abarbanel"]}