{"id": "be732c6a59ca5a65225d06bc197ec2e3", "url": "https://www.bonappetit.com/story/trade-st-jam-co", "year": 2022.0, "month": 2.0, "day": 3.0, "content": "Want Jam That Tastes Like Fruit, Not Skittles? Trade Street Jam Is for You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingWant Jam That Tastes Like Fruit, Not Skittles? Trade Street Jam Is for YouThis low-sugar, pectin-free jam is for more than just toast.By Aliza Abarbanel and MacKenzie Chung FeganFebruary 18, 2022FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.We love an elaborate toast. Toast with tomatoes gently warmed in ginger-scallion butter. Swedish shrimp toast bursting with dill and topped with roe. Toast with kimchi and cream cheese drizzled with chili oil. But a simple slice of good toasted bread slathered with butter and jam is undeniable. Our only quibble is that most jams are so sweet, it’s impossible to taste the actual fruit beneath all that sugar. Luckily, a Brooklyn-based company is spreading the gospel of actually fruity preserves: Trade Street Jam Co.Founder and chef Ashley Rouse specializes in small-batch, low-sugar jams that place fruit firmly in the spotlight. Trade Street Jam Co.’s smoked yellow peach jam tastes like peak-season peaches at a summer cookout—downwind of the barbecue, bathed in sunshine, still warm and ready to burst. Plum and rose is pleasantly floral without tasting like potpourri, and strawberry, chipotle, and fig is bold and earthy with a lingering smoky finish. Rouse says she has over 200 flavors waiting on an endlessly updated Google doc.Smoked Peach Jam$15 at Murray's Cheese$15 at Trade St. Jam Co.Trade Street Jam Co. began six years ago in Rouse’s apartment on Trade Street in Charlotte, North Carolina. After culinary school, Rouse worked as a chef at the Ritz-Carlton in Charlotte, where her coworkers would organize food swaps to trade home-cooked meals and geek out about farm fresh produce. Rouse began bringing in jam to exchange for pickles and collard green dip, and her passion for preserves soon grew into a bonafide business. She set high standards from the start: no pectin, no preservatives, and as little sugar as possible.“I always just tell our customers, ‘You’re not buying sugar; you’re buying fruit,’” says Rouse. A couple spoonfuls stirred into yogurt taste like breakfast, not dessert. Rouse’s jam is also looser in consistency because of the minimal sugar and absence of pectin, making it easier to incorporate into recipes. While her sour cherry ginger jam is excellent on a toasted English muffin with a smear of butter, Rouse believes it truly shines as a culinary ingredient. She recommends using jams to amp up grilled cheese, top homemade pizza, and even glaze roast meats. For baking applications that call for a thicker consistency, like these sesame-studded thumbprint cookies, Rouse recommends heating her jams with a little bit of cornstarch.Rouse has become something of a culinary jam evangelist, singing the praises of jam-laced old fashioneds and jam-spiked vinaigrettes. Trade Street’s fans have heard the good word: One longtime supporter has incorporated the smoked peach jam into his family’s meatloaf recipe—and emails Rouse in a panic if they’re out of stock online.Spicy Vanilla Kiwi Jam$16 $7 at Uncommon Goods$16 $7 at Trade St. Jam Co.In addition to their fruit jams, Trade Street Jam Co. sells a vibrant red hot sauce that combines raspberries, sun-dried tomatoes, and two types of chiles as well as a “mocktail elixir” made with sour cherries, chipotle, and citrus. Cut it with seltzer for an afternoon sipper or incorporate a splash into a margarita. There’s also a sweet potato biscuit mix—BYO butter, buttermilk, and canned sweet potato purée. “Our whole mission is to introduce the world to a concept bigger than jam on toast,” Rouse says. We support Rouse in her mission—but you’ll still find us biting into a slice of buttered sourdough, slicked with Trade Street’s blueberry lemon basil jam.This article was originally published in 2018 and was updated in 2022.Explore Bon AppétitShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-05", "author": ["Condé Nast", "Aliza Abarbanel", "Mackenzie Chung Fegan"]}