{"id": "be7a5039587dbf0c54a0e6316dfa2009", "url": "https://www.bonappetit.com/recipe/summer-squash-and-basil-pasta", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "Summer Squash and Basil Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2017 IssueSummer Squash and Basil PastaBy Chris MoroccoAugust 1, 20184.6(57)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Judy ManciniEmailPinterestPrintEmailPinterestPrintSautéed squash eventually gets jammy and saucy if cooked long enough, ideal as a way to coat big pieces of pasta. This recipe is part of the Healthyish Farmers’ Market Challenge. Get all 10 recipes here.Ingredients4 servings¼cup olive oil8garlic cloves, thinly sliced2pounds assorted summer squashes and zucchini, quartered lengthwise, slicedKosher salt1teaspoon Aleppo-style pepper, plus more for serving12ounces paccheri, ziti, or other large tube pasta2ounces Parmesan, grated (about ½ cup), plus more for serving1tablespoon fresh lemon juice½cup basil leaves, dividedPreparationStep 1Heat oil in a large skillet over medium. Cook garlic, stirring occasionally, until very lightly browned around the edges, about 4 minutes. Add squash and increase heat to medium high; season with salt. Cook, tossing occasionally, until squash begins to break down. Turn down heat once it begins sticking, and continue to cook until the squash is jammy and soft, 12–15 minutes. Toss in 1 tsp. Aleppo-style pepper.Step 2Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente.Step 3Transfer pasta to skillet with squash using a slotted spoon or spider and add ½ cup pasta cooking liquid. Cook pasta, adding 2 oz. Parmesan in stages along with more pasta cooking liquid as needed, until sauce coats pasta and pasta is al dente. Toss in lemon juice and most of the basil.Step 4Divide pasta among bowls and top with more Parmesan and Aleppo-style pepper and remaining basil.Nutrition Per ServingCalories (kcal) 550 Fat (g) 21 Saturated Fat (g) 5 Cholesterol (mg) 20  Carbohydrates (g) 73 Dietary Fiber (g) 6  Total Sugars (g) 8 Protein (g) 18 Sodium (mg) 220 How would you rate Summer Squash and Basil Pasta?Leave a ReviewTell us what you thinkReviews (33)Back to TopTriangleThis has become one of my favourite pasta recipes. I make it as written, more or less, with the addition of toasted pine nuts. Subtle and delicious. AnonymousCanada2/19/2022We love this recipe. We use Campanelle pasta with it. So, so good! And it has been a joy to cook during the pandemic — it takes time, lots of love to pull it off. Thank you!!!AnonymousOklahoma 1/24/2022All the Parm in the world can’t doctor this bland recipe. All the other reviewers were right- don’t water your time.AnonymousFresno, CA9/13/2021This is our latest obsession and on a weekly rotation through the summer. I frequently add a can of cannelloni beans or lentils at the same time that I add the pasta to make this more filling for our meatless nights. My husband isn’t usually a fan of vegetarian dinners but loves this one. MPK143bonappetite8/13/2021Perfection. It didn’t take long to get the squash to a beautiful jammy texture, used a little extra lemon to wake it up and a good handful of chopped basil mixed in at the very end right before serving. Agreed with other commenters that 12oz of pasta is too much for the squash ratio. Used a mixture of baby zucchini’s and patty pans. Will be making again ASAP AnonymousVancouver BC8/3/2021This recipe is a lot of work. It takes a long time for the zucchini to cook. I did not think the results were worth the effort. The zucchini cooked down to almost nothing and was overwhelmed by the pasta. I added more salt and lemon to get a better flavor but the zucchini sauce was not enough to really flavor the pasta. Wendy SquiresPortland, Oregon7/3/2021This has made the regular dinner rotation in my house, and I NEVER get sick of it! Like other people have said, it’s endlessly riffable, but more importantly it comes together super fast! AnonymousShirley, IL12/6/2020Call me crazy but I added a splash of red wine vinegar to the pan halfway through cooking the zucchini and I have to say it was a success. Very tasty, very hearty.AnonymousLondon, UK11/29/2020Easy, excellent recipe. Our toddlers love it, too - it tastes kind of like fancy Mac & Cheese. This recipe is also a great foundation for substitutions - I added a bunch of sliced mushrooms I had laying around recently and that was delicious as well.AnonymousColorado9/21/2020Good and easy! I had a 9oz package of cheese tortellini that I used for the pasta and used the juice of an entire lemon. AnonymousNYC9/10/2020This dish really lets the squash shine and I used Italian heirloom 'Costata Romanesco' for the first time. (Wow). I agree with other reviewers that you should use less pasta and and more lemon. I used Costo whole wheat  spaghetti and it still turned out really well. Had some pecorino I needed to use so threw some in in addition to the 2oz of parm and instead of Aleppo I used a combo Silk Chili, Black Urfa Chili, and Smoked Paprika. SnicklefrtizColorado8/12/2020So tasty and such a great way to use up some of the summer squash and zucchini we’re drowning in come late July. Like others said, 8oz of pasta is likely all that’s required. I make sure that a bit of brown crust appears in the pan when cooking the veg, deglazing with pasta water to mix all that goodness into the sauce that develops. Love the subtle, earthy heat of Aleppo pepper, but suspect smoked paprika/some red pepper flakes would do as well. A summer recipe keeper for sure. Salt with care as the pasta water and cheese add quite a bit on their own. I just added a pinch more. AnonymousNew Hampshire 8/3/2020This was delicious- loved the “jammy” squash. As was mentioned by some of the reviewers, I used 8oz pasta and added an extra 1/2 Tbsp of lemon juice and some zest. I didn’t have Aleppo pepper so substituted sweet paprika and cayenne in the ratio of 3:1. I would definitely make it again. Susan ThorntonArlington VA8/1/2020Really delicious. Used 8 oz pasta and double the lemon and it was perfect. Do be careful salting the pasta water - I had to use quite a bit for the sauce and probably ended up a touch too salty with the final dish.AnonymousRochester,  NY7/17/2020This was delicious.  Aleppo pepper and summer squash are a perfect pair.  Used rotini pasta.  Lovely.  KerraBERichmond, VA7/15/2020Explore Bon AppétitPastaSummer SquashSquashVegetableBasilHerbs & SpicesZitiPasta & NoodlesSummerEasyWeeknight MealsOne-Pot MealsMainNut-FreeVegetarianHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2017-05-16", "author": ["Condé Nast", "Chris Morocco"]}