{"id": "be7bacb41af92dbc27cba9c955689025", "url": "https://www.bonappetit.com/story/winter-rose", "year": 2020.0, "month": 2.0, "day": 1.0, "content": "Just So You Know, Rosé Season Is Actually Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureJust So You Know, Rosé Season Is Actually Right NowThere’s no place for Chianti in my winter blues.By Alex DelanyFebruary 7, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food styling by Yekaterina BoystovaFacebookTwitterEmailWelcome to Glass Half Full, a monthly column from drinks editor Alex Delany about what he’s drinking (and loving) right now.Here are some wine rules you’ve probably heard before: When it’s warm outside, you drink rosé. And when it’s cold, big red wines full of tannins and structure and jammy fruit are what you should pour. But I’ll let you in on a secret: That’s all wrong.Rosé is good in July...because rosé is good whenever. But rosé is best in (drums roll, ears turn, butts move to the edge of their seats) winter. Yes that’s right, winter is the real season for rosé. Let me explain.My rosé consumption reaches its peak in February, and it’s not because I’m holed up in my apartment drinking any more than I usually do. It’s because rosé is exhilarating. During a season that’s more or less an emotional nap, I don’t want a glass of bold, hearty red that doubles as a lullaby. I want a drink that’s going to lift me up. I want a lovely, fruit-filled, tantalizingly acidic, assertive slap across the face. And that’s what rosé gives me.There’s no problem pink bubbles can’t solve.\nPhoto by Emma Fishman, Food styling by Yekaterina BoystovaI’m talking the feeling I get from a bottle of Bichi winery’s Rosa, a Mexican still rosé made from a mystery grape (seriously, the farmer doesn’t even know what it is) that radiates a warming seaside sunshine. The vibe from La Lunotte’s Printemps, a Loire Valley Gamay that brings a hint of tannic structure in a charming, rough-around-the-edges, wild-countryside-fruit type of way. Or the jolt of Villa Calicantus’s Sollazzo, an effervescent biodynamic red blend from the Veneto region of Italy. There is nothing bubbly pink wine cannot snap you out of. I know, I’ve done the research.Specific bottles aside, I’d pour any rosé that’s ruby-ish in color, midweight in body, high in acid, and that brings notes of blackberry, raspberry, and stone fruit to the table. Because you won’t find these same characteristics in the much lighter, pinker Provence-style rosés, save the stuff you picture drinking by the pool in The Hamptons for actual summer.Until then, put down the Barolo. Leave the Cabernet at home. Skip the Malbec section of the menu. You’ve got the brunt of the harsh, frigid winter in front of you. Drink rosé.Explore Bon AppétitGlass Half FullWineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-07", "author": ["Condé Nast", "Alex Delany"]}