{"id": "be902a126ce6a886a10fbbb32d07b4a6", "url": "https://www.bonappetit.com/story/banh-xeo-vietnamese-sizzling-crepes", "year": 2020.0, "month": 5.0, "day": 4.0, "content": "Banh Xeo Are the Riffable Savory Rice Crepes You Need Right Now | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI’d Stuff My Face With These Bánh Xèo Every Meal of the DayCrispy and chewy, zippy and savory, hot and cold—these Vietnamese sizzling crepes hijack every one of my brain’s pleasure centers.By Andrea NguyenMay 25, 2020FacebookTwitterEmailPhoto by Molly BazFacebookTwitterEmailI’ve yet to meet anyone who doesn’t like Vietnamese bánh xèo—crisp-chewy rice crepes filled with all kinds of ingredients from land and sea. Named for the sizzling “say-ow” (xèo) sound the batter makes when it hits the hot pan (could there be a better noise than that?), they’re a hands-on eating experience: Snip the crepe with scissors, wrap it in soft lettuce and zippy herbs, and dunk it in spicy-tangy nước chấm (“nook chum”), the go-to dipping sauce of Vietnam, before shoving it all into your mouth. The combination of textures and flavors hijacks all pleasure centers.Personally, I don’t just like the southern Vietnamese specialty. I adore it. I grew up eating my mom’s homemade sizzling rice crepes, which always filled the house with a distinctive fragrance of rice, pork, and shrimp kissed by a delicate coconut sweetness. On my first trip back to Vietnam in 2003, I filled up in bustling Saigon (a.k.a. Ho Chi Minh City) where a bevy of women cooks commanded big hot skillets to craft crepes as wide as Indian dosas. Further north in quaint and more conservative Hoi An, a food hawker gingerly handed me one the size of taco, wrapped in a very thin sheath of rice paper. (In Hue, Vietnam’s ancient capital in the central region, there’s a bánh xèo kin named bánh khoái, which are shallow fried and super crunchy, and served with a bean sauce flavored by a touch of liver.)Over the years, I’ve eaten bánh xèo (“baan say-ow”) at historic spots like Bánh Xèo 46A Đinh Công Tráng (which opened in 1945 in Saigon), casual alleyway joints, and at open air wet markets. I’ve observed professional cooks frying crepes over charcoal braziers and chatted up others to learn that they use lard for flavor and grind their own rice to make the turmeric tinted batter. And I’ve formulated a few bánh xèo recipes myself: ones that involve soaking rice and mung beans for the batter, and others that use superfine Thai rice flour and cornstarch as a shortcut—like the version in my latest cookbook, Vietnamese Food Any Day.Recently, stuck at home and not too eager to venture far to satisfy my crepe craving, I sought to make the Viet treat with ingredients I could find at my local supermarket—evolving and expanding on our food traditions the same way my family had when they first arrived in the States. With that spirit, and the current season, as my guiding force, I landed on this perfectly spring-y bánh xèo recipe with succulent large frozen shrimp, crunchy, quick-cooking snap peas, and sturdy red cabbage to balance out the sweetness and add loft, too. Though not entirely traditional, it’s a joyous riot of color and flavors—the essence of what makes Viet food so damn appealing.Here’s how it all came together, plus some tips for creating your own version. Once you understand the basics, you can get creative with it and use whatever ingredients are accessible to you.The CrepeThe main obstacle to perfectly crispy crepes is the flour. The white rice flour sold at mainstream grocery stores and heath food markets yields gritty batter because it is coarser than what’s produced in Southeast Asia, where rice is soaked then ground to a superfine texture. Treating American rice flour like Thai rice flour and/or adjusting other ingredient proportions yielded fail after fail. Then one day, I tried making the batter with super-hot water. Bingo! The rice starch softened enough to yield satisfying crepes. Compared to the traditional ones, what I made from rice flour by American producers like Bob’s Red Mill are crunchier and heartier, but these New World crepes were wonderfully delicious in their own right.The FillingMost bánh xèo contain the usual suspects: thinly sliced pork or nubby bits of ground pork, small shell-on shrimp, mung beans (the legume and raw sprouts), and mushroom. Classics endure for a reason, but faced with inconsistent (sad) bean sprouts at my local supermarkets, I began changing up the filling, choosing ingredients like shredded red cabbage to replace the sprouts and chicken thigh in lieu of pork. Then of course, there’s this snap pea version.You could always try subbing half of the snap peas with thickly sliced cremini or fresh shiitake mushroom (use 2 or 3 medium ones and include stems). Oyster mushrooms work, too. Maitake turned out too firm for my taste but you may like it. Just cook the mushroom with the shrimp and onion to draw out their umami. But why stop there? Anything low-moisture should work to avoid sogging up the crepe.The Lettuce Wrap and HerbsBe freewheeling with the raw produce. If mild tasting mustard greens are available, add them to the lettuce-and-herb plate for a Saigon experience (use a large leaf to wrap the crepe with, or tear off a piece and include it in the lettuce wrap). If you have other fresh herbs, such as basil (Thai or lemon would be divine) or purple-and-green perilla (called tía tô in Vietnamese) include them with the cilantro and mint.To ServeThe batter holds for a couple days, which means you can make it in advance; the sauce is best the day it’s made. My husband and I can easily devour three in one sitting, whether that’s for brunch, lunch, or dinner. Serve alongside with lots of wine and beer.Get the recipe:Shrimp and Sugar Snap Pea Bánh Xèo (Vietnamese Sizzling Rice Crepes)Crispy and chewy, zippy and savory, and eaten by the handful—you won’t be able to stop at just one.View RecipeExplore Bon AppétitVietnameseSpringRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-25", "author": ["Condé Nast", "Andrea Nguyen"]}