{"id": "be92dd661d53b575f400422a8008f1bb", "url": "https://www.bonappetit.com/story/i-quit-my-laywer-job-to-cook-in-spain", "year": 2022.0, "month": 2.0, "day": 4.0, "content": "I Quit My Lawyer Job to Cook in Spain. Things Did Not Go According to Plan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Quit My Lawyer Job to Cook in Spain. Things Did Not Go According to PlanI swapped tailored pantsuits for a too-big chef’s shirt stained with bone-deep anxiety sweat.By Caitlin Raux GuntherFebruary 23, 2022FacebookTwitterEmailIllustration by Hazel ZavalaFacebookTwitterEmailA few years ago, 18 months into my law career, I fired off a resignation email to the managing partner of my Madison Avenue firm.The ink was barely dry on my New York bar membership, but I had a plan: I would sublet my one bedroom in Cobble Hill and move to an attic apartment overlooking an old train yard in Bilbao, Spain. I would swap tailored pantsuits for a too-big chef’s shirt stained with bone-deep anxiety sweat. I would trade evenings downing lamb burgers and pricey glasses of Malbec for nights crawling around the floor of a Michelin-starred restaurant, scrubbing titanium cabinets until they shined like diamonds. As an unpaid kitchen intern, I’d do it for free. I’d do it gladly—at least in the beginning.Resignation waves tend to be spurred by extraordinary or catastrophic circumstances. My desire to throw in the towel was the opposite: strikingly ordinary. Even though my job as an estate-planning associate had been relatively cushy, I was unfulfilled. During weekly conference calls over catered roast beef sandwiches, I’d daydream about menu ideas and thoughtful flavor combinations. I was consumed with the notion that I’d be happier if only I had a career that aligned with my ‘authentic self’: creative, sensitive, and passionate about food.Becoming a lawyer had never been my calling, per se. Before law school I had deferred twice, hightailing it to Spain for two years to blog about food and sleep in budget hostels across Europe. But on my return, the ghosts of financial and career insecurity were waiting. Skin still kissed by the Mediterranean sun, I ignored my gut, signed a stack of loan agreements and commenced 1L. The warm memories and glossy jamón of Spain had been calling me back ever since.Bilbao was historically a fishing town. A river cuts through the center and because in the 1300s the waterway was the primary source of transportation, communication, and (quite literally) life, it was called the “Nervión,” which means nerve or pulse.I arrived on a drizzly April morning by ​​La Salve Bridge, which spans the river and feeds into the heart of the city. The restaurant where I would work was located inside the Frank Gehry–designed Guggenheim, perched just off the Nervión. With its sharp edges and titanium surfaces, it seemed an appropriately dramatic setting for this exciting next chapter. The kitchen mirrored the building’s severity, with shiny cabinets and an undulating hospital-white ceiling. There was a long bar near the restaurant entrance where guests oohed and ahhed as they watched a silent army tweeze ingredients onto artful plates before they gravitated toward the dining room.As the other interns and I toured the space that would become our new “office,” I felt keenly aware of my otherness—from the way my Spanish suddenly seemed rusted, the words sticking in my mouth as I greeted the chefs, to what I perceived were obvious differences between the other interns and me. At 28 I was the eldest of the bunch. And most of them were trained culinary students.In the beginning they called me “la Nuyorquina,” with a discernible reverence for the city I came from but didn’t feel nearly as tough as. Still, I was willing to wear that badge if only to draw attention away from how unprepared I was to work in a Michelin-starred kitchen. By day three I was outed.“You don’t have a restaurant background, do you?” asked one of the interns, an Argentine girl with wolfish green eyes. “How did you know?” I whispered, self-conscious as I spooned the remnants of a vanilla bean sauce into a storage container. “You’re too polite,” she replied, and I wondered if that was something I should work on. “I bet you I can get more from that,” she said, taking the sauce bowl from my hands. She nudged up the eyeglasses on the bridge of her nose and, using a rubber spatula, scraped the bowl clean. I ached to emulate her cool confidence.The kitchen hierarchy was as precise as the physical space. On top there was the chef, who would appear in a pristine shirt embroidered with his name and the restaurant's, to taste and evaluate our execution of his painstakingly developed recipes. Then there was the sous chef, who managed daily operations, overseeing us in the trenches. He could turn on the charm like a spigot—and just as easily shut it off, his mood darkening like a storm cloud if a single basil flower was misplaced. This ruthlessness, I took it, was a requisite for advancing in the brigade. Each station—vegetables, fish, meats, desserts, R&D—had its own head chef. After the introductory week I was assigned to vegetables, the gateway to fish and meat.I became a collector of burns, my forearms decorated with seared skin from the heated cabinets…The cutthroat nature of restaurant work is well documented. And yet, there were so many things I underestimated: How demanding the hours would be (making my lawyer schedule seem lax by comparison). How many steps went into preparing each element in a dish, like the chard juice, which became my daily mission and took the better part of two hours, only to be used as a garnish. The threat posed by the sous vide machine—which, after one failed attempt, left chard juice fanned across my chest like blood splatter for the rest of service, a scarlet letter in bright, unmistakable green.I became a collector of burns, my forearms decorated with seared skin from the heated cabinets where we stored service dishes to keep them blistering hot. My calves burned with cramps. The physical discomfort was compounded by relentless anxiety about minor mistakes that accumulated like grease on an oven door. Each misstep, each momentary lapse in focus, earned a fresh reproach from the sous chef or, before long, a fellow intern. I started to view the brigade as a system engineered to pit us against each other, a ladder on which I occupied the bottom rung.Relief came in discrete periods that were always too brief—cigarette breaks after the hurried staff meal and bike rides home along the Nervión, letting the cool air soothe me after a punishing service. At home, fueled by cheap Txakoli, I’d blog about the restaurant to gain some semblance of power.Spring bled into summer. Squash blossoms and fresh anchovies and jewel-like cherry tomatoes appeared on the menu. Most days my passion for the food—those precious seasonal ingredients—was the only thing fueling me. That, and this was supposed to be my dream job. On rare occasions I did feel like it was. When the vegetable station had a flawless service, working in tandem like a world-class symphony, there was no greater high. But inevitably, I’d screw up and erase any credit I’d earned.Eventually, I had to admit I was demoralized. Perhaps it was hubris that got me there, a lawyer working in a Michelin-starred kitchen. Regardless of how I arrived, I was once again in the position of deciding whether it was time to throw in the towel or soldier on. Part of me was still desperate to earn my colleagues’ respect; the other part was just tired.Then, one morning, after being reprimanded for plating a less than piping hot prawn, I said “enough.” My job as an attorney might not have brought me joy, but, I had to admit, neither did this. I listened to all the aches and grumbles in my body, because I lacked the energy to hear anything else, and quit.When the chef caught wind of it, he could barely look at me. He’d granted me access to an exclusive club and I no longer wanted to be a part of it. I slunk out the same door I once entered carrying such raw hope, hopped on my bike, and pushed the heavy pedals until I was coasting away.In the days that followed, I wandered Bilbao from end to end, careful to avoid the orbit of the restaurant. I’d vacillate between confidence in my decision and floods of self-doubt. I’d wonder if I was a fraud or a dilettante, then ride to the Casco Viejo and console myself with a plate of pintxos—a salty, vinegary gilda; a skewer of spiced fire-cooked lamb; a warm slice of tortilla. I journaled and blogged a lot.During my time in Bilbao, my blog had evolved from side project to lifeline. It was the one place where I was fully in control; where I could tell vivid stories about food—without the burns and humiliation. In the quixotic journey to find myself, writing was the constant.By the time I returned to New York, seven months after I left, I was coming to terms with the possibility that I was better suited to writing about restaurants than working in them. So that became my new mission. It took a while to find my footing in the food-writing world; I had to take another law job while I searched and applied for positions. But eventually, I landed a full-time gig as a writer and editor for the Institute of Culinary Education. While it wasn’t the ticket to happiness—naturally, I found new things to gripe about—most days I genuinely enjoyed the work.The dichotomy I had constructed—between my law job and my restaurant job, practicality and passion, misery and happiness—turned out to be false. There was a vast gray area worth exploring. Life was more fluid than I had ever imagined. I could try one thing and fail. And then I could pick myself up and try again. I never would have discovered that had I not gone back to Spain.Recently, I returned to Bilbao on a journalism assignment. I walked to the Guggenheim and felt the hairs rise on the back of my neck as I took in the gleaming surfaces. From a distance I watched a few interns smoking cigarettes behind the restaurant. For a moment I remembered what it was like to be in their shoes. I could feel the electricity of their ambition. Then I turned and walked away, along the Nervión and back into the heart of the city.Explore Bon AppétitCultureessayRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-02-23", "author": ["Condé Nast", "Caitlin Raux Gunther"]}