{"id": "beacc4557cfc9537f201b8576a1297cc", "url": "https://www.bonappetit.com/story/a-summer-mixtape", "year": 2019.0, "month": 7.0, "day": 4.0, "content": "A Summer Mixtape | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Summer MixtapeReading and recipe recommendations from Healthyish editor Amanda Shapiro.By Amanda ShapiroJuly 25, 2019FacebookTwitterEmailPhoto by Slim AaronsFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,I’ve been voraciously consuming everything these days: articles, music, podcasts, videos, food, clothes, wine, frozen margaritas. So, as we approach August—or what my friend referred to today as the Sunday of summer—I figured I’d send a list of 11 things, in no special order and under no organizing principle, that’ve gotten me through a particularly weird and wonderful few months. Think of this list as my summer mixtape, meant to be played on shuffle from now through the end of Labor Day to keep the Summer Scaries at bay.This multimedia piece about how New York’s women-run DJ collectives are changing the New York dance scene. It’s a nice snapshot, but if you want to dig deeper into the history of dance music, read this. And if you want to listen to more of the DJs in these collectives, I love DJ Voices and Ciel.The chilled ramen in soy milk from Nakamura, Shigetoshi Nakamura’s NYC shop. Pro trip: You can also make it at home.The Recreationalist, a new site from Outdoor Voices, is a place I can tell I’ll be spending time, starting with this interview with chef Mashama Bailey. (Also, a reminder that Cher produced some sick workout videos.)Speaking of Outdoor Voices, I’ve been living in this exercise dress. It has gotten me through hot yoga, hotter bikes to the beach, and the hottest day I’ve ever lived through in Hanoi, Vietnam.If she hadn’t already stolen my heart, this video starring Bon Appétit associate editor Christina Chaey making cold buckwheat noodles with kimchi would’ve ripped it straight out. I could listen to her chat about food all day. (Luckily she sits behind me, so I do.)Soy milk ramen forever.\nMichael Graydon + Nikole HerriottA quick read on a few ways to try expanding your imagination, from drugs to meditation to dreaming.Healthyish fudge that’s the ultimate beach dessert...if it doesn’t go straight from the fridge to your mouth. It’s further proof that Chris Morocco, like, really gets me.This brutally honest episode of The Cut on Tuesdays featuring Rebecca Traister and Tiffany Cabán talking about the very real costs—financial, emotional, interpersonal—of running for office.This salmon niçoise from Claire Saffitz is a BIG SUMMER MOOD. And so weeknight-friendly, if you don’t mind having one thing in the oven and a couple more things on the stove.I am this hot squirrel. All the hot squirrels are me.How to Do Nothing: Resisting the Attention Economy by Jenny Odell, which is making me realize that I’ve maybe been consuming a little too much.We're switching things up for the month of August with a little cooking challenge you might remember from last year. Don't worry, our regular newsletters will be back in your inbox in September. In the meantime, get ready to cook alllll the produce starting August 1st.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThe Myth of the Perfect JobBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-25", "author": ["Condé Nast", "Amanda Shapiro"]}