{"id": "beaf288b1263f056a76310c3cabbec29", "url": "https://www.bonappetit.com/story/easy-black-bean-soup-makes-its-own-delicious-broth", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "This Easy Black Bean Soup Makes Its Own Delicious Broth—No Soaking Necessary | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Easy Black Bean Soup Makes Its Own Delicious Broth (and Gets Topped with FRITOS!!!)No boxed stock necessary! Dried beans have all the flavor you need to make this cozy, easy black bean soup. (Also: FRITOS!!!)By Christina ChaeyOctober 16, 2018FacebookTwitterEmailFacebookTwitterEmailThere are two types of people in this world: People who love soup, and people who think they don't like soup but just haven't had good soup. As someone whose body composition is roughly 40 percent soup between the months of October and March, I've made it my mission to become Hot Flavor Water's #1 evangelist. (I legit have a Highlight on my Instagram that is dedicated to soup, or as we call it around here, sööp. My commitment is REAL.) So when the editor of this website, Amiel Stanek, made the rounds looking for a volunteer to cook through this easy black bean soup recipe, I was like, Brø, I got this.As someone who remembers to soak dried beans approximately one out of every 7 times I want to eat said beans, this soup is massively appealing to me. Generally, you want to soak beans overnight because it cuts down on the cooking time (some also say it helps the beans cook more evenly). But it IS possible to cook beans straight from dried—it'll just take them a bit longer to become tender. This might not be a 30-minute weeknight soup, but it is a great side project if you have three episodes of Maniac to burn through. The single greatest advantage to making a soup with dried beans is that, as they cook, they flavor the liquid they're in—in this case, humble tap water—to create a rich and savory broth that's a million times tastier than any canned stock. (By the way, if you ever hear us waxing poetic about \"bean cooking liquid,\" that rich broth is the stuff we're talking about.)Another thing that appeals to me about this soup: It's crazy-cheap to make. You need nothing more than an onion, a carrot, some garlic, a splash of red wine vinegar, and the sauce from a can of chipotles in adobo to create a flavorful base for a pound of dried black beans. Doctor it up with some dried oregano and kosher salt and...that's literally it. Done. All that's left to do is to give the whole mixture a good stir every half-hour or so as the beans drink up all that smoky-spicy-garlicky broth for the next hour-and-a-half, becoming plump and creamy and ready for the epic shower of toppings to come.Which brings me to my very favorite part of this whole meal-in-a-bowl affair: the toppings. Crispy, creamy, crunchy, cool, hot, spicy—I want them all to blanket the surface of my bowl so thickly you can't even tell there's soup underneath. You've got an hour and a half until those beans finish cooking, which is plenty of time to spend making your accoutrements all nice-like. Grab a lime and mix the zest and juice with a cup of Greek yogurt. Season the lime yogurt with kosher salt until it tastes vibrant and like it's actually got salt in it. This will likely require more salt than you think it does, but those extra few pinches will make all the difference when you dollop this stuff into your bowl. The rest of your topping assembly is just that: assembly. Crush up some Fritos, tortilla chips, or corn nuts; slice a nice ripe avocado, because you're the kind of person who doesn't let your avocados die a slow brown death on your kitchen counter; dice some red onion, pick some cilantro, and cut up some lime wedges; or don't! It's your soup world!One final note on soup and seasoning: The biggest complaint I hear from people who think they don't like soup is that it doesn't taste complex or flavorful enough when they make it at home. In 99 percent of cases, it's because they're not using enough salt, and aren't seasoning as often as they should. The key to making soup that doesn't taste like plain beans and oregano floating around in hot water is to season your food at every step of the cooking process. That means you want to season your onion/carrot/garlic mixture as it browns. You want to salt your soup when you're first bringing it to a boil, and then taste it and season it again, if necessary, just before serving. Your lime-yogurt should pop with flavor. Every small step you take in the cooking process hugely affects the final outcome, and this, I think, is why I love making soup so much: Soup doesn't allow you to shortcut your way to true flavor. It refuses to be duped or rushed; it's done when it decides it's done. (Soup is patient, soup is kind, or something.) If you don't take the time to properly sweat your vegetables, or salt with care, well, the proof will always be in the broth. But that will never be the case with your broth—because you know better.You'll find that easy black bean soup recipe riiiiiiiiight here:Basically Black Bean SoupFew ingredients have such a stellar deliciousness-to-affordability ratio, and the best part about starting a soup with dried beans is that they create their own incredibly savory broth as they cook.View RecipeExplore Bon AppétitBlack BeansSoupBasicallyRead MoretechniquesYour Ultimate Guide to Cooking with Dried BeansBy Carey PolisPhotography by Gentl HyerscookingThese 3 Chicken Soups Are Here to Solve All Your ProblemsBy Alex DelanycookingHow I Turn a Pot of Beans Into a Week of DinnersBy Adam RapoportRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Christina Chaey"]}