{"id": "beb0134118428cb9bc3b5d3e52da78bc", "url": "https://www.bonappetit.com/story/sasheer-zamata-water-filter", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Sasheer Zamata Has Great Skin Because of Berkey's Showerhead Water Filter | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingSasheer Zamata's Secret to Great Skin Is This Showerhead Water FilterIt's just one thing that makes the ‘I Feel Pretty’ star feel, well, pretty.By Alyse WhitneyApril 26, 2018FacebookTwitterEmailSteve Granitz/WireImage/Getty ImagesFacebookTwitterEmailThe secret to glowing skin and shiny hair can come from many sources, from plant-based beauty products and fancy serums to imperfection-blurring makeup. But according to actress and comedian Sasheer Zamata, the best option may be something you already have in your house: water.Don’t worry, this isn’t about to be a lecture on how much water you should be drinking daily. Instead, it’s about what’s in your water. When I sat down with the star of I Feel Pretty (and former best Rihanna impersonator on SNL) I was distracted by her truly radiant skin. While there are some rosehip and coconut oils involved, she says she owes the past year of looking good—and, in fact, feeling pretty—to Berkey water filters.Twist this on your showerhead and instantly feel beautiful.\nCourtesy of Berkey“I had a few conversations and did some research about what’s in water, even the so-called ‘cleanest’ New York City water where I live, and realized I needed to get those chemicals out of my body,” Zamata explained. ”[The filter] really cleans the water ... it’s hard to describe how water tastes, but it’s better. Crisp. Not like garbage!”The countertop filtration system and travel water bottle that purify water by removing more than 200 contaminants are essential to her life now, but the best “Berkey-ed out” part of her life is the showerhead filter. “In the last year since using it, my skin has cleared up, my hair feels better, and it all just looks good. Other things could be in play, but I think it’s because of the water,” she raved.Zamata also noticed that it makes her water less hard (aka with less minerals) and she wishes she could twist it on and off when traveling between LA and New York. “I miss mine when I’m gone,” she said wistfully, suggesting that she team up with Berkey to make a portable showerhead. She's more than willing to be their spokeswoman.Her other wellness rituals include using coconut oil for oil pulling and moisturizing dry elbows, drinking hot water with apple cider and vinegar to “wake up and clean the whole system out,” and ”shrinking everything and getting smooth” with Indian aztec clay masks. Beats hitting your head on a SoulCycle bike in order to feel pretty.Explore Bon AppétitCelebritiesHealthyishShoppingRead MorecultureHow Samira Wiley Practices Self-Care After a Long Day on the 'Handmaid's Tale'By Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-26", "author": ["Condé Nast", "Alyse Whitney"]}