{"id": "beb900b6bc24fb79f6917c474d312bd6", "url": "https://www.bonappetit.com/story/sonia-anniversary-letter", "year": 2021.0, "month": 8.0, "day": 4.0, "content": "Sonia Chopra's First Year at Bon Appétit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureMy First Year at Bon AppétitAnd the start of something new.By Sonia ChopraAugust 26, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailEvery Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.It’s hard to believe that as of this week, I’ve been writing to you for a full year. We’ve done a lot in the last 12 months: We’ve grown our team, launched new columns and series, and cooked through lots and lots of great recipes. And this week, we’re debuting something brand-new.Please say hello to Food People, the new weekly podcast from Bon Appétit. Every Thursday, BA editorial director Amanda Shapiro will ask a fun or serious food question—what’s the best way to grill a chicken? Why would anyone open a restaurant during a pandemic? Do we really have to meal-prep?—chatting with our colleagues and friends from across the world of food to track down an answer. And, once a month, our editor-in-chief, Dawn Davis, will step in to interview a food person she admires.I am so excited about launching this podcast and the opportunity we have to talk about cooking and food culture in a whole new format. Amanda and Dawn have an ear for stories that are fun, smart, and thoughtful, and I can’t wait to see where they take all of us listeners. The first ep drops today; subscribe now on Apple, Spotify, or wherever you get your podcasts so you don’t miss an episode.Here are a few other things I’m loving across BA and Epicurious:I can’t stop thinking about these desserts: Vallery Lomas’s peach pie, Jocelyn Delk Adams’s cinnamon-roll pound cake, Sarah Jampel’s strawberry doughnut muffinsI’ve also got vegetables on my mind: Christian Reynoso’s summer vegetable cassoulet, Bryant Terry’s bitter greens salad, Rawlston Williams’s curry vegetablesAnd I clicked immediately on Hetty McKinnon’s recipe for egg salad with grilled broccoli and chili crisp over on EpicuriousLove this essay about Hooters (and so much more) from writer Zainab ShahThis week on Reverse Engineering: Chris makes Samin Nosrat’s ravioli verdeI’ve never cooked with kare-kare sauce, and I’m long overdue!I hope you love what you hear on Food People. Let me know what you think, and please send me your burning food questions at sonia@bonappetit.com.Explore Bon AppétitCultureLetter From The EditorRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-26", "author": ["Condé Nast", "Sonia Chopra"]}