{"id": "bec89a571ac52801cec16581911bc370", "url": "https://www.bonappetit.com/recipe/tiny-potatoes-with-sour-cream-and-onions", "year": 2021.0, "month": 11.0, "day": 2.0, "content": "Tiny Potatoes with Sour Cream and Onions Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTiny Potatoes with Sour Cream and OnionsBy Kendra VaculinNovember 9, 20213.3(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThis flavor combination is reminiscent of potato pierogi but with roasted tiny potatoes and red onion rounds. Drag each herb-covered potato and onion bite through a swoosh of sour cream before eating to get the full effect.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAIngredients4–6 servings1½lb. tiny potatoes (such as creamers or peewees)2Tbsp. extra-virgin olive oil, plus more for onions¾tsp. garlic powder¼tsp. sumac1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus moreFreshly ground black pepper2small or 1 medium red onions, sliced into ½\"-thick rounds, layers separated⅓cup sour cream¼cup (packed) coarsely chopped mixed tender herbs (such as parsley, dill, and/or chives)PreparationStep 1Preheat oven to 450°. Place potatoes on a rimmed baking sheet. Drizzle 2 Tbsp. oil over, sprinkle with garlic powder, sumac, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and season with pepper. Toss to coat, then arrange potatoes in an even layer. Roast until nearly tender and beginning to brown in spots, 18–22 minutes.Step 2Meanwhile, place onions in a medium bowl. Drizzle a little oil over and season with salt and pepper; toss to coat.Step 3Carefully remove potatoes from oven and shake baking sheet to turn potatoes and scoot to one side. Arrange onions in a single layer in empty space on baking sheet; reserve bowl. Return baking sheet to oven and roast potatoes and onions until potatoes are browned and fork-tender and onions are charred around the edges, 13–17 minutes. Let cool slightly.Step 4Scoop sour cream into reserved bowl; season with salt and pepper. Spread sour cream onto a platter or into a large shallow bowl and top with potatoes and onions. Scatters herbs over and sprinkle generously with pepper.How would you rate Tiny Potatoes with Sour Cream and Onions?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis was a simple and delicious side dish. I added some lemon zest and juice to the sour cream for a little more brightness. AnonymousBoston, MA12/14/2021Explore Bon AppétitPotatoVegetableRed OnionOnionherbSideappetizerQuickVegetarianWeeknightRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-08", "author": ["Condé Nast", "Kendra Vaculin"]}