{"id": "bed0dfb64fe465158484902552447b54", "url": "https://www.bonappetit.com/story/herb-protection-program", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "How To Keep Herbs Fresh Longer, Plus Smashed Chickpea Salad | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Stop Your Herbs From Getting Sad and Droopy Between Shopping TripsCleaning and picking herbs isn't just my excuse for watching more TV.By Sarah JampelMay 6, 2020FacebookTwitterEmailTED+CHELSEA CAVANAUGHFacebookTwitterEmailEvery week in our letter from the editor, you can read what Basically editor Sarah Jampel is cooking, baking, and ruminating obsessing over. If you want this in your inbox before it hits the site, sign up for our newsletter.Hey Basically readers,I spent most of last week feeling foggy and dazed, which I attributed, at the time, to the intersection of family stuff, work stuff, friend stuff, and the fact that the world...—well, you know what’s happening. Around Thursday, however, I realized that my mood wasn’t only the result of general malaise: I had also been drinking coffee from cold brew packs I had received in a care package upwards of three years ago. I had no clue whether it was even caffeinated because all of the information on the label was in Japanese. Note to self: When your caffeine routine is working—scratch that: when your caffeine routine is your biggest coping mechanism—don’t switch it up.Want this letter before it hits the website? Sign up for our newsletter!Even when I reverted to my old faithful coffee, I still felt sluggish and in need of distraction. Projects helped: I played sous chef, assisting my husband in shaping tortellini (if you’re interested in making your own fresh pasta, read Alex Beggs’s article, or watch Claire Saffitz’s video), which we filled with mushrooms and ricotta; then I gave him a haircut! I made sourdough English muffins, then arancini, shaped as patties instead of spheres so that I could pan-fry rather than deep-fry, plus a spicy tomato sauce for dipping. I ordered the materials to knit my friend’s imminent baby a tiny hat. (Did you know that this is how a pom-pom is made?!)My tortellini children.\nPhoto and Food Styling by Sarah JampelHere’s what else I got up to:One Good TipMake Your Herbs LastOf all the perishable groceries, tender herbs like parsley and cilantro make the biggest difference in whether my food tastes drab or bright—but they’re also the first to get wilty and downright depressing. I find that they’re most likely to stay fresh when I wash and dry them as soon as I bring them home. Then, per Amiel Stanek’s suggestion, I park myself in front of a good show (for me, Sex Education) and get to sorting: I pluck out any slimy or discolored sprigs and toss the fluffy leaves and tender stems into a container lined with barely damp paper towels. (I let myself use paper towels and promise myself I’ll atone later.) The thicker stems go into their own container, for future soups or green sauces. This way, whenever I’m cooking, I can easily reach for a handful of herbs without having to worry about washing or trimming them. They’re more likely to stay good and I’m more likely to use them.Oh, but I don’t mess with basil: That one dies the second it enters my apartment. I use it immediately.The \"set up.\"\nPhoto and Food Styling by Sarah JampelA Good Thing I Ate This WeekTuna Salad, But Make It ChickpeasI made a big pot of from-dry chickpeas last weekend, and they were still hanging around my fridge five days later. Good intentions, poor execution. So for lunch I made tuna-salad-goes-veg with inspiration from Aliza Abarbanel. I smashed the chickpeas so that most were about half their original size, then added leftover lemony shallot vinaigrette, a fat squeeze of the odd vegan mayo that’s been haunting my fridge forever, and a ton of chopped chives and torn herbs. I ate it over bread with lettuce and avocado and felt like I was at a vegan lunch counter. Okay, it wasn’t nearly as good as the fried risotto I’d had the night before, but it did deliver on big flavor and small clean-up, and nutrition (I think).Is that you, chickpea?\nPhoto and Food Styling by Sarah JampelThis Week I’m Going To…Memorize a poem?Eat leftover dosa! I made Tejal Rao’s dosa and Meera Sodha’s coconut potatoes from her book Fresh India, and I can’t wait to add a fried egg and call it lunchMake a batch of almond milk because I’m running out of my beloved oat milkTry not to finish the entire Normal People series in one sittingRewatch Chika’s Little Desk Concert while sitting on the fire escapeCatch you next week!Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Sarah Jampel"]}