{"id": "beda813b6f17409745604502b2060275", "url": "https://www.bonappetit.com/story/biscuit-recipe-for-beginners-and-non-bakers", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "The Simple Biscuit Recipe Even Beginner Bakers Can Master | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI'm Not a Baker and Even I Can Make These Buttery BiscuitsThe recipe so simple, even notorious non-bakers will have wild success. (Promise!)By Alex DelanyJune 14, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailI’m the world’s biggest fan of hyperbole. But I promise that I’m not exaggerating when I tell you that last weekend was the first time I had baked something in about a decade. I’m not a baker. I don’t bake. I’ve never had any desire to follow recipes to a T or learn the difference between baking soda and baking powder. I prefer to use recipes as guidelines rather than mathematical, dogmatic blueprints, and you can’t do that when you bake.But last week senior food editor Molly Baz challenged me to bake something. She had just developed a recipe for Basically Strawberry Shortcakes and she assured me that even I—a notorious non-baker—could absolutely make the biscuits in question. I am competitive and proud (not to mention, I trust Molly), so for the first time in a decade, I decided to bake something.I could give you an intense play-by-play of how to make these tender, light shortcakes, but you could just scroll through the recipe for that. So instead, I’m going to cut to the chase and tell you that it worked. I made the biscuits, and guess what? I will probably make them again. How did my transformation happen in such a short time?First off, it was only possible because this recipe is so casual and straightforward, with no fancy equipment or elaborate components involved. You use one bowl; you incorporate the cold butter with your hands; and you knead and fold your dough minimally. You don't even need a biscuit cutter or a rolling pin or a bench scraper—just a bowl and a lightly-floured work surface.Next, the recipe is as simple as possible, with no extraneous fluff—every ingredient and step is there for a reason. From the time I started mixing ingredients to the time I set them in the freezer to chill before baking, it took me 20 minutes. The most \"complicated step\" (quotation marks because it's easy) is quartering the dough, then stacking it in a tower and pressing it back into a thinner slab. It's critical for creating the layers of butter and flour that make the biscuits so flaky and tall.You don't need to fill your biscuits with whipped cream and strawberries, but...\nAnd lastly, I was motivated to bake because I had tasted the biscuits in the test kitchen and I knew them to be extraordinarily delicious. Let's be real: Why bother baking if it's not going to be something better than anything you could buy at the store? This recipe will produce the kind of incredibly satisfying biscuit that you can peel back cleanly, later by layer, to reveal a tender, buttery interior. And the exterior is just as nice. Deeply browned with nooks and crannies that crisp and crunch.I’m sure there are some non-bakers out there that need to hear this: You can bake things every once in a while. And you might even enjoy the process. These biscuits were the best thing I’ve baked in a decade. They were also the only thing—but trust me on this: These are something special.Get that recipe right here:Basically Strawberry ShortcakesYou can make this classic summertime dessert with whatever seasonal berries are calling your name.View RecipeExplore Bon AppétitBiscuitBasicallyBakeDessertRead MoreEasy One-Bowl Upside-Down CakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Alex Delany"]}