{"id": "bedbc8f659a6b6118e9d07bdb901a978", "url": "https://www.bonappetit.com/story/san-lorenzo-rome", "year": 2019.0, "month": 1.0, "day": 2.0, "content": "Rome’s Best Food Neighborhood Is San Lorenzo—Here's Where to Go | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsRome’s Best Food Neighborhood Is San Lorenzo—Here's Where to GoFrom espresso to thick-rimmed pizza to local craft beers, we’ve got your all-day eating itinerary right here.By Katie ParlaJanuary 14, 2019FacebookTwitterEmailPhoto by Michelle HeimermanFacebookTwitterEmailThere’s a lot to love about Rome. All the textbook cacio e pepe. More silky gelato than you can eat. But I’m constantly wandering back to San Lorenzo, the trapezoidal wedge along the east side of the city. Located outside of Rome’s ancient walls, it’s just beyond reach for travelers squeezing their visit down to a few days. But after living in the city for the last 16 years and becoming obsessed with its food and drink culture, I now make regular treks across town to visit this district, which happens to be named after Saint Lawrence, the patron saint of chefs and cooks.San Lorenzo has been one of Rome’s liveliest (and most delicious) districts for the past century and, unlike sleepier nearby hoods that feel like you’ve stepped into a museum, it’s still going strong, thanks to the abundance of natural wine bars, busy trattorias, and on-point pizzerias. Visit the neighborhood any night of the week and you’ll find its streets, sidewalks, and squares flooded with diners and drinkers (and more than a few hash dealers) late into the night.But San Lorenzo has much more than just nightlife. In fact, you can spend a whole day grazing. Case in point: Just look at my recent cross-town trips. Here’s how to map out a perfect day of eating, drinking, and wandering through the area. Maybe just wear some stretchy pants.10:30 a.m. - Caffeinate the Italian way at Bar MaraniI kick off the day with an espresso (or as they say in Rome, caffè), cappuccino, or caffè corretto (that’s espresso spiked with a shot of grappa or amaro, you’re welcome). It feels like you’ve gone back in time at this time capsule of a cafe, where a zinc bar, formica floor, and dusty pennants are straight out of the ’60s. But you feel it even more so when ordering a drink: Make sure you follow the proper protocol by paying for it at the register first, then taking your receipt to the barista who will hook you up. You can stand at the counter, but my move is to sip my drink in the pergola-covered courtyard, with its view of the bell tower of Santa Maria Immacolata church.Instagram contentThis content can also be viewed on the site it originates from. 11 a.m. - Veg out at the Mercato di San LorenzoAfter all that pasta you’ve been putting away, you need something green, right? Look no further than the San Lorenzo market, where the stalls are stocked with seasonal produce, mainly from Lazio and southern Italy. Here you’ll get a crash course in Roman ingredients: pruned artichokes, trimmed chicory, and persimmons so ripe they are nearly bursting out of their skin.Instagram contentThis content can also be viewed on the site it originates from. 12 p.m. - Take a casual pre-lunch stroll at the Verano Monumental CemeteryYou’ll have to kill some time before lunch because San Lorenzo’s restaurants stick to traditional operating hours, opening from around 12:30 to 2:30 p.m. for lunch and 7:30 to 10:30 p.m. for dinner (don’t expect to sit anywhere for a proper meal any time in between). And this storied cemetery just might be the best place to digest for an hour or so. The family mausoleums and monumental tombs are works of art, hewn from limestone and granite and surrounded by cypress groves and umbrella pines that lighten the otherwise somber mood.Instagram contentThis content can also be viewed on the site it originates from. 1 p.m. - Do sushi, yes, sushi at KikoIn front of the cemetery is Piazzale Verano and on the south side of the town square, you’ll find this gem of a restaurant. Here chef Atsufumi Kikuchi crafts some of the city’s best sushi. He’s been honing his skill for the last 30 years and built a cult following at his previous Roman sushi spot Sushi Ko, also in San Lorenzo, which closed in 2014. I know what you're thinking: “I want carbonara.” Me too. But I also want delicate slices of locally caught amberjack and shi drum paired with perfectly seasoned rice. Don’t pass it up.Instagram contentThis content can also be viewed on the site it originates from. 3 p.m. - Cram in a second lunch at Tram TramA few blocks southeast, Mamma Rosanna Di Vittorio holds court at Tram Tram, a spartan, sunny trattoria loved for its comfort food—and named for the public transport that rattles the whole bar when it passes along the rails outside. The menu is a mix of cuisines from her mother’s native Puglia, which focuses on seafood and olive oil-spiked vegetables, and her own hometown of Rome, which leans on lamb, guanciale, and offal. Think dishes like a casserole of rice with mussels, simmered bitter greens with fava bean puree, pillowy gnocchi tossed in a mutton ragù, and crisp puntarelle dressed with an anchovy vinaigrette.Instagram contentThis content can also be viewed on the site it originates from. 5 p.m. - Fight off the urge to nap at GiufàGiufà is a student- and family-friendly bookstore and cafe serving coffee, tea, wine, and cocktails to keep you awake at this point in the day. The shelves are mostly stocked with graphic novels and political tomes, all in Italian, but it’s a mellow spot for hanging out and getting caffeinated before hitting San Lorenzo's noisy bars and streets.Instagram contentThis content can also be viewed on the site it originates from. 6:30 p.m. - Discover craft beer at ArtisanFour years in business and this craft beer pub is still going strong. (Just look to the constant crowd of smokers outside.) Inside, ’90s hip hop accompanies 12 taps of rotating European and American brews. Keep an eye out for local (and I mean local) beers, like hoppy saisons and IPAs from Jungle Juice, brewed less than two miles away in the Mandrione neighborhood.Instagram contentThis content can also be viewed on the site it originates from. 8 p.m. - Get your pie fix at Farinè la PizzaKeep the carb-positive vibes going and head across the street to Farinè, the black sheep of Roman pizzerias. (It breaks from Rome’s thin-crust tradition with its thick-rimmed pies.) Go for the marinara—pizza in its purest, simplest form—with tomato, oregano, and garlic scattered all over a chewy, bubbled base of dough that’s been leavened for up to 72 hours.Instagram contentThis content can also be viewed on the site it originates from. 10 p.m. - Drink naturale at Il SorìWant something to wash down a day’s worth of eating? Two blocks from Farinè sits this natural wine bar, where owner Paky Livieri plays the consummate host. He spends his nights plucking bottles of traditional and natural French and Italian wines from floor-to-ceiling shelves and pouring them for discerning drinkers. The short and simple food menu features cold and hot plates, including some of the freshest buffalo mozzarella around. But the reason you’re here is to drink wines that fetch a premium in the States, like Damijan Podversic’s Ribolla Gialla, an organic white wine that gets some skin contact and has hints of jasmine and chestnut honey, and Emidio Pepe's Cerasuolo d'Abruzzo, a berry scented rosé we could drink all night long.Instagram contentThis content can also be viewed on the site it originates from.Explore Bon AppétitRomeRestaurants + TravelRead MorecultureThe Gelato Flavor to Measure All Gelato Shops ByBy Sarah JampelrestaurantsThe Chef Behind the Pasta Instagram We Can’t Stop Scrolling ThroughBy Elyse InaminecookingNow That’s What I Call a Cannoli: A Recipe That Even a Sicilian Grandmother Can LoveBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-14", "author": ["Condé Nast", "Katie Parla"]}