{"id": "bee9ce2a9a8d24d466af00176df9a513", "url": "https://www.bonappetit.com/recipe/brads-spoon-sauce", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "Brad’s Spoon Sauce Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2020 IssueBrad’s Spoon SauceBy Brad LeoneJune 2, 20204.8(7)Read ReviewsTriangleEmailPinterestPrintPhotographs by Laura Murray, food styling by Simon Andrews, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintBrad Leone’s all-purpose condiment is an ideal finisher for anything you might care to grill. Make it ahead and have it ready to spoon over grilled meats, fish (including this grilled flatfish), and vegetables.IngredientsMakes about 1¾ cups¼cup raw pistachios10prunes, pits removed, coarsely chopped1garlic clove, finely grated2cups finely chopped parsley1cup finely chopped mint¼cup finely chopped tarragon¼cup kimchi or sauerkraut brine2Tbsp. Champagne vinegar or white wine vinegarKosher salt¾cup extra-virgin olive oilPreparationStep 1Toast pistachios in a dry small skillet over medium-low heat, tossing occasionally, until browned in spots, about 5 minutes. Let cool, then finely chop.Step 2Gently mix pistachios, prunes, garlic, parsley, mint, tarragon, kimchi brine, and vinegar in a medium bowl to combine; season with salt. Whisk in oil, then taste and season spoon sauce with more salt\nif needed.How would you rate Brad’s Spoon Sauce?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleMore people need to try this ridiculously good sauce!! It's so weird and easy, and it makes your food taste like restaurant food, because only restaurants would mix prunes and tarragon and kimchi brine, and have it come out crazy delicious. I've made it twice now, both times with grilled fish, and even my 14-year-old ate it!! Just trust me and make it. You are going to freak out.AbbyLos Angeles, CA10/11/2021This was an unexpected hit! I spread onto rock cod before baking in parchment and kept some aside to finish with. Didn’t have brine so used extra vinegar. Also skipped the tarragon (because quarantine grocery shopping). Could imagine this being great with dried apricots or even currants, but the prune and pistachio combo was really spot on. marydenhamSan Anselmo, CA7/28/2020Explore Bon AppétitSauceCondimentPistachioNutPruneDried FruitFruitParsleyHerbs & SpicesMintQuickEasyVeganVegetarianDairy-FreeGluten-FreeHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-02", "author": ["Condé Nast", "Brad Leone"]}