{"id": "bf1b939d92771679d064804ff1ddc2c5", "url": "https://www.bonappetit.com/story/type-a-weekend-cooking-planning", "year": 2019.0, "month": 3.0, "day": 5.0, "content": "How Really, Really Type A People Plan Their Weekend Cooking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow Really, Really Type A People Plan Their Weekend CookingWe know a few.By Alex BeggsMarch 30, 2019FacebookTwitterEmailFacebookTwitterEmailEvery Friday morning, Bon Appétit senior staff writer Alex Beggs shares weekly highlights from the BA offices, from awesome new recipes to office drama to restaurant recs, with some weird (food!) stuff she saw on the internet thrown in. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Live footage of me on the weekendSome of us need something to live for, and that thing is cooking on the weekend. This week I learned that associate editor Christina Chaey starts planning her weekend cooking on Tuesday. “The thought exercise gets me through the week,” she said. (FYI: She’s making this mushroom pasta and Chris Morocco’s “magnifique” Italian salad.) Food director Carla Lalli Music told me about her family’s epic meal planning: “Tuesday would be the day we get the first email from my mom saying, ‘No rush, but would love to know what you all might enjoy to eat on Friday night, Saturday day, Saturday night, and who is staying late on Sunday?’” And a 20-tab thread ensues. Associate production manager Kate Fenoglio has months of ice cream flavors planned for weekend experimenting (she loves ice cream). And senior food editor Anna Stockwell is the most Type A of all of us: She plans weekend entertaining menus and “strategic shopping” the Sunday before. A full week! Anna! “It gives extra purpose, meaning, and joy to my week to have a dinner party to look forward to, so yeah, I like to spend as much time thinking about it as possible.”Photo by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiI thought long and hard about it and by Wednesday I had an idea. This weekend I’m making some of the incredible recipes from Daniela Soto-Innes in our February issue: Brussels sprouts tacos with peanut butter sauce, this nutty salsa macha, avocado water I plan on spiking with tequila, and this cinnamon tamal for dessert. Variations on this menu are subject to change, and that’s the fun of it. The anticipation! The possibility! The long road ahead! I might just make broccoli delight!Do you plan your weekend feasting at the start of the week? Let me know!Want this letter before it hits the website? Sign up for our newsletter!Photo by Lee Lockwood/The LIFE Images Collection/Getty ImageIt’s an honor just to be nominatedBecause this week two Bon Appétit articles were nominated for James Beard (pictured above) awards: Michael W. Twitty’s essay about visiting, and exploring his family’s roots in Ghana, and Fatima Ali’s essay about how she planned to use her time when she found out her cancer was terminal. Ali passed away in January.Overheard in the Bon Appétit offices“I can hear you crunch from here.”Photo by Alex Lau, Food Styling by Rebecca Jurkevich, Prop Styling by Kalen KaminskyAn absolute ruseSarah Jampel is one of the sweetest people I’ve ever met, kind and considerate, hard-working and detail-oriented. She’s also, apparently, a master of disguise. She made this make-ahead ice water salad (you should, too), for a dinner party in which one guest said he didn’t like anchovies, walnuts, or garlic. The dressing for that salad is mostly anchovies, walnuts, and garlic. However, Sarah didn’t tell him this, and watched as the picky eater happily devoured the crunchy salad.Unnecessary food meme of the weekLetter of the weekA LOT of readers sent in notes in response to Adam’s Monday newsletter about how much we’ve evolved as ~more than a magazine~ in recent years. We read them all and took your feedback to heart, except Johnny’s. Here’s an excerpt from one of my favorite letters, from Robin: “I’m a loyal subscribing reader and while-cleaning-house podcast listener. At 58, I’m not just learning how to cook but follow Basically online and in the magazine. I like Healthyish’s approach to sensible eating. Remember we are out here still printing off recipes and tearing out magazine pages to put in binders...If you forget your older loyal base, we’ll spend more time on Cook’s Illustrated. Most of us are not New Yorkers and we Midwestern and Southwestern folks cook a lot! Keep up the great effort but don’t start sniffing your own farts.”Speaking of eggsYou can’t make an omelet without going back-to-back with a K-pop star (as Carla did this week!), or trying 58 other ways to cook eggs (as Amiel Stanek did this week). In order to film the egg video, Amiel had to cook and eat a LOT of eggs. “A month later, and I’m excited about eating eggs again,” he told me. “Honestly, there were a few personal bests that I achieved. Had never properly poached an egg before, and it turned out perfect! Samesies with the French omelet.” Good job, Amiel.MeanwhileI had no idea what olfactory neutrality wasUntil I listened to this food-themed episode of NPR’s Code Switch. As all great nerdy-fun NPR podcasts do, what begins as a listener’s question about eating pungent food at work (and what it implies) turns into a deep dive into a history of SMELL 🤯. They get into all this stuff about the rise of deodorization in public spaces (does Kroger have a distinct smell when you walk in? Not really, right?), then they go even further back to scent in ancient literature, and then BOOM, back to the present, in your cubicle, eating noodles with fish sauce. It was fascinating.Someone else’s food feudThis week, a debate raged across the internet about St. Louis’s “secret” to bagels, which is slicing them like bread. Huh. This seems like cutting a Snickers bar with a knife and fork if you ask me, but there’s really only one person’s whose opinion matters. And that’s Claire Saffitz, bread expert AND St. Louis native. Claire, how do you feel about this? “I’ve literally never heard of this,” she said in the Bon Appétit Test Kitchen during a break from filming [REDACTED]. “You can cut a bagel however you want. To each his own bagel! I see the merit. Bagels have become extremely bready, the dimensions have increased. Anything that gives you a better ratio of cream cheese and lox to bready interior is a good thing. But I don’t support cinnamon raisin bagels as a thing.”Unnecessary food feud of the weekUnwanted salami. Where did it come from? Where is it going? This week we spent half a meeting debating an etiquette question: What do you do when you’ve planned an elaborate meal and a guest shows up with unsolicited, bad salami? Clearly they felt they had to bring something, so they stopped by the gas station and picked this up. Do you, control freak host, put it out with the spread or hide the salami (cough) in the fridge “in case we run out later and need backup!”? Emma Wartzman shook her head: “I think you should put the salami on the table.” Aliza Abarbanel was with her, “Putting it on the table is your best chance to get rid of it!” Some saw conditionals, like, say, if the person who brought it was very excited about the salami—then you must put it out. If they didn’t seem to care, “Hide it!” said Chaey, and Carey Polis agreed. “Can anyone who brings bad salami really call themselves a big time salami-enthusiast is the real question,” posed the inquisitive Emily Schultz. Amiel beamed down for a brief second to add: “crouching host hidden salami.” Molly Baz just wants to say, “Salami is never unwelcome at my apt, no matter how low-qual.” “I’d put the salami out, and let the public be the judge,” said Carla diplomatically.And oh, we shall.Explore Bon AppétitBeggs NewsletterRead MorecultureThe Best Etsy Stores for Hunting Vintage PyrexBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-30", "author": ["Condé Nast", "Alex Beggs"]}