{"id": "bf2248069c33dc54e1d224d8ff57161f", "url": "https://www.bonappetit.com/story/saag-feta-indian-ish", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "Saag Paneer Is Great, But Saag Feta Is Even Better | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYou Love Saag Paneer, Now It’s Time to Try Saag FetaWhen I started writing my cookbook, I had completely forgotten about my mom’s saag feta. That won’t happen again.By Priya KrishnaApril 4, 2019FacebookTwitterEmailPHOTO BY CHELSIE CRAIG, FOOD STYLING BY ALISON ATTENBOROUGHFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt later this month.The secret to my mom’s saag paneer is…that it contains no actual paneer.Paneer is great. I love those bouncy, crumbly cubes! I once purchased a birthday card for a friend that said “Pa-neer or far, you’re always in my heart.” But trust me: You haven’t lived until you have made saag paneer—a classic Indian dish of of firm, curdled, and unmeltable cheese simmered in a gravy made of greens (often spinach)—with feta.When my mom immigrated to the U.S. in 1980, many of the staple ingredients she had back in India—like roti, ghee, and, of course, paneer—couldn’t be found in New Hampshire grocery stores.When she had the time and patience, she would make paneer from scratch, but she had a demanding job, and within a few years, kids. She eventually settled on tofu as her paneer alternative. It was perfectly fine, albeit without any of that rich milkiness you can taste in paneer. My parents figured that settling for tofu in their saag was just part of adjusting to life in America.Then, in 1998, my family traveled to Greece, and my mom was introduced to the national treasure that is spanakopita: feta and spinach encased in tissue-thin layers of phyllo. She fell hard for the way the salty feta got all up in the crevices of the spinach, balancing out that vegetal earthiness with its bold brininess.When we returned stateside, even though at that point paneer was widely available in Indian grocery stores, she dreamt up a version of saag paneer with large cubes of feta, inspired by the ones we enjoyed on vacation in our Greek salads (which, in Greece, are called… salads).This turned out to be a more compelling swap than we ever could have imagined. The cubes of feta soaked up the gravy like a sponge. They melted juuust a little in the pan, but still maintained their crumbliness. And the feta naturally salted the dish! Best of all, it required no other adaptations to her existing saag paneer recipe.Here’s how she’d make it: Sauté 2 tablespoons of whole coriander seeds and two green cardamom pods in a quarter cup of ghee on medium heat until they start to brown. Add a diced onion, let that cook until translucent, and mix in a minced garlic clove, a tablespoon of chopped ginger, and a pound of fresh spinach. Once the spinach has wilted, take the pan off the heat, add a chopped Serrano chile, a quarter tablespoon of lime juice, and a teaspoon of salt, then throw everything in a blender and blitz into a chunky paste. Add that mixture back into your pan on low heat, along with a half cup of water, and fold in 6 ounces of feta cut into cubes. While that warms up, in a small pan or butter warmer, add two more tablespoons of ghee and a teaspoon of cumin seeds on medium-high heat. Once the cumin seeds start to brown, add a pinch of red chile powder, and pour the spice-oil mixture (that’s the chhonk!) over the top of the saag paneer. Serve with rice or roti.Surprisingly, after that initial test run, saag feta made infrequent appearances on our dinner table. My mom usually reserved saag paneer for parties, since it’s slightly more involved to make than other Indian dishes. And when she was preparing it for guests, she always felt like she had to go the traditional route, and use paneer.To be honest, when it came time to write my cookbook (find more recipes from Indian-ish here), I had completely forgotten about saag feta. My mom sent me a text when I was compiling recipes that said, “What about that spinach feta dish I make?” Skeptical, I asked her to write down how to make it.I’d forgotten how much I loved the dish until I tried it 70 recipes deep into testing 100 recipes in only three weeks (would not recommend this aggressive timeline, folks). I was overstuffed, reluctantly scooping a spoonful of saag feta on top of some day-old rice. I took a bite, and had a minor meltdown over how wonderful it tasted.It was like when you think you know how something is going to taste, but then it tastes nothing like that. It was better, more aromatic, more intense. My world briefly turned to Technicolor. My mind was blown.Paneer is now so universal in the U.S. that even my local Whole Foods stocks it. I’ll occasionally buy some and use it to make matar paneer, or pan-sear little cubes of it to adorn my salads.But when it comes to saag, I’m sticking to feta.Want this full recipe and more, more, more? Pre-order Indian-ish!Explore Bon AppétitIndianishFetaVegetarianSpinachRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-04", "author": ["Condé Nast", "Priya Krishna"]}