{"id": "bf238d3ace57abdaa306ce60e1291581", "url": "https://www.bonappetit.com/recipe/coconut-curry-braised-chicken-thighs", "year": 2018.0, "month": 9.0, "day": 5.0, "content": "Coconut-Curry Braised Chicken Thighs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut-Curry Braised Chicken ThighsBy Lauren SchaeferSeptember 30, 20183.8(50)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintThis simple, big-flavor chicken thigh dish is a great intro to the fundamentals of braising—once you've got the method down, you can braise just about anything. Braises are perfect for richer, slightly tougher cuts of meat—bone-in, skin-on chicken thighs in this case—and are all about building layers of flavor over time. You're essentially browning successive batches of ingredients (meat, followed by aromatics like onions, ginger, and garlic, followed by spices), then trapping all of that tasty goodness in liquid to create a complex and deeply delicious cooking medium. And since braises tend to be rich, we always like to serve them with something zippy to brighten things up—you can get by without the coconut condiment in this recipe, but a few wedges of lime and some cilantro are non-negotiable.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketPaper Towels$13.45 At AmazonDutch Oven$80 At AmazonTongs$13 At AmazonPlate$55 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEASpoon$24.69 At AmazonMicroplane$16 At AmazonSmall Bowl$13 At AmazonWooden Spoon$6 At AmazonRimmed Baking Sheet$20 At Bon Appétit MarketVegetable Peeler$10 At AmazonIngredients4 servings6skin-on, bone-in chicken thighs (about 1½ lb. total)2Tbsp. plus ½ tsp. kosher salt, divided2medium red onions3garlic cloves12\" piece fresh ginger2Tbsp. curry powder, such as garam masala113.5-oz. can unsweetened coconut milk3small sweet potatoes, scrubbed½cup large unsweetened coconut flakes2limesA small handful of cilantroBasmati or jasmine rice (for serving)PreparationStep 1Preheat oven to 300°. Pat 6 bone-in, skin-on chicken thighs dry with paper towels. Moisture is the enemy of well-browned meat, so it's super important to get them as dry as possible before searing them. Season generously on all sides with 1 Tbsp. salt.Step 2Okay, this is going to seem a little bit out there, but trust us: It works. Place a cold, dry large Dutch oven on the stove—no heat yet! Nestle all of your chicken thighs in there, skin side down, so that there is as much skin-to-pan contact as possible (it's fine if they're crowded together). Then turn the heat under the pan to medium. As the pan becomes hotter and hotter, the skin will start to release some of its fat and then get extra crispy and brown, a process that will probably take around 15–20 minutes. (Try not to fuss with the thighs too much while this is happening, just let them be. This is a good time to do some of the prep work outlined in the next few steps.) When the skin is deeply browned—we're only cooking the skin side right now—use tongs to transfer the thighs skin side up to a plate. Turn off the heat under the Dutch oven, but reserve it—we're going to build our braise in it, and we want all of that fat and any browned, stuck-on bits, which will lend richness and flavor to the finished dish.Step 3While chicken is browning, do some prep: First, peel 2 onions and cut them in half through the root end. Slice 3 of the onion halves into 3 wedges each, and set the remaining half aside for later.Step 4Smash 3 garlic cloves with the flat side of a knife and remove the peel.Step 5Using a spoon, peel 2\" piece ginger. (Peeling knobby ginger with a vegetable peeler is a pain, but a spoon can get into all of those little nooks and crannies much more easily. Use a Microplane to finely grate the ginger into a small bowl.Step 6Cook onion wedges in the reserved pot—the same one you seared the chicken in—over medium heat, stirring often, until golden brown in spots and translucent, 4–6 minutes.Step 7Now you're going to start building the base for your braise. First, add your garlic and ginger and cook just until fragrant, about 30 seconds. Add 2 Tbsp. curry powder, stirring to coat until fragrant, a minute or two more. Deglaze the pan by adding a splash of water, vigorously stirring to loosen and dissolve brown bits on bottom of the pot. Add half of coconut milk (shake it well before you open the can, as it can separate!), followed by 1 cup water. Bring the liquid up to a simmer.Step 8Chicken time! Arrange the thighs, skin side up, in the Dutch oven so that the meat is partially submerged in the braising liquid. Cover and transfer to the oven to bake for 30 minutes.Step 9While the chicken does its thing, you're going to make a zippy coconut condiment for spooning over the finished dish. (Who doesn't love a good topping?) Start by spreading ½ cup coconut flakes on a rimmed baking sheet and placing it in the oven along with the chicken. Bake coconut until golden brown, about 5 minutes—it'll go fast, so set a timer and keep an eye on it.Step 10Now, finely chop the reserved half onion from earlier and transfer to a small bowl.Step 11Finely grate zest of 1 lime into bowl of chopped onions. There's a ton of flavor in citrus peel, so it's always good to try to find a way to use it if you can. Cut the now-zested lime into wedges and squeeze the juice over onion mixture. Cut remaining lime into 4 wedges and save those for serving later.Step 12Cut off the bottom inch of stem from a small handful of cilantro, then finely chop up the stems until you get to the leaves; reserve leaves for serving. Add stems and toasted coconut to bowl with onion mixture (don’t toss the mixture just yet, otherwise the coconut will get soggy).Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 13Peel 3 sweet potatoes and cut into 2\" pieces.Step 14After 30 minutes, uncover Dutch oven and add potatoes and remaining coconut milk. Use tongs to move things around so that the the vegetables are submerged underneath the chicken thighs, which you want to have arranged skin side up. Return the pot to the oven—uncovered this time—and cook until the sweet potatoes are soft enough that they can be pierced with a knife and the chicken is tender, another 15–30 minutes. (This is a good time to start your rice. If you don't have a rice cooker, this is our go-to stovetop rice cooking method.). After this amount of time, the chicken should be tender, juicy, and nicely cooked, but you can let it go for another 30-45 minutes if you're after a more shreddable, falling-apart tender result.Step 15Meanwhile, toss coconut condiment with ½ tsp.salt.Step 16And there you have it! Serve chicken thighs, curry sauce, and veggies over rice. Top with coconut condiment and reserved cilantro leaves, and serve with lime wedges alongside for squeezing.Step 17Do Ahead: Braised chicken can be made 1 day ahead. Cover and chill. Reheat over low heat before serving.How would you rate Coconut-Curry Braised Chicken Thighs?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleTurned out great! We made a few modifications based on reviews and I was very happy with it! It was a more saucy dish, if you left out the water/chicken stock it might be less, but we like it saucy. We used boneless skinless chicken thighs\n-Cut up the sweet potatoes into much smaller cubes/ pieces. \n-Use 3 tbsp curry powder (not garam masala) + large dash of paprika + small dash of chili powder. Salt throughout cooking- especially before braising and adding potatoes. \n-Use chicken stock instead of water \n-Braised at 270 (we had smaller chicken thighs)\n-Cook for at least 1 hour with potatoes (We ended up cooking it 1 hr 15 min to fully cook potatoes)Kelsey PalsgaardCorvallis, OR3/20/2022After reading through the comments, I par-roasted the sweet potatoes in large chunks (as pictured in the recipe graphics) in a 425-degree oven for about 20 minutes. I also added a little Better Than Bouillion when I added the water. These were the only changes I made, and we loved this. Cooking the potatoes first converted this into a fairly quick weeknight meal, and we are massive fans of the coconut/onion topping. JessaminRaleigh, NC2/14/2022This took me two and a half hours and it was worth it. Deeply flavoured, not really coconutty (which is honestly a plus for me) sweet and rich.\n\nThe only changes I made was omitting the topping and opting for just quick pickled red onion in lime and I also did the entire thing on the stove top as I don't have any oven safe pans. I knew that because of this, heat would be unevenly distributed so I cut the sweet potato into around half inch slices. They cooked at very different rates but that was fine! It just means some of them broke down into the sauce, thickening it and some were perfectly tender. By the end the sauce was thick enough to draw a line through. I then took out the one thigh for my portion and fried it quickly in another pan while I did the rice so that I could get some colour and crunch back on it that had been lost from not being in the oven. It browned up fantastically, really quick and extremely sweet. \n\nPart of the success may have been that the only curry powder I had was for Nehari, which contains fennel seed. Really quite spicy and generally very complex. I maybe over-salted the chicken a little and so only used that initial lot. \n\nThis seems like a great base for a vegan curry, omit the chicken and add some roasted cauliflower perhaps? Typically for these types of curries I roast all of the veg separately and add it at the end anyway. Saul KurzmanDevon1/30/2022this was super delicious but did require a lot of time/effort. however, the end result is hearty, delicious and worth it. i was skeptical about the first step of browning the chicken skin after reading the reviews, however, i believe it comes down to patience and a solid dutch oven. i highly agree with swapping chicken broth or stock for water. also, absolutely cut your sweet potatoes smaller than instructed, they will take longer than you think. i wasn't satisfied with the texture after approx. 15 mins of cooking in the broth - adding on another 15 was definitely worth it. i will definitely make this again because everyone loved it! and the lime / onion TOPPING was FABULOUS (omitted the coco flakes). FernLos Angeles, CA 5/24/2021I am....so distraught by this recipe?  Just a quick FYI, this took me nearly 4 hours to make beginning to end following the recipe exactly. As other reviewers mentioned, the method for crisping the chicken thighs is not effective at all - I had 6 small/medium sized thighs so my dutch oven wasn't even particularly crowded, and after nearly 40 minutes on medium/high heat and my chicken thighs still hopelessly sticking to the bottom, I called it and kept moving forward. \n\nAlso similarly to other reviewers, the estimated time for the sweet potatoes here is honestly comical - I cut mine significantly smaller than suggested and the cook time to get them soft was still 40ish minutes. \n\nUltimately this gets three stars from me for no other reason than the eventual end product was fine. I love a yellow curry so much and used normal curry powder (not graham masala) to season, and I liked the end flavor. Even so, 1000% not worth the insane time commitment this took for what should be a pretty basic dish. My advice would be to find a slow cooker coconut curry recipe elsewhere - I promise it will be at least as good as this and will be a quarter of the active effort.Beth5/11/2021I wish I had read the reviews before making this dish!  I agree with subbing chicken stock for the water.  I found Garam Masala to be a mismatch--I should have used curry instead.   I did not care for the coconut flakes but loved the lime and onion condiment.  \nI will make this again with the changes.  JanAlpharetta, Georgia1/14/2021So. This was great if you follow all the recommendations below: less water, double the spices, cook the sweet potato linger (or cut it up smaller or maybe both??) and thicken the sauce. I used a corn starch slurry. \n\nThe lime slice on top is a must to bring all the flavor together. A MUST. Things I added, some regular potato’s (instead of rice), more salt, and some red pepper to add spice. \n\nAfter all that modification you’ll get something delicious. That you can make over and over again (even ahead if you want). Seriously tho.....I feel like someone created something, but didn’t actually try out this recipe themselves before posting it. Rainere San Dimas, CA1/6/2021i liked the dish, but i do not recommend using garam masala as your 'curry' powder like the recipe 'suggests.' it tastes acrid (as noted in earlier reviews). also, the sweet potatoes did not soften for me after 15-30 minutes; i ended up covering the dutch oven and had it in the oven for about an hour. glad i started on the recipe early! Anonymous941077/22/2020O hai: don't be afraid to use skinless, boneless chicken breasts. It works! Since I used hot curry powder (first time I've cooked with this particular batch of powder), the finished dish seemed a little acrid to me, so I softened it right before serving with a pinch of cinnamon. Also, that onion-lime-coconut garnish is the rug tying the whole room together! So tasty and satisfying.Anonymousda midwest, ya hey5/2/2020I've made this twice and the second time I heavily altered it to reduce overall labor and it was still delicious! First go-around was definitely time-consuming, but end result was perfect. Second time around I omitted the topping and onion and stuck with the basics of chicken thighs and sweet potatoes. It was less than half the original time and still very good. Really delicious flavors, used whole foods curry powder. Served over white basmati rice.AnonymousWashington, DC - quarantine kitchen4/11/2020Absolutely LOVE this recipe.  I taste as I cook, and I did find it to be a little lacking in seasoning, but I like spicy, so may just be personal preference. I added about another tablespoon of curry (I use Rumi Spice Afghan Curry Braise), along with a few dashes of smoked paprika and Aleppo pepper.  I used an entire head of cauliflower (left the florettes on the large size) instead of sweet potatoes, as that is a flavor combination I love.  \n\nDid NOT make the topping, as it did not sound good to me. Served over jasmine rice with fresh sliced jalapeno and a squeeze of fresh lime.  \n\nThis will be a part of my regular meal rotation going forward!  Highly recommend.  Lombard, Illinois4/9/2020I loved this recipe! I also made some alterations: Instead of potaotes I added a zucchini. I did took in consideration some of the comments: The sauce ended up very watery, so I reduced it on the stovetop and since I didn't add the potatoes, I added some cornstarch slurry. When the recipe calls for a cup of water I did 50/50 with coconut milk. \nMy mom loved it too! and she's a very picky eater. valucooksChile4/2/2020Amazing. Not sure who the one stars are but they must be doing something wrong?\n\nCouple adjustments I’ve made. I substitute 1/2 Yukon potatoes sometimes. The one thing I find really helps is low and slow. So I will do the final uncovered bake at 275 for 2 hrs. The chicken skin up yields crispy skin but super juicy chicken. Sauce gets SUPER think too. This is a go to recipient with my college age kids. \n\nSaint Paul, MN10/18/2019After reading the comments I still decided to test out this recipe. A little on the bland side for sure, even when subbing water for chicken stock. I will say that even though it does take a long time to cook, it needs to sit for awhile after its finished... I would even go as far as to say that it was 70% tastier the next day...  as is the case with must curries, chilis, stews etc; always better the next day. AnonymousNew York4/12/2019This recipe is delicious. First, a Side note for you haters.....You almost always have to do these recipes at least twice to start nailing  it. If you are worried about perfection for your guests, i suggest you cook something you know you can nail.... BA has a different kitchen than you, different ingredients, etc. its nobody fault, so lay off them!! I just made this recipe Twice. First time, a little watery and under flavored, this time, it was fire.The key is learning techniques to get desires flavor and texture, and this just comes with a lot of experience.. Here were my adjustments for this one.\n\n1) add a little oil for browning. get a fish spatula and learn to use it. (you don't need oil BTW....) \n2) Don't add the water, just use one can of coconut milk to onions and aromatics. \n3) Double the curry powder. Just double it, its delicious\n4) Braise at 270 \n5) add potatoes and cook another hour until tender\n6) Try it then Salt it. get a small plate and eat some.....it probably needs a fair amount of salt. \n7) if too liquidy, put on stovetop to finish uncovered to reduce some. was perfect. \n\ncsparksGeorgia..2/22/2019Explore Bon AppétitCurryIndianSouth AsianAsianChicken ThighChickenPoultryCoconut MilkOther IngredientsSweet PotatoPotatoVegetableLimeCitrusFruitOne-Pot MealsWeeknight MealsMainDairy-FreeGluten-FreeSimmerBraiseDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-30", "author": ["Condé Nast", "Lauren Schaefer"]}