{"id": "bf27a1bf6cce7f4b87b33ae1c0271bde", "url": "https://www.bonappetit.com/story/chicken-parm-self-care", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Chicken Parm Is My Self-Care | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsChicken Parm Is My Self-CareFinding the cure to what ails me under a blanket of cheeseBy Carey PolisApril 16, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.I’m no stranger to self-care trends—I covet Byredo candles, recently attended a hybrid sound bath and reiki workshop, and have about a dozen different types of tea in my pantry. But I draw the line at equating self-care with supposedly virtuous or “clean” eating, as countless articles and Instagram accounts insinuate. Comfort eating can be self-care too; it's not a crutch, or a sign that you don't eat enough vegetables, but rather a totally acceptable balm to bad days and crummy moods.Enter chicken parm.My childhood dentist was located in a mall. After getting my teeth cleaned, my mom would take me to the food court, where I would beeline to Sbarro and order the chicken parm that was sitting out in metal warming trays for who knows how long. The side of spaghetti was overcooked, the breaded chicken was eerily soft in a way I loved, the cheese was plentiful. Everything about it was mushy and perfect for my recently bleeding gums.Over the years I learned to recognize that a crispy chicken cutlet was superior to a mushy Sbarro one (though I’m still not above ordering Sbarro at a rest stop). Chicken parm became my go-to order anytime I was at an Italian-American restaurant, and especially when I found myself at a diner.I’ve eaten a lot of chicken parms throughout Westchester, New York, when visiting my maternal grandparents—diners were places where they felt at ease because my grandmother could order a meal with no salt (“That’s no salt, whatsoever,” repeated to the waiter at least four times), and my grandfather could order something extremely salty, as a respite from my grandmother’s bland cooking. As my grandfather aged, bedridden by the end, my family would often end up in a diner after visiting him. He wasn’t eating much anymore, but I still found that a copious amount of breadcrumbs soothed my soul.About three years after my grandfather died, I got sick. My Crohn’s disease dramatically worsened, and I was being fed nutrients via a PICC line (essentially an on-the-go IV) for several weeks. My stomach was in such intense pain that I was pretty much medically instructed to stop eating.Dealing with pain, and having tubes attached to your right arm for several weeks, is hard for anyone. But for someone whose job it is to oversee a culinary website, it’s a pretty bizarre experience to literally not be able to eat. I would wake up, spend some time curled in a fetal position, get to the office late, hide in a closet filled with old magazines and video equipment to clean my IV lines, and attempt to create a strategic launch plan for our new website vertical in between.Eventually, I had surgery and slowly recovered in about a three-week process. My appetite returned, first in fits and starts and then with a vengeance—I wanted to eat everything that I hadn’t been able to: smash burgers, steak, all the pasta. And I needed chicken parm.A few weeks post-recovery, I went to the gastroenterologist for an “all clear” visit. I’ve spent a lot of time in that office in the past decade—chronic inflammatory diseases will do that to you. On my way back from my frequent visits, I’d often stop at a diner, Eat Here Now, on 64th and Lex, before taking the F train back to Brooklyn. There’s something uncomfortably oxymoronic about eating a big meal after having a gastrointestinal-related appointment, yet I found the hum of the diner calming when it just felt like my body wasn’t working right. (Please spare me the lecture about the foods you should or shouldn’t eat when you have Crohn’s—I’ve tried it all.)And it seems odd to get emotional over chicken parm. But the all-clear visit was a big health milestone—I had just been told I could resume a relatively normal diet. So I mini-celebrated at Eat Here Now. There I was, eating a solo dinner at 5:30 p.m. among an almost exclusively geriatric crowd, holding back tears while diving into a $17.95 plate of melty cheese and slightly dry white meat. It felt good to have an appetite, to eat without physical pain, to have agency over what I chose to put in my body.That was two years ago. I haven’t been back to that diner since, but my chicken parm quest has continued at other diners and restaurants, most recently back in Scarsdale, where my grandmother ordered a broccoli omelet with no salt (“That’s no salt. I don’t want any salt.”). At 91, she’s getting forgetful these days, and tends to repeat herself a lot. It’s annoying, and frustrating, and ultimately depressing.But maybe there’s some solace in the repetition—after all, I eat the same diner meal with her that I have since forever. Her food will be bland, and she’ll always remark how she’ll never be able to finish; my chicken will be massive, yet I’ll always eat more than I intended.I get that chicken parm doesn’t actually cure anything—I still have Crohn’s, my grandmother is still declining, and I still have bleeding gums when I go to the dentist. But I can’t deny its role as a mild panacea—one that has been there for me more regularly than pretty much any other self-care attempt (I’m looking at you, $40 salt cave visit).And that’s the point of self-care, right? To do what makes your body and mind feel good. Which, for me, is all the obvious stuff like yoga and reading for pleasure...mixed with the occasional too-big portion of chicken cutlet, tomato sauce, and melted cheese.Carey Polis is the digital director at Bon Appétit.Explore Bon AppétitRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Carey Polis"]}