{"id": "bf2e60710085150f944dfe709815fe6c", "url": "https://www.bonappetit.com/recipe/dahi-toast", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "Dahi Toast Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2019 IssueDahi ToastBy Priya KrishnaMarch 19, 20194.7(31)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Alison AttenboroughEmailPinterestPrintEmailPinterestPrintWhat makes these tangy yogurt sandwiches so addictive is chhaunk, a crunchy fried herb-and-spice mixture that also makes a fantastic topping for grilled steak or nachos. Watch Priya Krishna make dahi toast here.Recipe adapted with permission from Indian-ish by Priya Krishna with Ritu Krishna (Houghton Mifflin Harcourt). Copyright © 2019. IngredientsMakes 6¼cup plus 6 tsp. extra-virgin olive oil1½tsp. black mustard seeds24–30fresh curry leaves½medium red onion, finely chopped2small Indian green chiles or serrano chiles, finely chopped1cup plain low-fat Greek yogurt½cup finely chopped cilantro½tsp. freshly ground black pepperPinch of red chili powderKosher salt12large slices sourdough breadCilantro Chutney or store-bought chutney and/or ketchup, preferably Heinz (for serving; optional)PreparationStep 1Heat ¼ cup oil in a small saucepan over low heat until just warm. Add mustard seeds and cook until they start to pop and sputter, which should be a matter of seconds. Quickly remove pan from heat, add curry leaves, and toss to coat—they should crisp immediately from the residual heat. Set spiced oil aside.Step 2Mix together onion, green chiles, yogurt, cilantro, black pepper, and chili powder in a small bowl; season with salt. Spread yogurt mixture over 6 slices of bread and top with remaining slices to make 6 sandwiches.Step 3Heat 1 tsp. olive oil in a large skillet over medium heat until shimmering. Reduce heat to low and cook 2 sandwiches until undersides are crisp and golden brown, about 3 minutes. Turn, add another 1 tsp. olive oil to skillet, and cook until the second side is crisp and golden brown, about 3 minutes. Transfer sandwiches to a platter or plates; repeat with remaining sandwiches and 4 tsp. oil.Step 4Drizzle reserved spiced oil evenly over sandwiches. Cut in half and serve with chutney and/or ketchup alongside if desired.Step 5Do Ahead: Yogurt filling can be made 1 day ahead. Cover and chill.How would you rate Dahi Toast?Leave a ReviewTell us what you thinkReviews (16)Back to TopTriangleMade as written but a lovely simple dish.AnonymousSeattle Washington 7/9/2021My family is addicted to these sandwiches!  Who would have thought yogurt sandwiches? Priya these are worth every praise out there! I bought your cookbook after trying these and you do not disappoint on any recipe! Kudos to you! And thanks!!!AnonymousSan Francisco, CA1/19/2021I am an addict. I make a batch of this stuff and eat it three meals a day until it's gone. I cheat by buying WF fresh slaw in a box and that way I don't have to fool with a whole head of cabbage. It also already has carrots. Just chop a quantity of that a bit more, add chopped bell pepper, fresh cilantro, and a serrano chili (I use the whole thing). Fage yogurt is the only way to go on this. If you don't use white bread you won't get as impressive looking grill on it, but I've used all kinds and the crunch and mouth feel are all there. The vegetables will weep from the salt, I just pour that off every time so my bread won't get soggy.  KegleyJackson, mS1/14/2021What is this witchcraft? Bread? Yogurt? As a sandwich!?! Let me dispel your skepticism right here, right now: this recipe is SO incredibly flavorful and delicious. My partner and I made this last night and we could not stop commenting on how tasty it was. Priya is a freaking genius. The chhaunk is to die for (especially if you can get your hands on fresh curry leaves). The yogurt filling is perfectly spicy & tangy. Just go ahead and make this already! You won't regret it! AnikaBerkeley11/11/2020I had my eye on this recipe for a while, and I decided that this would be our Election Day comfort food. Election Day was disappointing, but this dahi toast exceeded our expectations and provided major comfort. We kept taking bites and saying, \"Can you believe how good this is?\" I made the recipe basically as written except that I had yellow mustard seeds, not black, on hand, and I could only find dried curry leaves. As to condiments, my husband loved the chutney/ketchup mashup. I actually preferred my dahi toast without additions. (However, I later used the chutney for Indian-ish nachos, which were outstanding, and as a stir-in for a spiced red lentil stew, where it amped up an old standby.) I will be making dahi toast over and over again, and I will not change a thing in this recipe. Denver11/5/2020This will definitely become a regular quick-fix meal in my house because it was so good!!! I'm Indian, so we always have homemade yoghurt in the fridge and I have a curry leave plant in the garden too. It all came together super quick! I also added a pinch of garam masala and finely chopped cucumber to the yoghurt, and then swirled ketchup and cilantro chutney like Priya suggested which is basically a revelation. AnonymousAustralia5/29/2020delicious! I made a few tweaks and it was still amazing. I used dried curry leaves instead of fresh, vegan yoghurt instead of greek (I expect it would be even better if you can be bothered to/have the time to strain the yoghurt to get it to a similar consistency), replaced onion with scallion greens, added in some lime zest to make up for the lesser tang of the yoghurt, threw in some fennel seeds, chaat masala and finely chopped cooked beetroot into the filling to give it a gorgeous colour - same on adding a dash of smoked paprika to the chhonk. I also broiled the toasts instead of pan-cooking, though I think I'll give it a go next time as by bread sort of curled up at the sides and separated from the filling a little. so. good.AnonymousUnited Kingdom5/22/2020oh man you cannot skip out on the curry leaves. so if you have them, this is fkn awesome. we added some salt to the top and had with tamarind sriracha. AnonymousPortland3/26/2020So good!! Always made chutney sandwiches growing up but never a version with yogurt, so was scared but interested to try this and now it's my new favorite. Loved it!californiacook3/18/2020Amazing!  I come from an Indian household so we had the tools to carry this out and it came out soooo good.  Will definitely try more of Priya's recipes.foodlover007New York City, NY, United States12/22/2019Obsessed with these, been making them for three mornings in a row. I followed every single instruction to the t and it came out perfect. The only thing I changed was using thai chilli instead and adding a little more chilli powder. Fantastic. 👌munirahalhabshiKuala Lumpur12/17/2019Made it, it was great. No regrets about the spicier than usual chilis that I used, either. The chaunk was a great final tough.AnonymousQueens, NY7/4/2019As good as I thought it would be! Sadly had to make this without the chhaunk because I couldn't find Curry leaves locally but the rest was amazing. Fried the sandwiches in ghee, and used serranos and shallots in the filling. The chutney is also incredible but I'll leave a separate review for that. Can't wait to get Priya's book! AnonymousNew Jersey6/15/2019This is so refreshingly great, beautiful and complex balance of both subtle and striking flavours. Even though it does come out a bit oily with the chhaunk it’s still so bright and tasty, much more so than any grilled cheese. The cilantro chutney was incredible, we couldn’t stop eating it, and we preferred it over the tomato sauce we also had (that’s what we have in Australia, which is different to Ketchup). This is definitely going on our regular roster of our favourite quick meals.camamurrayPerth, Australia6/2/2019Dahi toast earned the approval of my picky Indian parents! For people who think yogurt with bread is weird, the yogurt takes on a cream cheese like consistency when cooked in the sandwich. The spices are perfectly balanced and refreshing. Personally, I liked it with ketchup but chutney is great too! If you don't want it to be too oily, simply reduce the amount of Chhaunk you pour on top!AnonymousMountain View CA5/20/2019Explore Bon AppétitSandwichToastIndianSouth AsianAsianMainSnackVegetarianRamadanLunchRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Priya Krishna"]}