{"id": "bf343cdaf98b0fac289d4e8177c6a2c9", "url": "https://www.bonappetit.com/recipe/hoisin-glazed-pork-chops", "year": 2018.0, "month": 2.0, "day": 2.0, "content": "Hoisin-Glazed Pork Chops Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueHoisin-Glazed Pork ChopsBy Claire SaffitzFebruary 12, 20184.5(8)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Styling by Molly BazEmailPinterestPrintEmailPinterestPrintWhy make your own hoisin? Because the addictively sweet-salty condiment will wake up just about everything you’re making this week.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Spoons$10 At Bon Appétit MarketMeasuring Cups$18 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEAMedium Saucepan$39 At AmazonWhisk$10 At AmazonPlate$55 At Bon Appétit MarketTongs$13 At AmazonPlastic Bag$11.70 At AmazonMedium Bowl$17 At AmazonCast Iron Skillet$30 At AmazonInstant-Read Thermometer$35 At ThermoworksIngredients4 servings3garlic cloves, finely chopped2Tbsp. vegetable oil⅓cup soy sauce3Tbsp. honey2Tbsp. distilled white vinegar2Tbsp. tahini2tsp. SrirachaKosher saltFreshly ground black pepper21½\"-thick bone-in pork rib chops (about 1 lb. each), patted dryPreparationStep 1Peel and finely chop 3 garlic cloves. Heat 2 Tbsp. oil in a medium saucepan over medium. Cook garlic, stirring often, until golden brown, about 2 minutes.Step 2Add ⅓ cup soy sauce, 3 Tbsp. honey, 2 Tbsp. vinegar, 2 Tbsp. tahini, and 2 tsp. Sriracha and whisk until smooth. Cook, whisking occasionally, until sauce is thick and smooth, about 5 minutes. Season with salt and pepper; let cool.→  BTW, you're going to want to make a triple batch of that sauce...Step 3Season 2 1½\"-thick pork chops all over with salt and pepper.Step 4Place in a large resealable plastic bag and add half of hoisin sauce. Transfer remaining sauce to a medium bowl; set aside. Seal bag, pressing out air, and turn to coat pork. Let sit at least 20 minutes.Step 5Preheat a large skillet, preferably cast iron, over medium. Remove pork from bag with tongs, shaking off excess marinade. Cook pork chops until bottom side is golden brown, about 1 minute.Step 6Turn and cook on other side about 1 minute, then turn again. Continue to cook, turning about every minute, until chops are deep golden brown and charred in spots and an instant-read thermometer inserted into the thickest part registers 135°, 15–18 minutes (cooking time will depend on thickness of chops). Transfer to a cutting board and let rest at least 10 minutes (pork will come to 145° as it sits).Step 7Slice along bones to remove, then slice chops into ½\"-thick pieces. Serve pork with reserved hoisin sauce spooned over.Step 8Do Ahead: Hoisin sauce can be made 4 days ahead; cover and chill. Thin with water if needed before using. Pork can be marinated 1 day ahead; keep chilled.Nutrition Per ServingCalories (kcal) 420 Fat (g) 25 Saturated Fat (g) 7 Cholesterol (mg) 75 Carbohydrates (g) 16 Dietary Fiber (g) 1 Total Sugars (g) 12 Protein (g) 31 Sodium (mg) 1450How would you rate Hoisin-Glazed Pork Chops?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleYum! This was great.  I actually couldn’t find tahnini, so I made my own (Googled it) - just food processed sesame seeds and add a little oil. This hoisin would be good with anything. AnonymousNew York5/6/2020The Hoisin sauce is sooooooo good! I used dark rice vinegar instead and it was still really good! ColinCordillCorona, CA3/22/2019Explore Bon AppétitPorkMeatPork ChopEasyMainDairy-FreeFryDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-02-16", "author": ["Condé Nast", "Claire Saffitz"]}