{"id": "bf3ae2f7763e3f967b84626ace3b2fc3", "url": "https://www.bonappetit.com/recipe/bas-best-matzo-balls", "year": 2019.0, "month": 4.0, "day": 2.0, "content": "BA’s Best Matzo Balls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesBA’s Best Matzo BallsBy Molly BazApril 8, 20194.3(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThe perfect matzo ball doesn’t require seltzer, baking powder, egg whites, or even a light touch, and this recipe proves it. We like chicken schmaltz for the flavor and texture it gives (make sure to use the good stuff) and added in some dill and black pepper for extra flavor. This recipe makes 16 balls total and was developed to go with BA’s Best Matzo Ball Soup.IngredientsMakes 166large eggs½cup melted schmaltz (chicken fat) or vegetable oil6Tbsp. chicken broth or water3Tbsp. chopped dill¾tsp. freshly ground pepper3Tbsp. plus 1½ tsp. kosher salt1½cups matzo mealPreparationStep 1Whisk eggs in a medium bowl until no streaks remain. Add schmaltz, broth, dill, pepper, and 1½ tsp. salt and whisk vigorously to combine. Whisk in matzo meal until well combined. Chill at least 35 minutes or up to 2 hours (this is essential so that the matzo meal can hydrate).Step 2Bring 3 qt. water to a boil in a medium pot. Season with remaining 3 Tbsp. salt.Step 3Using dampened hands, roll matzo mixture into 16 balls about 1½\" in diameter. It’s okay to really work them into a ball; they won’t get dense—trust us, we tried! Transfer to a small rimmed baking sheet or large plate.Step 4Carefully lower matzo balls into boiling water with a slotted spoon, adjusting heat as needed to maintain a low simmer. Cover pot and simmer over low heat, checking occasionally to make sure water isn’t boiling too rapidly, until balls are very puffed and light in color, 30–40 minutes. Don’t remove them sooner than this; they will be dense in the middle if undercooked. Turn off heat and let balls sit in cooking liquid until ready to serve.Step 5Do Ahead: Matzo balls can be made 2 days ahead. Transfer to an airtight container along with 2–3 Tbsp. cooking liquid and chill.How would you rate BA’s Best Matzo Balls?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleGood Recipe. We had to simmer them for an hour. They got bigger and fluffier the longer we simmered the.CeliaHouston, Texas2/26/2022Although completely cooked, they did not expand and were doughy and chewy.  I a mystified why they turned out that way. I followed the directions.Foodie GalLos Angeles1/29/2022I did the same thing as Jullietee - put all the salt in the mix AND in the water but unlike her I didn't realise my mistake until I was eating them. My partner was so kind when she said perhaps it's a little salty..\nThese would've been delicious had I read the manual correctly aaaagh!MarkSydney, Australia1/9/2022These are the best matzoh balls. I made a few mistakes. The first thing I did is I read the 3 tablespoons +1 1/2 teaspoons of salt and put them all in the mix so I started over again. Oops. Then, I made them and cooked them and forgot to put the 3 tablespoons of salt in the water. And they turned out perfect anyway. I did not have fresh dill so I used half the amount of dried dill and they were amazing. I gave this recipe a perfect 10Jillietee Los Angeles CA12/5/2021A suggestion to travelers out there--I make these for our freezer so that when we come home and are worn out I just pull them out of the freezer, heat up my homemade chicken stock and feel like I'll make it another day.  (I freeze them on parchment paper and then in a vacuum sealer and they never disappoint.  Ever.  I sometimes tweak this recipe and add some onion powder and a dash of cayenne.  Yummy.BPat15226Pittsburgh, PA8/23/2021These were without a doubt the least hassle no frills matzo ball recipe I've made. No need for mixes or additions. Just some matzo meal and stuff you have laying around. I subbed light olive oil for schmaltz. Last 2 times I let the balls rest 2 hours in the fridge. One thing I feel is key is boiling in just the salted water. Something about cooking balls in the soup directly always gives me wonky results. WAAAAAY too much salt on the cooking part of the recipe. Like for real. Believe the other SALT BOMB comment from another reviewer. It's for really real true. Just salt the water lightly like you'd do with pasta. After the balls are cooked just let them rest in the soup a bit. In the end every ball bite you take will have some of the tasty soup in it anyway. I think the goal here for most ball-ers is the texture. Let's face it these are just balls of matza and matza isn't exactly the show stopping flavor monster. \n\nIn short...follow the recipe up to the salt in the water for cooking. WAY TOO MUCHAnonymousNew York4/29/2020Wow! I made these Matzo Balls for a pot of chicken soup following recipe. Didn’t have dill on hand so I substituted with fresh parsley. Simmered 40 minutes and spoon test resulted in a perfect Matzo Ball. These were, light, fluffy and delicious!! Pretty good for a first time making Matzo Balls. I passed this recipe on to several friends. Will definitely make these again.Apekrol57Margate, FL4/13/2020@bookbitch -you probably made the same mistake I did, which is to add the entire amount of salt that's written in the recipe into the actual matzo balls, whereas they meant for the bulk of the salt, three tablespoons, to go into the boiling water. Luckily I realized my mistake before boiling them, so I doubled the recipe without any more salt, and they came out just fine. The recipe should be changed to show the two quantities of salt separately so more people don't make the same mistake, as to them puffing up, I personally like a dense matzahball and enjoyed these very much. Making them for the second time.Alipali333Nyc4/8/2020Just threw these in the trash and starting over. They didn't puff up much, though they were cooked all the way through. The big issue was the salt; they were little salt bombs and just inedible.bookbitchFlorida4/8/2020Explore Bon AppétitJewishMatzoOther IngredientsSimmerRosh HashanahPassoverHanukkahRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-08", "author": ["Condé Nast", "Molly Baz"]}