{"id": "bf3bfcfa89a9d769c6e459382488b5c2", "url": "https://www.bonappetit.com/recipe/cucumber-and-peach-salad-with-herbs", "year": 2019.0, "month": 7.0, "day": 2.0, "content": "Cucumber and Peach Salad with Herbs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAugust 2019 IssueCucumber and Peach Salad with HerbsBy Kelly MarianiJuly 9, 20193.7(5)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, prop styling by Kendra SmootEmailPinterestPrintEmailPinterestPrintYou can use various heirloom cucumbers for this savory-sweet salad recipe; if you can find them, flaunt them. If not, just use a mix of mini and English hothouse cucumbers, which are available year-round. This recipe is by Kelly Mariani from Scribe Winery in Sonoma, CA.Ingredients6 servingsVinaigrette1shallot, finely choppedKosher salt1lemon2Tbsp. Katz’s Sauvignon Blanc vinegar or other white wine vinegarSalad and Assembly2lb. mixed heirloom cucumbers, sliced into ¼\"-thick wedges and rounds1English hothouse cucumber, halved lengthwise, sliced crosswiseKosher salt2lb. yellow peaches, sliced into ¾\"-thick wedges4oz. mild feta, crumbledFreshly ground black pepperHandful of basil leaves, torn if largeHandful of mint leaves, torn if large1lemon, halvedPreparationVinaigretteStep 1Place shallot in a small bowl and season with a big pinch of salt. Finely grate zest from lemon into bowl; cut lemon in half and squeeze in juice. Add vinegar and toss to combine. Let sit 10 minutes.Salad and AssemblyStep 2Place cucumbers in a medium bowl and season with salt. Spoon half of vinaigrette over and toss gently to coat.Step 3Place peaches in a serving bowl or on a platter and season with salt. Spoon remaining vinaigrette over and toss gently with your hands to coat.Step 4Add cucumbers to peaches; toss gently again just to combine. Add feta; season with salt and pepper. Top salad with basil and mint and squeeze lemon over.How would you rate Cucumber and Peach Salad with Herbs?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleThis is wonderful... and lovely.  The only changes I made was added a little sugar to the vinaigrette and used white balsamic vinegar.  Will definitely make again.. and again... and again. Anonymous7/18/2020Re question about no oil: I haven't tried this yet, but I notice the identical recipe is on the Epicurious Website, where 3 people replied they love the recipe, including 1 person who specifically says it does not need oil. Dan from CTNorthern CT rural suburb9/9/2019Is there not meant to be any oil in the vinaigrette?  Thank you for your help!Anonymous8/26/2019Explore Bon AppétitSaladCucumberVegetablePeachStone FruitFruitBasilHerbs & SpicesMintSummerQuickEasyWeeknight MealsSideGluten-FreeNut-FreeVegetarianHealthyishLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-09", "author": ["Condé Nast", "Kelly Mariani"]}