{"id": "bf4062f8ed968b9928f084b306ef990c", "url": "https://www.bonappetit.com/story/acquerello-risotto-rice", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "This Risotto Rice Is Magnifico | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Risotto Rice Is MagnificoAcquerello is my gateway to la dolce vita. Did I mention I speak Italian?By Ali FrancisApril 8, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.Have you heard about ITALY? I love Italy. Ever since watching Eat Pray Love, an excellent film by the way, I’ve been obsessed with The Boot. I was last there in 2019 with my mom—she’s the sensitive and romantic Elizabeth Gilbert and I’m the overeager and food obsessed Luca Spaghetti—and we traipsed through Tuscany and Lake Como and Umbria, filling our fanny packs with truffle paste and tinned anchovies. When I got home, I immediately started taking Italian lessons, spending all my money at Gustiamo.com, and lurking wistfully on the Italian answer to Zillow, Idealista.So, it will probably not surprise you to learn that my favorite rice is Acquerello—a carnaroli variety typically used in risotto, grown and milled by the Rondolino family in a perfectly romantic-looking village in Piedmont. The name Acquerello, thank you so much for asking, means “watercolor” in Italian (because rice is grown in water!). Both the 17.6-oz. tin and the honkin’ human-baby-size sack feature a delightful likeness of the 17th-century farm’s original manor house. I’d be lying if I said the packaging wasn’t a huge draw; I love shiny things.If you, like me, have survived the last year on copious amounts of carbohydrates, you need Acquerello in your life. Heston Blumenthal, Britain’s culinary renaissance man best known for his science- and sensory-forward cooking, called it “the best rice in the world.” And this self-anointed Italian connoisseur (me) agrees. Acquerello’s magic lies in its unique, patented (!) processing method: After aging for a year in temperature-controlled silos, the sugars in the starches develop into a nutty sweetness and the grains harden, which means they’re less absorbent and won’t turn your risotto into sludge.“It’s fascinating; each kernel is remarkably smooth,” I told my thoroughly disinterested boyfriend, who, late one night found me inspecting the tiny pearls with a magnifying glass. To avoid damaging the rice during whitening—a process whereby grains are usually passed through two abrasive, mechanized surfaces to remove the germ and bran—Acquerello uses a gentle tumbling process that grinds the kernels against one another instead. Most carnaroli producers would discard the germ that gives brown rice its color and nutritious reputation, but the Rondolinos are not most. They heat the fibrous leftovers in a way that allows them to recoat the kernels, so Acquerello cooks like a white rice but is packed with all the vitamins and minerals of brown rice.Looking for a second, bona fide Italian opinion, and eager to make my Italian tutor, Milena, proud, I emailed chef Gabriele Boffa, who has been using Acquerello rice for three years at Locanda del Sant’Uffizio, a Michelin-starred hotel and restaurant in the northwestern province of Asti. (I’d heard of the palatial resort while I was visiting and have added it to my future travel itinerary.) “With the production technique, the rice maintains a good resistance to overcooking and offers a very pleasant grain structure under the teeth,” he explained IN ITALIAN. While Boffa mostly uses the rice for Locanda’s creamy red pepper and black olive risotto, he says it’s super versatile. Now that I have prepared it in a rice cooker, on the stove, and in the oven, I can confirm that Aquerello is hard to botch.These days, while pleasures are still few, I savor my precious grains. Instead of blowing through the 5.5-lb. bag in a few dinners, I like to ration it out; making tomatoey risotto, cheesy arancini, and pea-flecked risi e bisi whenever I need a little Italy in New York. And instead of wolfing it down in front of the TV, I take my bowl and a bottle of Chianti to the bathroom, pour an epsom-salted tub, and pretend the splashes are sounds of the Tyrrhenian Sea lapping a pebbly shore. Inevitably, the wine disappears and the bath turns cold and I’m still in my apartment, but then I remember that there’s plenty more rice in the sack.Photo by Emma FishmanAcquerello Rice, 5.5 Pound Bag$37 at AmazonExplore Bon AppétitHighly RecommendShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-08", "author": ["Condé Nast", "Ali Francis"]}