{"id": "bf576287e4163a0bd86d20b02771a44e", "url": "https://www.bonappetit.com/recipe/whiskey-sour", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Whiskey Sour Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2016 IssueWhiskey SourBy Chris MoroccoDecember 16, 20204.5(193)Read ReviewsTriangleEmailPinterestPrintPhoto by Ted CavanaughEmailPinterestPrintEmailPinterestPrintThe key to an excellent whiskey sour? Getting the balance just right. This whiskey sour recipe has all the right proportions of bright, bracing lemon juice; warming, floral bourbon; and sweet simple syrup to deliver a refreshing cocktail that’s neither too cloying nor too biting. Using freshly squeezed juice is essential—the stuff that comes out of fruit-shaped squeeze bottles doesn’t even compare. If you don't have any lemon on hand, you can swap it out for lime (or a mixture of the two). Serve on the rocks with an orange wheel and a Maraschino cherry arranged neatly on a drink spear (optional but recommended!), and enjoy. Cheers!Editor’s note: This recipe was originally published on April 19, 2016.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCocktail Shaker$20 At AmazonHawthorne Strainer$7 At AmazonCitrus Juicer$13 At Amazon1.25\" Silicone Ice Cube Tray$15 At AmazonCocktail Picks$5 At AmazonIngredientsMakes 1  Servings2ounces bourbon¾ounce fresh lemon juice¾ounce simple syrup½orange wheel (for serving)Maraschino cherry (for serving)PreparationStep 1Combine bourbon, lemon juice, and simple syrup in a cocktail shaker.Step 2Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds.Step 3Strain cocktail through a Hawthorne strainer or a slotted spoon into an old-fashioned or rocks glass filled with ice. Garnish with orange wheel and cherry.How would you rate Whiskey Sour?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI like a little less simple syrup--maybe 1/2 oz.  And I love a New York sour. Same recipe, but float a tablespoon or two of fruity red wine on the top.LauraHSeattle, WA12/6/2021Best when usin2 shotsAnonymousVirginia beach,va8/12/2021Perfect, perfect, perfect !!!  Love the sweet to tart flavor, with a cherry on top.SaffiraCleveland, ohio8/5/2021A simple cocktail and now a new favorite!  I’ll try straight up next.CarolRockford, IL6/11/2021Was great really enjoyed themSmiley Indiana 5/25/2021I typically like mine a little more tart, so I go with 1 fl oz lemon juice to 3/4 fl oz syrup. But equal parts sour-to-sweet is a solid place to start.\n\nAnd don't mind the naysayers: you can totally have your whiskey sour on the rocks, particularly if you're omitting the egg white that would make it a Boston sour (in which case the ice might hamper the foamy presentation, but that's really its only sin). It's a matter of preference -- just make sure you're using good ice to avoid off flavors.\n\nPro tip: Upgrade by gently adding a float of 1/2 fl oz or so of red wine on top to make it a New York sour. Bliss.ErikHouston, TX5/12/2021Whiskey Sours should never be served over Ice. It will only dilute the drinks profile. This drink has traditionally been served and should still be served, ‘UP’. Otherwise from that note, the balance should be a fraction of a hairline just over or just under the balance spectrum ratio to ensure the notes of the Whiskey itself are still able to shine through to the drink palette.\nNot a bad recipe.Nathan BaldwinNew York City 5/11/2021Great classic cocktail. But, when I’m in a hurry, as a variation on the Forkey-Fingers method below, I take a shot of whiskey like a tequila shot and sub in the baking soda for the salt and the lime for the lemon. CHEFS KISS.MarvPortland, Maine4/21/2021OK, I'm not familiar with Whiskey sours, so maybe I'm way off but do y'all mean soda WATER and not BAKING soda?  Either that or y'all are getting high off your own product. :-p lmcmaeyMontreal, QC3/3/2021I tried baking soda AND bourbon (ok, I just used cheap whiskey) and boy was that a good decision. Will never make a whiskey sour without it again. Some other modifications I found necessary was substituting the shaker (not fancy enough) for a good strong spoon stirring.   Jim Spoon FingersAnchorage, Alaska2/24/2021This is my \"go-to\" Friday night cocktail, but I use a good, herbal/floral honey in place of the simple syrup.  I think I got that recipe here as well and it was called a \"Gold Rush.\"  The honey adds a little complexity to the flavors, without veering wildly from the flavor profile of the classic.\nMaryTwin Cities, Minnesota2/4/2021Tried out Mr. Forky-Fingers substitution of baking soda for whiskey. You know, it sounded crazy but just really perfected an already fantastic recipe. Tasted like a cool water hitting the back of your throat after running around with your pals on a hot summer day in the fields of the Piedmont in Georgia. KavehAtlanta, GA2/1/2021I don't understand what some of the posts here mean; baking soda?  Maple syrup?  Please:  Just use the ingredients listed in this recipe for a classic, awesome whiskey sour.  Best recipe -- evah!VictoriaOHIO12/31/2020Beyond perfect!!Steffee BowdenCary NC11/17/2020A fun twist on the baking soda variety I tried was using a lime wedge instead of an orange wedge and replacing the lemon juice with white vinegar. Serve in a paper mache volcano for a fun tropical surprise! Nashville10/18/2020Explore Bon AppétitCocktailDrinks AllBourbonWhiskeyAlcohol & Other DrinksEasyQuick5 Ingredients or FewerDrinksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2016-04-19", "author": ["Condé Nast", "Chris Morocco"]}