{"id": "bf5dab21e8d86172b1aac23e84016088", "url": "https://www.bonappetit.com/recipe/cheesy-tomato-beans-with-broccoli-rabe", "year": 2022.0, "month": 1.0, "day": 1.0, "content": "Cheesy Tomato Beans With Broccoli Rabe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2022 IssueCheesy Tomato Beans With Broccoli RabeBy Christina ChaeyJanuary 4, 20223.5(48)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, food styling by Pearl Jones, prop styling by Sophie StrangioEmailPinterestPrintEmailPinterestPrintThe duo of double-concentrated (read: extra flavorful) tomato paste and cooked-down canned whole peeled tomatoes brings stewed-all-day flavor to this under-an-hour skillet dinner. Call them pizza beans with a dose of greens.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonBox Grater$13 At AmazonCan Opener$14 At AmazonWooden Spoon$6 At AmazonMesh Sieve$13 At AmazonIngredients4 servings4garlic cloves3Tbsp. extra-virgin olive oil, plus more for serving4oil-packed anchovy fillets2Tbsp. double-concentrated tomato paste½tsp. crushed red pepper flakes, plus more for serving1bunch broccoli rabe, trimmed, cut into 3\" piecesKosher salt, freshly ground pepper114-oz. can whole peeled tomatoes, drained, tomatoes torn into pieces, liquid reserved215-oz. cans cannellini (white kidney) or other white beans, rinsed1cup shredded low-moisture mozzarellaFinely grated Parmesan and toasted country-style bread (for serving)PreparationStep 1Cook garlic and 3 Tbsp. oil in a large ovenproof skillet over medium, reducing heat as needed to keep garlic from burning, until golden brown, 6–8 minutes. Add anchovies, tomato paste, and ½ tsp. red pepper flakes.Step 2Cook, stirring with a wooden spoon, until tomato paste is darkened in color and anchovies are dissolved into mixture, about 2 minutes.Step 3Add broccoli rabe to skillet and stir to coat; season with salt and pepper. Cook until broccoli rabe leaves are wilted and stems begin to soften, 6–8 minutes. Mash garlic cloves with spoon and stir into broccoli rabe to incorporate. Add tomato pieces and cook until broccoli rabe is tender and almost all of the liquid from tomatoes is evaporated (it should look more like a paste than a sauce), 8–10 minutes. Add beans, reserved tomato liquid, and ¼ cup water and stir to combine; season with more salt and pepper. Bring to a simmer and cook until beans are warmed through and flavors have melded, about 5 minutes.Step 4Heat broiler. Evenly scatter mozzarella over bean mixture and transfer skillet to oven. Broil until cheese is melted, bubbling, and browned in spots, about 2 minutes (watch carefully so cheese doesn’t burn).Step 5Serve beans, topped with Parmesan and more oil and red pepper flakes, with toast alongside for dipping.How would you rate Cheesy Tomato Beans With Broccoli Rabe?Leave a ReviewTell us what you thinkReviews (22)Back to TopTriangleThis could easily be a dish we make every week. It was absolutely delicious! The only thing I changed was using broccolini instead of broccoli rabe (after seeing a few reviews that commented on bitterness). It was perfect. My husband and I gobbled it up along with some toasted bread. I made fish that night too and hardly ate any because this dish was so delicious. Thanks BA!amyamyHouston, TX2/15/2022One of the few recipes from Bon Apetit that fails. The cooked double concentrated tomato plus broccoli rabe makes for an extremely bitter dish. The beans are lackluster and the dish desperately needs some brightness. Sad I wasted a good homemade pit of beans on this dish. It completely lacks flavor and depth. Don’t waste your time. AnonymousSanta Fe 2/11/2022This is winner and is my new favorite WFH lunch.  I made the following small adjustments based on what I already had: 1 tbsp Red Boat Fish Sauce instead of anchovies, 1 tbsp Calabrian chili paste instead of flakes and smoked mozzarella.  I think the smoked cheese put it over the top and highly recommended.  Even my partner, who is not a huge cheese lover enjoyed it.JodiNYC2/1/2022Modified the recipe a bit. Followed Step (1) as show’s.. However, I removed the Broccoli Rabe from the pan. Then added the tomatoes, reserved tomato liquid etc. Let it cook down to a tight sauce. Added beans with it’s juice and let it cook down a bit to meld flavors. I then added the broccoli rabe. Let it cook another 5 mins. Sprinkled with Parmigiano and Mozzarella Broiled as above. Came out fantastic.Anonymous1/29/2022Tried this last night.  Didn't have the rabe so substituted with some Tuscan kale and a couple of left over Bok Choy bunches.  Did the beans in an instant pot with bay leaf/S&P.  Loved the umami flavouring that the anchovies brought in so basically, this worked great, no leftovers as we scraped our pan at the end.  Left it in the broiler to get a bit more charring on the cheese too.  It's on the To-Make-Again list!Bruce TCalgary, AB1/27/2022Broccoli Rabe should be cooked in boiling water for at least 15-20 minutes because in it's raw state it is very peppery and very bitter.  HeidiMNYC1/26/2022I made this despite the tepid reviews. I have to say... meh. It REALLY needed a hit of acid so I made everything as written but then added some lemon to the dish on the plate. It's just ok. I feel like it was lacking a kick too- the chili flakes weren't enough for a spice lover. I think some Aleppo peppers or something might be nice. But mostly, it cried for acid.  I don't think I'll be making this again. ShazzizNYC1/22/2022So bitter! I followed the recipe and did not make any adjustments or substitutions. Would not make again. The idea of it sounded so good, though. I see some people has this same issue and others did not. Not sure what I could have done wrong. AmyFort Lauderdale, FL1/21/2022This turned out well for me. As suggested by other reviews, I decreased cooking time and went with my instincts. My store did not have brocolli rabe so I used mustard greens. I used a whole tin of King Oscar anchovies and vegan mozzarella. I would make this again, but it won't become a favourite. GregChicago, IL1/20/2022Not great - flavor fell flat. The parts didn't come together fully to form a complete dish, IMHO. I probably won't make it again, but if I did, I would add more tomato paste, anchovy, and broccoli rabe. AnonymousMinneapolis1/20/2022Not totally sure where all of the critique is coming from in the comments - cooked this last night. Only change I made was 1 extra anchovy and a couple extra cloves of garlic because I can't get enough of either. But no other changes, no other subs needed. Came out like a delicious pan of pizza beans, exactly as advertised. Of course it's going to taste like tomato! It's essentially a pizza without the bread. Cmon yall! Anonymous1/19/2022I upped the garlic in the beginning and added lemon zest at the end. If time permitted, I might saute or roast the beans in olive oil, garlic and salt before adding.  Because we like spice I might use some arrabiata sauce instead of canned tomato the next time. I'd also add some panko on top for crunch at the end. We ate leftovers with a little more sauce on top of pasta. Overall it was a good starting point which is all a recipe generally provides.RonnieWashington, DC1/18/2022I typically am a fan of every BA recipe I try, but this was...not good. I think the rabe spent too much time in the pan and imparted the tomato sauce with its bitterness, rather than the tomato enhancing the rabe, which was what I was hoping for. Five minutes was not nearly long enough for the beans to absorb any flavor or for the texture to improve. If I was to try this again, I would increase the anchovies to 6, use a large can of whole tomatoes (rather than a 14 oz can), put the beans in much sooner, and either leave the rabe until later or omit altogether and sub in spinach. Ali Peterborough, NH1/18/2022While the adjustments to the recipe do sound tasty Spoonmom, the recipe calls for broccoli rabe not broccolini. \nDifferent tastes and cooking times. I really enjoy both :)Anonymous1/18/2022Nope. Not with the recipe as written. I bought the ingredients and made this twice, because I had enough of the 'stuff,' to make a modified version the following weekend. It was SO much better... and quite honestly it could even do better in the summer with fresh garden tomatoes, but, that's not possible now.\n\nSo, take 1 - as written. Too -'canned' tasting, and I believe it was from the condesing and then the additon of paste as well. It's NOT both necessary. Broccolini is one of my favorite veggies, but in this recipe, it gets overcooked and turned to mush. It's a waste. \n\nTake 2 - did not add additional tomato paste. Swapped fresh spinach, cooked down with a little EVOO & garlic 1st, then added to tomatoes, for broccolini. To cook down the anchovies, I added some of the regular tomatoes with garlic etc... to let them cook down into. \n\nI would definitely make this again with my adjustments. Not as written. SpoonMomCentral IL1/18/2022Explore Bon AppétitWeeknightEasyOne-Pot MealsGluten-FreeNut-FreeCannellini BeanWhite BeanBeanVegetableBroccoli RabeCanned TomatoTomatoMozzarellaCheeseRoastDinnerMainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-01-04", "author": ["Condé Nast", "Christina Chaey"]}