{"id": "bf5fd3219d2288c898fb9f5b267a8cbd", "url": "https://www.bonappetit.com/story/how-to-make-biryani", "year": 2021.0, "month": 12.0, "day": 3.0, "content": "How to Make the Best Biryani | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Make the Ultimate Fluffy and Fragrant BiryaniShe’s got layers (of perfectly steamed rice, spiced eggplant, and fried onions).By Asha LoupyDecember 21, 2021FacebookTwitterEmailPhotography by Isa Zapata. Food Styling by Cyd McDowell. Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Biryani is my love language. Frying a boatload of onions, building just the right balance of spice in the meat or vegetables, parboiling the rice so each grain cooks up long and distinct, and then layering everything together. These small acts of care result in the most aromatic, steaming pot of deliciousness that is a joy to gather around.The best biryani recipes all feature three integral components: rice, meat or vegetables flavored with a spicy masala, and fried onions. One of my favorite variations, Eggplant Biryani, draws flavor inspiration from regional biryani across India and combines big, chunky pieces of braised eggplant (marinated in yogurt and seasoned with cumin, coriander, chilli powder, and warming spices), fragrant basmati rice, lots of fried onions, cilantro, and just a touch of saffron. But regardless of the recipe you’re using, the following tips will ensure your biryani is flavorful, fluffy, and show-stopping every time.1. Seek out the right riceThe first (and most important) ingredient in biryani is the rice. This is a dish where you want to seek out aged basmati rice. It’s typically aged for a couple of years, which dries out the rice and creates incredibly fragrant, long, and discrete grains. I use Royal Brand, which you can find at your local Indian supermarket, or online.Royal White Basmati Rice$22 at Amazon$17 at Walmart2. Fry your onions in batchesNext up, the fried onions. This step takes some time—you have to thinly slice a couple large onions and fry them batches until golden brown, but the depth and caramelized sweetness of properly-cooked onions is unbeatable. Frying in batches gives the onions space to cook into individual pieces, rather than ending up as a pot of caramelized jam. Plus, then you have onion-infused oil at the ready to flavor your meat or vegetables.3. Get saucyThe masala—here, that refers to the spice mixture used to season the meat or vegetables—creates a deep, richly flavored sauce. There are many types of biryani across India and the South Asian diaspora, each one varying in spices and flavorings. This vegetarian eggplant version pulls flavors from some of my favorite regional biryani: It’s rich in chili powder akin to Hyderbadi biryani, with an underlying base of fennel that draws from Lucknowi biryani, and fragrant with warming spices, like mace and nutmeg, from Kolkata biryani.If you’re new to the wonderful world of spices, find a recipe you love and cook it as written first. Then, once you’re more comfortable, have fun with it—bump up the chiles if you’re craving a bit more fire, sprinkle in a touch of cinnamon if you like sweet-tinged notes in your savory dishes, or add black cardamom for a woodsy, smoky flavor.4. Pick a cook methodWhen it comes to cooking biryani, there are two general methods: kacchi and pukka. The former describes a process in which the raw, marinated meat (or vegetable) is layered with well-soaked rice and slowly cooked together. Alternatively, in the pukka method, the meat—or, in this case, eggplant—and par-boiled rice are cooked separately, then combined and steamed together.The method you choose is very personal, but I love the pukka method because it gives me more control over the individual components (read: it’s more foolproof for biryani beginners). Once you’ve mastered the basic techniques, you can riff with different proteins and vegetables to build your dream biryani.5. Choose your own biryani adventureNot an eggplant fan? Switch up the vegetables in the masala layer—sub in peeled and halved Yukon gold potatoes, chunky pieces of winter squash, or a mix of your favorite seasonal vegetables. For meat eaters, this recipe works beautifully with a couple pounds of bone-in chicken thighs and drumsticks, lamb stew meat, or even herb-flecked meatballs. Just keep in mind that the cook times will vary based on your filling choice.6. Watch your liquid levelsWhatever protein or vegetables you choose, just remember: Too much liquid is the archnemesis of biryani, leading to soggy, mushy grains of rice in the finished dish. The best way to avoid this is to reduce the gravy—that full-flavored sauce you’ve built with onions, aromatics, spices, and tomatoes—until it’s thick, like the texture of tomato paste, and clings to the meat or veggies.7. Get ahead of the gameWhile I find immense happiness in spending an afternoon in the kitchen cooking biryani, sometimes, if I’m entertaining and preparing other dishes, I want some of the work done ahead of time. Luckily, you can make the masala mixture and fry the onions the day before your feast. Refrigerate both overnight (the onions will end up getting steamed, so retaining their crispness isn’t important here). Then, the day of, all you have to do is reheat the masala, parboil the rice, and layer everything together.Now that you’ve learned the basics—what’s your dream biryani?Okay, I'll go first:Eggplant BiryaniThere's no denying this vegetarian biryani studded with silky eggplant is a labor of love. There's also no denying the end result is completely and totally worth it.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-21", "author": ["Condé Nast", "Asha Loupy"]}