{"id": "bf6d75638c4c9ce5b3db55b4b7249b9b", "url": "https://www.bonappetit.com/recipe/coconut-curry-greens", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "Coconut Curry Greens with Runny Eggs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesCoconut Curry Greens with Runny EggsBy Sarah JampelJune 28, 20194.8(15)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintThis shakshuka-inspired dish is green because it forgoes the traditional tomatoes and red peppers for spinach and kale. Plus the saucy, creamy base is a green curry paste made from lemongrass, coconut milk, chiles, and cilantro.Ingredients4 servings2hot chiles (such as Fresno, Holland, or Thai), divided2tsp. sugar, divided2limes, dividedKosher salt3bunches mature spinach (about 1½ lb. total), trimmed, rinsed, divided1large bunch of Tuscan kale (about 8 oz.), center ribs and stems removed1Tbsp. extra-virgin olive oil, plus more for drizzling1Tbsp. coriander seeds1lemongrass stalk, tough outer layers removed, coarsely chopped12\" piece fresh ginger, coarsely chopped3garlic cloves, coarsely chopped15curry leaves (optional but highly recommended)113.5-oz. can full-fat coconut milk1½cups cilantro leaves with tender stems, divided1¼cups torn basil, divided6large eggsCooked rice (for serving; optional)PreparationStep 1Slice 1 chile into rings, flicking out seeds and removing membranes if desired. Transfer to a medium bowl. Add 1 tsp. sugar, 1 Tbsp. lime juice (from ½ lime), and a pinch of salt and toss to combine; set aside until ready to use. Cut remaining lime half into wedges; set aside for serving. Coarsely chop remaining chile.Step 2Cook spinach and kale in a large pot of boiling salted water until bright green and tender, 1–2 minutes. Immediately transfer to an ice bath. Drain and squeeze dry (no need to squeeze to death), then coarsely chop.Step 3Heat 1 Tbsp. oil in a 10\" skillet over medium until shimmering. Cook coriander seeds, stirring frequently, until fragrant and a shade darker, 2–3 minutes. Reduce heat to medium-low and add chopped chile, lemongrass, ginger, garlic, and curry leaves (if using); season with salt. Cook, stirring frequently, until curry leaves are crisp and aromatics are just starting to soften, about 3 minutes.Step 4Transfer lemongrass mixture to a blender or food processor and blend until finely chopped. Add coconut milk, 1 cup cilantro, 1 cup basil, ¾ tsp. salt, and remaining 1½ Tbsp. lime juice and 1 tsp. sugar. Continue to blend until smooth. Taste and season with salt if needed.Step 5Heat same skillet over medium (no need to wipe out). Add greens and cook, stirring to gently separate and cook off remaining liquid, 1–2 minutes. Pour curry sauce over, stir to combine, and bring to a very gentle simmer. Cook, stirring occasionally, until sauce is thickened and greens are very tender, 4–6 minutes. Season with salt.Step 6Using a spoon, make 6 indentations in greens, then crack an egg into each. Cover and cook, rotating pan occasionally, until egg whites are opaque and cooked through, 6–10 minutes, depending on how runny you want them. Remove from heat and sit 5 minutes to give sauce a chance to set.Step 7Right before serving, add remaining ½ cup cilantro and ¼ cup basil to reserved chile-lime mixture. Season with salt and gently toss to combine.Step 8Top shakshuka with herb salad and drizzle with oil. Serve with reserved lime wedges and rice alongside (if using).How would you rate Coconut Curry Greens with Runny Eggs?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleYum! So tasty, I didn't have all the ingredients so I left out the lemongrass, basil, chilies, and just used more spinach instead of kale and it still came out outstanding. Just did one egg for a serving for one, but will refrigerate and add the eggs when I reheat the dish. For a spinach freak this is a winner!LaurelColorado Springs, Co3/7/2022Thai creamed spinach! Needs more chilies. Another 1-2 more Thai green chiliesA cook in BuffaloBuffalo, NY8/29/2021AMAZING! The combination of flavors works like magic! I would use the sauce again but maybe try salmon or chicken instead of eggs.AnonymousOntario, Canada10/25/2020This is one of my go-to recipes.  Seriously delicious and a great way to get lotsa greens in!\nThe eggs come out so amazing every time and really absorb a delicious flavor from the curry. \nThough the homemade sauce is unquestionably tastier, I often make this with premade sauce to save time.  Trader Joes sells a green curry sauce that I find works really well with this recipe!  AnonymousChicago10/6/2020I made this recipe with what I had on hand and that means I used a pre-made curry paste. I sautéed onions before adding the blanched greens though. The greens were cooked perfectly and had a lot of body and everything paired so nicely with echoer. I served it with baked naan bread and enjoyed it while in quarantine. AnonymousIndianapolis, Indiana3/24/2020I've made this twice now and it's quickly become one of my favorite meals to make to impress people. I've altered this a few times- most recently using honey instead of sugar and not blending the curry sauce ingredients just finely chopping- and it consistently comes out good. The first time I made it I went without lemongrass, but this time I threw in two stalks and oh boy, it added that extra something.asimzOakland9/30/2019Made this tonight without the lemongrass (since I didn't have on hand) and loved tis green version of shakshuka. Delicious and healthy.AnonymousNYC8/5/2019Used TJ pre Chopped Tuscan Kale & Cilantro Stems since I was out of coriander. \nServed with Toasted Naan & avocado. \nLeftovers were great to have atop PB Toast for breakfast and then tossed with some firm tofu over rice for dinner. \nThe sauce was a little loose to next time I am going to try with coconut cream rather than milk or just use a little more elbow grease on the greens :) \nFitapple22Minneapolis7/6/2019Explore Bon AppétitCurrySoutheast AsianAsianEggSpinachLeafy GreensVegetableKaleCoconut MilkOther IngredientsCurry LeafHerbs & SpicesEasyWeeknight MealsMainDairy-FreeGluten-FreeVegetarianKetoHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-28", "author": ["Condé Nast", "Sarah Jampel"]}