{"id": "bf8a8269ad554b7e08cfd36cd3f79c0d", "url": "https://www.bonappetit.com/story/the-cheese-problem", "year": 2020.0, "month": 1.0, "day": 4.0, "content": "The Melted Cheese Problem | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe Melted Cheese Problem™Why your melted cheese is greasy-lumpy-gross—and how to fix it. By Sarah JampelJanuary 28, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Yekaterina BoytsovaFacebookTwitterEmailIf you’ve ever tossed a handful of grated cheddar cheese into a bowl of hot pasta with the hopes of making a down-and-dirty mac and cheese (I am guilty as charged), you’ve experienced The Melted Cheese Problem™. Melt down a semi-firm melting cheese like Jack, Gruyère, Jarlsberg, low-moisture mozzarella, or the aforementioned cheddar on its own and it’s likely to throw a tantrum, turning into a mass of stringy clumps surrounded by a pool of oil. (Not the most awful thing on 3 a.m. noodles, but pretty terrible if you’re trying to make queso.)So how can you make a smooth, luscious cheese sauce while avoiding The Melted Cheese Problem™? When Sohla El-Waylly set out to develop a queso recipe, she fought on the front lines. It took 15 (okay, maybe 20) attempts to achieve a dip that’s creamy, homogenous, and not prone to congealing, but along the way, Sohla—and all of her diligent tasters—learned a thing or two about melting cheese. Here are the keys to success:1. 50% of the cheese is American cheeseBefore you ask, no, you can’t skip the American cheese. Sohla tried—and it didn’t work. In her first queso attempts, she used equal parts cheddar and Jack, no “processed cheese” involved. The result was a dip that was lumpy, grainy, and, after just a minute off heat, broken, with a shiny, greasy top-layer (sort of like my face after a long day). Not a winner.To solve the problem, Sohla swapped out the cheddar for American. The queso was smoother, more velvety, and less temperature-dependent—closer to the kind you’d get from a jar. American cheese was the answer. But why?At room temperature, cheeses like cheddar or Monterey Jack are a stable emulsion of dairy fat and water, held together by a protein network. But when heat is introduced, the protein structure falls apart and the emulsion breaks—the fat globules come together into a greasy pool and the proteins congeal to form a stringy mess. But American cheese is specifically designed to be extremely meltable and nearly impossible to break. When Sohla swapped out half of the cheese and replaced it with American, she built enough of a stable buffer that the Jack cheese could melt without fat separation.You can use any combo of semi-firm melting cheeses in place of the Jack (low-moisture mozzarella, Comté, fontina, Gruyère, Manchego)—but you need to keep the American cheese in there. It provides the texture (and color); the other 50% of the cheese brings the flavor and the stretchy pull.2. And don’t skip the cornstarchThe second key to keeping the emulsion stable is the cornstarch. First, the starch absorbs water, thereby thickening the queso and providing body (making it less like dressing and more like dip). But maybe more importantly, it also physically prevents the fat and the proteins from grouping together to form those respective groups of grease (fat) and stringy clumps (proteins). In other words, the starch helps to maintain the precariously balanced network of room temperature cheese, even when things get hot.There are, of course, other ways to make a smooth cheese sauce. Some recipes start with a béchamel, other calls for evaporated milk, some go all-in on American or Velveeta. Or you could, you know, get a jar.But Sohla’s queso is fast, easy, and bolder-tasting than the jarred stuff, with a little more pull and stretch—much better for drowning your sorrows (or reveling in your victory) depending on how that big football game goes. And even if your team loses, at least you've defeated The Melted Cheese Problem. And that's something to celebrate.Get the recipe:Queso, Not From a JarYou could be totally hammered halfway through the Super Bowl and still make this queso. It’s that easy.View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-28", "author": ["Condé Nast", "Sarah Jampel"]}