{"id": "bf8ecd25da2ca52a4c161f01111af17a", "url": "https://www.bonappetit.com/city-guides/tokyo/venue/nemuro-hanamaru-ginza", "year": 2018.0, "month": 3.0, "day": 3.0, "content": "Nemuro Hanamaru Ginza Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLogintokyoNemuro Hanamaru GinzaThe sushi conveyor belt you‘ve been dreaming of.FacebookPinterestTwitterEmailPhoto by Xavier Girard LachaîneGO HERE: to eat your weight in raw fish and rice without having to put up your arm and leg as collateral. Sushi has become such a highly sought-after commodity in Tokyo that both prices and wait times have ballooned to unreasonable levels. A $300 omakase dinner is already a stressful choice to make—and that’s not taking into account that reservation lists are often as long as a year or more. Nemuro Hanamaru does not require such extremes of its customers, and it also has something that haughty restaurants do not: fun. Just show up, get in line, and wait for your turn to start pulling as many plates as you can off the conveyor belt that circles the room. Watching your personal pile of empties stack up in front of you is a game unto itself.ORDER THE: items you definitely want by writing them on the provided order sheet and giving it to the waitress. But keep your eyes on the belt for specials you’ve never tried before.THE VIBE IS: a blend of the everyman culture of the restaurant and the glitz of the Ginza district bustling six floors below. Service is boisterous and efficient while  the sleek decor and views of the city outside can make the affordability of the food hard to believe. But don’t spend too much time staring out the window or the fish you really wanted might pass you by.PRACTICAL STUFF: Open daily from 11 a.m. to 11 p.m. An English menu is available and the staff speaks some English. The nearest subway station is Sapporo.Photo by Xavier Girard LachaîneNemuro Hanamaura has what‘s missing from so many other sushi restaurants: fun.\nPhoto by Xavier Girard LachaîneAs you pull from the conveyor belt, you‘ll watch the plates pile up in front of you.\nBy Kee Byung-keunExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-03-15", "author": ["Bon Appétit"]}