{"id": "bf998fa8d724f226ee73392a3a4ac2a8", "url": "https://www.bonappetit.com/story/august-2018-horoscopes-road-trip-snacks", "year": 2018.0, "month": 8.0, "day": 1.0, "content": "August Horoscopes: Road Trip Snacks for Every Sign | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAugust Horoscopes: Road Trip Snacks for Every SignOpen up Google Maps, because it’s time to hit the road (the road of life).By Catherine UrbanAugust 1, 2018FacebookTwitterEmailIllustration by Arabella SimpsonFacebookTwitterEmailIt’s the last long haul of summer vacation, aka road trip season. Whether you’re taking a day trip to the closest beach, or spending 11 hours in an un-air-conditioned van with your family—well, we’ve got your road trip snack horoscope to help you reach your destination. That’s right: a snack for every sign of the hungry Zodiac. Buckle your seatbelt and read your August horoscope, below.Illustration by Arabella SimpsonAriesYou live for fun. So much so that you’ve been meeting friends every night of the week for trivia, bowling, happy hour…but there is the risk of “too much of a good thing” because now you suddenly feel busy. You’re craving a week of total freedom to be/say/do whatever you want. Clear your schedule (and your head) by taking a road trip. By the time you’re ready to come home, you’ll know which social commitments you haven’t missed and can let go of. In your eagerness to leave the house, don’t forget your phone charger—oh, and snacks! Stop at a mega-gas station and make a mad dash for those glowing, ageless rotisserie hot dogs. Quick, satisfying, no fuss, fun-on-a-bun, just like you.Illustration by Arabella SimpsonTaurusYou’re really trying to meet your career goals this month, but you might need to adjust your workload to make sure the assignments you take on are ones that challenge you positively. It’s okay for you to be picky right now, and it’s okay for you to change your mind (we know this is hard for you, loyal Taurus!). What else can you do to reignite your excitement for your job? Burn one of those vacation days and take that hike everyone’s been telling you about. To fuel up on the road trip there, score a pack of honey roasted peanuts, which are sweet and dependable (like you!). The tube-shaped bag is ideal for dumping the salt and sugar at the bottom into your mouth, because you, Taurus, can do anything you put your mind to.Illustration by Arabella SimpsonGeminiYou’re trying to clear your mind of the clutter these days. Filter, Gemini, filter. You’re an insatiable reader, but take a break from your beloved memes and stock up on info that can serve you long term. Plan a road trip to the National Park that’s been calling your name and download enough podcasts (cough cough) to get you there. When you stop the car to stretch your legs (and maybe do some chaturangas), hit up a local fruit stand for some fresh-picked apples and off-the-vine grapes, the kind of pure juicy realness you crave after too much time in social media’s fictions.Illustration by Arabella SimpsonCancerThis August is about figuring out what is most important to you in terms of how you spend your time and money. Where are you invested? Is it paying off? Now’s the time to check in and make sure you aren’t wasting your talent and energy on a project going nowhere. So maybe it’s time to go somewhere. Skip out of town for a long weekend, rent an Airbnb in a neighboring city, and explore...it’s okay to not have a plan! Especially when you packed literally everything you could possibly need: 5 pairs of shoes, waterproof bandaids, sewing kit, and a cooler packed with homemade PB&Js, cut on the diagonal, of course. The perfect snack for someone who’s always prepared.Illustration by Arabella SimpsonLeoRelationships are wonderful and all, but reading someone else’s mind can be very frustrating. Whether you're trying to understand something your S.O. wants, or trying to crack the code of these weird Tinder social norms, this month is going to have some communication blockages. Leo is known for generosity, so we know you’ll be able to offer this person plenty of warmth to break the ice, and why not a spontaneous road trip? As for snacks, you’re packing Combos, the winning harmonization of pretzel and flavorful cheddary filling—an ideal synergy of two personalities that complement each other juuuust right. (cheesy, we know) but you may even score some points for that.Processed with VSCO with c1 presetIllustration by Arabella SimpsonVirgoIt’s easy to get so narrowed in on one thing that you lose focus on everything else. Are you trying to pack too much into one day, leaving yourself too exhausted to even brush your teeth before bed? Take charge of your routine this month by making a schedule and sticking to it (11:00 p.m.: brush teeth). Pencil in a camping weekend, and mix up some Puppy Chow for the road trip, always a crowd pleaser (like someone we know). You’ll know you’re doing it right if there’s chocolate and powdered sugar everywhere. But knowing you, there’s a stash of wet wipes packed too. Good looking out Virgo, we can always leave it to you to be both crafty and detailed.Illustration by Arabella SimpsonLibraFind more excuses to create and play this month. Buy a coloring book for the hell of it, or give in to spontaneous Thursday night dance parties in the living room. Your friends might be a little extra this month (cue the drama), but as always, you can handle it. At least one friend will have some big news to share, while another friend might need you to lend an ear. Reconnect with your closest crew and hit the road, and don’t forget a bag of Trader Joe’s Simply the Best Trek Mix. For someone who can’t decide between chocolate, dried fruit, and all of the nuts, (that’s you, Libra) feel free to pick and choose your next bite, and go ahead, take that as a metaphor.Illustration by Arabella SimpsonScorpioYou’ve got a secret you’ve been keeping under wraps; something is going on behind the scenes that’s causing quite a stir! (Maybe you think you’ll jinx it if you speak too soon?) Whether you’re moving, planning a major renovation, or uprooting yourself altogether to join the circus, one chapter is about to conclude in your life while a new and exciting one is underway. Stay focused and keep your stamina up by stocking up on beef jerky for your next road trip. The smoky snack can hold up in a long trip—and help you endure the interrogation from friends and family trying to fish out your secret. Persistence, Scorpio. Good things are coming!Illustration by Arabella SimpsonSagittariusIf you haven’t had a week-long getaway this summer, now’s the time. And boy do you need it! You’ll have good luck returning to a place you’ve already visited, which can offer you both rest and the adventure you crave. Nothing like a packed car and the open road to make you feel like a kid on summer break again. The journey is half the fun! You love buttons, and you love games, so hit up the vending machines at the next rest stop and press B14 for those mini cans of Pringles. They’re fun to eat and the handy storage tube may prove to be useful later—you’re always the one to see the possibilities with literally anything, which is why we like road tripping with you.Illustration by Arabella SimpsonCapricornYou’re resourceful, capable, and independent, which means you insist on doing everything yourself. But this month you might feel like you’re out on a limb. Trust becomes a theme for you this month, so go ahead and ask for help, Capricorn. It’s okay to let go a little. And sometimes ya gotta spend money to make money. In the meantime, get some zen time for yourself by planning a weekend escape to the nearest hot springs. You’re a no-B.S. kinda person, so bring Gardetto’s along for the ride—no frills, no fancy packaging, just straight-up salty, crunchy deliciousness. Make sure not to eat all the rye chips at once.Illustration by Arabella SimpsonAquariusYou’ve spent a considerable amount of time lately analyzing what you want out of life. Well, sorta. You’re still deciding. But at least you know what you don’t want. Call on your favorite people to be your trusted soundboard. Bounce your ideas of of them and welcome their feedback. You never know where it could lead! Maybe a spontaneous road trip is in order (good ideas happen around smoldering campfires). Definitely pull over on the way to score a Dairy Queen Blizzard, the scientifically perfect balance of ice cream and added candy, which is important for someone who appreciates facts. Turn it upside-down to marvel at how substantial it is. Yes. There’s not much you’ll get emotional about, but this is one treat you’ll go crazy for.Illustration by Arabella SimpsonPiscesYou’re usually happy to help, but sometimes people depend on you a little too much, especially when it comes to work stuff this month. Everyone else has confidence in you, so you should too! August offers you a chance to step into even more of a leadership role, so recognize that you’ve got the experience and you’re a freakin BOSS. Make your feelings known (strategically) and maybe get that advancement you deserve. Get a head start on those extra vacation days and take a road trip to the nearest amusement park. On your way, munch on popcorn sprinkled with nutritional yeast—it tastes just like cheese, except it’s… healthier? You’re down, because there’s no snack frontier you won’t explore. Stay weird, Pisces.Catherine Urban is an astrologer, writer and nutritional yeast enthusiast. Check out more of her work here.The best way to make puppy chow that doesn’t stick together:Explore Bon AppétitFood HoroscopesRoad TripTravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-01", "author": ["Condé Nast", "Catherine Urban"]}