{"id": "bfa608ed8de4ff9a320de96b405b0659", "url": "https://www.bonappetit.com/story/che-ba-mau", "year": 2020.0, "month": 8.0, "day": 2.0, "content": "Chè Ba Màu Is a Refreshing Vietnamese Summer Dessert Made With Beans, Jelly, and Sweet Coconut Milk | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChè Ba Màu Is Pure Bliss in Summer’s Sticky HeatThe vibrant layers are almost too pretty to eat.By Sovi WellonsAugust 11, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Long before boba shops and poke bars were popular, my mom brought my family—my dad, my brother, and me—to Buford Highway near Atlanta. She’d steer her hulking Ford Flex into a large faded strip mall of entirely Asian restaurants, bakeries, markets, and pawn shops.The buildings might have been ready for an update, but to me Buford Highway’s culinary treasure trove awakened my taste buds to my cultural heritage. Through banana leaf–wrapped rice, spring rolls, and shaking beef, my brother and I absorbed traditions and rich culture through Vietnamese food despite living so far from my mom’s large Vietnamese family.Buford became that once-in-a-while, all-day kind of trip after flying home from vacation or a road trip to my uncle’s in Athens, Georgia. Ravenous after a big grocery haul from Buford’s supermarket, we’d step into the doorway of Phở Bắc, inhaling the rich aromas wafting around the mirrored restaurant. Waiters bustled around with carts chock-full of herbs, hoisin sauce, bean sprouts, and chopsticks, serving bowls of beef phở bigger than my head.As we slurped our noodles, I’d picture my mom’s life and the obstacles she’d faced since childhood, from fleeing Vietnam by boat during the war to entering elementary school knowing little English, her drive to succeed unrelenting. Young and eager to please, I longed to genuinely connect with the other half of my lineage, and the food we often smiled over fostered a deep love for a country and culture that shaped my identity in countless ways.The cherry on top of those idyllic days was always dessert, my favorite of which was chè ba màu, or, as my family calls it, tricolor congee. Knowing my insatiable sweet tooth, my mom would murmur a few words to our waitress, who’d bustle over with plastic drink cups, spoons stuck through the lids.Vietnamese desserts tiptoe the line between savory and sweet with utter elegance and astounding ease. Chè ba màu consists of vibrant layers of sweet mung beans, soft kidney beans (you’ll also see it with red beans), and bouncy pandan jelly. The cups are filled to the brim with ice and coconut milk, which swirl together to create an unexpectedly delicious dessert-drink hybrid. My brother and I often fought for that last cold spoonful—pure bliss in summer’s sticky heat.As I grew into my own as a cook and baker, my mom decided it was time to teach me to make chè ba màu myself, and it’s as easy as it is stunning.Here’s how to make it: First, make the mung beans. Bring 1 cup of rinsed, split yellow mung beans with 3 cups of water to a boil, stirring constantly. Keep a close eye on the beans; they’ll try to foam over initially. Simmer for 20 minutes or until soft and paste-like. The water will be completely absorbed. Cool until ready for use.Next, make the sweetened coconut milk. Heat one 15.5-oz can of coconut milk over low until hot and then stir in 1 cup of sugar, a pinch of salt, and 2½ tablespoons of water and mix until dissolved. Set aside to cool.Bring 2 cups of water to a vigorous boil before whisking in 1¾ teaspoons of agar-agar powder and ¼ teaspoon of pandan extract (my mom calls it the vanilla of Vietnam because it’s used in so many desserts). You can substitute green food coloring for that characteristic green hue, but make an effort to track down pandan—its unique grassy-sweet flavor is well worth it. Chill the mixture in an 8x8\" pan for 30 minutes, or until set. Slice into thin 3x ⅛\" strips.And finally, for the easiest and last layer, thoroughly rinse and drain one 15.5-oz. can of dark red kidney beans.To assemble, scoop mung beans, kidney beans, and pandan jelly into five tall glasses, creating three distinct layers. Pour the sweetened coconut milk over and fill each glass to the top with crushed ice. Admire those gorgeous colors (phone eats first!), stir together, and devour.Sovi Wellons is a student at Dartmouth College as well as a self-taught baker, cook, and health enthusiast.Explore Bon AppétitIt's That SimpleVietnameseDessertJellyKidney BeansRead MorecookingWhen I Crave Simplicity, I Make This Chinese Steamed Pork PattyBy Kate KassincookingNimbu Pani is What I Drink When I Feel Like a Human FurnaceBy Nayantara DuttaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-12", "author": ["Condé Nast", "Sovi Wellons"]}