{"id": "bfa7553c894162816e847cd79da7f5a4", "url": "https://www.bonappetit.com/story/ina-garten-stress-free-thanksgiving", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "Ina Garten’s Guide to Hosting a Stress-Free Thanksgiving | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIna Garten’s Guide to Hosting a Stress-Free ThanksgivingDon’t bother with appetizers, don’t expect any help, and more sage advice from the Barefoot Contessa.By Alyse WhitneyNovember 2, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailIna Garten is Bon Appétit’s guest editor this week. Take a look into her pantry, read celebrity and chef odes to their favorite Ina recipes, watch her and food director Carla Lalli Music make chocolate-pecan scones, and read more from her guest-editing week here. \n Halloween just came and went, which means Thanksgiving is already around the corner. Time to start thinking about which turkey recipe you’ll try, the sides you’ll make, and whether you’ll opt for classic pumpkin pie or switch up the dessert with something more unconventional. Does thinking about all of that at the beginning of November stress you out? Maybe you should have prepared like Ina Garten and started planning in July.When we were hanging Garten earlier this summer, she was already well underway with her Thanksgiving menu plan. “I’m never stressed!” Hard pause. “No, of course I am,” she joked. “But a plan makes me much less stressed than I would be.”For those of us just getting around to thinking about it now, there’s still something to learn from Garten’s process. Here, the Barefoot Contessa culled her decades-worth of hosting experience for eight pro tips for a (nearly) stress-free Thanksgiving.1. Plan aheadEven if Thanksgiving in July is not for you, you can still get a head start by filling your table with make-ahead dishes. “I try and gear the menu toward things that you can do mostly in advance, like blanching the green beans and sautéing them just to reheat, and getting gratins and bread puddings ready to go so they can just go into the oven the day of.” One of the menu additions she’s most excited for this year is the butternut squash gratin from her new cookbook, Cook Like a Pro, which can be prepped days in advance.Butternut squash gratin, from Garten’s latest book Cook Like a Pro, can be made ahead easily—just save the breadcrumbs for the end so they get perfectly crispy.\nQuentin Bacon2. Tackle your shopping in stagesA week before Thanksgiving, she suggests stocking all the staples: baking ingredients, onions, potatoes, and other items that will be able to hold up until the big day. Then, two or three days before the event, she says to shop for fresh ingredients—like green beans, other fragile vegetables, and bread—and make sure her turkey is in the fridge and ready for dry brining.3. No carving for the crowdFor Ina, there’s only one way to cook turkey, and that’s by making it ahead. With her method, you make the gravy ahead too, pour it on a platter, and arrange slices of cooked turkey on top of the gravy about 30 minutes before dinner. “Then you can just put the whole platter in the oven so you're not all dressed up for Thanksgiving and slicing a turkey while everybody’s watching you. I don’t want to do that, and I’m a professional cook!” She adds that the gravy keeps everything moister and hotter longer, so it’s “not cold by the time the last person eats.”4. Don’t fuss with appetizersForget elaborate hors d'oeuvre—they’re just a distraction. Garten suggests putting out little things, like marcona almonds, instead. “The most I’ll ever do are figs wrapped in prosciutto or a dip that I can do in advance,” she says. “I’d rather spend my time making the meal and the desserts.”5. Introduce some innovation to the table“I like to do something classic and something new,” she says. One year, that meant swapping in chipotle smashed sweet potatoes that she had been developing. This year, she’s thinking about debuting her triple chocolate loaf cake with a scoop of pumpkin ice cream for an autumnal twist.6. Don’t expect any help!One of Garten’s worst Thanksgiving memories is the time she invited a bunch of friends to make all the dishes together at her home. “The next thing I knew, they were all in the library watching football, and I was in the kitchen making the entire Thanksgiving meal—right before dinner!” she recalled. “Never did it again. That was that.” Even if she’s still making the whole meal herself, she’d rather have the time to do it peacefully, quietly, and on her own time. If you have reliable family and friends, you can divide and conquer day of; or you can always assign out dishes for a potluck style feast.7. Maybe just make Thanksgiving leftovers sandwiches...for ThanksgivingOnce in a while, Garten and her husband, Jeffrey, will skip hosting Thanksgiving entirely, and jump right to the good part. “One year we decided we liked leftovers so much that I made the turkey and stuffing the day before, and we had turkey sandwiches for Thanksgiving. It was really fun.” Her ideal sandwich includes turkey, stuffing, and cranberry sauce on toasted, buttered country bread. Now that’s the ultimate stress-free Thanksgiving game plan.Explore Bon AppétitIna GartenThanksgivingTurkeyCooking TipsCelebritiesRead MorecookingIna Garten Makes Baked Alaska Cool AgainBy Alyse WhitneycultureJennifer Garner Has Been Making Ina Garten’s Beef Bourguignon Since Her Spy DaysBy Jennifer GarnercultureNeil Patrick Harris and David Burtka Built Their Relationship on Ina Garten’s GuacamoleBy Neil Patrick Harris and David BurtkacultureChef Angie Mar Learned Everything About Shrimp Scampi from Ina GartenBy Angie MarRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Alyse Whitney"]}