{"id": "bfaa79a0d2979c4b370672cb29dddfb2", "url": "https://www.bonappetit.com/recipe/mojo-meatballs", "year": 2020.0, "month": 4.0, "day": 1.0, "content": "Mojo Meatballs Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMarch 2020 IssueMojo MeatballsBy Molly BazApril 7, 20204.8(86)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, food styling by Pearl Jones, props by Nicole LouieEmailPinterestPrintEmailPinterestPrintInspired by our love of zippy chile-and-garlic-packed Cuban mojo sauce, we transformed the fun and flavor of long-cooked mojo pork into quick weeknight-able meatballs. If you’re spice sensitive, split the chiles in half lengthwise and remove the seeds; they hold much of the heat.Ingredients1cup (packed) cilantro sprigs, divided, plus more for serving1large egg⅔cup panko (Japanese breadcrumbs)1tsp. ground cumin2Tbsp. plus ⅓ cup extra-virgin olive oil, divided4tsp. sugar, divided2½tsp. Diamond Crystal or 1½ tsp.Morton kosher salt, divided, plus more4garlic cloves, divided2serrano chiles or jalapeños, divided1lb. ground pork2medium red onions, cut into 1”-thick wedgesFreshly ground black pepperJuice of 1 orangeJuice of 2 limesCooked white rice and plantain chips (for serving)PreparationStep 1Place a rack in lower third of oven; preheat to 500°. Set aside ½ cup cilantro for making the sauce; finely chop remaining ½ cup cilantro. Lightly beat egg in a medium bowl to blend. Add panko, cumin, 1 Tbsp. oil, 2 tsp. sugar, and 1½ tsp. Diamond Crystal or 1 tsp. Morton kosher salt and stir until panko softens and turns pasty. Finely grate 3 garlic cloves and 1 chile into mixture, add chopped cilantro, and mix well to combine. Using your hands, mix in pork until evenly distributed.Step 2Toss onions with 1 Tbsp. oil on a large rimmed baking sheet; season with salt and pepper. Roast until wedges are well charred underneath, about 10 minutes.Step 3While the onions are cooking, divide pork mixture into eight pieces and roll each into a 2”-diameter ball.Step 4Using a metal spatula, turn onion wedges over and scoot them toward edges of baking sheet to make room for meatballs. Arrange meatballs in the center, spacing out evenly. Return baking sheet to oven and roast until meatballs are browned and spring back when gently pressed and onions are well charred on the other side, about 10 minutes.Step 5Meanwhile, remove stem from remaining chile and split in half lengthwise. Place in a blender and add orange juice, lime juice, reserved ½ cup cilantro, remaining garlic clove, ⅓ cup oil, 2 tsp. sugar, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt; blend until mostly smooth but still specked with herbs. Transfer sauce to a small bowl.Step 6Divide rice among bowls and top with meatballs and onions, then plantain chips and more cilantro sprigs. Serve with sauce alongside.How would you rate Mojo Meatballs?Leave a ReviewTell us what you thinkReviews (51)Back to TopTriangleDelicious but, can we get calories per serving and nutritional values. Thank youKathy BDelaware3/15/2022I also made it exactly as directed. Delicious!!!Laura cseattle 2/23/2022Casey had it right. Made this exactly as written and it was devoured. Really fun flavor profile. Will be making this again, sans changes.ashMaryland2/22/2022this was absolutely freakin delicious. no revisions to recipe necessary imo.caseydenver1/29/2022Dee-lish! It was a wonderful mix of flavors and relatively quick to put together. Next time I will follow the advice of others and reduce the sugar by at least half. I followed the recipe exactly this time and found it too sweet, so blended in another Serrano pepper, garlic clove and a bit of lime rind, which did the trick. I didn’t preheat the oven till the meatballs were prepped, so as not to waste fuel or burn the onions. I made coconut rice and added the torn cilantro and plantain chips (Trader Joe’s) to the bowl. It was deeply satisfying to have such a deliciously coordinated complete meal. Thanks!MamaFinnAlameda, CA12/8/2021YIKES! Amazing. Sauce needed something so added Greek yogurt to it to make it creamy. SWOON! also made it over cauliflower rice with lime and cilantro. Used 1 lb ground chicken and 1 lb ground pork (doubled recipe). Be patient with the onions. They add a sweetness you didn’t know you needed!! Would be good for a buffet. Keeps so well!Kelly S.Apex, NC 9/29/2021I have made some variation of this recipe probably 25 times, I KID YOU NOT. I have tailored my own version of the sauce, which uses a couple green bell peppers that I roast at about 425 and peel before processing with the other ingredients. It makes a much more substantial sauce, and is basically impossible to mess up. I also make coconut rice with this, which is amazing. MaggieCharlotte, NC6/18/2021Dang Molly!!! Amazing recipe, easy, impressive & tons of flava!! Although orange & lime are traditional, I love the ideA of using grapefruit in place of orange & may try that next time. Yum!!AngelaVirginia 5/26/2021As good as everyone says! I used a little less than half the sugar, and I didn’t have enough cilantro for the sauce so used half parsley, but otherwise made it as is. Amazing flavor, super bright and delicious. Served with jasmine rice and a handful of spinach. Anonymous4/29/2021Question - would the sauce with without cilantro?  I’m allergic to it. Thanks. AnonymousWashington, DC2/24/2021Made these with lamb because that’s what I had. I roasted some red peppers along with the onions and some sweet potato coins because I had no plantains. Didn’t bother with the rice. The mojo sauce is fantastic and the meatballs have great flavour/texture. I think I’ll make a batch of sauce to use as salad dressing, I have some arugula and romaine to use up. Great recipe and I will make it again. CarswellCanada2/23/2021I've been making these since April and they're always a huge hit! The green sauce is amazing and the spices in the meatballs are perfect. I usually make them with beef, although I've done it with turkey, and also a combination of the two - all delicious. I've served the meatballs as the recipe suggests which is amazing, but I've also experimented with other combinations I could recommend, including serving these meatballs with the yogurt layered flatbreads from smitten kitchen and also adding some tahini sauce. AnonymousNew York, NY1/22/2021This is a go to recipe- easy, flavorful and plays well with lots of different veggies and starch.  I like habanero in the sauce!CookinVTShelburne, VT12/15/2020This is one of my favorite recipes and it makes for good leftovers. I use grapefruit instead of orange and if you have extra dressing it is great on a salad.SaraAustin11/21/2020This was very quick and easy to make and altogether presented a rich combination of textures and flavours in a filling meal. The sauce was well balanced between the sweetness of the citrus/sugar, the warmth of the pepper (I used jalapeño), with a fresh bite of the garlic and cilantro in the background. Every note was interestingly complementary with nothing really \"out front\". The plantain chips are a fun texture addition to the softness of the meat and rice and the meat was well-seasoned and juicy with a tad bit of crisp on the outside.  sheakToronto, ON, Canada8/2/2020Explore Bon AppétitMeatballPorkMeatSerrano ChileChileVegetableGarlicCitrusFruitWeeknight MealsMainRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-07", "author": ["Condé Nast", "Molly Baz"]}