{"id": "bfb37aac67550d700f022ef1950fdeb2", "url": "https://www.bonappetit.com/story/french-ish-onion-soup", "year": 2019.0, "month": 2.0, "day": 3.0, "content": "Finally, a French Onion Soup Recipe That’s Not a Total Drag to Make at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleFinally, a French Onion Soup Recipe That’s Not a Total Drag to Make at HomeWe call this soup French-ish because it’s not fancy or fussy, but it can be vegan if you wish.By Julia KramerFebruary 21, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailThere’s a roster of foods I will eagerly order in restaurants but will never cook at home, and at the top of that list is French onion soup.Take, for instance, the iteration at Ludo Lefebvre’s flawless French bistro Petit Trois in Los Angeles. Did I think, for one moment, about the health-related ramifications of inhaling Gruyère as I twirled and slurped my way to the bottom of this impeccable bowl of soup? Absolutely not. But when we published the recipe online, was I about to jet off to the butcher for six pounds of veal-neck bones? Yeah, no. Some things are better left to the pros.So I was, let’s say, intrigued when I stumbled down to the BA Test Kitchen a few weeks ago to see senior food editor Chris Morocco performing one of his typical low-key mad scientist experiments, all in the name of Healthyish: creating a French onion soup recipe that wouldn’t scare people away. His recipe would fulfill the basic human longing for a rich, onion-y, cheese-topped broth, while dialing back the fat quotient—not to mention laboriousness—of the traditional version. Oh yeah, and Chris wasn’t going to use any butter, because he loves to make incredibly challenging rules for the games he plays in his head. (And also so that if you omit the cheesy toast on tip, this recipe is actually vegan.)The resulting dish is a testament to the power of onions and water to create their own broth—no bones or even stocks necessary—via the sheer magic of time, slowly cooking down with some sliced garlic and a splash of white wine. It’s a simple recipe, but one that can’t be rushed (and should be generously seasoned). Because Chris is a reasonable human, he tops it with an oil-rubbed slice of bread toasted with sharp cheddar.It’s a French onion soup you can cook in good conscience. But perhaps more importantly, it’s a French onion soup you can cook.Grab some onions and get to it:French-ish Onion SoupOnions, garlic, oil, wine, and salt are all it takes to make a rich vegan broth that still evokes the classic version.View RecipeExplore Bon AppétitHealthyishSoupOnionFrenchRead Morecooking73 Healthy Soup Recipes That Make Any Day CozierGallery73 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-21", "author": ["Condé Nast", "Julia Kramer"]}