{"id": "bfbf8a84af26aa2fc05cf9604396a79e", "url": "https://www.bonappetit.com/story/erika-nakamura-jocelyn-guest", "year": 2019.0, "month": 10.0, "day": 5.0, "content": "Erika Nakamura and Jocelyn Guest on Butchering, Motherhood, and Starting Over | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleErika Nakamura and Jocelyn Guest on Butchering, Motherhood, and Starting OverThe power couple is fresh into two new endeavors—sustainable sausage and parenthood.By Hilary CadiganOctober 30, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailErika Nakamura and Jocelyn Guest have led some pretty fascinating lives. So fascinating that it’s hard to pigeonhole them into any one category—or interview them for any less than three hours (even when their one-year-old, Nina, is standing by with a diaper full of poop). The pair made a name for themselves together at White Gold, an Upper East Side butcher shop they co-owned with April Bloomfield and Ken Friedman. Then, in 2018, after allegations of Friedman’s history of sexual harassment emerged, they left.Today they’re married and the proud moms of both a baby (the aforementioned Nina, a.k.a the Notorious NNG, who is enviably chill and whose diaper was, for the record, very quickly changed) and a new sustainable small-batch sausage company, J&E Smallgoods. Owning their own business means doing things in new ways: ways that they hope will provide a better, healthier blueprint for fellow parents in the industry. Can they do it? Time will tell. But so far, so good.Erika: Before I was a butcher, I was a sculptor—and a vegetarian. I had moved from Japan, where I was born, to New York City, where I was struggling to do the studio art thing. I didn’t go to culinary school until my late 20s, and that’s where I fell in love with butchery: how things come together, how things come apart—the science of it all. As a vegetarian, I’d always been very politically minded, and that very clear “you are what you eat” ideology of whole animal butchery spoke to me.Jocelyn: My first job was making hot dogs, ironically enough. Like, cooking them at a bar and grill in Prince William County, Virginia where I grew up. (It’s where Lorena Bobbit’s from—that’s what put us on the map.) It was a horrible job. I got fired.Erika: When you're a chick in an industry full of dudes who are also learning, they don't necessarily want to share. I worked through the NYC restaurant scene, trying to find my place in it—but not one kitchen ever felt right to me. I was looking for a workplace that was healthy and that was not a thing. The way teaching would happen was: Here's a pork butt, figure it out. I was getting yelled at a lot, and I don’t do well being yelled at. Then I became someone who yelled too, and that really hurt me.Jocelyn: You yelled at me, bro.Erika: Yeah. I once threw a tray of lamb at Jocelyn.Jocelyn: I moved to L.A. because I was a comedy writer. Or, trying to be a comedy writer. And then I wasn't. You know, when you hit 28 and have that mental breakdown part of your life?Erika: And I was in L.A. too. My now ex-wife and I had opened the first whole animal butcher shop in the city, Lindy & Grundy, and used to take apprentices. So I got an email one day from Jocelyn...Jocelyn: You've trotted it out before and it's mortifying.Erika: Well, as mortifying as a letter I once wrote to Missy Robbins being like, “I really want to work for a strong woman…”Jocelyn: The difference is, you’re not married to Missy Robbins.Erika: True.Jocelyn: Anyway, I apprenticed at Lindy & Grundy for two months. Erika told me I sucked. At one point she literally took me outside and was like, “Girl, you are not great.”Erika: And she got better! The way to become really indispensable in a work environment is to be willing to do a job nobody else will do. She was never above anything. I admired that. So I hired her. We worked together for three years and then she decided to move back to New York. Right around that time was when we both were kind of like, oh, this is also...something more. So six months later, I followed.Jocelyn: New York was different. I went from this lesbo woman-forward butcher shop to like, a shop full of dudebros.Erika: Conversations with April Bloomfield and Ken Friedman had started back in L.A. But in New York, we both found our way into their restaurant group: I took up residency at the Breslin to put together a more sustainable lamb program and Jocelyn was consulting on whole animal butchery for Salvation Burger. In 2016 we partnered with them to open White Gold, a butcher shop on the Upper West Side. Jocelyn and I had a very specific idea of what we wanted it to be, and April and Ken separately had their vision of what they wanted it to be. And I don't know if any of those things ever really fully...Jocelyn: ...jived.Erika: Right. We always wanted White Gold to be more of the daytime vibe: relaxed, casual. More bodega sandwiches, less steaks. But still, I think it was an incredible place to be for a time because of the impact we made in the neighborhood and especially with the people who worked there. Being mentors was really valuable to us.Jocelyn: It wasn’t easy though. We lived two and a half blocks away so we’d be in bed at 3 a.m. and get a call like, “I broke the $10,000 grinder. Please come back to work.” So you shuffle down the avenue in pajamas. One time we got a call and we get there and it’s pouring rain in the basement. The employees were all under a big umbrella together, like goddamn Gene Kelly or something.Erika: When you're running on one or two hours of sleep every night for two weeks, it feels like you're tripping on acid and the world is melting. Except it's just a normal day.Jocelyn: But everyone's done this shit. It's not just us.Erika: A lot of people are crying in walk-ins right now.Jocelyn: The problem with the restaurant industry is there's no 401k matching. No management training. No professional development classes. And then you ask, \"Why do people no-call/no-show?\" 'Cause you don't treat them like they have a career! It’s not that people aren’t passionate. I would give my entire life to this if I thought I was going to one day make more money and get a vested stake in something and be able to have a kid without being like, \"Fuck, I make $17 an hour.”Erika: Before we made the decision to leave White Gold, we decided to have a baby.Jocelyn: We were trying to imagine what it would be like as people who have always worked 12 to 18 hours a day. It's just crazy.Erika: Then the Ken article came out.Jocelyn: Everything was turmoil, but the important thing for us was our employees, like, \"Are you okay? What do you need to talk about? What are your concerns?\"Erika: We’ve always wanted to lead by example and put our money where our mouth is. At a certain point we felt like we needed to make adjustments in our lives to make that very clear. So we sat down with our employees to let them know we were leaving.Jocelyn: Oh God, it was like a million breakup conversations. Like, okay, we have to invite this person to coffee and go get juice with this person.Erika: We decided to start our own business literally the same week that I got pregnant. It was the spring of 2018. We called it J&E SmallGoods: a small-batch sausage company with responsibly sourced meat—farms using regenerative agriculture, animals that are actually treated well. Nina, our daughter, she's like the first smallgood—that’s the funny joke.Jocelyn: We started with just three products: a snappy beef and pork hotdog; a heritage pork bratwurst; a quarter-pound beef kielbasa link...and mini cocktail weenies! That’s our newest product, coming very soon. You can buy them online or in some local specialty shops here in New York.Erika: As we grow, the idea is to split the country up by region and find sourcing, distribution, and co-manufacturing in each area to create a patched-together national brand. That way, we're still doing the right thing from a local business sourcing perspective, but in a more accessible way. Everybody wants to be able to order a hot dog without feeling bad about it.Jocelyn: We didn't have any gay lady role models doing the food thing and then the baby thing. So when we started this company, I was kind of ashamed. Like, oh, people are gonna think I'm a wimp. In the restaurant industry, there's this mob mentality: “I went harder, I did more covers, I missed seven Christmases in a row…” And it's like, “Congratulations? I got to see my 100-year-old grandmother for her birthday. That was cool too.”Erika: We’re reexamining the day-to-day and prioritizing self-care. And as the business grows, we’ll extend that to our employees: trusting people to work from home when it makes sense, switching off weekends, exploring the possibility of four-day workweeks.Jocelyn: From 4-7 every night, we don’t answer emails or phone calls. That’s playtime, dinnertime, bathtime, bedtime. If we want to go to the gym or see a matinee, we just move our meetings, still distribute our sausages on time, and nobody has to know (unless we Instagram it). We don’t stay late after catering jobs to kick it and have a beer anymore. The kid’s at home, let’s clean up and get out!Erika: We talk a lot with other parents about how we can shape the industry to be healthier. It takes some trailblazers to draw a line in the sand and say—what's that quote from Network? “I'm as mad as hell and I’m not gonna take this anymore.”Explore Bon AppétitHealthyishInterviewsRead MoreLifestyleChristina Lecki On Leaving Reynard and What She's Doing NextBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-30", "author": ["Condé Nast", "Hilary Cadigan"]}