{"id": "bfcf1592e887db5ef9364b8c04252d00", "url": "https://www.bonappetit.com/story/whole-food-cooking-every-day", "year": 2020.0, "month": 1.0, "day": 5.0, "content": "Amy Chaplin Wrote a Cookbook That Makes Healthy Eating Look Amazing | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Cookbook That Makes Healthy Eating Look AmazingAs someone who lives for an exciting, somewhat “out-there” condiment or snack, I can’t get enough.By Sarah JampelJanuary 31, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!I love gluten, sugar, and dairy (in moderation, Mom), and Amy Chaplin’s newest book, Whole Food Cooking Every Day, is a collection of 250 vegetarian recipes with none of that.  That’s why, at first, I was uninterested. But then my colleague Christina Chaey began regaling me with tales of her apple-citrus chia bircher bowls, rosemary butternut squash soup with toasted hazelnut milk, and walnut miso sauce with lemon. She’s made upwards of 30 recipes from this book, and because I trust Christina, this sent me down a WFCED rabbit hole.Formerly the executive chef of one of New York's beloved vegan institutions, the now shuttered Angelica Kitchen, Chaplin is a teacher, recipe developer, and two-time cookbook author. At this point I’ve spent hours paging through the book, scrawling down grocery lists full of grains, nuts, and seeds. Each naturally colorful recipe—fig almond cake with fennel, spicy miso-roasted tomatoes and eggplant, steamed kabocha squash with nori and scallions—sounds like the sort of thing I’d make in a kitchen with a farmhouse table and windows looking onto a breezy meadow.Most of my cookbooks are destined to live out their lives on a high shelf once I’ve cooked a few recipes enough times to have them memorized. But this one will grow with me as I become more comfortable with the techniques and ingredients. Nearly every chapter is structured around an anchor recipe—like simple soups or dishes to make with cooked beans—that spins off into seemingly infinite variations (there are no fewer than 12 variations of nut and seed milks, from pumpkin-nutmeg almond milk to Brazil nut milk with star anise and vanilla bean). I can start simple, then advance as I get more adventurous (or as I try to use up my psyllium husks). Even when I’ve been skeptical about a recipe—will this combination of soaked rice and seeds really come together into a sliceable, toastable gluten-free bread? Will raw carrots blend into a creamy dressing?—Amy has delivered.Even if I never have a kitchen with a farmhouse table and windows looking onto a breezy meadow—and even if I continue to cook and bake with gluten, sugar, and dairy for the rest of my days—I’ll still know a gazillion ways to make gluten-free crackers. And that’s enough for now.Buy it: Whole Food Cooking Every Day, $22All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishHealthyish Loves ItCookbooksShoppingRead MorerestaurantsAngelica Kitchen Says Goodbye To All ThatBy Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-01-31", "author": ["Condé Nast", "Sarah Jampel"]}