{"id": "bff0096e0093092e8d1dd723eb1f4f6d", "url": "https://www.bonappetit.com/story/rich-smoky-zucchini-dip", "year": 2020.0, "month": 8.0, "day": 5.0, "content": "This Rich and Smoky Zucchini Dip Is the Best Thing to Make With All That Summer Squash | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMy Family Is Good at Zucchini, and This Rich, Smoky Dip Is Our Best Trick of AllWhen the garden’s overrun with squash, it’s mutabbal kousa to the rescue.By Didi KaderAugust 31, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something’s so easy to make that you don’t even need one. Welcome to It’s That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.Every year in my circle of local family and friends who garden, we reach a moment when the zucchini plants growing steadily all summer suddenly take off at warp speed. Their pointy leaves reach for the sun, the yellow blossoms puff, and the plants start to produce quickly. That’s when the text message chains begin—who wants a zucchini…or three? Soon we’re all staring down the small zucchini bounty on our kitchen countertops and glancing outside at plants that keep giving.The zucchini can be a vexing vegetable—you might throw it into a soup or grill it. But then what? The plants keep producing, and the farmers markets tables are piled high with all varieties—green, yellow, round, long, and narrow. But in my Arab American family, we’ve never met a zucchini, or a bag of them, that we couldn’t handle.Why, hello!\nArabs have a way with zucchini and squash. We core Lebanese squash and stuff them with rice and ground meat or rice and chickpeas and simmer them in broth in kousa mahshi. We sauté it with tomatoes and onions to make alayet kousa wa bandoora, eaten with warm pita bread. We put it in soups like shorabet freekeh, for which each Arab cook will have their own particular additions to the base of chicken broth and freekeh (for me, it’s zucchini and fresh shucked corn).But my favorite way to transform zucchini is to grill and blitz it into a smoky, rich dip called mutabbal kousa, or what I affectionately call Mama Ghanouj after seeing it dubbed that on a blog. It’s the same concept as baba ghanouj, but with zucchini instead of eggplant. The dip comes together quickly with a food processor, and you can add whatever flavors come to mind, be they from the garden or fridge. I often grill hot peppers along with the zucchini and throw those into the dip, or add fresh herbs like torn basil or mint or oregano, or chili crisp or oil.Here’s how to do it: Start with 3 medium to large zucchini or summer squash of any mix and variety. Heat the grill on medium-low. Slice the zucchini lengthwise into about ½-inch strips and coat lightly with neutral oil. Place the strips on the grill for 5–7 minutes, until they have some nice grill marks but aren’t starting to char completely. Repeat on the second side. After 10–12 minutes on the grill, use tongs to squeeze the zucchini—they should be letting out juice and feel a little soft between the tongs. If they’re still firm and not releasing juice, leave them on a few minutes longer, and adjust the grill temperature to ensure they don’t char too much. Remove the zucchini and let them cool for about 10 minutes, until they’re no longer piping hot. You should have about 3 cups of grilled zucchini.Meanwhile, squeeze 1 lemon and crush 3 garlic cloves. Once the zucchini has cooled off a bit from the grill, put it in the food processor along with the lemon, garlic, 3 Tbsp. tahini, ½ tsp. salt, a couple grinds of black pepper, and whatever other additions you’d like. Pulse this 10 times in the food processor, scrape with a spatula, and pulse twice more. The texture should be creamy–chunky when it’s done— it’s okay if there are still bits of zucchini visible. If you don’t have a food processor (or don’t want to drag it out), you could use a mortar and pestle, a rough chop and the back of a fork, or even a potato masher.Once the dip has reached the right texture, put it into a mixing bowl, and fold in 2 Tbsp. plain yogurt. Use this opportunity to taste it, adjusting salt, and if you want it looser or creamier, adding a little more yogurt. If you want a vegan version, use vegan yogurt or an additional tablespoon of tahini loosened with a tablespoon of water.Spread it into a shallow bowl and make some swoops with the back of a spoon, then finish with a few glugs of good-quality olive oil. Serve with warm pita bread, vegetables, or crackers. It’s also great as a sandwich spread.By the time you finish this batch, your zucchini plants will be ready for the next round. And you’ll be ready with Mama Ghanouj.Didi Kader lives in the Pacific Northwest and writes about food, culture, environment, and the outdoors.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-31", "author": ["Condé Nast", "Didi Kader"]}