{"id": "bff33473489384af87799746049552b1", "url": "https://www.bonappetit.com/story/woon-kitchen-activism", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Woon's Mother-Son Team on Facing Cancer, COVID-19, and Asian Hate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWoon’s Mother-Son Team on Facing Cancer, COVID-19, and Asian HateIn the two short years since it opened, Woon Kitchen has evolved into a beloved neighborhood restaurant and a vibrant activist hub.By Keegan Fong and Julie Chen Fong, as told to Mariella RudiMay 14, 2021FacebookTwitterEmailPhoto by Jacob CummingsFacebookTwitterEmailJulie Chen Fong and Keegan Fong are the restaurateurs behind Woon in Los Angeles. Initially it started out as a family-oriented restaurant, an outlet for Chen Fong’s culinary dream. But now with the rise in anti-Asian hate and violence, Woon has grown to become a more community-focused restaurant, raising funds for AAPI-focused organizations and inviting others in through their favorite Chinese dishes. Here the two look back on the challenges and joys of the last two years and how Woon has adapted along the way.Keegan: Woon is a reflection of my life, but mostly it’s a reflection of my mom. Mama Fong, as everyone calls her, is the heart of the operation and our inspiration. When I was growing up in San Marino [in California], our house was always the place where you could get a hot meal and try new foods. As teenagers, my friends and I would stumble in the house, drunk or high, and she would cook us full-on meals. I feel so grateful for all those nights she fed us. Her steak was a fan favorite. Every memory reinforced what I always knew, which was that my mom was the best cook. Today, Woon’s menu embraces our household’s favorite Mama Fong recipes: Chinese comfort food like her special-occasions-only stir-fried beef noodles and the fried tofu fish cakes she made after school.Mama Fong: These were all the foods that I experimented with at home when I wasn’t working. I was a single mom with a son and daughter, so I had to do something. If I wasn’t at work, I was in the kitchen, trying out new flavors and cuisines like a mad scientist. As a kid, I loved food and I loved cooking. I was born in Shanghai, and Shanghainese food is mainly flavored with soy sauce and sugar. Then we moved to Hong Kong, which is more Cantonese-style with steamed fish and vegetables, a lot of stir-fry, very simple. When we moved to California in my teens, my mother discovered Marie Callender’s Frozen Chicken Pot Pie, and that’s all we ate. I became so sick of it that I started flipping through a cookbook by my father’s brother’s wife, the famed Joyce Chen. They had moved to Cambridge [in Massachusetts] in 1949 and opened a well-known Chinese restaurant at the time. Her recipes were so simple, and eventually I moved on to harder projects, like five-spice duck. My mother’s friends would come over to our house for mah-jongg but mainly just to eat my food.When it was time for me to go to college, I told my mom I wanted to go to culinary school. But to my parents, coming from Asia, “chef” didn’t exist—it was “cook” and considered lower class. “Why do you want to be a cook?” they asked. I said “No, a chef and a cook, there’s a difference. I want to learn the basic mechanics and knife skills.” No, no way. After I graduated, I got a job doing administrative work at the culinary school, Le Cordon Bleu. There, I was able to take free cooking classes.The beef noodles, five-spice chicken wings, and peanuts-and-sea-moss drinking snack at Woon\nPhoto by Jacob CummingsKeegan: When I was a kid, my mom would always tell me that her dream would be to have this little kitchen where she could cook and host people. Then one day I was like, This is it. I’m making it happen. Do you want in? She saw that it was a huge risk for me leaving my job and investing all my time and resources into Woon. She was very apprehensive at first, saying “maybe you shouldn't do this, maybe it’s too soon.” She eventually came around—we knew we had to at least try.About a week after I signed the lease for Woon, my mom was diagnosed with breast cancer. At the same time, I was fundraising, trying to find money to make this thing that I didn’t know how to make. I was building a restaurant just to get it to a point where it looked presentable, meanwhile ignoring the fact that we might have to train the kitchen staff using her recipes without her while she recovered.Mama Fong: I was lucky that I didn’t need chemotherapy. It was hormone-related and didn’t spread, but every day I would go to radiation at 8 a.m., then straight to Woon to do quality control and work on the recipes. Every single day for 26 days. In a way, the restaurant probably took my mind off of the cancer.It wasn’t easy at first, stepping into this chef role. Professional cooking is so different from home cooking. Everything is on a larger scale. It requires more precision, measuring rather than going by smell or taste. But seeing others eat my food is a huge joy and very surreal and not what I had ever expected. I was skeptical at first, wondering, What if they don’t like my food? Now I’m more confident.Sometimes I have to remind myself that Keegan will learn on his own, just like when he was little.Keegan: Then COVID hit. My mom’s last day in the kitchen was March 13, 2020, and three days later we canceled our one-year anniversary party. We closed the dining room for takeout only, and we cut hours by 60 percent—which we’re still operating at. We had an outpouring of community support and a PPP loan to thank for keeping us afloat in those early days of lockdown.Mama Fong: In quarantine, I would check on the food from my phone or have it delivered so I could taste test—that’s my territory. If there is ever anything off with the food, I have to say something. “The pork belly looks a bit brown” or “This taste’s wrong, something’s missing.” I have to straighten it out. But I’m also training myself on what not to say. Sometimes I have to remind myself that Keegan will learn on his own, just like when he was little.My parents grew up in China, so my upbringing was different. I never got hugs. My mom would nitpick everything about me, from my hair to my etiquette. So many rules and regulations, like never pick up your chopsticks before your guests eat, things like that. When it came time to raise my own kids, I didn’t want to do what my parents did. I said to myself, I will let them grow up as they are, but I will guide them along the way. They had more freedom than I had.Mama Fong’s fried rice\nKeegan: Two weeks after my mom got her second vaccine in March, she returned to the kitchen, and I knew Woon was coming back to life. It’s a good kind of busy. I think it’s a combination of everyone feeling more comfortable but also wanting to support what’s going on in the Asian community and the fact that, May is Asian American and Pacific Islander Heritage Month.In March, my wine buyer, Emily Koh, had this idea to host a Bake Sale Against Anti-Asian Violence at Woon. We had a line three blocks long and raised more than $8,000. We’ve gone on to host two more pop-up events with other local restaurants and bakers to benefit places that support Asians and fight against anti-Asian violence, with more than $15,000 going to national and local organizations, like Advancing Justice L.A. and Stop AAPI Hate.Moving forward, there’s always going to be a charitable component to our events, to give back where we can. As small business owners, we connect with people every day, and we have influence, especially with food. In a sense, we bear that responsibility, so that they don’t see our culture as something completely foreign or “other.”Mama Fong: Truthfully, I dealt with a lot of verbal abuse as an immigrant already, so it did not phase me very much throughout the years dealing with Asian hate. But now the hate has escalated to be physical. This is when it gets scary, and I am proud that Woon has taken action against it. Traditionally, Asians are told to keep to ourselves and just mind our own business. That’s what the Chinese model is: Don’t rock the boat. But it’s nice to see now that we are able to speak up and do something about it. And we can tell our side of the story.Explore Bon AppétitRestaurantsLos AngelesCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-14", "author": ["Condé Nast", "Keegan Fong", "Julie Chen Fong", "As Told To Mariella Rudi"]}