{"id": "bfff926f40ab3162832a2346e176a6a1", "url": "https://www.bonappetit.com/story/eat-turkey-thanks-me-later", "year": 2020.0, "month": 4.0, "day": 4.0, "content": "Make This Turkey Breast Recipe. “Thanks” Me Later | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEat More Turkey. “Thanks” Me LaterIt’s the poultry-perfect gift that keeps on giving.By Carla Lalli MusicApril 23, 2020FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailEvery Wednesday, Bon Appétit food editor at large Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault, a cooking technique she’s really into, or an ingredient she can’t stop thinking about. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Americans have a complicated relationship with turkey. We love to bash it on Thanksgiving—too dry, so flavorless, totally boring!—and yet we couldn’t love it more when it comes to sandwiches. The most notable example is the mighty classic, the Turkey Club—basically, a BLT with turkey in the mix, along with an extra (and unnecessary, if you ask me), layer of bread in the middle.Our own editor-in-chief, Adam Rapoport, is passionate about Turkey Clubs, and indeed, makes a habit of ordering them from room service whenever he’s on the road. But, despite his love for the Club, when it came to developing Bon Appétit’s from-scratch version, he balked at the idea that a person should roast their own turkey “just to make a sandwich.” I get the reasoning. I mean, when you want a sandwich, you want it, like, right now—for lunch. You get the bread, you shmear the mayo, you cook some bacon, you slap on the turkey, and badda bing badda boom, you’re eating a turkey sandwich. Better yet, you drop into your favorite deli and they’ll do all that for you. Oh, those were the days! Adam’s point (when he hollered at me and Chris Morocco about this in 2016) was that you don’t get a craving for a sandwich and then blithely accept the fact that the first step will be dry-brining an entire boneless turkey breast for a day, or that you’d then be instructed to slow-roast it to juicy perfection for an hour and a half. And that’s exactly why our recipe gives you the option to use store-bought turkey if you don’t want to make your own.Want this letter before it hits the website? Sign up for our newsletter!Epic lunchtime sando bar!\nPhoto by Carla Lalli MusicBut you know what, people? It’s time to go the extra mile, because the ultimate turkey sandwich is worth the ride. First of all, we’re making fewer trips to the outside, which means fewer deli cravings can be immediately indulged. Depending on where you are, it might be easier to get turkey than it is chicken (you could also mail-order from a source such as D’Artagnan). Second of all, and more importantly, frankly—these are tough times, and it’s on us to manufacture as many bright spots as possible. I don’t have that much to look forward to aside from my 5 p.m. cocktail, which I only allow myself on the “weekends” (of course, the weekend starts on Thursday and usually includes Mondays).If all these crazy people (self included) are out there spending two or three weeks growing sourdough starters for a single loaf of mediocre bread at some future date, why shouldn’t we be planning ahead for epic sandwich consumption? I made my first sourdough loaf and it was fine. I brined a whole turkey for 72 hours last week, and then I spent 2 hours grilling it, and it was absolutely freaking delicious and I felt like a genius for doing it. First I set up a legendary sandwich bar for my family, with all kinds of toppings to choose from, including kimchi, cheddar cheese, avocado, shredded cabbage (I’m out of lettuce), hot sauce, and Dijon mustard. I used leftover turkey to make chilaquiles, and there’s turkey and hominy soup in my future. It’s the poultry-perfect gift that keeps on giving.I’m all about cooking being straightforward and accessible, but there are times when doing things the long way is also the best way. There are lots of cooking projects you could choose to undertake in your kitchen if you’re staying home, and my vote is for turkey. I hope you’ll join the club. The Turkey Club, that is.Get the recipe:Turkey Club with Herb MayoThis recipe takes only about 15 minutes of active time (or less, if your bird is already cooked) and will change the way you think about turkey. Then again, we might be biased.View RecipeExplore Bon AppétitCarla NewsletterTurkeyRead MorecookingThis Herb-Adorned Toast is More Dressed Up Than I've Been in WeeksBy Jerrelle GuycookingHere’s Why Butter Belongs on Every SandwichBy Carla Lalli Musiccooking6 Rules for a Perfect Grilled Cheese, Every TimeBy Emma WartzmancookingExpand Your Egg Sandwich Horizons with Ricotta and FocacciaBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-23", "author": ["Condé Nast", "Carla Lalli Music"]}