{"id": "c00fd4ad0e22734ad417d8c47e1654cf", "url": "https://www.bonappetit.com/story/anna-konkle", "year": 2019.0, "month": 3.0, "day": 3.0, "content": "How PEN15’s Anna Konkle Went from Waiting Tables at Prune to Wearing Fake Leg Hair | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow Pen15’s Anna Konkle Went from Waiting Tables at Prune to Wearing Fake Leg HairThe star and co-creator of Pen15 learned her on-set leadership from chef Gabrielle Hamilton.By Alex BeggsMarch 19, 2019FacebookTwitterEmailPhoto by Emma Fishman, Makeup by Matin using Chapstick / TraceyMattingly.comFacebookTwitterEmailOn one side of her twin bed, seventh-grader Anna Kone is making out with her bedpost lustfully, cradling its bald head in her palm. On the other side, her best friend Maya Ishii-Peters is rubbing the bedpost between her breasts—when Anna’s dad walks in the bedroom.\"DADDDDDDDDDD! GET OUTTTTT!\"Maya falls off the bed, Anna’s shrieking, and I’m crying laughing on my couch at home.PEN15 is really, really funny.(Watch that clip here.) The Hulu comedy is about two best friends, played by Anna Konkle and Maya Erskine, during their first year of middle school in the year 2000. The music is awesome. The costumes are Delia*s-catalogue perfect. The setup—Konkle and Erskine play 13 year olds with a cast of actual teenagers—makes the physical humor even funnier. They let their eyebrows grow in haywire, banded their breasts, and squeezed into super-low rise jeans. Those are three things I would not do for art.What I would do though, for art or journalism or whatever we do on the Internet now, is meet Konkle at Prune in New York, where she used to be a server. Instead of the low-riders, Konkle was wearing a flowy floral dress and her makeup was expertly glowy. Everyone at the cubby-sized restaurant in the East Village was hugging her and congratulating her on the show’s success; it felt like a happy nearly-10 year reunion, which is about how long it’s been since she worked there. Owner Gabrielle Hamilton walked into the dining room, clapped her hands, and proudly announced, “Anna Konkle, ladies and gentlemen!”Konkle came to New York from Massachusetts to study experimental theater at NYU, which meant she’d land such roles as: a piece of architecture “that had feelings” in a production mounted in an unheated Brooklyn warehouse in January. I believe they call this: Living the dream.But first, rent. It needs to be paid. She’d worked in restaurants since she was 15, including a summer gig at a country club where she learned the art of balancing. “I remember it was one of those big trays that you pick up like this,” she told me, holding an invisible tray above her right shoulder. “I picked it up and one glass starts to wobble. Another starts to wobble.” Crash, bang. The president of the club began clapping sarcastically, and the entire room full of men joined in. Mortified, she ran to the bathroom and cried. New York restaurants, it turns out, aren’t that much different. She navigated the regimented fine-dining world before landing at Prune, which functions like its own island.“Prune was a revelation because it was the first time I wasn't hearing men screaming in the kitchen,” she said. Hamilton had set in place a system where work was shared between front and back of house, so that the chefs weren’t cleaning and prepping until 2 a.m. while the waitstaff got to go home.“It was my first time seeing a chef as an artist close up,” she said, and not just a chef plating beautiful bacon marmalade toast, but a chef running a business. “It was what I wanted to do in some capacity, with writing and acting and my art. I want this to be a business, too.” No one talks about that fact that theater, playwriting, and acting can be, and need to be, a profitable business if you’re trying to make a living out of it—we prefer to pretend it’s all a passion project funded by the human heart. But after only so many gigs playing inanimate objects, Konkle was ready to get the hell out of New York.She traveled and worked on her writing, and reconnected with her best friend, Erskine, in L.A. The two met when they were both freaking out in the bathroom before a performance while studying abroad. That freaking-out-in-the-bathroom kind of friendship is rare—middle school magic, really. In PEN15, the two dorky friends are hiding in a stall when a cigarette from the cool girls rolls their way like a premonition. You might be freaking out now, but you’ll be cool too, eventually. Ya gotta wait it out.And Konkle and Erskine did. They worked on that show for years, shopping it around to TV producers who were not unlike those clapping country-club dads, horrified at the idea of a show where a supposed 13 year old gets fingered. (That scene didn’t even make it into the show, but as we know in real life, it happens.) Meanwhile, the two friends had a web show, and Konkle worked at Nancy Silverton’s Chi Spacca, a whole-animal butchery spot partly owned at the time by Mario Batali (regarding the recent sexual harassment claims that brought down the famous chef: “I had waited on him before, and I wasn't surprised by the allegations. I think anybody who waited on him could say the same thing.”) Andy Samberg’s Lonely Island production company, which had funding to invest in projects that would otherwise have been overlooked, picked up PEN15 and made it happen with Hulu.“I became very passionate about the food industry when I was here,” Konkle said about Prune. “It's an act of caretaking, waiting on people. I had a true passion for what I was doing.” What she learned about leadership from Gabrielle Hamilton carried over to the set of Pen15. There were good snacks for the team, yeah, but everyone was treated with respect. Hamilton had a way of getting the best out of her staff, said Konkle, “managing in a way that people feel more enabled to do a good job.”According to me, they did a good job on PEN15 too. Especially the props people who applied the actors’ fake leg hairs for a scene where the girls shave their legs for the first time. (“It took an hour and a half. We wanted it really long and flowy. My leg hair in that scene looks just like my dad’s,” said Konkle.)There’s this cliché that every server in New York is a struggling actor, waiting for their moment to make it. But we all know how statistics work, how life works. In the restaurant that afternoon, it felt like there was contagious magic on Konkle, that if she sneezed on me, maybe I too, could grab the elusive it. Hamilton told me her staff isn’t comprised of a ton of actors, but everyone has a side passion, and many of the servers Konkle worked with went on to open cool restaurants and shops. That’s something Konkle was considering, too, she told me, and maybe she still will one day. But for now, she’s making out with bedposts and wearing fake braces—and that’s what I call art.Explore Bon AppétitHealthyishCelebritiesInterviewsRead MoreLifestyleIt's Friday Night and Lana Condor Is Probably Home With a Bowl of NoodlesBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-19", "author": ["Condé Nast", "Alex Beggs"]}