{"id": "c0123bce0bce3f098ec51a3a67393543", "url": "https://www.bonappetit.com/recipe/sweet-auburn-barbeque-pimento-cheese-wontons-with-tillamook", "year": 2019.0, "month": 9.0, "day": 2.0, "content": "Sweet Auburn Barbeque Pimento Cheese Wontons with Tillamook Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginSPONSOREDSweet Auburn Barbeque Pimento Cheese Wontons with TillamookSponsored by TillamookFacebookPinterestTwitterEmailMakes 15 wontonsThe secret to the pimento cheese wontons at Howard and Anita Hsu’s Sweet Auburn Barbecue? Tillamook Sharp Cheddar.PrintIngredientsPimento Cheese12 oz. Tillamook Sharp Cheddar, grated4 oz. cream cheese, softened¼ cup mayonnaise3 Tbsp. finely diced roasted red bell peppers2 Tbsp. well-shaken buttermilk1 ½ Tbsp. finely chopped parsley2 tsp. black pepper2 tsp. Worcestershire2 tsp. apple cider vinegar½ tsp. dijon mustard¼ tsp. SrirachaWontonsAbout ½ cup Pimento Cheese15 wonton wrappers1 egg yolk1 tsp. waterA little flour for dustingVegetable oil for fryingSweet chili sauce and sliced green onions for servingRecipe PreparationMix all the pimento cheese ingredients except Tillamook Sharp Cheddar until smooth, then stir in cheddar until well combined. Chill at least 1 hour.Whisk together yolks and water.Lay 5 wrappers on a work surface leaving a little space between each. Brush along all the edges with the egg wash. Place a rounded teaspoon of pimento cheese in the center of each.Dip your fingertips in flour and fold wontons by bringing all 4 points up to center above the cheese trying not to trap air inside, pinch down each spine to form pyramid-shaped wontons. Repeat in batches until all the wontons are formed. Chill while oil heats.Heat 1 ½ inches of oil in a cast iron skillet or wok to 350°F. Fry wontons, in batches until golden brown, about 2 to 3 minutes. Drain and serve with sweet chili sauce and scallions.Optional: keep remaining cheese in the fridge to create additional wontons or re-purpose for a melty grilled cheese.Tillamook is a farmer-owned cooperative based in Oregon that connects farmers and food lovers through better-made dairy products. You can purchase Tillamook at a retailer near you, or find their cheese nationally at Target. Explore here to find a store near you, or learn more on Twitter, Facebook or Instagram.Sponsored by TillamookGET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": []}