{"id": "c01c5a8084ecad598a33d5dcb25f9da5", "url": "https://www.bonappetit.com/recipe/turkey-pozole-verde", "year": 2020.0, "month": 11.0, "day": 4.0, "content": "Turkey Pozole Verde Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesTurkey Pozole VerdeBy Danny MenaNovember 24, 20204.5(19)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by D'mytrek BrownEmailPinterestPrintEmailPinterestPrint“There are a lot of American expats celebrating Thanksgiving in Mexico, where I grew up,” says chef Danny Mena, author of Made in Mexico. “One year, a good friend invited me over for their big family celebration. They had made half a turkey the traditional roasted method, and the other half they made into a pozole, and the pozole was a clear winner. So every so often, I’ll make turkey pozole with Thanksgiving leftovers. Pozole is basically a pork and hominy broth that can be clear (nothing much else added), red (dried chiles), or green (fresh chiles and may have tomatillos and pumpkin seeds). Turkey broth can be a bit intense, so I like green pozole with fresh chiles, which balances it out very nicely.”Ingredients8 - 10 ServingsStock1turkey carcass2white onions, unpeeled, quartered8garlic cloves4celery stalks, chopped2large carrots, scrubbed, chopped1large bunch mixed hardy herbs (such as marjoram, oregano, and/or thyme)4bay leavesKosher saltHominy and assembly2cups dried white or golden hominy, soaked overnight in fridge2Tbsp. dried oregano, plus more for serving2Tbsp. vegetable oil½white onion, coarsely chopped4garlic cloves, smashed1cup raw pumpkin seeds (pepitas)4whole allspice2whole cloves½tsp. cumin seeds1lb. tomatillos, husks removed, rinsed, coarsely chopped3–5serrano chiles, seeds removed if desired1cup radish leaves, arugula, spinach, or other greensKosher salt8radishes, thinly sliced2cups shredded iceberg lettuce or green cabbage (optional)1cup crushed chicharrones (optional)¼cup crushed pequin chiles or crushed red pepper flakesLime wedges (for serving)PreparationStockStep 1Combine turkey, onions, garlic, celery, carrots, herbs, and bay leaves in a large pot and pour in 4 quarts water (turkey should be completely covered; add more water if needed). Bring to a boil, skimming any foam from surface; reduce heat and simmer 3 hours.Step 2Remove turkey carcass from pot and place in a large bowl. Strain stock through a fine-mesh sieve into another large bowl; discard solids. Return stock to pot and set over low heat. Taste and season with salt (it will likely take 3 Tbsp. or more Diamond Crystal or about 5¼ tsp. Morton kosher salt). Measure out 2 cups stock in a heatproof measuring glass and set aside.Hominy and AssemblyStep 3Drain hominy and cut off tips (this will help the hominy absorb the cooking liquid so it gets plump and soft without a hard chalky core). Add hominy and 4 cups water to stock remaining in pot. Increase heat and bring to a simmer. Cover and cook, adjusting heat as needed to maintain a simmer, until hominy is tender (some kernels should have burst from their skins), 2–3 hours. Remove from heat and add 2 Tbsp. dried oregano.Step 4While hominy is cooking, remove turkey meat from carcass and shred; discard bones.Step 5Heat oil in a medium pot over medium and cook onion and garlic, stirring often, just until onion is softened, about 2 minutes. Add pumpkin seeds and cook, stirring often, until lightly golden, about 4 more minutes. Add allspice, cloves, and cumin seeds and stir until fragrant, about 2 minutes. Transfer to a blender and add tomatillos, 3–5 serrano chiles, depending on how spicy your chiles are and how much heat you prefer, and reserved 2 cups stock; purée until smooth. Wipe out pot.Step 6Pour purée into pot and cook over medium-high heat until thickened slightly, about 10 minutes. Transfer 1 cup sauce back to blender and add radish leaves; purée until bright green and smooth. Stir radish purée and remaining sauce in pot into hominy. Taste and season with salt if needed. Stir in turkey meat and divide pozole among bowls. Serve radishes, lettuce (if using), chicharrones (if using), crushed dried chiles, lime wedges, and more oregano in bowls alongside for topping as desired.How would you rate Turkey Pozole Verde?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleThis recipe is amazing! Definitely try it. I look forward to making this every year. I thought I would finally leave a review since I've made this a couple times now. The first time I made this (2019) it was a bit watery, but I think this is due to differences in the size of everyone's turkeys and volume of stock you end up with. This year, I blanched the turkey carcass (20 lb turkey this year), rinsed, roasted with the onions, carrots, garlic. I combined everything in the recipe to make the stock and let it simmer for 6 hours. I strained and reduced it by 20% the next day (to try and concentrate the flavor and also didn't want 8L of stock).\nI followed the rest of the recipe to a T.  I used roasted pepitas and spinach. The base of the soup tastes amazing! Other soup recipes use anywhere from 8-12 cups of stock total  so I tried 10 cups this year (including the 2 cups in the base). Loved it, highly recommend.  Katie12/7/2021Hmmm - I had such high hopes but this is just a watery mess. Maybe with like 1/2 of the stock it would look half as good as the picture but I have basically a ton of green broth. Maybe I'll make rice out of it!DamonPark City, UT11/28/2021The instructions don’t mention what to do with the remaining stock. Presumably you combine the purée and stock together in step 6? Jared11/29/2020This was an outstanding recipe.  To add depth to the spices and tomatillos, I charred them on a comal!  Wow!  Heaven! DavidFrisco, Tx11/28/2020Canned posole saves time and effort and works well.  Also, sub roasted green Hatch (New Mexican) chilies for the serranos - the roasted chiles add depth and smokiness. A cup of  shredded and toasted corn tortillas helps thicken the stock - again, the toasting of the corn tortillas adds a bit of sweetness.  DavidBoise11/27/2020Explore Bon AppétitStewSoups and StewsPosoleSoupMexicanLatin AmericanTurkeyPoultryFallMainDairy-FreeGluten-FreeSimmerThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-24", "author": ["Condé Nast", "Danny Mena"]}