{"id": "c01d4acf382e09357ff5163f543906ef", "url": "https://www.bonappetit.com/story/wine-resolutions-for-2019", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "7 Wine Resolutions for a Better 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture7 Wine Resolutions for a Better 2019Stop it with “funky,” buy one glass (but keep the stem), and more goals you can actually keep in the new year.By Marissa A. RossDecember 21, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmail2018... Yep. That was a year. Moving on! 2019! A new year! A new you! Kind of. Because let’s be real, you’re never going to keep your closet clean and I’m never turning in my invoices on time, so let’s focus on low-impact goals that don’t require another unused Pilates package. Here are six tips that will help you drink better in 2019 and in all the many joyous, non-hellish years I am praying for ahead.Get Universal GlasswareI’ve never been a fan of using different glasses for different wines. You may start with a full set of each, but we both know damn well you end up with two mismatching white wine glasses, four big-ass-bowled red wine glasses, and Champagne flute. (On that note, get over flutes! You don’t need them! Their narrow shape is created to enhance bubbles, but they mostly flatten a wine’s aromas.) Instead, why don’t you just get yourself a set of easily replaceable universal glasses? For years my pick has been Crate & Barrel’s Nattie Red Wine Glass. A set costs you $28 and singles are $4, so you’re not breaking the bank every time your friend’s girlfriend gets drunk and somehow destroys three of them. If you want to go a little fancier, go for the universal Zalto. But they’re $60 a pop so perhaps consult this chart before making any impulse buys. Either way, I like my glassware with stems. Otherwise, you’re just warming your wine with your hands.Order More Bottles, Fewer GlassesNatural wine is becoming a staple on many restaurant and bar lists—and I couldn’t be happier!—but many of them are not meant to be poured by the glass. Without preservatives, these wines begin to change as soon as they are introduced to oxygen. Ensure that the wine you’re ordering is at its freshest and most delicious by opting to for the bottle, instead of individual glasses. Remember a bottle has about four glasses (and some change) in it, so if there are two of you it’s already worth it. Don’t finish it? You can always cork it and take it with you. Now that’s my kind of leftovers.Retire “Funky” as a DescriptorAs the new catch-all descriptor for natural wine, “funky” has been rendered totally meaningless. Some people use it to find bottles with well-balanced volatile acidity; others are picking up on the faulted stuff, riddled with overpowering Brettanomyces. Next time you have a “funky” wine you do or don’t like, take some time to think about more specific ways to describe it. Take note of things like region, varieties, and even winemaker. And remember: Don’t be afraid to just say it like you taste it. The more specific you can be, the more enjoyable your wine purchases will become.We Still Need to Drink More WaterI gave us this awesome tip last year and you know what, I know we still did not drink enough water in 2018! Drinking water is the second most important part of drinking wine. (Drinking wine is the first, obviously.)Quit It With The Whole “You Don’t Get Hangovers from Natural Wine” BSBruh. That is a myth. While many people do experience fewer effects of hangovers from natural wine because it has less additives and often lower alcohol by volume (ABV), that doesn’t mean it doesn’t happen. TRUST ME, IT DOES. It’s simple maths: If you’re downing a bunch of bottles in a two-hour time span at the bar, yeah, you’re probably going to be hungover—especially because we already discussed you’re not drinking enough water. But if you have multiple bottles spanned out over many hours with friends, food, and again, water, you’ll be right as rain the next day. Don’t think you’re invincible. I do this shit for a living and get a nice quarterly reminder migraine that drinking is still drinking, and you have to take care of yourself.Buy Quality Over QuantityA phrase that can be applied to literally anything, but make sure to apply it to your wine purchases in 2019 and beyond. Climate change is coming down hard on wine producers with grapes being destroyed by relentless heat, devastating frosts, and other unseasonal and unpredictable weather patterns. Without grapes, there is no wine. A wine you loved one year for $20 might be $30 the next, and while of course there are jerks who are trying to capitalize on the growing market, many times price hikes are because these are farmers with families and responsibilities just like us. Remember your dollars do count, and if you love a wine, use those dollars to support it. You may not be able to buy as many bottles as you did before, but you’ll be investing in that producer’s future and in more wines you love.And as always, enjoy it.Don’t overthink it. There’s enough in the world to worry about, don’t make wine be one of them.Want even more goals? Check out our past resolutions for 2018 and 2017.Explore Bon Appétitholiday2018natural wineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Marissa A. Ross"]}