{"id": "c033465e500f65e9ccfc8c054a308252", "url": "https://www.bonappetit.com/story/combating-asian-american-hate", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Against the Wave of Anti-Asian Violence and Hate | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAgainst the Wave of Anti-Asian Violence and HateThis is bigger than food.By Sonia ChopraMarch 4, 2021FacebookTwitterEmailPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.Hi everyone,Like many of you, I’m horrified by the rising and persistent attacks on Asians and Asian Americans in this country. It’s haunting to hear about this happening across the U.S., and I’ve been reading most everything I can get my hands on, trying to figure out what I can do.It’s easy—and not wrong—to say that familiarizing ourselves with the wide diversity of “Asian foods” is helpful, that education can go a long way toward broadening our collective understanding of the different communities and cultures that make up America, and that food is a good entry point into that. In the grid below I’m highlighting some recipes and essays that showcase the vast range of ingredients, techniques, and traditions associated with Lunar New Year, which this year was fraught with fear and anxiety as it lined up with the increased number of attacks on Asian Americans. While the holiday has passed, the stories and recipes are evergreen.But as we all know, using food as a way to talk about what’s going on in the world around us isn’t enough. What’s happening in Chinatowns and elsewhere across the U.S. and in Chinese, East, and Southeast Asian restaurants is about much more than what we choose to eat. “Americans may love Chinese food,” Jenny Zhang writes on Eater, “but they don’t love the people who make it.” She goes on: “They treat Chinatowns like their playgrounds, their residents like backdrops for photos. They reach for the products of Chinese labor and with the same hands knock them down on the street.”I’ve asked so many people what they are doing to help, and the answer I’ve heard the most is to put money into and empower community organizations. Restaurateur Eric Sze, part of the newly formed #EnoughIsEnough initiative in New York City, tells Vice that the group formed because they’re “trying to focus on empowering people and showing people that the small guy counts too.” Today I’m donating to the new AAPI Community Fund, in partnership with Go Fund Me, which my colleague and Allure editor in chief Michelle Lee tells me will donate funds to “a group of fully vetted community organizations working to #StopAsianHate.” And Joey Hernandez, BA’s research director, shared four additional resources below, with some vetting by the Asian American Journalists Association.Stand Against Hatred, an incident reporting center created by Asian Americans Advancing Justice, a national affiliation advocating for the civil and human rights of Asian Americans and other underserved communitiesStop AAPI Hate, an incident reporting center managed by the Asian Pacific Planning and Policy Council, Chinese for Affirmative Action, and the Asian American Studies Department of San Francisco State UniversityThe Asian and Pacific Islander American Health Forum’s Community Care Package, a weekly newsletter with mental health and counseling resources, Covid-19 updates in a number of languages, and stories from various communities meant to inspireNational Asian American Pacific Islander Mental Health Association’s directory of mental health service providers for Asian Americans, Native Hawaiians, and Pacific Islanders organized by stateA few additional links:Resources to support Asian Americans in NYCAAPI Anti-Hate Community Resources50 ways to donate in support of Asian communitiesAsian Americans Advancing JusticeI’d love to learn from you, especially if you’re doing something to #StopAsianHate in your community. I’m sonia@bonappetit.com.Explore Bon AppétitLetter From The EditorRead MorerestaurantsOur Restaurant’s Name Means ‘New Beginnings.’ That’s Never Felt More True.By Lisa Tran, as told to Elyse InamineLifestyleCelebrating Lunar New Year in Isolation Is a Reminder of My Family’s ResilienceBy Caitlin PhanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-04", "author": ["Condé Nast", "Sonia Chopra"]}