{"id": "c03d03f9d908724f1ad5a4acdba920ff", "url": "https://www.bonappetit.com/story/what-i-wish-i-did", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "What I Wish I Did: A Guide to Getting Through Covid-19 Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureWhat I Wish I Did: A Guide to Getting Through Covid-19 AloneThere’s a lot out there about how to avoid getting infected, but no one told me what to do once it happened. By Amanda ShapiroApril 9, 2020FacebookTwitterEmailFacebookTwitterEmailThis story is part of the Healthyish Guide to Being Alone, a series of tips, recipes, and stories about how to be alone when we’re together and together when we’re alone.Last month, I had what I’m fairly sure was a mild case of Covid-19. Over the course of two and a half weeks, I had digestive distress, a sore throat, one feverish night, chest pain, and shortness of breath that, at its worst, made it difficult to walk around my apartment without feeling winded.All told, my physical symptoms were, as the virtual urgent-care doctor assured me, very manageable at home. But the experience was still pretty terrifying because I felt very much alone. I was alone! All I wanted during those weeks was for someone to tell me how to get better. I wanted knowledge and clarity at a time when nothing was known or clear.There’s an overwhelming amount of information from the WHO and CDC about how to prevent transmission of Covid-19, but there’s very little about how to treat it at home, especially if you’re dealing with it on your own. The internet was not my friend when I was sick; it was a hysterical person making me panic multiple times a day. Luckily I had real friends, and I believe that the wisdom and resources they shared made all the difference for both my physical and mental recovery.At their advice, I leaned hard into food, herbs, and other home remedies because, well, I couldn’t leave my home. I discovered and rediscovered the amazing power of my pantry to soothe and heal. (I also took a low dose of Tylenol when I had a fever, and again when I was experiencing chest pain.) Many of the ingredients I talk about in this post can be found at your grocery store, but I’ve had luck with Anima Mundi, Mountain Rose Herbs, Starwest Botanicals, Frontier Co-op, Herb Pharm, Furnace Creek Farm. And here's an amazing list of growers and suppliers by region.I want to share the advice that I found most helpful, but I have a whole bunch of caveats: I never got tested for Covid-19. I’m not a doctor, nor are any of the people whose guidance helped shape this post. Nothing in here is meant to replace medical advice. I’m an otherwise healthy person in her early thirties who is not immunocompromised. Your symptoms and medical needs may be completely different from mine. Follow the CDC’s guidance on when to seek medical attention or call 911. Lastly, there’s so much more out there, and many people who know far more about herbal medicine than I do. Check out this list of clinical herbalists around the country if you want to dive deeper.Photo by Alex Lau, Food Styling by Kat Boytsova, Prop Styling by Emily Eisen1. I would change my diet...just a littleMy normal diet is low in added sugar (especially without the Test Kitchen at my disposal), and I happened to be taking the month off from drinking. But I broke down and had a desperation-glass of whiskey on a Friday night and, just like that, I woke up the next day with a sore throat. I’m not saying the booze caused me to get sick—I was already feeling symptoms—but I do know that regular overconsumption of alcohol and added sugars can lead to chronic inflammation, which makes my body more vulnerable to disease..I also would’ve ramped up on a few key immune-supporting foods. Ginger, garlic, and citrus are three I’d target because they’re easy to find, cheap, and have well-documented health benefits. I started incorporating these ingredients as soon as I was sick, but, if I could do it over again, I’d start a lot sooner.Ginger: Following my friend Rachelle’s advice, I’ve been throwing a palm-sized amount in a blender with a cup or two of water, blending, and straining out the solids. I’ll take a shot a couple times a day or stir it into seltzer. Or I’ll slice a palm-sized amount (no need to peel) and steep it in boiing water for tea.Garlic: In the mornings, I’ve been thinly slicing a clove of raw garlic and stirring it into a spoonful of raw honey, peanut butter, or both. It is intense, but I’m kind of into the taste now, and no one’s around to complain about my breath.Citrus: In addition to simply eating more citrus like oranges and grapefruit, I’ve started saving my peels and steeping them in hot water like tea. Add any combination of fennel, cloves, rosemary, thyme, or cayenne for extra flavor and protective properties (more on these herbs later).I also would’ve tried to maximize Vitamins A, C, and D in my diet, all of which play a role in keeping our immune systems on track. (Sweet potatoes, squash, carrots, kale, spinach, and more!) Vitamin D in particular has been shown to help immune cells fight off bacteria and viruses. When I was sick, I doubled the amount of supplemental Vitamin D I normally take, from 2,000 to 4,000 IUD. Some research suggests you can go even higher, but check with a doctor first.Photo by Emma Fishman, Food Styling by Pearl Jones2. I would drink more teaAs a chronically dehydrated person, I am constantly looking for ways to trick myself into drinking water, so tea was already in my rotation. However, if I could do it again, I’d drink more tea, and sooner, and I’d focus on a few specific herbs.Licorice root: good for dry coughs and antiviral, but avoid if you’ve had symptoms like nausea or diarrheaMullein: a powerful lung support that can calm, heal, and protect mucous membranes, which are one of the first lines of defense against the outside worldYerba Mate: helps to relax and open airways in the lungs, making it easier to breathe. When my digestive system couldn’t handle coffee, mate was there for me.Medicinal mushrooms: This is not a pantry staple for most people, but medicinal mushrooms like chaga or reishi are fungal immune supporters. I used (and continue to use) Four Sigmatic, brewed into a strong tea.Nerveless Tea: a blend of calm-inducing ingredients like lavender, skullcap, and oatstraw, became my mental-health security blanket when I wasn’t feeling well3. I would start steaming nowWhen my chest was tight and I was short of breath, steam treatments were perhaps the biggest game-changer. Steaming is basically a way to hydrate your respiratory system directly. And if you add plants and herbs to your steam, those ingredients’ healing properties go straight to the source (your lungs, throat, and nasal passages).To make a steam, put a medium pot of water on the stove to boil. Add a few tablespoons of any of the herbs below or a combination. Let the herbs boil in the water for five or ten minutes, then take it off the stove and set it down somewhere where you can lean your face over it comfortably. For me, that was in front of my yoga mat so I could sit in child’s pose. Drape a towel over your head to trap the steam, then breathe it in for a few minutes at a time, on and off for half an hour or as long as you are comfortable.These are some herbs I used for steaming, which you may already have on hand:Cardamom: for indigestion and also sore throatChamomile: for anxiety, digestive distress, and aches and pains associated with virusesCinnamon: for clearing congestion, naturally antiviral and antisepticClove: a natural expectorant, aka thins out mucus and makes it easier to cough upFennel: for sore throatLavender: antiseptic, antibacterial, chest-opening, and calmingRosemary: for clearing sinuses and easing congestionThyme: another natural expectorant, antiseptic and antiviralFor more on good herbs for steaming, I found this resource from The Herbal Academy helpful.4. I would stock my freezer + pantrySometimes my sickness felt like one long Iron Chef episode in which the challenge ingredient was broth. I spiked it with chile oil (chiles have capsaicin, which can reduce pain and clear congestion) and drank it. I stirred in miso and drank it. Cooked rice in it and called it congee. Whisked in two lightly beaten eggs and called it dinner.I wish I’d make stock ahead of time using the bones and vegetable trimmings in my freezer instead of waiting until I could barely stand. Then I’d make enough of a brothy, healing soup to get me through at least a week. Garlic broth and onion soup are both great options. My friend Zoe brought me her Chinese medicinal soup when I was about 12 days in and it gave me life. If you can get yourself to an Asian market or online shop for the ingredients, I can’t recommend it enough. (Update: She'll ship you the ingredients!)Those ginger shots I mentioned earlier? They also freeze well. Pour them into ice cube trays and freeze, then melt into hot water or defrost as needed.I’d also prepare a jug of fire cider. (Another recipe here.) The key ingredients in fire cider are horseradish, ginger, garlic, onion, hot peppers, and herbs of your choice. Traditional recipes want you to let it sit for a few weeks before drinking it, so might as well start a batch now.If you have an appetite and the energy to cook when you’re sick, by all means eat other things. This is not the time to be eating in some pristine way or restricting calories. It’s a time to give your body what it craves.5. I would sleep like there was no tomorrowI know you’re anxious. I know it's hard to sleep. But I also know that my worst days came after bad nights of sleep. Do whatever you need to do to pass out for eight hours or as close as you can, both before you get sick and during. I live across from a hospital, and I sleep with earplugs, an eye mask, and ambient music that plays all night.Symptoms of Covid-19 vary a lot. I had boundless energy (or was it panic-fueled adrenaline?) despite my sore throat and digestive distress for the first few days. It wasn’t until Day 5 or 6 that I woke up feeling squashed like a bug and feverish. Don’t be like me. Don’t wait to stay in bed until you literally cannot get out of bed. Go there when you start to feel sick so you have the best chance of healing and, just as importantly, so you’re not putting other people at risk.6. I would make a plan and stick to itI wish I didn’t wait until the morning I felt short of breath to figure out which hospital to go to if I got worse. I’d much rather have done this kind of research when I was healthy and (relatively) calm. Know which doctor or urgent care number you’re going to call, which hospital you’ll go to, and how you’ll get there. Make an agreement with one friend or your group text that they’ll check in on you at regular intervals if you get sick.Once my symptoms became impossible to deny, I texted a handful of close friends to let them know where things were at. I was already talking to my family every day, but I started doing a.m. and p.m. check ins, reporting my temperature and overall status. All this contact was smart but also crucial for my mental health. The most important thing that anyone ever said to me was, “You’re going to be okay.”Photo by Peden & Munk7. I would practice staying calmWhen I got sick and as I’ve recovered, I’ve used the Headspace app like the world was ending, because it kinda seemed like it was. (While some meditations require a membership, the app now has a set of meditations called “Weathering the Storm” that’s free for everyone.) I do a simple breathing meditation in the morning and at night, and I stream one of their Sleepcasts to fall asleep. (It’s called “Night Town,” and I’ve never stayed awake long enough to find out what happens after the pet store.)Again, it took until I was short of breath to really focus on, well, breathing, and I wish I’d been laying that foundation sooner. Whatever your relaxation practices are, you’ll need them to manage the anxiety that will inevitably come if you get sick, and which can exacerbate or even overtake the virus itself if your stress response goes unchecked.8. I wouldn’t try to bounce back too soonEveryone kept telling me the same thing: When you think you’re over it the first time, rest. When you think you’re over it the second time, rest. When you think you’re over it the third time, maybe keep resting.Did I listen? No. I kept trying to go back to my normal life, whatever that means right now, just to fall short of breath and exhausted again. Luckily Stay Home orders are keeping most of us pretty constrained, but resist the urge to clean your apartment from top to bottom or stream a workout class until you can breathe freely (and follow the CDC's guidelines on how long to stay inside). It’s fine; your quarantine six pack can wait.Thank you to the following people and resources for guiding this post:Brierley E. Horton, MS, RDN, a dietitian nutritionist in Birmingham, AlabamaRachelle Robinett, a holistic health practitioner in Brooklyn, NYGet Radical, Boil Roots, compiled by Gina Badger, a clinical herbalist in Vancouver, BC“Herbal Treatments for Coronavirus Infections Used in Asia” by Stephen Harrod Buhner, a writer and scholar of nature, indigenous cultures, the environment, and herbal medicineRachel Herman, artist and teacherCamille Becerra, chefExplore Bon AppétitHealthyish Guide to Being AloneSelf CareCoronavirusHealthyishessayRead MoreLifestyleThe Healthyish Guide to Being AloneBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Amanda Shapiro"]}