{"id": "c041f9ff9fddffa924aef9b5950d8c67", "url": "https://www.bonappetit.com/recipe/roast-chicken-with-tomatoes", "year": 2021.0, "month": 5.0, "day": 4.0, "content": "Roast Chicken With Fresh Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2021 IssueRoast Chicken With TomatoesBy Andy BaraghaniMay 25, 20214.6(52)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintI love chicken, and I reeeeeally love it with ripe farmers’ market tomatoes, but I always used to cook the latter down to create a braise-y situation until I came upon this method. This take is faster, fresher, and even more delicious—there’s just something about the chicken juice dripping down and mingling with those chunks of tangy, just-sweet-enough tomatoes. I can’t believe that I’ve lived without this recipe for so long; now I’ll be cooking it on repeat to make up for lost time.—Andy BaraghaniThis recipe is part of Short Is Sweet, our collection of summer dishes that deliver a whole lot of deliciousness in 30 minutes or less.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCast Iron Skillet$30 At AmazonMicroplane$16 At AmazonTongs$13 At AmazonWhisk$10 At AmazonIngredients4 Servings1lemon6garlic cloves, finely grated2tsp. finely chopped oregano, plus leaves for serving⅓cup plus 4 Tbsp. extra-virgin olive oil, divided2½lb. skin-on, bone-in chicken thighs and/or drumsticks2medium red onions, cut into 1\"-thick wedgesKosher salt, freshly ground pepper1cup plain whole-milk Greek yogurt½cup crumbled feta2large heirloom or beefsteak tomatoes, sliced into ½\"-thick rounds and/or wedgesPreparationStep 1Place a rack in top third of oven; preheat to 450°. Cut lemon in half. Thinly slice one half into rounds and remove seeds; set other half aside for sauce.Step 2Whisk garlic, 2 tsp. chopped oregano, and ⅓ cup oil in a large bowl. Pat chicken dry with paper towels and transfer to bowl; add onions and lemon slices. Season with salt and pepper; toss to coat.Step 3Heat 2 Tbsp. oil in a large heavy skillet, preferably cast iron, over medium-high. Cook chicken (leave onion and lemon behind in bowl), skin side down, until deep golden brown and crisp, 5–7 minutes. Transfer to a plate (chicken won’t be cooked through yet).Step 4Cook onions and lemon slices in the same pan, turning occasionally, until onions have taken on some color and lemon slices have shriveled slightly, about 5 minutes.Step 5Arrange chicken in pan, skin side up; transfer pan to oven. Roast until chicken is cooked through and onions are softened but still hold their shape, 16–20 minutes.Step 6Meanwhile, stir yogurt, feta, and remaining 2 Tbsp. oil in a medium bowl to combine. Squeeze in juice from reserved lemon half and add 2 Tbsp. water; mix well. Season feta sauce with salt.Step 7Arrange tomatoes on a platter; season with salt. Using tongs, arrange chicken, onions, and lemon slices on top. Pour any pan juices over and top with oregano leaves. Serve with feta sauce alongside.How would you rate Roast Chicken With Tomatoes?Leave a ReviewTell us what you thinkReviews (14)Back to TopTriangleDamn, this was good! Super flavorful, aesthetically pleasing, not too hard to make. I’m not sure the  feta sauce is necessary— next time I might just sprinkle a little feta on top.RBLos Angeles, CA2/16/2022I usually don't write reviews, but I have to say this is one of my favorite meals to cook and eat. So So solid. Easy weeknight dinner. Clean and deliciousHWBrooklyn, NY8/24/2021Had some very ripe field tomatoes from the farmers market that got bruised on the way home and was looking for a recipe to accommodate them, happy I stumbled across this one. This recipe has amazing flavour for something so simple, using fresh in-season tomatoes to soak up chicken juices is genius! Ate with pita which worked well to deliver perfect bites with feta sauce/tomato/onion/chicken.NAToronto, ON8/18/2021This was great! Easy to prepare, and everyone loved it. I froze the leftovers and had them a few weeks later and they were excellent as well. Thanks,\nConnieEdgefield, SC8/15/2021Tried this as a recipe to use some of the tomatoes from my garden and just loved it! Serving the chicken and onions on the sliced tomatoes tasted amazing. The feta-yogurt sauce was good too, but I think it would be fine without if you don’t have the ingredients on hand. JudyPennsylvania 8/2/2021I always search for Andy’s recipes on BA because he is the best. None of his recipes ever disappoint me, and this one is no exception. He is a culinary genius, and this recipe is delicious. I am always looking for ways to use amazing in season tomatoes and this one is perfect. It is simple and really doesn’t even require a side. It is perfect by itself. Thank you, Andy!!SavannahChattanooga, TN7/22/2021I think this is really good. Be sure the skin gets nice and crispy! I added about 5+ minutes in the oven cuz I dont like rare chicken thighs. Will be making this againLizoSeattle7/17/2021Absolutely amazing!! As was mentioned already the flavor profile is amazing!!! Im not a fan of raw tomatoes - so I sliced them and put them in with the lemon and Onions. I think next time I make it (*mumbles* it'll 100% be a next time) I'll add some mushrooms; and find a perfect side dish to go with it and maybe some naan bread/pita. THANKS sooo much for this!! Its quite a high-end meal with basic food staples!!!ErinNew York7/16/2021Tried this tonight while camping I the rain.  Fantastic!  \n\nI first read it as a cacciatore style cook, lol but anyhow was good as we have a convection oven microwave in the trailer. \n\nAwesome flavour.  Served over rice.  Not sure I felt comfortable cooking the marinating ingredients to eat them, but did it.  Lol. Time will tell. \n\nHighly recommended and had a nice Greek flair.  Although the feta sauce was missing something.   Can’t put our finger on it. \n\nWill use the marinade for roast potatoes moving forward!Lobster PoutimeNotl, canada7/13/2021Another Baraghani amazement!  We had this last night, and this is an immediate heirloom recipe, a.k.a., absolutely on my rotation.  The comical part of the dish however, was to see \"California\" guys feeling no pain at night, when ready to get this dish going.   I used Carbon steel for the pan searing, and it was a hoot to see me completely focused on the dish, while my husband was freaking out and cleaning spattering oil as I calmly/methodically developed the most gorgeous sear.  Once all went into the oven, our home again knew from peace....I had an epiphany last night that will take this dish to the next level of ease and ZERO mess, as there will be no pan searing.\nBelow is the technique that I use for a fantastic \"Cold Oven Chicken Thighs\" dinner.  It will be brilliant for the next time I make Andy's recipe.  Below is for half of Andy's recipe.\n\nWhen ready to prepare, place the marinated ingredients into a 3 1/2 quart Le Creuset, and make sure that the thighs are arranged skin side up, on top of the ingredients.\n\nCover the pot and place in a cold oven.  Set the temp to 450° and immediately time for 30 minutes.  Remove cover, and time for 15 additional minutes.  Switch to broil setting, and carefully watch for the desired brown ness and crispy texture.  This dish can sit for a while if desired, serving warm or even at room temperature. But serve piping hot if you want. Jeff WinettSherman Oaks, California7/13/2021Loved this recipe. Served it on  a bed of arugula and couscous. So simple and delicious, I will be making it again. Anonymouschicago7/2/2021Absolutely love this recipe. It has that hearty, garlicky roast chicken with the freshness of the tomatoes and yogurt dressing. I had to make some adjustments because I didn't have everything in my fridge or pantry. Boneless, skinless chicken thighs, instead of bone-in — this flatter chicken fillet requires less time in the oven. I'd go with 12-15 mins, instead of 16-20mins. I ran out of yogurt so added some cream and more lemon juice for that sour finish. As I didn't have any feta, I used a tsp of anchovies (in oil) for a hint of umami without a fishy flavour. Will spring for better tomatoes next time I make this.AnonymousSingapore6/21/2021Wow! I just made this chicken with tomatoes for my wife and I for date night. I used chicken leg and thigh quarters, and kept them whole. I loved how everything came together. My wife commented, we've had all these ingredients at one time or another, but this combination of flavors is explosion. I used compari tomatoes and sliced them in half. I roasted them with the chicken, rather than serve them raw.\nI didn't have any Greek yogurt nor feta cheese, so I substituted 1 cup of cottage cheese and a tbs of parmesan cheese. I served it on a bed of sauteed broccoli seasoned with Goya Adobe .\nWe loved it! Ate every bite. Will definitely be making this again. Thanks Andy. Great recipe.JohnRhode Island6/5/2021This was a great recipe simple enough to highlight the quality of the tomatoes themselves. My tomatoes were slightly subpar despite looking great, so I added a bit of MSG to them. No regrets. I also used marjoram because I couldn’t find oregano and like it more anyways. I added about 3 tsp, and the intensity of the herbal smell when sautéing made me worried I’d added too much, but it was fine in the end. Also, I think the chicken greatly benefits from resting 10-15 minutes (perhaps in the pan to keep it warm). The onions end up very sweet, and the flavor of the lemon (pith included) is very mild after being cooked. Thanks again Andy. AnonymousSan Francisco, CA6/4/2021Explore Bon AppétitChicken DrumstickChickenPoultryChicken ThighHeirloom TomatoTomatoVegetableLemonCitrusFruitRed OnionOnionSummerEasyQuickWeeknight MealsMainGluten-FreeNut-FreeKetoHealthyishRoastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-25", "author": ["Condé Nast", "Andy Baraghani"]}