{"id": "c044bce446351f9c056adf94bb204540", "url": "https://www.bonappetit.com/story/vegetable-pulao", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "How to Make Vegetable Pulao With Whatever Is Lingering in Your Fridge | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingOnce You Nail the Spice Ratio, Pulao is FoolproofMy mom was right—pulao just takes practice.By Smita DolanSeptember 25, 2020FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I grew up watching my grandmothers and mother roll perfectly circular chapathis, nail the crispiness of dosa, and add just the right amount of tamarind to sambhar. When I left home for college, I left not knowing how to cook a damn thing. Not one. Damn. Thing. College food was, well, college food, and restaurants were expensive. A combination of desperation and frugality forced my hand into attempting Indian cooking myself. After trying for months (and often failing miserably), I resigned myself to the reality that my family matriarchs had a knack that I just didn’t. My mother always said, “No, chinna, it’s just practice,” and would patiently walk me through an even easier dish to try. The first success was vegetable pulao, a fragrant Indian rice dish that is the simpler cousin of biryani.The version below is accessible, quick, and, most importantly, delicious. I make vegetable pulao quite frequently, using the following basic framework with whatever vegetables are lingering in my fridge. The only nonnegotiables are cumin seeds, garam masala, deggi mirch, ground coriander, cooked basmati rice, and an assortment of vegetables. And once you get the proportions of spices right (I learned this through ending up with a horrible tasting dinner, calling my mother detailing each step, and hearing her go “ayo Rama,” a phrase of exasperation), it’s as foolproof as a bottled sauce or packaged mix.Start with garam masala. I know it’s one of the most well-known Indian spices, but with dry curries, less is always more. Always aim for the quantity of your garam masala to be the smallest—because it’s quite pungent, too much can make a dish inedible if overused (speaking from personal experience).Then aim for about double that amount of deggi mirch. Deggi mirch is not your grocery store chili powder, and it would greatly improve your life to make the switch. It’s a very bright, neon red powder that will add heat. Real deggi mirch is available at Indian grocery stores or online.Now shoot for five to six times as much ground coriander compared to your garam masala quantity (this may sound like a lot, but when you’re only using ¼ tsp. garam masala, it comes out to just 1½ tsp. ground coriander). To recap, garam masala to deggi mirch to ground coriander is 1:2:6-ish. Salt till you taste that zing and the flavor comes to life.Anything extra you may have lying around (included below, but not bolded) can make what’s already good great.Here’s how it’s done: In a large sauté pan over medium heat, heat 4 Tbsp. neutral oil. (Don’t skimp here: The quantity of oil is critical to the final texture of this dish, ensuring evenly coated grains.) Once the oil is hot and shimmering, add the 1¼ tsp. cumin seeds and any of the dry whole spices you may have on hand: 3 green cardamom pods, 2 black cardamom pods, 1–2 bay leaves, one 2.5”-inch. piece of cinnamon, 3 whole cloves. Stir for about 30 seconds and allow to bloom.If you have garlic (2 cloves minced), ginger (½-inch piece, minced), or cilantro (¼ cup leaves and tender stems), add them to the pan and stir. Otherwise, skip this step. Be careful, the cilantro will splutter! Add half a large onion, diced, and cook for a few minutes. The onion should be just starting to get translucent before moving onto the next step.Add about 1½ cups of small, hardy vegetables—I usually use diced carrots, but chopped parsnips, beets, sweet potatoes, cauliflower, or broccoli would also be good—and sprinkle with salt. Cook for about 7 to 10 minutes. You should be able to break the vegetables by applying pressure with a wooden spoon—they should be tender, yet still a little crisp.Add 1 cup thawed frozen peas and cooked till warmed through, about a minute. Now, add your ground spices: heaping ¼ tsp. garam masala, ½ tsp. deggi mirch, 1½ tsp. ground coriander, and 1 tsp. kosher salt. Stir well, until all the veggies are equally coated in spices, and cook for another couple minutes.Turn heat to low and add 3 cups cooked basmati rice. Stir well until it looks evenly coated with spices and oil—the grains should take on a golden brownish color. Turn off the heat and finish with a squeeze of lemon juice, if you have it, and season with salt as needed. Serve with a side of raita.Once you’ve got a handle on the ratios of spices, you can duplicate the recipe, scale it up to feed a crowd, and, most importantly, experiment: Switch up veggies! Start with a tomato base and turn it into a saucy curry! Add coconut milk! Add a different ground or whole spice! Once I understood the importance of being careful with the garam masala—and the power of salt—Indian cooking went from what seemed like scaling Everest to taking a comfortable walk in the neighborhood. It isn’t a mountain; come walk with me.Smita Dolan is a self-taught home cook, multi-tasking mom, and marketing professional based in Minneapolis.Explore Bon AppétitIt's That SimpleIndianRiceRead MorecookingMy Mom Was Wrong About The Secret To CevicheBy Patricia AzzeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-25", "author": ["Condé Nast", "Smita Dolan"]}