{"id": "c04ede15a2ae481faf49c814204461c4", "url": "https://www.bonappetit.com/story/bas-best-chocolate-chip-cookie-explained", "year": 2019.0, "month": 4.0, "day": 4.0, "content": "BA’s Best Chocolate Chip Cookies: Every Ingredient, Explained | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingChris Morocco Just Made the Best Chocolate Chip Cookie EverYeah, we said it.By Alex BeggsApril 25, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Kate BuckensFacebookTwitterEmailImagine being a painter and one day, your patron requests: the Mona Lisa, due next Friday on my desk by EOD.Imagine being a writer and one day, your editor emails: a bestseller, due next Friday, in my inbox by EOD.Imagine being Chris Morocco and one day, Carla Lalli Music drops by your station in the Test Kitchen: BA’s best chocolate chip cookie, due next Friday, in the Google drive by EOD.F R E A K I N G.O U T.That’s me imagining what it’s like to be Chris. But Chris actually being Chris remained calm. Despite a recipe with so many iterations, so many “bests” in the world, so many subjective, nostalgic requirements that vary depending on the person you ask—he put a newly sharpened pencil behind his ear and got to work. It ended up taking more than a week. In fact, in took months. But da Vinci could’ve told us that.The goal: A chocolate chip cookie with crispy edges, gooey, chewy center, and classic flavor (vanilla and chocolate) that you can make on impulse—no equipment or fancy ingredients required.The worry: “Letting everyone down,” said Chris. “The more iconic the dish, the more opinions there are, and the greater my fears. Nobody judges you for making a 20-minute weeknight stir fry—but the most American cookie ever? Gotta watch your back.”The result: A chocolate chip cookie with crispy edges, gooey, chewy center, and classic flavor (vanilla and chocolate) that you can make on impulse—no equipment or fancy ingredients required.How did he accomplish such balance, such perfection? It took nearly 30 batches, plus 10 in the cross-test phase. Here’s every ingredient in the final recipe, explained.Photo by Chelsie Craig, Food Styling by Kate BuckensThe flourIn a not-great chocolate chip cookie, you might realize the cookie tastes sort of like nothing. Or worse, like flour. Some recipes call for combinations of bread flour and pastry flour, cake flour or whole wheat, all kinds of variations that affect the texture of the cookie as well as flavor (i.e. bread flour has more protein, which can make crispier edges, but we’re not gonna get into that here). Chris tried a few flour combos and ultimately didn’t notice a huge advantage in the final cookies. It’s a lot to ask people to buy a specialty flour (or two!), and that’s not in the spirit of homemade chocolate chip cookie baking. We stuck to AP. (The ratios of other ingredients below ensure it doesn’t taste like flour.) 1½ cups.The saltThis was determined once we nailed the texture and flavor of the cookie based on the other ingredients (egg, sugar, butter). We wanted as much salt as possible to balance the sweetness and bring out the flavors of vanilla, chocolate, brown butter, and custardy egg yolk, without tasting salty. 1¼ teaspoon kosher salt.The butterOne stick is used to make brown butter, a half stick is cut into pieces and incorporated into the browned butter. Why? When we brown the butter, we cook out the water in the butter. We don’t usually think about water in butter, but it’s there, and it causes gluten activation a.k.a. a chewier cookie. But with 100 percent brown butter, there would be almost no gluten activation—potentially creating a cookie that’s all crisp, no chew. So when the brown butter’s off the stove, we mix in some regular whole butter to add some water content back in, while still getting that incredible caramel, nutty brown butter flavor too. “I want to taste fat. I don’t want to taste straight sugar,” said Chris, justifying the larger-than-usual quantity of butter in the recipe.  1½ sticks.The sugarBrown sugar gives cookies their chew while the granulated stuff gives it crispy edges. We wanted both for a texture that was just on the chewier side. (A version Chris tried with all brown sugar was too much for us, so we added in that ¼ cup of granulated.) Plus, brown sugar contains molasses, which brings a caramel, cooked-sugar taste, and its natural acidity reacts with the baking soda to carry out the cookie’s leavening—a.k.a. the cookie spreads in the oven and browns nicely. 1 cup dark brown sugar, ¼ cup granulated sugar.The chocolateWe’re doing chopped chocolate instead of chips. It’s mostly an aesthetic choice, said Chris, because graphic, geometric chocolate chunks look more modern. “A chip makes it hard to stand out in the crowd,” our cookie philosopher said. It’s bittersweet for its savory tendencies, its acidity and sharpness, to contrast the sweet ingredients. Plus, chopped chocolate means you’ll get some shards and flecks dispersed randomly throughout the cookie for varied bites. Think about it. 6 oz, coarsely chopped.The egg + yolksEggs serve to bind the cookie, but they do more than just that. Yolk brings flavor to the table, but the egg whites don’t. They’re mostly water, and we’ve got that covered in the butter arena. We only use one whole egg so the whites help bind, but then we crank up the number of yolks for their custardy flavor and rich texture. The white in the single egg does add a sheen to the final cookie, said Chris, who did a number of side-by-side comparisons with different egg ratios. Sheen!!! 2 large egg yolks, 1 large egg.The vanillaAn early version went with one measly teaspoon and the flavor was blah. A second teaspoon made a noticeable, delicious difference. And since vanilla is a dominant flavor in the cookie, use the good stuff. Chris likes Heilala or Neilsen-Massey. These vanillas have the heft to stand out against the bitter chocolate and dark brown sugar. A version he tried with supermarket vanilla extract faded into the background. 2 teaspoons.Everything we didn’t doEverything is mixed by hand, so you don’t need to pull out (and then clean) the stand mixer when you want cookies on a Tuesday.We didn’t chill or “age” the dough overnight, because to quote Chris: “What a freaking bummer.” He tried a few, but none yielded the “best cookie in the world,” so we passed.No flaky salt. “I put up one version with salt on top,” said Chris, “and Andy Baraghani looked me dead in the eye and said, ‘You know you can’t do that, right?’” That’s a chocolate cookie, he said, but it’s not our best, the paradigm: the Toll House cookie. Visually, the bougie salt starts to tell people, “Maybe you have a reason not to make this.”A life lessonLook, there’s going to be some variability. People have different ovens. The top and bottom rack heat differently (rotate and swap those cookie sheets mid-way!). American butter has more water and less fat than European. Baking soda expires. Kosher salt is different than iodized. Chris tried to eliminate any possible margins of error (that obsessive butter measurement!), but since this is Planet Earth, the potential to have a too-crispy cookie lurks in the atmosphere like a stray shard of chopped chocolate. During the cross-test, “there was some variability in the cookies,” said Chris. “But they were all delicious.”Follow the recipe, keep an eye on your oven, and believe in yourself. When the edges have browned and look crispy (this is darker cookie than a Toll House because of the brown sugar), when the tops are golden and browning, take them out of the oven to rest for 10 minutes. The best chocolate chip cookie is within your grasp.Get the recipe:BA’s Best Chocolate Chip CookiesWhat makes this the best chocolate chip cookie recipe? Crispy edges, chewy centers, and classic cookie flavor with every batch. Oh, and no mixer required.View RecipeExplore Bon AppétitChocolate ChipsCookieDessertRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-25", "author": ["Condé Nast", "Alex Beggs"]}