{"id": "c05bbdf95eb10ad171fc9ef0f6a97ba3", "url": "https://www.bonappetit.com/story/tips-for-sexual-liberation", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "A Sensualist’s 7 Tips for Finding Sexual Liberation | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Sensualist’s 7 Tips for Finding Sexual FreedomEv’Yan Whitney is all about sensual selfies, dance meditation, and writing letters to their inner child.By Ray Levy UyedaApril 15, 2021FacebookTwitterEmailProcessed with VSCO with v5 presetPhotograph by Jessie YamasakiFacebookTwitterEmailIn an Instagram post from August 2020, Ev’Yan Whitney, a Los Angeles–based “Sexuality Doula,” dances around their living room to celebrate a trio of recent milestones: a finished book manuscript, their six-month anniversary in L.A., and how good they look wearing Technicolor. The caption that accompanies the joyous video is classic Whitney, who brims with vulnerability and relatable wisdom. “[I’m] taking a quick moment to celebrate some big + small wins, and connecting to my body feels like an active rebuke of those heavy feelings which are continuously trying to swallow me whole,” they write.Whitney is an author, facilitator, and sensualist whose Instagram platform offers insight and guidance around sexual well-being. The term Sexuality Doula is one Whitney uses to describe their line of work, which broadly involves creating space and companionship for people experiencing sexual shame, trauma, or repression. Doulas provide guidance through other major life stages, like birth and death, and Whitney figured sex shouldn’t be any different. Their goal is to help people release the effects of past hurt and negative self-perceptions by offering liberatory mind and body practices.Sexual liberation, though, is not the same as sex therapy: Whereas sex therapy is typically about resolving issues in the bedroom, sexual liberation often happens outside of it. The path is holistic, involving lifelong spiritual and emotional work that has to do with understanding the relationship between all of the body’s experiences. Some of Whitney’s clients have sought to heal wounds from traumatic experiences, like harassment or assault. For others, healing has meant developing an appreciation for their own bodies and eroticism, or unpacking social commentary about “correct” expressions of gender. For many femme people, liberation has been unlearning the message that someone else’s orgasm matters more than your own.To make their guidance more accessible, Whitney created the sensual selfie, an Instagram photo sharing “challenge” that encourages publicly celebrating one’s body, and sensual dance meditation, a movement practice for releasing energy and navigating complex emotions. Here’s what else Whitney recommends:Show up for yourself first.Whitney recommends setting up a morning routine that awakens your physical body, grounds your mind and spirit in your body, and sets an intention for the day. For them, that looks like starting the day with water or tea, doing their skin-care routine, sitting at their ancestral altar, pulling a couple of tarot cards, and writing in their journal. “These rituals provide ways for me to connect to myself, connect to my voice, and connect to my story, because it’s very easy for me to take on the energies and the issues of the people that I am speaking to in my work,” Whitney explains.Understand that there is no timeline for healing.“As you get deeper into your healing, there’s more to reconcile with,” Whitney explains. “I think each layer that we excavate can help inform the next layer that we get to, but it’s really important that folks understand that our bodies are not clocks, we cannot—and we should not—treat them as though they are machines.” Whitney wants people to accept that sexual healing is lifelong work; don’t chastise yourself if you feel you’ve stumbled or regressed in some way. Work on silencing inner voices that give negative feedback, as those are the voices that want to punish, not liberate.Practice body curiosity.Sexual liberation is oftentimes about working to heal the harms incurred from systems of oppression, including white supremacy, the gender binary, and heteronormativity. Whitney recommends starting with questions: How do you experience your own body? What does that experience look like if you try to quiet the messages that you have to be a certain way? If you were to ask your body which pronouns it aligns with, what would they be? “The more that I asked myself those questions, the more I got clear about what made sense for me,” Whitney says about their decision to come out as nonbinary. “Memories started to come through where I can remember being a kid; that I wasn’t a girl, that I wasn’t a boy. I was just a being that was enjoying life and playing and feeling fully in the present moment.”Write a letter to your inner child.Our adult selves are inextricable from our child selves, Whitney says: “I know that so much of my own healing stems from the younger version of me who has been harmed, who wasn’t seen or heard or validated, who was othered and ostracized and told that she wasn’t good enough.” Addressing and healing pain or trauma that comes up in our adult lives can start with writing a letter to your child self. Whitney says that could consist of a love letter or even an apology.For BIPOC, set boundaries with whiteness.Our sexual selves respond to the world around us. If we’re constantly taking in interpersonal and structural forms of homophobia, racism, and sexism, our sexual, emotional, mental, and physical health will reflect that, Whitney says. They limit whiteness where they can, in their circle of friends and by curating an Instagram feed of predominantly BIPOC creators. “It’s been really difficult, because this world operates and was built on white supremacy,” Whitney explains. “But I am proud of myself that I’ve created for myself this kind of safe haven where I’m limiting people’s access to me; it’s been very good for my mental health.”Trust in your cravings.Sexual liberation demands that we center and embrace our own pleasure. This is important, Whitney says, because for most of our lives we’re taught that pleasures are “guilty” or that offering our bodies what they’re asking for is indulgent. Instead, they recommend letting your body guide your diet. “I would invite people to linger over what they see in the aisles and ask, ‘Do I have a craving for that?’” Whitney says. “Or asking, ‘Hey body, what are you craving right now?’”Release built-up energy in your body.Whitney recommends movement as a path to releasing negative energy and grounding oneself. They say that our emotions, like stress, fear, or shame, build up in our bodies and prevent us from being present, experiencing pleasure, or connecting with ourselves and others sexually. They recommend starting with a playful shimmy or a sensual dance meditation.Explore Bon AppétitSelf CareHealthyishRead MoreLifestyleThese 5 Things in My “Joy Toolbox” Are Getting Me Through WinterBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-15", "author": ["Condé Nast", "Ray Levy Uyeda"]}