{"id": "c061d63e79776c4a7d9e966f271c4932", "url": "https://www.bonappetit.com/story/lord-jones-gumdrops", "year": 2018.0, "month": 7.0, "day": 5.0, "content": "Lord Jones Gumdrops Are Pure Luxury and Loaded with CBD | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleLord Jones's Gumdrops Are Pure Luxury and Loaded with CBDThey're the fanciest gumdrops we've ever seen, and they're potent too.By Aliza AbarbanelJuly 30, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailThese days, the cannabis industry is dealing in a second type of green: the luxury market. There's the \"Hermes of marijuana\" and the \"Barneys of weed,\", but when it comes to getting a high-end high, Lord Jones is the gold standard.The L.A.-based CBD company has been busy infusing single-origin Ecuadorian dark chocolate and sea salt caramels with CBD since 2016. Into the Gloss loves their CBD-infused body lotion. Allure loves their espresso chews. And when it came to picking a product to represent the burgeoning CBD food industry, Bon Appetit featured their classic gumdrops in our August issue.Each gumdrop contains 20 mg of CBD, which is on the higher end of most CBD products we've seen. They’re made from just five ingredients: gelatin, “natural European fruit essences,”citric acid, sugar, and full-spectrum, phytocannabinoid-rich CBD. (Full-spectrum means the extract contains all the other cannabinoids found in the marijuana plant like CBN and CBG, but it’s still non-psychoactive). There are no artificial colors or flavors. And, yes, they’re gluten free.We're going to be straight with you: This is an expensive box of gumdrops. And at $5 a pop, it’s pretty steep for CBD standards too.Now, don't these gumdrops look pretty?\nPhoto by Emma FishmanBehind the Game of Thrones-esque seal and underneath the Charlie and the Chocolate Factory gold foil lie nine portly gumdrops. They are deep purple and Creamsicle orange. Laid in a Rubix cube pattern, they alternate in color like a group of synchronized swimmers gunning for gold. It’s very pretty, and plucking a single gumdrop from the jewel-box packaging certainly feels indulgent.The gumdrops are billed as “old fashioned,” as though sugar fiends in the 1900s were imbibing CBD between rounds of Parcheesi. They're appropriately squishy and plump, with a nice dusting of sugar around the outside. The smooth interior holds its shape, so you can save half for later or take the time to examine your bite marks. They taste vaguely of tropical fruit (“natural European fruit essences,” to be precise), with an herbal whisper of CBD at the finish.Please note: This is not the kind of CBD product that leaves you guessing about whether you’re feeling something. (As a rule, if you have to ask, the answer is no.) On the other hand, you won’t be getting high. The results are pleasantly mellow: a quiet sense of calm that feels like curling up in the sun.All of Lord Jones CBD products ship nationwide except to Idaho, Indiana, Kansas, Nebraska, Oklahoma, South Dakota, and West Virginia. (Sorry guys.) Should you be looking to take your gumdrop experience to the next level, check out their limited edition collab with the Icelandic avant-rock band Sigur Ros. It features “the flavors of foraged Icelandic berries” (wild blackberries, strawberries, and blueberries), and would pair beautifully with the etherial falsetto of Sigur Ros frontman Jónsi. Yes, it’s an over-the-top, bougie-by-way-of-Brooklyn fantasy. But if you’re going to give the gift of high-status chill-inducing confectionary, you might as well go all the way.Before you buy, consider consulting a medical practitioner and checking cannabis laws in your area. And remember: Everyone’s experience is unique. To learn more about how CBD works, check out our guide.Explore Bon AppétitHealthyishCannabisTrendsRead MoreshoppingThese CBD Strips Are Perfect for Busy, Anxious People, Which Is All Of Us ReallyBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-30", "author": ["Condé Nast", "Aliza Abarbanel"]}