{"id": "c062552afad5af02dfec968ff4b29caf", "url": "https://www.bonappetit.com/story/what-is-a-cobbler", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "What’s the Difference Between a Cobbler, a Crisp, and a Crumble? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat’s the Difference Between a Cobbler, a Crisp, and a Crumble?And the good news is, we have recipes for all three.By Emma WartzmanAugust 7, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolFacebookTwitterEmailThere are few purer joys than biting into a peak-season, ultraripe piece of summer fruit. But one of those joys is biting into a peak-season, ultraripe, piece of summer fruit baked with a combination of flour, butter, and sugar. (Also vanilla ice cream. Always vanilla ice cream.)So is it a cobbler, or a crisp? And what exactly is a crumble?The differences, it turns out, are as confusing and debatable as the myriad definitions of sandwich. It’s so regional that, as the New York Times’ Kim Severson wrote in her 2013 deep-dive on cobblers, “people within the same county will disagree on the proper form.”And while getting in the middle of this debate sounds messier than sifting flour, we dove into our favorite baking cookbooks for a definitive answer on how they differ and what that means for your future bakes.Perfectly fluffy biscuits sit on top of this cherry cobbler.\nPhoto by Alex Lau, Food Styling by Sue LiCobblerCobbler has been around in America the longest of the three desserts; the Oxford Companion to Food dates its inception back to the 1850s. By the mid-19th century, it had become the dish we know now: fruit baked in the oven with some form of dough. In 1859, cobbler was defined in John Russell Bartlett’s Dictionary of Americanisms as: “A sort of pie, baked in a pot lined with dough of great thickness, upon which the fruit is placed; according to the fruit, it is an apple or a peach cobbler.” Well, John, that sounds like…pie.But it turns out, that’s what cobbler was during this period of American cooking. In 1881, Abby Fisher, an escaped slave who fled the South after the Civil War to San Francisco, published some of her recipes in What Mrs. Fisher Knows About Old Southern Cooking. In the cookbook, her peach cobbler uses pastry dough both underneath and on top. In many parts of the South, pastry dough is still used in cobblers, sometimes in that pie-like form, sometimes with the dough just on top.But as time went on, we began to associate cobbler with either having a biscuit topping, like a shortcake in large format, or more of a cake batter, which, as Severson also points out, is a style found at barbecue joints across the South.No matter your dough, the fruit can be swapped for whatever your heart desires. Here, we turned to the Bon Appétit Test Kitchen for advice. In the case of a cobbler, your best bet is to go with firmer fruits like cherries. As contributing food editor Claire Saffitz explained during the development of her Cherry Biscuit Cobbler recipe, the firmer the fruit, the longer it’ll take to release its juices, which means the biscuits (or cake batter, or pastry) begin cooking through before they’re sogged out with liquid.Try: Cherry Biscuit CobblerThis strawberry number has granola mixed into its topping.\nPhoto by Alex Lau, food styling by Susie TheodorouCrispA crisp and a crumble are incredibly alike, the differences between them either argued over or discounted entirely, depending on where you turn. Regardless, the topping that sits on the baked fruit is crispy and crumbly. A crisp is “a type of dessert consisting of fruit baked with a crumble topping,” according to the Oxford English Dictionary’s definition, citing an early use in a 1916 recipe for an apple crisp with a topping of butter, sugar, and flour that’s mixed together by rubbing your fingertips “until crumbly.” Often, at least in the States, crisp and crumble are used interchangeably.Crisps didn’t begin making appearances in America until the early 1900s. A June 1924 issue of Good Housekeeping references an apple crisp as part of an oven meal where every dish can be baked at the same temperature (the crisp at 400 degrees for 35 minutes, for what it’s worth).In Baking: From My Home to Yours, queen baker Dorie Greenspan writes that a crisp “always has butter and sugar and something to bind the two together, sometimes just flour, but often flour and oatmeal—which gives the dessert a wonderfully pebbly look and great texture.” It’s all about that topping texture, and there’s room to play around. A 1944 recipe for peach crisp in the New York Times uses corn flakes mixed with margarine and sugar for the topping—yum. In 2017, we published a crisp recipe with spelt flour and oats over a plum-rosemary filling.Early crisp recipes were mostly apple, but now we’re crisping everything we can get our hands on, even blueberries and corn. A crisp is where your very ripe fruit—even overly ripe, bordering-on-mushy fruit—comes in handy. The point is for the filling to release its juices so that they burble up and into the topping.Try: Strawberry-Granola CrispSesame seeds are studded in this sandy crumble.\nPhoto by Chelsie Craig, Food Styling by Olivia Mack McCoolCrumbleA crumble is essentially a crisp, but it can have a slightly different texture. Greenspan’s version includes chopped nuts, though many recipes stick with only butter, sugar, and flour, maybe with some warm spices like cinnamon or nutmeg. The topping might be sandier than a crunchy crisp, or have big clumps rather than an equally distributed crisp topping. Our new peach and sesame crumble recipe is somewhere in between the two with sesame seeds adding even more texture within the clumps.The Oxford Companion to Food says that “it seems probable that [the crumble] was developed during the Second World War.” The topping may have been inspired by streusels found in Austria and Central Europe, the topping for a rich tea bread or cake called streuselkuchen.The rule for choosing fruit for a crumble remains the same as with a crisp: Whether stone fruit or berries, it can’t hurt them to be softer, as they need less time in the oven before the topping is cooked through and golden brown on top.So what’s in a name? That which we call a cobbler by any other name would taste as damn good.Try: Peach and Sesame CrumbleExplore Bon AppétitCobblerCrispCrumbleDessertRead MorecultureSummer Pies Should All Be Deep DishBy Alex BeggscookingThe Galette That Makes People Think I Work at Bon Appétit or SomethingBy Alex BeggscookingI Baked These Toffee Chocolate Chip Cookies With Half the Sugar and Loved ThemBy Sarah JampelcookingThis Plum Crumble (Prumble???) Is the Underdog Dessert of the SummerBy Emma WartzmanRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-07", "author": ["Condé Nast", "Emma Wartzman"]}