{"id": "c067dd7bf1aa88f6f20956309f84be32", "url": "https://www.bonappetit.com/story/lemongrass", "year": 2021.0, "month": 3.0, "day": 4.0, "content": "How to Use Lemongrass | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Use Lemongrass, the MVP of AromaticsNo, you cannot substitute lemons (or grass).By Shoshi ParksMarch 23, 2021FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailPreparing lemongrass was one of the first chores Nite Yun, chef and owner of Oakland’s critically acclaimed Nyum Bai, performed in her mother’s kitchen. Though Yun estimates that lemongrass is found in 95% of Cambodian cooking, give or take, the celebrated aromatic is nonetheless something of an ornery character. Releasing the fragrant, lightly floral oils from its woody stalk and bulb requires everything from peeling and chopping to smashing and pounding. Sure, it’s work, but don’t be intimidated. If Yun could master lemongrass back in elementary school, you’ll do just fine.What is lemongrass?As its name suggests, lemongrass is a grass with botanical origins that stretch across South and Southeast Asia, from India and Sri Lanka to Indonesia and the Philippines. Also called Malabar grass, Cochin grass, or fever grass among many other names, lemongrass (Cymbopogon citratus) grows in large bushy clumps. Its stalks are woody and pale green with bulbous lighter-colored bases that are somewhat reminiscent of green onions. Used whole, chopped, or pummeled into a paste, lemongrass adds a light but complex flavor and aroma—simultaneously lemony (hence the name), gingery, and floral—to sauces, soups, and meats.To make this sauce, hot oil is poured over finely chopped lemongrass, ginger, and scallions.\nPhotographs by Laura Murray, food styling by Rose Daniels and Yia VangIn some parts of the world, lemongrass is also treasured for its health benefits. When brewed into a tea, the plant is considered an immunity-boosting treatment for a wide variety of ailments including gastrointestinal distress, fever, and asthma.Where can you find it?Lemongrass comes in a few different forms, including dried and frozen, but as with most aromatics, the fresh stalks are the most potent and versatile. “I always prefer fresh lemongrass as the natural oils bring so much flavor and complexity to dishes,” says Gil Payumo, chef at Filipino fusion restaurant Señor Sisig in San Francisco. Fresh lemongrass can be easily found at Asian grocery stores, and some less specialized markets have started to carry it in recent years—I can get lemongrass at my local farmers market. Dried lemongrass, sold as whole sections of the stalk, sliced pieces, or powder, can be found in the spice or herb section at Asian groceries and many larger markets as well as online. You can also buy the stalks and bulbs frozen.How can you use it?In South and Southeast Asian cooking, lemongrass commonly conspires with ingredients like garlic, galangal (and/or ginger), cilantro, Thai basil, shallots, lime leaves, and coconut milk to create bold, complex flavors.To prepare lemongrass, start by peeling the stiff outer leaves away from the stalk to reveal the slightly softer underlayers. Slice the grass in two spots, about half an inch from the root and approximately three inches up, where the whitish color begins to turn green.The pale lower section of the lemongrass is the meatiest bit. Even so, it must be sliced thin and then finely chopped, pounded into a paste with a mortar and pestle, grated with a box grater, or tossed in a food processor so that it isn’t too tough to chew. This is frequently how lemongrass is used in Cambodian cooking, Yun says, especially in the preparation of the spice paste kroeung.Lemongrass is often finely chopped or pounded in order to break down the tough stalks.\nOnce minced or pounded, lemongrass can be added to marinades or grilled meats for a touch of sweet citrusy flavor or used to brighten curry pastes and simple sauces. Powdered lemongrass works here too. “Start with one teaspoon powder per lemongrass stalk, but be sure to taste as you go to make sure you’re getting that lemony-ginger bite,” Payumo advises. And despite the fact that lemongrass isn’t traditionally used in recipes of Western origin, adding it to creamy pastas or homemade ice cream is an unexpected delight.But while only the lower bulb of the lemongrass stem is edible, every portion of the stalk has a role to play in the kitchen. The fibrous upper section of the stalk is full of tons of lemony, gingery goodness. To release the flavorful oils, both Yun and Payumo like to bash or flatten the lemongrass stalk with a cleaver or the side of a large knife. Payumo will also sometimes bend the stalk back and forth a few times instead of smashing it to release the oils.Fresh lemongrass stalks work best in dishes like soups and slow-roasted meats that simmer for long periods of time. In Filipino cuisine it’s commonly stuffed inside whole pigs or chickens and then roasted, Payumo says. Extensive simmering or roasting is also the best use for dry lemongrass, which rehydrates as it cooks. Like with bay leaves, remove the lemongrass stalks from the dish before serving. For Lara Lee’s Soto Ayam Betawi, bruised lemongrass stalks simmer with makrut lime leaves in chicken stock.\nPhoto by Heami Lee, food styling by Judy Haubert, prop styling by Rebecca BartosheskyBruised, oil-rich lemongrass stalks work in the glass too. They not only make a mean cocktail stirrer, but they can also infuse spirits with almost no effort at all. Go ahead, throw a lemongrass stalk or two in a bottle of vodka and let it sit for a week before drinking. You won’t be sorry.How should you store it?If you store it right, lemongrass will pretty much last forever. Wrapped loosely in a towel, the stalks will stay fresh and flavorful for a few weeks in the fridge. Otherwise, they’ll do just fine in the freezer, either uncut or pre-prepped. Try portioning minced, pounded, or grated grass into an empty ice tray for no-fuss future use. Dried and powdered lemongrass should be kept in sealed containers and out of the light.Now go smash, slice, and pound away. You may not be getting to South or Southeast Asia this year, but with your new lemongrass skills, at least your culinary skills will permit you to imagine.Got lemongrass? Make soup!Salmon Coconut SoupAdjust the heat in this riff on Thai tom kha gai to your liking—use one chile for mild heat, two for medium, and three if you want sweat beading on your brow.View RecipeShoshi Parks is a freelance writer (and certified dog trainer!) who covers food, history, and travel.Explore Bon AppétitLemongrassAsianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-23", "author": ["Condé Nast", "Shoshi Parks"]}