{"id": "c070bd55653197d9b0daa99c216a32e8", "url": "https://www.bonappetit.com/recipe/warm-eggplant-salad-with-walnuts", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Warm Eggplant Salad with Walnuts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesWarm Eggplant Salad with WalnutsBy Andy BaraghaniSeptember 18, 20183.9(17)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Olivia Anderson, Prop Styling by Bea ChastkaEmailPinterestPrintEmailPinterestPrintDate syrup gives this savory, nutty eggplant salad the perfect amount of sweetness, and you can find it at most well-stocked grocery stores and health food stores. Alternatively, 2 Tbsp. pomegranate molasses or 1 Tbsp. honey are worthy substitutes.Ingredients4 servings¾cup walnuts¼cup fresh lemon juice (from about 1 lemon)1tsp. ground cinnamon½tsp. crushed red pepper flakes¼cup plus 1 Tbsp. extra-virgin olive oil4medium Japanese eggplants (about 1½ lb. total), halved lengthwise, cut crosswise into 2\" sections1small red onion, very thinly sliced1½cups mint leaves, torn if largeKosher salt2Tbsp. date syrupPreparationStep 1Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing occasionally, until fragrant and slightly darker, 8–10 minutes. Let cool, then finely chop; set aside.Step 2Meanwhile, whisk lemon juice, cinnamon, red pepper, and 1 Tbsp. oil in a large bowl.Step 3Heat remaining ¼ cup oil in a large skillet, preferably nonstick, over medium-high. Add eggplant and cook, tossing occasionally, until golden brown and tender, 7–9 minutes. Using a slotted spoon or tongs, transfer eggplant to bowl with dressing, leaving any oil in pan behind; discard oil. Add onion, mint, and three-quarters of reserved walnuts to bowl. Season with salt and toss to combine.Step 4Transfer eggplant salad to a platter. Drizzle with date syrup, then top with remaining walnuts.How would you rate Warm Eggplant Salad with Walnuts?Leave a ReviewTell us what you thinkReviews (15)Back to TopTriangleI had such high expectations for this recipe and I love all BA recipes I've ever tried but this was just plain awful. I'm not a picky eater, quite the contrary, and I love trying many different foods and recipes. However, here the flavours just didn't go well together at all. I followed the recipe exactly. It's too sour from the lemon and super onion-y and other than that just bland (despite the salt) and just doesn't taste like much. Super disappointed. Really wanted to love this but this was a no for me.SarahCanada4/6/2021This has become a regular feature of my week night meals. I serve it in a flatbread sometimes with halloumi or yoghurt. \n\nIt's so easy and delicious. AnonymousLondon, UK11/26/2020I could eat this every day!  Added roasted red and yellow peppers, used honey.  I think the dressing would be great with a number of roasted vegetables, carrots especially.Carol de RuntzHuntington Beach, CA10/29/2020Terrible mix of flavors. Nearly ruined my relationship. Beware. Anonymous10/6/2020Did not enjoy this AT ALL.  There was way too much onion, and it's raw?  I reread the recipe a few times because I thought it was an error - with this much onion it should definitely be sauteed - the flavor was incredibly overpowering.  I didn't mind the sweet and spicy, but it also didn't do anything for me.  Many other better BA recipes for eggplant.AnonymousLos Angeles, CA9/30/2020Cinnamon + eggplant = nococomamaLos Angeles, CA9/16/2020About to make this delicious meal! Should I add garlic while cooking the eggplant or just leave the recipe  as is? AnonymousHouston Texas 9/15/2020Delish! Didn't have date syrup so i made a blend of maple syrup with balsamic vinegar (dont ask me why i did that haha). i played with the ratio of acids to oil in the dressing, as well as added in ACV and red wine vinegar into the mix - tasted along the way till i was satisfied. niccsuxSingapore7/16/2020My husband and I had the same reaction to this.  First bite - it's okay.  Second bite, it tasted even better.  By the fifth bite we were both raving about it.  Delicious blend of flavors, great variety of textures.  I cut back on the red pepper because we like a little spice, but not too much.  I've got mint growing wild all over our garden, so I'll be making this a lot this summer!  I couldn't find Japanese eggplant so I just used regular.  Thanks to Andy for this recipe!AnonymousColorado5/28/2020Omg. This was hands down the best salad I have EVER had in my mouth. I didn't have date syrup on hand so I swapped that for freshly squeezed orange mixed with a teaspoon of honey. It was heavenly. A new staple meal at my house!smultronbellaSweden3/30/2020Delicious meatless dinner. I used Japanese eggplants and squeezed orange juice instead of the date syrup. Can’t wait to make and eat this again!AnonymousParis, France8/29/2019Tasted totally different from what I expected, I felt like my tastebuds were getting slapped in the face (in a really good way): it's kinda spicy, but tangy from the lemon, and then the cinnamon is there, but wait! Crunchy walnuts.....ohh man, such an exciting Monday dinner! ihatemuffinsWaco, TX6/4/2019This is the fanciest tasting thing I've ever made, literally tasted like I could have gotten it at some swanky restaurant... make this to impress your friendsAnonymousBrooklyn, NY4/2/2019Quick easy and delicious. I cooked the eggplant ahead of time and let it sit in the marinade. Added mint, walnuts, Aleppo pepper  and red onions. Topped with pomegranate molasses. Tangy and sweet. AnonymousNY10/11/2018Not the most salad-y salad but one of the tastiest I've ever made. I didn't have date syrup so used honey as suggested. Very, very delicious and cozy, exactly what I wanted on a rainy night. madmaddyGreenville, SC9/28/2018Explore Bon AppétitSaladAmericanEggplantVegetableCinnamonHerbs & SpicesWalnutNutMintRed OnionOnionSideDairy-FreeGluten-FreeVegetarianVeganHealthyishSautéRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Andy Baraghani"]}