{"id": "c07aa8cb19d6600bb66c1ef1933abc0e", "url": "https://www.bonappetit.com/story/bad-posture", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "A Search for How to Fix Bad Posture Ended in Self-Discovery | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleI Thought It’d Be Easy to Fix My Bad Posture—I Was WrongI tried chiropractic adjustment, acupuncture, body braces, high-tech gadgets, and self-realization.By T. WiseAugust 7, 2019FacebookTwitterEmailPhoto by Allan GrantFacebookTwitterEmailSeveral years ago during lunch, my sister told me, “You’re doing turtle neck.” As I considered how you “do” a sweater, she clarified that I was thrusting my head forward, making it stick out in front instead of in alignment with my top vertebrae. I looked like a turtle poking its head out of its shell. The more boring official term for this is forward head posture or scholar’s neck or text neck (a sign of the times). It’s one of the most common causes of poor posture.I started paying attention. And it was true. I kept pushing my face forward, like I was constantly trying to smell a flower just out of reach. Adjust. A few minutes pass. Check in. I was a turtle once more. My body didn’t understand its transgression, it simply reverted to what it knew as normal, what I had taught it.For 30 years, I taught my body to be smaller, to look different, to protect my ruby egg of a heart. My body is only trying to be my friend by holding on to that lesson. My default became lifting my shoulders to my ears and curling my back, like I am trying to hug my body into a compact ball. But recently this has been causing me pain, and often pain initiates action. So I set off on a mission to straighten up, testing treatment options and talking to experts who could help me navigate my way out of my turtle world.The popI am an able-bodied, active 31-year old man. But my muscles feel how a sequoia’s roots look. When did the problem begin?Maybe it began when I started wearing a backpack. Maybe it started before I gender transitioned, when my body defied my truth and popped breasts out of my chest. Or maybe it was two years ago when I freed myself of them, curled up for months in recovery from my double mastectomy. Maybe the problem began when I had to pay my own bills, the stress so heavy I curved under its pressure.According to Naryan Sawyers, a chiropractor in Alphabet City, NYC, the problem starts in first grade.“We go from moving our bodies and activating our brains outside using the force of motion to sitting still in a classroom,” Sawyers explained. “It’s harder to control your posture while sitting because you are removing your trunk. You are taking out half of the kinetic chain from foot to head, then trying to sit up straight against gravity.”Sawyers and I spoke after he gave me my first chiropractic adjustment. I lay face down on the table so he could see how my body situated itself. He informed me my right leg was about ¾ of an inch shorter than the left, and I immediately decided this is why I am bad at yoga and even emotional balance. After jackhammering me with a massage tool to relax my muscles and increase blood flow, he placed his hands on my mid-spine, pressed down, and I heard a satisfying pop. He explained the sound to me by comparing it to taking the lid off a pickle jar: “You’re creating space so more fluid can get in that area, leading to more range of motion. When you feel more open in your body, it decreases the stress in the system.”Sawyers described the link between the mind’s stress and the body’s: “We carry so much stress. From knowing you have to go to a job you don’t like, pay your bills or be kicked out of your apartment. The body doesn’t know the difference between that kind of stress and the stress from someone wanting to beat you up, having to run away. Our bodies are protective, so we round in. It is survival mode. And in survival mode, your body doesn’t care if you have other things you need to heal from. It doesn’t care about your future, it cares about surviving that moment.”How many people’s bodies are in survival mode?Each person I asked about the mental and emotional influence on posture—chiropractor, dancer, acupuncturist, yoga teacher—said something along these lines: In the body and mind, nothing is separate. But that exact ideology easily could have come from clergy, psychologists, scientists, and poets. It is a core truth of our existence as organisms in the world and the worlds within ourselves. Nothing is separate.The prick/poke/pinch etc.Next, I made an appointment with Rachel Casiano, an acupuncturist at Brooklyn Open Acupuncture. During my adjustment I had learned about fascia, the connective tissue holding all our pieces in place. I wanted to see how acupuncture uses these connections to rewire and relieve our bodies of stress.I lay facedown and shirtless while Casiano navigated my body using an ancient energetic map, dropping needles in my muscles like flags, minus the imperialism. I hadn’t expected the small spasms, my body responding and releasing. These were trigger points, “parts of the muscles that become irritated or inflamed by overwork,” said Casiano. “Releasing them can mean you don’t have this hyperirritable band of muscle pulling your body in certain ways. Then you can know ‘Okay, this is how I’m supposed to feel.’”I was afraid I had lost sight of other options for how my body can feel. Both treatments reminded me that there is no one-time easy fix. If Big Pharma could create a good posture pill, they would. And I might take it. Instead, acupuncture and chiropractic adjustments are meant to be consistent practices in order to teach our bodies a new normal. They can be expensive. I wondered if there was another option that felt more within reach.The braceTo assume we can quickly alter our posture or hold an entirely new position without training would make us like the sadistic teacher who put first-quarter material on the final exam without warning or review. That’s how it felt when I tried a $25 Qualid posture-correcting brace.Maybe it was too small. Or maybe it wasn’t a good idea to force my body into a different alignment without strengthening the muscles needed to maintain it. I felt like I was being hugged by an aggressive uncle or constantly strapped into a roller coaster, minus the thrill. It made me sweat more and poked out under my white tees. I called it quits after a few days.The gadgetTo break a habit takes awareness, followed by patience and consistency. Interested in some tactical assistance, I wore an Upright Go for a couple weeks. Using adhesive strips, I would attach this $80, two-inch-long oval device between my shoulder blades and watch as it synced to an app on my phone. When I bent over, a stick figure bent over on my screen. When I entered the red zone, a.k.a. turtle neck and a curved back, the gadget would gently buzz. The app was set to seven minutes of training per day, adding two minutes each week, which seemed like a reasonable buildup. But functionally it didn’t work. I am too sweaty and it kept sliding down my shirt. I often forgot it at home. What I needed was a built-in Upright Go that I couldn’t forget. I needed my brain to do this work.The clarityI started observing myself, investigating when I slouch more, lift my shoulders up and curl. When I am eating in public—partly from the shame of being fat my whole life and partly to protect from pigeons. When I am on a crowded train—moving around as a big man, but having been socialized as a girl to take up minimal space, has led me to man-shrinking, a niche epidemic. I slump down when I’m tired or when I want to gather my limbs around me like a blanket. Maybe turtle neck comes from a desire to have a shell as well.My posture suffers most when these pick up speed in my brain, swirling into a stress storm. I can’t concentrate on how I’m holding my spine when I’m trying to hold on to my mind.It seems the real questions are how do we truly change? Relieve our stress? Love ourselves?For 30 years, I taught my body to be smaller, to look different, to protect my ruby egg of a heart.In order to realign any part of our lives, we need intentionality, consistency, and support. That can be consistent acupuncture sessions (Brooklyn Open Acupuncture offers community acupuncture at a sliding scale). Or the support of statistics (the Upright Go gives you detailed reports and very encouraging messages). Or intentionality in stretching each morning. Or pouring into the relationships that then fill us back up. Or breaking cracks in the granite of greed that keeps the world stressed and smothered trying to hold up its weight.This might seem like a convenient conclusion, but since working on this article my posture has improved a bit and my back hurts a little less. I don’t think it was solely due to any of the (very helpful and illuminating) tactics I explored. I think it was because I spent the last month thinking and talking about my posture on a regular basis. My mind wrote a new memory, one in which I’m constantly aware of how I hold myself and how I treat my body.I also felt good this month. I was writing assignments that excited me, I got to bike every day through beautiful summertime Brooklyn, it was my birthday month, and for the first time in a while I feel I am moving forward.My sister said to me the other day that she can feel a positive shift in my mood. And she said that I am standing stronger too.Nothing is separate.Explore Bon AppétitessaySelf CareHealthyishRead MoreLifestyleAdult Acne Wrecked My Self-Esteem. Here’s How I Dealt.By Ali FrancisRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-07", "author": ["Condé Nast", "T. Wise"]}