{"id": "c07f988aea1a0119a9b81924f57f62be", "url": "https://www.bonappetit.com/recipe/sous-vide-pesto-chicken", "year": 2018.0, "month": 1.0, "day": 4.0, "content": "Sous Vide Chicken with Pesto Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJanuary 2018 IssueSous Vide Chicken with PestoBy Brad LeoneJanuary 24, 20184.4(10)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Anna BillingskogEmailPinterestPrintEmailPinterestPrintThe relatively low temperature and lack of oxygen in the bag will prevent your pesto from losing its vibrant green color. When slicing the chicken, don’t be alarmed if the meat isn’t bright white and has a hint of pink to it. It’s completely cooked and is in fact pasteurized, that is, very safe to eat! Read more about what sous vide cooking is, and see how to cook anything sous vide with step-by-step photos here.Ingredients2 servings2skinless, boneless chicken breasts (1–1 ½ pounds total)Kosher salt, freshly ground pepper⅓cup store-bought or homemade pestoSpecial EquipmentA sous vide machine; a 1-gallon vacuum-sealable or resealable plastic bagPreparationStep 1Clip (or stand) sous vide machine to a tall, large pot. Fill pot with warm water to height according to manufacturer’s instructions (keep in mind that chicken when added will cause water to rise).Step 2Season chicken lightly with salt and pepper. Place chicken in bag and add pesto; turn to coat.Photo by Alex Lau, Food Styling by Anna BillingskogStep 3Vacuum-seal or partially close resealable bag, getting as much air out as possible to keep bag from floating, and place in water bath. If using a resealable plastic bag, push down into water to submerge (this will push more air out of the bag) and fully close. To ensure proper cooking, contents of the bag need to be completely submerged in water. Turn on machine and heat water to 145°.Step 4Using a small clip, secure top edge of resealable bag to rim of pot, positioning it opposite of the machine’s water outlet; as the water circulates, it will help keep the bag submerged. If using a vacuum-sealed bag, you may need to set a small plate on top to prevent floating. Cook chicken, maintaining water bath at 145°, 2½ hours. Remove bag from water bath and let chicken rest in bag 10 minutes (this lets the chicken absorb some of the juices).Step 5Transfer chicken to a cutting board and slice. Serve with pesto cooking liquid (it makes for a great sauce to go with chicken, especially tossed with some pasta).Step 6Do Ahead: Chicken can be cooked in water bath 4 days ahead. Keep sealed in bag and chill, or freeze up to 1 month. Enjoy cold or reheat with sous vide machine at 100° until warmed through, about 1 hour, before serving.How would you rate Sous Vide Chicken with Pesto?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleAfter an exhausted day, I googled “easy chicken breast recipe,” and I’m so glad I found this one. Popped it in the sous vide with store bought pesto plus S&p, and served it some pan fried polenta. Very pleased. Would make again!JuliaLos Angeles, ca2/21/2021This is not a good recipe. The chicken releases a ton of liquid when it cooks which waters down the pesto to nothing. Much better off applying pesto after cookingKjanusDenver3/13/2019Super easy with great taste. juicy.AnonymousHouston9/20/2018Explore Bon AppétitChicken BreastChickenPoultryMainGluten-FreeKetoDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-24", "author": ["Condé Nast", "Brad Leone"]}