{"id": "c085f06dd826e04af14e0927b1ffd8a9", "url": "https://www.bonappetit.com/story/summer-of-grilling", "year": 2021.0, "month": 7.0, "day": 3.0, "content": "This Summer We're Firing Up Our Grills and Getting Out of Town | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Summer We’re Firing Up Our Grills and Getting Out of TownOur August issue has us inspired to travel and spend time in our own backyards.By Dawn DavisJuly 15, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by Susie Theodorou, prop styling by Aneta FlorczykFacebookTwitterEmailOnce a month Bon Appétit editor in chief Dawn Davis shares what’s on her mind by taking over our newsletter. You’ll find recipes she’s cooking, stories she’s loving, where she’s been eating, and more. It gets better: If you sign up for our newsletter, you’ll get this letter before everyone else.The August issue of Bon Appétit is out now (subscribe for future issues here!), and it’s clear that grilling is the theme of the month. But we just as easily could’ve called it the Inspiration Issue. Here at BA, we’re inspired to travel again, so we turned to food people (chefs, shop owners, and cookbook authors) for advice on planning food-focused getaways. Where, we asked them, do they take guests to eat and sightsee when showing off their respective hometowns? I don’t know about you, but after an intense 2020, I want to keep my weekend bag packed so I can explore every destination in this package, whether it’s just a short flight away like New Orleans and Charleston or 12 hours ahead, like Singapore with its UNESCO-protected hawker culture. (Okay, I’d need more than a weekend bag for that trip.)I’m also energized by Kaleo Kanahele Maclay, the Paralympic volleyball player who heads to Flower & Flour, the bakery she owns with her husband in Oklahoma City, at four in the morning to make blueberry scones before she trains at eight. Can you imagine how accomplished she must feel by noon? If I get through the New York Times Spelling Bee puzzle by 10 a.m., I feel like a superhero.There’s inspiration to be found in our recipes too. I love our stories on grilled chicken with specific recipes and techniques best suited for every part of the bird, all developed by the BA Test Kitchen. The spatchcocked chicken has a preparation so simple—mostly salt and five-spice powder—I was sure I’d missed a step, but it couldn’t have been more delicious. And the vegetarians in the office wouldn’t stand for another sorry story on a grilled portobello burger, so we developed recipes where the veggies aren’t afterthoughts but the stars. For more on grilling, from how to choose charcoal to nearly 100 archival recipes, check out bonappetit.com/grilling.But let’s be honest: In summer we’re most excited about dessert, and this month we featured Samantha Seneviratne, whose recipes highlight all sorts of berries. The blueberry and peach galette, as tasty as it is pretty, has graham crackers in the crust, which lend it a lightly chewy quality. Plus, it’s a perfect use for all those graham crackers hanging around after the kids make s’mores. Find the August issue on newsstands now, and subscribe here to get future issues delivered straight to your door.Explore Bon AppétitLetter From The EditorCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-15", "author": ["Condé Nast", "Dawn Davis"]}