{"id": "c0a96484bb14e123d9559b3cfa2e8d75", "url": "https://www.bonappetit.com/recipe/winter-squash-and-onion-flatbread", "year": 2018.0, "month": 11.0, "day": 3.0, "content": "Squash and Onion Flatbread Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueWinter Squash and Onion FlatbreadBy Yewande KomolafeNovember 15, 20185.0(1)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Dana BonaguraEmailPinterestPrintEmailPinterestPrintLetting the dough for this flatbread recipe proof in the fridge will extend the rising process, resulting in a more tender and flavorful crust. This recipe is presented to you by Samsung.Ingredients8–10 servings1Tbsp. active dry yeast4cups all-purpose flour, plus more for surface1Tbsp. kosher salt, plus more¾cup plus 1 Tbsp. extra-virgin olive oil, divided, plus more for greasing and drizzling2delicata squash (about 2 lb. total)1large onion, peeled, cut into thin rounds3–4sprigs thyme, leaves strippedFreshly ground black pepper½cup crumbled mild blue cheese (such as Danish Blue or Cambozola)2cups arugula2tsp. finely grated lemon zest1Tbsp. fresh lemon juicePreparationStep 1Combine yeast and 1½ cups warm water (about 110°) in the bowl of a stand mixer fitted with the dough hook. Let sit until foamy, about 10 minutes.Step 2Add 4 cups flour and 1 Tbsp. salt to yeast mixture. Mix on low speed until a slightly shaggy dough forms. Pour in ½ cup oil and mix on low to incorporate. Increase speed to medium and mix until a uniform dough forms, about 6 minutes. Transfer dough to a lightly oiled large bowl and cover loosely with a kitchen towel or plastic wrap. Chill dough until doubled in size, about 18 hours.Step 3Let dough come to room temperature, about 1 hour.Step 4Grease a large rimmed baking sheet with 3 Tbsp. oil. Turn dough out onto a floured work surface and roll to a 16x11\" rectangle. Using rolling pin, roll up dough and transfer to prepared sheet. Using your fingertips, spread dough to edges of pan. Cover dough with a kitchen towel and let rest 30 minutes.Step 5Preheat oven to 400°. Halve squash lengthwise, scrape out seeds, and slice crosswise into ¼\"-thick half-moons. Transfer to a large bowl. Add onion, thyme leaves, and 2 Tbsp. oil; season with salt and pepper.Step 6Scatter squash mixture over dough. Drizzle oil over. Bake flatbread until crust is browned and cooked through and vegetables are light golden brown and tender, about 45 minutes. Transfer baking sheet to a wire rack and sprinkle blue cheese over while flatbread is still warm.Step 7Just before serving, toss arugula, lemon zest, and lemon juice in a small bowl. Drizzle with oil; season with salt and pepper. Top flatbread with arugula salad.How would you rate Winter Squash and Onion Flatbread ?Leave a ReviewTell us what you thinkExplore Bon AppétitFlatbreadBreadDelicata SquashSquashVegetableOnionBlue CheeseCheeseArugulaLeafy GreensYeastOther IngredientsFallWinterStarterSideNut-FreeVegetarianBakingThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-15", "author": ["Condé Nast", "Yewande Komolafe"]}