{"id": "c0ae9e6aa68dd3d0ab4e2f519223b5e4", "url": "https://www.bonappetit.com/story/rent-week-store-bought-gnocchi", "year": 2019.0, "month": 2.0, "day": 4.0, "content": "A Rent Week Recipe That Redeems Store-Bought Gnocchi | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Rent Week Recipe That Redeems Store-Bought GnocchiSage and brown butter? On crispy gnocchi? Tell me more.By Alex DelanyFebruary 28, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThere will be a section of my memoir entitled The Gnocchi Years. You might be thinking, Oh, how romantic! The portion of Alex’s life where he learned to make gnocchi by hand. I bet it was in Italy, where he struck up a kinship with an old Italian grandmother who passed her masterful skills to him in broken English. And now her wisdom lives on in the mind of a young home cook that will use it to feed generations to come. Wow. That sounds so cute and amazing.Nope. That’s not what The Gnocchi Years were. I’ve been to Italy, but I spent that time eating, not developing my pasta-making skills. The Gnocchi Years took place in suburban New Jersey, when I was living in an off-campus house during my junior and senior years of college. It was during this time period that I would buy pre-packaged gnocchi from the grocery store and a shelf-stable jar of sauce and call that dinner. I’d eat this maybe two to three nights a week. Just boiled gnocchi and jarred sauce. The Gnocchi Years were not romantic. They were kind of tragic. Not for me. (My young mind still enjoyed the gnocchi.) But for the gnocchi.Because, as a food on its own, store-bought gnocchi really isn’t that bad, honestly. Sure, it’s not the beautiful, pillowy clouds of dough and cheese that chefs serve at their restaurants. But really, if it’s a weeknight and you want some gnocchi without devoting a serious hunk of time to making it yourself, the store-bought stuff doesn’t suck. College Me just didn’t really know what to do with it—how to bring out this convenience food's true potential. That’s why this Rent Week is about building a simple brown butter sauce and crisping up store-bought gnocchi, so they taste as good as they can. And in the spirit of friendship and Italian excellence, my friends from OK Mondays and I made a collaborative Italian disco playlist (filled with grooves and absolutely free of charge) for you. So smash that play button and grab the gnocchi from the fridge.But hold up. If you’ve never used store-bought gnocchi before, there are a few things you might want to know.You’ll find the gnocchi in a refrigerated section of your grocery store.It’s fresh-ish pasta, not dried.You cook it in boiling salted water like you would any other pasta.Cool. Now you know about store-bought gnocchi. Let’s cook some.Look! Store-bought gnocchi!\nPhoto by Chelsie CraigBring a big pot full of well-salted water to a boil, then toss 1lb. of store-bought gnocchi in there. While the gnocchi are cooking, pick 14 fresh sage leaves and chop 1 stick of salted butter in half lengthwise and 8 times widthwise, giving you 16 half-tablespoon pieces. Zest 1 lemon and set the zest aside (we'll use it later).You'll know that the gnocchi have finished cooking when they rise from the bottom of the pot to the top. Just when the first piece of gnocchi floats, take 2 Tbsp. of that butter and heat it over medium-high heat in a Dutch oven or large, high-sided skillet. When all of the gnocchi rise to the top, use a spider or slotted spoon to scoop them out of the water and transfer them directly into that hot, buttery pan. Scoop out and save ½ cup of that gnocchi water and discard the rest.This is the first step to making store-bought gnocchi taste a whole lot better than they did during The Gnocchi Years. The point of putting them into the pan is to make them brown and crispy. Leave them undisturbed in the pan for about 3 minutes, until they develop a nice crust, and then flip them onto the other side for another 3 minutes to brown the other side. Transfer them to a plate and wipe your pan out. Now you've got crispy gnocchi!Now we start the second process of making the gnocchi better than I did in The Gnocchi Years: we make a simple brown butter sauce. Making brown butter is a lot easier than it might sound. In the same pan you used to crisp the gnocchi, heat the remaining 6 Tbsp. of butter over medium heat. (The reason we cut the butter into small evenly sized pieces was to make sure they melt quickly and evenly when browning.)Crispy sage. Buttery gnocchi. What else do you need?\nPhoto by Chelsie CraigBrowning butter happens in a few phases. First the butter melts. Then it foams. Then it settles and gets aromatic. And then the small solids in the melted butter start to brown. To make a brown butter sauce with fried sage, you want to add your 14 sage leaves right when the butter starts to foam. This way, the sage will be crispy by the time your butter is properly browned. Don’t fuss with the sage while it’s frying. Just leave it to get crispy.When you see the little flecks in the butter start to turn a golden brown (after it has foamed and settled and started to smell like toasted nuts and caramel) you want to add the lemon zest and a splash of the gnocchi water you saved and stir it all together. This will increase the amount of sauce and give it a little texture. Then you add your crispy gnocchi, stirring them to coat. And finally, slowly sprinkle in ½ cup of finely grated Parmesan. This will thicken the sauce to some extent. The sauce isn’t going to be extremely lush and emulsified, like carbonara or cacio e pepe, but it will have a bit more texture than just plain butter. Stir the gnocchi until they’re all evenly coated.Then you grab a bowl (or bowls). And put the gnocchi in them. Hit it with some freshly ground black pepper. And another shake of Parm. And eat it. Your Gnocchi Years have begun.Your Gnocchi Years will be different than mine. You don’t have to go the jarred sauce and slimy gnocchi route. That’s not your path. Because you know that even though the gnocchi aren’t as fresh or beautiful as they could be, you should still treat them with respect. You know that store-bought gnocchi provide you with a legitimate base for a top-notch weeknight meal. I didn’t know that. But I made those mistakes so you don’t have to.More Rent Week pasta? You got it:Turn This Lemony Rent Week Pasta with Leeks and Chile Flakes All the Way UpThe ingredient list is simple. But the pasta is loud.View StoryExplore Bon AppétitBasicallyRent WeekPastaGnocchiButterSageRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-28", "author": ["Condé Nast", "Alex Delany"]}