{"id": "c0c4a5785431c4e510ef109429e87652", "url": "https://www.bonappetit.com/story/lentil-burger-recipe", "year": 2019.0, "month": 6.0, "day": 4.0, "content": "This Lentil Burgers Recipe Is Perfect for Meal Prep and Easy Weeknight Dinners | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Lentil Burger Recipe Is Perfect for Meal Prep and Easy Weeknight DinnersThis vegan burger is ready in no time, and the uncooked patties keep for days in the fridge.By Chris MoroccoJune 24, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Susie TheodorouFacebookTwitterEmailNobody could figure out why I was developing another veggie burger. My first foray into meatless burgers was BA’s Best Veggie Burger, a no-holds-barred, maximalist veggie burger in the style of Superiority Burger. A year later I followed that up with a black-bean tofu burger  designed to stand up to the high heat of the grill. So what was there left to say? Plenty.I still wanted to do a weeknight-friendly vegan burger with a simple ingredient list, and I wanted to use lentils ever since I had the lentil burger at Village Coffee and Goods, in Kingston, NY, which they serve on their housemade gluten-free bread with garlicky mayo. At Village Coffee, the lentils form a patty that had a bit of crispy texture along the sides but is jammy and creamy inside. It isn’t overwrought or overthought. It’s simple.The key with this recipe is to boil the lentils like pasta in salted water until they’re between al dente and just-tender but nowhere near falling apart (by which point they will have absorbed too much water and won’t behave.) Drain them really well, then lay them out on a rimmed baking sheet for about ten minutes so they cool slightly and steam off some excess water.The lentils get mashed together with chopped mushrooms, miso, smoked paprika, olive oil, and grated garlic until the lentils are partly smashed with lots of whole lentils remaining. A little flour binds everything together, then it’s time to form the patties. You should end up with six patties, which you can cook immediately or store in the fridge for up to several days. Keep them covered in a big bowl, then shape just before cooking to keep the patties from drying out.When cooking the burgers, be sure to use a nonstick skillet and don’t skimp on oil, since the lentils will absorb some as they cook and get crispy and flavorful. From there, you can top them with cheese, slick them with yogurt, or pile on sprouts or shredded lettuce. Veggie burgers, by nature, take more work than meat-based ones, but they should never feel (or taste) like a compromise.Get the recipeLentil BurgersEveryone questioned why the world needed another veggie burger recipe until they saw how easy and Monday-nightable this one is.View RecipeExplore Bon AppétitHealthyishLentilVeganSummerRead MorecookingA Veggie Burger Recipe That Doesn't Have 15 Ingredients for OnceBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-24", "author": ["Condé Nast", "Chris Morocco"]}