{"id": "c0c550862d231ef580cfee316f4e7fb4", "url": "https://www.bonappetit.com/story/crispy-chickpeas-are-my-dinner-mvp", "year": 2018.0, "month": 4.0, "day": 3.0, "content": "Crispy Chickpeas Are My Goes-On-Everything Dinner MVP | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCrispy Chickpeas Are My Goes-On-Everything Dinner MVPThese simple crispy chickpeas are here to improve whatever you're making for dinner.By Alex DelanyApril 17, 2018FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailI’ve always wanted to be a renaissance man. Or whatever the less pretentious-sounding version of that is. You know, someone who excels in multiple fields, someone who is always surprising friends with previously un-revealed talents. And while I’m still trying to figure out how to do that, I have managed to find a role model to look up to. The thing is that my role model is not...a person. It’s a...well...it’s a bean. A crispy chickpea, to be precise. It's the multi-faceted, delicious renaissance legume that is lighting my way.Yes, renaissance legume. It’s a thing now. Crispy chickpeas are incredibly versatile, able to make just about any dish better. A bean for all seasons, if you will.Wait. What is a crispy chickpea? Yeah. Let’s talk about that. A crispy chickpea is not a deep-fried chickpea. We’re not talking about some corn nut-esque garbanzo here. A crispy chickpea is a shallow-fried bean that is crunchy on the outside and creamy on the inside. Texturally, crispy chickpeas already contain multitudes—and we haven’t even gotten to the all the ways you can consume them yet.One step at a time, though. How do you transform humble chickpeas into these heavenly little nuggets? It’s quite simple, actually. All you need to do is open a can of chickpeas, rinse them, strain them, and lay them out on a paper towel. To get these garbanzos really crispy, we need to remove as much moisture from them as possible. So grab another paper towel and pat them dry. Don’t press too hard. These beans are not made of steel. (Hopefully.)Crispy chickpeas doing all the things they do.\nAlex LauOnce the chickpeas are dried, throw them in a skillet or Dutch oven and add a couple glugs of olive oil. Toss them with a few pinches of kosher salt so all the chickpeas get covered in oil, and then turn the heat to medium. Let the chickpeas cook for 10-15 minutes, until they start to split and the outsides get crispy. Don’t be alarmed when some of them split—that's a good thing, an indicator that the insides have heated thoroughly.So we have crispy chickpeas. Taste them, hit 'em with another pinch of salt if you want. We are in a good place. But if we wanted to take this whole thing a little bit further, to an even better place, we can add some chopped green herbs and a little olive oil. Cilantro, chives, basil, or parsley all work well here. Chop about a cup of whatever you want and dump it over the chickpeas. Add another glug of olive oil and few pinches of salt, and toss the beans to make sure they’re all coated.And there you have it folks: the delicious, savory, addictive, versatile crispy chickpea. I like to throw these chickpeas on top of plain greek yogurt and eat the whole mess with either a metal spoon or a pita bread spoon. Both work. I’ll also add these chickpeas into simple sautéd greens like kale or chard—they provide great contrast to those chewy leaves. And I’ve also been known to stir the crispy chickpeas into a simple pasta or scoop them over a piece of toast for a true rent week delight.Crispy chickpeas are a solid Rent Week option too.\nPhoto by Laura MurrayBut they also do very solid work in a salad. A hearty chopped salad (or Dinner Salad, as we like to call them in these parts) is a perfect place for crispy chickpeas to end up. A bit of crunch and a little extra protein makes a salad filled with greens, chopped vegetables, and herbs feel a little more wholesome and substantial. It doesn’t matter what you're trying to do. Crispy chickpeas can help.Emma Watson. Kanye West. Oprah. Leonardo Da Vinci. Patti Smith. All renaissance people. But there is only one renaissance legume. One bean that provides pure inspiration. One bean that we can all aspire to emulate. One bean that shows us what the word excellence truly means. Thank you, crispy chickpea. Thank you.About that salad...Chopped Dinner Salad with Crispy ChickpeasExactly what you want when dinner NEEDS to be salad, and salad NEEDS to be dinner.View RecipeExplore Bon AppétitBasicallyChickpeaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-17", "author": ["Condé Nast", "Alex Delany"]}