{"id": "c0d0f7f0eac9ac6881135222e1417161", "url": "https://www.bonappetit.com/story/jacks-wife-freda-green-hot-sauce", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "I Order Takeout From This Restaurant Just for the Hot Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Order Takeout From This Restaurant Just for the Hot SauceIt’s got the perfect amount of heat and tons of flavor.By Adam RapoportAugust 27, 2019FacebookTwitterEmailPhoto by Henry HargreavesFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.When it comes to hot sauce, I don’t need the kind that comes in a bottle with a flaming skull, threatening to incinerate my insides. I want a bit of heat, but mostly I want flavor. I want something I can put on everything, from eggs to rice to whatever sandwich I’m making.Turns out I want the hot sauce at Jack’s Wife Freda. I just didn’t know it till the immensely popular New York City lunch-and-brunch spot opened an outpost a few blocks from my apartment in Chelsea.JWF (we can just call it that, yes?) makes its own sauce—a creamy (looking) verdant green concoction that delivers just enough bite while singing of garlic, cilantro, and fresh chiles.Whenever I order takeout from JWF, I always request a few extra containers for my fridge and I end up reaching for it all week. But now that I know how simple it is to whip up the stuff after reading through the cookbook they published a couple years ago, I might just have to start making it myself.Jack’s Wife Freda Hot Sauce1 jalapeño chile1 serrano chile3 garlic cloves2 bunches of cilantro, stems removed¼ cup sunflower seed oilKosher saltSlice the jalapeño and serrano chiles into half-inch rings, seeds included.Put the chiles into a blender with the garlic and cilantro.Add ¼ cup water and the oil and blend on high speed for 1 to 2 minutes, or until the mixture is smooth and consistent. Season with salt and additional water if the mixture is too thick.Buy the book: Jack's Wife Freda: Cooking From New York's West Village, $16All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendRestaurantsNew York CityHot SauceRead MorerestaurantsI Douse Everything in Hot Sauce, But This Cooling Silken Tofu Won Me OverBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-27", "author": ["Condé Nast", "Adam Rapoport"]}