{"id": "c0d40cf23e5e22d60ad63d0f5258d8d5", "url": "https://www.bonappetit.com/story/hacks-to-get-kids-into-the-kitchen-and-dinner-on-the-table", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Hacks to Get Kids Into the Kitchen (and Dinner on the Table) | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopsponsoredHacks to Get Kids Into the Kitchen (and Dinner on the Table)Easy recipes for parents and kids to enjoy!By Prego®May 6, 2020FacebookTwitterEmailCourtesy of Prego®FacebookTwitterEmailThese days, parents and kids across the nation are getting far better acquainted with the Great Indoors than they ever thought possible. But while it’s no doubt restorative to spend some time tucked away in our own rooms—reading books, binge-watching your favorite shows, or perfecting solo hobbies—actually doing things together is its own kind of magic. And there’s no better group activity than whipping up dinner as a family.Granted, wrangling young kids into the kitchen most likely requires a few tweaks to your normal cooking routine. Our two cents: Save complicated recipes with mile-long ingredient lists for another day. Ambitious fare that calls for a blowtorch or razor-sharp mandoline? Keep those tools stashed in the cupboard for a different time. Instead, focus on satisfying home-cooking classics with basic steps that even the tiniest of hands can master.Need some ideas on how to get started? Here are the best dinners to bring families together.Courtesy of Prego®The Most Perfect Homemade PizzaGet the whole crew involved every step of the way, starting with the dough: First, enlist an adult to mix up the basic ingredients, then rope in some kiddos to knead the dough until it’s nice and smooth. Our advice: Have them pound that dough to the tempo of a favorite song, and have everyone sing along! Afterward, parents roll out personal-sized pies for kids to spread hearty dollops of Prego® Traditional Italian Sauce atop. Rich and complex, this must-have sauce delivers a blast of vine-ripened tomatoes with a hint of savory herbs. From there, everyone sprinkles on their favorite toppings, from crumbly sausage and colorful bell peppers to tangy goat cheese and milky mozzarella. Then, let the ‘rents take over in the oven department. Voila! Pizza night, family-style.A Big Salad Everyone Can LoveConvincing the young ‘uns to eat their greens isn’t always the simplest task, but having them pull together a hefty salad themselves is a good place to start. Grown-ups and older kids should take the lead on washing salad greens and chopping up add-ins like crumbly gorgonzola cheese, crisp slivers of juicy Asian pears, or anything else your heart desires. Take care to keep the components separate in their own piles, either on a large cutting board or in small prep ramekins, because of what comes next: Call in the youngest folks to play chef, a.k.a. dump everything into a giant salad bowl. After the grown-ups drizzle in a tangy vinaigrette—anything from an acidic lemon-anchovy dressing to a sweet pomegranate molasses number will work wonders—give those kids a set of tongs and let them mix away. Need some salad ideas? These are a few of our favorites.Courtesy of Prego®Chicken Alfredo Zucchini BoatsFettuccine Alfredo is a nearly perfect dish, but it leaves something to be desired in the vegetable department. Cue these adorable zucchini boats stuffed with chicken Alfredo, which might be the most genius way to get kids to eat their veggies! To start, hand the kids some spoons to scoop out the insides of halved fresh zucchinis. Meanwhile, adults mix up the luxe filling: ground chicken, crunchy panko bread crumbs, chopped roasted red bell peppers, Parmesan cheese, parsley, garlic, egg, and—most importantly—creamy Prego® Homestyle Alfredo Sauce. Revved up with garlic, Parmesan cheese, and fresh cream, this velvety sauce is the stuff dreams are made of. Once well-mixed, kids carefully spoon the chicken mixture into the hollowed-out zuccs. (Of course, everyone washes their hands well afterward!) Afterward, the team takes turns drizzling on extra Alfredo sauce and panko crumbs. From there, grown-ups take over, plugging the dish into the oven for a spell. Now, the only hard part is waiting for it to cool down enough to eat!Courtesy of Prego®Easy Skillet LasagnaThis twist on the comforting classic is easy for everyone to make, so long as grown-ups are standing by with a watchful eye. First step is browning the ground beef, which kids can do after mom and dad add the raw meat to the skillet. Afterward, kids pass the spatula off to the parents and start tossing in ingredients. First up: A jar of Prego® Traditional Italian Sauce, this sauce takes any dish from ho-hum to power charged. Water and uncooked lasagna noodles, broken into one-inch pieces, come next. Kids have time to play a quick game of tic-tac-toe before the next step, while parents keep an eye on the stove. Fifteen minutes later (or once the noodles are cooked), it's time for the kids to chuck in more ingredients: airy ricotta cheese, mozzarella, and plenty of Parmesan cheese. After a few more minutes on the stovetop—and the addition of a little more cheese, if you please—this simple-but-satisfying dish is ready for the plate.No matter what you choose to cook, delegating kitchen tasks among the entire family—kids included!—is a surefire way to quickly pass the time and bring everyone together in the process. The best part? You’ll have something delicious to chow down on afterward.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Prego"]}