{"id": "c0da991b62b01eb0f386cca8ae05cabe", "url": "https://www.bonappetit.com/story/never-fail-kimchi-udon", "year": 2018.0, "month": 11.0, "day": 1.0, "content": "This Kimchi Udon Recipe Is My Desert-Island Pantry Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Buttery Kimchi Noodles Are My Desert-Island Pantry DinnerThey're quick, insanely delicious, and I don't have to make a trip to the grocery store to make them.By Christina ChaeyNovember 2, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailWelcome to Never Fail, a weekly column where we wax poetic about the recipes that never, ever let us down.I recently started watching a Korean cooking show on Netflix called Chef & My Fridge, in which Korea's top chefs have 15 minutes to cook a dish for a celebrity guest using the contents of the celebrity's personal refrigerator (yes, they physically transport the physical refrigerator to the film studio.) In the first episode, one chef turns a package of cinnamon cookies, a block of tofu, and a bottle of soy milk into a churros-inspired dessert of fried tofu cubes in a crunchy cinnamon coating with a sweet soy milk sauce. This got me thinking: Were the Bon Appétit Test Kitchen to have its own version of this brilliant show, the undisputed master of my fridge would be senior food editor Andy Baraghani and his Kimchi Udon with Scallions.These ethereally simple noodles save me on the days when I'm too lazy to cook for longer than 15 minutes and too impatient to order takeout (this is a place I often find myself.) They require just eight ingredients that are in my kitchen at all times, and have no business tasting as delicious as they do given how easy they are to make. (They also feel like Andy made these just for me, based on the contents of my home refrigerator.)Were Andy to do a quick scan of my fridge, he'd find the following ingredients: unsalted butter, kimchi, a tub of gochujang (the spicy-sweet Korean hot pepper paste), chicken broth, eggs, and a few dying scallions he would give me a whole lotta side-eye for.Gochujang: Your pantry needs it and doesn't even know it.\nChung Jung OneNext, he'd check my freezer and find the huge stash of frozen noodles I always have for bulking up a bowl of soup, toss in a quick takeout-style stir-fry, or to simply eat on their own mixed with a ton of ginger-scallion sauce. I buy the fat white udon noodles that come in three-pound bags from the freezer aisle of H-Mart, though you can also find them at other Asian supermarkets. They're pre-cooked, which means all that stands between you and a bowl of glorious noodles is the 45 seconds you need to reheating them in some boiling water. Trust me: You want to keep frozen noodles around at all times.Here's the real genius of this recipe: It coaxes a handful of humble pantry staples (butter, kimchi, gochujang, and chicken broth) to produce maximum flavor in minimal time. You heat up some butter in a skillet until it's sizzling, then throw in a handful of roughly chopped kimchi and a spoonful of gochujang. As the kimchi softens and the sugar in the gochujang caramelizes in the bubbly butter, you're hit with an incredibly potent aroma that gets even more intense when you add some rich chicken broth. In the time it takes to bring a pot of water to a boil and flash-cook the noodles, the butter and broth mixture reduces and melds together to create a sauce that is further improved by the addition of MORE BUTTER. This may seem excessive, but that little bit of extra fat is critical to creating that velvety, perfectly emulsified crimson sauce that clings to every strand of udon. Break the egg yolk with your chopsticks or fork and mix it in there for even more glossy-saucy action (a poached or fried egg would also be great.)In keeping with \"Chef & My Fridge\" rules, the whole dish takes about 15 minutes to cook, which you can easily confirm by, you know, making them. Right now. Time yourself, and thank me later.Get the recipe:Kimchi Udon with ScallionsThe power trio of butter, kimchi, and gochujang produces an umami ballad so beautiful in this udon recipe, you’ll want to play it over and over again.View RecipeExplore Bon Appétit UdonKimchiDinnerNever FailEggRead MoreLifestyleThis Cold Udon with Grapefruit Ponzu Is the Only Thing I’ll Eat Until OctoberBy Aliza AbarbanelcookingThis Udon Stir-Fry Is My Ultimate Clean-Out-the-Fridge Friday MealBy Alyse WhitneycookingMiso Pesto Is the Velvety, Veg-Packed Sauce Your Pasta NEEDS TonightBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-02", "author": ["Condé Nast", "Christina Chaey"]}