{"id": "c0fff973826cc97b6f2630d2585b7f03", "url": "https://www.bonappetit.com/story/sandra-cisneros-peanut-butter-taco", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Sandra Cisneros’s Greatest Inheritance? A Peanut Butter Taco | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopThis is Taco Nationan exploration of one of the world's greatest foods.             Read MorecultureMy Greatest Inheritance? A Peanut Butter TacoSandra Cisneros’s grandfather didn’t hug, kiss, or even talk much—instead, he spoke through his handmade flour tortillas.By Sandra CisnerosFebruary 13, 2020FacebookTwitterEmailIllustration by Daniel ShepardFacebookTwitterEmail¡Puro Drácula! That’s what I thought I heard Grandpa Cordero say. Pure Dracula! And why not? He was a man who thrived in the twilight. Someone who rarely spoke, venturing from the kitchen or from his bedroom only to greet guests. “Buenos días, buenos dias, buenos dias.” A buenos dias apiece to each when welcoming us, shaking everyone’s hands, even the children’s, as if we were visiting dignitaries from a foreign country.Grandpa lived in a Chicago two-flat in a neighborhood City Hall forgot. A dark, brick building squeezed into a block of dark, brick buildings, a row as sinister as rotting teeth. I remember his home dim in the summer and dimmer during the long Midwest winters, a prairie architecture inspired by vampires. To make matters worse, Grandpa shut off lights as he left each room to cut down on the electric bill. Dark furniture, dark halls, dark walls. Dark him.Who could blame Grandpa? He was a man who had survived the Mexican Revolution, the Depression, and two world wars, a campesino from the Mexican countryside with a face carved from obsidian, a cliff of weedy eyebrows, and skin the polished color of the red clay from his native Guanajuato. Like most Mexican-indios, he had practically no body hair, only a grizzly stubble for a beard and a head as scrubby as the Sonoran Desert because he was his own barber.He wore work clothes all year round and squashed house slippers, a bandanna tied around his brow like the Apache, and, in the summer, he cut the sleeves off of his flannel shirts before Bruce Springsteen made it cool.Even when I knew him as an old man, Grandpa was as solid as a mountain, with a dusky voice like a Matachín drum and square hands and feet thick as tamales. Everywhere he went, he left behind the scent of Bengay because of joints shimmering with rheumatism, a testament to a life working farmlands he didn’t own and laying down railroad tracks from Kansas City to Chicago, even in the winter.Because Grandpa survived his wife by 15 years, he taught himself to cook. But even more miraculous for a Mexican man, Grandpa learned how to make tortillas. Not the corn tortillas of the Central Mexican region of his birth, but the flour tortillas of the borderlands, a skill acquired by the forced migration from south to north and hard times.Sandra Cisneros and her brother sitting on the steps outside her grandfather’s house.\nIn the old days, women woke before dawn to make tortillas, but by the time my grandfather inherited this daily task, it was a daytime venture. First he mixed the ingredients in a bowl bigger than his head. My mother’s secret was to add a drizzle of hot milk to her dough to make tortillas “as soft as a baby’s behind,” but Grandpa stuck to the original recipe. Flour, hot water, baking soda, salt, lard.Grandpa let the dough rise; then he pinched fistfuls, rolled them in his hands, and lined them up in rows like an army. After these troops had rested under a clean kitchen towel, he rolled them out into perfect moons with a wooden rolling pin. Clunk-CLUNK, clunk-CLUNK, clunk-CLUNK. Grandpa pat-patted each tortilla in his calloused hands a few times to stretch them before placing them gently on the comal. I watched them bubble and inflate and marveled at how he could flick them over with his bare fingers without burning himself, the house gradually filling with the warm scent of tortillas and the heat causing the kitchen windows to weep.These were not my mother’s tortillas but a bigger, thicker, hardier variety, like the giant Martian sunflowers Grandpa grew in his backyard. At the end of his labor, there were huge dusty tortilla towers, enough to feed his three adult offspring and two grandchildren who lived with him, and a little extra for guests. Tortillas to accompany the daily soup. Pigs’ feet soup. Meatball soup. Tripe soup. Chicken soup. Soups with pasta shaped like melon seeds. Meals that could be stretched by adding water. He even made the canned dog food stretch by spreading it onto tortillas like pâté. Well, he was a practical man.During the Depression, Grandpa bought flour and rice and beans by the sack and by the barrel. He made sure his family never went without. Often a hobo would be invited to share a meal even though my grandparents had nine kids to feed. Maybe only those who have been poor understand what it is to be poor.I think the memory of not having enough to eat must have haunted Grandpa forever, because he was never stingy with food. Ever. Sacks of oranges brought out from his bedroom off the kitchen when you least expected. Watermelons rolled out from under his bed. He spread newspapers on the kitchen table and on the floor and carved slices so wide we had to hold them with two hands, wedges so thick they hurt the corners of your mouth when you took a bite.Like the people of the Mexican countryside, Grandpa didn’t hug, kiss, or even talk much.The language he spoke fluently was food. “El camino a la boca nunca se equivoca,” he liked to say: One never doubts the route to the mouth. And then he would hand me a flour tortilla, still hot from the griddle, with a dab of butter and a dash of salt. Or maybe he would improvise; a tortilla with canned tuna. Or fried bologna with mustard. Or his most memorable innovation—a peanut butter taco.Add peanut butter to a warm flour tortilla fresh from the griddle or reheat a flour tortilla on both sides on a griddle. A spoonful of peanut butter will do because it will spread. Fold the tortilla over. The peanut butter melts and is even more delicious than on bread. Nowadays I substitute almond butter for peanut and leave the tortilla on the comal a little longer till it’s extra crispy. Is there anything better for breakfast with a mug of café de olla? I can almost hear Grandpa saying, “Buen provecho.”How did Grandpa learn to make tortillas? How did he teach himself to read in old age? Who knows. He had survived the death of his wife, and long before that, the deaths of several of his children—two little ones along the migration north and two in Chicago as adults. One child, with the lovely name Saturnino, ran off to California, sent a postcard and a lamp made of seashells, and was never heard from again.When Grandpa grew frail toward the end of his life, he went to live with Auntie Margaret and took to hiding food under his pillow, complaining, “Margarita no me da de comer.” “That’s not true,” Auntie countered. “He forgot he just ate.” Pobrecito. Grandpa began to doubt the route to the mouth. His memory migrated.Auntie Margaret recently told me her father’s “¡Puro Drácula!” was actually “¡Puro trácala!” which translates as “Nothing but cheating!” But I heard it wrong. No doubt this is what Grandpa Cordero would say of the tortillas I make. I buy tortilla flour already pre-mixed.Grandpa Cordero left his birthplace during the worst violence of the Mexican Revolution, 1915, and like many immigrants, never returned to his homeland. But he planted seeds without realizing his harvest. He passed down to me his peanut butter tacos, his mistrust of authority, and his hunger for home.One hundred years after he fled Guanajuato, I followed the opposite route, this time heading south to Mexico, where I now live, one hundred kilometers from where he was born. And though he was shy with children and might be surprised this grandchild remembers him at all, I recognize him in the indigenous faces I greet daily. Grandpa taught me to treat everyone with generosity—especially if they are hungry.For José Eleuterio Cordero, b. Feb. 13, 1887, Loza de Barrera, Guanajuato, Mexico, d. Oct. 4, 1974, ChicagoSandra Cisneros is an author and social critic who has received numerous awards for her work, including a National Endowment for the Arts Fellowship, a PEN/Nabokov Award for Achievement in International Literature, and a National Medal of Arts, presented to her in 2016 by President Barack Obama. She is best known for her first novel The House on Mango Street and the short story collection Woman Hollering Creek and Other Stories.Want More Stories From Taco Nation? Right This Way...How the Food Javier Cabral Grew Up Rejecting Became His Greatest Passion—and His Career.Why Korean Tacos Are Margaret Cho’s American DreamIt’s Time We Give the Mexican Combo Platter the Credit It DeservesIn Today’s Political Climate, Tacos Are Manuel Gonzales’s ResistanceDanny Trejo’s Been in Approximately 300 Movies, But Have You Tried His Tacos?Cooking in the Midst of a Border Crisis Is About More Than SurvivalAnd so much more!Explore Bon AppétitTaco NationFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-13", "author": ["Condé Nast", "Sandra Cisneros"]}