{"id": "c1070d1be5d01bd588224f012e2c0ce4", "url": "https://www.bonappetit.com/story/how-to-pitch", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "How to Pitch Bonappetit.com | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureHow to Pitch Bonappetit.comWant to write a story for Bon Appétit's website? Start here. By Bon AppétitJuly 26, 2021FacebookTwitterEmailFacebookTwitterEmailThanks for your interest in pitching stories for bonappetit.com. We’re glad you’re here! Below you’ll find some general guidelines, followed by instructions for how to pitch each section of the site. We look forward to hearing your ideas.General Pitch GuidelinesFirst, check to see if we’ve covered something similar recently. If we have, consider what you hope to add with your story.Start your email with a sentence about who you are. Think about why you are the best person to write the story and how your personal perspective will factor into the article.Propose a few sample headlines. This will help cue us into the hook—the compelling angle of the story that’ll draw the reader in.Include a brief (about a paragraph or so!) explanation of the story you want to tell. Please be as specific as possible. Consider the angle, perspective, point of tension, and sense of timeliness or general relevance for the moment. And while you’re at it, show off your own personal writing style.If the story requires reporting or investigating, show us you’ve done some groundwork to support the angle you wish to pursue. Give us an idea of who you’ve already talked to, who you plan to include, and/or where the idea came from.Include a few links to relevant articles you’ve written. These clips don’t have to be about food, but they should show your writing voice at its best. If you don’t have clips, don’t worry! We welcome new and emerging writers.Our standard rates begin at $250 for stories in the 400-word range and go up from there as determined by word count, experience, and the complexity and/or amount of reporting in the piece.If there’s a social component that makes sense, please include that in your pitch. (Let’s say you’re going to write about pajeon, and you think an Instagram Story would be a great way to show how you make it.) We provide additional compensation for social storytelling.We’re committed to featuring a wide variety of stories and culinary traditions, and to building lasting relationships with BIPOC and LGBTQ writers.How to pitch Cooking storiesHow to pitch Shopping storiesHow to pitch Culture storiesHow to pitch Restaurant storiesCookingFor the past 60 years, cooking has always been the heart and soul of Bon Appétit. In addition to putting out delicious, user-friendly, and relevant recipes, we strive to publish a wide range of instructional content that helps our readers to grow as cooks and feel more comfortable and confident in the kitchen. That can mean deep dives into specific ingredients (like gochujang) and techniques (like poaching chicken breasts), but we also know that cooking doesn’t start and end in the kitchen. We cover everything from navigating the wall of shelf-stable milks at the store to doing the dishes without wasting gallons of water and bottles of soap. And we want to hear from you too! If it’s cooking-tangential and service-forward (as in: it teaches something!), it can be a good fit.General cooking stories: Pitch us on a technique that changed your pie crust game (hello, laminated dough) or a tool that made your life easier or more enjoyable (like this planetary pan cover). Write about why you always keep a bottle of abalone sauce in the door of your fridge, the cookbook that helped you overcome your fear of fish (and how!), or the best way to turn a bunch of wilted basil into a flavorful bright green oil. Be as specific as possible. Our articles are generally short (in the 500–800–word ballpark), with one major takeaway. Instead of pitching a tahini tell-all, pitch a story about why you’ve started adding tahini to your favorite granola recipe.It’s That Simple: Walk us through making a dish (or condiment or beverage or snack) that’s so easy to make (or that you’ve made so many times before), you could make it in your sleep. The “recipe” should be short and loose, with room for variation—and so easy, you could explain it to a friend over text. Maybe you want to explain how to transform any soup into egg drop soup or make pita chips at home? Or maybe you’d rather share a formula to transform a pound of vegetables and a can of coconut milk into a creamy soup?How to pitch a Cooking storyPlease email sarah_jampel@condenast.com and antara_sinha@condenast.com with “PITCH” in the subject lineShoppingFor our commerce content, we are looking for product odes based on first-person experience for our Highly Recommend section. These products could be a kitchen tool, a favorite ingredient, a beloved cookbook, or a fruit bowl that you’re obsessed with. But think beyond the kitchen, too, and pitch us the laundry bar you use on spaghetti stains, mask lanyards for outdoor dining, and flameless candles for picnics. As long as it can be ordered online and shipped to your doorstep, it’s fair game to pitch. The more unexpected the item and specific the argument, the better, so think beyond a “Why You Need X in Your Life” headline. We’re looking for personal pieces that only you could write—why do you Highly Recommend the label maker that keeps kitchen chaos at bay? The mini toaster oven that fits on your desk, heats Bagel Bites, and sparks joy? The tiny licorice bombs that take fresh breath to a new level? The plastic contraption that keeps all your herbs fresh? We want to know what it’s like to actually use/consume the product, and we are especially interested in featuring products from small businesses and BIPOC- and LGBTQ-owned brands. Pieces run around 400 words, and this column pays a set fee of $250.How to pitch a Shopping storySend Highly Recommend pitches to mackenzie_fegan@condenast.com. No PR pitches, please.Culture & LifestyleFood—and the hows and whys of what we eat—reflects the way we live. For culture and lifestyle, we are seeking stories that treat food as a gateway to talking about other aspects of living. We’re interested in diverse beats: health, work, relationships, family, pop culture, our internet lives, etc. We assign a very limited number of stories specific to regions outside the U.S., but we welcome pitches from local perspectives and with a global appeal. We are always interested in stories focused on underrepresented and marginalized points of view, communities, and experiences. And we’re always interested in fun and HUMOR, whether in a piece entirely dedicated to making us laugh or in moments of levity within a more serious story. Please note that this is a developing beat of ours that we’ll continue to refine in the coming months, but here are some prompts to get you started. Pieces start at 600 words and top out around 1,200 words, depending on subject and tone, with occasional exceptions.Explorations of cultural trends, moments, and behaviors, including deep dives on food obsessions, such as this humorous investigation into the cult of crispy or this one on how Philadelphia cream cheese became so popular or this one on how omakase became a symbol for NYC’s dining elite; serious reported pieces on the intersections between food and politics, like this piece on cooking at the border in Matamoros, Mexico; rabbit holes into the intersections between food and internet, such as a look at an app that mimics bar ambience or this attempt to re-create the Impossible Burger at home; historical dives, what-happened-tos, and nostalgia plays, such as a throwback at the evolution of ’70s style kitchens.Personal narratives with a unique, reflective voice and emotional core: We want stories that treat food as central to how you became who you are, such as how one writer’s diet changed as he embraced his queerness or how a food-driven road trip to Burning Man can bring you back to yourself or the joys of Black Thanksgiving. What we’re NOT looking for: the typical tropes (read this great essay for one example of why), e.g., how your grandma taught you to make TK type of food, how cooking taught you to embrace TK identity, or how TK dish keeps the memory of a specific family member alive—instead, take us a layer or two deeper. What is the story behind the story; the quirky and exceptional narrative that only you can tell? This essay on cooking, feminism, and mother-daughter relationships is a great example of how to do just that. If it’s your first time pitching us a personal essay, please send a full essay draft for us to consider on spec.Arguments for and odes to mundane or irreverent subjects, such as this one to Olive Garden or this one to weird toast or this one on why Mars 2112 is the chaotic restaurant that we miss. Your voice should be lively and engaging.Cultural criticism in the form of essays or review-essays that explore how food is depicted in popular culture, including TV, movies, and literature, like this review of Matthew Raiford’s new cookbook, this op-ed on the Netflix show High on the Hog, or this very light take on a very dark novel. We welcome pitches with a personal connection to the material, but it’s not necessary.Profiles or Q&As with fascinating food-related people, like this drag queen turned hot sauce maker, this rapper whose hit single was inspired by trips to Trader Joe’s, and this waiter who has been working in restaurants for half a century. These stories may also fit Person of Interest, our series featuring interesting people doing interesting things, such as starting a food distribution hub in Los Angeles during the pandemic or teaching millions of TikTok followers how to forage for plants. If you have access to an exceptional someone, we want to know. If you’d like to pitch a chef to profile, unless they work outside of a restaurant, please direct the story to our restaurants editor (see below).How to pitch a Culture & Lifestyle storySend culture and lifestyle pitches to culture@bonappetit.com with “WRITER PITCH” in the subject line. No PR pitches please.RestaurantsSure, restaurants are sources of fun, creativity, and passion, but they also sit at the intersection of important topics like race, power, gender, and class. We want our restaurant coverage to reflect that expansiveness of the restaurant world. We’re looking for stories that make an impact, whether it’s a whimsical trend piece about things we’re seeing in restaurants that make you think and laugh in equal parts or a dispatch from a restaurant worker about what they’re seeing in restaurants and what that says about the industry. We want to give voice to not only chefs and food writers but everyone from line cooks to somms. Here are the stories we’re looking to publish:Restaurant Diaries: as-told-to stories (first-person pieces written by source or from the perspective and words of your source) featuring restaurant industry folks—line cooks, servers, farmers, spice blend makers, delivery workers, etc., and one specific thing they’re experiencing, learning, or working on now. Examples: the Hmong recipe chef Yia Vang refuses to change. Chef Katianna Hong on leaving her dream job to start a family. How owner Tomme Beevas turned his Minneapolis restaurant into a hub for protection and supplies amid protests. Chef-owner Jay Foster on losing his two highly acclaimed San Francisco restaurants to gentrification. A 65-year-old dentist who sold his practice to become a line cook.Well-researched yet voice-y essays about what’s happening in the restaurant industry: Why restaurant workers should have been prioritized to receive the vaccine (and what it means that they weren’t). Mason Hereford of Turkey & the Wolf on how complicated PPP (Paycheck Protection Program) was for restaurants. What it was like to be undocumented and unemployed at the start of the pandemic, from the perspective of an undocumented sous-chef and the chef-owner he worked under.Profiles or Person of Interest (our series featuring interesting people doing interesting things): Why Senegalese chef Pierre Thiam left New York’s fine-dining scene to become an importer (and proselytizer) of the West African grain fonio. How Reyna Duong of Sandwich Hag changed the way restaurants in Dallas hire when she brought on a team of people with different abilities, including those with Down syndrome. Why Zaid Renato Consuegra Sauza, chef-owner of Pirate’s Bone Burgers in Kansas City and an undocumented immigrant, decided to risk his life and livelihood to speak out against injustice. How imagining elaborate meals keep chef Ahmed Errachidi afloat during his time in Guantánamo Bay.Reported trend pieces: The explosion of Filipino pop-up bakeries, and how social media allows us to watch the evolution of Filipino baking in real time. How food-related merch became a fashion status symbol. The origin story of the now-ubiquitous party bike (you know, those pedaled bars on wheels). An exploration into the USA’s sudden obsession with Japanese milk bread. Are restaurant chairs finally becoming more comfortable? And what’s up with all the blankets?Unexpected opinion pieces: What our restaurants editor learned while covering restaurants during a pandemic. Why one bar owner donated $25K worth of rosé in response to an abortion ban. An ode to chewy food, a texture exalted in East and Southeast Asian cuisines that doesn’t get enough love in the West. The problem with white male chef redemption stories.Deep-dive reported stories (ideally timely, but not always necessary): The rise of ghost kitchens. How Georgia’s restaurants were dealing with reopening as the first state to lift COVID-19 lockdown. For asylum seekers at a tent camp at the U.S.-Mexico border, cooking is about more than survival. How outdoor dining setups in New York City revealed a deep economic divide. The story behind tavern-style pizza, Chicago’s true signature pie. The bizarre history of red sauce chain Buca di Beppo.Travel guides (restaurants recommended by food people we trust and with a specific POV that makes it unique): Restaurants in Honolulu beyond poke, Black-owned restaurants in Washington, D.C. (a.k.a. Chocolate City), where to eat and drink in Hong Kong’s Central neighborhood.What we're not looking for:Profiles of people in the restaurant world without a specific peg (e.g., a certain cultural moment we’re in, timeliness, etc.) and connection to a larger cultural/historical narrativeNews-driven storiesInternational restaurants and chefs, unless connected to a travel guide.Buzzwords! For example, if you are pitching a story about how a restaurant person is addressing systemic inequity within the industry, I want to know the specifics of how they’re doing this. What initiatives have they started? How does it work? Is it working? What’s the response been? How are they growing/tweaking/changing it?How to pitch a Restaurants storyPlease send your pitch in an email with “PITCH” as the first word in the subject line to restaurants@bonappetit.com.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-08", "author": ["Condé Nast", "Bon Appétit"]}