{"id": "c10d94d3e7cb3d3a82cc27e916174c8f", "url": "https://www.bonappetit.com/story/what-is-kewpie", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "What Is Kewpie Mayo, the Japanese Mayonnaise That's Richer, Tangier, and More Umami Than American Mayo? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhat Is the Best Mayo and Why Is It Kewpie?When mayonnaise is this good, you put it on everything.By Mehreen KarimDecember 3, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Micah MortonFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Mayonnaise has improved your quality of life, whether or not you’ve chosen to accept it. An unsung condiment hero, it’s the key to golden brown grilled cheese, the most special ingredient in special sauce, and the lazy shortcut to a lush Caesar dressing. And the highest form of mayo, I’d argue, is Kewpie mayo.What is Kewpie mayo?While Kewpie has become increasingly popular in the U.S. in recent years (a trend only bolstered by Emily Mariko’s viral salmon rice TikTok), Japanese kitchens have stocked this luscious condiment since 1925. It’s not only smoother, richer, and more fun to use (squeeze bottle > jar) than your average mayo, but it’s also packed with much, much more eggy umami flavor. If it sounds contradictory that Kewpie has both the tangy-sweetness and the savory undertone that are absent in Hellmann’s and the like, you’ll just have to taste it to understand. I can’t get enough of it in poke bowls, atop okonomiyaki, and anywhere else a dollop of mayo is welcome.Photo by Laura MurrayKewpie Mayo$6 at Weee!What makes Japanese mayo different?While American mayonnaise uses whole eggs, Kewpie mayo incorporates yolks and yolks alone for a yellow color, an almost custardy texture, and distinctly rich and fatty mouthfeel. The egg yolks—precisely four in every 500-gram squeeze bottle—are an important source of amino acids that give Kewpie its signature savory taste and, to state the obvious, egg-forward taste.To balance out all that fatty goodness, Kewpie has the perfect amount of acid. While Hellmann’s and other American brands use sharp and pungent distilled white vinegar, Kewpie relies on a blend of vinegar—rice vinegar, red wine vinegar, apple cider vinegar, and distilled vinegar, for example—for added complexity, tang, and natural sweetness.On top of all that, Kewpie is made with MSG, giving it that same lip-smacking savoriness of so many other irresistible foods. Beyond oil, yolks, vinegar, salt, and MSG (or yeast extract!), there’s not much else to Kewpie—there’s no added sugar, and the combination of vinegar and salt keeps it fresh-tasting without chemical preservatives. (Plus, the squeeze bottle helps to keep out oxygen, furthering its shelf-life.) It’s worth noting that a made-in-the-USA formulation of Kewpie, introduced in 2017, is flavored with yeast extract rather than MSG and does include sugar. For the truest Kewpie experience, seek out bottles imported from Japan.High-quality ingredients alone aren’t enough to guarantee stellar mayonnaise. Kewpie mayo’s signature silky-smooth mouthfeel is also a result of the company’s proprietary emulsification machinery that blends their product into glossy and luscious perfection.But if you can’t find Kewpie...You can make an approximation from scratch! It comes together in a pinch with the help of a food processor. (Or for an even easier hack, do like this intrepid Redditor and add rice vinegar and sugar to the American stuff.)But whether you seek out a bottle of Kewpie or try your hand at a homemade version, don’t throw away your half-finished tub of Hellmann’s just yet. Classic mayo is still worth a spot in the fridge because, hey, Kewpie isn’t the most economical route for whipping up a giant bowl of potato salad. And as much as I love its savory flavors, I wouldn’t want to introduce all that egginess into desserts like chocolate mayo cake or banana bread. And who knows? You may still prefer the more neutral flavor of American-style mayonnaise in dishes like lobster rolls or elote where you want other flavors to shine.The moral of the story: There’s room in your fridge—and your heart—for more than one mayo. Whether you make it yourself or pick it up from your local Asian grocery store, I strongly suggest you seek out this cult-favorite condiment. Your next egg salad deserves it, and, more importantly, YOU deserve it.Eggs + Kewpie = Natural CompanionsCurried Egg Tartines Fried bread is good. A slice of fried bread piled with creamy, curried egg salad is even better. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-03", "author": ["Condé Nast", "Mehreen Karim"]}