{"id": "c11338ff88c58d98086190b245551de7", "url": "https://www.bonappetit.com/story/pollo-a-la-brasa-los-angeles", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "I Will Gladly Take This Glorious Rotisserie Chicken Joint Over Any Hyped L.A. Restaurant | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsI Will Gladly Take This Glorious Rotisserie Chicken Joint Over Any Hyped L.A. RestaurantPollo a la Brasa is always my first meal off the plane.By Emma WartzmanJuly 29, 2019FacebookTwitterEmailPhoto by Pierce TwohigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.After four and a half years of living in New York, there are a lot of restaurants in Los Angeles that I miss or, as someone working at this magazine, that I feel are important to try. And yet whenever I come back to my hometown, I insist that my first meal must be a golden brown–skinned, deeply-spiced Peruvian rotisserie chicken from this no-frills joint in Koreatown.Stacks of hardwood line the perimeter of Pollo a la Brasa, and the aroma of chicken fat and smoke hits my nostrils before I even get inside. That’s the way it’s always been, or at least since my family started coming here when I was a very little kid. I grew up eating these chickens; it’s been an easy weeknight staple for as long as I can remember or sometimes the star of an otherwise homemade dinner party. The garlicky skin is delicious (and so is the perfectly tender meat), but it’s that smoke from the live fire that makes Pollo a la Brasa something special.Dig right in.\nPhoto by Pierce TwohigMy mom credits Nancy Silverton—the chef of Mozza, Chi Spacca, and, while I was growing up, La Brea Bakery—for the recommendation, but she’s not the only one in the know. Jonathan Gold wrote about it back in 1996 and gave it a nod again when he put it on LA Weekly’s 99 Essential Restaurants List in 2011. And that’s exactly what it’s become: an essential spot in in the city, mostly for people who live there, but also for out-of-towners who do their research.My move is to call ahead and order a few whole chickens and whatever sides I feel like: rice; beans; French fries; a basic green salad with cucumbers, bell peppers, and tomatoes; and the very spicy green aji sauce. I make one lucky family member drive me there and idle in the gas station across the street (parking is tough!) while I pick up the food. Then, like clockwork, the best smell in the world fills the car and I dig around the takeout bag for a chicken wing—I have never ever been able to resist eating one on the way home.Go there: Pollo a la BrasaExplore Bon AppétitHighly RecommendLos AngelesRestaurantsRead MorerestaurantsMy Favorite Spot for Toast in Toast Town Is Actually a Pizza PlaceBy Elyse InamineRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-29", "author": ["Condé Nast", "Emma Wartzman"]}