{"id": "c1192543b1a3c29596adb5f56737fa62", "url": "https://www.bonappetit.com/story/korean-corn-dogs", "year": 2021.0, "month": 12.0, "day": 2.0, "content": "How the Korean Corn Dog Went Viral | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Was the Year of the Korean Corn DogOn TikTok, #koreancorndog blew up. Now stores are opening all over the U.S.By Bettina MakalintalDecember 13, 2021FacebookTwitterEmailIllustration by: Na KimFacebookTwitterEmailWhen Emily Hui opened the Korean corn dog spot Stix in San Francisco in late 2019, she wasn’t sure how long the snack would hold people’s interest. She’d seen more and more Korean corn dogs in mukbangs, the video format started by Korean streamers in which they talk and eat on camera, and she’d tried them on a trip abroad. But although Korean corn dogs had gained popularity across Asia, the trend was still untapped Stateside. When Stix opened, it was the first Korean corn dog shop in San Francisco. As of this summer, though, the trend was going strong, according to Hui. “I really have to give credit to Instagram and social media,” she says.On TikTok, the number of videos featuring Korean corn dogs rose all year, according to a representative for the platform, with #koreancorndog hitting peak usage in June and July after creator @dee.045’s taste test videos went viral. The snack seems engineered for exactly this kind of video success. The state fair–style corn dog is fun, sure, but Korean corn dog shops offer a plethora of options. Start with a core, whether it’s all sausage, half sausage and half cheese, all cheese, two kinds of cheese, half fish cake and half cheese, and so on. Dip that filling in batter and then roll it in breadcrumbs or toppings like diced french fries, crushed ramen noodles, or crispy rice before hitting the deep fryer. The result is so crispy that you can hear the coating shatter with each bite, and the dairy-filled varieties offer classic social media bait: the cheese pull.TikTok contentThis content can also be viewed on the site it originates from.As influencers on Instagram and TikTok posted videos of themselves trying Korean corn dogs, they got customers in the doors of places like Stix. Yet Hui’s previous skepticism made sense. Viral food trends are almost inescapable, but also fleeting: Dalgona coffee, though ubiquitous at the start of the pandemic, dropped off the radar in favor of the now passé cloud bread and feta pasta. Unlike these DIY trends, which relied on home cooks’ fickle interest, the Korean corn dog can be a ready-to-eat meal—especially appealing for people who fear the fryer or enjoy the novelty of buying meat-on-a-stick somewhere. They’ve staked greater permanence over 2021 as they’ve inspired a new niche of shops across the U.S. The heyday of Korean corn dogs on TikTok may be fading, but their brick-and-mortar boom shows their potential to become a long-lasting feature of the American snack canon.Corn dogs gained popularity as a Korean street food in the 1980s, but the current corn dog trend—which sees more than just hot dogs coated in more than just cornmeal batter—is generally credited to Myungrang Hot Dog, a chain that started in a market near Busan in 2016. In just three years, Myungrang amassed 650 stores in Korea, taking corn dogs from a street-vendor staple to a franchise darling. As social media grew the trend’s global appeal, the company began its U.S. expansion in Georgia in 2018, and when it arrived in Los Angeles’s Koreatown the following year, the location imposed a limit of five corn dogs per person just to keep the lines in check. Interest in Korean corn dogs in the U.S. has been steadily building since then, with a huge spike in Google Search interest in early 2021.More companies are taking advantage of the trend now. Two Hands, a Korean-style corn dog franchise, opened its first New York City location in April of this year, and it was a hit by May, says Dan Ko, the company’s business development manager. “Every day, people were just lining up around the corner of Avenue A,” he says, attributing that popularity to guests sharing their food on social media. When it comes to visual marketing, their corn dogs, covered in Hot Cheetos powder or crispy potatoes, “couldn’t be simpler or more effective,” he explains. As of September, Two Hands had 15 locations open across the country and 40 more in the works. Mochinut, a chain named for its mochi doughnuts but that also sells Korean corn dogs, is in the midst of a similar expansion; it has 46 locations in the U.S. and 72 more coming soon.Until this year, the words corn dogs may have felt somewhat retro in the country. Case in point: In 2018, the Chicago Tribune lamented, “Where have all the corn dogs gone?” But this year the same newspaper reported that the famous hot dog city now has enough Korean corn dog joints that you can pick favorites. From there, it’s all becoming cheesy, gooey history.Explore Bon AppétitCultureLifestyleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-13", "author": ["Condé Nast", "Bettina Makalintal"]}