{"id": "c11b1be9a9a9d40a8afc0a337c8e44f2", "url": "https://www.bonappetit.com/story/bryan-furman-bs-cracklin-bbq-georgia", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "The Unmistakable Bryan Furman, Georgia’s New King of Barbecue | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Unmistakable Bryan Furman, Georgia’s New King of BarbecueThe B’s Cracklin’ pitmaster knows exactly who he is and where he comes from.By Hilary CadiganJune 25, 2018FacebookTwitterEmailPhoto by Andrew Thomas LeeFacebookTwitterEmailBryan Furman is not wearing heatproof gloves. He holds no towel, no tongs. He’s reaching into an enormous barrel-shaped smoker verging on 300 degrees with bare hands. One by one he pokes each glistening pork rib, each halved chicken, each slab of salt-and-pepper-rubbed brisket.“My finger can always tell,” he says. “If it doesn’t sink in, it’s not ready.”Here at B’s Cracklin’ BBQ on Atlanta’s west side, Furman cooks meat the old-fashioned way: over split logs of oak and pecan wood burning hot above layers of coals. It’s a breezeless afternoon and the smokehouse is filled with a thick fragrant haze that leaves me sweating in a way some might describe as profuse. But Furman seems unfazed by the heat. Years as a welder have left his hands calloused, nearly immune to burns. He’s tall and lean and serene in a perspiration-free T-shirt bearing the name of his favorite local brewery, Creature Comforts, with tight, waist-length locks swept neatly under a backwards Run the Jewels flat-brim. It’s the same hat he was wearing the day he met André 3000 at a Whole Foods in Buckhead, waiting in line for the hot bar. “We was supposed to run into each other,” the notoriously elusive rapper told him. “This was supposed to happen.” Furman’s that kind of guy: the kind even hip-hop legends feel cosmically destined to meet, the kind who radiates cool even inside a stifling smokehouse on a swampy Atlanta afternoon.With a pair of silver tongs now, Furman grabs a rack of ribs off the smoker and carries it into the restaurant’s narrow kitchen. This one is ready. Tossing it onto a white plastic cutting board, he slices each bone free, clean and quick. Drizzles a bit of his glossy orange sauce on one and chomps down. Gives a little head-shaking laugh of pleasure. “Here you go, I wouldn’t do you like that,” he says, passing me a rib of my own.It’s so good—crackly exterior yielding to juicy butter-soft flesh—I take one bite and drop it on the floor. Goddammit. I’m staring down in horror, debating the professionalism of picking the thing up and eating it anyway, when Furman laughs and hands me another. “If you weren’t here,” he says, “I probably would’ve picked it up and ate it anyway.”“Yeah, That Happened.”Though he’s been a restaurant owner and full-time pitmaster for just four years, Furman, 37, already sits among the greats. Maybe it’s because he swaps out typical commodity pork for whole heritage-breed hogs he raised himself. (“Nobody else was doing that,” Furman says, “Not in a barbecue restaurant.”) Maybe it’s his unique Carolina-meets-Georgia style sauce, a sweet and tangy blend of mustard and fresh peaches. (“He does everything different,” says Nikki Furman, his wife and business partner.)Or maybe it’s the fact that his food is just so damn delicious. Within months of opening his first B’s Cracklin’ BBQ in Savannah in 2014, locals formed lines out the door on Saturdays after Little League to get a taste of Furman’s offerings: chopped brisket, bark black as pitch; crisp smoked chicken; the Carolina’s Finest pulled pork sandwich topped with creamy-tangy slaw. The media came running. The little barbecue shack watched business double, then triple. Then, late one night in June 2015, just a few days after B’s made Southern Living’s coveted list of the South’s Top 50 Barbecue Joints, a soda machine faultily loaded with too much freon exploded. Launched 30 feet away and took the entire right side of the building with it, burning down the rest in a fiery blaze.“Yeah, that happened,” Furman says. He shrugs now, but the loss was devastating. The couple had put everything into the restaurant; Nikki had just quit her job as a property manager. “That was the only income we had,” she recalls. “We both cried for the first three hours, and then we looked at each other and said, we can’t keep crying about it.”In the days and weeks that followed, the community rallied around the Furmans, donating supplies, scouting out potential locations, lending moral support. Bryan and Nikki pooled their remaining cash, borrowed money from a brother-in-law, and hustled to find a new spot. By October 2015 they’d opened a brand-new B’s in Savannah. A year after that they opened another in northwest Atlanta. It was rapper Killer Mike from Run the Jewels, a longtime fan of Furman’s ’cue, who encouraged the expansion.Today Furman spends most of his time in Atlanta, where he lives just a few blocks from his smokehouse. Trusted staff members in Savannah run that location themselves; he visits when he can to see how things are going. Last year Heinz tapped him to be one of the brand’s “regional pitmaster partners,” making Furman the face of its Carolina Mustard Style BBQ Sauce, a riff on Furman’s signature blend. A third B’s Cracklin’ BBQ is on the way, also in Atlanta, though he can’t disclose the details quite yet.As far as Furman is concerned, this is just the beginning. Eventually he hopes to go national with B's Cracklin' in as many as ten cities. But with one key focus: to have black owners.Ribs getting ready for the smoker.\nPhoto by Peden + Munk“What Furman Is Doing Is Revolutionary.”Bryan Furman’s story is one of daily grinds, of heading to the smokehouse at 5 a.m. every morning, of stoking the coals, piling the wood, setting the whole hogs on to smoke. There are no deep-pocketed investors, no high-powered PR machines; there is no generational inheritance beyond the passed-down knowledge of raising pigs and cooking food. His is a story of hard work. But it’s also more than that. It’s about ownership, about honoring the black pitmasters who came before him, about recognizing and reclaiming their legacy for the generations that follow.“What Bryan is doing is revolutionary,” says food historian Michael W. Twitty, who has written extensively about the roots of American barbecue, which he traces back to enslaved Africans working on Southern plantations and to their West African ancestors. “[E]nslaved men were in many cases the early pitmasters,” he writes in his book, The Cooking Gene, which was recently awarded the James Beard Foundation’s Book of the Year. “Their stories are mostly gone because they were just considered ‘the help.’”As Twitty points out, this pattern continued long past the days of slavery. “In the South, the black barbecue man worked behind the boss, and the boss owned the restaurant or the tavern or the pit,” he says. “And they were just out back, doing their thing, living lives of quiet desperation under Jim Crow.”Even today, African Americans are often sidelined from barbecue’s pop culture narrative. David Chang’s Ugly Delicious, a 2018 docuseries dedicated to using “food as a vehicle to break down cultural barriers and tackle misconceptions,” according to its official Netflix description, featured zero black people in its barbecue episode. There’s only one African American in Kansas City’s national Barbecue Hall of Fame (Henry Perry, the so-called father of Kansas City barbecue), and he’s been dead almost 80 years.“Barbecue is very cultural,” Furman points out. “People have been cooking with wood and fire forever. But there’s really one culture that gets all the praise.” He’s referring to the Southern white men who line the walls of the Barbecue Hall of Fame. The kind you’ll find at weekend ’cue competitions boasting about how long they smoked their brisket or which regional cooking methods are best.Furman doesn’t do barbecue competitions. “I don’t cook for judges, I cook for people,” reads a giant chalkboard at the front of his Atlanta restaurant. Nor is he married to any one regional style; instead he makes up his own rules. The uncharted territory of Georgia barbecue is his to claim.Furman slices ribs.\nPhoto by Andrew Thomas LeeAnd though his revolution may sound like a whisper, its implications run deep. “Having a brick-and-mortar place is real power,” Twitty says. “It’s not enough to just do a food truck; it’s not enough to be on the side of the road or behind some other place. Having a door, having a logo, having a place you can call your own after 400 years is a really powerful and important gesture of not just making it, but passing it on and inspiring people to go to the next level.”Furman recognizes the importance of visibility. That’s why he’s changing B’s official logo to a picture of his face. “I get tired of people coming here, thinking it’s a white-owned business,” he says. “I want people to know who I am and stop thinking it’s somebody else.” He nods toward the picnic tables on the wooden patio outside where customers are tearing into pulled pork sandwiches and oozy scoops of mac and cheese. “You would not believe how many times I’ve been out there, and they thought I’m the dishwasher or the cook. And when they realize it’s me, they're like, ‘Holy shit.’”Furman tends to the smokers.\nPhoto by Andrew Thomas LeeWhen I brought up the marginalization of black pitmasters with Furman’s friend Howard Conyers, a NASA aerospace engineer and fellow South Carolina–born pitmaster currently working on a book about barbecue’s African American history, he pointed to tokenism as an important factor. “Once mainstream society’s found the one or two people who fit that mold, all the mainstream media keeps going to that person instead of looking for somebody else,” Conyers said. Furman gets this, too, and hopes to change it. He’s serious about sharing the spotlight, about drawing attention to other black cooks worth knowing, about passing his skills down to those who are willing to learn.Take, for example, his collaboration with Erika Council, a local chef and blogger (and granddaughter of famed restaurateur and cookbook author Mildred “Mama Dip” Council, who died last month). After meeting at a Black History Month dinner with fellow Atlanta chef Mike Sheats, Furman and Council decided to team up for #BombAssBiscuits, a Saturday breakfast pop-up at B’s that’s become an Atlanta sensation. Furman makes the gravy, and Council uses B’s lard to craft her famous buttermilk biscuits, sometimes stuffed with sticky cinnamon sugar and draped with icing, sometimes snuggled up against fried chicken or topped with homemade apple butter. These days Atlantans plan their weekends around the event, driving across town, lining up, and buying every last biscuit in a matter of hours. “It’s her show,” Furman says. Eventually, he wants to help her open her own restaurant.Furman takes a break at a recent family barbecue.\nPhoto by Peden + Munk“I Hate That People Call Me a Chef.”Unlike most of today’s big name pitmasters—your Sam Joneses, your Bessinger brothers—Furman wasn’t born into barbecue. He was born into a farm: his grandparents’ farm in rural Cassatt, South Carolina, where sticky childhood summers were spent chasing piglets through mud. Slaughters happened in the wintertime. He witnessed his first kill at five, maybe six years old. “That’s what I grew up doing.” He shrugs. “It wasn’t weird.”In this way Furman learned early to associate good food with hard work. “My mom, she was always in the kitchen, so we never really ate a lot of fast food. Everything was always homemade, homemade, homemade. I used to get mad because my cousins got Hamburger Helper, and I didn’t.” He pauses, laughing. “Until I got older and bought my own and realized I wasn’t missing nothing.”At nine, Furman and his parents moved to Charlotte. Furman spent the rest of his school days there, summers visiting his grandparents back in Cassatt. After graduating high school, he got a job driving forklifts for Black & Decker. But “my dad was always telling us growing up, you need a trade,” he recalls. That’s how the welding started.Furman worked as a welder for big companies like Honda for years, traveling around the region from job to job. The money was good but fleeting; there was no staying power, nothing to pass down. The farm shut down after his grandparents died, and Furman came to a crossroads. “I wanted to be able to leave something for my kids,” he says. “And the only other passion I knew I had was barbecue.”So in 2010 when his daughter’s first birthday rolled around, Furman decided to cook a whole pig. “I learned how to cook with just wood and stuff from my dad,” he says. “Because he said that’s the most important part of barbecue. If you don’t know how to control a fire, you’re not a pitmaster.” Though he’d previously cooked only chicken and ribs, he was able to apply the same lessons to his first whole hog attempt.The results were good; people liked what he could do. In the months that followed, Furman began experimenting with various methods and meats, started catering for friends and coworkers. Every week he tried out something different. And suddenly the idea of barbecuing professionally didn’t seem like such a far-off dream.A full spread at B’s Cracklin’.\nPhoto by Andrew Thomas LeeA turning point came in 2011. Newly laid off from his latest welding gig, sitting in his parents’ kitchen in Charlotte, Furman told his father: “I’m going to open me a barbecue joint. I’m not working for no more welding companies.”“What’s going to make your barbecue different?” his father asked.“It’s going to taste better.\"“No, what’s going to make your barbecue different? What’s going to make me say, ‘I’m going to go to B’s and not go to this guy.’ What’s going to set you apart from this guy?”The answer came a few months later, with an episode of Andrew Zimmern’s Bizarre Foods where chef Sean Brock cooks Ossabaw Island hogs. After watching, Furman ran to his computer and googled “best tasting hog breeds.” An array of heritage pigs popped up: Berkshire, Red Wattle, Duroc, Tamworth. Then he googled “barbecue restaurants using heritage breed pigs.” Nothing.“That was the concept, right there,” he says. “So I ran back to my mom and dad, and I’m like, ‘I’ve got it. I’m going to raise my own heritage-breed pigs, cook all my sides from scratch.’ My dad and my momma looked at me, and they busted out laughing.”But today that’s exactly what he does, alongside Nikki—who now runs the restaurant’s front of house—and a pig farmer out in Statesboro, Georgia, named Donald Chavers (Furman calls him “The Hogfather”). Furman takes an active role in the pigs’ life cycle, knows every detail about how they’re raised: what each pound of meat is worth, which breeds produce the best flavors and when.His mother, Almeta Benjamin, makes the sides fresh every day at B’s Atlanta location (his recipes, her generational know-how). Nothing comes from a can or a bag or a box. Instead it’s collard greens cooked low and slow with smoked turkey leg. Hoecake-style cornbread fried golden brown on a griddle and studded with bits of crispy pork skin (hence the “cracklin’” moniker). A coleslaw recipe from Furman’s grandmother, with peaches added for Georgia flavor. And perhaps most notably, a traditional South Carolina–style hash made from whole smoked hogs’ heads and burnt ends (no waste here!) sent through a Hobart grinder and simmered in a giant pot with mustard and ketchup. The result is a creamy stewlike gravy served hot over rice, meant to warm your insides and stick to your bones.“Bryan has a South Carolina history but is taking barbecue and doing it his own way,” Conyers says. “My family used to do barbecue hash. It’s one of those special dishes. To see him put that in a restaurant showed me he understood a lot about where he came from.”Never forgetting where he came from is important to Furman. “I hate that people call me a chef,” he says, “because I’m not a chef. I can’t make foam. I can’t do all those little...tweezers stuff, I can’t do none of that.” Despite his celebrity friends, his big-name media coverage, his ambitious expansion plans, he’s still the guy you can call if, say, you need to cook an entire cow over an open fire in the middle of the night, or if you’re raising pigs in your suburban backyard but don’t know how to catch them in time for slaughter (both true stories).“One thing I know about Bryan is, he’ll be there,” Conyers says. “If he says he’s gonna do it, he’ll do it.”Smoke catching sunlight.\nPhoto by Peden + Munk“Essential Means Known.”The day after our interview, Furman gives me a call. “I’ve been thinking since we talked about how few black-owned barbecue joints are in the spotlight,” he says. He had done some googling and found a list on a site called Travel Noire titled “19 Essential Black-Owned BBQ Restaurants in America.”“Essential means known.” He speaks a little louder, a little faster. “How could there be only 19 known black-owned barbecue restaurants?” The problem, he says, is that so many have closed down. His newest goal? To reopen them. One by one.With the help of friends like Conyers and Council, Furman’s plan is to travel around the country seeking out closed-down black-owned barbecue restaurants and bringing them back to life. “If they were doing ribs, I’ll do ribs. If they were doing chicken, I’ll do chicken. Then I’ll hire local people to keep it going. We’ll open a new one every year.”He pauses a second, muffles the phone, mumbles a few words to someone out of earshot. I can hear the clank of the smoker, a customer’s laughter, the low steady din of the kitchen staff. “Anyway,” he says, voice returning to its typical cadence, soft and low and slow. “Gotta get back to it.”Now watch Furman at work:And find all the recipes from Furman’s family barbecue here:1 / 7ChevronChevronSpiked Ginger-Mint LemonadeView RecipeExplore Bon AppétitBarbecueGeorgiaChefsRestaurants + TravelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-25", "author": ["Condé Nast", "Hilary Cadigan"]}