{"id": "c12ad068c9b5a068afdc269802ef78c6", "url": "https://www.bonappetit.com/story/valentines-day-etiquette", "year": 2020.0, "month": 2.0, "day": 2.0, "content": "Valentine's Day Etiquette: Is It Ever Okay...to Fake an Engagement for Free Dessert? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIs It Ever Okay...to Fake an Engagement for Free Dessert?Solicited, untested Valentine’s Day advice from Alex Beggs.By Alex BeggsFebruary 10, 2020FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.Is it ever okay to give someone a Brita pitcher for Valentine’s Day? Doesn’t offering someone the gift of pure water mean you care? —Filtered FabioIt’s one thing if you filled the pitcher with rosé or aromatherapy massage oil as part of a grand scheme. But water-water? Uh, no. No way. That’s more of a random Wednesday gift (which honestly, we’re not doing enough of). The best food gift on Valentine’s Day is a meal you make yourself (see menu below). Or a bucket of Maldon salt with a ring box nested inside.Illustration by Cari Vander YachtIs it more romantic to eat at a restaurant or cook at home? —Comparative ClariceMost restaurant Valentine’s Day dinners are a chaotic, corny disaster. Everyone’s so caught up in the fact that it’s Valentine’s Day—is that a Tony Bennett impersonator playing the Casio in the corner?—that you barely have time to make googly eyes with your sweetie. Whereas you can dine naked if you cook at home. I’d say a restaurant is more romantic than on the couch, but only by a crumb. A list of the most romantic places to eat on Valentine’s Day, in descending order:-Eating BYO pizza at your favorite dive-At the bar of a fancy restaurant (NOT table)-At home on the couch watching John Wick-In a booth at a well-worn diner at 3 p.m.-Taco Bell Cantina (the one with wine)-The dining car on an Amtrak train-Your mom’s houseWhat’s the most risk-free and relatively easy but impressive Valentine's Day dinner you can make? —Meek MarvinAppetizer: Old Amsterdam gouda, Mary’s Gone Crackers original flavorMain: Lamb meatballsSides: Roasted honeynut squash halves with brown butter and a ton of flaky salt, a simple saladDessert: McConnell’s mint chip ice cream (better than any mouthwash)Illustration by Cari Vander YachtAre aphrodisiacs real??? Are people eating oysters and bird nest’s soup and just going AT IT? Or is it a placebo effect? —Hot-and-bothered HortenseIllustrious sex therapist Dr. Ruth says no and I don’t take sex advice from anyone a day under 90.My spouse doesn’t like dealing with shells or cutting around bones when he eats, but I think it’s time to be an adult. What message does linguine with clams and a roast chicken send? —Communicative ColbyThe message you’re sending: “I used to think all of the quirky picky things about you were charming and special. Now I see you as you truly are, which is irrational, childish, and high-maintenance. A divorce is too much paperwork, so let’s just be petty and mean to each other for the next 37 years. I will never pick up your stewn-aside socks.” Is that what you wanted to hear???? Make soup, Colby. Make soup.Illustration by Cari Vander YachtIs it ever okay to pretend to get engaged at a restaurant for the free dessert or is that begging for bad karma? —Fatalistic FatimaIf you believe that marriage is a societal construct to blackmail you for health insurance, then the whole act is performance art and I can’t not respect that. If you’re merely hungry, buy the damn cheesecake yourself!What do you do if the restaurant tries to put you at the communal table? —Standoffish SorayaIntroduce yourself to everyone individually, giving your name and a fun fact about yourself. Assume the food is also communal and keep asking strangers to “pass the steak.” Stand up and say grace. Tell the waiter your “friend over there” is taking care of the bill. Or, I dunno, deal with it? No one’s asking you over for an orgy, unless of course, they are. You never know with the communal table.Illustration by Cari Vander YachtWhat’s the cutest food to eat on a date? The Olsen twins once said grapes are the ultimate cute food. —Adorable AdrianWow, way to quote So Little Time! The following foods are cute enough to eat on a date:-Mandarin oranges\n-Mickey Mouse pancakes\n-Chocolate-dipped strawberries from the sad person in the Godiva window\n-Sliders\n-Whole fish with the head on, awwww\n-Sure, grapesWe’ve been dating for three weeks. What are my Valentine’s Day obligations? —Non-committal NaomiAre you into it? Are they into it? If so, order takeout (rhymes with “make out” for a reason), and don’t talk about whether you’re exclusive or still married or wearing socks. You’re in the having-fun stage, so have fun! If you can’t tell if they’re into it, that’s too much pressure for me to handle. Make a plan for February 16 instead and go bowling and eat curly fries. Let love springeth forth on its own timeline.Are Turtles chocolates still the very best Valentine's Day candy ever? —Hyperbolic JavierHere’s my answer, in the form of a handy diagram...Can you address the issue of splitting the bill? My cousin is dating a guy who asks her to chip in and says he's “not an ATM.” They go to a lot of \"fancier\" restaurants and I think it adds up over time. —“Cousin” CaityHe “sounds like an ass.” But as much as I hate the ATM line, he’s right. The rules about men paying for dates are rooted in the only part of the patriarchy I don’t mind. But equality is equality. It’s 2020! Split the bill! Tip 25 percent! Push your own chair in! Unless someone’s feeling generous or has an expense account or it’s your birthday, that’s the way the world works. If the person you’re dating favors “restaurants you can’t afford,” you had better speak up before you’re in “credit card debt.” Don’t be ashamed of living within your means. Suggest a less expensive spot, cook at home (see menu above), or break up!Explore Bon AppétitIs It Ever OkayEtiquetteValentines DayRead MorecultureIs It Ever Okay…to Bring a Plus-One to the Office Holiday Party?By Alex BeggscultureIs It Ever Okay...To Reject a Relative’s Offer to Cook Something?By Alex BeggscultureIs It Ever Okay...to Eat Week-Old Crab Curry at Work?By Alex BeggscultureIs It Ever Okay…to Ask the Restaurant to Turn Down the Music?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-10", "author": ["Condé Nast", "Alex Beggs"]}