{"id": "c12b2b39feb993d8c2ebebe9a16cff23", "url": "https://www.bonappetit.com/recipe/molten-caramel-cakes", "year": 2019.0, "month": 2.0, "day": 2.0, "content": "Molten Caramel Cakes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMolten Caramel CakesBy Chris MoroccoFebruary 8, 20194.5(27)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintEverybody has heard of molten chocolate cake, so we thought we’d try to create a caramel version, with a toffee-ish tender cake encasing a runny dulce de leche center. Well, folks, it worked.IngredientsMakes 4Filling¼cup store-bought dulce de leche1Tbsp. unsalted butter, room temperatureCakes and Assembly⅔cup all-purpose flour1tsp. kosher salt¼tsp. baking powder6Tbsp. unsalted butter, plus more for ramekins, room temperature⅓cup sugar, plus more for ramekins¼cup store-bought dulce de leche2large eggs, room temperature½tsp. vanilla extractSpecial EquipmentFour 6–8-oz. ramekinsPreparationFillingStep 1Stir dulce de leche and butter in a small bowl until well combined. Dollop in 4 equal-size blobs on a metal baking dish or baking sheet. Freeze at least 30 minutes or up to overnight until very firm (the sugar will keep it from freezing completely solid).Cakes and AssemblyStep 2Preheat oven to 350°. Whisk flour, salt, and baking powder in a small bowl; set aside.Step 3Coat ramekins with butter in a thin, even layer, then coat with sugar, knocking out any excess.Step 4Using an electric mixer on medium-high speed (use the paddle attachment if you’re using a stand mixer), beat ⅓ cup sugar and 6 Tbsp. butter in a medium bowl until light and fluffy, about 4 minutes. Add dulce de leche and continue to beat until incorporated, about 1 minute. Beat in eggs, one at a time, until combined, followed by vanilla. Beat mixture on medium-high speed 1 minute (it might look slightly grainy and separated, and that’s okay!). Reduce mixer speed to low and beat in reserved dry ingredients until smooth.Step 5Divide batter among prepared ramekins. Make a small divot with a spoon in the top of each mound of batter. Place frozen filling onto divots, but do not press down into batter; you want the filling cradled by the batter but still on the surface, as it will sink to the center during baking. Place ramekins on a small rimmed baking sheet. Bake cakes until tops are browned, firm to the touch (be careful when checking as the filling may ooze out and it is very hot), and a tester inserted into the cakes, avoiding the liquid centers, comes out clean, 23–25 minutes.Step 6Invert cakes onto plates to serve. (If you invert the first cake and see slightly underdone batter—it will be tan against the filling’s dark brown color—keep remaining cakes in ramekins a couple minutes longer before unmolding. You can still eat the underdone one!)How would you rate Molten Caramel Cakes?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleMany readers made their own caramel. It’s easy to do and delicious. I wish you’d “.perfect” this recipe using homemade caramel. VeraBoston2/12/2022I won't rate this recipe because I may have messed up. I didn't have too much trouble with the dulce de leche sinking (although I used both homemade (pressure cooker condensed milk dulce de leche) and store-bought, and I think the store-bought melted better). However, my cake came out heavy, gluggy, no air in them, and thick. I definitely tried to get air into the cakes when I made them, so it could be that I over-beat the batter or that I made a triple batch of these for a party. Because the texture was so undesirable for me, I didn't like the cakes at all, but clearly others didn't have this problem. ElenaBrisbane, Australia6/28/2021Made this 3 times. The cake ALWAYS sticks to the ramekins no matter how much butter is used. AnonymousToronto Canada 3/16/2021This recipe is amazing, my absolute go-to-recipe. I added just a bit ground ginger, cinnamon and cardsmom at it made the cakes even more spectacular MalikaOslo, Norway 12/31/2020I made this and it was delicious! Nothing needed to be changed or adjusted! AnonymousGeorgia 8/12/2020Absolutely delicious! The cake itself was incredible, so moist, so fluffy, and with that subtle caramel taste that sets it apart from any other cake I've eaten. The dulce de Leche just took it to the next level! It did sink to the bottom, which probably could have been prevented by using a high quality dulce de Leche. Unfortunately my grocery store did not have any so I made my own from sweetened condensed milk which was so tasty.  JennaPowersChicago, IL5/20/2020Delicious, will make again! Unfortunately the caramel filling also didn't sink through the cake, and therefore pooled at the bottom - as suggested maybe it needed more freezing, or perhaps a very thin layer of cake batter to cover it? But otherwise very tasty.AnonymousAustralia4/12/2020Really like the flavor of these but the caramel did pool at the bottom of the ramekins for me. Maybe more batter in each ramekin and freezing the caramel for even longer would've helped? Sangvi98Atlanta, GA 3/15/2020w o w, wow, Wow, WOw, WOW. This was amazing! I \"borrowed\" my friend's kitchen aid and the batter took 10 minutes to make. Me n da bois do recommend freezing the dulce de leche a little longer but apart from that, this was one of the best recipe's I've tried out so far. YUM!Melissa TranSingapore3/4/2020OMG! This recipe was AMAZING! I made it as a treat for girls night and it went down a storm! I didn't have any store-bought dulce de leche so I made home made caramel and I loved it! Would recommend for anyone!!! Once again YUM YUM YUM!Jessica_BeeVietnam3/4/2020I didn’t have the right ramekins so I did a successful conversion: Double the recipe and it will bake up nicely in a 9” round cake pan. I heated the ingredients for the filling w a splash of cream, salt, and some ground ginger/cinnamon/cardamom and served it as a warm spiced salted caramel sauce and a dollop of unsweetened whipped cream. I also used salted butter for the cake and it came out aggressively salty, but in a pleasant way. I’d probably dial that back to 50/50 in the future.AnonymousSF, CA1/13/2020The dulce de leche filling sunk to the bottom of the ramekins and pooled on the bottoms of the cakes and ramekins. The cake itself is delicious, and the filling is, too, but I feel it would've been much better if the filling had been in the center. I may have under-filled my ramekins and not gotten enough batter, but I will definitely be trying it again, as they are still delicious. Good job Chris!AnonymousLouisville, KY8/3/2019Yum, yum, yum,  YUM, YUM!! so decadent and delicious! AnonymousLincoln,Nebrasky7/15/2019my first recipe with Bon Appétit and a definite success. Accidentally replaced regular with lightly salted butter and it was fine.Chicago, IL, USA5/28/2019I tried this recipe twice and I have to say... WOW! What an amazingly delicious yet simple dessert. I have a mom who loves carmel, so I surprised her by making these before she came home from work. The cake was soft and light and the carmel ran out just as I thought it would. Two thumbs up for this!BaileyMarieCincinnati, OH5/16/2019Explore Bon AppétitCakeDessertDulce de LecheOther IngredientsNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-02-08", "author": ["Condé Nast", "Chris Morocco"]}