{"id": "c132bd12c4446059dccaa96ba119484d", "url": "https://www.bonappetit.com/recipe/kimchi-melon-gazpacho", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Kimchi-Melon Gazpacho Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKimchi-Melon GazpachoBy Shilpa UskokovicAugust 9, 20213.7(6)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, food styling by Kat Boystova, Prop Styling by Allie WistEmailPinterestPrintEmailPinterestPrintIn high summer, when the New York City humidity feels oozy, like melted cheese on a patty, it’s icy jugs of this gazpacho that I crave. Spicy. Savory. Sweet. It’s all that and then some! Peak season melon, not unlike good tomatoes—juicy and tasting of the sun—is a logical supplement. Kimchi, full of sharp aromatics and a mild fizz, prevents the gazpacho from being too sweet. If you’re lucky enough to score some oi (cucumber) kimchi, sub that for the Napa cabbage. Cashews add a silky heft to the gazpacho with none of the stodginess that bread can sometimes bring. Cold mutes flavor, so season the gazpacho before chilling until it has the pucker of a salt and vinegar chip.—Shilpa UskokovicAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronBlender$32 At AmazonSieve$18 At AmazonLarge Bowl$18 At AmazonIngredients4 servings1lb. ripe red tomatoes, preferably heirloom or beefsteak, coarsely chopped1lb. cantaloupe or watermelon, rind and seeds removed, flesh coarsely chopped1cup Napa cabbage kimchi, plus more chopped for serving¼cup salted roasted cashews1medium Persian cucumber, coarsely chopped, plus more finely chopped for serving2tsp. Diamond Crystal or 1 tsp. Morton kosher salt, plus more3Tbsp. (or more) red wine vinegarSliced scallions and toasted sesame seed oil (for serving)PreparationStep 1Toss tomatoes, cantaloupe, kimchi, cashews, 1 cucumber, and 2 tsp. Diamond Crystal or 1 tsp. Morton kosher salt in a large bowl to combine. Let sit at room temperature 1 hour to let flavors meld and for salt to draw out moisture from the vegetables.Step 2Transfer tomato mixture along with any liquid to a blender. Purée on medium-high speed until smooth. Strain through a fine-mesh sieve into a bowl; add vinegar and chill until very cold, at least 1 hour and up to 8 hours.Step 3Taste gazpacho just before serving and season with more vinegar and/or salt if needed. Divide among bowls or glasses; top with scallions, chopped kimchi, and finely chopped cucumber and drizzle a little oil over.How would you rate Kimchi-Melon Gazpacho?Leave a ReviewTell us what you thinkExplore Bon AppétitCold SoupSoupSoups and StewsTomatoVegetableHeirloom TomatoCantaloupeMelonFruitWatermelonSummerEasyMainSideDairy-FreeGluten-FreeRawVeganVegetarianLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-09", "author": ["Condé Nast", "Shilpa Uskokovic"]}