{"id": "c14718dcd2d37a73fe8fc744916bfa5f", "url": "https://www.bonappetit.com/story/recipe-contest-rules", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Recipe Contest Rules | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingRecipe Contest RulesThese are the rules for the Bonappetit.com recipe contest.By Bon AppétitJanuary 31, 2018FacebookTwitterEmailFacebookTwitterEmail“Bon Appétit Recipe Contest” (the “Promotion”)\nOFFICIAL CONTEST RULESNO PURCHASE OR PAYMENT OF ANY KIND IS NECESSARY TO ENTER OR WIN THIS PROMOTION.A purchase will not improve chances of winning.CONSUMER DISCLOSURE\nYou have not yet won.OPEN ONLY TO LEGAL RESIDENTS OF THE 50 UNITED STATES AND DISTRICT OF COLUMBIA WHO ARE AT LEAST 18 YEARS OLD AS OF THE DATE OF ENTRYBy entering this Promotion, entrants accept and agree to be bound by these Official Rules.  Any violation of these rules may, at Sponsor’s discretion, result in disqualification.  All decisions of the judges regarding this Promotion are final and binding in all respects.PROMOTION PERIOD.  Promotion begins January 29, 2018, 3:01 PM EST and ends February 15, 2018, 10:00 PM EST, when all entries must be received (“Promotion Period”).ELIGIBILITY.  This Promotion is only open to legal residents of the 50 United States and District of Columbia who are at least 18 years old as of the date of entry, except officers, directors, members, and employees of the Sponsor, the judging organization (if applicable), or any other party associated with the development or administration of this Promotion, and the immediate family (i.e., parents, children, siblings, spouse), and persons residing in the same household, as such individuals. This Promotion is void outside the 50 United States and the District of Columbia, and where prohibited.HOW TO ENTER.  Visit www https://www.bonappetit.com/story/original-recipe-contest during the Promotion Period and follow the instructions to complete and submit the entry form. You must include up to two original recipes (“Submission”). Entrants represent and warrant that their Submission is the original work of such entrant, it has not been copied from others, and it does not violate the rights of any other person or entity.  Entrant further represents and warrants that their Submission adheres to the fundamental spirit of the Promotion and does not contain any defamatory, obscene or otherwise unlawful matter or depict anyone engaged in any illegal, immoral or lewd act, any violent or pornographic material or contain any other inappropriate content (as determined by Sponsor).  Limit: One entry per person and one entry per e-mail address during the Promotion Period.  All entrant information, including e-mail addresses, is subject to the respective Privacy Policy of the applicable Sponsor.WINNER SELECTION AND NOTIFICATION.  All entries will be judged on or about February 20, 2018, (the “Judging Date”) by a panel of judges comprised of Bon Appétit food and web department members. The judges will score entries based on the following criteria: quality (33%), originality (33%), and alignment with brand values (34%).  The entry with highest overall score will be declared the potential winner (in the event of a tie, the entry with the higher score in the alignment with brand values criteria will prevail). Any potential winner will be notified by mail, email and/or telephone.  If a potential winner: (i) cannot be contacted; (ii) does not respond within five (5) days from the date the Sponsor first tries to notify him/her; (iii) fails to return the Affidavit and Release as specified in Rule 9; (iv) refuses the prize; and/or (v) the prize or prize notification is returned as undeliverable, such potential winner forfeits all rights to win the Promotion or receive the prize, and an alternate potential winner may be selected.  Upon contacting a potential winner and determining that he/she has met all eligibility requirements of the Promotion, including without limitation the execution of required waivers, publicity and liability releases and disclaimers, and, at Sponsor’s discretion, successful completion of a background check, such individual will be declared the “winner” of the Promotion.PRIZE DESCRIPTION.  There will be up to five (5) winners.  The prizes is publication of Submission, in part or in whole, on bonappetit.com.  The approximate retail value of the prizes are $0.TAXES.  All federal, state and/or local income and other taxes, if any, are the winner’s sole responsibility.OWNERSHIP AND LICENSE.  All entry materials become the property of the Sponsor and will not be acknowledged or returned.  The copyright in any Submission shall remain the property of the entrant, but entry into this Promotion constitutes entrant’s irrevocable and perpetual permission and consent, without further compensation, with or without attribution, to use, reproduce, print, publish, transmit, distribute, sell, perform, adapt, enhance, or display such Submission, and the entrant’s name and/or likeness, for any purpose, including but not limited to editorial, advertising, trade, commercial, and publicity purposes by the Sponsor and/or others authorized by the Sponsor, in any and all media now in existence or hereinafter created, throughout the world, for the duration or the copyright in the Submission.  Sponsor and/or others authorized by the Sponsor shall have the right to edit, adapt, and modify the Submission.NO PRIZE TRANSFER OR SUBSTITUTION. No prize or any portion thereof is transferable or redeemable for cash.  No substitutions for prize except by Sponsor, in which case a prize of equal or greater value will be substituted.CONSENT AND RELEASE.  By entering the Promotion, each entrant releases and discharges the Sponsor, judging organization (if applicable), and any other party associated with the development or administration of this Promotion, their parent, subsidiary, and affiliated entities, and each of their respective officers, directors, members, shareholders, employees, independent contractors, agents, representatives, successors and assigns (collectively, “Sponsor Entities”), from any and all liability whatsoever in connection with this Promotion, including without limitation legal claims, costs, injuries, losses or damages, demands or actions of any kind (including without limitation personal injuries, death, damage to, loss or destruction or property, rights of publicity or privacy, defamation, or portrayal in a false light) (collectively, “Claims”).  Except where prohibited: (i) entry into the Promotion constitutes the consent of each entrant, without further compensation, to use his/her name, likeness, biographical data, contact information and his/her Submission for editorial, advertising, marketing, publicity, and administrative purposes by the Sponsor and/or others authorized by the Sponsor; (ii) acceptance of a prize constitutes a release by any winner of the Sponsor Entities of any and all Claims in connection with the administration of this Promotion and the use, misuse, or possession of his/her Submission or any prize; (iii) any potential winner may be required to sign an affidavit of eligibility (including social security number) and a liability/publicity/copyright release; and (iv) if prize involves travel or activities, any potential winner and travel companion (if applicable) may be required to execute releases of the Sponsor from any and all liability with respect to participation in such travel/activities and/or use of the prize.  Fully-executed affidavits and releases must be received by Sponsor within five (5) days from the date that Sponsor first tries to notify the potential winner. Sponsor may conduct a background check to confirm any potential winner’s eligibility and compliance with these rules.  By entering, you agree to cooperate reasonably with any such background check. If the prize includes participation in any public event(s) or publicity, or if Sponsor Entities intend to publicize the winner in any way, and if a background check reveals that a potential winner has engaged in conduct that could damage the reputation or business of any Sponsor Entity, as determined by Sponsor in its discretion, the potential winner may be disqualified and the prize may be awarded to an alternate winner.    If winner is deemed to be a minor under the jurisdiction of his/her residence, the prize will be awarded in the name of his/her parent or legal guardian who must execute the necessary affidavit and release and, if applicable, must accompany winner on the trip (no additional travel expenses will be awarded should a parent or legal guardian be required to accompany the winner on the trip).DISCLAIMERS.  (i) Sponsor not responsible for entries that are lost, late, misdirected, incorrect, garbled, or incompletely received, for any reason, including by reason of hardware, software, browser, or network failure, malfunction, congestion, or incompatibility at Sponsor’s servers or elsewhere.  In the event of a dispute, entries will be deemed submitted by the authorized account holder of the e-mail address submitted at the time of entry.  “Authorized account holder” is defined as the natural person who is assigned to an e-mail address by an Internet Access Provider, online service provider, or other organization (e.g., business, educational institute) that is responsible for assigning e-mail addresses for the domain associated with the submitted e-mail address.  (ii) Sponsor, in its sole discretion, reserves the right to disqualify any person tampering with the entry process or the operation of the web site or otherwise attempting to undermine the legitimate operation of the Promotion.  Use of bots or other automated process to enter is prohibited and may result in disqualification at the sole discretion of Sponsor.  (iii) Sponsor further reserves the right to cancel, terminate or modify the Promotion if it is not capable of completion as planned, including by reason of infection by computer virus, bugs, tampering, unauthorized intervention, force majeure or technical failures of any sort.  (iv) Sponsor Entities are not responsible for errors in the administration or fulfillment of this Promotion, including without limitation mechanical, human, printing, distribution or production errors, and may cancel, terminate or modify this Promotion based upon such error at its sole discretion without liability.  In no event will Sponsor be responsible for awarding more than the number of prizes specified in these rules.  (v) In the event this Promotion is cancelled or terminated, pursuant to subparagraph (iii) or (iv), Sponsor, in its sole discretion, may elect to select a winner from among all eligible entries received up to the date of discontinuance for any or all of the prizes offered herein.  (vi) SPONSOR ENTITIES MAKE NO WARRANTIES, REPRESENTATIONS OR GUARANTEES, EXPRESS OR IMPLIED, IN FACT OR IN LAW, AS REGARDS THIS PROMOTION OR THE MERCHANTABILITY, QUALITY OR FITNESS FOR A PARTICULAR PURPOSE REGARDING ANY PRIZE OR ANY COMPONENT OF ANY PRIZE.  (vii) CAUTION: ANY ATTEMPT BY AN ENTRANT TO DELIBERATELY DAMAGE THE WEBSITE OR UNDERMINE THE LEGITIMATE OPERATION OF THIS PROMOTION MAY BE A VIOLATION OF CRIMINAL AND/OR CIVIL LAWS, AND SHOULD SUCH AN ATTEMPT BE MADE, SPONSOR RESERVES THE RIGHT TO SEEK REMEDIES AND DAMAGES (INCLUDING WITHOUT LIMITATION ATTORNEYS’ FEES) FROM ANY SUCH ENTRANT TO THE FULLEST EXTENT OF THE LAW, INCLUDING CRIMINAL PROSECUTION. (viii) The value(s) of the prize(s) set forth above represent Sponsor’s good faith determination of the approximate retail value(s) thereof; the actual fair market value(s) as ultimately determined by Sponsor are final and binding and cannot be challenged or appealed.  In the event the stated approximate retail value(s) of a prize is more than the actual fair market value of that prize, the difference will not be awarded in cash or otherwise.  No substitution or compensation will be given for any portion of the prize that is not used.APPLICABLE LAWS AND JURISDICTION.  This Promotion is subject to all applicable federal, state, and local laws and regulations.  If any court of law, having the jurisdiction to decide on this matter, rules that any provision of these Official Rules is invalid or unenforceable, then that provision will be removed from the Official Rules without affecting the rest of the Terms. The remaining provisions of these Official Rules will continue to be valid and enforceable.  Issues concerning the construction, validity, interpretation and enforceability of these Official Rules shall be governed by the laws of the State of New York, without regard to any principles of conflict of laws.  All disputes arising out of or connected with this Promotion will be resolved individually, and without resort to class action, exclusively by a state or federal court located in New York, New York.  Should there be a conflict between the laws of the State of New York and any other laws, the conflict will be resolved in favor of the laws of the State of New York.  To the extent permitted by applicable law, all judgments or awards shall be limited to actual out-of-pocket damages (excluding attorneys’ fees) associated with participation in this Promotion and shall not include any indirect, punitive, incidental and/or consequential damages.WINNER LIST.  For a list containing the name(s) of the winner(s), send a self-addressed stamped envelope, within six (6) months of the Judging Date, to:  Winner List, “Bon Appétit  Recipe Contest,” Bon Appétit , Condé Nast, 1 World Trade Center, New York, NY, 10007.SPONSORSHIP.  This Promotion is sponsored by Condé Nast, 1 World Trade Center, New York, NY, 10007 (individually and collectively, the “Sponsor”).Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-31", "author": ["Condé Nast", "Bon Appétit"]}