{"id": "c155a39527364960a3f918702a0e1482", "url": "https://www.bonappetit.com/story/six-degrees-of-chicken-cutlet", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Six Degrees of Chicken Cutlet: A Dish-by-Dish Explainer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSix Degrees of Chicken Cutlet: A Dish-by-Dish ExplainerHow many ways can you possibly cook a pounded-thin piece of chicken breast? Well, as any self-respecting red sauce menu will tell you, the answer is…a lot.By Amiel StanekApril 16, 2019FacebookTwitterEmailPhoto by Christina HolmesFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.The chicken cutlet is the stem cell of the red sauce kitchen: The stuff of life itself, a base protein that can, depending on how you cook it and sauce it, morph into a seemingly boundless array of codified, canonical Italian-American dishes. Marsala. Milanese. Francese. But what does it all mean? What distinguishes chicken Parmigiana from piccata? With the help of the fine folks at Detroit’s iconic Amore da Roma, we break it down.Photo by Christina HolmesMilaneseThe ur-cutlet, simplicity at its finest: a crisp slab of breaded and pan-fried chicken breast, no sauce in sight, maybe a wedge of lemon or tuft of dressed arugula riding sidesaddle. (For your own good, don’t call it schnitzel.)Photo by Christina HolmesParmigianaMilanese—but make it fashion. Crunchy cutlets gilded with a thin layer of marinara and a flurry of grated Parmesan (and, in the case of most Italian-American joints, a heavy sprinkle of mozzarella), then broiled to bubbly perfection. It doesn’t get much more iconic than this, folks.Photo by Christina HolmesPiccataLess crunchy, more saucy. No breadcrumbs this time: slices of chicken get dredged in seasoned flour, sautéed in butter, and smothered in an addictively tangy butter-lemon-caper pan sauce. (Find our recipe for it here.)Photo by Christina HolmesFranceseAlso known as “Chicken French,” this sauce is similar to piccata (sans capers), but is distinct for its decidedly un-crisp texture—he cutlets are dipped in wet batter rather that dredged in bread crumbs, resulting in an eggy, almost puffy exterior. (The resulting soggy deliciousness is exactly the reason why chef Tyler Kord is wholly obsessed with it.)Photo by Christina HolmesMarsalaLightly floured, sautéed, and served in a rich, silky pan sauce composed of butter, onions, caramelized mushrooms, and plenty of marsala, the sherry-esque fortified wine from coastal Sicily.Photo by Christina HolmesSaltimboccaThe name literally translates to “jumps in the mouth”…for whatever reason. Cutlets are pounded out, then layered with sage leaves and prosciutto slices and (sometimes, but not always) rolled into tidy little packages before being dredged in flour and sautéed. (Here’s a recipe we love from the team behind Cervo’s and Hart’s.)Amiel Stanek is the editor of Basically.Explore Bon AppétitCutletRestaurantsItalian AmericanRed SauceRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Amiel Stanek"]}