{"id": "c15effbf83ae51aa5aaeedea2d2c4999", "url": "https://www.bonappetit.com/story/best-food-books", "year": 2021.0, "month": 12.0, "day": 1.0, "content": "15 Food Books to Gift Everyone on Your List That Aren't Cookbooks | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping15 Must-Read Food Novels to Gift Everyone on Your ListTantalizing food scenes, saucy characters, and page-turning plots.By Jenna Adrian-DiazDecember 3, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Dropping temps? Tragically short days? It must be holiday season! And while there’s nothing quite like the first crackle of a wood fire, or sipping a mug of fragrant mulled wine (by said fire), the greatest wintertime extravagance, for me, is cozying up with a stack of food books so transportive I forget all about the long-winded politics talk happening downstairs. Sure, cookbooks are an obvious and fine choice to gift the aspiring chefs in your life. But instead of giving your people instruction, fiction gives them escape. Whether you’re buying for a whodunnit fan, a literary-head, or yourself (no shame in that game), we’ve got a novel for everyone on your list. Read on for all the food books (new and old) that BA staffers loved this year. And don’t forget the adult sippy cup for that mulled wine (nobody likes a stained chaise lounge).For the cousin who’d really rather be at the MoMA:A thrilling debut novel from Alexandra Andrews, Who is Maud Dixon? will delight the artful jet-setter in your life with descriptive depictions of design, architecture, food, and drinks. Main character Florence Darrow partakes in dangerous liaisons over wine and cocktails in New York City dive bars and boutique hotels, develops an obsession with her boss, tries to master the art of a perfectly roasted chicken in an upstate farmhouse cottage, and dines on tantalizing fresh jams and brioches (then seafood and cheap beer) as she travels through Morocco. It’s an exquisite page-turner that any avid traveler would devour on a long-haul flight (or a layover on the couch). —Jenna Adrian-Diaz, assistant to the editor in chiefWho is Maud Dixon?$28 $21 at AmazonFor the person wondering why they ever left New York City:From the very first minute—there’s a meet-cute involving a spilled coffee and a girl who smells like pancakes—Casey McQuiston had me hooked on One Last Stop, her truly excellent sophomore novel. In it, two women meet on the NYC subway and fall for each other, and, of course, high jinks ensue (as in, real high jinks: there’s a heist scene, some literal time travel, and a main character who simply cannot get off the Q train). The beauty of this book is in the quietly intricate plot and the lovely dialogue, but also in how real the settings are. McQuiston romanticizes the subway, a feat in and of itself, and brings to life Pancake Billy’s House of Pancakes, the diner that serves as a character as well as a location. Between shifts at the diner, legendary Su Special sandwiches, late-night drag brunch fundraisers, and the queer community at the heart of it all, this novel keeps food at the center of a stunning love story. —Sonia Chopra, executive editorOne Last Stop$11 at AmazonFor the one whose love language is cooking a seven-course banquet:Banana Yoshimoto’s Kitchen traffics in all the stickiest feelings—like grief and gratitude and love. The story follows an orphaned young woman, the cooking assistant named Mikage, who is taken under the wing of Yuichi, a younger acquaintance of her recently deceased grandmother, and Eriko, Yuichi’s mom. All of Yoshimoto’s characters are coping with loss and loneliness in their own ways, but for Mikage, the only way out is through food. True to its title, the book’s meals and cooking scenes are gorgeously detailed, imagining kitchens as fantastical spaces where it’s possible to let other people eat the feelings we don’t know how to share. —Nico Avalle, production assistantKitchen$16 $14 at AmazonFor the grown-up Bold Type stans:A vision of 1950s suburban London, Clare Chambers’s Small Pleasures follows local journalist Jean Swinney—jaded in life and in love—who’s going on 40 and still living with her needy mother. Life is pretty droll, that is, until a tip from a woman claiming her daughter was born of a virgin birth sends Jean down a winding road, one that stops abruptly at a fork: Is this a miracle or a fraud? Throughout the novel, food is used to signal class, a device that cleverly juxtaposes Jean’s life—one of postwar austerity, limited options, and colorless meals like cauliflower cheese, tinned pears, and rice pudding—with the seemingly fabulous virgin mother, who sews custom dresses and bakes luxurious German pastries (from scratch, obviously) in her pretty home. Throw a complicated love triangle in there, and you’ve got the ideal recipe for days lost to the couch. —Ali Francis, associate editorSmall Pleasures$14 at AmazonFor the femme fatales in your life:Francesca Ekwuyasi’s 2020 debut novel, Butter Honey Pig Bread, is an honest celebration of the complexities of modern womanhood. Alternating between the lives of Kambirinachi and her estranged daughters, Taiye and Kehinde, the plot follows these beautiful and headstrong Nigerian women as they work to repair their relationships with one another, and with themselves. Using food as a central tool for self-exploration, connection, and reconciliation, Ekwuyasi brilliantly maps out and uplifts the resilient bonds between mothers, daughters, and sisters. —Chala Tyson Tshitundu, assistant editorButter Honey Pig Bread$20 $18 at AmazonFor the francophile who knows the difference between pét-nat and Champagne (and ain’t afraid to tell ya):Inseparable, by Simone de Beauvoir, is a heartbreaking and beautiful coming of age story for the capital-R reader in your life. It’s an autofictional recounting of the most significant relationship in Beauvoir’s life: the one with her childhood best friend, Élizabeth “Zaza” Lacoin. Throughout the book, Sylvie and Andrée (Beauvoir and Zaza’s aliases) find solace from the constraints of womanhood in 1920s and ’30s France in moments shared over food: rum-soaked cherries, hazelnuts and figs, and countryside picnics resplendent with preserved goose meat and improbable quantities of wine. Speaking from experience, this read is best enjoyed over a truffle grilled cheese and a glass of extra-brut Champagne. —J.A.D.Inseparable: A Never-Before-Published Novel$27 $18 at AmazonFor people whose yearly Spotify recap is full of Adele:In Dolly Aldterton’s Ghosts, likeable 30-year-old food writer Nina Dean gets stood up numerous times by a Very Lame Dude—but that’s not what haunts her most. With friendships morphing, lovers retreating, and her father disappearing slowly into dementia, it’s in the kitchen that Nina tries to find her footing. A delicious, heart-wrenching coming-of-age tale peppered with tender insights into family, memory, and the relationships we hold dear—most of all the one with ourselves. —A.F.Ghosts$27 $20 at AmazonFor the friend whose flight tracker is perma set to Miami:Marlowe Granados’s Happy Hour isn’t so much about following a plot as it is about lingering in the blissful freedom of youth. Best friends in their early 20s, Isa and Gala come to New York City for a summer with no money and no goals—other than to have a great time. The duo make the city theirs, snagging invites to parties with celebrities, Wagyu-filled dinners, free cocktails, and designer dresses. Though in reality, summer—especially summer in New York City—is stickier and harder than they could have imagined. Cozy up: Happy Hour is 224 pages of straight vibes. —Bettina Makalintal, associate editorHappy Hour$20 $17 at AmazonFor the gourmand who loves a whodunnit:Louise Penny’s entire best-selling Inspector Gamache collection (start with Still Life) is peppered with the most luxurious, delicious food scenes. The French Canadian characters, which include the famous detective and his neighbors (such as an old poet with a pet duck named Rosa) are tucked away in the Quebec village of Three Pines, and they eat and drink so well that the publisher Macmillan put out a cookbook based on the meals in the books. It’s nice, when you’re solving a complex and grisly murder mystery, to have a break to eat succulent coq au vin, sip brandy, and tear into countless croissants—the characters almost exclusively eat in front of roaring fireplaces. If I had to write an English paper about it, I’d say the rich comfort food often represents the simple pleasures of living, which are always on the line when murder’s afoot. —Alex Beggs, senior staff writerStill Life$18 $10 at AmazonFor the sibling who wants to “be a writer” when they grow up:Readers of Lily King’s other works will know her writing to be an emotional gut punch, and Writers & Lovers is no exception. Casey Kasem, a server at a white-tablecloth restaurant in Harvard Square, dreams of finishing the novel she’s been working on for six years. Instead, she finds her creativity stymied by a fog of grief and financial anxiety. Passion, desire, and the potential of a happy future with two very different men break through the metaphorical haze, but really, it’s the protagonist’s relationship with her sense of self that is the most substantial development. King’s prose will tug at your heartstrings, but there are plenty of clandestine bites enjoyed in the kitchen between waiting tables to warm the mood. —J.A.D.Writers & Lovers$27 $14 at AmazonFor the risqué reader:On the cover of Melissa Broder’s Milk Fed is a bright pink breast, which kinda sets the tone for the book. Raised on calorie-counting, Los Angeles 20-something Rachel has a bad relationship with food and with her mom. But when she meets a woman at a frozen yogurt shop, she longs to be fed by her, cared for by her, and…well, you get the point. Over tortuous cups of fro-yo and awkward dinners, Milk Fed explores how that which nourishes us can also drain us. With detailed descriptions of eating disorders and sexualized mommy issues, Milk Fed is not for everyone—maybe read it on Kindle if you don’t want to scare great-aunt Mary off her mash. —B.M.Milk Fed$26 $17 at AmazonFor the family misfit:Sayaka Murata’s quietly moving debut novel, Convenience Store Woman, stars 36-year-old Keiko Furukura—a charmingly awkward retail assistant who’s never really found her place in the world, nor in Tokyo, where she lives in a starkly decorated apartment. But on the days she goes to work at “Smile Mart,” a neighborhood bodega-type store in Hiiromachi, she discovers a sense of peace and purpose. Despite the seemingly mundane tasks—manning the cash register, restocking all the (drool-worthy) Japanese snacks, and upholding the store’s stringent manual fastidiously—she’s happy. Only her family aren’t, steadily pushing her toward normality—and drastic action. This 163-page paperback is a strange, brilliant, and bite-size look at all the forces pressuring us to conform. —A.F.Convenience Store Woman$16 $11 at AmazonFor the one who only ever wants to watch Bridesmaids:Who among us has not pretended to know more about wine than we actually do? Oh yes, of course I love Gewurtz…mumble, mumble. Lizzy Dent’s The Summer Job draws that all-too-familiar experience into a soul-soothing delight. Protagonist Birdy Finch finds herself in the awkward position of having to impersonate her sommelier best friend for a summer. What Birdy thought was a run-down, rural dive bar is actually a high-end destination with over 100 wines to memorize, bottles of Champagne to deftly uncork, and, of course, a handsome, talented chef to woo. When you can’t choose between the many rom-coms on the many streaming services, reach for The Summer Job to get a similarly wholesome dose of fluff. —B.M.The Summer Job$16 $10 at AmazonFor the romaniac:Clocking in at just under 180 pages, Nora Ephron’s Heartburn is quick, great fun, and, like a slice of Key lime pie, good for the soul. Seven months into her second pregnancy, cookbook author Rachel Samstat makes a tragic discovery: Her husband, Mark, is having an affair with another woman. She alternates between wanting him back, wishing him dead, and wanting him back...dead. Along the way, she shares comfort food recipes like pot roast, linguine alla cecca, peach pie, and cheesecake. And if you’re on an audiobook kick like me, consider listening to the novel. Meryl Streep, who starred in the 1986 movie adaptation, is a piercing narrator. —Esra Erol, senior social media managerHeartburn$16 $10 at AmazonFor the steam kween:If you’re looking to curl up with a cup of hot cocoa (read: a glass of wine) and disappear for a few steamy hours, then pick up Laura Esquivel’s 1989 classic, Like Water for Chocolate. Full of recipes, curses, and love affairs, it’s very easy to devour in one sitting. The story focuses on Tita, a young girl searching for love while she works as the family cook on a ranch where she lives with her mother and sisters. She channels all her emotions into her food, unintentionally impacting everyone around her. Things get pretty hot and heavy along the way, and every chapter ends with one of Tita’s recipes, in case you want to try your hand at seducing some of your own lovers. —Olivia Quintana, associate social media managerLike Water for Chocolate$17 $11 at AmazonFrom book-books to cookbooks: The Cookbook Gift Guide That Covers EVERYONE You Know: 2021 EditionThe year’s best cookbooks also make the best presents.View StoryExplore Bon AppétitCultureShoppingBooksGift GuidesRead MoreshoppingThe Cookbook Gift Guide That Covers EVERYONE You Know: 2021 EditionBy Alex BeggsshoppingThe Ultimate Bon Appétit Gift Guide For Every Food Person You KnowBy MacKenzie Chung Feganshopping16 Cooking Gifts for Kids That Go Beyond the Easy-Bake OvenBy Tiffany HopkinsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-12-03", "author": ["Condé Nast", "Jenna Adrian-Diaz"]}