{"id": "c16783e3b2d6dc124e3e495fd7cde176", "url": "https://www.bonappetit.com/story/cheddar-cheese-crackers-taste-test", "year": 2018.0, "month": 2.0, "day": 1.0, "content": "A Definitive Ranking of Cheddar Cheese Crackers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Definitive Ranking of Cheddar Cheese CrackersCheese Louise, there are a lot of options out there. We tasted 11 brands to crown the ultimate cheddar snack.By Alyse WhitneyFebruary 1, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThere's something instantly nostalgic about a cheddar cheese cracker. As kids, they were the surprise treat in our lunch boxes, and now they're the perfect salty snack to get through a long day at the office. Even though there is one brand that we associate most with cheese crackers—it... rhymes with Schmeez Schmidts—there are at least 10 more on grocery store shelves waiting to be eaten by the handful.For the good of the people, Bon Appétit staffers did just that, sampling 11 different types of cheddar cheese crackers to crown the winner. We measured in highly scientific terms, like \"Does this fit your platonic ideal of a cheese cracker?\" and \"Could you eat an entire box in one sitting?\" Salt levels and cheesiness were also studied—but scoring an \"A\" in our book wasn't about modest, balanced flavor. We wanted extreme cheese, salt, crunch, and addictive craveability that made us want to eat them by the handful. (We each drank a gallon of water afterward.) Here's how they stacked up.Photo by Chelsie Craig11. Milton's Gluten-FreeWe unfairly compared this to non-gluten-free crackers for the sake of the test, but the problem wasn't so much the texture. They were pleasantly \"puffy\" but \"tasted stale even though the bag was freshly opened.\" A film of \"dusty\" cheese powder coating the surface was what made it the lowest-ranked cracker.10. Snyder's Wholey CheeseSnyder's makes great pretzels, but these cheese-wedge-shaped \"crackers\" almost immediately shattered into shards, and were more like a baked chip in texture. They were also heavily coated in an artificial tasting powder we couldn't get over.9. Blue Diamond Cheddar Cheese Almond Nut ThinsThese were too \"greasy and salty,\" so most people \"wouldn't want to eat more than a few.\" The cheese dust didn't exactly incorporate with the cracker, either, so it was a layer of cheese on top of an almond cracker. There was also a \"dried herb taste\" that will give you \"SUPER ONION BREATH,\" so not pure cheddar regardless. A little odd.8. Stauffer's Cheddar WhalesWhales may be bigger than fish, but these crackers were \"a bland copycat of that other cracker from the ocean,\" and not as much crunch as we'd like. One taster commented that it \"forms a paste in your mouth if you eat too many at once.\"7. Cheese NipsThe crowd was divided on this one, because the flavor was slightly \"bitter\" and it had \"inferior cheddar flavor.\" Something was off with that cheddar. Texture was the ultimate demerit. The Nips weren't sturdy enough, falling apart because of awkward softness or breaking into fragile, sharp pieces. \"Hay-like texture and garbage cheese flavor,\" noted one taster.6. Annie's Cheddar Bunnies\"The bunnies are adorable but the cheese flavor is too weak,\" one taster said, and almost everyone agreed with them. WE WANT MORE CHEESE, PLEASE! \"These are the kind of snack I would mindlessly eat A LOT of. Not the absolute best, but I would finish the box,\" added another editor. Inoffensive with a sliiiight \"plastic bag aftertaste,\" but not worthy of the top five.5. Back to NatureThese are the healthier-branded version of Cheez-Its. They have a nice crunch and a subtle cheese flavor; the lack of salt and greasiness (a good thing sometimes) made it feel too healthy and not a lot of people went back for seconds. They were \"surprisingly tasty\" to some, and the \"light and crisp\" texture was a nice addition. However, the lack of salt didn't satisfy the craving for an irresistable, crunchy snack we expect in a cheese cracker.4. Better CheddarsBetter Cheddars are the forgotten cracker of the '80s and '90s. Yes, they still exist, much to the surprise of almost every taster. \"I forgot about these, but they were my childhood!\" one taster wrote. \"A little too crumbly but melt-in-your-mouth good. So easy to GO. TO. TOWN.\" That odd texture was off-putting to some, because it was \"too soft\" and also \"kind of like cardboard.\" But average scores put these ahead of many in flavor and addictive-ness.3. Cheez-It GroovesThese new-wave grooved Cheez-Its are supposed to have the cheesy flavor of a Cheez-It with the \"thin and crispness of a chip\" (according to the official description.) They nearly tore the BA squad apart. \"I don't need my Cheez-Its to taste like corduroy,\" said one taster who was not getting into the groove of the crunchier, striped-textured cracker. Some boycotted a change to the OG, while others welcomed the new member of the Cheez-It fam. They had an amplified cheesiness—possibly from more powder ingrained into the larger, thinner crackers—and have \"ranch dressing quality that is so f—king good!\"2. GoldfishThe \"ideal saltiness\" and \"subtle cheesiness\" made an entire bag of Goldfish disappear the day of the tasting, and people were visibly distraught when they were gone. \"I'd let a school of Goldfish swim into my mouth\" was by far the most excited quote. \"They smile at you! That's dope,\" added another. They have a very specific type of crunch because they are little fish filled with air. They kind of stuck to the roof of our mouths, but in a way that made everyone happy. \"Don't mess with Goldfish—they're the best.\" Well, almost.1. Cheez-ItsLike taking \"a break\" from your high school sweetheart to make sure there's no one better out there, we had to try 10 other crackers to make sure Cheez-Its were our No. 1. We should never have strayed—they are the perfect cracker. Super salty (ideal), a good balance of artificial to real cheese flavor, and a crunch that just won't quit. If Cheez-Its had a yearbook, this is what we would have signed:• \"The king of snacks! Would 100 percent bring Cheez-Its on a desert island—dehydration be damned!\"• \"I have spent a loooong time thinking about my platonic ideal of a cheese cracker, and this is my Sistine Chapel. Amen.\"• \"I would marry a Cheez-It.\"• \"The crunch and cheese are so pleasant the Catholic church should consider a new holy wafer. They already have holes and everything!\"• \"Please put a GIF from Love Actually here. (You got it!)Buy a 12-pack of Cheez-Its for $4.50 on AmazonOr you can make your own slice-and-bake cheese crackers:Explore Bon AppétitCheeseCrackerSnackTaste TestShoppingRead MorecultureHow to Pair Cheese with Cheese Crackers for Double the CheeseBy Tia KeenancultureThis New Ritz Cracker-Chip Is Dangerously GoodBy Alyse WhitneycultureA Definitive Ranking of Thomas' English Muffin FlavorsBy Alyse WhitneycultureA Definitive Ranking of 23 Bonne Maman FlavorsBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-02-01", "author": ["Condé Nast", "Alyse Whitney"]}