{"id": "c16ee58fa73c41e450e0161648cbbcd3", "url": "https://www.bonappetit.com/story/salt-fat-acid-heat-netflix-series", "year": 2018.0, "month": 10.0, "day": 2.0, "content": "'Salt, Fat, Acid, Heat' Is the New Netflix Series That's Very Much Worth Your Time | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture‘Salt, Fat, Acid, Heat’ Is the New Netflix Series That's Very Much Worth Your TimeHost, chef, and cookbook author Samin Nosrat unlocks the basic tenets of cooking. But in a really non-stuffy way!By Carey PolisOctober 10, 2018FacebookTwitterEmailSalt Fat Acid HeatNetflixFacebookTwitterEmailChef and writer Samin Nosrat is one of those instantly likable people. Watch five minutes of her new Netflix show (out October 11) and you’ll want her to be your personal cooking guru, or, at the very least, your friend. She’s relatable, approachable, and her food is never too precious (see: these recipes she created for this very magazine). This is immediately clear from her cookbook, also called Salt, Fat, Acid, Heat, a permanent fixture on many bookshelves in the Bon Appétit offices.“My secret weapon... is letting bits of humanity creep through,” Nosrat tells me by phone. She feels like most food shows fall into two camps: the highly produced, cinematic, aspirational shows like Chefs’ Table; and the stand and stir, you-can-do-it studio shows. Nosrat sought to find the white space between the two. “What I didn't see, and what I didn't understand why I didn’t see, was why there couldn't be something that was beautiful and cinematic yet accessible.” Thus, Salt, Fat, Acid, Heat was born: a four episode series that aims to show home cooks that beautiful is also within their reach.In the show, Nosrat travels to one locale per episode (Japan=salt, Italy=fat, Mexico=acid, her home in Berkeley=heat) to take a deep dive into what she sees as one of the four core elements of cooking. She visits all types of food professionals, from artisanal soy sauce producers to talented Mexican home cooks to seek stories of people that are often skipped over in mainstream food media coverage. “I wanted to show the kinds of people who I didn't see ever in other food television. Whenever possible, going deeper in the Google results to look for a woman, to look for a person of color, to look for a home cook,” she says. “It wasn't always the most obvious person. It wasn't always the easiest person to locate, but those were things I knew I wanted to push for.”And it works. The group of people that Nosrat features feel like a very large extension of her family—she learns from them, she messes up with them (“those are the moments that people will relate to and I believe will really empower them”), she eats with them. Food TV should move a bit more this direction—toward the people that we don't already know about, toward their passions and knowledge—and Nosrat is the right person to lead the charge.Check out an exclusive clip of Salt, Fat, Acid, Heat below, and watch the full series starting October 11:ContentThis content can also be viewed on the site it originates from.Want more? Buy the Salt, Fat, Acid, Heat cookbook.All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-10", "author": ["Condé Nast", "Carey Polis"]}