{"id": "c17ce12c1c6aaf2b2febd1861103121c", "url": "https://www.bonappetit.com/recipe/shredded-daikon-salad", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Daikon Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueShredded Daikon SaladBy Lisa Cheng SmithNovember 19, 20195.0(2)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Lillian Chou, prop styling by Beatrice ChastkaEmailPinterestPrintEmailPinterestPrintThis salad is palate-cleansing and refreshing. A little spicy, a little tart—and you can prep it in advance. The thinner you slice the daikon, the better it will absorb the flavor of the dressing. This recipe is from Taiwanese-American cook Lisa Cheng Smith’s spectacular Lunar New Year feast. Find the rest of her menu here.Ingredients8 regular or 16 small servings1large daikon (about 1 lb.), peeled, thinly sliced into 3\"-long matchsticks¾tsp. kosher salt, divided1red finger or Fresno chile, seeds removed, finely chopped2garlic cloves, finely chopped2Tbsp. toasted sesame oil2Tbsp. unseasoned rice vinegar1Tbsp. granulated sugar½–1tsp. store-bought or homemade chile crisp (optional)Toasted white and/or black sesame seeds (for serving)PreparationStep 1Toss daikon and ½ tsp. salt in a medium bowl; let sit 30 minutes. Transfer to a dish towel and squeeze out excess moisture.Step 2Meanwhile, whisk chile, garlic, oil, vinegar, sugar, and remaining ¼ tsp. salt in a large bowl and let sit 30 minutes.Step 3Add daikon to bowl and massage dressing into daikon. Let sit at least 30 minutes and up to 6 hours (cover and chill if holding longer than 1 hour).Step 4To serve, stir in desired amount of chile crisp if using and top with sesame seeds.How would you rate Shredded Daikon Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleThis salad is AWESOME, made just as listed and it is a favorite.AnonymousCA4/26/2020Explore Bon AppétitSaladChineseEast AsianAsianTaiwaneseDaikonVegetableEasySideVeganDairy-FreeVegetarianKetoHealthyishLunar New YearDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast", "Lisa Cheng Smith"]}