{"id": "c17e6dba76985d41bef9600d1b18efb6", "url": "https://www.bonappetit.com/recipe/strip-steak-with-blistered-beans-and-tomatoes", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Grilled Strip Steak with Blistered Tomatoes Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesJune 2018 IssueGrilled Strip Steak with Blistered Tomatoes and Green BeansBy Andy BaraghaniMay 22, 20184.7(3)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonEmailPinterestPrintEmailPinterestPrintFor this grilled strip steak recipe, cooking half the tomatoes in a skillet placed on the grill lets you capture all their juices and turn them into a saucy condiment for the meat.Ingredients4 servings1½lb. runner beans, green beans, and/or haricots verts, trimmed9Tbsp. extra-virgin olive oil, divided, plus moreKosher salt3cups Sun Gold tomatoes, divided31\"–1½\"-thick strip steaks (about 2¼ lb.), patted dry2Tbsp. smoked paprika1Fresno chile, very thinly sliced1large shallot, thinly sliced into rounds, rinsed1garlic clove, finely grated3Tbsp. red wine vinegar1½cups coarsely torn basilPreparationStep 1Prepare a grill for medium-high heat. Toss beans with 2 Tbsp. oil in a large bowl; season with salt. Place beans on grill and cook, turning occasionally, until tender and lightly charred, 6–8 minutes.Step 2Meanwhile, place a small skillet on grill; pour in 2 Tbsp. oil. Cook half of tomatoes, shaking skillet occasionally, until beginning to burst, about 3 minutes.Step 3Oil grate. Season steaks with salt and coat with paprika, packing on more if needed. Drizzle with 2 Tbsp. oil. Grill steaks until lightly charred and an instant-read thermometer inserted into the thickest part registers 120°, about 4 minutes per side for medium-rare. Transfer to a cutting board and let rest 10 minutes before slicing against the grain.Step 4Halve remaining tomatoes and toss with chile, shallot, garlic, vinegar, grilled tomatoes, grilled beans, and 3 Tbsp. oil in a large bowl. Add basil, season with salt, and toss again. Combine steak and tomato mixture on a platter; drizzle with oil.How would you rate Grilled Strip Steak with Blistered Tomatoes and Green Beans?Leave a ReviewTell us what you thinkExplore Bon AppétitSteakBeefMeatCherry TomatoTomatoVegetableGreen BeanBasilHerbs & SpicesSummerEasyWeeknight MealsQuickMainDairy-FreeGluten-FreeNut-FreeHealthyishGrillingFourth Of JulyMemorial DayLabor DayDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-22", "author": ["Condé Nast", "Andy Baraghani"]}