{"id": "c183dde3ee3f49c1c01f4c88a2b85173", "url": "https://www.bonappetit.com/city-guides/new-york/venue/gold-star-beer-counter", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Gold Star Beer Counter Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginnew yorkGold Star Beer CounterChoose your own beer adventure in Prospect HeightsFacebookPinterestTwitterEmailAlex Lau GO HERE: for the most thoughtfully curated beer bar in Brooklyn. There isn’t a craft bar that matches Gold Star’s service, selection, and general enthusiasm for beer in the borough. Co-owner and bartender Joshua van Horn will most likely be slinging beers when you’re there, happy to run through the tap list from top to bottom. The beer rules. The people rule. The record collection rules. And the stadium-style bar seating rules, too.ORDER THE: beer. Duh. Gold Star keeps 16 beers on tap, ranging from spontaneously fermented ales to unfiltered lagers to fruity sours to juicy IPAs. It doesn’t matter what type of beer you like, Gold Star will have something that you’ll happily order again. And if you need something to anchor all those brews, Gold Star has a small food menu. The standout is the salami picante sandwich, a beautiful sub layered with spicy salami, ham, provolone, lettuce, and onions, and slathered with tangy olive tapenade and creamy sub sauce. This sandwich rules.WORD TO THE WISE: Gold Star’s tap list is always impressive, but their list of bottles and cans should not be overlooked. They sit on the shelves and can be taken to go or consumed on premises. Gold Star stocks some incredible bottles of rare American and European beers, so make sure to ask whoever’s behind the bar what they’re digging.THE VIBE IS: airy, natural, and not-so-craft-beer-ish (no battered wood tables, bro-y posters). Gold Star is great any night of the week, but grabbing a seat on a warm weekend afternoon, when the front door is propped open and light streams in from the high windows, leaves you feeling like you’ve stepped into the living room of a Danish architect who has a thing for vintage Americana.PRACTICAL STUFF: Open every day: Sunday to Thursday, from noon to midnight, and Friday and Saturday, from noon to 1:00 a.m. A $3 corkage fee is added to any bottle or can consumed on the premises.—Alex DelanyWE ALSO LOVEBemelmans BarFlawless cocktails in a flawless Upper East Side roomOlmstedA Brooklyn neighborhood restaurant that’s unlike any other Brooklyn neighborhood restaurantBar GotoSublime cocktails and elevated bar snacks on the Lower East Side? We’re inExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-06-26", "author": ["Alex Delany"]}