{"id": "c18996114435aeeee6584b1f5b974d5c", "url": "https://www.bonappetit.com/story/hawaij-spice", "year": 2018.0, "month": 11.0, "day": 4.0, "content": "Hawaij Spice Is the Warming Spice Blend I'll Take Over Pumpkin Spice Any Day | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Warming Spice Blend I'll Take Over Pumpkin Spice Any DaySweet hawaij is cozy, fragrant, and the perfect addition to winter beverages, baking, and more.By Rachel MyersonNovember 26, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailLast month, I tried my first pumpkin spice latte (I’m not an alien, just British). Actually, it was half of a PSL, because I was defeated by its cloying sweetness before I could finish. Suffice to say I won’t be ordering another any time soon, but it did make me think about—and crave—pumpkin spice’s punchier, less basic cousin: hawaij.Pronounced “hu-why-adge,\" hawaij refers to two, distinct Yemenite spice blends, one sweet and one savory. Hawaij means “mixture” in Arabic and has long been a staple in the Yemenite-Jewish kitchen where the savory version—a blend of cumin, coriander, turmeric, black pepper, and cardamom—is used most often for soup. But it’s the sweet one, coined “hawaij for coffee,” that I’ve found to be the perfect spice for winter sipping, baking, and more.This hawaij blend is one of my favorites.\nPhoto by Chelsie CraigMuch like my first cigarette, the first time I tried hawaij (in coffee, the traditional way) involved acting cool while stifling the need to cough. Only instead of a rugged bartender, I was trying to impress a balding seventy-year-old Yemenite man named Shlomo, a coffee shop owner in Tel Aviv’s Yemenite Quarter.Ginger and cardamom are always front and center in this warming, heady mix which, more often than not, features cinnamon, cloves and nutmeg. Some blends, like Raw Spice Bar’s, include fennel for a flicker of anise. All Spice Emporium’s mix stands out with its cheeky addition of tangerine zest, which I’m not mad at, and its colourful packaging would make a great stocking filler. Trusty Pereg hits all the right notes with this classic mix which will stand the test of time.If you’re all about authenticity, hawaij for coffee should be brewed with or served on top of, yes, a strong cup of coffee, but it would also make a great addition to lattes or a mug of hot chocolate for a toasty kick. If you’re willing to totally depart from tradition, it would make an excellent addition to baked goods, either combined with sugar to be sprinkled on snickerdoodle cookies, folded into gingerbread dough, or mixed into a frosting to be dolloped generously on top of a carrot cake. It also works wonderfully in savory dishes like slow-cooked stews—a sweeter alternative to ras el hanout.Go ahead and get creative, just don’t tell Shlomo. And if he asks, you didn’t hear it from me.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyishSpicepumpkin spice latteMiddle EasternShoppingRead MoreLifestyle12 Essential Middle Eastern Ingredients and Where to Buy Them OnlineGallery12 SlidesBy Andy BaraghaniRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-11-26", "author": ["Condé Nast", "Rachel Myerson"]}