{"id": "c19f71d6f341a72f8eb0f106988b270c", "url": "https://www.bonappetit.com/recipe/mushroom-sloppy", "year": 2021.0, "month": 4.0, "day": 3.0, "content": "Vegan Sloppy Joe Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2021 IssueMushroom SloppyBy Justin LeeApril 20, 20213.9(39)Read ReviewsTriangleEmailPinterestPrintPhotograph by Frank Frances, food styling by Lillian Chou, prop styling by Sophia PappasEmailPinterestPrintEmailPinterestPrint“This dish is our riff on Vanessa’s Dumpling House sesame pancake with Sichuan beef sauce,” says Justin Lee, chef and owner of Fat Choy in New York City. “A sandwich I’ve eaten so much that by now I’m likely made up of 10 percent sesame pancake.” This at-home version of Fat Choy’s mouthwatering vegan mushroom sloppy swaps scratch-made sesame pancakes with English muffins to save on kitchen cleanup time.Ingredients6 ServingsMushroom Sloppy6oz. button mushrooms6oz. shiitake mushrooms7oz. smoked or firm tofu (half a 14-oz. package), drained, cut into 1\"–2\" pieces1medium onion, cut into a few large pieces¼cup plus 3 Tbsp. vegetable oil5garlic cloves, finely chopped¼cup gochujang (Korean hot pepper paste)1tsp. five-spice powder½tsp. ground cumin3Tbsp. Shaoxing wine (Chinese rice wine) or medium-dry sherry2Tbsp. vegetarian mushroom oyster sauce (such as Lee Kum Kee)Kosher  saltassembly2Tbsp. vegetable oil1tsp. toasted sesame oil6English muffins, split2scallions, thinly sliced½cup coarsely chopped cilantro1Tbsp. toasted sesame seedsPreparationmushroom sloppyStep 1Working in batches, pulse button and shiitake mushrooms in a food processor until finely chopped. Transfer to a medium bowl.Step 2Working in batches, pulse tofu in food processor until pea-size. Transfer to a small bowl.Step 3Pulse onion in food processor until very finely chopped. Transfer to another small bowl.Step 4Heat ¼ cup oil in a large pot over medium. Cook mushrooms, stirring occasionally, until browned and shrunken by about one third, 8–10 minutes. Transfer mushrooms back to their bowl. Wipe out pot.Step 5Heat remaining 3 Tbsp. oil in pot over medium. Add onion and garlic and cook, stirring occasionally, until onion is tender and browned around the edges, 8–10 minutes.Step 6Add gochujang, five-spice, cumin, and tofu to pot and cook, stirring, until tofu and onion are coated, about 2 minutes. Pour in wine and cook just until alcohol smell has burned off, about 1 minute. Add oyster sauce and 4 cups water and return mushrooms to pot. Partially cover pot and cook mushroom mixture until mixture is thickened and very soft and silky, 50–65 minutes. Remove from heat and season with salt.AssemblyStep 7Whisk vegetable oil and sesame oil in a small bowl to combine, then brush cut sides of each English muffin with oil mixture.Step 8Heat a large nonstick skillet over medium-high. Cook English muffins, cut sides down, until golden brown underneath, about 1 minute. Transfer to plates, arranging cut side up.Step 9Spoon some mushroom mixture onto bottom halves of English muffins (you may have a bit extra) and top with scallions, cilantro, and sesame seeds. Close up sandwiches.How would you rate Mushroom Sloppy?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleI was so excited to try this recipe.  \nThan I saw the tofu!  Not a fan. \nCould I just use more mushrooms instead?\n\nI love sloppy Joe’s, but try to avoid beef if I can help it plus trying to eat more veggies but don’t want to give up yet on this mushroom sloppy Joe meal. \n\nThanks for any suggestions! AnonymousSeattle, WA10/17/2021Pretty good, not sure I'm dying to make this again though. I wish there was a bit more variety as far as texture goes, everything is very... soft. I get that it's a plant-based option for a sloppy joe, but... Anyways! Flavors were good and I like the choice of a english muffin as the vehicle. I also had it on sourdough. No issues with the amount of water like some, but it did take some time to reduce. Just be patient!Emma MTallahassee, FL10/16/2021I used a lot of the advice other reviewers submitted (reduce the water, add ketchup, top with sesame mayo). One extra thing I substituted was garam masala and fennel seeds for the five-spice since I couldn't find any at my local store. Holy wow did this turn out amazing! The texture was more velvety than traditional sloppy joe, but I loved it nonetheless. And this recipe has sparked a new love for gochujang. I am definitely going to make this again!ConniePhoenix, AZ8/2/2021So loved the flavors, but as reviewers before me you definitely should not do 4 cups of water! I did not read the reviews so I sadly did not see. I doubled the recipe and used 6 cups of water. After an hour of reducing I strained the liquid and reduced and we kinda used as a gravy. It definitely took a good amount of time to prepare this from start to finish. It’s not an easy weeknight meal without some prep. I would definitely try again. Jcapobia California 7/20/2021Y'all I didn't even serve this the night I made it, because it just looked so wet and unappetizing. We ate leftover pizza and didn't muster up the courage to try our mushroom sloppies until the next day. But I'm here to tell you they were absolutely delicious and I WILL be putting this recipe in my regular rotation. Like other reviewers I didn't add 4 cups of water---just shy of 2 cups was plenty---and I added several healthy squirts of ketchup which really brought the flavors together and imparted that old school sloppy-joe flavor. I served it with raw red onion and a little bit of mayo on my English muffins. My very carnivorous partner gave his stamp of approval too!  Side note, like another reviewer I tried to rate this 4 stars and the site mysteriously insists on saving it as a 5-star review.....LaurenAtlanta, GA6/28/2021Okay so, I'm glad I paid attention to the reviews and the recipe before I got started. With a few tweaks, it turned out great. 1.)  Do NOT add 4 cups of water. The ingredients are already so moist, I don't understand what purpose that would serve except for sloppy soup. 1.5 cups were plenty. 2.) I love gochujang (and all the other ingredients in this) but it cannot fully substitute for ketchup in a sloppy joe recipe, especially when there are no other ingredients to add that sweet tang. Upon tasting it was really missing that. Add some hefty squeezes of Heinz and a few dashes of worcestershire. 3.) This is a little unorthodox, but I made a quick sesame mayo instead of spreading oil on the bun (that just didn't seem appetizing with sloppy topping). It really helped add some flavor depth. \n\nSo anyway, long review, but quick fixes. In the end it was very pleasant. \n\nP.S. The other reviewer is right that any ratings are automatically getting upped to five stars. A suspicious glitch. I love you BA but come on, do better. CJSan Diego, CA6/18/2021I LOVE this recipie! I wasn't so sure when I was cooking it... but after it boiled down enough and it got more \"sloppy\"  it became just right. I used toasted dinner rolls instead of English muffins and was very pleased with the taste and texture!AnonymousLA6/17/20212 STAR \nThis doesn't work.  :(\n\nI was excited both about the idea of trying new flavors (I had a great time buying new ingredients at the asian market), and the idea that this was going to be a vegan meal to impress meat eaters, but I was disappointed.\n\nI read the reviews critiquing the texture so I added tofu and mushrooms that were less pulverized, but in the end I don't know why the ingredients are so smooshed to begin with, unless it's an attempt at making this recipe easier for the home cook.\n\nThis recipe took more than 2 hours start to finish, so presumably some chef-y techniques were removed to ensure that it didn't take even longer.\n\nI used all ingredients as listed except that I reduced the water by 1 cup (it was still a bit wet after an hour of cooking) and served it with toasted Japanese milk buns.  \n\nThe flavor was  complex and interesting, but it didn't suit our tastes.  After 2 hours in the kitchen, I was relieved (and a bit surprised) that my family ate it.  We also found that because this looks like hot and sour soup, we kept expecting a different flavor.\n\nPS:  Served this with the smashed cucumber salad which was a little better, but I was surprised that we didn't like it so much more than our usual version ( Tahini, lemon, soy and pepper flakes) considering the number of ingredients.  \nPPS:  As I write this, it appears that BA has taken my 2 star rating as 5 stars.  I hope that's just a glitch.  This is a 2 star recipe.  \nPPS: Having just watched the Top Chef \"Portlandia\" where chefs are challenged to turn their ideas into recipes for home cooks, I am sympathetic to the chef and would love to try this dish at his restaurant to find out what it tastes like when his team makes it!EveSan Diego, CA5/31/2021Really good! I'm doing a Vegan week and this recipe was an awesome start. The four cups of water seemed like too much. I cooked it with the top slightly off for 50 minutes and so much water remained. I eventually turned the heat up and took the top off and cooked for another 30 minutes at least. Eventually it cooked down. Spicy and good good flavor! Bridget GChicago, IL5/12/2021I don't particularly like mushrooms and the primary reason I made this was because my mother likes mushrooms, but it was great! I loved the flavors and the texture. My family isn't huge on hot spices so I took a risk and used the same amount of tomato paste in place of the gochujang (which I'm sure did alter the taste) and I just used basic $4 dry sherry because it's what I could find. It seemed too runny and thin after the 50 minutes or so but as I turned off the burner it thickened up enough to be eaten just like a sandwich. The english muffin was perfect because I think a bun would've detracted from the taste and become soggy. I think the firmness and is it chewiness maybe of the english muffin really complemented the consistency and protected the flavor. I will definitely be making this again and have already shared the recipe with some friends. R. ZacharyFairmont, WV4/29/2021I make A LOT, and I mean A LOT of BA recipes, and I am really surprised at how bad this was. The texture is absolutely gross. Pure mush. I understand that it was not mean to be a \"true\" sloppy joe, but rather, an Asian version, but despite this, it was in no way reminiscent of a sloppy joe. It was bordering inedible. So sad I wasted good mushrooms on this. AnonymousQueens, NY4/28/2021The mushroom mix was good but the english muffin got lost. I didn't really feel they complimented each other well and felt that the english muffin was just filler carbs. Will not make again. AnonymousVictoria, BC, Canada4/26/2021Explore Bon AppétitSandwichMushroomVegetableTofuOther IngredientsMainVeganVegetarianDairy-FreeNut-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-20", "author": ["Condé Nast", "Justin Lee"]}