{"id": "c1abb763ecf92f850e54a817d46c2f7c", "url": "https://www.bonappetit.com/story/anthony-bourdain-dead", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "Anthony Bourdain Is Dead at 61 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAnthony Bourdain Is Dead at 61The CNN host, author, and father died by suicide in France.By Bon AppétitJune 8, 2018FacebookTwitterEmailIsaac Brekken/StringerFacebookTwitterEmailIf you are having thoughts of suicide, please call the National Suicide Prevention Lifeline, at 1-800-273-talk (8255), or the Suicide Crisis Line, at 1-800-784-2433, or text 741741.We’re devastated to report that Anthony Bourdain was found dead on Friday in France, where he was filming Parts Unknown. CNN confirmed the cause of Bourdain’s death was suicide. Chef Eric Ripert, a close friend who traveled with Bourdain often, found him unresponsive in his hotel room Friday morning. His influence and mark on the food, travel, and journalism community was extraordinary, inspiring a generation of writers, cooks, and explorers. His bestselling memoir, Kitchen Confidential, told the story of his days cooking at Les Halles, a wild behind-the-scenes look at the restaurant industry in New York. His career launched into broadcast, where he hosted travel shows for over 15 years on the Food Network, Travel Channel, and finally CNN.In a 2016 interview with Bon Appétit, Bourdain shared some travel tips, tinged with his signature attitude and unrestrained honesty. To embrace a new culture, he advised: “Just be open. Don’t be afraid. If it’s appropriate to drink alcohol, drink heavily. Be smart, but be open to the world.”CNN’s full statement: “It is with extraordinary sadness we can confirm the death of our friend and colleague, Anthony Bourdain. His love of great adventure, new friends, fine food and drink and the remarkable stories of the world made him a unique storyteller. His talents never ceased to amaze us and we will miss him very much. Our thoughts and prayers are with his daughter and family at this incredibly difficult time.”In 2012, Bourdain shared some family photos with Bon Appétit and wrote an essay about his father.\nPhoto courtesy of the Bourdain familyHow Anthony Bourdain Came to Be Anthony BourdainAnthony Bourdain grew up to be one of the world's most adventurous (and opinionated) eaters. Here, he credits his father for the man he became.View StoryOn social media, chefs, writers, celebrities, and friends of Bourdain are remembering him. Chef Eric Ripert remembers his best friend fondly:Instagram contentThis content can also be viewed on the site it originates from.Chef David Chang, who collaborated with Bourdain on Mind of a Chef and other series, shared a Will Oldham quote on Instagram:Instagram contentThis content can also be viewed on the site it originates from.Barack Obama shared his memory:Twitter contentThis content can also be viewed on the site it originates from.Chef Gordon Ramsay spoke on how inspiring Bourdain was:Twitter contentThis content can also be viewed on the site it originates from.Chef Angela Dimayuga shared how Bourdain was a mentor and incredible supporter:Instagram contentThis content can also be viewed on the site it originates from.Chef Andy Ricker posted memories from filming together:Instagram contentThis content can also be viewed on the site it originates from.As did Chef Yottam Ottolenghi:Instagram contentThis content can also be viewed on the site it originates from.Jake Tapper was one of his many CNN colleagues to talk about Bourdain’s generosity:Twitter contentThis content can also be viewed on the site it originates from.CNN contributor Ana Navarro recalled his text recommendations:Twitter contentThis content can also be viewed on the site it originates from.Pete Souza, former Chief Official White House Photographer, shared an image of President Obama and Bourdain:Instagram contentThis content can also be viewed on the site it originates from.Chef Andrew Zimmern paid tribute to his friend by wearing his boots:Instagram contentThis content can also be viewed on the site it originates from.Chrissy Teigen called Bourdain her “hero”:Twitter contentThis content can also be viewed on the site it originates from.Chef Dominique Ansel remembered Bourdain as a “brilliant storyteller”:Instagram contentThis content can also be viewed on the site it originates from.Eric Asimov, New York Times’ wine critic, commented on Bourdain’s cultural influence:Twitter contentThis content can also be viewed on the site it originates from.Punch deputy editor Jason Diamond shared a favorite Parts Unknown moment:Twitter contentThis content can also be viewed on the site it originates from.Chef Stephanie Izard remembered the first time she met Bourdain on Top Chef:Instagram contentThis content can also be viewed on the site it originates from.Chef Daniela Soto-Innes shared a favorite Bourdain quote:Instagram contentThis content can also be viewed on the site it originates from.Retired astronaut Scott Kelly recalled watching Bourdain in space:Twitter contentThis content can also be viewed on the site it originates from.Chef Marcus Samuelsson encouraged others to seek help:Instagram contentThis content can also be viewed on the site it originates from.Neil deGrasse Tyson shared a memory of Bourdain on his podcast:Twitter contentThis content can also be viewed on the site it originates from.Lin-Manuel Miranda shared how Bourdain helped shape his eating habits:Twitter contentThis content can also be viewed on the site it originates from.Actress Busy Philipps remembered Bourdain’s humor:Instagram contentThis content can also be viewed on the site it originates from.Former Gourmet editor-in-chief Ruth Reichl remembers Bourdain's individuality:Twitter contentThis content can also be viewed on the site it originates from.Chef José Andrés remarks on Bourdain's spirit:Twitter contentThis content can also be viewed on the site it originates from.This post will be continually updated throughout the day.Explore Bon AppétitAnthony BourdainRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-08", "author": ["Condé Nast", "Bon Appétit"]}