{"id": "c1abe93c3fa8ccf81bb2980b2fcf5bd3", "url": "https://www.bonappetit.com/story/how-to-make-aioli", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "How to Make Aioli From Store-Bought Mayonnaise  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingI Cook for a Living and Even I Make Aioli From Store-Bought MayoI'd make a 12-layer cake and I'd deep-fry on a weeknight, but you won't find me making aioli from scratch. By Sohla El-WayllyNovember 21, 2019FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Pearl JonesFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.My brand is to make things harder for myself. I carry too many things at once, I volunteer to make a 12-layer cake no one asked for, and I do all my mixing with a tiny spatula. But there is one shortcut I will always take: fancying up a jar of store-bought mayonnaise rather than making aioli from scratch.Ultimately, mayonnaise and aioli are brothers from the same mother. Both are emulsions of oil and water, which just means that the two incompatible liquids are brought together with the help of a third party stabilizer to create something thicker, creamier, and richer than before. Originally, aioli referred to the emulsion of garlic and olive oil, but today the term aioli has come to mean “fancy” mayo. Aioli is jazzy, showy, and a downright attention hog next to chill and classic mayo.Sure, making homemade aioli is not so bad. All you need is to mix an egg or yolk with lemon juice and garlic, then slowly drizzle in oil while whisking like there’s no tomorrow, before finally bedazzling with your choice of mix-ins. But while the homemade stuff may give you ultimate control and adaptability, you need to crack an egg and make at least one cup, or even two if you’re like me and prefer the spread thick and luscious. And since homemade mayo only has a shelf life of about a week, it’s guaranteed to self-destruct before my little household (two humans, three animals) can eat it up.Which is all to say that when I’m looking for a couple dollops of something creamy and fatty to round out a dish, I’d rather add some flair to a store-bought jar than make my own. This allows me to mix up just what I need, without breaking any eggs or pulling a muscle whisking up a storm. The simplest version I make is nothing more than a clove of grated garlic and a squeeze of fresh lemon juice stirred into mayo, but here’s what I do when I’m feeling especially fancy:The Marlboro ManIn a small saucepan, I warm up a couple tablespoons of olive oil before adding smoked paprika and grated garlic. The spice blooms in the oil, opening up its aromatics, while the garlic mellows out. I cool the spiced oil off a touch before stirring into mayonnaise. It’s smoky, it’s spicy, it’s the perfect mayo to serve alongside grilled meats while wearing a cowboy hat.Golden BoyI start by steeping a pinch of saffron in a splash of hot water. Meanwhile, I’ll whisk grated garlic and lemon juice into a couple spoonfuls of mayo before stirring in the saffron tea. This floral and aromatic mayo can class up any plate of seafood, from shellfish-studded paella to Wednesday-night fish sticks, but I like it best with french fries.Something’s FishyI grind a sheet of toasted nori into a fine powder and stir it into mayo along with a minced anchovy or a teeny squeeze of anchovy paste. The nori adds a subtle brininess while the anchovies bring the funk. This mayo is a powerhouse of flavor and all you need to turn a simple bowl of rice and vegetables into a satisfying meal. I hate to use the phrase “umami bomb,” but that’s just what it is.The Red-EyeI know this one—my hack of the coffee-spiked mayo that’s served alongside country ham at Momofuku—sounds crazy, but give it a whirl. I start by dissolving a teaspoon of instant coffee into a splash of sherry vinegar before whisking the potent brew into mayo. The bitter coffee cuts through the rich mayonnaise and adds a nutty, chocolate-y flavor, turning your ham sandwich up a few notches and waking up any breakfast plate.Goes well with aioli:Fideos With Chicken Thighs and KaleWith a crispy, toasted top hiding saucy, tomato-y noodles, this one-skillet broken spaghetti dish is anything but one-note.View RecipeExplore Bon AppétitIt's That SimpleAioliMayonnaiseRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-21", "author": ["Condé Nast", "Sohla El-Waylly"]}