{"id": "c1b7dfc5f030a37402a2478f69d68fbf", "url": "https://www.bonappetit.com/story/marrow-detroit-sandwiches", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "Marrow's Secret Sandwiches Beat All Other Lunch Options | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsSecret Sandwiches Beat All Other Lunch OptionsMarrow only makes 10 sandwiches a day, so if you’re in Detroit, snag one.By Alex BeggsJuly 31, 2019FacebookTwitterEmailPhoto by Michelle GerardFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.It’s mystery meat in the best possible way. At Marrow in Detroit, a butcher shop by day, restaurant by night, butcher Nicholas Ponte and his team sell low-key sandwiches for lunch—first come, first get. And they only make 10 a day! They’re not advertised on any menu or blasted on social media. Instead, you can find them wrapped in butcher paper around noon, tucked into a refrigerated case to the left of the bar, by the pâtés and fancy butters and cans of pop. They use whatever they need to move: smoked ham, housemade mortadella and salami, roast beef, spicy pickle-y condiments, and anything else that’ll minimize the restaurant’s food waste. (They also make a few vegetarian sandwiches, which might have marinated tempeh, kimchi, green onions, and sunflower butter (pictured top left)!).On a recent afternoon, I got the last sandwich of the day. The sturdy bread from Zingerman’s was insulated with mayo that escaped through the bread’s holes. (A sandwich with too much mayo is a sandwich with the right amount of mayo.) Inside, thinly sliced smoked ham was stacked like a crowd pushing butt-to-back through the turnstiles of a free Seger concert. Big leaves of spinach served their healthful, crispy purpose. The pickled chiles were spicy, sweet, and tangy. At $12, you get this huge sandwich, easily shareable. A sandwich from Marrow is one of the best takeaway lunches in town, especially if you add a bag of Great Lakes salt and vinegar chips and a can of Vernors.Tag yourself—I’m the layer of yellow chiles.\nPhoto by Michelle GerardBut you’re not done yet. You’re here, aren’t you? You cannot leave that butcher shop without a souvenir, so I’ll highly recommend the butterkase-filled kielbasa called käsekrainer. That’s a smoked sausage with a melty, creamy German cheese as buttery as its name suggests—the sausage equivalent of a Juicy Lucy. You want it. You need it. But first, sandwiches.Go there: MarrowExplore Bon AppétitHighly RecommendDetroitSandwichRead MorerestaurantsAn Adult-Sized Hangover Calls for the XL Breakfast Sandwich at Philly’s Hungry PigeonBy Emily SchultzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-31", "author": ["Condé Nast", "Alex Beggs"]}