{"id": "c1c8aba22e46e0f94fb3630d0bb8eaad", "url": "https://www.bonappetit.com/recipe/turmeric-eggs-with-kale-yogurt-and-bacon", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Turmeric Fried Eggs Breakfast Bowl Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueTurmeric Fried Eggs with Kale, Yogurt, and BaconBy Chris MoroccoJanuary 9, 20184.4(16)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintBreakfast bowls shouldn’t take 2 hours to make; this one is ready in about 20 minutes. Add roasted sweet potato or cooked grains to make it even more hearty.Ingredients4 servings4slices bacon1bunch curly kale, ribs and stems removed, leaves torn into large pieces5tablespoons extra-virgin olive oil, dividedKosher salt1cup plain Greek yogurt4large eggs½teaspoon ground turmericUrfa pepper or other mild red pepper flakes and lime wedges (for serving)PreparationStep 1Place a rack in middle of oven and preheat to 375°. Bake bacon on a foil-lined rimmed baking sheet until brown and crisp, 12–15 minutes. Tear into large pieces; reserve fat for another use.Step 2Meanwhile, spread out kale on a rimmed baking sheet and drizzle with 2 Tbsp. oil. Massage leaves with oil and season with salt. Bake, tossing halfway through, until lightly browned around edges and crisp-tender, 5–7 minutes.Step 3Season yogurt with salt. Divide among plates and top with bacon and kale.Step 4Heat remaining 3 Tbsp. oil in a large nonstick skillet over medium-high. Add eggs one at a time, shaking skillet between additions to keep them from sticking together. Cook, tilting skillet toward you and spooning oil over egg whites until whites are set, about 2 minutes. Remove skillet from heat, keeping skillet tilted, and add turmeric to oil. Baste egg whites with turmeric oil.Step 5Divide eggs among plates and drizzle turmeric oil over. Sprinkle with red pepper flakes and squeeze limes over.How would you rate Turmeric Fried Eggs with Kale, Yogurt, and Bacon?Leave a ReviewTell us what you thinkReviews (6)Back to TopTriangleeasy and delicious!  a great way to add some kale into a meal.  \nteritNew York, NY, United States11/4/2021We just made this for dinner. It was fantastic. Super easy and absolutely delicious! We will for sure be making this again.AnikaLos Angeles, CA1/5/2021This is the easiest to make \"gourmet\" breakfast dish ever! Nailed it the first time and mom and both kids loved it, so huge hit for mother's day! Definitely going in the rotation.LachlanGADecatur GA5/13/2018This has become my new favorite savoury breakfast. I make it whenever I have a little extra time on the weekend and feel like treating myself. I just love the variety of flavours and textures packed into this dish. \nSide note: If I scale down the recipe for just myself I can usually roast the Kale and bacon on the same pan,taking the Kale out earlier.\nThe so-called 'superfoods' like Kale and Turmeric blend in seamlessly, making this recipe kind of a no-brainer. kelseynish8762Calgary,CA4/16/2018Hey anonymous, it's in the \"fourth paragraph\" - \"keeping skillet tilted, add tumeric to oil...\"\n\nBon appetit. Seems super simple, and super yummy! Can't wait to try. Breakfast is my favourite meal.blondieiam11/13/2018Directions appear incomplete - no directions for making \"turmeric oil\".Anonymous1/13/2018Explore Bon AppétitTurmericHerbs & SpicesEggKaleLeafy GreensVegetableBaconCured MeatMeatYogurtOther IngredientsQuickEasyGluten-FreeNut-FreeKetoHealthyishBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Chris Morocco"]}