{"id": "c1c8766dfe9f84711412387a21bf609f", "url": "https://www.bonappetit.com/recipe/sesame-caesar-salad", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Sesame Caesar Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSesame Caesar SaladBy Andy BaraghaniNovember 12, 20194.3(11)Read ReviewsTriangleEmailPinterestPrintPhoto by Emma Fishman, Food Styling by Kay BoytsovaEmailPinterestPrintEmailPinterestPrintSwapping tahini for the mayonnaise that you typically see in classic Caesar salads keeps things creamy but adds nutty earthiness to the tangy mustard and funk from Parmesan cheese.Ingredients4 servings2oil-packed anchovy fillets, chopped1small garlic clove, chopped1lemon, halved3Tbsp. tahini2tsp. Dijon mustard3Tbsp. grapeseed, sunflower, or vegetable oil3Tbsp. finely grated Parmesan, plus more for servingKosher salt, freshly ground pepper4heads of Little Gem lettuce or 2 romaine hearts, trimmed, leaves separated1Asian pear, halved, cored, thinly sliced1tsp. toasted sesame seedsPreparationStep 1Mound anchovies and garlic on a cutting board. Using the side of a chef’s knife, mash together until a smooth paste forms.Step 2Transfer paste to a large bowl and squeeze in juice from 1 lemon half (about 2 Tbsp.). Whisk in tahini, mustard, and 2 Tbsp. water. Gradually whisk in oil until dressing is thick and glossy. Whisk in 3 Tbsp. Parmesan; season with salt and pepper.Step 3Add lettuce, tearing any large leaves, to bowl with dressing, along with pear slices. Season with salt and toss until leaves are coated.Step 4Transfer salad to a platter and top with more Parmesan and sesame seeds. Finely grate zest of remaining lemon half over.How would you rate Sesame Caesar Salad?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleGreat dressing, gives you the same caesar sensation but with a nice hint of sesameAnonymous3/11/2020Super quick to come together, I’ve made it several times and a definite favorite! AnonymousPA1/8/2020This is an outstanding salad!AnonymousLA1/5/2020This salad was nothing less than sensational.  The Asian pear was such a nice counterpoint to the flavor  combo of Tahini, garlic and lemon.  I was lucky to have found a sweet as sugar Asian pear, but am guessing that sweet Fuji apple would work well too. I sliced the pear paper thin, and will do this every time I make this.chefjeff1Sherman Oaks12/3/2019So good and flavorful!Anonymous11/19/2019Explore Bon AppétitSaladTahiniCondiments, Sauces & PastesLettuceLeafy GreensVegetableAsian PearFruitFallQuickEasyWeeknight MealsSideGluten-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-12", "author": ["Condé Nast", "Andy Baraghani"]}