{"id": "c1e88576982cd0d81b98c585174d7e8d", "url": "https://www.bonappetit.com/story/5-tips-for-people-who-are-always-on-the-go", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "5 Tips for People Who Are Always On-The-Go | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopsponsored5 Tips for People Who Are Always On-The-GoBy Peet's Iced EspressoApril 17, 2019FacebookTwitterEmailFacebookTwitterEmailThey say life is what happens when you’re busy making other plans, but in 2019 life just feels busy. Period. From the moment the alarm buzzes, we’re constantly running around— always trying to find more hours in the day for our family, friends, and most importantly our well-being. The good news is, we’ve got hacks for days. From simple steps to creating an effortless lunch to the most convenient iced espresso, here are five life hacks for those who are constantly on-the-go.Workout at WorkFinding time to exercise, even 30 minutes a day, can feel daunting (okay, nearly impossible) when you’re swamped at work. Instead of working your life around a workout, incorporate workouts into your life—and that’s often most convenient at the office. Have a weekly lunch with a colleague? Instead, schedule a “walking meeting” that allows you to get your steps in without distraction. Better yet, take those conference calls and make them mobile: pace an empty conference room, climb the building’s stairs (on mute of course), or, weather permitting, take it outside. Can’t break free from your desk chair? There are loads of YouTube videos dedicated to them—even better if you’re joined by co-workers.Pick Up a Pick Me Up with Peet's Iced EspressoIn 2019 even meeting your caffeine quota for the day can be a challenge. But at just-the-right size a can of Peet’s Iced Espresso contains eight-ounces of premium single-origin dark roast Colombian espresso for your morning, noon, or night boost. No need to spend precious time brewing coffee, pouring milk, or measuring your own sugar, this readily available treat is made with hormone-free milk and just enough pure cane sugar to make it taste incredible. This rich and creamy drink doesn’t compromise quality or health for those who want to indulge with less sugar than traditional bottled coffee beverages (and no artificial colors, flavors, sweeteners, or preservatives to boot). So to recap, that’s a quick boost to your day that doesn’t compromise quality or your health for those who want to indulge. And best of all, it’s available nationally at major grocery and convenience stores for your, well, convenience.Make Weekly Lunches in AdvanceThere’s a more convenient way for busy folks to eat lunch. Two words: Meal prep. This small amount of effort makes the work day feel a lot less hassle. Here’s the deal: Schedule a couple of weekend hours (or any day off) prepping your favorite but easy lunch recipes and you’ll greet lunchtime with a fresh, home-cooked lunch that’s ready when you are. There’s no wasting time thinking about what you want to order or waiting in line for a soggy burger. Your lunch is ready, whether you eat it in the conference room, at your desk, or in the park.Use the Pomodoro TechniqueHere’s a piece of good news: Something as simple as a kitchen timer can make your day more productive. The Pomodoro Method was developed in the 1980s by Francesco Cirillo, when college exams left him distracted and depleted. Sound familiar? It may not be finals but everything from group texts to a quick Insta scroll seems to instantly cause distraction, sucking the productivity away. Cirillo grabbed a tomato-shaped kitchen timer to focused on the task at hand and voila! The Pomodoro Technique was born. Download the app (which combines your prioritized to-do list with blocks of time), and set the timer for 25 minutes—without any distractions, then take a five-minute break. Repeat the working blocks for four consecutive times, ending in a 20- 30-minute break. The result? A magical tool for eliminating distraction, allowing you to take care of business like the boss you are.Tidy Up your To-Do ListIf everyone you know is suddenly emptying their closets and tossing the remains of their bookcase, they’ve likely adopted the popular method of decluttering to create happiness in their life. But why stop at old gym shorts and paperbacks? Tidy up your to-do list for mental clarity. Start by getting organized and tackling the most important, must-do tasks at the beginning of your day. Next, eliminate unnecessary items that aren’t productive to your daily life like drawn-out meetings or duplicated reports. Dread going to the grocery store? Use an online delivery service, instead. Ask yourself: What makes you happiest? This could be anything from a lunchtime gym session or mentoring—making space in your day for what you love. And finally, express gratitude. Sure, it sounds a little wacky, but allowing yourself to feel grateful for a good manager, a paycheck, or an hour of “me time” is a power tool in a happier, more efficient day.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-15", "author": ["Condé Nast", "Peet'S Iced Espresso"]}