{"id": "c20418977f5d1955103d3e6f2f9f379a", "url": "https://www.bonappetit.com/story/the-power-of-pleasure", "year": 2019.0, "month": 5.0, "day": 4.0, "content": "The Power of Pleasure | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Power of PleasureThoughts on pleasure as a form of resistance and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroMay 23, 2019FacebookTwitterEmailH. Armstrong Roberts/ClassicStockFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,This week on ye olde site, Maggie Lange talks to adrienne marie brown, the writer, black feminist, and social justice activist whose recent book, Pleasure Activism: The Politics of Feeling Good, has everyone I know buzzing about “relationship anarchy” and trying to get their hands on psychedelic mushrooms. brown’s thesis is that pleasure is a form of liberation, and that working toward justice can be one of the most joyful experiences of our lives.I can’t stop thinking about this book, so I was thrilled to hear more from brown, who writes so clearly (and with a sense of humor) on subjects that might otherwise seem inaccessible or academic. She talks about saying “yes” to coincidence and how she deals with activist guilt, that feeling that you can never rest and never do enough. But my favorite part is her answer to the fill-in-the-blank, “The last things to bring me peak glee are…”When communities I love act in solidarity with each other. The BOLD Harlem Renaissance costume party. Getting lost in a baby's eyes, or a child's plans for the day. Dancing, like private music-video emo dancing. The last thing was looking at myself naked in the mirror and feeling aroused. I had to surrender so many wrong thoughts to begin to see.If you need me, I’ll be getting that last line tattooed somewhere.I’m also reading…Amanda Chicago Lewis, a friend and talented journalist, on the Lyft ride she took that turned into a traumatic brain injury, and the strange tendency that many of us have to tell ourselves we’re fine because we want it to be true.Jia Tolentino on religion and ecstacy, because duh. Have you pre-ordered her book yet?From a few months ago, but this article on intentional forgetting resurfaced via Rachelle Robinett’s newsletter last week. The writer takes a drug that has a side effect of memory loss to erase a failed relationship from her mind and...it worked. “For a while afterward, I couldn’t remember anything other than her voice and the shape of her mouth.” But, as anyone who’s seen Eternal Sunshine of the Spotless Mind can tell you, forgetting isn’t always a blessing.Healthyish enchiladas, on the other hand? A blessing 100 percent of the time.Until next week,Amanda ShapiroHealthyish EditorExplore Bon AppétitHealthyishHealthyish NewsletteressayRead MoreLifestyleThe Privilege of Feeling GoodBy Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-23", "author": ["Condé Nast", "Amanda Shapiro"]}