{"id": "c207a59467dc1716a3dae0a41acd49a7", "url": "https://www.bonappetit.com/story/fior-di-latte-gelato", "year": 2018.0, "month": 7.0, "day": 4.0, "content": "Fior Di Latte: The Gelato Flavor to Measure All Gelato Shops By | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Gelato Flavor to Measure All Gelato Shops ByIt’s intensely milky, and it’s definitely not vanilla.By Sarah JampelJuly 26, 2018FacebookTwitterEmailPhoto by Michael Graydon + Nikole Herriott, food styling by Andy Baraghani, prop styling by Kalen KaminskiFacebookTwitterEmailGelato al fior di latte might look sort of like off-brand vanilla ice cream (wedding white, with no bean flecks in sight), but don’t be fooled: It’s not vanilla at all.Rather, imagine the flavor of the milkiest-milk imaginable, with a floral nuance that’ll make you swear there’s something else to it. And while it may not scream out to you from among the stracciatella or amarena, once you’ve tasted gelato al fior di latte, you’re in on the secret.For drizzling onto gelato, ice cream, or an empty spoon:Taken on its own, the phrase “fior di latte” translates to “flower of milk” and refers to cow’s milk mozzarella. But when applied to the world of dessert (which, in my book, reigns a smidge supreme over the world of cheese), the phrase points to gelato that’s typically made from only dairy, sugar, and starch (incorporate yolks and you’ve got the richer, eggier “crema”).With an ingredient list so pared-down, the quality of the milk and cream is critical. During my time working as a pastry cook at an Italian restaurant in New York City, the gelato al fior di latte got special attention: We saved the local milk for the “FDL” and the FDL only.At San Francisco’s Che Fico, a giant ball of FDL balances atop a blackberry crostata.\nAngela PinkertonThe servers would describe FDL to unfamiliar diners as “an Italian vanilla,” which I’m pretty sure sent shudders down the spine of the executive pastry chef. Because it’s actually the absence of the oft-overpowering vanilla bean (or the cloyingness of imitation vanilla) that makes FDL so special. At a recent meal with friends at I Sodi, a West Village restaurant deemed “kinda perfect” by Adam Rapoport, the FDL that came alongside grilled apricots floored everyone at the table. We figured there must be something more than milk, cream, and sugar: Maybe the milk was infused with apricot pits, or maybe the base was sweetened with wildflower honey? But no: It was simply the taste of dairy, free from the pervasive vanilla bean (or, in the words of cookbook writer Emiko Davies, the simple, innocent flavor of good milk, “bare-faced”).In Italy, gelato al fior di latte—not vanilla—is a display case staple, holding court alongside pistachio, hazelnut, and chocolate at every shop. Because it is so simple, it often serves as a barometer for the quality of the gelateria. Tasting Rome author Katie Parla told me that FDL might be overlooked by visitors who assume it ordinary, but it’s “like a margherita pizza: it’s the benchmark for quality and if it’s good, then you can trust the other menu items.” It’s “pure and there are no strong flavors to hide behind,” Jon Snyder, owner of NYC’s Il Laboratorio del Gelato, explained. Gelato al fior di latte is “simply ‘milk’—basically unflavored—and therefore you can really taste the quality of the milk, the sweetness (whether under or over), and the texture.” According to Snyder, it should not be airy or overly sweet.And since every shop in Italy must display ingredients, Parla said, “you don’t even have to taste a gelato to know if it’s going to be mediocre.” If you see powders, oils, emulsifiers, or other hard-to-translate words, be suspicious.If you don’t seek out FDL at a restaurant like New York’s Maialino or San Francisco’s Che Fico, you might not run into it in the U.S., where vanilla remains king (Parla had never encountered the flavor before moving to Italy 15 years ago). But with the price of vanilla beans going up, might there be room for another white-bread gelato in the ice cream case? For those of us who dream of “a smooth, cold glass of milk on a hot day… but better” (Morgan Morano’s description in The Art of Making Gelato), we can certainly hope.Get the recipe for a Nutella sundae starring FDL:Italian Sundaes with NutellaThis riff on an American sundae swaps out the hot fudge and whipped cream for nutella and mascarpone cheese.View RecipeExplore Bon AppétitGelatoIce CreamItalySummer DessertsSummerFrozen DessertRead MorecookingOur 11 Favorite Artisanal Ice Cream Brands and FlavorsBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-26", "author": ["Condé Nast", "Sarah Jampel"]}