{"id": "c21337a4bbca61a825959aefe1ac56d3", "url": "https://www.bonappetit.com/story/wobble-wedges", "year": 2019.0, "month": 8.0, "day": 4.0, "content": "This 20-Cent Wedge of Plastic Will Make You a Restaurant Hero | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis 20-Cent Wedge of Plastic Will Make You a Restaurant HeroI’ve made a point of keeping at least one in every tote bag, fanny pack, and backpack I’ve ever owned.By Amiel StanekAugust 26, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.Look: We’ve all been there. It’s a beautiful, sunny summer evening. You spy a coveted outdoor table at your neighborhood bar and, chilly drinks in hand, make a beeline for it. You and your friends fling yourself into some patio chairs, plop down your drinks and—THOOOOIIIIING—chaos ensues. The table pitches back and forth like a football bobblehead. Everyone grabs for their tottering beverages, trying desperately to prevent spritzes and garnishes and straws (paper, natch) from making contact with summer whites. Eyes wide with surprise, hearts racing, the reality of the situation dawns on you and your band of unsuspecting revelers: You picked yourself a wobbly table.IMHO, how you proceed from here says a lot about who you are as a person. There are the buck-passers, cretins who are content to simply stand up, find another table, and pass their misfortune on to some other unsuspecting soul. There are the helpless and entitled, who will quickly flag the closest member of the service staff and expect them to get on their hands and knees and do something to rectify the situation. There are the dreaded Band-Aiders, who will find the closest piece of flexible mass—bar coasters, an old magazine, a wad of tissues—and cram it under the offending table leg to create temporary, sloppy stability. (And, as someone who cleaned the floor of a bar in my previous life, this turns into a gross mess at the end of the night.) Then there are the Boy Scouts, the ones who came prepared. They will produce from their bag a Wobble Wedge, a ridged plastic shim tailor-made for exactly this purpose, put it where it belongs, and fix the problem so that it stays fixed.(More about my previous life: I was a Boy Scout for nearly 12 years.)Ever since I first encountered Wobble Wedges at my local hardware store in college, I’ve made a point of keeping at least one in every tote bag, fanny pack, and backpack I’ve ever owned so that I’m ready to perform a small—but important!—act of community service at a moment’s notice. They’re ingenious in their simplicity: a piece of tapered plastic that slides effortlessly under the most stubbornly wonky table leg, with just enough texture that it won’t slide out. And while I’ve used them to quickly stabilize countless restaurant tables, they’re no one trick pony—my trusty Wobble Wedges have been deployed to fix cockeyed Airbnb stoves and teetering toilets (a thing!) to great effect as well.Also: They’re cheap! Wobble Wedges are sold by the tub and, depending on the quantity you’re willing to buy, cost between 19 and 40 cents a pop. (I started on the 30 packs but have long since upgraded to the much more cost-effective 300 packs.) A small price to pay for always being ready to solve one of life’s most minute yet vexing problems, and a meaningful gesture of good will towards the restaurants, bars, and cafes that give us so much. You too, friend, can be part of the solution.I leave you with a quote from the company’s founder, the late, great Alfred Wobble Wedge*:“Ask not what your favorite restaurant can do for you.Ask what you can do for your favorite restaurant.”*This is not a real person, and they have never said this.Buy it: Wobble WedgeAll products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHighly RecommendproductRead MorecookingThe Best Tomatoes Call for the Best Tomato KnifeBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-26", "author": ["Condé Nast", "Amiel Stanek"]}