{"id": "c216ff6b6a722cb1689bcf5ad365d063", "url": "https://www.bonappetit.com/story/foods-we-dont-buy-online", "year": 2018.0, "month": 1.0, "day": 3.0, "content": "15 Foods We Don't Buy When Online Grocery Shopping—Only In Person | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture15 Foods We Don't Buy When Online Grocery Shopping—Only In PersonDon't trust someone to squeeze an avocado for you.By Alyse WhitneyJanuary 21, 2018FacebookTwitterEmailPhoto by Patrick T. Fallon/Bloomberg via Getty ImagesFacebookTwitterEmailOnline grocery shopping is becoming almost as common as running to the store for weekly groceries. It's a huge part of the Bon Appétit test kitchen's routine—we order the majority of our supplies for recipe testing on Fresh Direct, and rely on Amazon for hard-to-find ingredients. But there are some things that we can't trust the internet to pick out for us, even if it is a personal shopper from Instacart grabbing the items at a local grocery store. Without squeezing an avocado yourself, smelling a piece of fish to make sure it's at peak freshness, or picking out the best tender fresh herbs for green sauce, you're taking a gamble. Here are 15 things we almost always pick out in person.ProducePhoto by Alex Lau1. BananasBananas are difficult to buy at your ideal ripeness. When trusting someone else to pick them out, you could get ones that are green, overripe with lots of brown spots, which isn't such a bad thing if you're planning to bake some banana bread.2. TomatoesOrdering these online runs the gamble of getting a mushy, on-its-last-leg tomato, or one that's hard as a rock—especially when they're out of season. As food director Carla Lalli Music explains, you need to be able to feel and smell them to know they're ripe and ready for your BLT or Caprese salad.3. AvocadosAvocados are more temperamental than a teenager. One day they're tough and green, and the next they're suddenly ripe and need to be eaten RIGHT NOW. Even if you give an avocado a squeeze on your own, you may not know if it's secretly a little brown inside, so no matter how you buy them it can be a gamble. But at least if you pick it yourself, you can decide whether you're having guacamole tonight—or this weekend.4. Turnips, Radishes, and Carrots with TopsTest kitchen manager Brad Leone will buy almost anything online, but he gets nervous when he wants carrots with tops or radishes with greens intact if he's planning on using the greens in a recipe to make pesto or a salad. Some online grocers don't have a notes section to request those little details.5. Tender HerbsPicking the non-wilty, fresh-smelling cilantro or parsley is hard enough as it is. Even if you have the best bunch to start with, it can get damaged in transit. If an herb is delicate, get it yourself, and then use a mix of leftovers to make ranch dressing.6. ChivesThis deserves its own shout out, because chives are notoriously packed poorly—folded in half and stuffed inside a plastic container—and they condensate and wilt if the environment is too warm.FishRandy Harris7. Sushi-Grade FishThere are some trusted places to buy frozen fish online, like Sea to Table, but any ol' grocery delivery service may not cut it. Unless you are absolutely certain of your source and the freshness you'll get, don't risk it. This is most important if you're eating it raw and require sushi-grade fish.8. Live Lobsters and OystersIt's worth repeating: Only order seafood online if you can trust the source. You don't want to get a dead lobster in the mail, or slurp a bad oyster.9. CaviarCaviar has to be kept at a very specific cold temperature, and you want to make sure you're not getting scammed. Unless you trust the source and delivery person, buy it in person.Dairy, Frozen, and Prepared ItemsPhoto by: Photofusion/UIG via Getty Images10. Ricotta and Fresh Cream CheesePackaged, pasteurized ricotta and cream cheese are totally fine, but if you're buying it freshly made, you want to keep it suuuuuper cold. Buy it in person; it isn't heavy to carry home.11. Rotisserie ChickenYou want to pick the juiciest rotisserie chicken at the store, whether it's a local grocer or a restaurant. Don't take a gamble on getting a burnt and dried out one or one with sad, under-browned skin.12. EggsWe order eggs online, but almost every time, at least one is cracked.13. PopsiclesIce cream stays frozen en route, but popsicles tend to melt. Don't risk a sticky mess and sad kids (or, you know, adults who just love popsicles).BreadEva Kolenko14. BaguettesBaguettes lose alot of crunch throughout the day at a bakery. What if the one you order is from the end of the day, and then gets even soggier because it's grouped with refrigerated items in the truck? Support a local bakery and get one as fresh as you can.15. CroissantsCroissants are impossibly flaky, buttery, and downright dreamy when they come out of the oven. But like with baguettes, they soften and lose their best assets throughout the day. Find someone close to home who can feed your croissant addiction instead.Buy seafood in person, then make this pasta:Explore Bon AppétitGroceryShoppingRead MoreshoppingSea to Table Is the Best Way to Get Guilt-Free Seafood OnlineBy Julia ShermancultureWhat It's Really Like to Be an Instacart ShopperBy Alyse WhitneycultureThese 10 Great Online Specialty Food Stores Have EverythingBy Mari Uyeharaculture13 Whole Foods Product Deals on Amazon Right NowBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-21", "author": ["Condé Nast", "Alyse Whitney"]}