{"id": "c21a5ea2c2516198d3f80dfd0052becb", "url": "https://www.bonappetit.com/story/crispy-intestines-china-canteen", "year": 2018.0, "month": 6.0, "day": 1.0, "content": "At China Canteen in Rockville, MD, We Like Our Crispy Intestines Extra Crispy | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWe Like Our Crispy Intestines Extra CrispyThe unassuming strip-mall joint where they know our family’s order by heart.By Lillian Li June 6, 2018FacebookTwitterEmailPhoto by CAMERON WHITMANFacebookTwitterEmailThis is part of our series that celebrates America’s Favorite Neighborhood Restaurants. We asked 80 of the most interesting people we know to reveal the local spots they love the most.Located in a small Rockville, Maryland, strip mall with an even smaller parking lot, China Canteen is light on decor but heavy on taste. Essentially one large room with a mirrored wall at one end and a whiteboard with weekly specials at the other, the restaurant is reliably packed every weekend. Chinese families fill most of the booths and round tables. A meal here can be a reward for finishing the weekly shopping at the Chinese grocery down the street, a nice family dinner out when neither parent wants to cook, or a full-on birthday celebration with your 20 closest uncles, aunts, and cousins. Even if you’re there with friends, China Canteen has the ability to make any occasion feel familial and intimate, especially since the staff has barely changed in the 17 years the restaurant has been open. The flavors haven’t changed either.The owners are the Yus, a father and two sons, who are all originally from Sichuan. The father and eldest brother do the bulk of the cooking, while the younger brother oversees the front of the house, taking orders and chatting with the regulars. He knows how my family likes our crispy intestine with green peppers (extra crispy, pictured above) and our diced chicken with red hot peppers (extra peppers).The whiteboard with weekly specials.\nPhoto by Cameron WhitmanFor newcomers, start out with two classic Sichuan cold dishes: beef tendon in the chef’s hot sauce and conch in spicy sauce. Both dishes offer only a tickling of heat. The beef comes out thinly sliced, topped with cilantro and crushed peanuts, and the conch is cut into tender chunks mixed with slivers of fresh scallion. The magic of both dishes, though, is the pale red oil they come drenched in—a perfect vehicle for the fragrance of Sichuan spice. Though visually similar, the conch is sweeter and cleaner, while the beef offers a more savory, complex bite.Next, prepare your tongue, and adventurous spirit, for the mains. I recommend the aforementioned intestine and chicken dishes, both wok-fried until the meat and peppers are blistered to a flavorful char. The intestines have a crisp fattiness that’s as addicting as pork rinds, and the chicken is perfectly bite-size, playing hide-and-seek in a mosh pit of chile peppers.That quintessential strip mall feel.\nPhoto by Cameron WhitmanLarger parties than my family of four gravitate toward the stewed fish dishes: Sichuan boiled fish and fish with pickled vegetables. Both come out in large tureens with metal ladles, though that’s where the similarities end. The former looks nearly volcanic in a stock of red chile peppers and mouth-numbing Sichuan peppercorns. The latter has white fillets floating in a clear broth with cellophane noodles and pickled mustard greens. You’ll need your extended family at the table to finish either one.My personal favorite, though, is a dish some people believe originated in Taiwan: braised intestine with scallion sauce . A thick maroon stew of intestine and duck blood (yes, that’s right, duck blood), it isn’t for the faint of heart and comes out still-bubbling like a witch’s brew (the dish is served in a metal pot with a small flame underneath). The duck blood—thickened into cubes by time and steam—have the texture of tofu, if a little firmer and silkier; but don’t worry, they don’t taste like iron or nosebleeds. It’s closer to ground pork but richer and tangier in flavor. No visit home is complete without this meal or my parents asking the waitress to pack us an extra carton of rice for when we inevitably finish the leftovers later that night.As for dessert? Just take a short walk to the Chinese grocery down the street, Great Wall, and get yourself some green tea ice cream, a perfect antidote to overheating and overeating.Lillian Li is the author of Number One Chinese Restaurant.ContentThis content can also be viewed on the site it originates from.Explore Bon AppétitNeighborhood RestaurantsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-06", "author": ["Condé Nast", "Lillian Li"]}