{"id": "c227dc3f5fb1b3216d0e7167fb4afa93", "url": "https://www.bonappetit.com/story/10-gift-ideas", "year": 2019.0, "month": 12.0, "day": 2.0, "content": "10 More Gift Ideas Because We’re All STRESSED About It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle10 of My Best Holiday Gift Ideas Because We’re All STRESSED About ItCoffee subscriptions, white sneakers, and more from Healthyish editor Amanda Shapiro.By Amanda ShapiroDecember 12, 2019FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Are you sick of gift guides yet? On the one hand, it’s all too much. On the other hand, I’m still missing a couple key people on my list (Mom, you’re impossible), and this year’s extra-short window between Thanksgiving and Christmas has me scrambling for that perfect present.If you feel similarly, the Healthyish gift guide is a great place to start. I have special spots in my heart for the ceramic cheese plates and the Marylou Faure print. But if you’re not finding what you’re looking for there or on any of BA’s other guides, here are some things I’m giving—and coveting—this year.Give the gift of good bread. I love Chabaso, based in New Haven, CT, because they’re working to build a local grain economy by using grains grown in the Northeast. Try the Farm to Loaf bundle, which includes the dense and seedy Danish rye loaf that’s been my breakfast most mornings this week.Consider this one-of-a-kind bracelet from Fewer/Finer—or any of founder Madison Snider’s gorgeous designs, handmade in NYC. Yes, they’re a splurge, but these pieces are high-quality and simple enough to be worn literally all day, every day.For your friend who can’t stop having dinner parties since they bought Nothing Fancy, get this table runner and matching linen napkins from Sunday/Monday. These and all of Nisha Mirani’s textiles are produced by artisan families in India, and the designs pay homage to traditional Indian motifs, which other textile companies often appropriate without credit.I’ve been “getting really into coffee,” which is a statement I never thought I’d make. One of my favorite coffee-related discoveries has been Yes Plz’s bean-and-zine subscription: you guessed it, a regular delivery of coffee beans plus an issue of the totally charming and idiosyncratic zine. I love that there are multiple subscription options ranging from weekly to monthly, and the price ($17 each) is always the same.And on the subject of coffee, now that I’m thinking about things like brew time and ratios of water to grinds (kill me), I need a scale that doesn’t automatically shut off when I’m in the middle of making a pour over. The best (and prettiest) high-end option I’ve found is the Acacia, but I also use this Oxo guy when I’m in the Test Kitchen, and it never goes dark on me.The best gifts aren't just homemade—they're snacks.\nPhoto by Emma Fishman, Food Styling by Sue LiScrew winter: Everyone still wants white sneakers, especially these high-tops from long-running Czech brand Bata.Everyone at work teases me for never taking off these headphones, but there’s a reason why, and it’s not because my coworkers are annoying—love you all! It’s because they fill my ears in sonic pleasure, whether it’s the new Kelsey Lu remixes, that one Fleetwood Mac song I can never get out of my head, or sweet, noise-canceled silence.Clue someone in to Paper Phone, a free app that puts the essential info you need from your phone each day (contacts, map, weather, a recipe) into a printable PDF. A little twee, but a little genius.Tell your favorite good boy about @awardsforgoodboys. Direct him to this post. Or this one. Wait, this one? No...definitely this one.Make a giant batch of healthyish party mix and give it away in cute little jars. I can’t even describe how craveable this stuff is, especially warm out of the oven. The week that Sohla El-Waylly was developing this recipe, I kept gravitating to the test kitchen like a zombie caveman. Me want party mix. Yum.Aaand I’m spent (like, literally, my YNAB budget hates me this month). Good luck to you all, and I’ll see you next week.Until then,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishGift GuidesHealthyish NewsletteressayRead MoreLifestyleThe Healthyish Gift Guide for People With Impeccable TasteGallery16 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-12", "author": ["Condé Nast", "Amanda Shapiro"]}