{"id": "c24132b8b9c20cdb04f0ba7239c767f1", "url": "https://www.bonappetit.com/recipe/citrus-shrimp-rice-bowls", "year": 2018.0, "month": 10.0, "day": 3.0, "content": "Shrimp Rice Bowls Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2018 IssueCitrus Shrimp Rice BowlsBy Anna StockwellOctober 16, 20184.7(46)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Anna StockwellEmailPinterestPrintEmailPinterestPrintWhy make a marinade and a dressing when you can make one perfectly tangy, spicy-sweet sauce sauce that works as both?Ingredients4 servings½cup fresh orange juice2Tbsp. Sriracha1Tbsp. honey2tsp. soy sauce or tamari soy sauce¼cup plus 2 Tbsp. vegetable oil1Tbsp. plus 1 tsp. fresh lime juice1½lb. jumbo or large shrimp, peeled, deveinedKosher salt2large oranges, preferably different varieties (such as Cara Cara or Valencia)2Persian cucumbers, quartered lengthwise, sliced crosswise ½\" thick4scallions, thinly slicedSteamed rice and sliced avocado (for serving)PreparationStep 1Whisk orange juice, Sriracha, honey, soy sauce, ¼ cup oil, and 1 Tbsp. lime juice in a medium bowl. Set aside half of dressing in a small bowl for serving. Add shrimp to remaining sauce and toss to coat; season lightly with salt. Let sit, tossing occasionally, 15 minutes.Step 2Meanwhile, using a paring knife, remove peel and white pith from oranges, being careful not to remove too much of the flesh; discard. Slice oranges into ½\"-thick rounds, then cut into 1\" pieces. Transfer to a medium bowl and add cucumbers, scallions, and remaining 1 tsp. lime juice; toss to combine. Season with salt.Step 3Heat remaining 2 Tbsp. oil in a large skillet over high. Working in batches if needed, cook shrimp until charred in spots and cooked through, about 3 minutes per side.Step 4Divide rice among bowls. Top with shrimp, citrus salad, and avocado and drizzle with reserved dressing.Photo by Alex Lau, food styling by Anna StockwellHow would you rate Citrus Shrimp Rice Bowls?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleThis was so light and tasty but I would suggest making extra or a day ahead because the flavors are much punchier after they have sat overnight. My partner said the meal was ‘meh’ the first night then was blown away by the flavors the next day. AnonymousLos Angeles8/15/2021Great combination of flavors and textures. I had leftover wild rice to use so was a quick fix Nancy RybaskiLyndon Station,WI6/21/2021I love this shrimp bowl. It is a tasty meal, perfect for summer. I am always looking for flavorful recipes that can be easily made for one. I halved the recipe, had enough for a second meal, so I stored the shrimp and rice together and microwaved on medium for 1.5 minutes, threw on the orange and cucumber mixture and poured the dressing and it was as good as the first time. Sweet, bright, smooth and creamy from avocado and crunchy cucumbers. Love it.KayeMinneapolis6/14/2021Nah. Not that good. Very Carribean flavor and in keeping with that, I would lose the Sriracha and substitute fresh diced jalapeños or serranos. Will avoid recipes by this writer.AnonymousCalifornia 6/1/2021The flavors are wonderful and it's easy to make. Will be making this again and again.AnonymousSt Paul MN4/23/2021So, it seems like the orange juice in the recipe is not to be taken from the 2 large oranges that are listed in the recipe?  If that's the case, the recipe should probably call for 3 oranges.  Andrew D.Brooklyn, NY3/15/2021OMG. So simple, so quick, healthy and delish! The flavors were light and refreshing, the crisp crunch of the cucumbers and bite of the citrus, so amazing. I could eat this every day. AnonymousChicago, IL11/18/2020HELP!  We love this recipe, in fact planned to make it today when my husband awoke with a gout attack brought on by a weeklong binge on oranges.  What can I make with these ingredients and a moderately stocked pantry but without citrus?nbspRio Rancho NM6/5/2020This was such a great recipe! Had all the ingredients for the marinade on hand already and I think this marinade would be great on any protein (chicken, steak, tofu) in addition to shrimp.  I used BA's perfect pot of rice recipe for the rice (turned out perfectly) and added some peppers and carrots to the citrus salad.  Flavorful, a little spicy, and delicious!Anonymous5/21/2020This was refreshing and surprisingly hearty. The citrus was bright and kinda hot. I used less oil and sushi rice. Then I spent 2 hours climbing a 50 foot rock wall and didn't fall off, so the food did its job.AnonymousAustin, TX5/5/2020this was delicious! The sauce on the shrimp is so yummy I'm definitely going to repurpose it. The salad was good, but nothing to write home about. Next time I might add some mango and make it more of a fruit salad as it was just a bit lackluster to me. AnonymousBrooklyn, New York2/26/2020This is so good.  I actually dream of eating it every day.  I double the sauce recipe to make it extra flavourful.  I just want to eat this always.  AnonymousToronto, Canada10/28/2019This was soooo good. The citrus was perfect with the shrimp. Next time I would set aside more of the sauce to put on top rather than to marinate the shrimp in. I plan on making this exactly one million more times. mhdsileskyAustin, TX4/9/2019Delicious!  Made it for the third time tonight.  I have made with a mix of grapefruit and oranges, which is a hit.  I put in more citrus than the recipe calls for.  Instead of white rice, we have put it on quinoa, riced cauliflower and the super-easy rice packets from Trader Joes.AnonymousMissouri3/18/2019MAJOR winner. Made this for dinner with a dear friend and we were marveling at the spice, the sweetness, the char on the shrimp ... Gorgeously balanced recipe. Added a couple of touches of my own : Wild rice cooked in half water, half orange juice and fresh blood orange in the dressing ... Can’t wait to make it again, I was so proud of them. Thank you, Bon Appetit! More, please 😉AnonymousNew York City3/4/2019Explore Bon AppétitRice and Grain BowlAsianShrimpShellfishSeafoodLimeCitrusFruitOrangeEasyQuickWeeknight MealsMainDairy-FreeNut-FreeGluten-FreeHealthyishSautéLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-16", "author": ["Condé Nast", "Anna Stockwell"]}