{"id": "c24e8baeea306ec15a9a20e78eb4f771", "url": "https://www.bonappetit.com/recipe/kielbasa-and-lentil-soup-with-lots-of-basil", "year": 2019.0, "month": 3.0, "day": 4.0, "content": "Kielbasa and Lentil Soup  Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesKielbasa and Lentil Soup with Lots of BasilBy Molly BazMarch 24, 20194.8(67)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Jennifer OphirEmailPinterestPrintEmailPinterestPrintExactly what you want on a rainy spring day. We're obsessed with the smoky flavor that good kielbasa brings to this hearty soup, but if you can’t find it, any smoked and/or fully cooked sausage will work just as well. About those lentils: You can use whatever you'd like here, but you'll end up with a slightly different dish. Lens-shaped green (pictured here), brown, and red lentils tend to fall apart as they soften, yielding a soup that is thick and porridge-like. By contrast, French green (a.k.a. lentilles du Puy) and black beluga lentils are sturdier and maintain their shape when cooked, resulting in a brothier situation. Different vibes, same great flavor.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonCutting Board$10 At IKEALarge Bowl$18 At AmazonDutch Oven$80 At AmazonWooden Spoon$6 At AmazonLadle$8 At AmazonIngredients4 servings2medium onions2celery stalks1fennel bulb6garlic cloves12oz. kielbasa¼cup extra-virgin olive oil, plus more for drizzling½tsp. crushed red pepper flakesKosher salt2Tbsp. tomato paste1¼cups lentils2cups basil leaves½cup whole-milk Greek yogurtPreparationStep 1Prep the mirepoix (a.k.a. the aromatic base of your soup). Peel 2 medium onions and finely chop. Transfer to a large bowl. If there are any pale, tender leaves attached to the heart of your bunch of celery, pluck off about ¼ cup to reserve for serving. Take 2 celery stalks and cut in half lengthwise, then cut crosswise into ½\" pieces; add to bowl with onion. Cut off stems and dark green parts from 1 fennel bulb; discard or save for another use. Cut bulb in half through the core, then finely chop. Add to bowl with onion. Lightly smash 6 garlic cloves to release skins. Peel, then smash forcefully with the side of your knife to break them down into smaller bits. Add to bowl with onion.Play/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Slice 12 oz. kielbasa crosswise into ¼\"-thick coins.Step 3Heat a large heavy pot over medium. Add ¼ cup extra-virgin olive oil and swirl to coat. Cook kielbasa in a single layer (it’s okay if it’s not a perfect one), undisturbed, until golden brown underneath, about 3 minutes. Turn pieces with a wooden spoon and cook, stirring occasionally, until mostly browned on both sides, 1–2 minutes longer.Step 4Reduce heat to medium-low. Add onion mixture, ½ tsp. crushed red pepper flakes, and 1 tsp. salt and cook, stirring often, until vegetables are softened and onion is translucent, 8–10 minutes.Step 5Add 2 Tbsp. tomato paste and cook, stirring often, until it darkens in color, 1–2 minutes longer.Step 6Add 1¼ cups lentils, 1 tsp. salt, and 4½ cups water and stir to combine. Increase heat to medium-high and bring to a simmer. Once simmering, reduce heat to medium-low, cover pot, and cook, peeking occasionally to ensure soup is at a bare simmer, until lentils are tender but not falling apart, 20–45 minutes (depending on what kind of lentils you're working with).Step 7Remove from heat. Add 2 cups basil, stirring to wilt. Taste and adjust seasoning for salt.Step 8Divide soup between bowls. Dollop with ½ cup whole-milk Greek yogurt and drizzle with more olive oil. Garnish with reserved celery leaves if you have them.How would you rate Kielbasa and Lentil Soup with Lots of Basil?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleThis is one of my go-to recipes. I use andouille instead of kielbasa, a can of tomato paste instead of 1 tbsp, and I add 1/4 tsp. cayenne. So delicious!!AnonymousOhio2/27/2022This soup is AMAZING full of flavor one of our all time favorites we enjoy it several times during the clod months. We even use vegetables and spices frim our gsrden.It makes the house smell so wonderful . DeborahCalifornia 11/11/2021This was AMAZING. We followed the recipe, but I did add a few finely diced carrots as others recommended. Great addition. I also did a little paprika and a little chili powder for some extra heat. The paprika flavor blended so well & really enhanced the overall flavor. Highly recommend. It was so hearty and flavorful and comforting. We will be making this again this fall and winter! AnonymousSouth Carolina10/25/2021Wow! I went to the grocery store and forgot my written list and my phone and list !  So when I got home I had to use what I had. I had what I thought chopped onion and cerery, but it was onion and green pepper. I put it in. Also added more onion. I added pinto, black, kidney, lentil, and I was going to add black-eyed peas. My son said that would be too many beans. So I didn't add them. I had sausage. No tomato paste but instead, I added  2 cans of stewed tomatoes and 1 can of that spicy canned tomatoes mix.  Hardly any garlic. but I had some of that fresh garlic in a jar. No red pepper flakes but plenty of paprika and black pepper. We almost forgot to add the lentils. By then this whole thing turned into a big comedy sketch. The basil and bay leaves were added. Wow was that great! My son loved it. And so it goes.LauriMilwaukee, WI10/10/2021This is my first time trying lentils and fennel and I love this recipe! The only thing I added was sweet potatoes and two pinch’s of sugar. And sour cream instead of yogurt and I absolutely love the way this tastes!! Thank you Chef!!! Yvonne Tucson, AZ9/2/2021Very tasty! I opted for 2/3 chicken stock added to mine. Added some cumin, oregano, and just a touch of cloves to it. Definitely a hit, a new favorite comfort food.Anonymous7/13/2021Made this as written with the addition of fine chopped carrots for extra veggies.  Delicious!SharonSan Luis Obispo, CA4/27/2021yup, this is good and easy and comforting. i added about 1 tbsp more of tomato paste and instead of fennel, i just added carrot celery and onion because that’s what i had. i don’t miss the fennel. added a capful of ACV and 1 tbsp butter. dont skip the greek yogurt. cut the sausage in half into half moons. would taste good w/ crackersJennyRaleigh, NC4/15/2021Divide soup AMONG bowls. Enjoyed this soup, made better with 1 quart of homemade stock relacing water.AdubSt. Louis4/11/2021Amazing! One of my go-to winter soups. I substituted cilantro for the basil once and it was great. MissMelissNCCarrboro, NC12/14/2020We love this with or without kielbasa. I also sometimes make this with sweet italian sausage. I prep it in the instant pot then pressure cook for 12 minutes. I can't have tomatoes so I skip the tomato paste.  I use veggie stock or chicken. or beef stock in place of water. I've made it with and without fennel. Sometimes I use carrots when I don't have fennel. It's delicious regardless of how I make it. Thanks for the recipe inspo!KatherineAtlanta, GA12/5/2020...OMG this is so good. I’m eating it right now. I used andouille instead of kielbasa because I like it, and subbed leeks for fennel bc I hate fennel. I used homemade chicken broth Also I had sour cream, not yogurt. This is fantastic. Made it in the instant pot, followed all directions and then pressure cooked for 15 minutes. Wow. Karamiel Houston 11/24/2020Are you kidding me???  There is no text under the \"recipe preparation\" section!!  I saved this recipe a while back only to start prepping the ingredients and realized that I don't have the instructions to make it!  I'm a pretty decent cook so I'm sure I'll figure it out but this is seriously lame. Needless to say, I'm not keen to keep sending $ for the subscription. Yep, I actually pay for the content. AnonymousPortland, Oregon10/14/2020So delicious! It exceeded my expectation. I swapped carrots for fennel and added a little extra tomato paste because mine didn’t look as dark as the photos. We used sour cream on top rather than yogurt and oil because that’s what we had on hand. This is a great hearty soup that I’m excited to have in my recipe box for this fall and winter!  AnonymousMN 9/18/2020You need to make this! Easy and incredibly good.rrdominguez9683MIAMI7/14/2020Explore Bon AppétitSoupSoups and StewsKielbasaSausageMeatLentilVegetableBasilHerbs & SpicesOne-Pot MealsMainStarterNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-24", "author": ["Condé Nast", "Molly Baz"]}