{"id": "c250be276df8ff527a7bb9350b7b76ae", "url": "https://www.bonappetit.com/story/breakfast-sandwich-eggs", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "Why Is There Dicalcium Phosphate In My Breakfast Sandwich? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhy Is There Dicalcium Phosphate In My Breakfast Sandwich?You thought that was just an egg?By Ali RosenMarch 1, 2018FacebookTwitterEmailPhoto by Ted CavanaughFacebookTwitterEmailYour favorite grab-and-go breakfast sandwich probably has eggs in it. But those eggs may have a lot more ingredients than you think. While some fast food joints' eggs have nothing more than egg and cooking oil, others have up to a dozen additives hiding inside. Luckily, there's an easy way to know, just by looking at it, how your egg sandwich stacks up.The scrambled egg patty in Starbucks’s breakfast sandwiches contains eggs, but also whey, skim milk, soybean oil, modified food starch, dicalcium phosphate, salt, sodium bicarbonate, butter flavor, xanthan gum, guar gum, liquid pepper extract and citric acid. Chick-fil-A’s has eggs, salt, xanthan gum, citric acid, annatto and a butter flavoring with medium chain triglycerides, coconut oil and natural flavors. On the other hand, the egg in McDonalds’s Egg McMuffin contains exactly one ingredient: eggs.As ingredient disclosure has become the norm (and in many places, the law), fast food brands have been taking a closer look at their menus, removing sugars and artificial ingredients to meet consumer demand. So why do some fast-food restaurants put so much extra stuff in their eggs, while other places keep it simple?The answer, it turns out, has to do with the way the egg is cooked. You can crack a single egg and fry it in seconds, which is why the egg in Wendy’s Artisan Egg Sandwich’s egg contains just the egg and the non-stick spray used on the pan. But the scrambled egg in Wendy’s Sausage & Egg Burrito has nine ingredients, including preservatives and gums, because the eggs must be pre-cracked and whisked, and that egg mixture needs to be shelf-stable to meet health standards.Then there’s the fact that many fast-food restaurants don’t make the scrambled eggs in-house. “Suppliers create food for us, and it comes to the restaurant premade,” explains Alec Treffers, a spokesperson for Taco Bell (whose breakfast soft tacos contain eggs, soybean oil, salt, citric acid, pepper, flavors, sunflower oil, xanthan gum and guar gum), “We are scaled larger, with 7,000 restaurants, so we focus on being the brand that people expect us to be which is quick, convenient and affordable.”The other reason for all the additives is consistency, literally and figuratively. Heather Macintyre, a spokesperson for Dunkin Donuts, (whose egg sandwiches contain egg whites and yolks, soybean oil, water, corn starch, salt, natural flavor, xanthan gum, cellulose gum and citric acid) noted that “additional ingredients...are used to ensure integrity during the cooking process for delivering great taste and texture.” In other words, it’s how you know that that breakfast sandwich will taste the same every day.So if you want to keep your egg ingredients to a minimum, look for whole eggs that are fried or over-easy, not scrambled. But is there a health reason to shy away from breakfast sandwiches with scrambled eggs?  Marlene Koch, the New York Times bestselling author of the ‘Eat What You Love’ series and a registered dietician explains, “Most of these gums and other ingredients are common thickening and stabilizing agents and preservatives. They aren't necessarily harmful to your health, but they may not be as tasty.” And at least there’s actual egg involved, not egg powder, everyone’s cafeteria nemesis. “It’s eggs that have been pasteurized, and what has been added is for preservation and appearance,” Koch says.Koch also points out that you have to look at every ingredient in a meal to determine how healthy it is: “If you eat a real egg nestled between cheese and a salty, fat-laden sausage or bacon, served on a rich, buttery biscuit or bun, it may not be the egg that is the biggest concern for your overall health.”There's only one ingredient in these eggs:Jammy Soft-Boiled EggsOnce you master this easy recipe, you’ll be adding these to everything you make. View RecipeExplore Bon AppétitHealthyishEggBreakfastSandwichAdditivesTrendsRead MoreLifestyle6 Food Additives You Can Stop Worrying AboutBy Magdalena PuniewskaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-01", "author": ["Condé Nast", "Ali Rosen"]}