{"id": "c25b5cd2e9c722a24c84a3a076fd898e", "url": "https://www.bonappetit.com/story/mini-offset-spatula", "year": 2019.0, "month": 1.0, "day": 4.0, "content": "The Offset Spatula is the Tool Every Cook Needs | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Mini Offset Spatula Is Every Professional Baker’s Secret WeaponWhy I need to be within arm’s reach of this $5 kitchen tool at all times.By Sarah JampelJanuary 24, 2019FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.The small offset spatula is one of those kitchen tools—like a cake tester, bench scraper, or fish spatula—that you may consider unnecessary. But use it once and you’ll love it forever. After you’ve shelled out the $5 for the 4.5-inch workhorse, you’ll wonder why you hadn’t bought one years ago, especially considering that you probably spend that amount on various caffeinated beverages every day.The mini offset is well-known for creating dramatic whirls of frosting on cakes and cupcakes (and don’t even get me started on the wonders it can work on whipped cream), but it’s also the ideal tool for swooping hummus, smearing butter, jam, and cream cheese, and prying muffins out of their tin. Gentler than a butter knife and with a thin, flexible blade that’s a dream to maneuver, the mini offset has none of the sharp edges that threaten to scuff up a delicate crumb. Its bluntness makes it ideal for running along the sides of a pan quickly and smoothly, a sensation that’s as close to the thrill of driving a sports car through the Italian hills as I’m going to get.Crepe Cake with Whipped CreamStacks on stacks on stacks.View RecipeI bought my own small offset spatula a few years ago, when I was working in a test kitchen where we only had one. (This was madness.) The recipe developers and food stylists would practically fight for it, running to be the first one to the office in the morning so that they could grab it, hold it hostage in their apron pocket, and be the only person who could make beautiful swooshes that day. When I realized I couldn’t bake (or cook!) without it, I got my own. I received my second as a holiday gift when I was working as a pastry cook at a restaurant: The head pastry chef gave each cook an engraved offset so that we’d never be without one (and so that no one could get away with pilfering). We used them to spread cake batter into all of the corners of a pan, to smooth brownies before they went in the oven, and to butter brioche.At home, I use it as a flipper, turning small pieces of pan-frying tofu and wedges of roast squash, and a forklift, transporting delicate cookies from the baking sheet to a wire rack. (And that means I have yet to purchase a cookie spatula which, I’d argue, is much less useful.)Now I have a roster of small offsets so that I can keep one by my side when I’m food styling and a few in my home kitchen for whenever the time comes (and it always comes).Yesterday, I used one to pry the top off a small can of paint. Screwdriver? Who needs one!Ateco Mini Offset Spatula (Set of 2)$12 at AmazonExplore Bon AppétitShoppingproductToolsRead MoreshoppingThe Best Dutch Ovens at Every Price Point According to Bon Appétit EditorsBy Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-01-24", "author": ["Condé Nast", "Sarah Jampel"]}