{"id": "c265e16e4090206126aa2b3eb2b825a8", "url": "https://www.bonappetit.com/story/blt-for-lettuce-lovers", "year": 2021.0, "month": 6.0, "day": 2.0, "content": "This BLT Sandwich Is for (Lettuce) Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Sandwich Is for (Lettuce) LoversThis BLT riff swaps the B for H (ham) and goes extra heavy on the L.By Christina ChaeyJune 8, 2021FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.This sandwich is so easy to make it should live in its own column called “It’s TOO Simple.” In fact, this sandwich is so simple that it didn’t make the cut for the collection of “Short Is Sweet” recipes in our June/July issue (out now)...because no one thought you needed a recipe to make it. And yet, isn’t that the very point of a good ITS? So here we are.This is my loose riff on the quintessential summer sandwich: a classic BLT. But with H (ham) instead of B and definitely extra L. Behold: the HLT. There’s plenty of thinly sliced deli ham, a towering 1.5”-tall lettuce steak (more on that in a second), a bit of perfectly ripe tomato, and just enough seasoning to make those three ingredients sing (yes, I consider cheese a seasoning).Here’s how to make one glorious HLT:Start with two slices of lightly toasted bread. I prefer a pre-sliced multigrain sandwich loaf (like Dave’s Killer Bread’s 21 Whole Grains and Seeds), but you can use anything you like. Spread one slice with a thin layer of Dijon mustard and the other with a thin layer of mayonnaise.Now for those lettuce steaks! I’ve long been inspired by how the iceberg lettuce is cut for the Palace Diner’s famed tuna melt. By volume the sandwich is more lettuce than tuna which, in this humble sandwich enthusiast’s opinion, is the correct ratio.If you’ve ever made a cauliflower steak, you know what we’re going for here: a sturdy and thick plank of lettuce that holds together bite after bite. To make your steak, rest 1 medium head of iceberg lettuce on a work surface on the stem end and slice off one rounded end to create a flat surface; set rounded end aside (“snack lettuce”). Slice off a 1½”-thick plank of iceberg; if this is way too large to reasonably fit within the perimeters of your sandwich bread, trim plank down to size. Dress your lettuce steak with a squeeze of fresh lemon juice, a drizzle of extra-virgin olive oil and salt and freshly ground black pepper. Dressing it this way ensures tons of crunch AND flavor in every bite.Adding a big slice of well-seasoned lettuce steak guarantees that every bite will be extra crunchy and bursting with flavor.\nPhoto by Emma Fishman, Food Styling by Susie Theodorou, Prop Styling by Elizabeth JaimeBuild your sandwich by topping one bread slice with a slice of cheese (such as pepper jack or Muenster), three oz. sliced deli ham, your lettuce steak, and as many slices of ripe tomato as you desire. Season tomato slices with a little salt and pepper, then close sandwich and slice in half. Serve with crunchy pickles on the side—chef Meherwan Irani recommended The Backyard Food Company’s Czech Sweet & Sour Pickle to me and I’ve never looked back.Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-08", "author": ["Condé Nast", "Christina Chaey"]}