{"id": "c26ef218de150c4f85216d56772459d0", "url": "https://www.bonappetit.com/recipe/adobo-mushroom-tacos", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Adobo Mushroom Tacos Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesAdobo Mushroom TacosBy  Edgar CastrejónOctober 18, 20214.8(26)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksEmailPinterestPrintEmailPinterestPrintThese mushroom tacos are “the most requested dish at family gatherings and potlucks with friends,” writes Edgar Castrejón in his book, Provecho: 100 Vegan Mexican Recipes to Celebrate Culture and Community, all about vegan Mexican and Latin American cooking. While Castrejón recommends chanterelle mushrooms for their “chewy texture that satisfies, like a meat filling,” almost any combination of mushrooms, torn or cut into bite-size pieces, works well in this recipe. Toss the mushrooms energetically to ensure the spice mix gets into all the nooks and crannies. As good as the seasoned mushrooms are, the tacos really come alive with the toppings, so don’t sleep on those.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronRimmed Baking Sheet$20 At Bon Appétit MarketCitrus Juicer$7 At AmazonMedium Bowl$17 At AmazonCutting Board$10 At IKEAIngredients4 servings1lb. mixed mushrooms (such as chanterelle, oyster and/or crimini), coarsely chopped2Tbsp. avocado oil or vegetable oil2Tbsp. fresh lime juice1Tbsp. dried oregano1Tbsp. onion powder2tsp. garlic powder2tsp. ground cumin2tsp. coconut sugar or organic cane sugar2tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt½tsp. cayenne pepperWarm small corn tortillas, salsa, store-bought vegan sour cream (optional), sliced radishes, halved cherry tomatoes, chopped cilantro, and lime wedges (for serving)PreparationStep 1Place a rack in middle of oven; preheat to 400°. Toss mushrooms, oil, lime juice, oregano, onion powder, garlic powder, cumin, coconut sugar, salt, and cayenne in a medium bowl until mushrooms are well coated. Spread mushrooms out in a single layer on a parchment-lined baking sheet and roast until golden brown and crisp, 20–25 minutes.Step 2Build tacos with tortillas, mushrooms, salsa, vegan sour cream (if using), radishes, tomatoes, and cilantro. Serve with lime wedges for squeezing over.Reprinted with permission from ‘Provecho: 100 Vegan Mexican Recipes to Celebrate Culture and Community’ by Edgar Castrejón, copyright 2021. Published by Ten Speed Press, an imprint of Penguin Random House.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Adobo Mushroom Tacos?Leave a ReviewTell us what you thinkReviews (9)Back to TopTriangleDelicious recipe with wiggle room for spices! We added some smoked paprika with some spice blends neighbors have given us. It turned out delicious! Although it looked like a lot of mushrooms, mushrooms cook down. So just cook them all ;) you will want another taco ;)MadelineReno, NV3/2/2022Delicious and simple! If availability or affordability of nice shrooms is an issue, subbing potatoes diced to 1/2\" cubes  is also tasty. Just lower the over temp to 350/375 to afford longer time and to prevent burning the adobo spice paste.AlexAtlanta, Georgia12/10/2021So so good. New go-to for a quick, meatless meal.AnonymousMilwaukee, WI12/9/2021This recipe was so good! I had to leave them baking a it less because my oven doesn’t work that well. Left them baking for 16-18 min and they turned out amazing! Huber Lopez California 11/24/2021Agreed w/ Alaska that this was more of a paste than a marinade.  Allso, cut the salt, and it was appropriately salty for my needs. I also added 2 TBS orange juice to lighten the mixture. Then, what I've often seen on Bon Ap--tear the mushrooms rather than chop them. Had radishes, but didn't see a good \"fit\". Also  didn't have any cilantro today. So.I did a (sprinlkle) of salt on thinly sliced red onions, drained and rninsed tnem) quartered grape tomatoes, added  sour cream & guac.  Now?  Whenever mushrooms are on sale? I'll experiment with the Spanish and Fiipino versions. \n\nLucidaBoston11/3/2021This recipe came out super good and since my oven isn’t kind of finicky and sometimes gets to hot even when I set it to a certain F I had to watch carefully until they got golden and crispy I took them out. It was more like 18 in the oven. Esther dawn San Diego, CA10/29/2021Spice mixture is more of a paste, so mushrooms turned out very dry.   Had to compensate with sour cream and salsa to add moisture.  AnonymousAnchorage, AK10/27/2021 This sounds really good, and I will be making these soon. How do you make the shells crispy without being chewy.  Thank you for the recipe. Linda Malnati Ontario California10/24/2021I just found ten large hen of the woods mushrooms and i really needed recipes ! This one was amazing ! Ill be making this often ! Thank you for sharing it 🙂Melanie g.Akron ohio10/21/2021Explore Bon AppétitTacoVeganMexicanDinnerEasyWeeknightVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-18", "author": ["Condé Nast", "Edgar Castrejón"]}