{"id": "c276ee0cb98eed84501e3b329663c90d", "url": "https://www.bonappetit.com/recipe/spiced-blood-orange-shrub", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Spiced Blood Orange Shrub Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueSpiced Blood Orange ShrubBy Zaynab IssaNovember 23, 20214.8(8)Read ReviewsTriangleEmailPinterestPrintPhotographs by Emma FishmanEmailPinterestPrintEmailPinterestPrintWarm spices and winter citrus come together to make this punchy spiced blood orange shrub with a soft, festive hue. You probably won’t even miss the alcohol, but if you do, spike each drink with about 1½ oz. vodka or whiskey. And if you can’t get your hands on blood oranges, use orange zest and blood orange juice or a mix of 3 oranges and 1 lemon to mimic the sweet and slightly tangy flavor of blood oranges.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronVegetable Peeler$10 At AmazonParing Knife$10 At AmazonMesh Sieve$13 At AmazonGlass Measuring Cup$19.99 At AmazonIngredients8 Servings4medium blood oranges11\" piece ginger, peeled, coarsely chopped13\" cinnamon stick6cloves½cup sugar¼cup (or more) apple cider vinegarClub soda (for serving)PreparationStep 1Remove zest from blood oranges in wide strips with a vegetable peeler, leaving as much pith behind as possible. Set half of zest aside for serving. Slice oranges in half; squeeze juice through a fine-mesh sieve set over a measuring glass or small bowl (you should have about 1 cup juice). Discard pulp and seeds; set juice aside.Step 2Bring ginger, cinnamon stick, cloves, sugar, remaining blood orange zest, and 1 cup water to a boil in a medium saucepan over medium heat. Cook, stirring occasionally, until sugar is dissolved and mixture is reduced by half, about 5 minutes. Let cool, then strain syrup through a clean fine-mesh sieve into a clean measuring glass; discard solids.Step 3Stir vinegar and reserved blood orange juice into syrup. Taste shrub—it should be a well-balanced sweet-and-sour flavor; add more vinegar by the tablespoon if needed.Step 4To serve, pour 3 Tbsp. shrub into each of 8 ice-filled glasses. Top off each with 4–5 oz. club soda and stir gently to combine. Garnish with reserved zest.Do ahead: Shrub can be made 6 weeks ahead. Pour into a 1-pint glass jar; cover and chill.How would you rate Spiced Blood Orange Shrub?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleTasty, but very mild. AnonymousMaryland2/13/2022sorry, why can't I call it a mocktail?Katiephiladelphia12/15/2021This shrub is the perfect winter mocktail. Super delicious drink without the hangover. Loved the warm spices. Our grocery didn’t have blood oranges so made it with regular and it still turned out tasty. AnonymousSeattle 12/12/2021Explore Bon AppétitDrinksPitcher DrinkDrinks AllCocktailNonalcoholicBlood OrangeOrangeCitrusFruitChristmasNew Year'sRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Zaynab Issa"]}