{"id": "c281b1837e5b9e7e5cf1b6f142886735", "url": "https://www.bonappetit.com/recipe/vanilla-layer-cake-with-mango-curd", "year": 2018.0, "month": 9.0, "day": 3.0, "content": "Vanilla Layer Cake with Mango Curd Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2018 IssueVanilla Layer Cake with Mango CurdBy Natasha PickowiczSeptember 18, 20185.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyEmailPinterestPrintEmailPinterestPrintBreaking up the components and preparing them ahead will make tackling this layered cake feel more manageable.Ingredients12 servingsSoak½cup (100 g) sugarPinch of kosher salt1vanilla bean, halved lengthwise½cup (100 g) silver tequilaFilling1envelope unflavored powdered gelatin (about 2½ tsp.)1(heaping) cup (200 g) fresh mango pieces (from 1 large ripe mango), puréed until smooth6Tbsp. (80 g) fresh lemon juice1tsp. kosher salt2cups (400 g) sugar, divided3(150 g) large eggs8(110 g) large egg yolks6Tbsp. (85 g) chilled unsalted butter, cut into pieces½cup (100 g) extra-virgin olive oilAssemblyVanilla GenoiseVanilla Swiss Meringue ButtercreamPreparationSoakStep 1Combine sugar, salt, and ½ cup water in a small saucepan; scrape in seeds from vanilla bean and discard pod. Bring to a simmer and cook 2 minutes. Remove from heat and immediately pour in tequila. Strain into a small bowl (you should have about 1 cup). Cover and chill.Step 2Do Ahead: Soak can be made 3 days ahead. Keep chilled.FillingStep 3Place ½ cup cold water in a small bowl and sprinkle gelatin evenly over top; chill until ready to use.Step 4Cook mango purée, lemon juice, salt, and 1½ cups sugar in a medium saucepan over medium-low, stirring to dissolve sugar, until steaming (don’t boil), 5–7 minutes.Step 5Meanwhile, whisk eggs, egg yolks, and remaining ½ cup sugar in a medium bowl until pale and foamy, about 1 minute.Step 6Ladle some mango mixture into egg mixture, whisking to combine, then stream egg mixture into remaining mango mixture, whisking constantly. Cook, adjusting heat to keep mixture just under a simmer and stirring constantly with a heatproof rubber spatula, until thick enough to coat spatula and an instant-read thermometer registers 170°, 8–10 minutes. Remove from heat and scrape in softened gelatin; stir to dissolve. Add butter, whisking in a piece at a time, then gradually stream in oil, whisking constantly. Strain curd through a fine-mesh sieve into a medium bowl. Set in a larger bowl partially filled with ice water and stir to cool quickly. You should have about 4½ cups curd. Remove from water and cover with plastic wrap, pressing directly onto surface; chill until set, at least 4 hours.Step 7Do Ahead: Curd can be made 3 days ahead. Keep chilled.AssemblyStep 8Line a 9\"-diameter cake pan or springform pan with plastic wrap, pressing into bottom and leaving generous overhang. Fit a 1-piece round of cake into pan, placing bottom side up. Using a pastry brush, dab a quarter of soak across entire surface of cake. Stir chilled mango curd to loosen, then scrape a third over cake and smooth in an even layer with a small offset spatula. Place another round of cake on top of curd, bottom side up, this time using a 2-piece layer. Repeat soaking and filling process. Top with the remaining 2-piece round of cake, bottom side up, and repeat soaking and filling process one more time. Top with remaining 1-piece round of cake, bottom side up, and brush with remaining soak. You should have 4 layers of soaked cake separated by 3 layers of filling. Wrap plastic overhang up and over cake; chill at least 12 hours and up to 2 days to allow mango curd to set and cake to absorb soak.Step 9To frost, remove plastic from top of cake and invert cake onto a cake plate or platter. Remove pan and plastic. Dollop about 1 cup buttercream over top of cake and smooth across top and down sides, creating a very thin layer. You want to fill in any gaps, adhere any crumbs to the cake, and seal in the fillings (this is called a crumb coat). Chill cake 10 minutes, then scrape remaining frosting on top of cake and spread all over, working down and around sides. Decorate as desired.Step 10Do Ahead: Cake can be made 2 days ahead. Chill until frosting sets, then cover loosely with plastic wrap. Let sit at room temperature 1–1½ hours before slicing.Photo by Alex Lau, food styling by Susie Theodorou and Natasha Pickowicz, prop styling by Rebecca BartosheskyStep 11Highly recommended reading: Layer cake tips, tricks, and common mistakes from Natasha Pickowicz.How would you rate Vanilla Layer Cake with Mango Curd?Leave a ReviewTell us what you thinkReviews (3)Back to TopTriangleCan other fruit be substituted for the mango? If so, what would work best? Thanks! Anonymous12/18/2020THIS CAKE! \nCannot recommend these recipes enough! They are not too sweet, moorish and look spectacular.\nThe recipe is written beautifully and includes all the critical point. The sponge comes out perfect, every time! BRAVO! I will make these cakes  until the day I die! Well done!cakerbakergrazerAustralia6/7/2019This cake is a show-stopper. I made it for Thanksgiving this year and it absolutely wowed with its incredible flavor and beauty. I followed directions exactly as written and my cake turned out exactly as pictured. This cake was fairly labor intensive but absolutely worth it (take the authors advice and make some things ahead of time). AnonymousOhio12/9/2018Explore Bon AppétitCakeDessertLayer CakeItalianEuropeanAmericanMangoStone FruitFruitVanillaHerbs & SpicesTequilaAlcohol & Other DrinksNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-18", "author": ["Condé Nast", "Natasha Pickowicz"]}