{"id": "c28d8f949169cf67ee36980c000666c6", "url": "https://www.bonappetit.com/story/healthyish-podcast-episode-2", "year": 2021.0, "month": 6.0, "day": 4.0, "content": "The Healthyish Podcast Episode 2: The Forager's Dilemma With Alexis Nikole Nelson | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThe Forager’s Dilemma With Alexis Nikole NelsonThe second episode of the Healthyish podcast is here to change the way you think about weeds.By Bon AppétitJune 24, 2021FacebookTwitterEmailFacebookTwitterEmailWhen Alexis Nikole Nelson started her TikTok account last year, she had no idea that the videos she made of herself foraging in the parks and woods of Columbus, Ohio—and singing along the way—would go so viral so quickly. On this week’s episode of the Healthyish podcast, Alexis joins Amanda in the Zoom studio to talk about her lifelong love affair with wild edible plants, the racial history of trespassing laws, and what you can cook with the weeds in your very own backyard.ContentThis content can also be viewed on the site it originates from.Stuff we talk about in this episodeHealthyish interview with Alexis NikoleAlexis Nikole’s juneberry hand pie recipeAlexis Nikole’s video about being a Black foragerAlexis Nikole’s Ramp RapHow to ListenListen to this episode through the audio player on this page, or subscribe via Apple Podcasts, Spotify, or wherever you get your podcasts to get all six episodes. If you love the show, be sure to rate and review. It helps us keep putting out the good vibes.Explore Bon AppétitPodcastsHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-24", "author": ["Condé Nast", "Bon Appétit"]}