{"id": "c29406237cfe738d7569fb2bd54e64c2", "url": "https://www.bonappetit.com/story/edible-glitter-is-great", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Edible Glitter Is Great and I’m Not Afraid to Say It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureEdible Glitter Is Great and I’m Not Afraid to Say ItBut remember this: All that glitters is not always edible.By Sarah JampelDecember 13, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Susan Spungen, prop styling by Kalen KaminskiFacebookTwitterEmailWelp, I fell into a pile of glitter and came out looking like Mariah Carey’s ugly kid sister.I’ve been caught with my paint brush in the golden pot of edible glitz (a.k.a. luster dust), carefully coating senior food editor Chris Morocco’s Snickerdoodle Party Cookies so that they’ll glimmer like gemstones from across the room. (I can implicate my colleague Hilary Cadigan—also guilty as charged.)Purists can hate on edible glitter all they want, but they can’t deny that it turns otherwise regular old ‘doodles into party doodles. Fashion doodles, even! And come to think of it, a dusting of glitter could take nearly all doodles—Golden Doodles, Labradoodles, Saint Berdoodles (yes, they’re a thing)—from monochromatic to dynamic.As someone who received one tube of pink facial glitter from my cool babysitter when I was eight, then used pea-sized drops on my nonexistent cheekbones for the next ten years (and only on the most special occasions), I’ll gladly admit that I’m as attracted to glitter as the next silly human. Oooh, sparkly! is just about the only thought that goes through my head when I see something that catches the light in the right way.These churros have lots of sparkle, without the funny business.\nPhoto by Laura Murray, Styling by Judy ManciniWhile these snickerdoodles certainly do not need glitter—they already have lots of tricks, like cornflakes, cardamom, brown butter, Chris Morocco’s blood, sweat, tears (a.k.a. “love”)—their appearance certainly benefits from it. Edible glitter is the wellness serum that gives otherwise dull cookies that festive glow appropriate for a season alight with Christmas trees, Hanukkah candles, and your cell phone screen as you scroll mindlessly through the web before bed. It’s glitter that makes them stand out at the cookie swap or holiday potluck before anyone’s even had a chance to taste.But consumable glitter can—and has, in many instances (see glitter lattes and gold wings)—gone too far. Put simply, to use sparkles as a crutch is an abuse of their power. To judge whether glitter is a welcome accent rather than a hasty cover-up or just straight-up Instagram bait, I think about my romantic partner dressed up in a fancy outfit. I want to love the person (or food) whether or not it’s adorned and I don’t want the decoration to be so over-the-top that it makes the person (or food) off putting or unrecognizable. A bagel that looks like it’s going to corrode my esophagus or a pizza that may or may not be molding is too much glitz: What’s fun about questioning whether I'm about to incur bodily harm from a metallic sprinkle mix that’s non-toxic but not necessarily edible? Where’s the joy in setting myself up to, pardon my language, crap rainbows?Instagram contentThis content can also be viewed on the site it originates from.And there are plenty of ways, thank the iridescent angels above, to make food shine with none of these worries. Tell me morning buns or sugar-coated churros, or raspberry rugelach, which get their pink sequined look from a mix of freeze-dried berries and regular old sugar, aren’t sparkly. Even steak looks like a gosh darn shooting star with a little help from flaky salt. The stuff we already have in the kitchen—coarse sugar, confectioners’ sugar, pyramidal salt—makes food glitter and taste better without warnings from the FDA. Just look inside yourself (and your pantry!): You’ve got all you need to sparkle just sitting in wait. You just have to unleash it.*But when you’re grasping for a little extra holiday magic, you have my blessing—for whatever that’s worth—to reach for the luster dust. Just make sure it’s clearly labeled “edible,” okay?*And yes, I am available for all your inspirational speech needs.Explore Bon AppétitTrendsRead MorecultureInstagram Feeding Frenzy: How 'Influencers' Are Changing the Food SceneBy Michelle RuizRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Sarah Jampel"]}