{"id": "c29fd7111178aa3f0851c8de68559c0a", "url": "https://www.bonappetit.com/story/diy-hair-masking", "year": 2018.0, "month": 7.0, "day": 2.0, "content": "Make Your Hair Mask: A Brazen Endorsement of Putting Food in Your Hair | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleA Brazen Endorsement of DIY Hair Masking, a.k.a Putting Food on Your HeadIt's like cooking a delicious meal for your strands.By Maggie LangeJuly 11, 2018FacebookTwitterEmailIllustration by Annalee SoskinFacebookTwitterEmailAre you looking for an amorphous sort of tonic for an amorphous sort of uneasiness? A solution to boredom or excitability or a bad day or the impulse to put on glittery green eyeliner at 6 p.m. while staying in your cozy clothes? Me too. There are many options for us during these moods, but I found a peculiar solution to recommend:Make yourself a freaky hair mask from stuff in your kitchen. Lean your whole body over the sink and press some food-based paste into your hair. It’s just the blissy, messy, relaxing-invigorating thing you’re looking for.My first experience with kitchen-sourced hair masks came after reading a recipe on Into the Gloss with the headline: The Best DIY Hair Mask Was Invented By Witches. I am both nosy about witches and into doing things on my own. I made the mask but chose not to invoke the suggested incantation, which is probably why I was cursed, and an electrician from Southern California Edison surprise-rang my doorbell not five minutes into soaking time, and I had to guide this person around the side of the house, dripping hair salad dressing all over the grass.This is one of the unexpected joys of making your own hair masks. It’s a gentle and unruly way to exist for ten to thirty minutes. You’ll learn this when a mash of pumpkin is dripping around the sink while you’re trying to do dishes and you’re using a dish towel as a strange sort of cape. You’re a little restrained by the messiness, with nothing to do but sit in repose, basking in some brisk smells of a lemony rinse. Your hair has the weird and terrifying power to potentially splatter and make a big fiasco of everything in its proximity. Was this Medusa’s burden? You understand now.Making hair masks is like cooking for your head, and if you love the buzz of unexpected ingredients getting along like best friends, hair masking is about to be so fun for you. Like cooking, I pour over recipes, then, when it’s time, I just do my own thing based on whatever is in my kitchen.  The base elements are pretty simple, with vaguely different promises (all supposed): olive oil hydrates; egg thickens; lemon reduces oil and lightens; apple cider vinegar cleanses and de-greases; coconut oil conditions; honey moisturizes. A helpful note about egg-based masks: Rinsing with hot water will cook the egg on your head. Oh yes, you are entering into a risky arrangement; it’s possible you could condition a breakfast scramble all up in your hair.Of course, we’re all in it for the bizarre star ingredients. Matcha for silkiness! Strawberries for oil control! I honestly don’t believe any of it, but I try it all. Pumpkin, beer, salt, pepper, almond oil. My skepticism is real, but my interest in a low-stakes experiment is stronger.I do have hard boundaries: no yogurt, bananas, milk, or mayonnaise. All this stuff is very personal. I think my tangle of big curls responded really well to using avocado, but I don’t think I can again because it went against my most basic instincts to guide a hand holding avo away from my mouth and, instead, put it on top of my head. I am my own rambunctious toddler.When people ask whether my hair is shinier, prettier, or better because of masking, the general answer is,  I’m not sure, but I think so? Once, the day after doing an olive-oil-lemon-egg ordeal, I was stopped on the street in Detroit by a person who asked if I was named Bethany, because Bethany owned the store I was in front of, then told me she had “best hair in the business!” This has truly never happened to me or anyone before. It was an indirect compliment, this person was too much, but I took it.Some DIY hair mask recipes I've known, loved, and messed with:I like the second one on this list: a mask that also seems to cleanse, because of the apple cider vinegar. But mostly I like that these guidelines really walk you through it, though I definitely didn’t use a brush for this. How to clean honey from a hairbrush? Not a problem I desire to have, also I don’t have a hairbrush.I make this, my original olive oil-lemon-egg hair mask, the most. But I use about like a third of the olive oil. My God. It took so much of my precious Tunisian olive oil, and I had a lot of leftover goo that just sat in the fridge until I decided to throw it out, because I can’t do a weird mask mask two days in a row.A strawberry hair mask that asks you to put it on damp hair, so I must deviate from the initial instruction on principle (on dry hair only, sorry).A very simple avocado mask, which explains the sort of texture you want (lump-less), but does also tell you to keep it on for 45 minutes. This is a long time. I think after 15 minutes, you can live your life, but your life is not my business.I love that this beer hair mask suggests that you should choose the shade of beer that applies to hair, because I realized, yes, my hair at various points in my life has followed the general color spectrum of beer, I should choose my beer as an aspiration hairshade. This is a certain type of logic.My original avocado recipe, and the first one that warned me about cooking eggs to your hair! I didn’t use the whole egg because my avocado was little. Didn’t want it to be overwhelmed, don’t want anyone to be overwhelmed ever, and really wishing everyone the very best time with themselves and their weird hair masks. Good luck!Explore Bon AppétitHealthyishSelf CareTrendsRead MoreLifestyle5 Foods That Belong On Your Skin and HairBy Katie ChangRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-11", "author": ["Condé Nast", "Maggie Lange"]}