{"id": "c2a2f7b5dd6fd7bdc0391b54d414c34b", "url": "https://www.bonappetit.com/recipe/extra-corny-cornbread-muffins", "year": 2018.0, "month": 6.0, "day": 3.0, "content": "Fresh Corn Cornbread Muffins Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesExtra-Corny Cornbread MuffinsBy Molly BazJune 21, 20184.6(56)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintMade with cornmeal and studded with fresh corn kernels, these not-too-sweet tender muffins are just as good alongside barbecue as they are slathered with butter at the breakfast table.IngredientsMakes 12Nonstick vegetable oil spray1½cups all-purpose flour1¼cups cornmeal¼cup plus 2 Tbsp. sugar2½tsp. baking powder¾tsp. baking soda2¼tsp. kosher salt1½tsp. freshly ground black pepper2cups fresh corn kernels (from about 2 cobs), divided2large eggs plus 1 large egg yolk¾cup sour cream⅔cup milk½cup (1 stick) melted unsalted butter, cooledFlaky sea saltPreparationStep 1Preheat oven to 400°. Generously coat a standard 12-cup muffin pan with nonstick spray.Step 2Whisk flour, cornmeal, sugar, baking powder, baking soda, kosher salt, and pepper in a large bowl. Stir in 1½ cups corn.Step 3Lightly whisk eggs and egg yolk in a medium bowl, then whisk in sour cream, milk, and butter.Step 4Create a well in the center of dry ingredients. Pour egg mixture into well and stir with a wooden spoon until batter is just combined.Step 5Divide batter among prepared muffin cups. Top with remaining ½ cup corn, then sprinkle with sea salt.Step 6Bake muffins, rotating pan halfway through, until tops are golden brown and a tester inserted into the center comes out clean, 18–20 minutes. Let cool slightly in pan. Transfer muffins to a wire rack and eat while warm or let cool completely.Step 7Do Ahead: Muffins can be made 1 day ahead. Store in an airtight container at room temperature.Photo by Chelsie Craig, Food Styling by Molly Baz, Prop Styling by Emily EisenHow would you rate Extra-Corny Cornbread Muffins?Leave a ReviewTell us what you thinkReviews (41)Back to TopTriangleExcellent. Great with dinner; I also enjoy them for breakfast. Wonderful way to use all the fresh corn during the summer season. AnonymousMaryland8/4/2021Turn out so well.  Everybody loves it.  I followed the recipe with reduced salt.  Great tasty corny muffin. AnonymousSingapore6/2/2021I love these! The corn kernels are a nice touch. Steve901 Saskatoon, Saskatchewan 5/10/2021WAY TOO SALTY! I love salt and tend to over salt my food. This is absurdly salty and I did not even add the salt on top. Additionally, the corn on top, push it into the dough or it just gets dried up and falls of the minute you touch the muffin. I used honey and only half the amount so the sweetness was perfect. The muffins are moist and rustic. I think they would be really good if it wasn't inedible because of the salt - so disappointed. BEWARE - very very thick batter - but don't worry comes out perfect texture.The Skinny CoachVenice Beach, California12/24/2020These are GREAT!!! I followed the recipe exactly and it produced a wonderfully corny muffin. They were satisfying for breakfast (I made these early on a Sunday morning) and also later in the day with green chili. Try these. You won't be sorry! Timothy OliverOhio10/25/2020So good! Subbed buttermilk for milk and whole fat Greek yogurt for sour cream and it came out great. Made 12 muffins (used paper liners so maybe a bit smaller than they would’ve been going straight into the tin) plus a mini loaf which I baked for an additional 8 minutes. Delicious!AnonymousPhoenix8/9/2020extremely delicious, solved my cornbread cravings in a pinch. subbed whole milk greek yogurt for sourcream, and i used Bob's Red Mill Stoneground Corn Flour in place of cornmeal. the corn flour is apparently a much finer blend, and it produced an extremely moist, tender crumb which a distinctively nutty corn taste. added a splash of lemon juice into the whole milk to mimic buttermilk. also added a tonnnn of black pepper as per molly's recco in the video recipe and i think it paid off. LOVE THIS RECIPE! 10/10. niccsuxSingapore7/16/2020First of all: These are really nice. A bit too sweet for my taste but still nice. Btw, I ate them with home-made parsley-garlic butter and it was delicious!\n\nAdressing a couple of issues mentioned in other posts, plus a couple of tips:\n1. \"Regular\" rock salt is a lot stronger than kosher salt, so only use about half (1 1/8tsp). That was the perfect amount for me.\n2. I used a little bit less pepper because I ran out (about 1-1.25 teaspoon) and it wasn't too much.\n3. For every German out there: Use type 550 flour, which should be similar to the US AP flour. The result was a bit more \"liquid-ey\" than what's shown in the video and I baked the muffins a bit longer (22-23 minutes in total) but they still turned out great.\n4. I used an normal-sized ice cream scoop, which gave me exactly 16 muffins but either my muffin trays are too small or my scoop's too big: The muffins \"merged\". Next time I'm going to leave a gap at the top (maybe about 1/4\").\n5. Cooking spray isn't sold at my regular store, so I brushed the muffin trays with cooking oil. Never again, they stuck really bad! Next time I'm going to use my silicone muffin cups (without muffin trays) or paper cups (with muffin trays) again!Anonymous7/10/2020I didn’t have any sour cream and didn’t want to make a trip to the grocery store for 1 item so I subbed with canned coconut cream. Because the consistency of the coconut cream is thinner than sour cream, the muffins didn’t rise up as much as the BA video. However, it was still delicious, crunchy, crumbly and I loved how the coconut cream added a nice aroma. I’d probably cut down on the milk next time id I decide to swap coconut cream for sour cream. Otherwise, delicious!AnonymousBay Area6/8/2020I used to think those free Boston Market cornbreads were the GOAT, but this is a TOTAL upgradee <3kristenlovesbroccoliNew York City3/18/2020Very good recipe! I used greek yogurt instead of sour cream since sour cream is very hard to find where I live and the muffins turned out great! I wholeheartedly recommend making them! TerpsichoriGreece12/27/2019heck yeah!!! this recipe rocks! it was super simple and easy to follow. I eyeballed the salt and pepper and added a little paprika. I also added some chopped jalepeno and shredded cheddar cheese and topped them with a little more cheese and it was sooooooo frickin good. Thank you molly!paytonriccisavannah, GA12/19/2019Wayyyyy too much pepper, you could literally see it in the muffin.  I did like the idea of having actual corn incorporated, but if I were to remake I would drastically decrease the amount of pepper. Anonymous12/13/2019These were delicious and easy to make! Based off other reviews and a test run, I skipped the salt and corn on top. Wasn't a fan of how the corn looked but I did include it in the batter. Also added finely chopped rosemary and baked in a loaf pan with a sprig of rosemary on top :) AnonymousBronx, NY 11/30/2019Yup all the rest of the comments basically sum it up--an amazing recipe that will have you getting thirds. Made this for people who had never even heard of corn bread and they fell in love. I used one can of creamed corn instead of the whole kernels from 2 corns just because that's what I'm used to with corn bread and it worked well! Also, used yoghurt instead of sour cream and soy milk instead of milk and it turned out awesome!Anonymous11/23/2019Explore Bon AppétitMuffinPastriesSouthernAmericanCornmealFlourCornVegetableSummerEasySideNut-FreeVegetarianBakingBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-21", "author": ["Condé Nast", "Molly Baz"]}