{"id": "c2be1f2c6f47ea562df91d61550552d8", "url": "https://www.bonappetit.com/story/two-zone-fire-grilling", "year": 2018.0, "month": 6.0, "day": 2.0, "content": "A Two-Zone Fire Is the Secret to Not Setting Grilled Food on...Fire | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Two-Zone Fire Is the Secret to Not Setting Grilled Food on...FireThe secret to grilling everything perfectly all the time without burning off your eyebrows? It's called a two-zone fire, friends.By Alex DelanyJune 14, 2018FacebookTwitterEmailPeden & MunkFacebookTwitterEmailDo you boil water at the same temperature that you make an omelet? Do you sear a pork chop over the same heat that you caramelize onions? Well, maybe you do, but if that’s the case, your onions and omelets might need a little improvement. But I digress. What I’m trying to say is that food doesn’t all cook properly at the same temperature, even when you’re grilling.Despite what you may have seen or heard, grilling isn’t all HOT HOT HOT all the time. Slow-mo grilling advertisements are always full of roaring flames and meat sizzling against ripping-hot metal. It makes grilling seem like it should be intense. All. The. Time. But here’s the thing that any accomplished griller will tell you: A grill shouldn’t be the same temperature across the entirety of the grate, because we don’t cook all foods at the same, high temperature. Of course we don’t. That would be silly. Oh, and the whole thing where there are flames leaping out of the grill dangerously close to the food you're cooking (and maybe your eyebrows)? Those are called \"flare ups,\" and they're actually something you want to avoid.So what do we do? Well, if you’re using a gas grill, you just turn one side of the grill up and turn the other side of the grill down. Bam. That was easy. But if you’re using a charcoal grill, you have to build a two-zone fire. It’s not hard! It’s exactly what it sounds like: You just arrange the hot coals to create two distinct cooking zones with different temperatures.Here's how: Using long tongs, a big metal spatula, or, hell, a stick you found on the ground, push the glowing coals you dumped in your Weber all the way to one side of the grill. There should be a mountain of coals on one side that slopes gradually towards the other side until it disappears completely at the opposite side. We call this a two-zone fire. It gives us high heat on one side of the grill, and a more mellow, chilled situation on the other.Low heat zone on the left. High heat zone on the right.\nOkay. We have our two-zone fire. Now, how do we use it? The side where the charcoal peaks provides direct, immediate heat. This is really good for quick-cooking meats and vegetables. If you’re doing thin pork chops, sliced vegetables, or burgers, this is where you want to be.On the other side of the grill, we have the low heat zone. This is where we want to cook larger pieces of meat and vegetables that require a longer cook time. This works well because the lack of coals allows indirect heat to circulate around whatever you’re grilling, cooking it gently and evenly. This is where we cook things like fall-apart-tender brisket, a whole large fish, or a whole chicken. And remember that thing about \"flare ups\" we mentioned earlier? Well, if you're cooking something on the hot side of your two-zone sitch and things start to get too flame-y, just move it over to the cool side while things mellow out. It's a safe place.And you can also use the two sides in conjunction with one another. You know how, in your indoor kitchen, you might sear something over high heat to get a crisp crusty crust and then transfer it to a low oven to cook through? Yeah: You can do the same thing on the grill with your two-zone setup. Start a thick steak or a pork tenderloin on the high heat side to get a deliciously charred exterior, then transfer it to the low heat side to allow the internal temperature to slowly come up to where you want it. Teamwork, as they say, makes the dream work. And as we say, it also makes the grill work.Wait. Did someone say burgers?The Basically BurgerIt's all about that special sauce.View RecipeExplore Bon AppétitBasicallyGrillCookoutRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-14", "author": ["Condé Nast", "Alex Delany"]}