{"id": "c2c6bbe4a8b08df532da4bb83e6912dd", "url": "https://www.bonappetit.com/recipe/grilled-shrimp-with-old-bay-and-aioli", "year": 2019.0, "month": 8.0, "day": 1.0, "content": "Grilled Shrimp with Old Bay and Aioli Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrilled Shrimp with Old Bay and AioliBy Molly BazAugust 7, 20194.4(20)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Pearl Jones, Bowl from Heath CeramicsEmailPinterestPrintEmailPinterestPrintSeasoned with Old Bay, a little garlic, and some charred lemons, these grilled shrimp channel classic East Coast fish shack vibes. We highly encourage you eat them with the shells on—the crunchy texture and smoky flavor they pick up from the grill are all part of the pleasure. But if you’d rather not, go ahead and peel ’em before serving. Also, they’re just as delicious chilled as they are hot off the grill, so enjoy them whichever way you like.Ingredients4 servings½cup plus 1 Tbsp. canola oil, plus more for grill1lb. shell-on shrimp (16–20 per lb.)3small garlic cloves, finely grated, divided1½tsp. Old Bay seasoning, plus more for serving¾tsp. kosher salt, divided, plus more1large egg yolk2lemons, dividedPreparationStep 1Prepare a grill for medium-high heat. Lightly oil grate. Using kitchen shears, snip down back of each shrimp shell along the vein, stopping at the tails. You may end up cutting a little but of the flesh, but the aim here is to make it easy to peel the shell later (if you choose!) without compromising the shrimp’s tenderness. The shells are a protective barrier, so keep them on when grilling.Step 2Transfer shrimp to a medium bowl. Add 1 Tbsp. oil, two-thirds of garlic, 1½ tsp. Old Bay, and ¾ tsp. salt and toss to combine. Let sit 10–15 minutes while you prepare the aioli.Step 3Whisk egg yolk and remaining garlic in a medium bowl. Finely grate 1 tsp. lemon zest into egg mixture. Whisking constantly, gradually stream in remaining ½ cup oil until thick and pale yellow. Stir in juice of one lemon half. Season well with salt—it should taste really vibrant.Step 4Cut remaining lemon in half. Grill shrimp and 3 lemon halves (cut sides down) until shells are golden brown and charred in some spots and flesh is opaque and cut sides of lemons are deeply caramelized, 1–2 minutes.Step 5Spread aioli on a platter. Arrange shrimp and charred lemons over. Season lightly with more Old Bay.How would you rate Grilled Shrimp with Old Bay and Aioli?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleNo outside grill so I do all. my stuff on a cast iron grill pan. Using the broiler and a sheet pan ro spread tboth shrimp and lemon slices was a wonderful idea! (Thank you, Brock Toon) Also had some lemon aoli in the fridge, Added a kick of Old Bay (always a can of it in the cupboard.)  PS:  Eating them with the shells ON? Another new idea!  Thanks, Molly!Loretta Heuer7/28/2021I trust Bon Appetit's superb digital content and it has served me well in the past, so I googled the words: 'Bon Appetit,' 'shrimp,' and 'Old Bay,' Per usual, this one was a hit. I made a few adjustments after botching the aioli the first time and using my oven instead of a grill to cook the shrimp. Firstly, start with less oil and add it in as you mix. If you have a power handheld mixer, that will be an advantage over hand whisking. Someone recommended cayenne pepper a few comments below so I added some red pepper flakes last minute which added a nice kick.  I broiled the shrimp with the oven rack about 5-6 inches away from the broiler for about 2.5 - 3 minutes and it was perfectly cooked. I know I will be making this again in the near future because it was outrageously good.\n\nBrock ToonDetroit12/25/2020This was really great! Some people below said to cut the canola oil in the aioli to 1/4 cup, but I found a full 1/2 canola oil worked fine when I added it very slowly. I added a pinch of cayenne pepper to the shrimp as well, which turned out really good! Great recipe.AnonymousToronto, Canada9/19/2020This was A. MAZE. ING.  I braved a thunderstorm to grill these and it was worth it.  I used olive oil rather than canola oil and served it with some grilled sourdough bread and it was delicious. WINNER! AnonymousPennsylvania6/20/2020Made this recently and it was delicious. The aioli was the perfect complement to the shrimp, and my entire family loved it. The charred lemon slices are so underrated in terms of what they add — don't skip that step, and squeeze some lemon on every bite you take! The perfect summer dinner.AnonymousBerkeley, CA8/19/2019ugh... 1/2 cup of canola to 1 egg yolk?  BA's best aioli is 1 egg yolk to 1/4 cup olive oil... my first attempt Molly's aoloi was a mess... cut it back to 1/4 cup but the canola still doesn't thicken like olive oil does .... her recipes are honestly hit or miss and this one is a miss with lots of adjustmentsAnonymousnew jersey8/17/2019Made this tonight! A total hit!Rob FAtlanta 8/13/2019Made this for family this weekend. Was a total hit!!! It will definitely become another BA go-to recipe!!!!SueChen25Toronto, Canada8/12/2019what sides would be served?  And best adult beverage?katsonsGlen Mills, PA8/9/2019i wish that the \" print\" version would not include a large box of advertisement that prints out as well! \nmbgraves323456new jersey shore8/9/2019Great recipe and eating with the charred shells on is the way to go. Captain ParadiseSanta Barbara, CA8/8/2019This is a killer recipe. No modifications; absolutely perfect the way it is. AnonymousBoston, MA8/8/2019wow. Molly has done it again. AnonymousChicago8/8/2019Explore Bon AppétitNew EnglandAmericanShrimpShellfishSeafoodGarlicVegetableSummer5 Ingredients or FewerStarterMainDairy-FreeNut-FreeGluten-FreeKetoGrillingMemorial DayLabor DayFourth Of JulyDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-08-07", "author": ["Condé Nast", "Molly Baz"]}