{"id": "c2d6128d9d6b3b1707aecce36738af62", "url": "https://www.bonappetit.com/story/how-to-thaw-frozen-shrimp", "year": 2019.0, "month": 5.0, "day": 3.0, "content": "How to Thaw Frozen Shrimp and Win Weeknight Dinner | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow to Thaw Frozen Shrimp and Win Weeknight DinnerWhether you've got 24 hours or 24 minutes, we've got you covered. Here's how to thaw frozen shrimp perfectly, every time.By Alex DelanyMay 21, 2019FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Pearl JonesFacebookTwitterEmailShrimp are a frozen food that we absolutely, wholeheartedly co-sign. Unlike some other foods that suffer in the freezer, shrimp thrive. But in order to really understand their true beauty, you have to learn how to thaw frozen shrimp properly. You can't eat them as-is, folks. You just can't. They have to thaw.Now, thawing is literally just the process of something frozen becoming...not frozen. But when thawing food, certain best practices will help ensure that the texture of the product is preserved. In all cases, and especially with delicate items like shrimp, it's important to avoid shocking the food with rapid or extreme changes in temperature which can mess with the texture and even risk partially cooking it—obviously not ideal. You have to do it right. The good news? You've got options.Are you the kind of person who actually thinks about what they want to eat for dinner more than a couple of hours in advance? Good on you! If you want to make, say, our new Shrimp Scampi Pasta recipe tomorrow, then your best bet is to pull that bag of frozen shrimp out of the freezer today and simply pop it into the fridge. They'll thaw gradually overnight, which is probably the ideal scenario, and be ready to cook by dinnertime.But let's be real: Most of us don't think that far ahead. You figure out what you want to cook in the afternoon, go shopping after work, and start cooking shortly after you get home. That's okay! You've still got plenty of time to thaw that shrimp. Just take the unopened bag, place it in a big bowl full of cold water, and use a plate or other heavy thing to weigh the bag down so it is fully submerged—45 minutes later, you'll have ready-to-cook shrimp!Okay, but what if 45 minutes sounds like an eternity? You're hungry, and tired, and you need that shrimp to be thawed, like, now. We got you. Take that bag of shrimp out of the freezer and open it. Dump those shrimp directly into a big bowl of cold water so they're all completely covered. (Warm water will start to change the tender texture of the shrimp, so please, make sure to use cold water. That’s important.) Depending on the size of the shrimp, this process can take anywhere from 10 to 20 minutes. How easy is that?! Some people are wary of this method because they worry that the shrimp will take on excess water, but we don't find this to be the case. (They lived in the water, didn't they??) Just don't let them soak any longer than they need to and you're in good shape.(You probably don't need us to tell you this but, regardless of thawing method, you'll know they're finished when the exterior of each shrimp looks translucent, and you can run your fingers over them without feeling any remaining ice crystals or hard frozen parts.)Throw those shrimp right in. No bag necessary!\nPhoto by Chelsie Craig, Food Styling by Pearl JonesWhen the shrimp have thawed completely, place them on a sheet tray or plate lined with paper towels. We want to remove as much excess moisture from the exterior of the shrimp so they can brown nicely without overcooking. Lay a paper towel over the shrimp and pat them dry as thoroughly as possible. Make sure to leave no shrimp un-patted. Un-patted is most certainly not a word, but we're using it anyways.Now you can season your shrimp with salt, a marinade, or a spice blend. They’re thawed. They’ve been treated kindly. They’re ready to be cooked. And cook some tender, sweet shrimp you shall. You deserve it.Now that you know how to thaw frozen shrimp, let's make some pasta!Shrimp Scampi PastaButtery, garlicky, irresistible shrimp scampi—but make it pasta.View RecipeExplore Bon AppétitBasicallyShrimpRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-05-21", "author": ["Condé Nast", "Alex Delany"]}