{"id": "c2d9fd768854b78fcc5e6e461d614b36", "url": "https://www.bonappetit.com/recipe/expertly-spiced-and-glazed-roast-turkey", "year": 2019.0, "month": 10.0, "day": 3.0, "content": "Spiced and Glazed Roast Turkey Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2019 IssueExpertly Spiced and Glazed Roast TurkeyBy Andy Baraghani and Brad LeoneOctober 15, 20194.8(297)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Kalen KaminskiEmailPinterestPrintEmailPinterestPrintOur mission: To miraculously roast a turkey that is well seasoned, juicy, and—can we type this loudly enough?—PROPERLY COOKED! Every part of the bird deserves equal love and appreciation, without a dry bite in the house. Our solution: The absolute inarguably best way to cook a turkey is to break it down into parts, dry-brine it, and roast it on a wire rack in a baking sheet. The parts expose every piece for even cooking. If the idea of doing surgery on a raw turkey gives you a stress rash, ask the butcher to do it (even at the supermarket, we called and asked!). Here’s your script: “Hello, talented and smart and underappreciated butcher [pause for uncomfortable laughter], I’d like to purchase a 12-to-14-pound turkey, cut into five pieces: the legs, wings, keep the breast whole, backbone removed. Yes, I’m doing that ridiculous Bon Appétit recipe. Yes, it better not suck.” Works every time. See all of the Absolutely, Positively Perfect Thanksgiving recipes here.Ingredients8–10 servingsTurkey112–14-lb. turkey, neck and giblets removed2Tbsp. whole black peppercorns2Tbsp. whole pink or black peppercorns½cup Diamond Crystal or ¼ cup plus 1½ tsp. Morton kosher salt2Tbsp. garlic powder2Tbsp. onion powder1Tbsp. light brown sugar1Tbsp. smoked paprikaGlaze and AssemblySmall handful of hardy herbs (such as sage, rosemary, bay leaves, and/or thyme)4garlic cloves, crushed22x1\" strips orange zest⅓cup low-sodium soy sauce⅓cup (packed) light brown sugar⅓cup sherry vinegar or red wine vinegar6Tbsp. neutral oil (such as vegetable, peanut, or canola)Special EquipmentA spice millPreparationTurkeyStep 1Place turkey, breast side up, on a cutting board and pat dry. Grip a wing and pull it outward so you can see where it attaches to the body. Using a sharp boning or chef’s knife, cut though the joint to separate the wing from the breast (if you hit bone, you’re in the wrong spot; pull the wing out farther to help you get into the place where the joint meets the socket). Remove wing; repeat on the other side.Step 2Cut through skin connecting 1 leg to carcass. Pull leg back until the ball joint pops out of its socket; cut through the joint to separate leg. Repeat on the other side.Step 3Now for the breast: Position the turkey breast side down with the opening facing you. Using kitchen shears, cut along one side of backbone until you get all the way through the neck end, then turn the turkey 180° and cut through the other side to remove the backbone (save it for making stock).Step 4Very finely grind black and pink peppercorns in a spice mill or mortar and pestle; transfer to a medium bowl. Add salt, garlic powder, onion powder, brown sugar, and paprika and use your fingers to mix together.Step 5Place turkey pieces, skin side up, on a wire rack set inside a rimmed baking sheet. Sprinkle salt mixture liberally all over turkey, patting to adhere. You may not need all of it, but it’s good to have extra since some will end up on the baking sheet. Chill bird, uncovered, at least 24 hours and up to 2 days.Glaze and AssemblyStep 6Remove turkey from wire rack and rinse baking sheet and rack if needed (turkey will most likely release some liquid). Line baking sheet with 3 layers of foil to make cleanup easy and set rack back inside. Arrange turkey pieces on rack, skin side up, and let sit at room temperature 2–3 hours to help decrease the cooking time.Step 7Meanwhile, cook herbs, garlic, orange zest, soy sauce, brown sugar, and vinegar in a small saucepan over medium heat, stirring occasionally, until sugar is dissolved and glaze thickens slightly (it should just barely coat a spoon), 10–12 minutes. Remove glaze from heat.Step 8Place a rack in middle of oven; preheat to 425°. Rub turkey with oil and pour 1 cup water into baking sheet. Roast turkey, rotating baking sheet halfway through, until skin is mostly golden brown, 20–25 minutes. Reduce oven temperature to 300° and continue to roast turkey, brushing with glaze every 20 minutes and adding more water by ½-cupfuls as needed to maintain some liquid in baking sheet, until an instant-read thermometer inserted into the thickest part of breast registers 150°, and 170° when inserted into the thickest part of the thighs, 50–70 minutes longer (total cooking time will be 1–1½ hours). Skin should be deep golden brown and shiny. Transfer turkey to a cutting board; tent loosely with foil. Let rest 30–60 minutes before carving.How would you rate Expertly Spiced and Glazed Roast Turkey?Leave a ReviewTell us what you thinkReviews (155)Back to TopTriangleI've made this turkey 3 times now – and every person who tries it says it's the best they've ever had! The glaze is delicious, white/dark meat are both so moist and flavorful... you simply can't go wrong. I recommend leaving the paprika out of the dry rub – I think it adds a flavor that doesn't really /go/ with the glaze, but if you're a paprika stan leave it in. Best turkey ever – will come back to this recipe year after year!JamieNew York, NY12/24/2021Haven’t  made this turkey yet but have a couple of comments. First and regarding breaking the turkey down into pieces, perhaps the authors miscommunicated when instructing how to remove the legs as I can only believe they mean the thigh and in so doing end up with a leg quarter which then can be separated into a single leg and thigh at some point. Second, and regarding roasting and achieving 150 degree F temp for the breast and 165 degree temp for the thigh, should the breast be removed from the oven once it reaches the 150 degree F temp and tented and the remaining pieces left to continue roasting until the thigh hits the 165 degree F temperature  since the roasting instructions say it will take additional time for the thigh to reach its final temperature?WilliamManor, Texas12/22/2021Fantastic recipe.  Makes the bird super moist and flavorful.  Best holiday turkey ever!!  I used this same recipe the following week for roasting a spatchcocked chicken.  Amazing too.AnonymousSouth Florida12/8/2021Great recipe.  I am going to give it a try.  The only thing I disagree with is leaving the turkey on the countertop to warm up for 2-3 hours.  This is poultry and you do not need to warm it up.  It is a safety thing with poultry.  In cooking school when we were doing poultry never was it left on the countertop to warm up.MikeMinnesota 12/5/2021This was the first time to try this recipe for Thanksgiving!  I had a fresh turkey and the butcher was happy to cut and separate parts for me.   It was a hit!  Followed directions to a tee -  even carved and displayed like the picture.  Very happy with results!  We took a picture to share.  \nKaran Fishers, IN  12/1/2021I made this for Thanksgiving with a 22 lb. bird. It was a big hit (very tasty) and got lots of rave reviews. I will definitely use this recipe again. Based on other reviews and due to the larger turkey, I doubled the quantities for both the brine and the glaze, which left me with more than enough of both. A couple of notes: In Step 6, the recipe says to line the baking sheet with 3 layers of foil to make clean-up easier. Somehow, I missed this which turned out to be a big mistake - the sugar from the glaze burned onto the pan making cleanup very difficult. In Step 8, the recipe says to pour water onto the baking sheet. Again, I missed this - I guess I was juggling too many dishes. The turkey tasted fine without the water in the pan and was very moist, but the water probably would have prevented the dripping glaze from burning and may have reduced or eliminated the smoke that the burning glaze created in the oven. I'm not sure how the steam would have affected the final product. In Step 8, you're supposed to rub the turkey with oil - doing that removes some of the brine, but not all of it. After reading some of the other reviews, I decided to run water over a few of the pieces to remove the remaining brine before coating the turkey with oil. IMO, rinsing off the brine was a good step - some of the unrinsed pieces were a little salty. In Step 8, the recipe says to glaze the turkey every 20 minutes - in my case, the glaze stuck well to the thighs and wings, but not to the breast. On the breast, it beaded off (due to the oil?) and never really developed much of a coating. I'm not sure why it didn't stick to the breast when it stuck to the other pieces, but even with very little glaze, the turkey tasted spectacular. Finally, I have members of my family who are very sensitive to garlic and onions. Accordingly, I eliminated the garlic powder and onion powder from the brine and the garlic cloves from the glaze - it still tasted spectacular. So, if you're looking for a flavorful recipe and you have the handicap of not being able to use allium, I'd highly recommend this.AnonymousPhiladelphia, PA11/29/2021Made a trial whole turkey breast which turned out amazing so made a 22 lb turkey in parts and another whole breast for Thanksgiving and it also came out fabulous! I did the spice rub 48 hours in advance. Best holiday turkey we have ever had and will be there recipe we use going forward. Also super easy if you can get the butcher to cut it up for you! Moist and gorgeous! Actually, so good we will make the breast all year- made perfect leftoversStephanienewton, MA11/29/2021Doubled the recipe and did this with a 19lb bird. Excellent! My first time roasting a turkey (previously had smoked, sous vide, fried....you name it) and I am happy to report it turned out beautifully. A HerreraDFW, TX11/27/2021MAKE THIS NOW! You will NOT be disappointed.  Every year i try a different recipe in search of the most flavorful and juiciest Turkey. I will search no more. The flavor is amazing. All of my guests raved about how delicious it was. I didnt prepare the Turkey 24/48 hours in advance as i should have (didnt read that step) and it was still the best turkey ever made.Melissa CARoseville, CA11/26/2021why are you people asking questions?\n\nThey never answer.Anonymoustmofnw11/25/2021This will be third year in a row I make this recipe. First year I fried it whole and everyone raved. Did pieces last year and this year— I’ll bake it up again tomorrow. Delicious recipe but I definitely need to get the butcher to cut it up next time. It’s a real pain and totally exhausting! This recipe is so fantastic though—juicy and flavorful. We are lucky to have a fridge in the garage so we don’t overpower everything with the strong smell.PJS-TXTexas 11/24/2021Pacepuleo, I do not use onion powder or garlic powder either. I swapped out ginger powder and orange zest. Turned out great! KTSBethlehem, PA11/24/2021Roasting the turkey in parts is so much easier and better!  And this is a delicious way to do it.  One quibble:  you promote excessive use of foil.  It is so environmentally damaging, from mining to manufacturing, packaging, use and disposal.  \"Making clean-up easier\" isn't a good trade-off for all that damage.  Soak your roasting pan in a solution of baking soda and water; or dishwasher detergent.  yes, you'll still have some clean-up.  Please think about this when you publish your (great) recipes.  Ditto for plastic wrap!rspnew york11/23/2021Maybe a stupid question - do you rub the whole piece with the salt mixture in the dry brine phase, or just the skin side?  Same question for the oil. Thanks!Anonymous11/23/2021Made this turkey for a Friendsgiving - people were raving about the flavor and how moist it was. I've cooked turkeys a number of ways (spatch-cocked, whole, in an oven bag) and this was by far the juiciest turkey. Will be my go-to from now on. Would recommend doubling the glaze as I needed more than what was listed.Claire StamboSan Francisco, CA11/22/2021Explore Bon AppétitAmericanTurkeyPoultryMainDairy-FreeRoastThanksgivingDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-15", "author": ["Condé Nast", "Andy Baraghani", "Brad Leone"]}