{"id": "c2ee1194cd530e52ab5ec91e802a82b0", "url": "https://www.bonappetit.com/story/libbys-pumpkin-pie-recipe-history", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "A Brief and Buttery History of Libby’s Pumpkin Pie Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureA Brief and Buttery History of Libby’s Pumpkin Pie RecipeThe recipe on the back of the can was considered the gold standard. And then it changed. By Priya KrishnaNovember 20, 2019FacebookTwitterEmailPhoto by Laura MurrayFacebookTwitterEmailEvery year, food magazines will attempt to reinvent Thanksgiving dinner. We are not exempt. Wrap your turkey in bacon! Stuffing fried rice! Sprinkle MSG in your gravy! And so on. But let me tell you a secret: We all know that when it comes to pumpkin pie, most people are making the exact same recipe year after year, and that’s the one on the back of Libby’s canned pumpkin.The Libby’s recipe is so widely circulated that you may not even know you’re using it. It goes something like this: blend pumpkin filling, evaporated milk, eggs, ginger, cloves, cinnamon, sugar, and a pinch of salt, pour into a pie shell, bake for close to an hour. Let cool to room temperature. The finished pie is moist (but not tooooo moist), smooth (with just a liiittle texture), and tickles you—but doesn’t hit you in the face—with warming spices. It’s the mild, silky, whipped-cream-dolloped coda you crave after a hefty Thanksgiving meal. Sound familiar?The truth is, Libby’s version may not be the most interesting or most creative recipe. There are thousands more on the internet. You could whip out the kitchen torch to brûlée your pumpkin pie. Add miso to it, go crazy. But Libby’s is the one that many people consider to be the gold standard for how pumpkin pie is supposed to taste. Myself included.The first time I had pumpkin pie was at my school cafeteria when I was about eight years old. It was the Libby’s version. The homogeneous texture was weird and alarming at first. How did they get it so smooth? The barely-there taste of ginger and cinnamon made me wonder why not just add a little more? But I couldn’t stop eating it. From then on I made sure that pumpkin pie was added to my family’s Thanksgiving rotation, which up until then consisted of apple pie and shrikhand, a dessert of strained cardamom-flavored yogurt. Slowly, pumpkin pie outstripped all the other sweets in popularity. I ate it for breakfast the next morning. And many mornings after that. I was obsessed, but specifically with the Libby’s version.But imagine if these were pies.\nPhoto by Laura Murray, prop styling by Allie WistLibby’s was started as Libby, McNeill & Libby, a canned meat company in Chicago, in the late 1800s. That’s right—canned meat. The company brought canned pumpkin into its fold in the late 1920s, when it purchased Dickinson & Co. of Eureka, Illinois. Pumpkin, in general, was having a moment, conjuring “saccharine-sweet images of rural New England life” during a time when people were moving into cities, says Cindy Ott, a professor at the University of Delaware and the author of Pumpkin: The Curious History of an American Icon. Pumpkin pie had become synonymous with the pumpkin thanks to the dish’s growing association with Thanksgiving. That association started around 1827, when magazine editor Sarah Josepha Hale published a novel, Northwood, which listed pumpkin pie as part of the traditional Thanksgiving meal. This was also due to a popular pumpkin pudding recipe published in Amelia Simmons’s 1796 American Cookery, one of the first American cookbooks. Her pudding called for pumpkin, milk, molasses, eggs, ginger, and allspice.Libby’s hired a recipe developer named Mary Hale Martin to start a home economics department and promote recipes for its various canned products. The pumpkin pie recipe that Libby's and Martin were to make famous first appeared on the back of a Libby’s can, in 1929. It was quite straightforward: canned pumpkin, eggs, milk, sugar, cloves, allspice, and cinnamon (there’s no recipe for a crust; it simply says “pour into a pie pan lined with pastry”). In the 1950s the recipe was adjusted to the version most people know today, with the additions of dried ginger and evaporated milk, which cuts the cooking time and brings a more intense dairy flavor.Before Libby’s recipe, pumpkin pie was considered a labor of love. It required breaking down, seeding, roasting, and mashing the gourd. Canned pumpkin existed well before Libby’s, but it was the company’s decision to pair this recipe with its low-moisture canned pumpkin (for perfectly-creamy-not-soggy pies) that was a game changer. Suddenly pumpkin pie was a dessert anyone could whip up in an hour.Soon the recipe was everywhere, becoming a fixture on the can and in widely circulated magazine advertisements. (It likely helped that in 1971 the company was acquired by Nestle, which had a huge reach in grocery store aisles.) These days if you Google “pumpkin pie recipe,” the results that pop up are either the Libby’s recipe or versions that are slight modifications of it. Libby’s now produces 85 percent of canned pumpkin in the United States.I recently put out a call on social media asking for everyone’s favorite back-of-the-package Thanksgiving recipe. Almost everyone responded with the Libby’s pumpkin pie.“It seems to be the perfect recipe,” Greg Bair, a Dallas-based lawyer tells me. “If you add or take away from it, it is not as good.”Unlike other Thanksgiving staples, when it comes to pumpkin pie, people don’t want anything but the classic—the Libby’s version. My family’s Thanksgiving abides by our Indian-ish philosophy, with spice-heavy fall dishes matar paneer, aloo gobhi, and a fenugreek-y sweet-and-sour butternut squash. But when a certain family member who was in charge of desserts tried to propose a pumpkin pie seasoned with cardamom and maple syrup, there was a full-on riot. We love cardamom. We love maple syrup. But neither are welcome in our pumpkin pie. We don’t want the heady spices. We don’t need any of that earthy sweetness. We know the best pumpkin pies have rustic gourd flavor front and center.“People expect pumpkin pie to taste like the Libby’s recipe because that shaped the Platonic ideal of a pumpkin pie,” explains Marilyn Naron, an illustrator and former pastry chef (and self-identifying Libby’s pumpkin pie fan) based in Lawrence, Kansas. “If you bite into a pumpkin pie that doesn’t taste like that, it will inevitably feel a bit disappointing.”Let’s not forget that the recipe continues to be one of the easiest dishes you can put together for a Thanksgiving table. Faced with cooking a meal that can seem daunting and complicated, it’s comforting for less experienced cooks to know there’s at least one element that’s a sure win.The consistency! It almost already looks like pie filling.\nPhoto by Laura MurrayA few weeks ago Libby’s shocked customers by announcing that it was changing its recipe after 70 or so years to add sweetened condensed milk, less sugar, and slightly different spice ratios. Meredith Tomason, a test kitchen manager for Nestlé, says the change was inspired by a desire to “give new life” to the recipe, as she saw that more young home cooks were taking on the challenge of cooking Thanksgiving dinner for the first time. Sweetened condensed milk makes the pie batter easier to mix and the finished product a little creamier, she adds. (Both the old and new versions are listed on the back of the can.)The change was breathlessly covered online (“Thanksgiving Shake-Up: Libby’s Changes Iconic Pie Recipe” “Libby’s Has a New Pumpkin Pie Recipe for the First Time In...Well, Ever”), but given the vast popularity of the existing recipe, people on the internet weren’t thrilled.“Why add more cloves to the ingredients? It was just fine the way it was,” complained one commenter on Libby’s Facebook page.“I think I will stick to the original!” said another.“Not cool, yo,” someone huffed.“That pie is about home and family and comfort,” Naron says. No matter how many versions are published, that 1950s version “is always going to be at the top of the pumpkin pie hierarchy.”I tend to agree. Pumpkin pie isn’t about bringing the jazziest, most complicated version to the table. It’s about bringing the most nostalgic one. And by that measure, all roads seem to lead to the back of the Libby’s can.Read more: This Is the Only Canned Pumpkin You Should Ever BuyExplore Bon AppétitThanksgivingPieRead MorePumpkin Chiffon Pierecipes40 Thanksgiving Pie Recipes & Ideas That'll Keep Everyone Going Back For MoreGallery40 SlidesBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-20", "author": ["Condé Nast", "Priya Krishna"]}