{"id": "c3050336df37541dcb0a8ba142dbe2e6", "url": "https://www.bonappetit.com/story/untouched-food-on-the-bachelor", "year": 2018.0, "month": 3.0, "day": 1.0, "content": "All of the Tragically Untouched Food on 'The Bachelor' This Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureAll of the Tragically Untouched Food on 'The Bachelor' This SeasonAnd some food, gasp! that was actually consumed.By Molly FitzpatrickMarch 6, 2018FacebookTwitterEmailPaul Hebert/ABCFacebookTwitterEmailFive years after he was dumped by Emily Maynard on national television, race car driver Arie Luyendyk Jr. has emerged from cryogenic sleep to assume his rightful mantle as The Bachelor.A lot has changed since 2012 on this flaming, Earth-shaped piece of poop somebody left as a prank on God’s doorstep, but in the magical world that Chris Harrison has built for us out of rose petals and flat champagne, at least one thing has remained the same. The mouth-wateringly beautiful meals served on dates and in the Bachelor mansion almost always remain bafflingly untouched. Take this journey with a full heart and an empty stomach.[Spoilers ahead!]During this dramatic three-hour finale presentation, both women sit down for meals with Arie’s family, as is Bachelor law. I confess that I don’t have the slightest idea what it is that Lauren is (not) eating here, largely because I am transfixed by the family of unequivocally haunted dolls looming over her right shoulder.After a rainy hike to Machu Picchu, Lauren and Arie share the final moments of their final date with a pair of meat logs.ACTUALLY EATING FOOD ALERT: This llama (alpaca? vicuña? I promise I mean no disrespect to any South American camelid species) is the only living organism that is deemed worthy of receiving any non-alcohol-based nutrition in this episode.Becca and Arie’s family—oh my god. Now there is only one haunted doll. Where did the rest of them go? They could be anywhere. Don’t make any sudden movements, Becca. Arie’s not worth it.Unless this is an optical illusion and the glasses are in fact three inches away from the camera, someone saw fit to serve Becca and Arie smoothies the size of their heads.In Becca’s hotel room, an itty-bitty tart is served to the couple. Given that Arie will dump Becca after proposing to her, one can only imagine that the dessert tastes bittersweet.PreviouslyWeek 9ACTUALLY EATING FOOD ALERT: Bienvenidos a Perú! Kendall and Arie, wearing coordinating black and white bandanas, pause their dune buggy adventure for a picnic. It’s unclear what they’re snacking on, but there is an extremely good chance that whatever it is is tasting extremely sandy.ACTUALLY EATING FOOD ALERT: For dinner, they enjoy what appear to be some tasty-looking baked scallops. “I don’t know if I trust it,” Arie says as he inspects one before taking a bite. Normally a comment like that would make me roll my eyes, but this man was forced against his will to perform taxidermy last week, so I’m willing to cut him a break. The actual entrée is served when Arie attempts to eat Kendall’s brains through her mouth shortly thereafter. It is, after all, fantasy suites week.In the morning, Arie makes Kendall eggs, which she likes “super crispy on the bottom.” This, to me, sounds like a pretty terrible way to take your eggs, but isn’t that the whole point of this show? The heart wants what it wants, in terms of both breakfast and marriage.After a plane ride over the Nazca Lines, Lauren and Arie trade I-love-yous. More importantly, she pairs her grilled fish fillet with a delicious pisco sour. Arie meanwhile, continues to be a red-wine-with-seafood kind of guy. This might be the single most interesting thing about him.Exactly one (coconut?) dessert is made available to Arie and Lauren in their sex apartment. Actually, it is possible that this is part of the permanent decor.Becca and Arie are served delicate crostini and bite-sized tasties in a tent in a beautiful oasis, which is romantic until you consider just how isolated they are, and that maybe they should have some more food and also water and flashlights around, just in case of emergency?“Oh my gosh! Wow! This is so incredible. This is so cool.” Arie seems more enthusiastic about the sight of a full bed laid out with an odd number of strawberries than he did their afternoon island-hopping on a catamaran.Arie and Becca enjoy a post-coital, pre-inappropriate confrontation by an ex-boyfriend breakfast of fruit and muffins in the sand.Week 8It’s finally time for hometowns, the Olympics of love! The sumptuous, mega-grapes spread at Chez Kendall says, “We are a cool L.A. family with the disposable income to support our daughter’s lifelong taxidermy habit.”Appropriately, Tia’s family represents their native Weiner, Arkansas with pigs in, and out of, blankets. Who needs cocktails when you can toast with cocktail weenies?ACTUALLY EATING FOOD ALERT: In a Minnesota orchard, Arie and Becca K. make and eat caramel apples, possibly the stickiest, sickly-sweetest, and altogether worst dessert to consume on a date, but that doesn’t mean I’m not envious.At Becca’s house, the family sits down for a plated meal of what looks to be soup, biscuits, and Arie’s palpable fear over his impending interrogation by protective Uncle Gary.This episode’s theme of toasting with objects that are not meant to be toasted with continues in Virginia Beach, where Arie and Lauren romantically clink their crab legs.In case you hadn’t noticed that they live in a mansion with a large pool in its backyard, Lauren’s family serves an elegant pasta dish that might as well be come with a small side salad of hundred-dollar bills.Week 7In the picturesque village of Barga, Arie and Becca K. buy bread from a local, whom they ask, in English, how to say “small” in Italian. The answer is not forthcoming.Then they pick out some cheese and salami from a woman who looks like she has better things to do than serve as tray-pointing human set dressing for the benefit of some Americans from TV. All these goodies, by the way, are intended for a picnic. (The bread guy should have told them that “picnic” is Italian for getting red-wine drunk and twirling to no music in the golden Tuscan sunlight without eating a bite.)I am extremely suspicious of Arie and Becca K.’s dinner, at which we’re shown two cleaned plates but zero eating—and those leftovers sure are artfully arrayed, aren’t they? Becca K.’s remaining brussels sprouts leaves are basically in a golden-ratio spiral. I call bullshit.ACTUALLY EATING FOOD ALERT: Arie and Lauren B. enjoy gelato on the streets of Lucca. Arie, true to character, appears to have opted for a scoop of vanilla.ACTUALLY EATING FOOD ALERT: The bland lovebirds stop next for some “bellissimo” pizza in the town square. This sure is a lot of eating for a date, but something tells me the next-best alternative edit would have been comprised of eight minutes of silent smiling.Arie and Lauren B. smooch over some distant, barely glimpsed meat, which feels like a metaphor for how the five words Lauren spoke on this date were nevertheless enough to inspire Arie to announce he’s falling in love with her.ACTUALLY EATING FOOD ALERT: A man named Giulio takes Seinne and Arie on a truffle hunt with his dogs, then invites them to a homemade lunch of pizza and taglioni (with fresh-shaved truffles) with his family. If Seinne and Arie did not in fact get to eat this food, I would have written a letter to ABC, and another to my congresswoman.Dinner is a far bleaker affair than lunch for Seinne. Perhaps knowing she was about to be sent packing, the production appears to have phoned this one in and procured a chimichanga for her entrée.Some very dry-looking snacks are served on Arie’s group date with Bekah M., Tia, and Kendall, no doubt to make everyone thirsty, in every sense of the word.As Arie bids farewell to Bekah M., note that Tia sits alone with three untouched meals. This was a two-on-one dinner, during which Arie took each woman aside for some alone time. Apparently, contestants aren’t permitted to eat even when left by themselves, off-camera, with their food. I love this television program.Week 6Man points at cheese.\nOn his uncomfortable silence-themed date with Lauren B. in the streets of Paris, Arie points to, but does not eat, some cheese. “We see that all the time in Holland,” he offers. “Like, big wheels of cheese like that.” If the whole real estate thing doesn’t work out, Arie could have a career in narrating riveting travel documentaries.Arie gently bonks Lauren B.’s chicken with his arm when he goes in for a dinnertime kiss, threatening the structural integrity of her mashed potatoes.Sorry for the blurry screenshot: The blink-and-you’d-miss-it platter set out for the gals’ post-Moulin Rouge afterparty is panned over so briefly, it’s like the Patterson footage of Bigfoot.Chateau snacks are served on Krystal and Kendall’s two-on-one date in the French countryside. There’s a slightly menacing, Alice in Wonderland vibe to the pretty pastries, but maybe that’s just because every single person involved with this production wants to scream “eat me” at Krystal.Devastating.\nArie gives Kendall the rose, abandoning Krystal to go canoodle at the Eiffel Tower. Here she sits, left alone with three mounds of rice that are the only friends she’s made while appearing on The Bachelor.ACTUALLY EATING FOOD ALERT [???]: This is a truly weird one. You can plainly see that Arie and Jacqueline’s plates are bare, minus a lonely lemon. And yet, in one shot, Arie is chewing. Unless he’s eating his own tongue out of sheer boredom, this meal remains a mystery.Week 5Chelsea’s one-on-one date with Arie takes them to a yacht, on which she gushes about the “table set for dinner.” Make no mistake: It is set for dinner, but there is no dinner. Unless—Chelsea, do you see dinner?Dinner in its corporeal, non-ghost form finally appears at the Ft. Lauderdale car museum, where Chelsea explains how her ex ditched her for another woman, leaving her belongings in trash bags, when their son was just six months old. In case it wasn’t obvious enough that Chelsea would get a rose after this story, consider the bright red (and green) symbol that is Arie’s cherry tomatoes jammed onto a cocktail stick.ACTUALLY EATING FOOD ALERT: Tia and Arie explore the Everglades on a swamp boat. A man named Darryl welcomes them to his cabin built on stilts. I wonder throughout this sequence if they washed up here by accident, and if Darryl is a random, unusually hospitable stranger who took pity on the crew. He serves them up frog legs, yellowbelly catfish, and deep-fried corn on the cob (“my own invention”), all of which look delicious. This food, like this entire date, is clearly intended to remind us that Arkansas native Tia is a Country Girl™—although, as she delicately points out, she also has a PhD, and she lives in the city now.The second half of their date unfolds at what Arie the wordsmith describes as “an old nautical antique place.” As Tia tells him she’s falling in love with him, I try to figure out whether anyone has bothered to put food on their plates at all. Good thing they went hard on that deep-fried corn on the cob. Finally, a better camera angle reveals what appears to be blackened fish. (The second catfish-based meal of the day?)Week 4Arie and Seinne enjoy a traditional post-parasail Champagne toast. I have a strong hunch that there is food involved, given that we see a picnic basket beside them and Arie chewing on something, but the specific nature of that food is, oddly, never revealed.Then they dine at the Hard Rock Hotel & Casino, where Seinne explains that she’s had a hard time opening up her heart, and how she grew up seeing few black women represented in love stories. Her untouched chicken gets a front-row seat to what amounts to a pretty solid stump speech in the race for 14th Bachelorette. Good luck in your future endeavors, Seinne and Seinne’s chicken!This next one isn’t exactly food, but I would be sorely remiss not to mention it. On a survivalist group date that is a new high, or low, or possibly both for the Bachelor franchise, Arie drinks his pee. Except, just kidding, it wasn’t pee, it was apple juice—a fact he apprises Jacqueline of exactly eight milliseconds before she’s about to actually sample a glug of her own urine.Arie and the gals enjoy a light lunch of worms and grubs dug right out of the soil. This is not a strange joke that I am making. It is a real thing that happened on The Bachelor, a show driven to actual madness in order to compensate for how boring its lead is this season.Taxidermist Kendall is especially game to share a maggot amuse with Arie. What more can I say about this? There is nothing I can say about this. Really, we’re done here.In the evening portion of the group date, Tia overlooks the appetizing cocktail shrampies laid out for the contestants in favor of stress-eating bacon-wrapped dates while Krystal monopolizes Arie’s time, as is her way.Arie’s steak doesn’t get much screentime, as he and Bekah rub each other’s faces with their thumbs and moan about their 14-year age difference throughout their “meal.”Week 3ACTUALLY EATING FOOD ALERT: On their one-on-one date to a vineyard in Napa Valley, Lauren S. (not to be confused with the other 36,000 Laurens on this season) and Arie consume some of the grapes they’re clearly supposed to be picking. Excuse me, these are not sanctioned snacking grapes! Have you no respect for the wine-making process?ACTUALLY EATING FOOD ALERT: Lauren S. pops a morsel of the cheese pictured here into her mouth, which I’m sure comes as a relief to her bloodstream, because these people are drinking a lot of wine.ACTUALLY EATING FOOD ALERT: Food plays a very interesting role in the presentation of Lauren S. and Arie’s dinner: The soon-to-be-dumped contestant gets an unflattering edit, nervously babbling throughout the meal. Just how bad is Lauren S. blowing it? Arie is so bored that he has no choice but to eat his potatoes dauphinoise rather than staring romantically into his companion’s eyes, as is customary. When the camera zooms in on his knife and fork, he might as well be slicing through her chances at love.Poor Annaliese, a survivor of dog-related trauma who Bachelor producers decided to send on a dog-related group date, frets over the fact that Arie hasn’t kissed her yet. In fact, she’s so upset that we spy her raiding the mansion’s rarely seen fridge. It’s unclear what, if anything, she eats, although I do enjoy seeing that Clorox wipes are at the ready on the counter to tackle the cast’s inevitable Pinot Grigio spillages.Annaliese touches up her lipstick, but Arie’s mouth proves to be as sweetly forbidden as the suspiciously pristine jars of candy behind her. He turns Annaliese down and sends her home.Week 2Becca K.’s one-on-one Pretty Woman sugar daddy fantasy date sends her home with a rack of Rachel Zoe dresses and a pair of Louboutins as souvenirs. Also on hand to signify opulence is a shellfish extravaganza. “This spread!” Becca marvels of the lobster and mussels orgy, without coming within 10 feet of it.Moments later, they toast next to a chocolate fountain, and I am relieved that Becca K. doesn’t accidentally swipe a sleeve of her beige sweater into the splash zone.\nAs Becca K. tries on the dresses, Arie grabs a tower of sweets from the counter and jokes, “While I’m waiting!” I’m still waiting to see him eat one.Becca K. and Arie chat over plates of what appears to be…. beef, cornbread chunks, and a mystery slaw? Perhaps this episode’s dinner budget went toward all those clothes.Arie and Krystal take to the skies to visit his hometown of Scottsdale. They’re served an elegant mix of berries, cheese, and salami, the flying-private equivalent of a bag of stale peanuts and half a can of ginger ale.This welcoming snack platter would have been perfect to stress-eat while wrapping your brain around the fact that Arie unexpectedly introduced you to his parents on your first date.The producers didn’t want to pull focus from Krystal’s tale of family woe, so they served her some unadorned rice.After a demolition derby group date, the women walk past a store of secret shadow food that I am half-convinced is the craft services table for the crew, captured on camera by mistake.Week 1Single mom Chelsea packs a peanut butter sandwich and veggie lunch for an unseen child who may or may not exist. (Wake up, sheeple.)At Marikh’s Indian restaurant, her mother whips up a curry that I am easily more attracted to than any human man who as ever served as the Bachelor. The same goes for the giant pot of rice looming behind it, actually.I was so close to casting aspersions about the nondescript sandwiches fitness coach Krystal was placing into brown paper bags, then I realized she was delivering meals to the homeless. Good job, Krystal. Bad job, me.ACTUALLY EATING FOOD ALERT: Caroline brings Arie a pizza. This cheesy contraband no doubt elevates her to immediate frontrunner status.ACTUALLY EATING FOOD ALERT: Lauren G. sensually feeds Arie, his eyes closed, a chunk of pineapple. Cute, but pineapple ain’t pizza. Although it can be on pizza—maybe Lauren G. and Caroline should form a Survivor-style alliance.Stay tuned for more untouched food as we chronicle them week-by-week on The Bachelor. Somebody had to do it.Some food you should actually eat while watching The Bachelor:Explore Bon AppétitPop CultureRead MorecultureIn Memoriam: All the Untouched Food on 'The Bachelorette'By Molly Fitzpatricknew-yorkOur 15 Best Date Spots in New York CityGallery15 SlidesBy The Bon Appétit Staffrecipes17 Recipes to Make on Your Next Date Night (With the Fruit)Gallery17 SlidesBy Christina ChaeyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-02", "author": ["Condé Nast", "Molly Fitzpatrick"]}