{"id": "c3087a52291a5ea7e1524546a849ea2a", "url": "https://www.bonappetit.com/story/reusable-container-desk-lunch", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "The Reusable Lunch Container I Shamelessly Eat My Desk Lunch Out Of | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThe Reusable Container I Shamelessly Eat My Desk Lunch Out OfThese stackable bowls are super functional and surprisingly chic.By Julia KramerApril 2, 2019FacebookTwitterEmailPhoto by Chelsea KyleFacebookTwitterEmailHealthyish Loves It is our weekly newsletter where we tell you about the stuff we can't live without. See our past recommendations here!Who would have thought there were four words in the English language as ominous as: “What ya got there?” And yet, every day, as I toss whatever scraps of sandwich or salad I call lunch onto my desk, I fear nothing more than the sound of those words. Because that means Adam Rapoport, the editor in chief of this website/magazine/brand, is standing in the doorway of my office, watching me. And, of course, judging.There are many ways I could eat my lunch in peace, free from the inquiries of a man who routinely removes his shoes in the office, but the one that has worked the best is to pack whatever I’m eating in an extremely attractive container made by the Netherlands-based company Mepal and sold via Food52, a site whose pristine aesthetic has led me to truly believe that the easiest way to improve all aspects of my life is to buy neutral-toned kitchenware. These bowls are technically called “Microwavable Nested Storage Bowls,” which is interesting because I don’t microwave, nest, or store them. I eat my lunch out of them, and my life is better for it.We love it: Nested Storage Bowls, $60-70 for a set of four.The key thing about these bowls is that, unlike virtually all things I’ve ever packed my lunch in, they are not clear: They’re opaque. And they’re so pretty (look at the colors!) that if you kind of blur your vision a little, you can pretend you’re eating in a real, maybe even ceramic, dish. (They’re also much larger than bowls typically marketed for transporting lunches. Have you ever tried to bring a salad or grain bowl in something the size of a bento box? How do people do it?) And the opacity is not just about form but also function: No prying eyes can see what’s inside.– Julia Kramer, deputy editorBuy it: Microwavable Nested Storage Bowls, $60-70 for a set of four.All products featured on Healthyish are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Explore Bon AppétitHealthyish Loves ItHealthyishShoppingRead MoreLifestyleThis Shallow Bowl Is the Ideal Vessel for Every Food I EatBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Julia Kramer"]}