{"id": "c30cd095edca9b83315e514e2c81614f", "url": "https://www.bonappetit.com/story/umeshiso-little-dipper-spoon", "year": 2021.0, "month": 3.0, "day": 1.0, "content": "Umeshiso's Little Dipper Is the Best Spoon, According to Our Spoon Expert | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureThis Is the Best Spoon, According to Our Spoon ExpertThere’s nothing I’d rather use while cooking, tasting, eating—or anything else you can do with a spoon. By Chris MoroccoMarch 4, 2021FacebookTwitterEmailPhoto by Morgan EckrothFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.I have a well-documented obsession with spoons. In the BA Test Kitchen, I don’t consider my station to be set up until there are at least 50 tasting spoons in the crock on my counter, and when I walk, my spoon-filled pockets jangle like a villain’s spurs in a spaghetti Western. Tasting food, thinking about it, talking about it, and deciding whether it can be better is the crux of my job—and my life. So when I discovered a tasting spoon that felt better in my hand, a touch softer against my bottom lip, and that stood a little taller on my counter, there was no going back.That spoon is Umeshiso’s Little Dipper.Developed for coffee cupping (tasting), with a short handle but a deep round bowl, these spoons have established a dangerous new precedent in my life, the same way sleeping on 600-thread-count sheets for a night will ruin all other bedding for you. I can barely look at another spoon now that I eat with it, cook with it, and use it in all my photographs (the rose gold looks great with everything). And I learned that other loyal fans use it to scoop ice cream and portion out cookie dough (they don’t bend easily!), so I’ll probably start doing that too.The excellence of this spoon is no accident. Specialty coffee veteran Umeko Motoyoshi founded Umeshiso with this kind of frequency (if not variety) of use in mind: “I’m in a unique position because spoons are all I care about,” they say. “Most people use spoons to eat for a few minutes and that’s it. They don’t have to use a spoon over and over again for hours to cup 50 coffees.” Which helps explain why everything about it was so highly considered. Even its weight was field-tested to see what people in the industry liked using best (56–59 grams, FYI).But utility isn’t the only thing these spoons have going for them, either. Motoyoshi launched Umeshiso with the intention of making coffee cupping—an experience typically dominated by white men—more inclusive. “The first Umeshiso spoon was rainbow-colored, as a reminder to myself—a queer, mixed race, nonbinary femme—that I can show up with my rainbow spoon and be my rainbow self,” they say. “That I deserve to be there and my perspectives and my palate are valid.”Overall, it adds up to a spoon that does a better job of being a spoon than any other spoon I own.Umeshiso Little Dipper Spoon$8 at EtsyUmeshiso prices spoons on a sliding scale to provide them more affordably so customers can pay what they can.Explore Bon AppétitHighly RecommendToolsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-03-04", "author": ["Condé Nast", "Chris Morocco"]}