{"id": "c312b925f068bfd036a6c139ae32f692", "url": "https://www.bonappetit.com/recipe/mantou-knots", "year": 2021.0, "month": 5.0, "day": 2.0, "content": "Mantou Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMantou KnotsBy Brandon JewMay 11, 20213.8(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Isa Zapata, food styling by Micah Morton, prop styling by Nicole LouieEmailPinterestPrintEmailPinterestPrintMantou is an extremely versatile dough—you can stuff it, pan-fry it, wrap it around ingredients, or just eat it plain. (Mantou are plain, soft steamed breads, whereas bao are stuffed—often made with a char siu filling or served with roast duck instead of pancakes.) Mantou make for a great snack, a quick breakfast, or an accompaniment to a large banquet meal. They have a craveable, balanced sweetness, but my favorite trait is the texture: pillowy soft, light, and fluffy.For this recipe, which is from my restaurant, Mister Jiu’s in San Francisco, and pulled from the cookbook, we add milk and cream, which cut through the gluten, giving the mantou an even more tender crumb than the classic versions. It’s calibrated for the fluffy, low-gluten flour we source from Hong Kong that’s milled for just these types of steamed applications. You can substitute cake flour, like King Arthur’s unbleached, at home, but you may need a few spoons more of it if the dough feels too wet. —Brandon JewAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonBamboo Steamer Basket$30 At AmazonEscali Primo Digital Scale$25 At AmazonKitchen Towels$22 At AmazonLarge Pot$55 At AmazonIngredientsMakes about 13¼cup plus 1 Tbsp. sugar1¾tsp. instant yeast1¼tsp. baking powder1¾cups (250 g) Hong Kong flour or cake flour, sifted, plus more for dusting¼cup whole milk, room temperature4tsp. heavy cream, room temperaturePreparationStep 1Beat sugar, yeast, baking powder, and 1¾ cups (250 g) Hong Kong flour or cake flour in the bowl of a stand mixer fitted with the dough hook on low speed to combine. Combine milk, cream, and ¼ cup water in a measuring glass or small bowl. Reduce speed to low and, with motor running, gradually pour in milk mixture and mix until dough forms a ball, about 2 minutes. If dough has not formed a ball by then, gradually add more flour a teaspoonful at a time until it does. Continue to mix until very smooth, about 8 minutes more. (Alternatively, you can mix in a medium bowl with a wooden spoon or your hands until a shaggy, loose dough forms, then turn out onto a clean surface and knead until smooth and glossy, about 10 minutes. Place in a large bowl to rise.) Remove bowl from mixer and cover with a damp kitchen towel. Let dough rest until slightly puffed, 30–60 minutes.Step 2Meanwhile, cut out thirteen 3\"-squares of parchment paper.Step 3Portion dough into 13 equal-size pieces (use a scale if desired). Roll each into an 8\"-long rope. Tie each rope into a knot and tuck the end that came through the knot underneath the bun. Tuck the other end up and over the top. Place buns on parchment squares as you go.Step 4Cover buns loosely with damp kitchen towel and let rise in a warm place until slightly puffed and marshmallow-y in texture, 30–45 minutes.Step 5Pour water in a wok or large pot to come 1\"–2\" up sides. Set a steamer with a lid over wok, leaving at least ½\" of space between the inside layer of steamer and water. Bring water to a boil over medium-high heat. Step 6Place as many buns as will fit in steamer, spacing about 2\" apart. Cover and steam until cooked through, about 8 minutes. Transfer mantou to a plate. Repeat process with remaining buns, adding more water to wok as needed. Serve warm.Do ahead: Mantou can be steamed 2 months ahead. Freeze on a baking sheet until solid, then transfer to resealable plastic freezer bags or airtight containers and keep frozen. To serve, thaw in refrigerator overnight, then re-steam 3 minutes.Reprinted with permission from ‘Mister Jiu’s in Chinatown: Recipes and Stories from the Birthplace of Chinese American Food’ by Brandon Jew and Tienlon Ho, copyright © 2021. Published by Ten Speed Press, an imprint of Penguin Random House.\n\nBuy it on Amazon or BookshopHow would you rate Mantou Knots?Leave a ReviewTell us what you thinkReviews (2)Back to TopTriangleWould this work with a GF rice flour mix?\nJanamaui5/17/2021Three stars. These weren't the correct texture that I'm familiar with. I used Hong Kong flour but next time I'm going to make the recipe on the back of the bag....AnonymousSan Diego, CA5/16/2021Explore Bon AppétitBreadChineseEast AsianAsianSichuanYeastOther IngredientsStarterSnackNut-FreeVegetarianBakingLunar New YearBreakfastDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-05-11", "author": ["Condé Nast", "Brandon Jew"]}