{"id": "c317735b54748ee265152912b855bbba", "url": "https://www.bonappetit.com/story/2018-food-trends-to-disappear", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "14 Food Trends We Hope Disappear in 2019 | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture14 Food Trends We Hope Disappear in 2019Get outta here, teeny tiny plates! Enough is enough, dessert HUMMUS.By Alex BeggsDecember 20, 2018FacebookTwitterEmailIllustration by Cari Vander YachtFacebookTwitterEmailNormally it’s my policy to spread love and kindness on the internet—though I make an exception for the people who take home the wine they brought to the party. And when it comes to inanimate food items, I feel okay with writing seething, over-the-top hatred that accomplishes nothing. Sometimes you need to vent, especially at the end of a looooong year. According to the usage stats on my phone, I spent enough hours scrolling Instagram to have gone to law school several times this year. But I didn’t. Instead I internalized all of the past 12 months’ random food trends, soaking them into my ecosystem. Now I’m ready to say goodbye and don’t let the door hit ya where the good lord split ya. I’m going to print out this page and set it aflame in my Weber grill to signify new beginnings in the new year. Here are the food trends I hope to never see again come 2019.Mushroom drinksAre you seriously telling me that funky mushroom powder tastes better than freshly roasted coffee or a nice matcha latte? I’m not saying mushrooms aren’t good for you, I’m just saying they taste MUCH BETTER basted with butter and thyme than mixed with water and powdered chocolate. These “elixirs” promise more than a personal injury lawyer commercial mid-Wheel of Fortune: They claim to be “nature’s viagra,” to sharpen your mind, boost your energy, clear your skin, inspire your next watercolor, get back the job you lost, help you find your missing keys to the safe deposit box. Enough is enough!Wish u were safe.\nRomaine recallsEvery time I hear there’s a romaine recall, I’m forced to picture a thousand people with explosive diarrhea. For that alone—and I know it can get more serious than that—can we stop planting romaine next to creeks next to cow pastures? All of these years of technology and progress and the cow poop is still getting in the water, then to the lettuce, and then to Panera? THIS IS GETTING ABSURD. I’LL COMMIT TO RADICCHIO IF I MUST.  IF. I. MUST.Really small sharing platesOkay, YA GOT ME, is how I feel when presented with a “salad” the same shape as a hot dog on a plate the size of a cookie. The big piece of lettuce trick! How did they fit it on this tiny plate? How do they expect us to get more than a bite at a time on these things? I eat TWO BITES AT A TIME. This is some clown car shenanigans. PLEASE BRING BACK PROPERLY SIZED PLATES IN 2019. MAYBE THEY’RE IN STORAGE.LiesRemember the burger spot that wasn’t really organic? The tuna that wasn’t really from Montauk? The honey diluted with corn syrup? The chef who said he knew nothing about his business partner’s rampant sexual harassment? The romaine that was E. Coli in disguise? The host who said the wait would be 2 hours and then it was 20 minutes and you’d just ordered a drink at the bar next door? There were some HUGE lies in the food world in 2018. I really hope 2019 fares better for truth, transparency, and tuna.Part-time Keto peopleThis is confusing and unnecessary. Short term diets as self-experimentation don’t work in the long run and really frustrate your friends sitting across the table, watching you suffer.Even we’re guilty!!\nVegetable pâté, charcuterie, or other meat imitationsCarrot tartare, broccoli cheesesteak, cauliflower steak. More liars!!CBD lattes, specificallyThe amount of CBD in these has little to no effect and makes ZERO sense paired with espresso. This is some emperor’s new clothes shit, but the emperor is sitting on a throne of cash from all the $$$ you spent on trendy, honestly gross-tasting hemp drinks with adorbs marijuana leaves stenciled in the foam. It’s embarrassing.“Do you have any orange wine?”Technically there’s no such thing as orange wine (I’m lifting my pinky up as I type this). We love the stuff, but please don’t order based on trendy shade alone. It’s more than just a color! And don’t go up to the Olive Garden bartender with your request for the orange stuff.Scallop invasionSome geniuses figured out that everyone loves scallops because they are perfect. And after they chuckled and picked lint off their Harvard sweaters, they put scallops on every menu, everywhere. Like shishito peppers or steak tartare, scallop (especially crudo) is dropped in, willy-nilly, no matter what kind of restaurant it is. I’ll have the SCALLOPS, I sigh, because as basic and omnipresent as it is...I’m always suckered into ordering it. Dream weirder, fish buyers!Tiny tiny water glassesBy the end of the night, your glass has been refilled 47 times. Plus, the waiter’s wrist is getting carpal tunnel from pouring endless splashes of room temperature tap water like it’s a new HIIT workout. NO ONE WINS. Except Ikea, maybe.The same sans serif font on menusW E  G E T  I T .  Y O U  A R T Y .Sigh.\nPhoto by Chelsie CraigSweet hummusI can’t believe we even WENT THERE. Gah! Chocolate in the chickpeas? That’s where the garlic goes! If I attend a party where there’s a bowl of pretzels next to some hummus and it turns out to be cinnamon-sugar flavored—I’m going to call the police. Hello, 911? I’m sorry, this is not a real emergency and a dangerous joke to play on my friends. I can’t believe I called you, this is so inappropriate. I know, I know. The hummus is really terrible. It’s...sweet. And then I’m going to hang up and leave and never come back because I’ve humiliated myself, but not as much as that chocolate hummus has.Coconut chips aren’t potato chipsI have nothing more to add.Adding a novelty “shitty beer” to the menuI love an ice cold Miller High Life at the end of the night, maybe even your wedding (which was nice, by the way) on my journey towards rehydration. And I agree that it has a certain Proustian allure. (I’ve never read Proust.) But when you’re at a trendy restaurant and they have all of these obscure craft beers that someone drove to Vermont to track down, limited editions that were brewed under the wind of a howling dog, and then, lol, the list ends with: Ponies of High Life. Yeah? If someone is too cool for cool beer they can have WINE. This hipster irony has gone TOO FAR. GIMME THE SPECIAL STUFF, MAESTRO!Okay, 2019, I’m ready for ya.Contributing reporting by Christina Chaey, Alex Delany, Elyse Inamine, Rachel Karten, and Emily Schultz. Wow, you guys sure do complain a lot!Explore Bon Appétitholiday2018Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-20", "author": ["Condé Nast", "Alex Beggs"]}