{"id": "c318faf33b38c0844ae6dd0b1dd1d19f", "url": "https://www.bonappetit.com/story/new-providence-restaurants", "year": 2021.0, "month": 10.0, "day": 4.0, "content": "New Providence in The Bahamas Is the Small Island With Big Flavors | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsNew Providence in The Bahamas Is the Small Island With Big FlavorsCome for the sun, sand, and sea. Stay for the amazing food.By Simeon Hall Jr.October 27, 2021FacebookTwitterEmailPhotograph by Julian CousinsFacebookTwitterEmailPresented by Silversea CruisesI consider myself a culinary griot. As in, I’m a storyteller, and the unapologetic theme that underlies my storytelling is that each major island in my native Bahamas has its own unique flavor. The Bahamas is an archipelago of 700 islands, so let’s start with New Providence, where I grew up and honed my skills as a chef. This island capital, which is only 21 by seven square miles, is a melting pot of natives, immigrants, and tourists, which influences the food culture. Here you’ll find burgeoning craft cocktail bars alongside conch salad stands and restaurants featuring the food of fellow islands the world over (Thai curries!) a short drive away from no-frills kitchens focused on Bahamian cooking. These are the restaurants, bars, and shops I visit again and again. I always tell people to come for the sun, sand, and sea, but stay for the food of my homeland.The EssentialsWhen to Visit:Between August 1 and March 31 (lobster season!)Where to Stay:Baha Mar, the islands’ newest luxury resort with three world-class hotels and a wide array of dining experiencesWhat to Bring Back:Locally produced Bee in the Bahamas guava jamFisherman Yellow’s Conch StandPhotograph by Julian CousinsConch salad in The Bahamas is what barbecue is to Texas, what poke is to Hawaii, and what ceviche is to Peru: a local delicacy. It typically includes the raw, chewy mollusk; fresh vegetables; and citrus. Everyone has their go-to combination, and mine comes from this conch stand along Montagu Beach. Fisherman Yellow and his team craft each bowl as skillfully as a well-tailored suit. Whether your conch salad is filled with firm seasonal mangoes, native goat peppers, and extra lime or is scorched (the local term for scored) with onion, lime, orange, and Bahamian bird pepper (my favorite), it’s a must-order. To not have conch salad while in The Bahamas is to not have visited.Island Brothers & CieThis French bistro with island vibes is where I take friends when I want to impress. Located just outside the upscale Lyford Cay community, Island Brothers & Cie is a quaint restaurant run by a family of French expats. I always order whatever the specials are on the menu and the delectable Wagyu bavette with pomme frites. While I usually dine indoors for the ambience, last summer’s breezes have made me keen for the outdoor dining experience here too.Evelyn’s KitchenPhotograph by Julian CousinsIf you’re visiting The Bahamas, I’m definitely taking you to this cozy food trailer on Potter’s Cay dock. Evelyn and her crew serve a mix of Bahamian and Haitian foods: steam ham, ham braised in tomato sauce; griot, citrus-marinated fried pork; and fried fish. This is the kind of home cooking I wish I saw in more restaurants.Sun & IcePhotograph by Julian CousinsWhat do you get when you add local Bahamian fruits, spices, herbs, and nostalgia to a rich crème anglaise? This delightful ice cream shop from chefs Wayne and Ivana Moncur. Situated in the lobby of the Atlantis resort’s Coral tower, the shop churns out small batches of seasonal, locally sourced flavors, like soursop and caramelized sugar banana, allspice potato bread, and benny cake crumble. The dynamic duo also owns Bakehouse, which is known for its creative doughnuts, such as guava-strawberry, PB&J, and hibiscus.ShimaPhotograph by Julian CousinsOn any given night Shima is the backdrop to a date, an important business meeting, a wedding proposal, a party for the newly divorced, and the like. (Shima’s been my spot for a few of these reasons!) The food here celebrates the delicate, savory flavors of Thailand, Indonesia, and Vietnam and uses local ingredients, which makes it feel very Bahamian. The brunch is popular, but I go for dinner and order all the small plates, which change often. If you see the grilled roti—flaky and charred to perfection—get it.Café MatisseParents never openly admit to having a favorite child, although they surely have a stronger connection with one. That’s how I feel about this old-school Italian spot, where the food and service are consistently on point. Try the homemade ravioli with osso buco and roast gravy, or ask about the daily specials. Either way it’ll be unforgettable.Bon VivantsPhotograph by Julian CousinsThis is the premier craft cocktail bar of The Bahamas. The bartenders are not just adept but entertaining, and their drinks don’t disappoint. I love the Big Major Smash, a Bahamian tiki-style rum concoction, and the Zephyr, a citrus-forward gin and tonic. A lot of restaurant folks come here after dinner or a shift to unwind. Just make sure your phone is charged—not only are the drinks stunning but so is the decor. It’s Instagram overloadNesbitt’sThis decades-old mainstay is an earshot away from the crashing waves of the northern shoreline in the Delaporte community. Locals gather to talk about island politics, international news, and gossip, but they linger for the seafood. For breakfast there is an amazing stew fish, the catch of the day simmered in a velvety brown-roux gravy. For dinner there is lightly-floured-and-fried grouper seasoned with bird pepper.Where to Island HopPhotograph by Julian CousinsGrand BahamaGo to the Dolphin Cove resort for gorgeous views, then drive to West End for pickled conch. Great Exuma IslandVisit the world-famous swimming pigs in Big Major Cay and enjoy fried fish or roasted veg on the beach. Harbour IslandFor a luxurious excursion stay at The Landing hotel and try the acclaimed restaurant’s spicy crab capellini. North AbacoAfter Hurricane Dorian, Richie’s Restaurant has returned better than ever. It’s still the spot for smothered pork chops. BiminiErnest Hemingway’s hideaway is also renowned for its baked goods. Head to Charlie’s Bread and order a dozen dinner rolls.Explore Bon AppétitTravelRestaurantsRead Moreculture12 Honolulu Restaurants—For Something Other Than PokeGallery9 SlidesBy Elyse InamineWhere to Eat, Drink, and Stay in ParisGallery10 SlidesBy Lindsey TramutaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Simeon Hall Jr."]}