{"id": "c32a11b604e16c477105b4f530692317", "url": "https://www.bonappetit.com/story/how-to-make-and-use-mawa", "year": 2020.0, "month": 12.0, "day": 3.0, "content": "Indian Mawa/Khoya—How to Make Mawa and Incorporate It Into Your Baking | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAll of My Favorite Desserts Contain This One IngredientIf the words tender, buttery, milky, and rich appeal to you, then you’ll love mawa.By Hetal VasavadaDecember 21, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailWhen I was growing up, my mom would spend long days during the holidays stirring milk over the stove to prepare the mawa she would use to make mithai (sweets) for family gatherings. That sweet, milky flavor laced with a touch of cardamom defined my childhood.Mawa, also known as khoya or khoa, is the quintessential ingredient in so many South Asian mithai, like gulab jamun, burfi, kalakand, milk cake, peda, rabri, and kulfi, all across India, Nepal, Pakistan, and Bangladesh.But I didn’t start experimenting baking with mawa myself until I saw in Christina Tosi’s cookbook, Momofuku Milk Bar, that she used nonfat dry milk powder to make her nostalgia-inspired baked goods. I realized that mawa isn’t just for mithai—it’s also ideal for giving cakes a tender fluffy center and cookies a just-baked, caramelly flavor.This holiday season, we need all the cozy, comforting bakes that we can get, and using mawa in your baked goods will definitely invoke those warm feels.What is mawa?Mawa consists of the milk solids left after simmering full-fat milk until all of the liquid has evaporated. To be considered mawa, the final product should be more than 30% milkfat by weight. Mawa can be made with buffalo milk or cow’s milk. While buffalo milk mawa is generally considered superior to cow’s milk mawa, as buffalo milk is fattier and has a slightly natural sweetness, cow’s milk mawa is more widely used as it’s easier and cheaper to obtain.The texture can vary from dry and crumbly to wet and granular depending on the moisture content of the milk solids. Dhap mawa, which has a high moisture content and a loose sticky texture, is used to make gulab jamun, where deep-fried dough enriched with mawa is soaked in a cardamom, saffron, and cinnamon syrup. Pindi mawa has a smooth nongranular texture and is used in burfis and peda, or fudge-like sweets. And finally, danedar mawa is dry and granular, best used in kalakand (milk cakes), which capitalize on the sandy texture.How do you make mawa? (And, um, is there a shortcut?)This process of making mawa can take a very long time as you need quite a lot of milk to produce just a little bit of it. You must simmer it slowly to prevent the milk from scorching and burning. If you watched season 7 of The Great British Bake Off, you’ll see that, after four hours, the contestants were permitted to abandon their DIY mawa and use the premade kind instead.Nowadays, there are shortcut recipes that use ricotta or milk powder. For the ricotta version, just heat up full-fat ricotta over low heat in a saucepan on the stove over medium heat with a touch of ghee until most of the liquid has evaporated, or until you’ve reached the level of dryness you’re looking for. To make the nonfat dry milk powder version, just mix 1:1 ratio by weight of milk powder and heavy cream in a bowl. To add additional moisture and get a softer texture, you can steam this quick-made mawa for 10 minutes by wrapping it in cheesecloth and placing in a steamer. You can also now find mawa powder—dehydrated and pulverized mawa that you can hydrate with milk or cream—in stores and online. Nonfat dry milk powder is not a good 1:1 substitute for mawa powder in that it lacks any fat.Mawa powder may look like nonfat dried milk powder, but the two are not interchangeable.\nPhoto by Emma Fishman, Food Styling by D'Mytrek Brown What does it taste like and how do you use it in baking?When mawa is added to cookies, cakes, and other baked goods, it gives a rich bakery-style feel and adds a touch of sweetness and an intense milky, sweet cream flavor. It also adds moisture to cakes and cookies, which slows down the staling process. And because the natural sugars in the milk fat caramelize in the oven, baked goods with mawa have a subtle sweetness and a tender, rich, buttery crumb.I particularly like to add mawa to coconut macaroons to keep the centers soft and gooey. Another popular application of mawa is to make mawa cake, a teacake that’s popular in India and usually made with dried and/or fresh fruit.When baking a cake or making cookies, here’s how I substitute: If a recipe has multiple eggs, I’ll replace one egg with ¼ cup mawa; otherwise, I’ll swap ¼ cup of butter with ¼ cup of mawa. I like to make Japanese-style milk breads by making a 50-50 mix of mawa and tangzhong. If the recipe calls for 100 grams of tangzhong, for example, I’ll use 50 grams of tangzhong and 50 grams of mawa. (Alternatively, you can also substitute 30% of the flour with mawa powder in the tangzhong.) The mawa provides additional sugars for the yeast to feast on and will give you a nice golden brown crust.When I’m using mawa powder, as opposed to the blocks, I like to toast it in the oven at 300°F for 9–10 minutes, until it starts to brown and caramelize. I’ll replace 10% to 15% of the flour (by weight) in cookies with the toasted mawa powder for a butterscotch-y, dulce de leche–like flavor. You can also dissolve the toasted mawa powder in cream and use it to make the most amazing crème brûlée, or add a few tablespoons to your cookie dough or cake batter. It can also replace nonfat dry milk powder in an ice cream base for a kulfi-like creaminess.Okay, but what if I want to just buy it?You can find mawa/khoya bricks at your local Indian store’s refrigerated section. Some popular brands are Nanak and Gopi. You can also find mawa powder at Indian grocery stores in the dry goods section.Hetal Vasavada is the author of the blog Milk and Cardamom, as well as the eponymous cookbook.Explore Bon AppétitIndianDessertMilkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-12-21", "author": ["Condé Nast", "Hetal Vasavada"]}