{"id": "c32f75d50c2f04e0e40551e75d35ee76", "url": "https://www.bonappetit.com/story/what-is-a-preferment", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "What Is a Preferment and How Does It Contribute to Better Bread? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Preferment Is Your Ticket to Baking Better BreadA little yeast goes a looong way.By Sarah JampelOctober 11, 2020FacebookTwitterEmailPhoto by Chelsie Craig, food styling by Pearl JonesFacebookTwitterEmailBaking depends on many factors: high-quality flour, a great recipe, lots of practice, plenty of time and patience, and the right conditions (temperature, humidity, Mercury not in retrograde).And while you can’t rush years of experience or realign the stars in the sky, you can make a preferment—a piece of dough that ferments in advance, thereby improving the texture, flavor, and shelf life of your final bread. In Bryan Ford’s master recipe, a preferment known as a poolish (more on that below!) helps make a versatile dough that bakes up flavorful, airy, and light, whether as a loaf or as the base of a Detroit-style pizza.But what is a preferment, really? And how does it work?What is a preferment?Unlike a “straight dough,” in which all of the ingredients for the final dough are combined at once, bread made with a preferment is mixed in two stages: A small portion of the dough is prepared in advance—usually 6–16 hours—and allowed to ferment; then, once it’s bubbly and full of yeast, acid, and bacteria, it’s incorporated with the remaining ingredients—flour, water, salt, and, sometimes, more yeast. The dough then has its bulk rise, where it grows in a bowl or container, before it’s shaped (into buns, breadsticks, loaves, what have you) and left to proof once more.Why should you bother?Think of a preferment like a head start toward fermentation. While some recipes call for fermenting a straight dough, like this focaccia, slowly over many hours or even days, using a preferment tacks that extended fermentation time onto the front end before the final dough is even mixed.All of this begs the question: Why does more fermentation result in better bread? In the words of Peter Reinhart in The Bread Baker’s Apprentice, an extended fermentation time “allow[s] for more flavor to be teased out of the complex wheat molecule.” All of the different preferments, some of which we’ll outline below, serve the same purpose: As Ken Forkish puts it in Flour, Salt, Water, Yeast, “each allows for the development of alcohol and bacterial fermentation, which add flavor, acidity, and leavening to the dough.”Bread made with a preferment will not only taste more complex—with a wheat-y aroma and a pleasant tang—but it will have an improved structure, a deeper-colored crust, and an extended shelf life. All of those advantages from one additional—and mostly hands-off—step!Now that you’re sold on the preferment, let’s go over a few common kinds.What are some of the different types?Preferment is a big umbrella category with several specific types nestled underneath. Of the three below, poolish and biga are made with store-bought yeast—the packets of instant or active-dry you get at the store—whereas sourdough is made with wild yeast that’s harvested from the environment.PoolishBryan’s Master Dough is made with a poolish, a loose preferment that’s usually equal parts water and flour by weight with a tiny amount of added store-bought yeast and no salt. Experienced bakers will adjust the amount of yeast they add to the poolish based on their baking conditions—they may use more yeast to counteract a cold environment, for example. A poolish will look shaggy when it’s first mixed but will get loose, even batter-like as it ferments.To save you minor embarrassment, this word is pronounced pool-eesh (not pool-ish, as in, that baby pool is pool-ish). The French named this technique after Polish bakers, who brought their method to Western Europe. While it was originally used in pastry production, it’s now more common in bread baking and employed all over the world, from Central America to Japan.According to Forkish, poolish is particularly “suited to making bread with a creamy, slightly nutty character and a crisp, thin crust.” (Yum.) Think baguettes, rustic boules, and Bryan’s Pullman loaf too.An active poolish on its way to BA’s Best Bread.\nMichael Graydon + Nikole HerriottBigaBiga is the generic Italian term for preferment, but most often it refers to a fairly stiff mixture consisting of two parts flour and one part water. Like poolish, biga is made with no salt and only a small amount of store-bought yeast, but it’s commonly used for Italian breads like ciabatta and focaccia. Poolish and biga can be used interchangeably, though you’ll have to do a bit of math to figure out how much water you’ll need in the final dough based on whether you used the looser (poolish) or stiffer (biga) preferment.Sourdough starter/levainUnlike the poolish and biga, a sourdough starter is made with natural yeast rather than the commercial yeast from the store. The mixture of bread and water acts as a breeding ground for the wild yeast and naturally occurring bacteria that’s all around us. (Spooky!)The difference between starter and levain is confusing (especially because levain is the French word for sourdough), but oftentimes bakers refer to the levain as the portion of the starter that is active and ready to be incorporated into the rest of the ingredients. Sometimes that is simply a portion of the starter, bubbly, and alive; other times, the starter is a starting point for a levain with a different hydration level (as in, it might be stiffer or looser than the starter itself) or a different ratio of white to whole wheat (or rye!) flour. (If all of this sounds very confusing to you, you are not alone! I recommend Bryan’s book, New World Sourdough, or any of the others referred to in this article, which lay it out in more detail.)In addition to these three preferments, you may also encounter pâtés fermentées (originally, this was made by breaking off a bit of the mixed dough, then keeping it overnight and incorporating it into the next batch), sponges (which typically only ferment for a couple hours), and soakers (these are made by soaking non-yeasted ingredients, like cornmeal or cracked wheat, overnight in order to release some of the starches’ sugars).How do you know when your preferment is ready to use?So you’ve made your poolish and you’ve waited for 12 hours and you’re staring it down, unsure what you’re looking at. To determine whether it’s ready to become bread, use your senses.For any of the three preferments listed above, look for visible signs that they have risen. They should look active and alive—the surface of a ripe poolish should be covered in small bubbles, and if you look closely, you may even see one come to the surface (a baker’s shooting star?). The smell should be pleasing—slightly sour with notes of yeasty alcohol. Some bakers even recommend tasting it—the preferment should be tangy and sometimes a tad sweet. For additional insurance, administer the float test: Fill a cup with room-temp water, then gently dollop in a spoonful of the preferment—it should float, an indicator that it’s active enough to leaven your final dough. It’s important to make sure your poolish, biga, or levain has properly fermented—if not, your loaf will be blander and denser than intended.Yes, bread that’s made with a preferment is going to take some planning ahead. But the superior results are worth it. Your toast will speak for itself.The toast, it speaks:Simple Sandwich LoafIf you’re looking for a simple recipe for a tender sandwich bread—the kind of loaf that’d be great turned into a grilled cheese or crunchy croutons—this is it. This recipe from Bryan Ford is his Master Bread Dough, rolled into a tight log and baked until golden brown. We recommend slicing it and then freezing in a resealable plastic bag or airtight container for instant toast.View RecipeExplore Bon AppétitBreadRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-11", "author": ["Condé Nast", "Sarah Jampel"]}