{"id": "c332838cb3ab544ce16aaaf0d30d1587", "url": "https://www.bonappetit.com/story/rent-week-tax-season-stromboli-recipe", "year": 2018.0, "month": 4.0, "day": 1.0, "content": "This Stromboli Recipe Is My Only Dependent This Tax Season | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Tax Season Stromboli Recipe Is My Only DependentIt's basically just a pizza rolled up into a giant log. And when you're paying rent AND taxes in the same month, it's here for you.By Alex DelanyApril 4, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailHey. How’s it going? Oh, me? I’m fine. A little tired. Yeah, tax season is rough, especially when you forget to pay taxes on all those little freelance gigs you pulled over the past year...and then...you need to. But what else can we talk about? A stromboli recipe? Really? That’s what you want to talk about? Well, yeah. I just wasn’t expecting you to say that. That’s actually great. I’ve been carrying around these Stromboli Fun Fact Flash Cards for a while, waiting for an appropriate time to use them. Since you specifically asked, here are five things you need to know about stromboli:1. Stromboli is not a type of herbal tea. Or a post-impressionist painting style. Or some investment banking strategy conceived in the 1980’s. A stromboli is rolled pizza dough, filled with tasty ingredients, that you can slice, dip, and eat whenever you want.2. You don’t actually need to know anything about stromboli. It doesn’t have any bearing on global politics or economic shifts. It’s just a fun thing to eat and say. Strom-bowl-eeee.3. Italian-American folks from Philadelphia invented the stromboli and named it after an Italian island called...Stromboli. There’s a giant volcano called Mount Stromboli on the island, which has been continuously erupting for the last 2,000 years. I am not making this up. I promise that this is real.4. A stromboli is not a calzone. Calzones are folded, while strombolis are rolled. Calzones are fine. Strombolis are great.5. You can make strombolis for Rent Week at home. It’s actually really easy. And then you can eat them with your friends, adopt the nickname Lord Stromboli, and rule over your land in a just and loving manner that will be written into the history books in a favorable tone.So let’s do that. Throw on this Rolling Around playlist (filled with tunes to get you in the StromboZone and totally free of charge) and put on your shoes, because we’re going to that pizza place that’s close to where you live. You know the one.You can buy pizza dough at your local pizzeria, and while pizza dough from the grocery store would work just fine, buying fresh dough from a pizzeria is going to give you a better stromboli. Plus: It's cheap! You can spend three or four bucks on a large-pizza’s-worth of dough, which should be enough for two strombolis. Cool, we have the dough. Let’s go home.Roni stromboli. Probably going to get that tattooed on my body.\nPhoto by Chelsie CraigYou should prep and cook the fillings of your strombolis before you roll them up. Throwing raw vegetables or meat inside that dough isn’t going to work out, since they won’t be exposed to enough heat to cook all the way through. I was just going to give you one stromboli recipe, but then I was like, Wait. These people are here for stromboli. It’s Rent Week. They are decent citizens that deserve more. SO I DID THREE FILLING COMBOS. WHAT!? YOU’RE WELCOME. You're making two strombolis here, so divide your dough in half, place those halves in a container or tray covered with plastic wrap, and leave them at room temperature to proof while prepping of these filling combinations (which each make enough to fill two strombolis):Photo by Chelsie CraigGarlicky Kale (For My Vegetarian Homies)De-stem 1 bunch of Tuscan kale and tear the leaves in half. We don't need a consistent size here. Get wild. Finely chop or thinly slice 3 cloves of garlic. Heat some olive oil over medium heat, add garlic, and cook until tender. Add the kale, stirring to coat with olive oil and seasoning with a couple pinches of kosher salt. Cook the kale for 3-4 minutes, until it's dark green but still has some life in it—we don’t want the super-wilted, mushy stuff.Pepperoni and Marinara (For My OG Red Sauce Homies)Not all strombolis need sauce, but when pepperoni is involved, you need to show respect to this classic combination. Make a quick red sauce using this recipe from Pizzeria Beddia (using only tomatoes, garlic, olive oil, and salt). For the pepperoni, it’s dealer’s choice. Go as lo-fi or high-brow as you want. Use one pack of the pre-sliced, ultra-greasy stuff, or slice about 7 oz. of the fancy stuff. Probably the lo-fi stuff though...because pepperoni costs money.Fennel and Sausage (For My Refined, But Not Too Refined Homies)For this combination, brown about a pound of crumbled, de-cased, sweet sausage in a skillet over medium-high heat. Need a browning refresher? Here ya’ go. Once the sausage is nice and browned and crispy, transfer it to a bowl with a slotted spoon, leaving behind any rendered fat. Thinly slice one bulb of fennel and sauté it in that sausage fat until tender; season with a little salt. Pick the fronds from the stems, and save them for later.So..we forgot to shoot these steps at the photoshoot, so just pretend you're looking at a photo instead of my amateur diagram.\nIllustrations by Alex DelanyCool. Your filling(s) is/are prepped. Preheat your oven to 500° and sprinkle a bit of flour on a sheet pan. I like to keep it to one stromboli per pan, for the sake of an easy roll. Grab one half of the dough and let gravity do some work. Let it stretch and hang, forming it into a very rough rectangle. You’re not a professional. I’m not a professional. Let’s not get too ambitious here. Once it’s on the pan, you can continue to stretch the dough. The real secret here is getting the edges just as thin as the center.Now we shred some mozzarella. Yes, you're doing the work. The pre-shredded stuff just isn't as good, and you should always use low-moisture mozzarella for strombolis—as in, the cheap, firm stuff that comes in a little brick—since fresh mozzarella has a lot of water in it which will make for a soggy stromboli. There shouldn’t be mountains of cheese on your dough: A layer of about 2 cups of mozzarella, spread evenly across each dough, is perfect. Here's how we get through the whole process:1. Cover the dough with an even layer of cheese and a thin layer of topping—overloading your dough with too much cheese and filling will cause tears—making sure to leave a 2-inch strip at the top of your dough rectangle blank (that's how we'll seal the stromboli). 2. Roll the side closest to you toward the blank strip at the top, stopping when you hit the strip. 3. Pull that blank strip back towards you, over the rolled dough. 4. Pinch to seal the folded dough, then fold the ends of the stromboli under to cover the exposed tips. 6. Cut several slits across the stromboli to allow for ventilation while it bakes.Like I said, use your imagination.\nIf you get small rips or tears, that’s totally cool. We can pinch them up and try to fix them or just let them ride. We are not physicists or engineers. We're just regular people making strombolis. The dough should stay as it is, but we’ll give it an egg wash just in case. Beat two eggs (adding those fennel fronds, if you have them) and apply the wash to the entire stromboli. Cut slits across the top of the stromboli to allow ventilation.Dramatic.\nPhoto by Chelsie CraigAnd now we wait for at least fifteen minutes before throwing it in the oven. Letting the dough proof one more time encourages an airy texture. Bam. Fifteen minutes down. Throw those bad boys in the oven, and bake them until they’re nicely browned on top. Cheese should be bubbling through the slits. This takes about 10-15 minutes, but that varies depending on your oven. Use your eyeballs. You’ll know when you want to eat it.You have a real life stromboli. Cut it into slices that are about an inch thick. Plate them up, and serve them with a dipping sauce. A little ranch dressing never hurt. A bit of that leftover pizza sauce would work nicely too. When it comes to stromboli, everything is up to you. And that’s all I have left to say about strombolis. What else should we talk about?In more of a stir-fry mood for Rent Week? That's cool.Garage Noodles Are the Rent Week Stir Fry Recipe That's Here to PartyKale, mushrooms, onions, and a beautifully bold sauce make instant ramen noodles something to be excited about.View StoryExplore Bon AppétitBasicallyItalian AmericanRent WeekRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-04", "author": ["Condé Nast", "Alex Delany"]}