{"id": "c3347eafb5bed886df0d5ee33c1e8bd8", "url": "https://www.bonappetit.com/story/dave-eggers-monk-of-mokha-book", "year": 2018.0, "month": 1.0, "day": 5.0, "content": "Dave Eggers on The Monk of Mokha, the Story of a Man Who Risked His Life for Coffee | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureDave Eggers on His New Book, the Story of a Man Who Risked His Life for CoffeeIn The Monk of Mokha, Eggers chronicles the harrowing true story behind a high-end coffee company.By Carey PolisJanuary 30, 2018FacebookTwitterEmailRight: Photo by Em-J StaplesFacebookTwitterEmailDave Eggers latest book, The Monk of Mokha, tells the gripping story of Mokhtar Alkhanshali, a Yemeni-American who started Port of Mokha coffee after spending three years traveling in Yemen to rejuvenate its once-prosperous coffee industry. Alkhanshali's journey to start his third-wave coffee company isn't the stereotypical start-up story of working in someone's garage and pitching a bunch of investors. Instead, it involves war zones, too-many-to-count near-death experiences, constant illnesses, a crazy number of coincidences, and outstanding coffee. Frankly, the book reads like unrealistic fiction that goes a step too far out of believability... except that the whole story is true. This isn't a \"food book\" per se—it's great narrative non-fiction in which the pursuit of high quality coffee (really high quality, that is—Blue Bottle sold Port of Mokha's first batch of coffee for $16 per cup) is the reason Alkhanshali repeatedly risks his life.We spoke to Eggers about his decision to tell this story, his own relationship to coffee, and more.At what point did you know that Mokhtar's story was going to be your next book? What convinced you?I knew Mokhtar from years before, and we have a mutual friend in the writer Wajahat Ali. One day Wajahat said, “Did you hear what happened to Mokhtar?” Waj gave me a vague outline of the story, but when I checked in with Mokhtar, the story got infinitely more intriguing and complex. We sat down one day and he unloaded, and we met up for about 12 hours over the next few weeks. He’d just returned from Yemen and I felt it was important to get it all down before his memories started fading. Mokhtar’s story exemplifies a lot of things I gravitate to—entrepreneurship and adventure high among them. And given the opportunity to learn something new—in this case, the history of coffee and the coffee industry today—I get inspired.Photo by Jake StangelWhat was your relationship to coffee before writing The Monk of Mokha and what is your relationship to it now? Have your consumption habits changed?I drank my first cup of coffee at age 35, when my daughter was born and we weren’t sleeping much at home. I needed coffee to have any mental acuity those first few years. But even then, I didn’t think much about its sourcing or the farmers at the beginning of the process. I certainly didn’t know coffee was a fruit picked by hand, or anything about the incredible intensiveness of its processing. Now that I do, it’s made me a far better consumer. That’s the hope for any story about how anything’s made—if you can think about the people involved at every stage of the process, from the farmers to the roasters, you can make better informed decisions that can improve that industry and everyone who works within it.It's pretty easy to balk at the idea of paying $16 per cup of coffee. I'm guessing you've had Mokhtar's coffee—can you describe the taste? What's the difference between an average $3 cup and his?Mokhtar’s coffee really is exquisite. But you have to roast and drink it a certain way that’s very different than the overroasted and overly hot way most people drink their morning fuel. Mokhtar’s coffee is far closer to wine than it is to the charred black beverage that we often drink in the morning. I’m not saying there’s anything wrong with that, but they are very different.You traveled to Yemen when you were doing research for this book. What did you learn about coffee from your time there?We went to Ethiopia and Djibouti, too. And Abu Dhabi and Richgrove and Santa Barbara, the home of the only coffee farm in the continental U.S. In all these places, Mokhtar and I had a blast. He’s about the easiest travel companion you could hope for, and when we visited coffee farms around the world, he’s still very humble and always learning. Every coffee farm is very different, and their challenges unique, and he sits with farmers everywhere and asks questions, always expecting new edification. It was all new to me, so I learned every minute.How many cups of coffee (roughly) did you drink when you were working on drafts for the book?I’m a morning coffee drinker, and can’t drink much later in the day if I want to sleep. I will say that at Boot Coffee [Ed note: Boot Coffee founder Willem Boot plays a key role in Port of Mokha's launch], where we spent a lot of time over the last few years, they’re always urging samples on you. At any given moment, there are 20 cups of freshly brewed elite coffees, and it’s a bit of a crime to say no. I also learned cupping—the slurping and spitting and grading—and that helps. When you don’t have to swallow every sip, it keeps your blood-to-caffeine ratio more tenable.What's your everyday go-to coffee?I only drink Mokhtar’s coffee. I have to say that, I think. I would never think about any other brand.Buy The Monk of Mokha on Amazon for $19.Coffee on the mind...Explore Bon AppétitBooksCoffeeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-30", "author": ["Condé Nast", "Carey Polis"]}