{"id": "c35cda98bcb9de0adf48a5ad0ea5b39b", "url": "https://www.bonappetit.com/recipe/beet-fritters-with-beet-greens-yogurt", "year": 2020.0, "month": 11.0, "day": 1.0, "content": "Beet Fritters With Beet Greens Yogurt Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2020 IssueBeet Fritters With Beet Greens YogurtBy Sarah JampelNovember 2, 20204.4(33)Read ReviewsTriangleEmailPinterestPrintPhotograph by Emma Fishman, Food Styling by D'mytrek Brown, Props from Meilen CeramicsEmailPinterestPrintEmailPinterestPrintSo you love beets but don’t love waiting hours for them to roast? Shred ’em along with some potato to make these crispy dinner fritters. If your beets didn’t come with their greens still attached, use any hardy green like kale or Swiss chard in the yogurt sauce instead.IngredientsMakes 10-124medium beets with greens (about 1 lb.)1large or 2 medium Yukon Gold or russet potatoes (about 10 oz.)1medium onion1½tsp. kosher salt, plus more4Tbsp. (or more) extra-virgin olive oil, divided2large eggs, beaten to blend6Tbsp. panko¼cup cornstarch2tsp. coriander seeds, crushed2tsp. cumin seeds, crushed1lemon, halved½cup plain whole-milk yogurt½cup coarsely chopped dillFreshly ground black pepperPreparationStep 1Preheat oven to 300°. Line a sieve with 2 layers of paper towels; set over a large bowl. Remove stems and greens from beets; set aside. Scrub beets and potato, then grate on the large holes of a box grater into prepared sieve, followed by onion. Season with salt and toss well. Let vegetables sit at least 25 minutes.Step 2Meanwhile, finely chop reserved beet stems and greens. Heat 2 Tbsp. oil in a large skillet over medium-high. Add greens, season with salt, and cook, stirring occasionally, until wilted and starting to stick to pan, about 5 minutes. Transfer to a bowl and let cool. Wipe out pan; reserve.Step 3Working with a large handful at a time, squeeze grated vegetables to expel as much liquid as possible, transferring vegetables to a medium bowl as you go; discard liquid. Mix in eggs, panko, cornstarch, coriander, cumin, and 1½ tsp. salt.Step 4Heat 2 Tbsp. oil in reserved skillet over medium-high. Working in batches and adding more oil between batches if needed, scoop three ¼-cupfuls of vegetable mixture into pan and flatten into thin pancakes. Cook until browned, about 3 minutes per side. Transfer to a wire rack set inside a rimmed baking sheet and keep warm in oven until ready to serve. If you notice your beet mixture giving off a lot of moisture as it sits, you can add a bit more cornstarch and squeeze before adding to the pan.Step 5Meanwhile, squeeze juice from a lemon half into beet greens. Add yogurt and dill and mix well; season with salt and pepper. Slice remaining lemon half into wedges.Step 6Serve fritters with beet greens yogurt and lemon wedges.How would you rate Beet Fritters With Beet Greens Yogurt?Leave a ReviewTell us what you thinkReviews (12)Back to TopTriangleHow  far ahead can they be made? Would it work to make them in the morning for an evening meal?  Or do they need to go from stove to table?  They look fabulous!  THX!Ilex N. Ivy1254610/25/2021Very tasty but a lot of work and a lot of beet stains.. overall good recipe!AnonymousToronto10/14/2021hello, ive been spreading the goodnews of GODS kingdom the paradise. the bible says that if we spread the goodnews we can save both our selves and those who listen to us. and that it makes our hope more sure. im praying you all will pray about it and help me spread the goodnews. ephesians chapter 6 says: to open our mouth and seak with boldness the goodnews. revelations 21:3,4 has a happy ending i encourage you all to read it, please. and wow you all have some very nice recipes im looking forward to making this. thank youdenise kingMcminnville, Tennessee10/11/2021great recipe, but the yogurt is something you should definitely free style with. leave the beet greens to sautee with something later and toss in scallions, capers, and maybe some toum or something garlicky. makes it way better with a tartar-type sauceljsnyc1/26/2021Anybody else grating the beets thinking \"is it blood or is it beet?\" Maybe it's just me since I've gotten myself with a grater a few times :) LOVE this recipe, would definitely stress getting the moisture out even if it means using more towels. Leftovers were also fantastic for breakfast with eggs! SpamAustin, Texas1/15/2021Loved, loved, loved these! The mixture definitely needs to be well drained/squeezed. My husband and I put it in a towel and took it out into the backyard to really get the liquid out. And there was a lot of it! We had to add an extra egg to help them hold together. Used the grating disk and food processer rather than a box grater. Other than that, followed the directions and they were creamy inside and crispy outside.  The yogurt sauce was delicious. Had to add a little buttermilk to make it a bit thinner (our preference). We will make these again and again. LisaSterlling, VA11/28/2020Very delicious and fun to make. After letting the grated vegetables sit for 25 minutes, I squeezed them in a dishtowel to really get them dry.  I used golden beets and threw in some turmeric to amp up the golden hue. Laura Seattle11/21/2020Made the fritters but not the yogurt. The fritters were great! I was careful to REALLY SQUEEZE all the liquid I could out of the veggies after they got the full 25-minute salted rest. I followed the recipe very closely except that I used ground cumin and coriander and did not add the extra salt because I used seasoned GF breadcrumbs in place of the panko. The fritters were crispy on the outside, tender on the inside and very tasty. Will definitely make again.BertScarborough, Maine11/18/2020Made this last night to use up some of my CSA produce. I like the variety I get but sometimes it’s difficult because I won’t get enough of something to make a full recipe, such as in this case. But I received 2 beets and 2 deep purple carrots (subbing in here for 4 beets) without their tops and a small portion of some interesting, a bit wilty salad greens (subbed here for the beet stems and greens). I also didn’t have dill so I used parsley. Otherwise made as directed and it wasn’t bad but there were some difficulties. \n\nI let the veggie slices sit for more than 25mins and squeezed as best I could but the mixture was still getting very watery as it sat and didn’t want to clump. I didn’t want to add additional clumping agents for nutritional reasons. Giving each patty ball a squeeze before putting it in oil did help but wasn’t a perfect solution. \n\nI also agree with the reviewer who said it was too salty, and I like salt. I would skip adding the salt with the seasonings and panko as the salt used to dehydrate the veggies is probably enough, and you can otherwise add more for serving if you desire. \n\nI also would not use olive oil for the frying. I had to get the temp up pretty high to get the patties to not disintegrate and the olive oil was smoking up a storm. \n\nFinally, it’s a little tough to tell when the patties are done without burning them as the colors were already pretty dark (admittedly made worse by my use of the deep purple carrots). I actually found smell to be the best indicator of done-ness. \n\nOther than the saltiness and accidentally burning some because I couldn’t tell they were done they did taste good, felt pretty healthy, and were a good way to use up produce I had. I didn’t really feel like it was worth all the effort though. BananaMartiniElkins Park, PA 11/16/2020Made these for dinner tonight! I only used 2 beets, rather than 4, and added in a zucchini. I also added a third egg, since my first round of fritters fell apart. The rest of them held together well and cooked quite quickly. Somehow, this recipe made me like 30 fritters rather than the promised 10-12, so now my boyfriend and I have to live on beet fritters...forever? I didn't really like how the beet stems tasted/felt in the yogurt sauce, so I would recommend just doing the leaves—I think that would have been plenty. Also make sure to wash the beets and greens/stems very thoroughly to avoid grit. All in all, you should make sure you really like beets if you are going to make this recipe—but my boyfriend, who had maybe never eaten beets before, liked it!SonaliNew Haven, CT11/13/2020Too salty!PlouColorado Spri gs, Colorado11/10/2020I made a version of this last night, I added some extra herbs and spices to the fritter mix (dried tarragon, dill and garlic) and added some green onions and chives to the beet green yoghurt. Served with smoked salmon on the side for an extremely pink dinner. Would make again!ClareLos Angeles, CA11/9/2020Explore Bon AppétitFritterBeetVegetableYogurtOther IngredientsFallSideVegetarianNut-FreeHealthyishFryHanukkahDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-02", "author": ["Condé Nast", "Sarah Jampel"]}