{"id": "c35cd43a5f81b14866eae3b95ed397d9", "url": "https://www.bonappetit.com/story/chefs-obsessed-kudu-grill", "year": 2018.0, "month": 5.0, "day": 4.0, "content": "Why Chefs Are Obsessed with the Kudu Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhy Chefs Are Obsessed with the Kudu GrillDo we need all of those bells and whistles on a grill? No. Do we want them? After hearing chefs talk up the Kudu—yes.By Julia BainbridgeMay 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThe Kudu looks like it might come to life at any moment, swinging its two metal arms forward to sneak a sip of your ice-cold IPA. One arm protrudes north from either side of the fire pit, and they’re what allow the Kudu’s many attachments (a grill grate, a cast-iron skillet, even a rotisserie) to move both horizontally and vertically for mega heat control. Think ten-zone fire, not two.Do we need all of those bells and whistles on a grill? No. Do we want them? After hearing chefs talk up the Kudu—yes.“You can do the same stuff on other grills, you can just do more at the same time on this one,” says Cheetie Kumar, chef and owner of Garland in Raleigh, NC, but she uses the Kudu at home. “You can cook a ribeye until it’s almost there, swing it around and let it rest, then get some corn going on the grates and maybe sear some peaches on the cast iron. Somebody’s hopefully making a salad somewhere inside, and you’ve got a whole meal.” It’s almost like having a kitchen range outdoors, she says.Courtesy of KuduAdam Evans, who will open a seafood-driven restaurant in Birmingham, AL, this summer, uses the Kudu to grill oysters. “I like the flame to get around the shells so the edges of the oysters crisp slightly,” he says. Then he can move them off the heat in one fell swoop, by simply pushing the grate on which they rest. “It’s a quick process; you’re really just poaching the oyster in its own liquid with a little bit of butter.” Same with fish: Get it so close to the heat that the skin crisps up, but remove it from the heat source quickly to avoid overcooking the meat.Stebin Horne, a Macon, Georgia-based entrepreneur, designed this lid-less grill after spending time in South Africa, where he fell in love with braais, Afrikaans for good old-fashioned, pile-of-burning-wood-fueled cookouts. “Francis Mallmann builds massive fires and cooks tons of meat and vegetables that hang over the flame,” he says. “You might as well be wearing a volcanic suit to do that!” Horne says that South Africans make open-fire cooking home-friendly by keeping it contained and using a relatively small amount of fuel. “It’s such a communal way of cooking, and more sophisticated than people realize. So I blended that with what I, as a Southerner, love about cast iron and made a functional piece of equipment.” He launched his company last year, and already, chefs across the country are using it for events.Photo by Alex Lau“It’s the only grill I use to make paella, which is tricky because you need to start out really hot and then move to a cooler area,” says Katie Button, chef and owner of Cúrate and Nightbell in Asheville, NC. “You can do that by timing your charcoal, but that’s a lot more finicky. All you do with the Kudu is move the pan up. It’s so simple.”Most grills you buy—think the classic Weber—have round bottoms, so eventually, as the charcoal cooks, it all falls to the center of the basin. The Kudu has a flat bottom, so you have more hot surface area to work with. “And its legs come off easily and none of its parts are so heavy that you can’t carry it to your car and pop it in the trunk,” Button adds. “Obviously, you can’t do that with your Big Green Egg!”Buy it: Kudu Open Fire Grill, $500 from KuduGrills.comOr make a multi-zone campfire with Brad instead:All products featured on Bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn a small affiliate commission.Explore Bon AppétitGrillToolsShoppingBarbecueRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-24", "author": ["Condé Nast", "Julia Bainbridge"]}