{"id": "c36ce68f3c62a258460d6f48dcac852c", "url": "https://www.bonappetit.com/story/shortcut-soup-for-sunday-blues", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Chicken Khao Soi Soup is Ideal for the Sunday Blues | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingA Shortcut Soup for the Sunday BluesLean into winter, she’s almost gone.By Carla Lalli MusicMarch 7, 2019FacebookTwitterEmailPhoto by Ditte IsagerFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.It’s time to put your bouncy shoes on, folks, because this weekend we are going to spring forward. That’s right, my friendly hibernating mammals—Daylight Ending Time is about to cede to the season of lightness and brightness. On Sunday, we turn our clocks forward and set our sails toward springtime.What is the right thing to eat on such a momentous occasion? This recipe for chicken khao soi from Long Grain restaurant in Camden, ME, encapsulates everything I’m feeling about winter sort of being over and spring coming soon but not really being here yet. An elusive moment, to be sure, but I’m buoyed by seasonal optimism.Want this letter before it hits the website? Sign up for our newsletter!We change the clocks on Sunday, and in my house, we eat soup on Sundays too, especially when it’s cold out. I am always happy to front load the work of making a robust pot of soup, tending to some slicing and dicing and supervising a soffritto if it means more flavor later. This khao soi kicks off in similar fashion. The first step is to make a fresh curry paste packed with dried chiles, shallots, ginger, garlic, cilantro, and dried spices. I like the way the curry paste tastes, but I also like what it signifies: Heat. Goodbye cold and despair. Hello sun on my face and warm breezes on my skin. Spicy! Yes, fire it up.After frying the curry paste in oil to extract all of the aromatic compounds from its ingredients, you add coconut milk and chicken broth. The coconut is rich and mellow, but it’s also tropical and sweet, which is such a nice change from my urban existence, where even the air around me tastes like dry, grey metal. Then there’s the addition of chicken thighs, which are just the best, no matter the season or your mood. Having them in this soup serves as a reminder that chicken thighs are always there to solve your problems and make you love life again. After that, the soup simmers.May I remind you that as wonderful as Daylight Savings Time is, we are losing an hour this weekend. All of the braising and baking and simmering and roasting you’ve been doing these past Sundays, you’ve done it with the benefit of a full 24-hour day. This one coming up? You’re going to have to make it work with 23. That’s why the next part in this recipe is so clutch: The soup cooks for only 25 minutes. Twenty-five! A shortcut recipe on the shortest day.Quick-cooking or not, this soup delivers. It’s spicy, it’s brothy, it’s meaty. It’s fun to eat, because there are noodles and fresh and crunchy garnishes to sprinkle on top. But I love it the most because it has a foot firmly in winter, but it can help us navigate a nice wide turn into springtime. It looks back at the cold season and says, I see you, long-cooked braises and savory pots of soup, you were good to me. It looks forward to the thaw and says, hello, you sunny, sassy horizon of golden days, I’m coming for you. A bowl of khao soi can mark this transition. The best thing you can do is come along for the ride.Explore Bon AppétitCarla NewsletterSoupRead MorecultureOur March Cookbook Club Pick Is Our Very Own Carla Lalli Music’s Where Cooking BeginsBy Julia KramerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-07", "author": ["Condé Nast", "Carla Lalli Music"]}