{"id": "c36f5af80daf93ad27b3f75eccf3efa1", "url": "https://www.bonappetit.com/story/peace-with-packaged-food", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "White Clam Sauce and Lean Cuisine: How I Finally Made Peace with Packaged Food | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhite Clam Sauce and Lean Cuisine: How I Finally Made Peace with Packaged FoodAs an aspiring food writer, I thought I’d never eat the canned, bottled, and frozen stuff of my youth.By Audrey BrunoMay 17, 2018FacebookTwitterEmailFacebookTwitterEmailA few years ago, around 10 p.m. in my Brooklyn apartment, I was struck by a craving. I grabbed my wallet and power-walked to the closest grocery store open at that hour. Under normal late-night circumstances, I’d settle for whatever the bodega on the corner had to offer, but this was no regular craving. To this day, I’m still a little embarrassed to admit that I was on the hunt for a can of Progresso’s White Clam Sauce, which I then sloppily ate with a bowl of overcooked linguine and the rest of whatever wine I had on hand.This was just as I was embarking on my journey to becoming a capital-F Food writer, so I prioritized eating at trendy restaurants and cooking with the finest ingredients. I worked long hours and interned for free, so when these indulgences wiped my bank account clean, I had to start eating like the kid I’d once been. I grew up in a lower-middle class home, eating processed and packaged food out of necessity. I hated and loved it at the same time.My love of food was instilled in me by my mom, the woman most often serving me the packaged food I scorned. Together, we’d watch hours of food shows. The hosts used fresh ingredients, not the Zatarain’s jambalaya or the Michelangelo’s frozen piccata we actually ate. I couldn’t help but feel ashamed and angry with her for buying this stuff, even if it did taste good. What I couldn’t see through my teenage angst was that she was actually trying her best to turn the food she could afford into the food I wanted to eat. She’d doctor up the Zatarain’s jambalaya with shrimp and kielbasa, and she’d serve the Michelangelo’s chicken with side of fragrant shallot rice. She was making the kind of thrifty, creative meals that would eventually make Tasty videos so popular, long before Buzzfeed even existed.But I was too embarrassed and angry to notice. When Ina Garten would croon in her patronizing way, “store-bought is fine,” it felt like she knew I was eating a Hot Pocket for dinner, and worse yet, she knew I was poor. It took me a long time to realize that my mom also would have preferred the delicacies we saw on TV. But she had a family of six to feed and not much money to do it with, so we shopped at Walmart and ate canned clam sauce.I swore to myself that the moment I moved out, I’d never look twice at another Lean Cuisine. However, as a jobless young person attending college in New York City, I quickly discovered that the food I’d always wanted to eat wasn’t going to fit neatly into my $25-a-week food budget. Like my mom, I’d have to get thrifty. There were bowls of Rice-A-Roni with the fanciest cheese and mushrooms I could afford; wedge salads with Snyders Hot Buffalo Wing Pretzel bites and Ken’s Italian dressing; and of course, lots of pasta with clam sauce, which I still don’t think needs much doctoring. I loved these meals, and so did everyone I cooked for. They weren’t the fanciest or the healthiest, but with a little resourcefulness, they were close.My adventures in semi-homemade cooking helped me shed years of preconceived notions I had about what it means for food to be good. Sure, I still wanted to eat heirloom veggies, grass-fed beef, and all the other whole, fresh foods I’d always dreamed of. But in the meantime, I’d be happy to enjoy the packaged food I’d once despised, as long as I could give it the treatment it deserved.Sometimes still, packaged food is the only thing that can scratch an itch. On a trip to Walmart with my mom during the holiday season a couple years later, we stopped in the chip aisle to gawk at the selection. Her eyes skipped over the many flavors of Lays and landed directly on Knorr’s Vegetable Dip, which she assured me was the best. “But only if you add chopped water chestnuts,” she dictated. We did, and she was right. It was the best and I wasn’t ashamed to admit it.Another throwback:Explore Bon AppétitGroceryRead MoreLifestyleI Dubiously Tried 6 'Healthy' Mac & Cheese Brands to Find the BestGallery7 SlidesBy Oset BaburRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-17", "author": ["Condé Nast", "Audrey Bruno"]}