{"id": "c380dd9374984ea4e227c1d8961b5009", "url": "https://www.bonappetit.com/recipe/okonomiyaki-style-brussels-sprouts", "year": 2019.0, "month": 10.0, "day": 4.0, "content": "Okonomiyaki Brussels Sprouts Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOkonomiyaki-Style Brussels SproutsBy Sarah JampelOctober 28, 20194.9(18)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Pearl JonesEmailPinterestPrintEmailPinterestPrintYou’ll find variations of okonomiyaki all across Japan (the name itself translates to “as you like it, grilled,” speaking to the dish’s flexibility). The savory cabbage pancakes can have all sorts of add-ins (pork belly, octopus, shrimp, squid, cheese!) and are typically decorated with zig-zags of tangy-sweet Kewpie mayonnaise and salty-sour okonomiyaki sauce and piles of wispy bonito flakes and nori. While nothing compares to the real deal, we took a cue from the okonomiyaki tots at Brooklyn’s Chuko and dressed roasted brussels sprouts like okonomiyaki, with lots of our favorite toppings. This okonomiyaki sauce is an approximation of the bottled stuff and achieves a similar sweet-acidic-salty-gingery punch that’s tamed by the rich, cooling mayo. Don’t skip it! If you’re a vegetarian, leave off the bonito flakes and seek out veg-friendly Worcestershire sauce. Ingredients4–6 servings2lb. brussels sprouts, trimmed, halved lengthwise2Tbsp. extra-virgin olive oilKosher salt¼cup Worcestershire sauce2Tbsp. plus 1½ tsp. ketchup2Tbsp. honey2Tbsp. unseasoned rice vinegar1tsp. finely grated peeled ginger (from one 1\" piece)½tsp. shichimi togarashi, plus more for serving1toasted nori sheet, crushed into confetti-size piecesKewpie mayonnaise (for serving)½cup bonito flakes1Tbsp. toasted sesame seeds2scallions, thinly sliced into roundsPreparationStep 1Arrange oven racks in top and lower thirds of oven. Place one rimmed baking sheet on top rack and another on bottom rack; preheat to 450°. Toss brussels sprouts and oil in a large bowl; season with salt. Carefully remove one hot pan from oven and transfer half of sprouts to pan—they’ll sizzle! Working quickly, turn sprouts cut sides down (don't worry if you can't get to all of them; it doesn't have to be perfect!). Repeat with second pan and remaining sprouts. Roast brussels sprouts, rotating pans halfway through, until cut sides are seared and tops are browned, 15–20 minutes.Step 2Meanwhile, mix Worcestershire sauce, ketchup, honey, vinegar, ginger, and ½ tsp. shichimi togarashi in a small pot. Bring to a simmer over medium-high heat, then reduce heat to medium-low and gently simmer, stirring frequently, until thickened and glazy, 3–4 minutes. Taste and season with salt.Step 3Pour glaze over brussels sprouts and toss to coat. Transfer to a platter. Sprinkle with nori, then squeeze mayonnaise over in stripes, covering the whole dish (trust us!). Pile bonito flakes in the center of the sprouts. Top with sesame seeds, scallions, and a dusting of togarashi.How would you rate Okonomiyaki-Style Brussels Sprouts?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleReally delicious. Takes some time. Is the star of the meal. LynnNYC1/8/2022I made this for my housemates a couple months ago, and one recently asked if I could make it again, even though he normally doesn't like brussels sprouts. The tangy-umami sauce really makes a big difference. I don't bother with preheating the baking sheet or carefully arranging the sprouts; I just toss them with oil on the sheet and bake them at 450, stirring once partway through.EattheworldDallas, TX1/19/2021My husband said this was the most flavorful thing he's ever eaten. Loved it. Instead of roasting in the oven I grilled the brussel sprouts on an electric skillet and thought they came out amazing. I also veganized it - vegan mayo brightened up with fresh lemon juice, vegan Worcestershire, agave instead of honey, and no bonito -  and I don't think it loses any of the complexity. Delicious!secretboyfriendSacramento5/28/2020Preheating the baking sheets made my fire alarm go off, but the result was delicious enough to make up for itAnonymousNew York1/14/2020Oh. My. Sprouts. This was a showstopper at thanksgiving. Paired with a 15 hour smoked brisket and a homemade Korean bbq sauce and now I can die happy. Seriously, these sprouts are so worth it- and very easy to make if you have all the ingredients! jess_irionBaltimore 12/31/2019Absolutely delicious! I add more seasoning and use sriracha mayo vs regular. One of my favorite sprout recipes! JjankoSan Antonio TX 12/27/2019OMG so delicious! It ended up being a hit at my very gourmet Friendsgiving. I already had a bottle of okonomiyaki sauce on hand, so I didn’t make the reduction, and I used furikake instead of nori. Make this and be a thanksgiving hero!AnonymousWashington, DC11/24/2019So good! I made them without the bonito flakes as I couldn't find them anywhere and served them with soy ginger pork and it made for a great dinner. The sauce was super flavorful, and I'm looking forward to leftovers tonight!AnonymousBerkeley, CA11/5/2019Explore Bon AppétitBrussels SproutVegetableFallSideGluten-FreeRoastThanksgivingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-10-28", "author": ["Condé Nast", "Sarah Jampel"]}