{"id": "c38a19172248d95b456e9504025a5637", "url": "https://www.bonappetit.com/story/my-mothers-pilaf", "year": 2021.0, "month": 1.0, "day": 2.0, "content": "I Didn't Really Know My Mother. But I Did Know Her Pilaf | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Didn't Really Know My Mother. But I Did Know Her PilafAn Armenian American meal connects the celebrated memoirist to a mother and culture she thought she had lost.By Nadia OwusuJanuary 12, 2021FacebookTwitterEmailPhotograph by Emma Fishman, food styling by D’mytrek BrownFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.I was in Sedona to forgive my mother. After over a decade of estrangement, this trip was the first time we would spend more than a few hours together since I was eight years old.My mother’s house had a stunning view of red rock canyons. How beautiful, I thought as I stepped out of the car. In my gut resentment gurgled, but I tried to ignore it. That resentment, I reminded myself, didn’t serve me. That was why I had found my mother’s phone number on the internet and dialed it; why I had agreed to fly here from New York.My mother showed me to the room where I would be staying. One of my half sisters—Wahida—would be arriving soon. She lived in Tucson. My half brother was still in high school. He’d be home after track practice, coached by my mother’s third husband.My mother said that she was making Armenian food for dinner.“All your favorites,” she said. “Pilaf, dolma, cheese borek, stuffed eggplant.”I did not tell her that, other than pilaf, I could not remember her preparing any of those things for me. I didn’t know what cheese borek or urfa kebab were.“Pilaf was the second word you ever said,” my mother told me. “Your first word was shoes.”“Really?” I asked. I had not known that. To marry another man, my Armenian-American mother left my father, my younger sister Yasmeen, and me when I was two and Yasmeen was a baby.My Ghanaian father was a diplomat with the United Nations, so Yasmeen and I grew up traveling the world with him, from post to post in Africa and Europe. Twice, as a child, I visited my mother in the United States. Other than that she was mostly a voice on a long-distance call. Sporadically,she sent letters.When I was 13 my father died. I called my mother to ask her to come to Rome for the funeral. She said she couldn’t because she had my half siblings to look after. There were three of them now—I had never met my half brother who was a baby then. My heart broke. The pain burst from me as rage. Yasmeen and I were her children too and we needed her. I vowed never to speak to her again and hung up. Yasmeen and I moved with our stepmother to Uganda, where I lived until I turned 18 and moved to New York for university.While my mother cooked in the kitchen, I sat in an armchair in her living room, pretending to read. This was not the house where I had visited my mother as a child. Still, I recognized the coffee table and a portrait of a woman in a traditional Armenian headdress. The portrait was inscribed with words in the Armenian alphabet I couldn’t read. How strange it was, I thought, to know so little about the culture that made up half of my DNA. I was raised in many countries, among many cultures, but for comfort I turned to food from my father’s homeland: fufu and peanut soup, jollof rice.But the smells wafting from my mother’s kitchen did carry memories. I closed my eyes and conjured the few summers spent with her: the Slip ’N Slide in her backyard, eating spicy skewered meats under the stars, sleeping on a mattress on the floor with Yasmeen and our two half sisters because we all wanted to be together.When I called my mother to end our silence, I was coming out of a long period of depression. Repair felt necessary to my survival. We did not speak much of the past on that phone call or on subsequent ones. She cried and told me she was happy to hear from me, that she had been waiting, that she was sorry. We told each other about our current lives. Now, in her living room, I was afraid. What sort of relationship could we have with so few memories as a foundation?Later, sitting around the table with my mother, her husband, and my half siblings, the conversation started out polite and stilted, but the food warmed and loosened us. I could sense us all trying to become family. My half sister kept saying, “I can’t believe you’re here.”“The eggplant is delicious,” I told my mother. Flavors of onion, tomato, cinnamon, Aleppo pepper, and lemon mingled in my mouth.“Do you remember this food?” my mother asked.“Yes,” I said, and I realized it was true. Memories do not form only in the mind.What did it mean that my tongue remembered? I wasn’t sure. I took another bite and my mother smiled. Between us there were many words unspoken. There was distance. But between us on the table, there was a meal. In that meal I could taste hope—my mother’s and mine. That, I decided, was worth savoring.Make the Recipe:Pilaf With VermicelliDry vermicelli is toasted in lots of butter to create extra nutty flavor and richness, a method used in pilaf traditions across communities.View RecipeNadia Owusu is a Brooklyn-based writer and urbanist. Her first book, Aftershocks: A Memoir is out now. Explore Bon AppétitFirst PersonAll on the TableRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-12", "author": ["Condé Nast", "Nadia Owusu"]}