{"id": "c3907fa58d5ce7ec46f4852fe90ef416", "url": "https://www.bonappetit.com/story/soup-club-cookbook", "year": 2020.0, "month": 10.0, "day": 2.0, "content": "My Soup Cookbook Came From My Battle With Cancer   | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWhen I Thought I Had a Year to Live, I Asked for SoupMy battle with cancer left me too sick to cook, so my friends made soup. Now it’s my turn to feed them. By Caroline Wright October 13, 2020FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Molly Baz, Prop Styling by Emily EisenFacebookTwitterEmailMy third cookbook was a dream project, quite literally. It made manifest the dream I’d had as a budding food editor just out of culinary school, to travel and eat while writing a book. In Austin, Texas, I rode a bike to a restaurant every day for two weeks to meet with my coauthor and chef. As I took notes from his line cooks during prep hours and hid in the office during service, I knew I was part of something exciting. I chased this project doggedly for two years, even as I had my second son and moved two weeks later when my husband took a job in Seattle. I left my nursing baby with a hundred bottles of milk so I could go to Spain to follow the chef from Austin to his hometown in the Catalan countryside in the name of research, then right into a book tour for my second cookbook. The wild life in food I’d always wanted had arrived; never had I been more proud to be a cookbook author.The manuscript for the Catalan cookbook, the very one I’d traveled thousands of miles for, was a reflection of the two-year rollercoaster I’d desperately clung to. I didn’t sleep for weeks before the deadline. I became ragged in its service, the tariff required to be a serious cookbook author, I thought.I turned in my manuscript with great relief, having crossed a symbolic finish line unlike any other I’d had in my career. I had devoted all my creative energy into those pages over two years. I had created it from nothing. I arrived on the other side of that deadline disoriented, as if returning home from a very long trip, with my sole focus on my two young sons (then just one and four). I was out of practice, I thought, as I started to have panic attacks and headaches. The demands of my book had taken their toll, and I couldn’t sleep. I wrote my doctor an email including my symptoms, and she suggested it was worth my coming in for a checkup.As I sat on the butcher paper in her office, I filled out a variety of forms that attempted to gauge levels of anxiety and depression. My doctor looked at my middling results and asked follow-up questions; my answers made her chuckle. She said my headaches were just migraines caused by stress, and described the sensation of a migraine, miming bands of pain around her head. My headaches were constant, I told her, and I had a particularly terrible one behind my right eye that I’d brushed off as a sinus headache, something I’d also never had before. She paused—not even dramatically now that I think about it, just a quick second thought that changed the course of my life—and said she wanted to order an MRI just in case. But she assured me that I was likely just a healthy, stressed mom.The MRI ended up revealing a very large brain tumor in the right side of my frontal lobe. I was told about it over the phone the day of my MRI; my doctor’s voice was shaky with disbelief, like mine was.The adventure that came next was another kind of dream entirely, another that carried me swiftly through a current of new information in the following week: doctors’ appointments, shaving my head, brain surgery. Another week passed, spent heaving the body I was angry with out of chairs and telling it to shuffle its feet across the floor. I fed it takeout, a kind of punishment for the cook dwelling somewhere inside. The writer in me, though, was unencumbered by my unrecognizable form: I wrote constantly on an online journal, a CaringBridge site I’d set up to share my health story, at first fueled by steroids, then simply because I could, because the surgery hadn’t taken from me my ability to write as my doctors warned it might. I wrote because I didn’t know what else to do, the dream I was living in didn’t make sense; I wanted to change it but didn’t know how.Around this time, notes from my editor arrived in my inbox for the Spanish cookbook. After a few phone calls with my agent, we determined the best outcome was for me to hand over the rest of my advance to a ghostwriter. And so my dream project was whisked from my hands as if it had never been mine at all.I was called back to the doctors’ office to learn that my brain surgery wasn’t, in fact, the end of this wild ride, but only the beginning. My surgeon told me I had cancer, glioblastoma, and likely only about a year to live.I cried. I sat as my parents and husband cried over my body that seemed to belong to someone else. I told my oldest son that his mother might be leaving him but I would do everything in my power to try to change that. I immediately began the kind of diet I’d made fun of as a food writer, looking for buzzwords like alkaline and anti-inflammatory; I began to take menu suggestions from a homeopath. Suddenly, I was eating like a totally different person: I now no longer consumed refined sugar, gluten, and chocolate; I swapped my daily coffee for tea; I made a “do not eat” list that would have previously read as a grocery list. I wasn’t yet strong enough to cook, however, so I immediately took to my CaringBridge and sent a call for homemade soup into the void. It was also the first place I admitted publicly to my diet changes, as if holding myself accountable.Every day the cooler we left on the front porch was stocked with a jumble of jars, all filled with soup that suited my new diet. Many jars came with notes, but just as many came without: The wishes for health and love were implied in the soup itself. I spent the next three months undergoing daily chemo and radiation treatments, and to the disbelief of the team constantly monitoring my body on a cellular level, I grew stronger, healthier even. My job had become to survive for my family, and somehow I was.As I grew stronger, I needed to cook again as much as I’d needed to write, and so, with deep gratitude, I asked my anonymous soup spirits to stop filling the cooler out front. I cooked as a means of exploring my new way of eating, trying to convince myself that I could enjoy, share, and write about food despite the limitations I’d put on my diet. But I was unhappy. Because of my diet, I felt even more isolated than I did as a cancer patient betrayed by her own body.I arrived at the year mark, the time I was given to live, and my scans were clean. I’d survived against very slim odds and built a strange life for myself in the process, one that held parts of myself separate from another. The place I’d arrived at was foreign, desolate: my dream career had fallen away, and my cancer had put my family in serious financial difficulty. I was thrilled to be alive, but the life I’d gotten back wasn’t really living.So I decided to make soup. Soup, this sustenance that communicated health, love, and community in a way that I honestly believe saved my life. I believed it could save me again. I decided to make it for the friends who made it for me, to drop it on their porches and hope it gave them something they needed. And so, soup club was born.Many of my friends are vegan, so I chose to make vegan soups despite not being a vegan myself. I wanted to prove to myself that eating a restricted diet didn’t exclude flavorful, exciting food. Making vegan soups was like the most challenging article I’d ever written—I needed them to be amazing, to say something interesting and different. Cooking pots upon pots of soup for people who would eat it within a few days gave me an immediate feedback loop I’d never had before in my work. My soups were affecting my members’ lives in a real way, and my creativity was felt in their bowls; I was receiving silly soup texts and beautiful soup-inspired artwork as heartfelt gratitude.And when an idea for a cookbook came to me, I knew I was fully restored, alive again. I saw it clearly: a book inspired by my cancer story, yet not defined by it, one that belonged to my community. To return to them the debt of soup and life they had given me, sewn together in pages that held our collective story.Today, I am alive and have indeed created the cookbook I am proudest of: Soup Club, a collection of the recipes I make for my friends. Turns out, it didn’t take journeying across the world to find my dream project. It found me right where I was, and fed me soup that saved my life.Read more about the Soup Club Cookbook.Explore Bon AppétitFirst PersonHealthyishSoupessayRead Morecooking73 Healthy Soup Recipes That Make Any Day CozierGallery73 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-13", "author": ["Condé Nast", "Caroline Wright"]}