{"id": "c39244dede2a9af1c8f29ad00f0ee23c", "url": "https://www.bonappetit.com/story/pie-crust-stand-mixer", "year": 2018.0, "month": 8.0, "day": 4.0, "content": "How to Make Flaky Pie Crust Using Your Stand Mixer | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenThe Case for Making Pie Crust in a Stand MixerChe Fico pastry chef Angela Pinkerton shares the foolproof method she relies on for fast and flaky crust.By Chris MoroccoAugust 24, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailHere's the bad news: You can make many mediocre pies before you start making good ones. You can under- or over-work the dough. You can add too much water, or not enough. You can mess it up in the food processor and you can mess it up by hand. And the one constant you can depend on is that everyone will have a different piece of advice to offer about how to do it the \"right\" way. Easy as pie? Not so much.But when I spent an afternoon with Angela Pinkerton, the pastry chef at Che Fico in San Francisco (our #7 Best New Restaurant of 2018), she walked me through a method so foolproof that I now feel compelled to tell you about it. Her technique uses a stand mixer and is one of the most hands-off approaches we've ever seen to still yield a flaky, golden crust. Pinkerton is a pastry wizard (she won the James Beard Award for Outstanding Pastry Chef in 2011). Yet there she was in the Che Fico kitchen using a regular old stand mixer not just to paddle the butter and flour together, but to incorporate water into the dough as well.You can use this method to make crust for galettes, too!\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiThe general technique for making pie dough can more or less be distilled into two steps: first, combine the flour with some kind of fat (butter, lard, shortening). That's the easy part. Reading the instructions, \"Work the butter into the flour until the largest pieces are the size of peas,\" you swell with confidence. You eat peas! No worries there. The tricky part is the second step, when you add cold water to bring everything together and turn fat and flour into dough. How much do you mix the water into the dough? (Less than you think.) How much do you work the dough together? (Probably more than you think.) How much water do you use? (Up for debate).Then there's also the question of whether to make the crust by hand or use a food processor, arguably the two most popular methods. Some cooks swear by the food processor, but it has drawbacks. Adding the water via a food processor can very quickly result in an overworked dough (read: a tough crust). Making crust by hand allows you to really get a feel for what it should feel like, but it's slower and more labor-intensive. Pinkerton explains that working the water fully into the dough using a  stand mixer at low speed is both efficient and gentle, since it works the entire mixture in slow and even sweeps of the paddle. Once you can no longer see any dry spots of flour and the dough is starting to clump together in the mixing bowl, it's ready to transfer to a clean work surface, at which point you can work it by hand a couple of times as you shape it into disks.Pinkerton's hands-off process doesn’t require baking intuition or experience, just knowing when to shut the mixer off. As soon as there are no spots of dry flour left (but before the dough forms a ball), turn the dough out onto a clean work surface and work it together by hand a few times before flattening into discs.The result is a dough that's easy to work with mainly because it's evenly hydrated, which means there are no dry spots lurking in the dough just waiting to turn into cracks later on. As always, roll with frequent dustings of flour, rotating the dough often, and plenty of confidence. Pie can smell fear. You got this.Get the recipe:Grapefruit-Orange CrostatasWhile these mixed citrus tarts bake, the semolina flour in the frangipane absorbs the juices and turns into a slightly puffed, airy layer surrounded by flaky pastry.View RecipeExplore Bon AppétitDessertPieHot 10 2018Read MorecookingYou Can't Overbake This Deep Dish Apple PieBy Claire Saffitzeffed it up3 Reasons Why Your Baking Fail Is Probably Not Your FaultBy Claire SaffitzcookingAll Hail “Rough Puff,” Puff Pastry for CheatersBy Alyse WhitneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-23", "author": ["Condé Nast", "Chris Morocco"]}