{"id": "c399dc241a079fceeb6580c933156f1d", "url": "https://www.bonappetit.com/recipe/lemon-pound-cake", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Lemon Pound Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLemon Pound CakeBy Lauren SchaeferOctober 7, 20184.7(118)Read ReviewsTriangleEmailPinterestPrintPhoto by Caleb AdamsEmailPinterestPrintEmailPinterestPrintDoes everyone need to know how to whip up a pie crust from scratch, or build a towering, elaborately decorated layer cake? Absolutely not. But every cook should have at least one good dessert up their sleeve, and this classic, lightly glazed lemon pound cake should be yours. Rich and tender, not too sweet, and fragrant from tons of lemon zest, it's the kind of baked good you can just as easily serve with coffee in the afternoon or as the finale to a sit-down dinner party. (Nobody will get mad if you top each slice with a scoop of ice cream, a dollop of homemade whipped cream, or even just a spoonful of good Greek yogurt.) You will need a couple of pieces of equipment, namely a loaf pan and a hand mixer, but both are kitchen essentials and not very expensive—consider this your excuse to invest.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketLoaf Pan$15 At AmazonParchment Paper$3 At AmazonMicroplane$16 At AmazonLarge Bowl$18 At AmazonElectric Mixer$40 At AmazonWhisk$10 At AmazonSpatula$12.99 At AmazonCake Tester$3 At AmazonVegetable Peeler$10 At AmazonCutting Board$10 At IKEAChef's Knife$34.53 At AmazonCitrus Juicer$13 At AmazonMedium Bowl$17 At AmazonWire Rack$23 At BA MarketIngredientsMakes one 9x4\" loaf1cup (2 sticks) unsalted butter, room temperature, plus more for pan3lemons1cup granulated sugar3large eggs1¾cups all-purpose flour1½tsp. baking powder½tsp. kosher salt6Tbsp. whole milk1½cups powdered sugarPreparationStep 1Place a rack in center of oven; preheat to 350°. Butter a 9x4\" loaf pan, fully coating bottom and sides. Line pan lengthwise with parchment paper, leaving about a 2\" overhang. Are you reading this and wondering, \"Can I use wax paper instead of parchment paper?\" The answer is: absolutely NOT. That strip of parchment paper will help you to lift the finished cake out of the loaf pan cleanly. Wax paper, on the other hand, will melt and stick to the cake—it's never meant to go into the oven. Now you know!Play/Pause ButtonPausePlay/Pause ButtonPauseChevronChevronStep 2Using a Microplane, finely grate the zest from 2 lemons into a large bowl. Add 1 cup (2 sticks) unsalted room temperature butter and 1 cup granulated sugar to bowl. It might be tempting to ignore the part about the butter being \"room temperature,\" but working with butter that's soft and spreadable—but not melted—is essential here.Step 3Using an electric mixer on high speed, beat until mixture is very light and fluffy, about 5 minutes. You know how people talk about \"creaming\" butter and sugar together? That's what you're doing here. You're basically whipping a bunch of air into the butter and sugar mixture, which will help keep the finished cake light and fluffy. And as we mentioned in the last step, that butter needs to be room temp in order for this to work.Step 4Beat in 3 eggs one at a time, waiting until each is incorporated before adding the next. Continue to beat until mixture is lighter and even fluffier, about 2 minutes.Step 5Whisk 1¾ cups all-purpose flour, 1½ tsp. baking powder, and ½ tsp. salt in another large bowl. It might seem funny to add salt to a dessert recipe, but a little bit helps to make all of the rich, sweet elements really sing.Step 6Add one-half of dry ingredients to butter mixture and beat on low speed just until combined.Step 7Beat in 6 Tbsp. milk on low just until smooth, then add remaining dry ingredients and beat just until combined. Now that you've added the flour, you want to mix the batter as little as possible—if you beat it up too much, you'll start to form gluten, which will make the cake tough. Using a spatula, scrape down sides of bowl and give batter a final mix so dry ingredients are fully incorporated.Step 8Scrape batter into your buttered loaf pan; smooth top with a spatula. Bake cake, turning once halfway through, until a cake tester, toothpick, skewer, or thin knife inserted into the center comes out clean, 45-55 minutes.Step 9While the cake bakes, make the glaze: First, remove zest from remaining lemon with a vegetable peeler in wide strips. (FWIW, if this part seems overly fussy or annoying, you can feel free to just use a Microplane to zest all of the lemons for the glaze, but we think doing it this way looks cuter.)Step 10Transfer zest to a cutting board and slice as thinly as possible; set aside.Step 11Halve 2 lemons (the ones you already zested) and squeeze the juice into a small bowl with a reamer or fork (you should have about ½ cup lemon juice).Step 12Place 1½ cups powdered sugar in another medium bowl. Slowly whisk in about half of lemon juice until smooth, then add sliced lemon zest; set glaze aside.Step 13Let cake cool about 10 minutes. (Yeah, it really does need to cool a bit, so set a timer if you're impatient.) Poke 10-15 holes evenly throughout cake with a cake tester or toothpick. Pour the remaining lemon juice—the stuff that didn't end up going into the glaze—over the top of the cake. Let cool completely. (Seriously!)Step 14Run a butter knife around edges of pan to loosen. Using parchment overhang, lift cake onto a wire rack; remove parchment.Step 15Now, pour the lemon zest glaze over cake, letting it fall down the sides. Let icing set for at least 10 minutes before slicing. Serve on its own, or with a spoonful of Greek yogurt, a dollop of whipped cream, or a scoop of ice cream on top. (You deserve it!)How would you rate Lemon Pound Cake?Leave a ReviewTell us what you thinkReviews (63)Back to TopTriangleI used the pan size suggested and had to cook it for a little while because it was still raw in the middle. Ended up having dry edges but the middle was very moist. Love the flavor. I would try adding half of the batter to try and get it to cook on the inside as fast as the outside. Anonymousalaska3/11/2022I’m in love with this lemon pound cake! I do always end up having to cook it longer than suggested, but it turns out great every time. I modify the glaze as well— the recipe given makes a SUPER thin glaze and we like it thicker! 10/10 for me though. JuliaFlorida10/12/2021This was good, but not great.  I followed the recipe pretty much exactly and pulled the cake from the oven as soon as it was done, but it was much drier than other pound cakes I've had.  Really had to have ice cream there to moisten it.  The lemon flavor was good and the swirls of lemon zest on top were cute, but I was vaguely disappointed with it,.  I think I will try again but will work on making it moisterAnonymousChapel Hill NC10/3/2021Made this cake several times.  Cake is yummy.  Have replaced milk with Almond Milk or almond milk yogurt.  also drizzle lemon juice on underside and sides of cake.  Reduced vol of lemon juice in glaze-too much glaze.AnonymousOrange County, CA7/29/2021To reinforce, Please provide your recipes with weights and oz's so that we can make what you made. It is not acceptable for Bon Appetite to put out these recipes with guesswork at the core. No excuse!\nAnd be very careful with the final lemon drench as it changes the cake entirely and maybe not for the better.labansAustin, Tx7/5/2021I know basically is supposed to be no-recipe recipes, but in this case it does not make things easier.  Lemons vary in the amount of juice they produce, and using half of a no number amount is nonsense.  My glaze looks like water and I’m out of powdered sugar.  Thanks a lot.AnonymousCleveland OH5/21/2021This is a deliously lemonly pound cake.  T've made it several times now, and it's always a hit!JanetColumbuus, O3/10/2021I’ve made this recipe twice now and it is delicious! However, the last time I made it I used my oven’s convection bake instead of regular setting and it baked much faster on the edges while leaving an under baked center with a fallen dome. I think that this was just due to the convection setting. I would recommend baking it normally, for anyone looking to try it out. \nAdditionally, I make it with Meyer lemons, which I find makes it taste so unique and delicious.\n\ntl;dr\nDelicious, but don’t use convection bake & try it with Meyer lemons!Caroline R.Washington, D.C.1/23/2021My favorite pound cake recipe!  So easy!  I do leave out the glaze b/c there's no need, and it felt overly sweet with it.   Would you consider providing the WEIGHTED measurements?  i find the weights make everything much more accurate & consistant.  Thank you!Anonymous1/22/2021The absolute BEST lemon pound cake I have ever made!  This is the second time I've made it and my whole house is so fragrant from the buttery, lemony ingredients!  Very easy directions to follow; I have never been a baker, BUT it was so easy.  Once again, I cannot wait to slice into this beautiful pound cake.    Everyone should try it just once, you'll be making it again I promise.   Thank you!!!Anonymous8/25/2020I make recipe this every few months, but tbh it really comes to life when you replace the lemon with orange and add in about a cup of frozen cranberries. It takes longer to bake but it ends up a lot more moist and the cranberry adds a bit of color and tang. I usually mix half lemon and half orange juice for the soak AnonymousRhode Island7/28/2020SUPER easy to make and delicious! I made it with Cup4Cup gluten free flour and it worked perfectly. If making with gluten free flour I baked it for 70/75 minutes. I love the edition of the lemon juice before the glaze. I didn't have a cake tester so used a chopstick and it looked kinda weird with the holes as you could see it through the glaze so would recommend finding something thinner like in the recipe.ellashteinLos Angeles5/12/2020Best pound cake I've ever had in my entire life !AnonymousBruxelles5/7/2020THANK YOU for this lovely recipe! I used the zest of only 1 lemon in the cake batter, and skipped the glaze because I was quite happy with the level of sweetness in the cake itself. It baked spectacularly and the fragrance of buttery, lemon cake is wafting through my apartment. I definitely would bake this again, and perhaps add some poppyseeds as well just for some fun in texture. Many thanks, again!Jin-wenSingapore5/1/2020It was good, not great, and easy to make. Not quite the lemon pound cake I was craving... just not rich enough, despite the cup of butter. Maybe swapping the milk for sour cream would help? Crumb was very delicate, but I didn’t care for the way the top had pockets of pure lemon juice - a bit sour and made the bottom taste like nothing in comparison. tranteryostDFW, Texas 4/29/2020Explore Bon AppétitCakeDessertLoaf CakeAmericanLemonCitrusFruitEasyNut-FreeBakingBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-07", "author": ["Condé Nast", "Lauren Schaefer"]}