{"id": "c39d16eff99e597b57a381f3fdfe2ea4", "url": "https://www.bonappetit.com/story/carrot-glaze", "year": 2020.0, "month": 3.0, "day": 5.0, "content": "This Carrot Cake Glaze is Simple to Make As Long As You Follow These 4 Tips | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis 3-Ingredient Glaze Is the Most Exciting Thing to Ever Happen to Carrot CakeHere's what you need to know to master it. By Sohla El-WayllyMarch 30, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.For this carrot cake to truly channel my mother’s carrot halwa, it wasn’t enough to incorporate brown butter, chopped pistachios, and a generous amount of warm spices and call it a day. See, this fudge-like carrot candy found throughout the Middle East and South Asia has a lot going for it—nutty ghee, floral cardamom, sweet cinnamon—but all I really care about is the sweetened condensed milk (added once the shredded carrots are totally tender) that makes it sticky, soft, and sweet. I needed a glaze that would mimic that milky, long-simmered quality.In order to achieve it, I cooked down a mixture of equal parts cream, sugar, and carrot juice until thick and caramel-y, then finished with a bit of butter to keep the glaze tender (instead of a stick-to-your-teeth situation). The result? A thick, bright orange icing that drips dramatically over the sides of the cake.You’ll be blown away by how stupidly simple this glaze is—you really do throw it all in a pot and let ‘er rip. That said, there are a few keys to mastering it on the first attempt:1. No stirring!You might be tempted to stir together the ingredients—but don’t. Add all of the ingredients to the pot, then turn the heat to high. As it simmers, the sugar (which is heavy) will sink to the bottom, forming a protective layer that prevents the cream from scorching. This only works if you do not touch it. Even a gentle stir will dissolve the sugar into the mixture, where it will be too dispersed to insulate the sensitive cream.2. Fear not the foam.Initially, the glaze will get very foamy, likely reaching the rim of the pot, before settling back down. It’s going to be scary at times, but trust that no matter how close to the edge you get, the glaze will not boil over. The fat in the cream breaks the surface tension that otherwise enables water to crawl up and over the sides of the pot, as when cooking beans or milk. You’ll know you’re close to thick, sticky, sweet success when the foaming subsides, an indicator that much of the excess water has boiled off.3. Do the cold plate test.To judge whether your glaze has sufficiently reduced, you’ll do the same simple test that’s used to ensure that jams and jellies are set. Stick a plate in the freezer, then drip a line of the glaze on the cold plate when you suspect it’s finished. If your glaze is ready, the line will hold its shape and you should be able to run your finger through it and leave a mark without the two sides running together. And remember: It’s better to test too early than too late! You can always return the pot to the stove and reduce the mixture for a couple more minutes.4. Let it cool.When your glaze is finished and you’ve added the pat of butter, let it cool for 15 minutes, until it’s warm to the touch but not hot. If the glaze is too hot when you pour it over the cooled cake, it will spill right off, but you need it to still be just a touch warm in order to achieve a smooth finish.Once your cake is glazed, it’s best to eat it that day. Since I’m only feeding myself and my husband these days, what I like to do is keep the cake bare and the glaze in a container in the fridge. I eat the cake by the slice, with a little (or big) spoonful of glaze on top.When I close my eyes and take a bite of this glazed cake, my entire childhood flashes before my eyes: the thick-rimmed red plastic glasses, eating lunch alone in the bathroom, having no date to prom…but you know, in a warm, fuzzy kind of way. It really, truly gives me all the carrot halwa vibes I was searching for.Get the recipe:Cardamom-Pistachio Carrot CakeHere’s what happened after carrot cake met carrot halwa, the milky, long-cooking, spoonably-soft confection common in South Asia. Raisins, cinnamon, and cream cheese frosting made way for brown-butter pistachios, cardamom, and sticky carrot glaze and the rest of their romance was history. View RecipeExplore Bon AppétitBasically BakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-30", "author": ["Condé Nast", "Sohla El-Waylly"]}