{"id": "c3aeef89e389f90bb137f28204861b49", "url": "https://www.bonappetit.com/recipe/marinated-olives-with-citrus", "year": 2022.0, "month": 3.0, "day": 3.0, "content": "Citrus-Marinated Olives Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesApril 2022 IssueMarinated Olives With CitrusBy Rebekah PepplerMarch 15, 2022EmailPinterestPrintPhotograph by Joann Pai, food and prop styling by Rebekah PepplerEmailPinterestPrintEmailPinterestPrintThis “olive lovers only” mix from À Table author Rebekah Peppler goes great with a drink, whether that’s an aperitif for one or cocktails for a small crowd. Fragrant with orange, coriander, and peppercorns, the simple marinade is an easy way to upgrade a store-bought staple. Make it hours or even days in advance—stored in the fridge, the olives will last for about two weeks.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronSmall Saucepan$155 At AmazonChef's Knife$34.53 At AmazonGlass Storage Container$16 At AmazonIngredients6 Servings1small navel orange, quartered, thinly sliced8large garlic cloves, lightly crushed2bay leaves¾cup extra-virgin olive oil6sprigs thyme2Tbsp. sherry vinegar or red wine vinegar1Tbsp. black peppercorns, crushed1Tbsp. coriander seeds, crushed2cups mixed olives (such as Niçoise, Picholine, and/or Cerignola)PreparationStep 1Cook orange, garlic, bay leaves, and oil in a small saucepan over medium heat, swirling occasionally, until garlic is sizzling and golden around the edges, 8–12 minutes. Remove from heat and stir in thyme sprigs, vinegar, peppercorns, and coriander seeds. Let cool until marinade is lukewarm, about 20 minutes.Step 2Place olives in a small bowl and pour marinade over. Let sit at room temperature 1–4 hours before serving.Do ahead: Olives can be marinated 2 weeks ahead. Cover and chill. Bring to room temperature before serving.Recipes adapted with permission from  ‘À Table: Recipes for Cooking + Eating the French Way’ by Rebekah Peppler. Copyright © 2021 by Rebekah Peppler. Published by Chronicle Books.\n\nBuy it on Amazon or Bookshop.orgHow would you rate Marinated Olives With Citrus?Leave a ReviewTell us what you thinkExplore Bon AppétitStarterSnackEasyQuickDairy-FreeNut-FreeGluten-FreeVegetarianVeganOliveOther IngredientsOrangeCitrusFruitSimmerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2022-03-15", "author": ["Condé Nast", "Rebekah Peppler"]}