{"id": "c3b1c0236ad0fe641e67486a2356c548", "url": "https://www.bonappetit.com/story/chanthy-yen-touk-pop-up", "year": 2020.0, "month": 10.0, "day": 1.0, "content": "It Took a Pandemic for Chef Chanthy Yen to Open the Restaurant of His Dreams | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsIt Took a Pandemic for Chef Chanthy Yen to Open the Restaurant of His DreamsThe crisis forced him to stop, reflect, and start making the food that inspired him to become a chef in the first place. Now, his Cambodian pop-up Touk has lines down the block.By Chanthy Yen, as told to Joanna FoxOctober 6, 2020FacebookTwitterEmailPhoto by Dominique LafondFacebookTwitterEmailFleeing the Cambodian civil war in the 1980s, chef Chanthy Yen’s parents and grandparents arrived as refugees to Windsor, Ontario, a sleepy Canadian town ten minutes from Detroit. Yen grew up in his grandmother’s kitchen; she taught him everything she knew about traditional Cambodian cuisine. It ignited a passion for cooking, and more importantly, it opened opportunities. Yen went on to cook his way around the world, working with acclaimed chefs like Andoni Luis Aduriz, Ferran Adrià, and Magnus Nilsson, before settling in Montreal as the executive chef of Parliament, a British pub-inspired restaurant. When the pandemic forced the restaurant to temporarily close, Yen saw another opportunity. In late May, he opened Touk, a Cambodian street food pop-up inside Parliament. It was an instant success—with lines down the block and sold-out dinners—and garnered international press from as far as Phnom Penh. Despite the uncertainty surrounding the virus, Yen has never felt clearer about his future. –Joanna FoxCooking has always made me happy, but Touk is like a spiritual experience. It feeds my soul. I feel at peace making amok, coating haddock in a velvety yellow curry custard then wrapping it in banana leaves and throwing it on the grill. Simmering down khuy tiev, a rich beef stew of tripe, tongue, and marrow, is like a ritual, and not for the faint of heart. One of the most popular dishes on my menu is nom banh chok, delicately poached cod in a curry broth made of fermented fish, roasted peanuts, and coconut. In a time when we’re all longing to go somewhere else, it takes you far away, to a busy street food stall in Phnom Penh.Last week, a woman told me that my cooking reminded her of her mother, who is no longer with us. She started to cry, but not because she was sad. She just never thought she’d taste those dishes again—made the way her grandmother taught her mother, like my grandmother taught me.Touk serves only a handful of Cambodian dishes, many of which you won’t find in any other restaurant in Montreal, maybe even Canada. It’s my grandmother’s teachings filtered through my Canadian lens and using contemporary techniques gathered throughout my career. Touk is temporarily inside Parliament, an elevated British pub where I was the executive chef before the pandemic forced us to close and rethink our next move. I poured all my creativity and care into each dish there, from whelks on toast to the essential Sunday roast. I became Parliament, just like any chef who steps into the mold of where he cooks. But when the pandemic forced me to re-examine what I was doing, I had to re-examine myself. I realized there was something off. It wasn’t the food, which was excellent, for the record. It was that my entire career was not actually me. And I had been ignoring that my whole culinary life.Cooking began with my grandmother. She was a real warrior. As she fled from one refugee camp to the next during the Cambodian civil war, she helped orphaned children who had lost their parents, either to land mines or other casualties of war, and literally carried them on her back to the safety of the next camp. She was full of strength, love, and kindness. She raised me, from ages two to seven, because my parents, as new immigrants to Canada, could not care for a small child. They worked in a factory all day and picked worms at a farm at night for a local bait shop, barely making ends meet.I can still remember my grandmother’s kitchen. We had a table, which was just for show, a Western staple we adopted but never used. The floor was where everything took place—where we ate but also where we prepared food, squatting, chopping, pounding, cleaning. I can still hear the grinding of the mortar and pestle, the stone pestle hitting the mortar at that perfect angle so you get that little double tap. I can smell the chiles and garlic toasting over the fire.Every meal was a lesson, an attempt to absorb the complex cuisine of Cambodia with its six pillars (salty, sour, sweet, spicy, bitter, and aromatic) and its reliance on fragrant ingredients like kampot peppers, galangal, finger root, and lemongrass. As my grandmother’s apprentice, I was taught to always start with rice; how to make the fundamental red, green, and yellow curry pastes; and how to pickle and ferment. She explained the importance of our mother sauces (curries, chutneys, and fermented pastes). I watched her make her own rice wines with yeast, grow her garden filled with ingredients from home (bok choy, chiles, baby eggplant, mustard greens, and makrut), and properly clean a chicken and split the bones. Over time, her knowledge became mine, and before I moved out, before I even learned how to speak English, I had perfected the essential Cambodian techniques of steaming, grilling, sun-drying, stir-frying, spit-roasting, boiling, and lacto-fermenting. It was a wonderful time of my life, in this world my grandmother created, where shared meals were all we needed.Dominique LafondEventually I moved back to my parent’s place in Windsor. No one there knew how to cook, so I did. The war raised my parents; they had no idea how to nourish. All they knew was conflict. They were scarred by their past, and cooking was the only way I knew how to care for them. I made lots of soups and stir-fries and eventually started to introduce them to Italian food (my first part-time job). They loved grilled calamari. But cooking was also my safe space. It was how I could help and nurture, and I was good at it. As soon as I realized that I could make money cooking, it gave me financial control of my life at a young age. I saw it as a way out of this home, this town, and this life as an outsider.Being queer and a visible minority, I always had to prove myself. I learned English late, which made it hard to relate to other kids and immediately isolated me. I never saw myself reflected in others and always felt like I had to pave my own way, alone. The culinary world was no different. I was stereotyped in the kitchens I worked in—put in pastries because I was “feminine” or fish because I was Asian. I was called names and hidden away in the back of the kitchen. So, I fought back the only way I knew: I became an expert, excelling in all cuisines and working the hardest, the longest, the best. I was a machine that would not quit. I rose through the kitchen ranks; became the chef of my very own restaurant, Fieldstone (which closed in 2019); and then found my way to Parliament. But still, I never felt like I fit in. I couldn’t see myself in this chef mold.Before COVID-19 put everything on hold, I was trying to stay as busy as possible, doing my job, taking on as much work as I could, not thinking about those outsider feelings I wore like a second skin. Once I was forced to stop, I realized what I had pushed deep down inside: a legacy of history, skills, knowledge, and food, all buried by the desire to succeed on someone else's terms.For the first time since I was a boy, I allowed myself to fully embrace my culture and let it break through bigger and stronger than ever before. Cooking was always my safe space, but Western food became a shield I hid behind for years. Touk gave me the opportunity to proudly show everyone who I really was. It was my turn to follow in my grandmother’s footsteps and let myself heal through food.Especially at this moment in time, I’ve needed that space to speak my mind and my heart. Not just to get through this crisis but to defend myself from the racism I face now, more frequent and brazen. People dart away while I’m grocery shopping, tell me to go back to my country, or move off the sidewalk where I’m walking. A man once yelled, “No COVID here, you Chinese f#%”.When I first proposed the idea of Touk to the owners of Parliament back in May, I was scared they would react like how a lot of people were responding to Asian restaurants and businesses—with fear and uncertainty. But they welcomed my vision, supported me, and gave me agency to create something that was completely personal.Touk is me, all parts of who I am forged over years of challenges, discrimination, and a difficult upbringing. It’s my new way to fight back and assert my place here and now. Crisis forces us to change—it pushes us to make decisions we may never have thought were possible. COVID-19 was that catalyst for me and brought me somewhere I may not have gotten to, had the world not compelled me to pause and reflect. I’ve come to realize that my path has always been linked to food—I just couldn’t see that it was Cambodian food. I don’t know how long Touk will go on for, but it’s something I felt in my heart could never fail. It’s given me the confidence to cook my food, not the food of others. And if Touk doesn’t work out, I would go down with it—then get back up and fight again.Make Yen's fragrant grilled fish salad: Nhoam Trey Mhasamout (Grilled Halibut Salad)This fragrant Cambodian salad is a multisensory experience—a combination of crispy shallots, juicy citrus, fresh herbs, and tender, grilled fish.View RecipeExplore Bon AppétitChefsMontrealRestaurantsFirst PersonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-10-06", "author": ["Condé Nast", "Chanthy Yen", "As Told To Joanna Fox"]}