{"id": "c3b2239b83fca48ce7dc0843706a4104", "url": "https://www.bonappetit.com/story/how-to-make-marble-cake-swirl", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "How to Make Marble Cake With a Dramaaaatic Swirl | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoptechniquesHow to Make Marble Cake With a Dramaaaatic SwirlThis #content is ready for Instagram.By Alyse WhitneyMarch 29, 2018FacebookTwitterEmailPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen KaminskiFacebookTwitterEmailOur new Swirled Sesame Tea Cake made me gasp the first time I saw it. Mesmerizing swirls of black and white sesame—a galaxy of buttery tahini pound cake. But something that beautiful seemed unattainable, and my dream of making it sunk like the Heart of the Ocean at the end of Titanic.Then senior food editor Claire Saffitz gave me a pep talk—like she has before with buttermilk biscuits—and I realized it’s not all that difficult. So, how do you make marble cake? How do you achieve food stylist perfect swirls? It takes some trust in the process, decisive swirling, and not overdoing it. Here’s a step-by-step guide to mastering that made-for-the-’gram swirl, plus tips for marbling other treats.This is easier than it looks.\nPhoto by Stephen Kent Johnson, food styling by Rebecca Jurkevich, prop styling by Kalen Kaminski1. Separate the BattersThere are two colors of batter for this pound cake: a beige tahini and a grey-blue black sesame. It’s important to keep them both in separate bowls and use two separate spatulas to scoop them into the pan. If the colors mix before they hit the pan it will be murky and brown.2. Dollop Alternating ColorsAlternate spoonfuls of tahini and black sesame batter width-wise across the pan, so it looks like thick stripes of each color. It’s okay if they overlap a bit, but they shouldn’t be directly on top of each other. It’s gonna go where it wants to go, so let it do its thing, Saffitz encourages.3. Swiiiiiirl, Baby, SwirlA metal or wooden skewer is the best tool to swirl all the way through, since this swirl is inside the cake rather than only on the surface. Once you cut into a slice, there should be a nice marbling of the two colors. To achieve this, insert the skewer into the batter until it almost touches the bottom of the pan and drag it through in figure-8 patterns. Be decisive when you drag, and do three or four strokes total. If you over-swirl, it will all become one ugly brown—you want definition of color. It doesn’t respond well to fussing, so go for it and don’t be too deliberate with making a “pattern.” You can do the figure-8s in different sizes as long as you don’t do more than four.Less is more—you only need 3–4 swirls.\nJoe Wilson4. THE BIG REVEALBake for 55–65 minutes until a cake tester—or, hey, maybe that skewer you used before once it’s washed!—comes out clean. Cool in pan for 10 minutes, then run a knife around the shorter sides of the pan and lift the parchment to unmold the cake onto the rack. Then you still have to wait until it cooks completely to cut into it and show off your swirling skills. If you slice it while it’s hot, it could fall apart and ruin all your hard work.Use that swirling technique on tahini brownies!\nPhoto by Alex Lau, Styling by Sue Li5. Swirl Some MoreThe general rule for swirling is that the two things have to be the same texture or consistency. It’s hard to swirl a liquidy thing into a drier thing and vice versa. Try marbling a coffee cake, tahini brownies, or different colors of meringue. And then stand on a chair and take the perfect photo of your creations. 🙃Get the recipe:Swirled Sesame Tea CakeThe intense, savory sesame flavor balances out the sweetness of the loaf for an addicting snack or dessert. For tahini lovers!View RecipeExplore Bon AppétitCakeBakeSesameTahiniRead Morerecipes36 Tahini Recipes for Hummus, Cookies, Noodles, Meat, and MoreGallery37 SlidesBy Rochelle BilowcookingThese Gluten-Free Tahini Brownies Are Annoyingly GoodBy Chris MoroccoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Alyse Whitney"]}