{"id": "c3b2bd579beb98ec37a6908183fcc1b1", "url": "https://www.bonappetit.com/story/new-hard-drinks", "year": 2020.0, "month": 3.0, "day": 1.0, "content": "17 New Hard Drinks the World Isn’t Ready For | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopculture17 New Hard Drinks the World Isn’t Ready ForBut I am. By Alex BeggsMarch 4, 2020FacebookTwitterEmailPhoto by laura Murray, styling by Allie WistFacebookTwitterEmail$1 billion! That’s how many sales of hard seltzer cha-cha-chinged last year. Nielsen just reported that the number of hard seltzer options will double in 2020. Sales are BOOMING. Billions of Americans are lightly buzzing! And clinging to the coattails of all that hard seltzer are even more up-and-coming hard drinks that hope to join the club. Let’s take a sneak peek at what’s next.Introducing…Hard Smoothie! After a grueling workout, refuel your body and lubricate your muscles with a combo of frozen mango, trace amounts of undisclosed grain alcohol, coconut water, and chia seeds. Look for random endorsements by 2020 Olympians who don’t know any better, coming this summer.Hard Milk is your favorite retro cocktail—a White Russian, hello!—without icky caloric sugary coffee liqueur. This light n’ boozy version, made from watered down cow’s milk and a mix of three vodkas purchased at a Long Island estate sale, will blow your expectations out of the water! Because your expectations are very, very low.Hailed as the next Juul—big shoes to fill!—Hard Capri Sun might accidentally poison your teens, but they’ll dig the variety of tasty flavors and the way you can drink them in the back of class without the teacher noticing/caring. Start with Sloppy Strawberry Kiwi, make your way to Wasted Wild Cherry, and dabble in a limited-edition* Juul-branded crossover flavor: Turnt Tobacco Water.*This flavor has been pre-recalled by the FDA.Hard Prune Juice will make ya poop!Hard Slim Fast is doing the best it can.Hard Gatorade gives your body the electrolytes it needs after a long night of drinking plus the 130 proof grain alcohol you need to “roll through it.”Hard milk looks good, no?\nPhoto by laura Murray, styling by Allie WistHard Sprite. It was only a matter of time. After years of observing how consumers transformed it into a fun and flirty cocktail, that signature drinkaroo now comes in pre-mixed form! It’s thirty percent Sprite, thirty percent extra pulpy orange juice, thirty percent Boone’s Farm Blue Hawaiian, and 10 percent powdered aspirin. The bottle fits snugly in the cup holder of any standard-sized recliner.Hard Tomato Juice is Coach Jerry’s wakey-wakey juice.Meet Hard Water! (This is ice.)Hard Chai—chai spiked with Fireball—goes back to an ancient Ayurvedic remedy I just invented that promises to cure you of heartache, logical thinking, and sobriety all in one $8 compostable bottle.Hard Grape Juice is a combination of Carignan, Gamay, and Rioja grapes that have sat for months in a barn somewhere in France, getting weird. HGJ promises a light buzz and fuzzy hangover in a green bottle with a crazy cork stopper you have to buy a metal slinky to open. You’re gonna love it.Hard Pee is a kidney stone, better get that checked out.Hard Oat Milk is here to stand in for all of your hopes and dreams of being a healthier person, with a tiiiiny little shot of unfiltered sake, so cloudy and sweet you won’t even notice it’s there! Add it to your Hard Chai Latte before your kid’s next swim meet or chess tournament or whatever. We call this combo a wham-bam-thank-you-ma’am!Hard Fiji Water is that classic rainforest-and-celebrity-saliva-flavored water you love, amped up with a low-ABV fermented water harvested straight from the source. (The source = an old puddle on a volcano, might be hiker’s pee.) Obviously! It’s $37 for a two-pack.Hard Green Juice is a kale smoothie with a shot of Jack, only available at select Juice Presses the first five minutes after closing. For employees only.Hard Orangina is Not. A. Bad. Idea.Explore Bon AppétitAlcoholicTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-03-04", "author": ["Condé Nast", "Alex Beggs"]}