{"id": "c3bf1cc5885a98cf7bfa2bc20faf3ef3", "url": "https://www.bonappetit.com/story/make-your-own-cream-cheese", "year": 2020.0, "month": 9.0, "day": 2.0, "content": "How to Make Cream Cheese at Home | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingMaking Your Own Cream Cheese Is As Easy As Boil, Strain, WaitLearn to DIY and you'll never run out.By Amy RosenSeptember 14, 2020FacebookTwitterEmailPhoto by Emma Fishman, Food Styling by D'Mytrek BrownFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.The schmear on our bagels, the cheese in our cake, the secret ingredient in our hot dips, and the best part of carrot cake.I’m talking about cream cheese, of course.Simply put, there is no substitute for cream cheese, though of course you can try. Mascarpone comes close, but is often too rich for the intended purposes. Ricotta is too grainy, cottage cheese is too curdy, strained yogurt is too tart, and if you choose to mix kefir with chia seeds, that’s your own business.What I’m here to talk about is the joy of smooth, alabaster, luscious cream cheese. The white sneakers of the food world, it’s cozy, comfortable, and nostalgic, and no fridge should be without it. Yet as someone who eats half a toasted bagel with cream cheese each and every morning, sometimes I unexpectedly run out—and my day is ruined. On one such morning I thought to myself, “What if I never ran out?”So I set to work developing a recipe. It worked on the first try so I tried four more times with the same dreamy, creamy results. (I also started making my own bagels, but that’s a story for another day.) And, to my great delight, DIY cream cheese takes only five minutes to prepare.Here’s how to do it: In a large saucepan over medium heat, whisk together 1 cup heavy cream (35%), 1 cup milk (2%), 1¼ cups 2% plain yogurt, and ½ tsp. kosher salt.  Do not use ultra-pasteurized milk or cream, which will not curdle properly. Bring to a boil, stirring constantly and making sure it doesn’t boil over, for about 2 minutes. Add 3 Tbsp. white vinegar, bring to a rolling boil for 30 seconds, then lower heat to a simmer for 3 minutes more. Remove from heat and let mixture cool in the pot for an hour. The hard part is done!Next, line a fine-mesh strainer with a clean cotton tea towel (or four layers of cheesecloth) and place it over a medium bowl. Pour the mixture into the lined strainer and cover with plastic wrap or a reusable silicone lid (don’t use a plate or something heavy or it will push out too much liquid). Place in the fridge to drain overnight.Good morning! Discard the liquid from the bowl and spoon your gorgeous, tangy cream cheese off of the tea towel and into an airtight container, stirring until smooth. You’ll have about 1 cup, and it will keep in the fridge for up to two weeks.Feel like taking it to the next level? Make your own mixed herb cream cheese by stirring 2 Tbsp. chopped chives, 1 Tbsp. chopped parsley, 1 Tbsp. chopped basil, 1 tsp. lemon zest, and a pinch of sea salt and pepper into your drained fresh cream cheese. Or why not make your own veggie cream cheese? Stir in 4 small chopped green olives, 1 scallion, trimmed and thinly sliced, 2 Tbsp. finely chopped red pepper, 2 Tbsp. grated carrot, and a pinch of red pepper flakes. Finally, try everything bagel schmear on for size: Stir in 1 Tbsp. toasted sesame seeds, 1 Tbsp. dehydrated onion flakes, ½ Tbsp. poppy seeds, and ¼ tsp. garlic powder. Stir to combine and refrigerate for an hour to let the flavors meld before serving.Can you imagine how impressed your friends will be when they find out you made homemade cream cheese? “Shut the front door!” they'll say. “Get out of town,” they'll shout. But it’s true, and the proof is in schmear.Amy Rosen’s latest cookbook is Kosher Style, which features her recipes for bagels and cream cheese (along with 100 other modern Jewish recipes).Explore Bon AppétitIt's That SimpleRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-14", "author": ["Condé Nast", "Amy Rosen"]}