{"id": "c3c37347739def21cfd898690093701c", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/santa-monica-farmers-market", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Santa Monica Farmers Market Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesSanta Monica Farmers MarketThe farmers market that will ruin you for all other farmers marketsFacebookPinterestTwitterEmailRen FullerGO: for the most pristine fruits and vegetables you’ll probably ever have at this breezy outdoor market in Santa Monica. Take our money already!BUY: plump greengage plums from Andy’s Orchard, avocados and all the citrus from J.J. Lone Daughter Ranch, verdant shiso and rau ram from Coleman Family Farm, tart Red Flame grapes from Murray Farm, strawberries of all kinds from Harry’s Berries, and fragrant melons in the summer and sturdy root vegetables in the fall from Weiser Family Farms. Get an early start if you can—all the chefs are there right at 8/8:30 a.m. when the market opens—for the prime picks.THE VIBE IS: only a little intense; this is every chef’s favorite farmers market after all. A horn will go off right when the market is open, so you can start shopping right away along with other chefs, Santa Monica parents with their sleepy kids, and very hungry tourists (make sure you bring some coffee).PRACTICAL STUFF: Check the website for specific operating days and hours of the market, plus parking advice (so California!).—Elyse InamineRen FullerRen FullerWE ALSO LOVEBotanicaSpend the whole day in Silver Lake at this breezy, vegetable-laden all-day spotTortoise General StoreVenice Beach's answer to cool Japanese designCassiaA little spice makes bistro food nice at this Santa Monica showstopperExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}