{"id": "c3d77d3249be25a9dade9d4bd72bbc06", "url": "https://www.bonappetit.com/story/gym-workout-defense", "year": 2018.0, "month": 5.0, "day": 2.0, "content": "Gym Workouts Forever: When Did It Stop Being Cool to Go to the Gym? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen Did It Stop Being Cool to Go to the Gym?A defense of the humble treadmillBy Kyle BeecheyMay 11, 2018FacebookTwitterEmailIllustrations by Laura CallaghanFacebookTwitterEmailMillennials — a group to which I belong — are obsessed with health and fitness. Staying in is the new going out. Instead of talking about our wild nights on the town, we’re raving about our ah-ma-zing Outdoor Voices leggings and the new hip-hop yoga we’re squeezing in after work. We’re also spending more on it than any generation before, with an average lifetime wellness budget of $112,000—42% of it devoted to trendy boutique fitness class. But whatever happened to just a normal gym workout? You know, the gym you joined months ago as a New Year’s resolution? Is the gym broke and in need of fixing?Instead of paying a second rent on mindlessly refreshing a webpage at noon on Monday to book a coveted spot at the new Hot Pilates obsession, I’m here to advocate for the gym workout. Crunch, Blink, Planet Fitness, your friendly neighborhood Sports Club. You can come and go when you please, hop on or off a machine exactly when you feel like it, and if you’re lucky, wind down in the sauna afterward. I’ve been a member of one since infancy, starting with Mommy & Me swims at the YMCA. I’m not immune to the trappings of the luxe fitness class; they had me at the fancy products in the locker room and mints on the check-in counter. But, for me, they’re a once-a-week treat to supplement the gym or jogging outside.I’m pretty religious about my routine. At least three times a week, you’ll find me in my old Raptors t-shirt pushing it on the treadmill for 45 to 60 minutes, followed by what I like to call a Planking It Out session, in which I’m going as hard as I would be in a spin class. I have to balance my sedentary freelance writing life and my passion for dessert, so the key for me is to move every day.  I started to wonder if any of my friends were secret gym junkies, too, so I asked around. Although their cool girl personas might suggest they’d be ModelFit aficionados, I was surprised to find that some of them had ditched group classes in favor of plain-old exercise at the gym.With her hectic schedule, Gina Esposito barely has time to fit in a workout let alone schedule her day around a class. The designer and founder of the swimwear brand Nu Swim says her ideal routine is a combination of cardio and weight machines, with a swim at the gym’s pool squeezed in if time allows. “If it's a warm day, I'll swim and lie down on the roof for a while to get some Vitamin D. Then the best part comes—a long shower and a decent amount of time in the sauna. The rest of the day, I feel super calm and organized.”After being a long time Equinox and hot yoga devotee, Dana Boulos recently nixed her memberships in favor of working out right in her apartment building’s gym. She prefers the convenience and affordability.  “I’m at the gym for an hour four times a week. I'm all for the treadmill, stair climber, and the elliptical machine!” As a director, photographer, and DJ, she loves the freedom to fit exercise in when she can—it is her time, she’s the boss.Christie Hayden, the founder of the art bookstore Oof Books, told me that she goes hiking when she can, because “anything as structured as a membership to a gym seems pretty far from my paradigm. If anything, the city is my gym; I'm constantly running to catch the crosswalk, or taking boxes of books and large art pieces to their new homes.”Summer is very much around the corner, which leaves January’s resolutions in the distant past. Remember that gym membership you vowed to use three times a week? Get back in there! Sure, it has less sex appeal, might be a little harder to get in the door alone, but it's just as effective. Plus, if you give up your thrice-weekly SoulCycle addiction for a month, that transatlantic airfare you’ve been eyeing to a delicious European capital can be yours. Who needs branded gear and scented candles? Just give me an old t-shirt, worn-in sneakers, and a treadmill. Now excuse me while I lace up my battered Nikes and hit the elliptical for exactly 48 minutes to my favorite Tom Petty playlist. Maybe I’ll even squeeze in a steam after.Explore Bon AppétitHealthyishTrendsRead MorecultureMeet the Equinox Trainer Who Made Us Love the GymBy Sue Li and Alex PollackRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-11", "author": ["Condé Nast", "Kyle Beechey", "Alex Pollack"]}