{"id": "c3e0edd7e24eaa6dbb37db969b93366b", "url": "https://www.bonappetit.com/story/do-this-one-thing-avoid-cake-disaster", "year": 2020.0, "month": 2.0, "day": 3.0, "content": "Bake Your Cake on a Sheet Pan to Avoid Overflowing Cake  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThe One Thing I Do Every Time I Bake Cake to Avoid DisasterLearn it once, remember it forever. By Sarah JampelFebruary 18, 2020FacebookTwitterEmailPhoto by Laura Murray, Food Styling by Susan SpungenFacebookTwitterEmailThis article is part of the Basically Guide to Better Baking, a 10-week, 10-recipe series designed to help you become a cooler, smarter, more confident baker.The worst thing about a cake that overflows as it bakes is how it continues to haunt you.The batter bubbles over the sides, cascades to the bottom of the oven, blazes into ash, and shames you. It smokes and it smells and anyone who comes into your kitchen is practically obligated to ask if you’re aware that something is, ahem, on fire. If you’re unlucky (and, like me, hesitant-slash-unwilling to clean the dinky oven in your rental apartment), it festers: You’ll wonder what’s burning the next few times you turn on the oven to roast vegetables or salmon. You’ll fear for your health and the health of your cats.But while the problem is pesky, the solution is almost unspeakably easy: Bake cake on a sheet pan. The rimmed pan will catch the drips before they waterfall into the bowels of your oven, meaning they’re less likely to smolder and stink. If they are burning to the point of bothering you, take the sheet pan out, scrape the bubbled-over bits into the sink, and continue on your merry way. I usually line the pan with old parchment paper that I’m trying to reuse or a Silicone baking mat to make clean-up even lazier. In the end, there’s no mess on the bottom of your oven and if you tell no one, you might forget it overflowed in the first place.I bake all of my cakes on sheet trays, especially loaves, Bundts, and anything made in a springform pan (the seal between the belt and the bottom is often not so secure) or a tart pan with a removable bottom. Just last weekend, the tart I was baking leaked butter everywhere. And I’ve learned the hard way that pies, especially fruit pies that have the propensity to burble and spat, need a sheet tray to catch what cannot otherwise be contained. Baking on a sheet tray also feels safer: I’m way more likely to get a good grip on a rimmed tray with oven mitts or a kitchen towel than I am a hot pie dish or a very full loaf pan.Of course, there are other ways to prevent overflowing cake. Use the size pan called for in the recipe and hold back a bit of batter (start with ½ cup) if you’re reaching the tippy-top. But consider the sheet-tray-under-the-pan trick like insurance: Even if it’s not necessary, at least it’s nice to know it’s there.Try it now:Earl Grey Yogurt CakeA tea cake that's true to its name, this loaf harnesses the power of citrusy Earl Grey tea for its distinct flavor. Lemon poppyseed can't hold a candle. View RecipeExplore Bon AppétitBasically BakingCakeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-02-18", "author": ["Condé Nast", "Sarah Jampel"]}