{"id": "c3eb04a6fd84600f1cb8ad43bbb93257", "url": "https://www.bonappetit.com/city-guides/los-angeles/venue/felix", "year": 2018.0, "month": 10.0, "day": 1.0, "content": "Felix Review | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginlos angelesFelixPasta paradise in VeniceFacebookPinterestTwitterEmailCourtesy of FelixGO: for chef Evan Funke’s masterful pasta that you can (and will) eat three bowls of by yourself. Felix is that good.ORDER: all the gluten. You’re here for the noodles, so get the transcendent cacio e pepe, spiny busiate with pesto trapanese, simple but stellar orecchiette with sausage sugo and peperoncino, and fat rigatoni all’amatriciana. But don’t sleep on the focaccia—it’s pillowy, bready heaven.THE VIBE IS: “work hard, play hard” in restaurant form. Madonna and Wham blast through the speakers, keeping the nostalgic vibes going strong in the persistently crowded restaurant. Let the double dates have the tables; if you’re with just one other person, try to get a seat right in front of the well-lit beacon at the center of Felix: the pasta-making room, where you’ll see cooks sling out all the trofie, spaghetti, you name it by hand.PRACTICAL STUFF: Open every day: Sunday to Thursday, 5:30 p.m. to 10 p.m., and Friday to Saturday, 5:30 p.m. to 11 p.m. Reservations are incredibly tough to come by, but you can book up to four weeks in advance via Resy.—Elyse InamineCourtesy of FelixCourtesy of FelixWE ALSO LOVENight + MarketThai street food, Sunset Boulevard-styleJon & Vinny'sCome for the pizza and pasta (and celebrity sightings) at this reinvented red sauce joint in the heart of L.A.Dan Tana'sClassic red sauce + celebs: a match made in heavenExplore City GuidesAtlantaAustinBostonCharlestonChicagoCopenhagenLas VegasLondonLos AngelesMexico CityMiamiMontrealNew OrleansNew YorkParisPhiladelphiaPortlandSan FranciscoSeattleTokyoTorontoVancouverWashington, D.C.GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for Updates on the Bon AppétitCity GuidesSign UpWill be used in accordance with our user agreement and privacy policyBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2018-10-02", "author": ["Elyse Inamine"]}