{"id": "c3f04ed913c48f33238d9764c3817cfb", "url": "https://www.bonappetit.com/recipe/mango-and-avocado-salad", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Mango and Avocado Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2021 IssueMango and Avocado SaladBy Ayesha CurryNovember 23, 20214.4(20)Read ReviewsTriangleEmailPinterestPrintPhotograph by Eva Kolenko. Food styling by Susie Theodorou. Set design by Kira Corbin. On set producer: Jennifer ThomasEmailPinterestPrintEmailPinterestPrintA true West Indian–style meal requires something to cool off the palate, according to actor and cookbook author Ayesha Curry. This salad, with its balance of creamy avocado and sweet ripe mango, accomplishes just that. Blood oranges add gorgeous color, but you can substitute Cara Cara or Valencia oranges.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronCitrus Juicer$7 At AmazonParing Knife$10 At AmazonWhisk$10 At AmazonIngredients6 Servings⅓cup extra-virgin olive oil⅓cup fresh blood orange juice¼cup fresh lime juice1Tbsp. honey1Tbsp. Diamond Crystal or 1¾ tsp. Morton kosher salt½tsp. freshly ground black pepper1shallot, finely chopped2Tbsp. finely chopped cilantro4blood oranges, peel and white pith removed, flesh sliced into irregular pieces2mangoes, peeled, sliced2avocados, peeled, sliced1cup halved cherry tomatoesPreparationStep 1Whisk oil, blood orange juice, lime juice, honey, salt, and pepper in a small bowl to combine; mix in shallot and cilantro.Step 2Arrange blood oranges, mangoes, avocados, and cherry tomatoes on a platter. Drizzle dressing over.How would you rate Mango and Avocado Salad?Leave a ReviewTell us what you thinkReviews (4)Back to TopTrianglePerfect salad for summer, which in Australia is now. AnonymousPhillip Island Australia 1/25/2022Not a new recipe… I have been making this for years but it is very yummy!  My question is why feature out of season fruit?  June and July is big mango time with delicious and out of this world tart/sweet.  They are expensive in Dec and not so great. Like a winter tomato.  AnonymousMaine12/13/2021My first salad and my Wife liked it.AnonymousIluka NSW12/13/2021So refreshing and delicious! Seek out ripe fruit. The dressing brings all the flavors together.AnonymousSeattle 12/13/2021Explore Bon AppétitMangoStone FruitFruitAvocadoVegetableSaladSideDinnerLunchVegetarianRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-23", "author": ["Condé Nast", "Ayesha Curry"]}