{"id": "c3f6f3be2e5f7cdac6062f052659ebbd", "url": "https://www.bonappetit.com/story/direct-to-consumer-kitchenware-companies", "year": 2018.0, "month": 3.0, "day": 5.0, "content": "New Direct-to-Consumer Kitchenware Companies Are Popping Up Everywhere | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLike Casper, But for KnivesCheap kitchenware companies are popping up everywhere. But does the quality live up to the hype?By Dayna EvansMarch 29, 2018FacebookTwitterEmailPhoto by Chelsie CraigFacebookTwitterEmailAs is the modern way, Chip Malt ordered basically his entire house online. “When we moved from Boston to Austin in January, I ordered everything in the car on the drive.” A mattress, a bed, a sofa, sheets. Blammo: Like magic, the stuff was there when he got to Texas, and all Malt had to do was unpack it. No schlepping to a store and weighing options, no deciding between a couch that was too expensive or too shabby, no interacting with humans.Malt is one of the cofounders of Made In Cookware, a company that launched in 2017 to sell pots and pans online to people with shopping priorities just like his. He and his cofounder, Jake Kalick, are part of a new group of start-up founders who want to make cookware—pots, pans, knives, and whatever else you cook with or keep in your kitchen—the next Casper mattress or the new Everlane silk top. Like the direct-to-consumer (DTC) disruptor (dir-con-ruptors?) success stories that came before it, Made In markets its capital-V Values and wants you to invest not only in its products—which it says give you the quality of All-Clad at half the cost—but in its capital-S Story, as well.If you’re not familiar with the term direct-to-consumer, you almost certainly are with the staples that made it such a thing: Do Warby Parker, Everlane, Glossier, Outdoor Voices, or Casper ring any bells? One of the most successful in the group, Warby Parker, wanted to revolutionize the prohibitively pricey eyeglass market when it launched in 2010 by offering prescription eyeglasses at a quarter of their typical price (say, a hundred bucks compared with 400). They were able to do this by cutting out the retailer (where extravagant markups typically happen), making glasses in-house, and interacting with their customers directly online. The brand—yet to go public—is now valued at $1.75 billion and, somewhat ironically, has 73 brick-and-mortar locations across North America.Every industry has seen at least one direct-to-consumer brand-success story—Mattresses! Furniture! T-shirts! Nutritional drinks! Contact lenses! Vitamins! Bicycles!—and if it hasn’t, it’s definitely about to. Kitchenware, a legacy industry made up of long-existing established brands that are sold at only a handful of established retail stores, was pretty much destined to be the next.Field Company’s cast-iron skillets range from $100-$135.\nPhoto by Chelsie Craig“You could say that food has replaced music as the main cultural touchstone in the modern era.” This is Chris Muscarella, cofounder of Field Company, a DTC brand that for now sells cast-iron skillets and cast-iron skillets only. “What is the center of the home these days? The kitchen. People want to have good tools and know how to use them well and have that signal something about themselves.”Muscarella and his brother, Stephen, launched a Kickstarter for their line of cast-iron skillets in 2016 and subsequently raised $1.63 million. Kickstarter has played a big role in the success stories of some of these direct-to-consumer kitchenware companies, such as Misen (knives) and GIR (silicone spatulas BA happens to be obsessed with).Within the wave of new kitchenware brands that say they deliver better quality for more affordable prices, the Muscarellas’ Field Company is something of an outlier. Most people who own a cast-iron skillet likely bought one for $15 or $20, Lodge being the most well-known brand. And unlike the range of kitchen tools you might have in your arsenal, cast-iron pans actually get better with age and almost never need to be replaced. So why on earth would anyone spend $135 bucks for a new one?“I think people like buying and supporting things that make them feel like a more aspirational version of themselves,” Chris Muscarella, who has no traditional background in iron casting, explained. Field Company spent years tinkering and calculating to improve upon a tool that has been around for three or four times as long as its creators have been alive. The Field Company pan is lighter, it lacks a pour spout (which the Muscarella brothers say is an unwieldy and unnecessary addition), and it has a smoother cooking surface.“Our company is committed to an idea of having fewer things and having those things be of extraordinary quality,” said Chris, “We are aggressively anticommercial as a business as a result of that. I believe we can have that value system and do very well.” Most of Field Company’s sales have been through word of mouth, he said.These value systems—and the ability to tell a story—are inherent to many of these new cookware brands. Featured prominently on each brand’s site are nods to the companies’ origin stories, their commitments to transparency, and how they are able to keep their prices so relatively low. Because many of the newer DTC brands haven’t gone the brick-and-mortar route yet, there are often in-depth and precisely designed diagrams that show potential customers what they’re buying. On both Field Company and Made In’s sites, they help you understand the weight of their products by comparing them to the weight of a MacBook.If part of the stress in purchasing a new chef’s knife is in not knowing what is the right product for the right price for the kind of cooking you do, some of these start-ups are hoping to demystify the process and tell their customers exactly what they’re getting.“I was gifted an incredible pan and it changed the way I cooked. I thought I was a fairly good cook, and it helped to realize how much good tools could elevate the cooking experience,” Omar Rada, cofounder of Misen, a direct-to-consumer knife brand, told me by phone. Misen launched its Kickstarter in 2015 and raised more than $1 million. It is now expanding into skillets and cookware. “It’s crazy that these good tools have to cost so much.”Misen knives ($130 for a set of 3).\nPhoto by Caleb AdamsA Misen chef’s knife costs $65, compared with a Wüsthof, which can be in the $100–$150 range at Sur La Table. Misen claims to have spent 18 months developing a new chef’s knife that has a better handle, is made from Japanese steel, and comes with free lifetime sharpening, among other things. Serious Eats’ J. Kenji López-Alt called it “the holy grail of knives.”There are two main challenges in starting a cookware cut-the-middleman brand, Rada said. “[Cookware] is often purchased at defined milestones: when you move, when you get married, when something breaks. And the purchases are nonrecurring: You buy a knife, so you don’t buy another one.” But when that knife is cheaper and you can talk directly to customer service people over email, and let’s not forget that you never even have to leave your house, those factors are starting to seem irrelevant. “You can buy those things right now. You don't have to wait for a milestone.” For Field Company, given the hardiness and the already set expectations for the product it sells, it relies on your thirst for Good Quality Stuff instead. “This is a product that’s literally going to outlive you, your children, and your grandchildren,” Muscarella said.Knives from Material’s Fundamentals kit ($175).\nPhoto by Chelsie CraigSo what are the downsides to buying from these brands, many of them having not been around for more than a few years? In some cases, that more affordable price doesn’t actually translate to better quality. Joe Ray, a writer at WIRED, has reviewed a handful of the direct-to-consumer tools, obsessively comparing them with T-fal, All-Clad, Wüsthof, and several other of the most established kitchenware brands. His findings—employing scientific testing techniques and involving experts—are rarely unanimously positive: he gave a rating of 5/10 to Made In pans and a 3/10 to Misen knives. My experience with both was generally more optimistic—I came away from using Made In pots and Misen’s knives thinking that they were more than reasonably priced. They do their job well, and unlike some of the bigger-investment kitchenware purchases, they were approachable and unfussy. (With my Field Company skillet, a true review might have to wait a couple of years…)But on the flip side, these products can come with the baggage of oversimplification and a vaguely patronizing tone in their marketing, which can be off-putting if you have even a cursory knowledge of cooking. Made In’s pots come with paper hang tags that say “Plant me!”—they’re biodegradable and embedded with basil seeds. The pots also have recipes etched on the bottom, which is a confusing design choice: If you were really going to follow these recipes, concise as they are, how would you do so if your pot was boiling on the stove?“Our direct marketing efforts are to educate and appeal to millennial buying power,” Malt explained, “but the story is resonating with a wider audience.”A selection of tools from Material’s Fundamentals.\nPhoto by Chelsie CraigThere is also something of a post-college, first-apartment essence to the sets these brands sell, which, for a more intermediate cook, feels a little silly. Material, a cookware brand that sells a set of “fundamental” kitchen tools for $175 (tongs, spatula, wooden spoon, metal spoon, chef’s knife, and paring knife), just launched a few weeks ago. “We love the idea that there are a lot of people out there who generally want to start cooking,” Eunice Byun, Material’s cofounder, told me. While having a brand explain, or bundle, its products for you online certainly feels easier than stumbling into a Williams Sonoma and assembling an arsenal piecemeal, direct-to-consumer companies in the cookware category present the inverse problem of almost too much hand-holding. Not to mention that so many of these companies are new enough that it remains to be seen if their products will actually stand the test of time as they all obsessively claim they will.A full-silicone GIR spatula.\nPhoto by Alex LauAt least one brand has some insight into the sustainability in direct-to-consumer kitchen goods. GIR (an acronym that stands for Get It Right) was one of the earlier Kickstarter cookware launches, when Samantha Rose raised almost 50 grand in 2012 for her full-silicone spatula. “I didn’t have a strong background in any of the skills that were needed to pull this off,” Rose told me. “I self-educated really aggressively.” Full-silicone spatulas feel like a no-brainer invention: Rose just did it first. GIR sells spatulas that don’t melt and don’t have wooden handles that can warp or burn. Of all the direct-to-consumer kitchen products you can now buy (with more certainly on the way), GIR spatulas are far and above my favorite. Since 2012, GIR has launched dozens of other things, many of which are now sold at the retailers that brands like GIR threatened to unseat, but at the same price point as what they sell for online. “The bar has been democratized,” Rose said.And really, like Allbirds and Nike or Glossier and Maybelline, isn’t it possible that the two options—depending on what kind of shopper you are—will continue to exist in tandem?“At the end of the day, there has always been this retail machine. Brands sell to buyers; buyers decide what ends up in stores,” Byun, who was formerly the vice president of digital marketing at Revlon, said. “You’re finally seeing brands that are more in tune with the things that you want. They’re listening to you.”Or you could just, like, make a knife:Explore Bon AppétitShoppingToolsTrends + NewsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-03-29", "author": ["Condé Nast", "Dayna Evans"]}