{"id": "c3fae8b73682951d228269ecf5f9926d", "url": "https://www.bonappetit.com/story/alex-beggs-chicken-mole-enchiladas", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Ghosts at the Table | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureGhosts at the TableThey say there are two things in life you can rely on—death and enchiladas.By Alex BeggsOctober 19, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Micah MortonFacebookTwitterEmailThis is All on the Table, a column featuring writers we love sharing stories of food, conflict, and community.Around a hundred years ago, my grandparents’ house in Galveston Island, Texas, was moved from the interior of the island to the beachside. The island had been wiped out by the historic 1900 storm, a hurricane that killed thousands and flattened the landscape. One of my mom’s favorite bedtime stories was telling us about the nuns at an orphanage who tied the kids together to keep track of them in the storm—only to have them drown because of it. Every time she told the story the number of orphans grew. So this is the place, and the people, I come from.We’ve scattered the ashes of so many family members in the Gulf that now I can’t swim in those brown salty waters without thinking, Mom? You out here? And a hermit crab will bite my toe, saying, Naw, lady, she was crawfish food a decade ago. There are other things in this water to fear.In the decades after the Great Storm, the island rebuilt and a two-story restaurant called The Original Mexican Café opened. The Original has blue-green siding and a white sign anchored with two Coca-Cola logos. Another sign points to the door and reads, “The owner eats here!” (which is true). It’s one of the two oldest restaurants on the island; a temple of Tex-Mex.At the Original you always order the chicken mole enchiladas. Mole can get too chocolaty if the cook is heavy-handed, but here it’s in perfect balance with smoky ancho chiles, served with a side of brothy charro beans and red-stained rice. Hurricanes have come and gone since—so have those we loved and thought we couldn’t live without—but that recipe stays the same and somehow we go on living. For my family the Original’s enchiladas are a dish we return to in times of celebration or gathering, like that Thanksgiving green bean casserole recipe you’ll never tweak a teaspoon of. It allows time to stand still for once. We’re the ones changing.Gale-force grief fools you into thinking no one else has ever felt this way. You are the island, somehow existing below sea level. We ate at the Original after seasoning the beach with my mom, and even on that weird day I was relieved to be there. If you’ve never had chili con queso at a funeral, I can’t recommend it enough. Baskets of warm tortilla chips were staggered along tables filled with family flattened by this other kind of hurricane. “I just can’t believe it,” said my grandpa. “I keep expecting her to walk through the door.” Instead, a server appeared with more chips.Gale-force grief fools you into thinking no one else has ever felt this way. You are the island, somehow existing below sea level. Writing about it is overwrought (oof, these hurricane metaphors) and the takeaways are always the same: Live life to the fullest; go on a lot of vacations; get the motorcycle license. That’s all great but kinda expensive, so I prefer to revel in the smallest, most boring moments. I love a good nap.When I wake up I’m excited and grateful to be conveniently alive. And with standards for amusement that low, everything else in my day seems even more amazing. Which is how I cope with knowing that it could all come crashing down at any moment. Last December I was thrilled to be buying a four-pack of a strawberry-banana spiked smoothie seltzer called Smooj for a Christmas Eve cocktail when I got the text that my grandpa had been hospitalized with COVID-19. If you want to be reminded of how short, sweet, and stupid life is, have a Smooj. (It’s delicious.)What happens when you’re 91 and have COVID is you die. I wanted my grandpa to pass in his red flannel pajama pants and recliner watching Masterpiece Theater, but death doesn’t show up at your doorstep with a laminated menu. At the time, all the politicians and television preachers were saying stuff like, “There’s going to be an empty seat at the [insert holiday here] table this year,” which drove me nuts. As if I need to be reminded by a shell-haired pundit that I’m missing someone so badly I have recurring dreams about losing my limbs. I get how metaphors work.When you’re grieving, certain times of year that used to be all joy and presents and enchiladas get spiked with sadness. For me, the entire month of July, the holidays, the birthday anniversaries now meaningless and the death anniversaries now meaningful. All this sadness can threaten to take away from your having a good time. My advice: Don’t let it.On Thanksgiving I make sure to do whatever the hell I want. Are enough people doing this? Duck legs in place of turkey, hazelnut flan instead of pumpkin pie, staying home instead of nightmare traveling. I got The Original’s recipe (from the owner himself, thanks Nicky!), so mole enchiladas are sounding good. I hope the ghosts at the table don’t mind, but there’s going to be a shrimp cocktail course.When I visited my grandma after Grandpa died, she was outside her apartment door with a rosary in one hand and a handful of peanuts in the other, luring a neighborhood squirrel over and apparently praying for its soul. This lady. She got to say goodbye to Grandpa in the hospital as long as her 90-pound COVID-resistant frame was covered head to toe in PPE. He’d been able to say, “I’m fine.” She told me it meant he was fine with dying. Then she added, “You know, he always loved sleeping,” and I cracked up, crying and laughing.Make the recipe:Chicken Mole EnchiladasThis streamlined approach to making mole cuts down on ingredients without sacrificing flavor for a rich, velvety sauce that’s layered under crispy-gooey cheese.View RecipeExplore Bon AppétitEnchiladasMoleTex-MexRead MorecultureTwo Strangers With a Stunningly Intimate Connection Walk Into a Restaurant...By Dani ShapirocultureI Thought Beef Stroganoff Was For Fancy People, Until I Made It My OwnBy Beth NguyenRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Alex Beggs"]}