{"id": "c3fba6aa2f9bf18d2af0cb3cb912d313", "url": "https://www.bonappetit.com/story/zoe-saldana", "year": 2018.0, "month": 7.0, "day": 1.0, "content": "Zoe Saldana Loves Homemade Almond Milk, Coconut Yogurt, and Gluten-Free Avocado Bread | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleZoe Saldana Loves Homemade Almond Milk, Coconut Yogurt, and Gluten-Free Avocado BreadThe ’Guardians of the Galaxy’ star uses her kitchen like a science lab.By Alyse WhitneyJuly 2, 2018FacebookTwitterEmailFacebookTwitterEmailIf you walked into Zoe Saldana’s home late at night, you’d probably find her standing by her breadmaker covered in gluten-free flour. The Guardians of the Galaxy star and her husband, Marco Perego, capitalize on time when their three kids are sleeping to conduct “fun experiments” with alternative grains, including quinoa, almond, and rice flour, and starches like potato and tapioca. “My mission is to make a fluffy, delicious gluten-free bread. I take great pleasure in doing that,” the actress said at the launch of the American Express Cash Magnet Card, citing \"very dense\" rice flour as her least favorite and tapioca starch as her favorite binder.All of this late-night bread tinkering has taught her a few tricks, like adding half an avocado to soften up the bread or sprinkling in caramelized onions when she’s leaning toward a more savory loaf. Bread is one of her greatest joys, but to manage her Hashimoto's thyroiditis, an autoimmune disease that affects her thyroid, she sticks to a gluten-free and mostly dairy-free diet, and her whole family is about 80 percent plant-based. So rather than a slathering of butter on warm bread, she’ll drizzle on organic honey or make a tapenade of sun-dried tomatoes, olives, olive oil, and balsamic vinegar.Zoe Saldana bakes loaves like this super-seedy, gluten-free bread.\nAlex LauBreadmaking isn’t Saldana’s only adventure in cooking. “Whenever I have the chance, I make my own almond milk. I started making it because I was sick of what was in stores,” she explained. “Making my own gives me the ability to add any probiotics or flavoring like vanilla beans. It has a very short shelf life, so you have to drink it within two days, but it’s super nutritious.”And those probiotics? They’re often home-grown too, thanks to coconut yogurt. Her process is relatively simple: “I crack open a coconut, blend up the meat in the food processor to whatever texture I want, or none, add probiotics, and leave it out for 24–36 hours. I ferment it for as long as I want to according to how strong I want the taste to be, then I refrigerate it. I like it tangy, but not too tangy, usually with a little organic honey, vanilla, or cinnamon. I make it so rich in probiotics that I just have one spoonful a day and it sets me up for the rest of the day. I’ll add the coconut water to make sippable kefir too.”Saldana lives a pretty healthy lifestyle, but she doesn’t limit herself too much. “I don’t believe in a no-carb lifestyle, clearly,” she says with a laugh. “I balance out all my food groups and know they’re gonna give me all the energy that I need. And I‘ll always make room for fresh-baked bread with honey.”Explore Bon AppétitCelebritiesHealthyishGluten FreeRead MoreLifestyleThis Gluten-Free Carrot Cake Made BA Staffers Pretty Much Lose Our MindsBy Amanda ShapirocookingWhy Some Gluten-Sensitive People Can Still Eat Sourdough BreadBy Keri Wigintonrecipes59 Gluten-Free Desserts That Won't Give You Flour FOMOGallery59 SlidesBy Bon Appétitcooking77 Gluten-Free Recipes You Definitely Want to CookGallery77 SlidesBy The Healthyish TeamRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-07-02", "author": ["Condé Nast", "Alyse Whitney"]}