{"id": "c40621d7be89e1be84055a08debb182f", "url": "https://www.bonappetit.com/recipe/chicory-caesar-salad", "year": 2019.0, "month": 11.0, "day": 3.0, "content": "Chicory Caesar Salad Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesDecember 2019 IssueChicory Caesar SaladNovember 19, 20195.0(4)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeEmailPinterestPrintEmailPinterestPrintThis bright, zippy chicory salad gets dressed with a punchy anchovy-lemon vinaigrette and adds a serious pop of color to your table. Use as many different varieties of chicories as you can find. This recipe is from Montreal’s cozy-cool coffee-pizza-wine restaurant Elena.Ingredients8 servings2oil-packed anchovy fillets1garlic clove, finely chopped½cup coarsely chopped parsley¼cup extra-virgin olive oil⅓cup fresh lemon juice½tsp. kosher salt2lb. mixed chicories (such as endive, frisée, escarole, and/or radicchio), torn into large pieces1oz. Pecorino RomanoFreshly ground black pepperPreparationStep 1Mash anchovies and garlic on a cutting board with the side of a chef’s knife until you’ve created a paste. Transfer paste to a large bowl and add parsley, oil, lemon juice, and salt and mix well to combine. Add chicories to bowl with dressing and toss to coat.Step 2Transfer salad to a platter and shave Pecorino over. Season with pepper.How would you rate Chicory Caesar Salad?Leave a ReviewTell us what you thinkReviews (1)Back to TopTriangleWow! This salad dressing is absolutely epic. I made a few adjustments to the recipe as I meal prep for one. 1) I doubled the dressing recipe and stirred the grated cheese right into it. I was able to refrigerate the dressing and use as needed. 2) I swapped chicories for hearts of romaine, which I cut in half lengthwise and seared cut-side-down in a hot dry pan. 3) I then spread the dressing over the charred lettuce and topped with sautéed prawns. I ate the whole meal with a fork and steak knife five days in a row and didn't get sick of it once... So tasty!!!hannahawilsonCalgary, Alberta1/15/2020Explore Bon AppétitSaladEndiveChicoryLeafy GreensVegetableEscaroleFriséeRadicchioWinterEasySideGluten-FreeNut-FreeHealthyishDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-19", "author": ["Condé Nast"]}