{"id": "c4156fca5da87b218529c13988a3ed31", "url": "https://www.bonappetit.com/recipe/rye-shortbread-cookies", "year": 2018.0, "month": 12.0, "day": 3.0, "content": "Rye Shortbread Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRye Shortbread CookiesBy Briana HoltDecember 21, 20184.8(7)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie Craig, Food Styling by Kate BuckensEmailPinterestPrintEmailPinterestPrintThese cookies are delicious eaten the day of, but we were surprised at how complex they tasted after sitting overnight. The flavor deepens and the texture improves with time. This recipe is from Briana Holt of Tandem Coffee and Bakery in Portland, ME.IngredientsMakes 241cup (2 sticks) unsalted butter, room temperature¾cup granulated sugar½tsp. finely grated orange zest½tsp. kosher salt1large egg2cups rye flour (dark rye if possible)¼cup black or white sesame seeds¼cup demerara sugar½tsp. flaky sea saltPreparationStep 1Using an electric mixer on medium high-speed (or a stand mixer fitted with the paddle attachment), beat butter in a large bowl until smooth, about 1 minute. Add granulated sugar, orange zest, and kosher salt and beat again just to combine.Step 2Reduce mixer speed to medium-low, add egg, and beat, scraping down sides of bowl, just until combined.Step 3Reduce mixer speed to low and, working in 2 batches, beat in flour, scraping down bowl in between additions, until just combined and no dry spots remain (do not overmix).Step 4Dampen a work surface with a bit of water and place a large sheet of plastic wrap on top (the water will help the plastic adhere smoothly to the counter).Step 5Place half of dough in the center of plastic wrap, then fold plastic over to cover dough and protect your hands from getting all sticky. Using your hands, form dough into a log shape (rolling it on the counter will help), until log is about 2\" in diameter and 5\" long. Repeat with remaining dough. Chill logs until firm, about 2 hours.Step 6Place racks on upper and lower thirds of oven; preheat to 350°. Line 2 rimmed baking sheets with parchment paper. Mix sesame seeds, demerara sugar, and sea salt on a small rimmed baking sheet or plate. Unwap dough and roll in sesame seed mixture until coated.Step 7Slice dough into ¼\"-thick rounds. Arrange on prepared baking sheets, spacing about 1\" apart. Bake cookies, rotating baking sheets front to back and top to bottom halfway through, until golden brown and firm, 25–30 minutes. Transfer cookies to a wire rack; let cool.Step 8Do Ahead: Cookies can be made 2 days ahead. Store in an airtight container at room temperature.Photo by Chelsie Craig, Food Styling by Kate BuckensHow would you rate Rye Shortbread Cookies?Leave a ReviewTell us what you thinkReviews (4)Back to TopTriangleThese cookies are amazing! The orange zest is divine and the sesame sugar coating adds such an interesting flavor to these cookies. A few tips that I thought made things easier as a novice baker is to use parchment paper and a dough scrapper to roll the dough into logs. It was so much easier than using the flimsy plastic wrap! You just fold it over the batter, hold the dough scrapper edged underneath the batter and pull the parchment to shape it into a log. These cookies are pretty easy, unique, and have a great flavor so I’ll definitely be making these again!Anonymous5/20/2021These cookies are amazing. I love the orange zest, and the complex flavor of the rye flour. The bottom third of my oven tends to burn things quickly, so I stuck to one sheet pan at a time in the middle rack of my oven. If you have an industrial grade oven you could probably do two sheets at a time. Know your oven! I tried the first batch at 25 minutes, and it was great. I tried the second batch at 15 minutes and I really preferred the melt in your mouth, slightly softer texture. I used the Bob's Red Mill Dark Rye Flour with great success. I have ordered the Maine Grains rye flour which is the same one that Tandem uses, and I can't wait to try it again with that flour. I will definitely be making this one again. Other notes: This makes about 2 dozen cookies, and trust me they'll go fast. Also, I made the dough logs two days ahead of time to let the flour fully hydrate and the flavor become more complex. I always chill any cookie dough at least one to two days because it gives me better results. Plus, when you go to make them, the hard work and cleanup is already done so you can just relax with a cup of coffee! I hope more people make this recipe because rye flour is awesome.lifeis_shortLos Angeles, CA5/3/2020* I forgot to mention the brand. It's King Arthur Organic Pumpernickel Flour.Anonymous6/11/2019Tip: be careful that you use a finely ground rye flour, not anything resembling rye meal. I mistakenly used Hodgson Mill whole grain rye flour, which is more line a fine meal. The dough did not absorb the butter very well, so the cookies spread out a lot in the oven and became too crispy. Next time I will try Organic Pumpernickel Flour as it is reportedly very fine.Anonymous6/11/2019Explore Bon AppétitCookieDessertRye FlourFlourSnackBakingChristmasRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-21", "author": ["Condé Nast", "Briana Holt"]}