{"id": "c4242394e987f6534eb0f14e52503c0c", "url": "https://www.bonappetit.com/story/book-club-barter-club", "year": 2020.0, "month": 5.0, "day": 5.0, "content": "There's No Better Time to… Turn a Book Club into a Bartering Club | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThere's No Better Time to… Turn a Book Club into a Bartering ClubInstead of exchanging thoughts, we're exchanging jam, candies, and homemade kimchi.By Patricia AzzeMay 29, 2020FacebookTwitterEmailEva KolenkoFacebookTwitterEmailWe're spending more time in our homes than ever before. In \"There's No Better Time To...\" we'll share the little projects we're finally getting around to. This week: Resume the barter economy.The first book club meeting I attended was six months ago. We read Circe by Madeline Miller and the coffee table overflowed with snacks fit for a god: homemade guava jam, figs, goat cheese, grapes, olives, natural wine, and Bacon Wrapped Jalapeño Popper Lays.I quickly learned that the Book Club wasn’t about literary analysis (even if we had formally named the group chat “Book Club NOT A Snack Club”). It’s an excuse to drink too much on a Wednesday night and talk about our exes. It’s the one special night a month where Danielle, a vegetarian, makes an exception and eats salami.On March 18th, when we were to get together to discuss My Sister The Serial Killer by Oyinkan Braithwaite, the cases of COVID-19 in Florida jumped from 216 to 328. With no prospect of an in-person meeting happening any time soon, we turned our focus to our true shared passions: Connell’s chain in Hulu’s Normal People (it was our December book) and food.Stephanie’s dad got a box of okra and she offered it up to the group. Monica passed it on to me along with homemade kimchi (used later in fried rice and on a pastrami baguette), pepper jelly, and vegan fennel ice cream. I gave her candies I brought back from Japan in October, a container of rice with scallops I made in my donabe, and a couple cookbooks, a not so-subtle-hint in case she was looking for some projects to make us both feel better.And because quarantine lined up nicely with Miami’s tropical harvest time, we traded produce. The long days stuck at home gave me (okay, my husband) time to dehydrate dozens of Lemon Drop Peppers from my garden . Danielle offered cuttings from her chaya tree, a spinach variety that’s poisonous if you don’t cook the leaves, dragonfruit, and her signature jam, made fresh from the guava in her yard. She inspired Rachel to offer up prickly pear pads she’d been propagating.Those who didn’t have a garden found other things to trade: a sourdough starter, furniture, erotic postcards. I sent Christy, a Montessori teacher, a link to free nutrition education from a charity I volunteer with called Common Threads. Somewhere along the line, the name of the chat was officially rebranded to “Share Club 🍞.”The logistics of sharing IRL were sussed out in advance. We coordinated hand-offs through a Google spreadsheet, wore masks and gloves, and dropped the goods outside, at which point we’d text.  Sometimes we’d say hello from six feet away, sometimes over a fence.On April 9th, the day we were supposed to maybe get around to discussing There, There by Tommy Orange, Miami banned socializing at ventanitas, Cuban coffee windows. The confirmed cases in Florida were up to 16,364 and the death toll in the state hit 354.Home alone instead of surrounded by friends, I double-dipped my finger in the guava jam—it was just as good as I remembered from our Circe spread. I’m choosing to look on the bright side and be grateful I didn’t have to share, but I did miss the in-person hangs. Some were in it for the books and some were in it for the wine. We all were in it for the company and we all wound up with a support system for a global pandemic. Sometimes we share goods, but every day we share when we’re feeling confused, frustrated, angry, sad, or alone.Patricia Azze is a freelance writer and social media strategist in Miami.Explore Bon AppétitThere's No Better Time CoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-29", "author": ["Condé Nast", "Patricia Azze"]}