{"id": "c42f1d9caa9d0fb93baff084c67c2f51", "url": "https://www.bonappetit.com/story/steelhead-trout", "year": 2018.0, "month": 8.0, "day": 3.0, "content": "Steelhead Trout Is Here For You When You're Sick of Salmon | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleWhen You're Sick of Salmon, Steelhead Trout Is Here For YouIt's the sustainable, home-cook-friendly seafood we’re seeing everywhere right now.By Priya KrishnaAugust 15, 2018FacebookTwitterEmailPhoto by Michael GraydonFacebookTwitterEmailYou’ve eaten it cured in sugar and spices at Compass Rose in D.C., blackened with Cajun spices at Tapalaya in Portland, O.R., and in the fish taco salad at your local Sweetgreen. It looks (and tastes) an awful lot like salmon, but it’s not. It’s steelhead trout, the sustainable, home-cook-friendly seafood we’re loving right now.Steelhead trout (also known as Oncorhynchus mykiss!!) is a silvery fish with a bright-orange flesh, native to Alaska and the West Coast. As salmon overfishing has become a serious environmental problem, many chefs are turning to steelhead trout, which has emerged as a similar but more sustainable (and usually more affordable) option. And according to the Monterey Bay Aquarium Seafood Watch, steelhead trout is one of the healthier types of seafood, with plenty of lean protein and omega-3 fatty acids. (Just make sure you are buying farm-raised steelhead trout, as wild steelhead is a threatened or endangered species, depending on where it’s from.)Chris Morgan, the co-executive chef of Compass Rose and chef at Maydan, one of Bon Appetit's Best New Restaurants in America, started cooking with steelhead trout partly to “open people’s eyes to other options, what with mass farming and issues with overproduction.” To his surprise, he found that steelhead was a lot more interesting to cook with than salmon. “It’s a mouthfeel thing,” he says. “It’s softer.”Other chefs agree. At the Cajun-Creole restaurant Tapalaya in Portland, OR., chef Anh Luu seasons a whole steelhead trout with Cajun spices and blackens it. “It's easier to cook with because it's not as fatty [as salmon], it cooks a little faster, and it doesn’t break apart,” she says. Michelle Estigoy, the chef of Cultura Comida y Bebida in Carmel By the Sea, prepares her popular steelhead trout dish by marinating the whole fish in avocado leaves, coriander, and chilies, roasting it on an oak board, then finishing it in a smoker. “The texture is meaty and flaky,” she says. “The good flaky. Not a fall-apart kind of thing.”Steelhead trout also works well in sushi, says Sterling Ridings, the executive chef of Guild in Austin, because it’s easier than salmon to slice due to the lower fat content. At Compass Rose, Morgan loves to cure steelhead trout with salt, brown sugar, fennel, coriander, and black pepper—the texture is super velvety, he says, and it takes less time to cure than salmon.Even Sweetgreen, the popular salad chain, added roasted steelhead trout to its core menu in 2015 as part of a sustainability initiative to introduce customers to new species of fish. “Steelhead trout is something with an approachable, familiar flavor and texture,” Sweetgreen co-founder Nic Jammet says. “A lot of customers were like, ‘I actually like this. I didn’t know trout was like this.’”For home cooks, Morgan says that steelhead trout is one of the most versatile types of fish out there. “You will see it cured, pickled, cooked with the skin on, smoked,” he says. “There are a million ways to do it.”After hours, Luu will often pan-sear a filet of steelhead trout with butter, garlic, lemon, and parsley. “It doesn’t take long to cook, it’s not so dense, and because it’s like salmon, it can be served a tiny bit medium.” (For this method, Ridlings suggests slightly scoring the skin with a knife to break the connective tissue, so when you drop the fish in the pan, it doesn’t seize up and develops that crispy skin.) Luu adds that steelhead trout can be easily substituted for salmon in most recipes.If you’re a whole-fish kind of person, Jon Lavelle, the executive chef of The Way Back in Denver, recommends dressing your steelhead with olive oil, citrus, and fennel, and sticking it in the oven at a low temperature until tender. The beauty of steelhead, he says, is that it won’t really dry out.BA senior food editor Chris Morocco says that the fish’s leanness lends itself well to slow-roasting to bring out the best texture. Try swapping it for salmon in this recipe for slow-roasted salmon with fennel, citrus, and chiles.The beauty of steelhead trout, aside from its health and sustainability benefits, is that it’s a fish made for crowd-pleasing: It’s milder and less fatty than salmon, it doesn’t have as much of that “fishy” flavor that some people shy away from, and it can be served hot or cold.Most importantly, says Ridlings, steelhead trout “is very forgiving” no matter what preparation you decide to go with: “It lends itself to myriad cooking techniques, and you don’t have to do much.” And aren’t those the best kinds of ingredients?Sub steelhead for salmon:Slow-Roasted Salmon with Fennel, Citrus, and ChilesDon’t bother trying to divide this fillet into tidy portions. Instead, use a spoon to break it into perfectly imperfect pieces.View RecipeExplore Bon AppétitTroutFishSeafoodSustainableHealthyishTrendsRead MoreLifestyleThe Best Way to Buy Sustainable Seafood? Support a Local FisheryBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-08-15", "author": ["Condé Nast", "Priya Krishna"]}