{"id": "c443738c2f2f4295ab50674418dc3ea6", "url": "https://www.bonappetit.com/story/korean-cooking-facebook-group", "year": 2020.0, "month": 5.0, "day": 2.0, "content": "This Korean Cooking Facebook Group Makes Me Feel Less Alone | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureThis Korean Cooking Facebook Group Makes Me Feel Less AloneIt's an online utopia of eager-to-learn kimchi lovers.By Eric KimMay 14, 2020FacebookTwitterEmailFacebookTwitterEmailIn March, as everyone in the world started baking their own bread and regrowing scallions from butts, I decided it might be a good idea to cook more Korean food. The cuisine of my parents’ country is inherently quarantine-friendly: fermented kimchis that last for months; soups, stews, and braises that only get better with time; all manner of banchans, or side dishes, that require just a fresh pot of white rice to complete a meal.I love these dishes, I just needed to know how to make them. I figured, if there were ever a time to slow down and learn my mother’s recipes, now would be it.I started by calling my mom more regularly, asking how much soy bean paste she puts in her doenjang jjigae, and which pan she uses for frying salted croaker. But as my knowledge base grew, I wanted more. After a little online searching, I landed on the Korean Cooking Facebook group: a private community of 185,000 members whose admittance is determined by one thing––interest in Korean food. What I found was a utopia of supportive, eager-to-learn kimchi lovers. Each post in the group is unlike the last: perfectly pleated dumplings followed by bowls of hot, spicy noodles; rolls of gimbap with a rainbow of fillings; savory-sweet grilled short ribs interspersed with memes of Korean moms making all kinds of kimchi, from napa cabbage and scallion to mango, apple, and pineapple; even the occasional garlic joke.Amidst personal stories tied to specific dishes, and requests for written-down recipes (of which there aren’t many, because this is home food) is a flood of emphatic comments: “Great job!” and “Looks amazing!” and “Yummy!” echo across posts. It is the Great British Bake-Off of social media.I made it a habit to check the page every morning with my cup of coffee, and almost immediately what had been a quest to learn how to make my mom’s famous soy sauce-marinated crabs––and pass endless hours cooking in a 200-square-foot apartment in New York City, miles from my parents––led me to something I didn’t realize I was looking for: comfort, fellowship, and a name for my nostalgia.Like many children of immigrants, I have a strong taste memory for my mother’s food, but not much practical memory of how to get there. I never took the time to learn how to cook her dishes when I lived back home in Atlanta—because why would I? For years mom was the chef, I was the diner.Now, as I’m sitting alone, reading Facebook comments, I realize there’s a reason it’s such a common trope in immigrant narratives—a cliché even—for children to call their mothers when cooking food from the motherland. It’s a simple way to feel connected to family again. By eating the food and learning to cook it we can lean into the rhythms of past generations. I recognize this homesickness in the comments from other Koreans in the group: “My grandma uses that pot, too.” And, “My dad also eats the croaker eyeball!” Or, “I miss my mom’s…” x, y, and z.I didn’t expect such a perfect kaleidoscope of dishes from my childhood or the reminder of a past I had slowly forgotten about over my 11 years away from home. I didn’t expect the group to bring me so much joy.As a writer working in food media—which has often been criticized for its lack of diversity, on mastheads but also in the food—there’s another important aspect of the Korean Cooking Facebook group for me: the power of seeing my parents’ cuisine, their ingredients, front and center. The fiery red pepper sauces and flecks of granite roasted seaweed snack; the likes and comments galore from other Korean cooking enthusiasts celebrating this immigrant culture. It’s like crying while watching Crazy Rich Asians in the theater—not because the film was particularly good, but because it was made at all, and celebrated. To finally see yourself on the screen, to have the picture match up with reality for a change––you can’t predict that kind of relief.I interact with Korean Cooking from the sidelines. I “heart” posts, throwing in an occasional “Nailed it!” and even once shared a picture of my own bowl of kimchi tuna noodles. But I am as invested as anyone. Scrolling through the posts every morning, I can feel my shoulders relax, my guard coming down as I step into this shared experience of sentimental longing, of homesickness, and of cooking through the quarantine with people who are also alone—and as in love with Korean food as I am.Explore Bon AppétitHealthyishessayKoreanRead MoreCoronavirusI Fell Into a Deep Cooking Rut—Here’s How I Got OutBy Kelsey McKinneyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-14", "author": ["Condé Nast", "Eric Kim"]}