{"id": "c4490cf010fd7da2026456263e13ad12", "url": "https://www.bonappetit.com/story/spoken-english-instagram", "year": 2019.0, "month": 3.0, "day": 2.0, "content": "We’re Obsessed With Spoken English D.C.'s Weird and Wonderful Instagram Account | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureWe’re Obsessed With This Restaurant’s Weird and Wonderful Instagram AccountThere’s nothing particularly appetizing about the images on Spoken English’s feed. Still, we can’t get enough of it.By Emily Schultz and Rachel KartenMarch 11, 2019FacebookTwitterEmailFacebookTwitterEmailWelcome to Food on the Internet! A column from Rachel Karten and Emily Schultz, BA’s social media team, dedicated to all the weird things we see while scrolling, double-tapping, and retweeting.Following a restaurant on Instagram in 2019 is nothing if not predictable. A post of a new dish on the menu? Check. Overhead shot of a popular brunch item? Check, check. Occasional pic of the staff smiling in the kitchen? Check, check, check. That’s why D.C. restaurant Spoken English’s account stopped us in our scrolling tracks.Click over to the tachinomiya-style restaurant’s profile and you might find Tom Hanks in his famous role as Forrest Gump sitting on that just-as-famous bench holding—no, not a box of chocolates—but chicken yakitori. Or maybe you’ll see Daenerys Targaryen ditching her dragons for chicken skin dumplings. Matilda digging into a date dessert? There’s that too. Every single one of the pop-culture-y collages is straight up bizarre, but the oddly impressive mashups and pitch-perfect nostalgic references suck you in. Paired with a yellow background that’s so bright it almost requires sunglasses, the images here are a far cry from the naturally lit ones flooding our feed.Instagram contentThis content can also be viewed on the site it originates from.Do the posts show us what the nightly specials are or what the general vibe of the restaurant is? No. But, for us, that’s totally fine. Because, instead, the account serves us an entire attitude, practically cracking open the restaurant’s brain to show its personality, taste, and ethos—or at the very least, its Netflix history.“Since Spoken English is a non-traditional restaurant (i.e. a standing restaurant [editors’ note: that means no chairs for sitting, btw]) we wanted to make sure that we had a social media presence that really represented the spirit of the restaurant and its food,” says Bruner-Yang, founder of Foreign National, the development group behind the restaurant. So they took the 1990s pop-culture references they grew up with, combined them with late 1960s/early 1970s graphic design techniques like typography and collage, and added a layer of their Japanese street food–style dishes on top.Instagram contentThis content can also be viewed on the site it originates from.“I use characters that remind me of my childhood—what I used to watch when I was a kid,” Christian Zuniga, the group’s creative director, wrote via email. “I’m originally from Chile and I grew up absorbing American culture through movies, music, cartoons, and toys. I love how through these collages we can mashup different cultures, visually combining our food, our experiences, and taste.”As wacky as the visuals may be, they’re an accurate reflection of the restaurant’s weird and untraditional vibe IRL. Because there are no chairs—and because they blast Talking Heads—diners are constantly dancing between bites. Because it’s a tiny space, you feel like you’re practically a part of the kitchen, not just peeking inside it. And because the food itself is just as quirky, offbeat, clever as its collages: Dumplings with a chicken skin wrapper; twice-baked potatoes with uni and caviar; dessert made out miso, eggplant, and fennel. It might not all make sense on paper (or on screen), but you want to consume it. And that’s all that really matters anyway.Explore Bon AppétitRestaurantsInstagramFood on the InternetRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-03-11", "author": ["Condé Nast", "Emily Schultz", "Rachel Karten"]}