{"id": "c453af48ce38a8003d66d369ef0d4a40", "url": "https://www.bonappetit.com/recipe/shrimp-and-salami-pasta", "year": 2021.0, "month": 10.0, "day": 3.0, "content": "Shrimp and Salami Pasta Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesNovember 2021 IssueShrimp and Salami PastaBy Shilpa UskokovicOctober 19, 20214.5(29)Read ReviewsTriangleEmailPinterestPrintPhotograph by Julian Cousins, Food styling by Adriana PaschenEmailPinterestPrintEmailPinterestPrintA dreamy vacation to Portugal inspired this shrimp and salami pasta from recipe developer Shilpa Uskokovic. It’s pantry-friendly, takes under 45 minutes to prepare, and is packed with flavor thanks to supporting flavors like butter and wine. Use whichever salami fits your fancy—Uskokovic uses finocchiona, or fennel salami, for an extra kick. For glossy, saucy noodles, use a large pot to thoroughly toss everything together.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronDutch Oven$80 At AmazonMicroplane Grater$16 At AmazonCitrus Juicer$7 At AmazonHeatproof Measuring Cup$18 At AmazonLarge Pot$55 At AmazonColander$11 At AmazonIngredients 4 servings1lb. shrimp, peeled, deveined, tails removed, patted dry1tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more12oz. orecchiette or other short pasta3oz. log salami, preferably fennel, thinly sliced into rounds½cup (1 stick) unsalted butterZest and juice of 1 lemon6garlic cloves, finely chopped1tsp. crushed red pepper flakes1tsp. fennel seeds, lightly crushed1small fennel bulb, tough outer layers removed, finely chopped1cup dry white wine1tsp. smoked paprika½cup coarsely chopped parsleyPreparationStep 1Season shrimp with 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt.Step 2Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions. Drain pasta, reserving 1 cup pasta cooking liquid.Step 3Meanwhile, heat a large heavy pot over medium. Cook salami, turning occasionally, until crisp around the edges (some of the fat will have cooked out), 6–8 minutes. Transfer to a small plate.Step 4Melt butter in same pot. Add lemon zest, garlic, red pepper flakes, and fennel seeds; cook, stirring often, until garlic is just golden, about 2 minutes. Add chopped fennel, season with salt, and cook, stirring often, until softened, about 2 minutes. Add wine and increase heat to medium-high; cook, stirring occasionally, until alcohol smell is mostly gone, about 3 minutes. Add shrimp and paprika and cook, stirring occasionally, until shrimp are bright pink, about 2 minutes.Step 5Add pasta and reserved pasta cooking liquid to sauce. Reduce heat to medium and cook, stirring often, until pasta is well coated and glossy, about 4 minutes.Step 6Remove pasta from heat, season with salt, and mix in lemon juice, parsley, and salami. Divide pasta among shallow bowls or plates to serve.How would you rate Shrimp and Salami Pasta?Leave a ReviewTell us what you thinkReviews (8)Back to TopTriangleThis was great! Sauce was perfect, not heavy but coated pasta. Follow the instructions and its a sure hit. AnonymousOntario, Canada3/23/2022this was real tasty and very very easyMattbApalachin, NY12/3/2021Followed the recipe to the \"T\", and it was so amazing!  Wouldn't change a thing.  Amy OutlawHouston, TX11/27/2021Shrimp and salami, It had to be good. It also uses my new favorite vegetable, fennel. So I made it. It was a bit hot spicy for my wife's taste, but I and my guest, loved it. \n\nWhen I put effort into a dinner, I am often disappointed. My meal might be slightly better than what I would expect in an average restaurant. This was not disappointing. It had that WOW factor that made the dish worth the work and expense in preparing it.Zendoog3The Villages, Florida11/8/2021This reminds me of the Jambalaya I make with shrimp and kielbasa sausage. Shrimp and sausage together is delicious. I can’t wait to try this which will give me a different way to make a pasta dish using shrimp.AnonymousPhiladelphia, PA11/7/2021Brilliant take on classic Portuguese flavours, where pork and shrimp together work really well in many of the region’s classic dishes, such as cataplana. The lemon adds a nice bright zing, and the key is that tossing together with the pasta water to achieve a nice glossy texture and mouthfeel. Next time I will use Portuguese or Spanish chorizo, which would bring it slightly closer to home (and those are always in my pantry, whereas I rarely have salami).BlorkMontreal11/7/2021Salami together with shrimp? The horror...!Dog of TearsNew York, NY11/2/2021Easy to add more shrimp and/or salami.  3oz is used because that is the standard package of sliced at a store.  The name of it is: Finocchiona.  May be easier to find the pre-sliced package.  I cut mine into quarters.  Go easy on the pasta water--you can always add moreskipbenton city 10/29/2021Explore Bon AppétitShrimpShellfishSeafoodSalamiCured MeatMeatPastaDinnerEasyWeeknightQuickRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-19", "author": ["Condé Nast", "Shilpa Uskokovic"]}