{"id": "c455e4036967b8b4fa9a951ffcfa3b42", "url": "https://www.bonappetit.com/story/saturdays-nyc-backyard", "year": 2019.0, "month": 6.0, "day": 2.0, "content": "The Backyard at Saturdays Is My One Way Ticket Out of NYC’s Gnarly Summer Heat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThe Backyard at Saturdays Is My One Way Ticket Out of NYC’s Gnarly Summer HeatWith a cold coffee in hand, it’s easy to forget I’m actually still in Soho.By Alex DelanyJune 14, 2019FacebookTwitterEmailPhoto by Alex DelanyFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.On the days I can’t physically remove myself from the sticky, sweaty, totally unbearable reality of a New York City summer, the best I can do is remove myself mentally. On those days, you’ll find me hiding away in the closest oasis: The backyard at Saturdays NYC, an iced Americano in hand, pretending I’m somewhere else.It goes like this: Mugginess reaches its peak. I wake up in a sweat, leave my apartment, and head straight for Crosby street. I swing open the door of cool-kid SoHo surf shop, walk straight to the barista, get my drink, and then b-line it to the back door, past all the racks of breezy tie-dyed camp collar shirts and tailored linen pants. Waiting on the other side is paradise—by New York standards, at least. A walled-in patio lined with comfortable wooden benches and an army of plants. The lushness of the ferns, trees, bushes, and flowers intensifies as the summer drones on, crescendoing into a jungle of vegetation by August, just when the heat is at its most oppressive. These green things provide some shade from the sun, but just as important are the tall brick walls block out nearly everything else—sounds of rowdy Soho tourists included.It’s enough to make me feel as though I’m anywhere but a block away from the crowds stampeding down the sizzling asphalt of Broadway. And in the heat of the summer, that’s really all I need.Go there: Saturdays NYCExplore Bon AppétitNew YorkRestaurantsHighly RecommendRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-06-14", "author": ["Condé Nast", "Alex Delany"]}