{"id": "c464372894b01c46ef6575d0f43ee592", "url": "https://www.bonappetit.com/story/shake-shack-veggie-burger", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "The Shake Shack Veggie Burger Is Here and We're Into It | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleShake Shack's New Veggie Burger Is Here and We're Into ItJust in time for summer, the beloved \"fine-casual\" chain introduces a lighter vegetarian option.By Aliza AbarbanelApril 24, 2018FacebookTwitterEmailFacebookTwitterEmailFinding a good veggie burger is no easy feat—we've had plenty of bland bean burgers that ultimately feel like eating a sad condiment sandwich.  Danny Meyer and his culinary director Mark Rosati are trying to combat that disappointment and build a better veggie burger with Shake Shack's latest menu addition: The Veggie Shack.The beloved chain's brand-new addition is being tested at three locations in New York—Midtown East, Upper East Side, and Astor Place—as well as three additional stores in L.A. and Austin.The Veggie Shack is not the chain’s first vegetarian option—the menu has long featured the ‘Shroom Burger, a beloved and admittedly over-the-top item that featured a breaded and deep-fried cheese-stuffed portobello mushroom patty. Delicious? Absolutely. Healthy? Absolutely not. In contrast, the Veggie Shack is decidedly more burger-like. It starts with a patty made from a mix of black beans, roasted beets, and brown rice, accompanied by standard burger trimmings like pickles, onion, lettuce, and tomato. A slice of provolone cheese and a slick of vegan mustard-mayo act as finishing touches. The vegan sauce was selected for maximum adaptability—the burger can be made vegan by removing the cheese and swapping for a gluten-free bun (the normal buns contain a trace amount of dairy).Adding a new item to Shake Shack’s pared-down, obsessively-followed menu wasn’t taken lightly. Rosati and his team developed about ten versions of the Veggie Shack over a six month period, with feedback from Shake Shack founder Danny Meyer. \"Right away this one was his favorite, the one you keep wanting to go back for another bite,” says Rosati. “I think it’s the balance of flavors: the vinegar brininess of the pickles, the herbiness of the veg burger, the sweet crunch of the onion. I think when that’s done right it makes you happy and makes you want to keep going back.”Shake Shack's patty gets a boost from the addition of puréed dates and diced roasted beets, raw jalapeños, and raw white onion. A glaze Rosati describes as similar to a gluten-free hoisin sauce helps lock in sweetness. Before hitting the grill, the patties get coated in a layer of gluten-free breadcrumbs (made from a proprietary rice flour blend), which become crunchy and mimic a smash burger’s signature crust. The complete package feels pretty darn close to the chain's signature burger. It's also definitely a lighter option; I would have happily eaten a second.With this new vegan addition, Rosati hopes even more people will frequent the chain. “When we opened Shake Shack in 2004 it was about being a community gathering place—it’s why we made the 'Shroom Burger, because we knew it was meat-centric,” he says. “This new veggie option is on the lighter on the spectrum but is still fun, and now if you’re a vegan coming out with your friends and they’re eating burgers, you can be part of that experience.”Explore Bon AppétitHealthyishShake ShackTrendsRead MorecookingThese Outrageous Veggie Burgers Make Us Forget that Meat ExistsGallery5 SlidesBy Martin NordinRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Aliza Abarbanel"]}