{"id": "c46f285fc34cb28fee0952599df5aa90", "url": "https://www.bonappetit.com/story/big-green-egg-pork-shoulder-recipe", "year": 2018.0, "month": 6.0, "day": 4.0, "content": "Attention Big Green Egg Obsessives: Have We Got a Recipe for You | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAttention Big Green Egg Obsessives: Have We Got a Recipe for YouThe sticky-sweet pork shoulder was made for the Big Green Egg—but you can also make it without one.By Emma WartzmanJune 28, 2018FacebookTwitterEmailPhoto by Alex Lau, food styling by Rebecca Jurkevich, prop styling by Amy WilsonFacebookTwitterEmailIf you’re a Big Green Egg obsessive, you know that these grills can seamlessly transition from low and slow to blazingly hot, thanks to their thick ceramic walls and vents that let you control airflow. But you might not know that this gloriously shellacked pork shoulder from James Dumapit, former chef de cuisine at Aaron Franklin and Tyson Cole’s new Austin barbecue spot, Loro, is practically begging to be cooked in one. Inspired by the classic Cantonese barbecued pork dish known as char siu, this marinated pork shoulder is cooked in a closed Egg until tender, then glazed over a blast of heat that creates addictive crispy bits all around the outside.“We could have given you a smoked pork shoulder that takes all day and gets super shred-y,” says senior food editor Chris Morocco, who tested the recipe. “But the goal here is something more unexpected. We wanted the meat to be consistent throughout, but not have it take so long that it would bum you out.”The Egg, of course, has a longer lifespan of heat than a chimney full of coals. Plus, you can control and adjust the temperature, as opposed to ultra-hot flames that gradually cool down as time goes on. But that doesn’t mean you can’t actually make this recipe if you don’t have a Big Green Egg. The solution? The pork shoulder goes in an oven for the majority of the time and then finishes on a grill.You don’t need a Big Green Egg to make this pork, but it does make all the cooking happen in one place.\nBig Green EggThe ingredients are the same and the time involved is the same—it’s just a matter of starting the meat in a 350° oven, as opposed to a 350° Big Green Egg. See, the oven is as controlled of an environment as the Egg. But then instead of cranking up the heat in that same vessel, you light up your grill (either gas or charcoal is fine in this case), transfer the pork shoulder to that, and let the flames work their magic to create the glazed, crackly, caramelized crust that sets this dish over the top.“You’re going to lose some amount of smokiness, because your oven doesn’t get smoky, and it doesn’t spend too much time over open fire” Morocco says. “But it’s still truly worth doing.” Let’s just say that the iterations made in the test kitchen with the oven and grill combination disappeared exceedingly quickly. Point being, either way you make it, just call it pork candy.Get the Big Green Egg recipe:Sticky-Sweet Grilled Pork ShoulderBarbecue god Aaron Franklin and his team came up with the recipe for this sticky-sweet pork shoulder you’ll want to make all summer.View RecipeExplore Bon AppétitGrillPork ShoulderRead MorecookingI’m Sick and Tired of People Hating on Pork TenderloinBy Alex Delanyculture7 Online Butchers That Bring Quality Meat to Your DoorstepBy Ashley MasonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-06-28", "author": ["Condé Nast", "Emma Wartzman"]}