{"id": "c49036924bd85c9828829255c47da307", "url": "https://www.bonappetit.com/story/man-the-grill", "year": 2019.0, "month": 7.0, "day": 1.0, "content": "Why I Never “Man” the Grill | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingWhy I Never “Man” the GrillEverything I know about grilling, I owe to my mom.By Carla Lalli MusicJuly 3, 2019FacebookTwitterEmailPeden + MunkFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Anyone who has listened to my segments on the Bon Appétit Foodcast or watched my pasta e fagiole video or bought my cookbook knows that my mom, Carole Lalli, is the reason why I cook. She’s also the reason why I grill, and on the 4th of July, she and I will assert our culinary independence by harnessing live fire together.I never understood the whole “manning the grill” stereotype—that was a thing that happened in TV commercials but was never witnessed at my house. My father, who is an excellent person and a very well-fed husband, didn’t cook anything indoors, so it would have been really weird if all of a sudden he grabbed a box of matches and ran outside to light a charcoal fire. He knew it, too, and had no qualms about standing down. “I’ll man the beer,” he’d say. I loved watching my mom stand on the deck next to our Weber, one hand on her hip, the other holding a pair of tongs, glowing coals sending smoke swirling around her, while she calmly and confidently handled flare-ups like a boss. Real women grill, that seemed pretty clear. She grilled pizzas and lamb chops, chicken and sausages, lamb ribs, baby artichokes, and even our Thanksgiving turkey. And she literally never broke a sweat, which might have been the most amazing part.Want this letter before it hits the website? Sign up for our newsletter!The BA Smash BurgerView RecipeMy mom’s love of grilling eventually migrated indoors. She got a Tuscan Grill and set it up in her fireplace, and she and my dad would eat Florentine-style steaks in the winter. Eventually she got to build her dream kitchen, and installed a double-wide indoor grill that we love. (The Weber is still on the patio, and sometimes I feel bad that we don’t pay more attention to it.) I’ll be with my parents for the 4th, and in a rare turn of events, it will just be the four of us. My kids are at sleepaway camp, and my sister is road-tripping with her husband and baby, and the family text-thread devoted to our communal meal-planning is strangely quiet.I’ve been texting with my mom instead, keeping the weekend plans on the DL. We’re tracking the weather, we’re making plans to eat watermelon, and she’s updating me with farm stand reports. Most recently, she sent me this:“Ooooh—should we have hot dogs and hamburgers on Thursday?!”When the woman who could cook anything suggests the most stereotypical menu for the 4th of July, it sounds the best. We’re going to put a cast-iron skillet on the grill for smash burgers, and I’m going to pick up my favorite hot dogs on the way out of town, and someone will make coleslaw. While I can’t singlehandedly bring our country together, I am nonetheless inspired by this holiday’s origin story—you know, how a bunch of people banded together to overthrow the monarchy. In this case, it’ll be me and my mom womanning the grill, overthrowing gender assumptions. And we know the food’s going to be good—because we’re the ones cooking it.The Recipes BA Staffers Are Cooking This Weekend:1 / 14ChevronChevronTandoori Chicken WingsView RecipeExplore Bon AppétitCarla NewsletterFourth Of JulyGrillRead MorecookingI Thought the Smash Burger Couldn’t Get Better—Then I Tried ThisBy Adam RapoportcookingWhy Aren't We Grilling More Pork Shoulder Steaks?By Adam RapoportcookingEnough with the Ridiculous Extra-Long Grill Tools Already!By Amiel StanekLifestyleWe'll Be Drinking Co-Fermented Wines All Summer LongBy Marissa A. RossRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-03", "author": ["Condé Nast", "Carla Lalli Music"]}