{"id": "c4a171bd2eea5e4596073c35fe0d518f", "url": "https://www.bonappetit.com/story/salsa-verde-recipe", "year": 2019.0, "month": 4.0, "day": 1.0, "content": "This Salsa Verde Is Our Desert-Island Sauce | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleThis Salsa Verde Is Our Desert-Island SauceAnd it's perfect on roasted salmon (or vegetables, or fried eggs, or garlicky yogurt...)By Emily Fiffer and Heather Sperling April 2, 2019FacebookTwitterEmailPhoto by Chelsea Kyle, Food Styling by Michelle GattonFacebookTwitterEmailEmily Fiffer and Heather Sperling are two editors-turned-restaurant-owners in L.A. We'll catch up with Emily and Heather regularly for stories, recipes, and dispatches from the front lines of Botanica, their women-led, vegetable-first kitchen.Here at Botanica, we have passionate feelings about salsa verde. It’s our desert-island sauce, and would probably pass muster on a handful of sand or a rogue shell if things got really bad. The version we serve at the restaurant involves vinegar-macerated shallots, garlic, parsley, cilantro, capers, California olive oil, lemon juice and zest, and salt. We drizzle it over roasted veg and meat, spoon it over fried eggs, and stir it through thick, garlicky yogurt, moat-style. This rendition—same idea, minus the shallots and capers, plus pimenton and orange juice and zest—is just-barely-sweet, smoky, and bright enough to balance the fattiness of the fish we’re serving it on.Let’s talk about that fish. As the name Botanica suggests, we’re all about living that plant life. But show us a piece of pristine wild Pacific seafood and we’ll likely swoon in a manner ordinarily reserved for our romantic partnerships. We feel strongly about eating sustainably procured fish, and are adamant about sourcing from the ocean that’s nearest to us.You can (and should) shop this way, too! A visit to a local fishmonger or farmer’s market is a good place to start. When in doubt about what to buy, find the person with the fish knife, tell them your slow-roasting plans, and ask what’s in stock that’s exciting them. Once procured, we think you should take it sloooooooooooow. While there’s a time and place for a good sear, we adore a low-and-slow technique for salmon and similar fish. It’s a foolproof way to coax maximum lusciousness—and pan juice magic—from a thick filet. Lay the fish in a roasting pan, dress it with a simple topping of shaved shallots, citrus zest, olive oil, and salt, and stick it in a 250 degree oven. This gentle cooking method allows the fat to soften into the flesh and the juices to pool in the pan rather than cook off. (If you’re not a salmon fan, don’t fear: The slow-roasting method works wonderfully with cod, bass, or any thicker, higher-fat-content fish.)While the fish cooks, make your salsa verde. We love this recipe because it’s infinitely flexible. No cilantro? Try mint or dill or a combination of minced rosemary and rough-chopped oregano. No herbs at all? Put those pesky fennel fronds to use. Not an orange in sight? Nothing a spoonful of honey can’t fix. You get the idea; this one is hard to screw up.Depending on the thickness and size of your fish, the cooking process can take anywhere from 30 to 50 minutes. You’ll know the salmon is ready when the albumin, aka that white stuff that seeps out, starts to be released. When in doubt, pull it out and check the center. You’re aiming for a fall-apart, spoon-tender texture that, if it’s your first time slow-roasting fish, might read to you as undercooked.When the fish is ready, pull it from its citrusy steam bath and head straight to the table, roasting pan and all. Though another perk of this technique is that it can hang a bit until you’re ready to serve, if need be. Redistribute the pan juices over top of the fish, and, when it’s go time, top each serving with a liberal spoonful of salsa verde.We hope you love this technique—and the salsa verde life!—as much as we do. Thoughts/questions/success stories? You know where you find us. @botanicafoodSecure your citrus:Roasted Salmon with Citrus Salsa VerdePaprika gives smoky, spicy balance to bright citrus and herb flavors.View RecipeExplore Bon AppétitBotanicaHealthyishSalmonSalsa VerdeRead MoreLifestyleHow to Make Any Vegetable More Exciting With the Power of a Yogurt MoatBy Emily Fiffer and Heather Sperling Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-02", "author": ["Condé Nast", "Emily Fiffer", "Heather Sperling"]}