{"id": "c4a316ed57fde771ffd142c6e737ca73", "url": "https://www.bonappetit.com/story/anchovy-paste-guide", "year": 2021.0, "month": 7.0, "day": 5.0, "content": "Anchovy Paste Is the Easiest Way to Add Fish to Any Dish | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAnchovy Paste Is the Easiest Way to Add Fish to Any DishAnchovy paste makes food taste amazing—and you won’t even notice it’s there.By Marianna CeriniJuly 29, 2021FacebookTwitterEmailPhoto by Isa ZapataFacebookTwitterEmailEven if you think you don’t like anchovies, chances are you’ve enjoyed them in more ways than you realize: as the briny element in a Caesar salad, or the savory kick in a bowl of bucatini in butter-roasted tomato sauce, or in just about any dish containing Worcestershire sauce. (Yep, Worcestershire has anchovies in it!)But by contrast to the little fishes that come in tins or jars, anchovy paste is anchovies 2.0. A ground mixture of anchovies, salt, and olive oil (though some brands only feature the first two elements), it comes in a toothpaste-like tube often with a neat retro-looking design. It’s cheap, long-lasting, and a handy shortcut whenever you’re after big flavors but have no time (or anchovies) to spend in the kitchen. It’s also slightly less than salty and, in my opinion, overall more versatile than the tiny cured fish it’s made from.More versatile how? Unlike the more textural fillets of anchovies, this magical paste dissolves easily into any sauce, soup, or dressing, delivering more homogenous results and disguising itself almost completely in the final dish—which is a plus for anyone who’s not so keen on having bits of anchovies in their plate. (And since all you have to do to deploy it is take off the cap and give the tube a squeeze, it's even easier to hide the evidence from the anchovy-averse.)It also spreads easily, which is especially handy for meat. Rub it on a steak with some olive oil before you start cooking and you’ve got a restaurant-quality dish with a killer savory seasoning. Combine it in a marinade with shallots, garlic and lemon juice to slather generously on a roasted leg of lamb and it’ll bring out the meat’s rich, robust flavor. Use it in hearty red meat stews and witness how its saltiness adds character without a hint of fish flavor. Now, try doing that with whole anchovies—not quite the same thing.And then there’s its shelf life. Where jars or cans of anchovies, once opened, tend to lose their freshness if not used soon after, anchovy paste lasts months in the fridge, ready to elevate whatever you’re cooking with just a small squeeze. And I mean small: Because of its concentrated flavor, a little goes a long way, so you’ll rarely need more than a teaspoon or so to lend a big hit of umami energy to just about any dish.Still, the risk of overwhelming your dish—like whole anchovies can sometimes do—is pretty low because anchovy paste doesn’t make your food taste excessively fishy. Instead, it lends it a deeper flavor, boosting the qualities of other ingredients. Because of its more delicate consistency and the fact it blends in so well, the condiment lingers only slightly on the palate (and in turn, your breath).In Italy, where I’m from, anchovy paste is used in a variety of recipes and cooking methods, from the soffritto for pasta e ceci to just about any kind of sautéed vegetable. There’s an array of trusted brands that Italians rely on, many of which have been around since the 1800s and feature beautiful old-fashioned packaging: Angelo Parodi, Balena, Agostino Recca (a personal favorite). These sit on the “expensive” side of your general anchovy paste selection (around $4.50 per tube), but are worth it for their uniform texture, consistency, and spot-on flavor.So, if you’re an anchovy skeptic, let this mellow paste be your first foot into an ocean of flavorful possibilities; if you’re an anchovy enthusiast, save your fancy fillets for when they’ll really count and use the tube for everything else. Either way, anchovy paste deserves a place of honor in your fridge.Explore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-29", "author": ["Condé Nast", "Marianna Cerini"]}