{"id": "c4a43730259cb2d45cdfbd2c58f2ee4d", "url": "https://www.bonappetit.com/recipe/chai-cake-with-brown-butter-ghee-streusel", "year": 2020.0, "month": 9.0, "day": 4.0, "content": "Chai Cake With Brown-Butter-Ghee Streusel Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesOctober 2020 IssueChai Cake With Brown-Butter-Ghee StreuselBy Hetal VasavadaSeptember 22, 20204.4(22)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray, food styling by Rebecca JurkevichEmailPinterestPrintEmailPinterestPrintFor Milk & Cardamom author Hetal Vasavada, discovering brown-butter ghee was a happy accident, the result of leaving butter on the stove to simmer for too long. Cooking the milk solids until they’re just this side of burnt yields a deep toasted flavor that stands up perfectly to the aromatic chai spices in this play on coffee cake. The streusel incorporates the caramelized milk solids left behind after you strain the brown-butter ghee, giving the cake an extra boost of flavor. Make sure your spices are fresh; you want the flavors in the streusel topping to really pop.Ingredients10 - 12 ServingsGhee and Streusel2cups (4 sticks) unsalted butter½cup (63 g) all-purpose flour1cup (packed; 200 g) dark brown sugar½tsp. ground cardamom½tsp. ground cinnamon½tsp. ground ginger¼tsp. ground nutmeg¼tsp. ground cloves  (optional)¼tsp. ground star anise (optional)¼tsp. kosher saltCake and assembly2cups (250 g) all-purpose flour½tsp. baking powder¼tsp. baking soda½tsp. kosher salt2large eggs, room temperature1large egg yolk, room temperature¾cup plain yogurt, room temperature½cup milk½cup (100 g) granulated sugar5Tbsp. (packed; 63 g) dark brown sugar1tsp. vanilla extractSpecial equipment3layers of cheeseclothPreparationGhee and StreuselStep 1Line a fine-mesh sieve with cheesecloth. Melt butter in a medium heavy saucepan over medium heat, stirring often, until simmering. Cook, stirring constantly, 10 minutes. Reduce heat to low; continue cooking, stirring constantly, until golden brown and you can see bits of browned caramelized milk solids on your spatula, about 10 minutes longer. Strain ghee through prepared sieve into a large jar. Set aside brown-butter ghee and caramelized milk solids in sieve separately.Step 2Whisk flour, brown sugar, cardamom, cinnamon, ginger, nutmeg, cloves (if using), star anise (if using), and salt in a medium bowl. Add 1 Tbsp. reserved caramelized milk solids and ½ cup reserved ghee. Using your hands, work into dry ingredients until mixture resembles wet sand.Step 3Do ahead: Brown-butter ghee can be made 3 months ahead. Store tightly covered at room temperature.Cake and assemblyStep 4Preheat oven to 325°. Line a 9x9\" baking pan with parchment paper, leaving overhang on 2 sides. Whisk flour, baking powder, baking soda, and salt in a medium bowl. Whisk eggs, egg yolk, yogurt, milk, granulated sugar, brown sugar, vanilla extract, ¾ cup reserved ghee, and 1 tsp. reserved caramelized milk solids in a large bowl to combine. Sift in dry ingredients and fold just until no dry spots of flour remain (batter will be thick and slightly lumpy). Spoon half of batter into prepared pan; spread to edges. Sprinkle half of streusel evenly over, then dollop remaining batter on top and gently spread into an even layer. Sprinkle remaining streusel on top and gently pat to adhere to batter.Step 5Bake cake until a tester inserted in the center comes out clean, 40–45 minutes. Transfer pan to a wire rack; let cake cool before slicing.Step 6Do ahead: Cake can be baked 4 days ahead. Store tightly wrapped at room temperature.How would you rate Chai Cake With Brown-Butter-Ghee Streusel?Leave a ReviewTell us what you thinkReviews (13)Back to TopTriangleThe taste of this cake is delicious but it is very rich. I thought I'd only use part of the ghee that it makes, but there's a whole pound of butter in this cake! It was also rather streusel-heavy and the streusel is slightly greasy. I will try it again with some alterations mentioned elsewhere. I also baked it an extra 15 minutes and it still wasn't quite cooked completely (or maybe greasy, hard to tell).ShannonCambridge MA3/26/2021As far as the process goes, pretty straightforward. I too did not have anywhere near one tablespoon of brown butter solids left over. I used normal grocery store unsalted butter. I felt like I wanted more batter to split among the two layers, and it was rather difficult spreading that second layer of batter evenly across the first streusel layer. I felt like the amount of streusel was abundant and definitely my favorite part of this recipe. The cake itself tasted just so so to me. Not bad, certainly, and nicely moist, but just kind of ho hum. I'm not itching to make this again, but I would try it again for friends/family. Natalie MatzOmaha,NE2/7/2021Unlike the other commenters, I had no trouble with the ghee - I got LOTS of milk solids using store brand American butter. But my streusel was not crumbly and nubby - it was a smooth paste that sunk into the cake without adding any texture. When the cake came out it had a ~lot~ of ghee floating on the top, very greasy! I think the recipe calls for too much ghee in the streusel. Once it cooled it had a lovely, moist texture & a nice flavor. But it wasn’t quite special enough for all the time spent and bowls dirtied. I will make the ghee again to drizzle on popcorn - it smells like movie theater butter! Anonymous1/31/2021Confession: I used the giant jar of Costco ghee and skipped the milk solids and this STILL came out deliciously buttery and moist. Mine needed an extra 5-10 minutes to bake (was still very wiggly in the middle after 45 min) but could just be my oven. Overall, I'd say skip the homemade ghee and use store bought - mixes with the spices just as well and makes this recipe a cinch! RachelLos Angeles12/23/2020The first time I made it I used Plugra and it took about 40 minutes to make the ghee. There was perhaps 1 scant tablespoon of solids. This time I used Kerry gold and it took about 15 minutes and the solids were burnt and the ghee is dark golden. Not sure if it is burnt as well. and this time I used a copper pot. Not sure if that had something to do with it.ClaireAlexandria, VA11/25/2020YUMMMM!  This is SO yummy and rich, but not too heavy.  I used the yogurt I had on hand (vanilla), and it was pretty quick to put together.  I didn't  stir the butter constantly, and had no issues, using a cheap store brand.  The flavors are so deep and comforting on a snowy night!LornaFort Collins, CO11/10/2020I really wanted to like this, but I measured out all the ingredients by weight (when weights were given) and the cake was just too heavy and even slightly greasy while warm. Maybe it would be better with a decreased amount of ghee--the flavor was yummy.Anonymous11/8/2020Just made this. Truly amazing flavour and texture. I used Plugra and got only about 2 teaspoons of caramelized milk solids. What is the secret to getting more?AnonymousAlexandria, VA10/25/2020Made this today! Super moist, heavily spiced and delicious. I agree with others about the milk solids but it was not big deal. Next tine, I will put more emphasis on putting them in the cake versus the already very spiced crumble. I will warn others to not over mix! I saw lumps in the batter and tried to smooth them out  (I missed the note on the recipe). The cake was a bit dense but completely my fault. Nonetheless I will be making this again and again! Astoria, NY10/18/2020Delicious recipe! To answer the comments below regarding the amount of milk solids, this most likely has to do with the type of butter that you are using! If you use American-style butter, it might have a lower milk solids content. “Taste” has a pretty cool guide to understand the differences (Google “All about butter Taste”)!AnonymousIreland10/13/2020This is very delicious. It was definitely labour intensive and the ghee didn't exactly work. Well, the ghee part worked but I definitely did not have 20ml of caramelized milk solids. I spent 25 minutes with it on the stove. The first five to melt, and the next two sets of 10 minutes just like the recipe says. And use a way bigger pot than you think --- in the second set of 10 minutes, that stuff likes to foam right up! But when I strained it... I barely got a tablespoon of solids. I don't know why... :( Either way, super delicious. Very moist and sweet and decadent. Thank you!heatherkgEdmonton10/11/2020Browning the ghee took longer than the 20 minutes mentioned in the recipe. I could have still probably gone a few minutes longer than was mentioned... I’m not sure if it was the butter I used or that I should have kept going, but it didn’t create as much milk solids as was needed for both the streusel and the cake. AnonymousMadison, Wisconsin10/11/2020Best crumb cake I've ever made - but the brown butter ghee didn't really go correctly for me. I don't know if it's my butter (Kerrygold), pan (All-Clad), or terrible electric stove, but my butter browned in the first 10 minutes even with continuous stirring. After these first 10 minutes I pulled it off the stove. \n\nNext time I'm going to keep it on low and see if I can go for the whole 20 minutes. Despite not going for the whole time the cake came out excellent.AnonymousDelaware10/10/2020Explore Bon AppétitCakeDessertYogurtOther IngredientsSnackNut-FreeBakingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-22", "author": ["Condé Nast", "Hetal Vasavada"]}