{"id": "c4a9cc91e86e3477799a2aa858161a10", "url": "https://www.bonappetit.com/story/ba-best-chicken-parm", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "BA’s Best Chicken Parmesan Recipe Is FINALLY Here! | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow Molly Baz Developed BA’s Best Chicken Parm—and Lived to Tell the TaleIt was tense, it was trying, it was really really worth it.By Molly BazMay 1, 2020FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailWhen I first noticed that we didn’t have a recipe for BA’s Best Chicken Parm, I nearly flipped. Sweating, sputtering, shocked, and confused, I immediately texted Adam Rapoport, the editor in chief of Bon Appétit (yes, my boss) to express my dismay at this gross absence in our repertoire. Developing this recipe was a matter of utmost urgency, I told him. Within seconds he was onboard, ready to tackle this beast with me. And thus, our long, arduous, chicken parm journey began.Six weeks, 20 pounds of chicken (don’t worry, ALLLL of them were eaten), a bazillion micro-tests of different components, and no shortage of arguments later, we finally struck the perfect balance of crunchy fried chicken cutlet, rich tomato sauce, and ooey gooey cheese, and turned out what we think is a pretty flippin’ delish, home cook–friendly version of the classic.Here’s how it all went down:Watch Molly and Adam make chicken parm at home.\nThe ChickenNaturally, it made sense to start here. We tested chicken breasts and thighs, pounding them to all sorts of precisely measured thicknesses. To each of those we applied a myriad of marinades (white wine, lemon juice, vinegar) and seasonings (garlic powder, onion powder, lemon zest, freshly grated garlic…) until we landed on the winning combination: Chicken breasts that get butterflied and pounded to ⅓-inch thick, before being bathed in a mixture of freshly grated garlic, lemon juice, and olive oil. The lemon juice was clutch in tenderizing the chicken and keeping it from getting tough when cooked, all the while bringing some brightness and zippy, zingy flavor to a dish typically associated with anything but. As for the breasts, I’ll admit I was pretty into the thighs at first—dark meat is obviously superior! But Adam was right to stick with the classic. Just don’t tell him I said so.The BreadingIn search of the crispiest crunchiest cutlet out there, we tested plain breadcrumbs, panko breadcrumbs, a mix of plain and panko breadcrumbs, and panko breadcrumbs that had been blitzed in a food processor until fine. We even tested a double dredge, for goodness sake! Ultimately, we landed on a classic three-part breading process of flour (salted, of course), beaten egg (doctored with garlic powder and onion powder for some extra Italian-American flava), and panko breadcrumbs, which held up the best under all the sauce and cheese. Just remember: You must take the time to really pat them on to the cutlet before frying or you’ll end up with some bare spots and nobody likes those!The SauceThis is when things got tense. The goal was to create a simple but bold sauce using canned tomatoes, but the number of routes we could take to get there felt limitless: Chunky and juicy or smooth and velvety? Crushed tomatoes or tomato puree? Both onions and garlic or just garlic alone? Fresh basil or dried oregano? Olive oil or butter? Etc. Etc. Etc. After 10 or so different sauces (a few of which featured “rustic chopped onions,” in Adam’s word) we went with a super smooth sauce made from pureed tomatoes (for texture), very finely minced onions (for natural sweetness and vegetal flavor), crushed garlic (for ease), a few tablespoons of tomato paste (for extra tomato-eyness), and a pinch of salt and sugar (for flavor!). We think it turned out quite nice.The CheeseCan you even call it chicken parm if you don’t get a good cheese pull? And for that, we knew we needed mozzarella on top of the already obvious parm. But then came the questions: Should we use low moisture or fresh mozz? Grate the cheeses or slice the cheeses? Combine and sprinkle the cheeses together, or add them separately for more of a layering effect? And most importantly, how much is too much? After many iterations we landed on a mixture of 2 parts mozzarella to 1 part Parmesan, both grated, and mixed together, before being generously, and I mean generously, showered over the crispy-crunchy cutlet. With one caveat: There MUST be some entirely un-sauced, un-cheesed edges of cutlet peaking out in order to maintain the proper ratio of crisp to soggy.Ain't she a beaut?\nPhoto by Emma FishmanThe AssemblyStep 1: If an evenly crispy, golden-brown crust is what you’re after (and clearly, it is), then you need to fry them in enough oil so that the cutlets can float as they cook, never hitting the bottom of the pot. (Baking them, would yield wan lifeless cutlets so that was never going to be an option.) A neutral oil such as canola or vegetable was the obvious choice, thanks to its high smoke point, affordability, and neutral flavor that wouldn’t overtake all that delicious zippy chicken we just took the time to marinate.Step 2: We knew we wanted the whole shebang saucy, but we didn’t want the bottom of cutlets to sog out as they sat in their baking dish. So we landed on a compromise: A liberal blanket of sauce over the cutlets, a few more dollops to the negative space around them, and any leftover sauce gets served in a sidecar (classic cocktail–style) alongside for additional DIY saucing.Step 3: Then, the melt. After much consideration we decided that throwing the baking dish under the broiler for just a few minutes would most efficiently melt and brown the cheese without overcooking the already fried chicken breasts (no baking here!). I don’t know about you, but I’m here for juicy chicken and perfect cheese “leoparding” on my chicken parm, and that’s exactly where we ended up.The Finale: Oh, and let’s not forget the finishing touch—and Rapo’s biggest claim to fame in this recipe: A light but necessary sprinkling of “micro-minced parsley” (his words, not mine) over the bubbling, cheesy chicken parm for some aesthetically minded color contrast.Yes, it’s quite the project, but the payoff is worth it, we promise (you can even break the process up over a couple days, if you prefer!). NOW GET OUT THERE AND RING THAT PARM ALARM!!!Get the recipe:BA’s Best Chicken ParmWe deconstructed every aspect of this iconic dish to bring you our ideal version. No more sad, soggy, mediocre outcomes allowed! View RecipeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-01", "author": ["Condé Nast", "Molly Baz"]}