{"id": "c4b8b2d5bd6e5a56ad16e62c6279f262", "url": "https://www.bonappetit.com/recipe/extra-virgin-olive-oil-brownies-with-a-mocha-swirl", "year": 2019.0, "month": 3.0, "day": 1.0, "content": "Extra Virgin Olive Oil Brownies with a Mocha Swirl Recipe | Bon Appetit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose Menu IconLoginRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastSubscribe to our newsletterSign UpPrivacy and user agreementMain Navigation IconBA LogoBon appetitLoginrecipesExtra Virgin Olive Oil Brownies with a Mocha SwirlFacebookPinterestTwitterEmailmakes 16 browniesThis brownie has all of the nutritional benefits extra virgin olive oil offers with all of the tasty goodness you crave.PrintIngredients3/4 cup Colavita® Premium Selection Extra Virgin Olive Oil6 ounces bittersweet chocolate3/4 + 1/3 cup granulated sugar3/4 cup light brown sugar4 large eggs1/4 cup dutch process cocoa powder1/2 teaspoon kosher salt3/4 cup unbleached all-purpose flour8 ounces cream cheese2 teaspoons instant espresso powderflaky sea saltRecipe PreparationPreheat the oven to 350º. Brush an 9-inch metal baking pan with oil. Line with parchment paper and brush the parchment with oil.Chop the chocolate into small pieces.Bring about an inch of water to a simmer in a medium pot. Place a medium heatproof bowl over the pot of simmering water. Add the chocolate and cook, stirring, until the chocolate is just melted.Carefully remove the bowl of melted chocolate from the heat (the bowl may be hot). While whisking, slowly pour the olive oil into the melted chocolate, whisking until fully incorporated.Add the granulated and brown sugars to the chocolate mixture and whisk to combine.Crack three of the eggs into the batter and whisk well until completely incorporated.Whisk the cocoa and salt into the batter. Then gently fold the flour into the batter.In another medium bowl, whisk the cream cheese with the remaining ⅓ cup of sugar and the espresso powder. Crack the remaining egg into a small bowl and separate the yolk from the whites. Add the yolk to the cream cheese mixture and whisk until fully combined. Reserve the white for another use.Using a spatula, scrape the brownie mixture into the prepared baking pan. Smooth the top. Dollop the cream cheese mixture over the brownie in the prepared pan. Then use a toothpick or wooden skewer to swirl.Bake the brownie until puffed and lightly golden and the edges start to pull away from the pan, about 55 minutes. Let cool. Sprinkle the brownies with flaky sea salt, cut into squares, and serve.Recipe by Colavita® Related VideoOlive Oil Brownies with a Mocha SwirlReviews SectionReviewsWrite a review…GET THE MAGAZINEBA LogoBon appetitSUBSCRIBESign up for the Bon AppétitNewsletterSign UpWill be used in accordance with our user agreement and privacy policyExplore Bon AppétitSponsoredMore from Bon AppétitRecipes6 Pro Chefs Reveal Their \"Secret Weapon\" Ingredients2022-03-02T17:00:00.000ZrecipePorcini Gnocchi With Butter Sauce2022-03-15T09:00:00.000ZrecipeWhiskey Sour2020-12-16T18:20:00.000ZBA LogoBon appetitSubscription FAQsMastheadNewsletter SignupAccessibility HelpRSS FeedsSite MapCondé Nast StoreCareersBon Appétit Media KitDo Not Sell My Personal InformationCondé NastFood Innovation Group: Bon Appétit and Epicurious© 2022 Condé Nast. All rights reserved.Use of and/or registration on any portion of this site constitutes acceptance of our User Agreement (updated as of 1/1/21) and Privacy Policy and Cookie Statement (updated as of 1/1/21).Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our affiliate partnerships with retailers.Your California Privacy RightsThe material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast.Ad ChoicesOur Sites- - - - - - - - - - - - - -Condé Nast DigitalAllureArchitectural DigestArs TechnicaBackchannelCondé Nast TravelerEpicuriousGlamourGQGQ StylePitchforkSelfTeen VogueThe New YorkerThe SceneVanity FairVogueWired", "date": "2022-03-02", "author": ["Colavita"]}