{"id": "c4b9cde12d617e0aa6a115b0f96de056", "url": "https://www.bonappetit.com/story/homemade-chile-butter", "year": 2019.0, "month": 12.0, "day": 4.0, "content": "Chile Butter is the Greatest Secret-Weapon Condiment That Ever Lived | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHomemade Chile Butter Gives Any Meal a Whole New Lewk Just don't call it compound butter. By Molly BazDecember 27, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Molly BazFacebookTwitterEmailThe only thing better than a good recipe? When something's so easy to make that you don't even need one. Welcome to It's That Simple, a column where we talk you through the process of making the dishes and drinks we can make with our eyes closed.I'm going to start off with a huge claim: This spicy, bright Calabrian chile butter is the greatest secret-weapon condiment that ever lived. It’s got big flavor but a small ingredient count—a winning combination in my book.Now I know that compound butters have a bad rap—and frankly, I think that most of the time, they deserve it. I’m not interested in busting out 12 different ingredients just to put them in butter—I’ll leave that to the steakhouses. But while this chile butter may be, in its heart of hearts, a compound butter, we definitely won’t be calling it that. Because excluding the butter and the salt, it relies on just three ingredients and comes together in five minutes.And we have jarred Calabrian chiles to thank. Funky, intensely spicy, and bright, they bring big flavor to whatever they touch, which is why they are the perfect counterpart to sweet, creamy butter.To make it, throw 1 cup (2 sticks) room-temperature unsalted butter and ¼ cup chopped jarred Calabrian chiles into a food processor. Use a Microplane to grate in zest of ½ lemon and 1 garlic clove. Season with kosher salt and pulse until mixture is bright orange and mostly smooth (some visible flecks of chile are fine!).Just like that, you’ve got yourself a balanced-but-bold condiment you can slather on almost anything. For a no-brainer appetizer, spread it on fat slices of toast and top with high-quality tinned sardines. Toss some into a pan of roasted vegetables (we’re partial to crispy potatoes) or dollop a spoonful onto a thick steak or pork chop while the meat rests, or onto a hot roasted or steamed sweet potato. Spread the butter over a chicken before you roast it, mix it into polenta or a pantry pasta, or use it to make an off-the-charts garlic bread.Sounds like a lot of ideas, but don't worry! The chile butter keeps forever in the fridge, so you’ll have plenty of time to experiment.Explore Bon AppétitIt's That SimpleButterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-12-27", "author": ["Condé Nast", "Molly Baz"]}