{"id": "c4cfc04bcd69536da4d9e3713e7962fd", "url": "https://www.bonappetit.com/story/broccoli-salad-with-peanut-dressing", "year": 2018.0, "month": 5.0, "day": 3.0, "content": "This Broccoli Salad with Peanut Dressing Is Our Only Memorial Day Plan | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Broccoli Salad with Peanut Dressing Is Our Only Memorial Day PlanFact: Creamy peanut dressing makes everything taste better.By Aliza AbarbanelMay 15, 2018FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Chris Morocco, Prop Styling by Emily EisenFacebookTwitterEmailThe appearance of raw broccoli—say, on a crudités platter—doesn't exactly get our taste buds tingling. Dry stalks and tiny broccoli flowers between your teeth is nobody's best look. But when we devoured the broccoli salad from beloved pizza spots Emily and Emmy Squared and realized it was raw broccoli, we did a double-take. Served over the creamiest peanut dressing and sprinkled with dried sour cherries, it changed our minds about raw cruciferous for good.“The last thing that I was expecting when I ordered that salad was for them to send out a raw head of broccoli,” says senior food editor Chris Morocco. “I thought there was a certain chutzpah, and then you realize the dressing underneath is so thick and rich. It’s a perfect counterweight to the squeaky rawness of broccoli florets, and the sour cherries are the perfect counterweight to the intensity of the dressing and the raw, vegetal brightness of the broccoli.”Keeping this textural interplay in mind, Morocco developed a lightning-fast recipe to celebrate his newfound appreciation of raw broccoli. Its luxuriously rich sauce is quickly formed by whisking together creamy peanut butter, unseasoned rice vinegar, soy sauce, grated ginger, salt, and a touch of sugar. “The peanut butter gives you an instant savory base that has such incredible power to flavor other things,” says Morocco. This sauce will keep in the fridge for up to a week, so go ahead and make it in advance if you’re especially organized.The salad itself uses as much broccoli as possible, using both bite-size florets and peeled broccoli stems. Once the tough green exterior fibers are removed, broccoli stems are surprisingly delicious! You might even prefer the stem to florets. Thinly sliced Persian cucumbers and a small daikon radish provide maximum crunch, and the whole mixture is simply coated with olive oil, rice vinegar, and salt.Finally, it’s time to plate. Taking time to arrange each component may feel fussy, but it really brings the whole dish together. It’s also super easy: Just spoon the peanut dressing onto a platter and arrange the salad on top, then sprinkle some dried tart cherries and a few cilantro springs. Each forkful should combine creaminess, crunch, and a pop of sweetness.There's never a bad time for salad, but we think this dish is particularly perfect for a sunny Memorial Day picnic. It’s easily prepped and assembled, and it's a perfect replacement, or complement, for that mayo-y pasta salad. Serve it alongside extra-juicy turkey burgers or bring it to a party, where we promise it'll change all the other raw broccoli–skeptics' minds.Break out the broccoli:Broccoli Salad with Peanut DressingThe raw broccoli salad at Emmy Squared in Brooklyn showed us that broccoli can be delicious even when squeaky raw.View RecipeExplore Bon AppétitHealthyishBroccoliSaladMemorial DaySalad DressingPicnicPeanut ButterRead MorecookingThis Is The Turkey Burger Recipe You've Been Waiting ForBy Claire SaffitzRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-05-15", "author": ["Condé Nast", "Aliza Abarbanel"]}