{"id": "c4dd31b61964082506b9fee76afb831e", "url": "https://www.bonappetit.com/story/rent-week-hash", "year": 2019.0, "month": 11.0, "day": 2.0, "content": "Rent Week Crispy Potato Hash With Spicy Sausage | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingCrispy Potato Hash With Spicy Sausage? Must Be Rent Week Hash can be good—let me prove it. By Alex DelanyNovember 8, 2019FacebookTwitterEmailPhoto by Travis Rainey FacebookTwitterEmailYou ever think about life on the ranch? Horses? Lassos? Cowboy hats? Wooden fences? Expansive, star-lit night skies? Cacti? Rattlesnakes? Your faithful cow-herding pup? Crappy coffee in a crappier tin cup? The things on boots that clink and clank? (Ummm...spurs?) Nah, me neither. Well, that’s not true. I think about all of that when I’m making and eating hash, the official food of fictional ranch hands everywhere.So yeah, let’s talk about hash, a perfect Rent Week food. Potatoes. A little bit of meat. Minimal spices. Minimal ingredients. Maximum satisfaction. But I’m not going to beat around the bush. Most hash is pretty terrible. Undercooked potatoes, graying ground meat. Never enough salt, and even fewer aromatics and alliums. For a food with so much potential, it's a chronic under-deliverer.But that’s most hash. That’s not Rent Week hash. This month’s recipe is hash in its finest form. Crispy potatoes and spicy sausage. Sweet onions and garlic. And a little oregano and yogurt to lift it all up. So throw on this Americana playlist I made for you (completely free of charge) and get ready for some ranch-style grub.The first thing to do is get your potatoes cooking:Start with 2 pounds of young potatoes (fingerlings or anything small and waxy will do just fine).Throw them in a large pot and cover them with at least two inches of water. Throw about 1 cup of kosher salt into the water, stir, cover, and bring to a boil over high heat. Wait, what? A cup of salt?! Yes, for real. That much salt. Salting your potato water is what will make your spuds actually taste like something. And don’t worry, you’re not actually consuming all that salt. Most of it gets left behind in the water.When the water boils, turn the heat down to medium-low and let the potatoes simmer for about 15 more minutes, until they’re soft enough to easily poke through with a fork, but not so soft that they break apart immediately.While the potatoes do their thing, get yourself prepped:Heat a large cast-iron skillet over medium-high heat.De-case about 1 pound of hot Italian sausage, thinly slice ½ of a large white onion (widthwise, in complete circles), and thinly slice 3 cloves of garlic .Now it's time cook the sausage and alliums:Crumble the sausage into small pieces and spread across the hot cast iron.Let it cook undisturbed for about 5 minutes. And when I say undisturbed, I mean undisturbed. Don’t touch it! We want this sausage to get nice and crispy and browned. Flip a piece and see if it’s developed some serious color. If it has, flip the sausage and let it brown on the opposite side. If not, let it go a bit longer.Once the sausage has browned on both sides, transfer it to a bowl with a slotted spoon, leaving behind as much rendered fat as possible.Add the onion rings to the pan, stir to coat them in fat, and cover the skillet with a lid. After about 5 minutes, the onions should have softened a bit. Add the garlic and a sprinkle of kosher salt, stir, and cover the skillet again. Remove the lid and stir the onions and garlic until they're completely tender and have started to pick up some color.Use a slotted spoon to remove the onions and garlic from the skillet and into the same bowl as the sausage, once again leaving behind as much rendered sausage fat as possible.A platter of hash. Lasso not included.\nPhoto by Travis RaineyLook! Your potatoes are good to go!Dump the potatoes in a colander, then transfer them to a large rimmed sheet tray. Now...smash them. It’s nothing personal. Strictly business. Potatoes will get way crispier if you crack them open a bit and expose some of that starchy interior. Use a coffee mug to smash each potato gently. You’re not trying to obliterate them. You just want to smush them gently, until the sides split and the potatoes flatten slightly.Return your skillet to medium heat and add a glug of neutral oil  so the bottom is entirely coated. Add half of the smashed potatoes to the pan in a single layer—you’ll need to fry in two batches, so don’t be tempted to cram them in all at once.Cook the first batch, undisturbed, until golden brown and crisp underneath, about 6–7 minutes. Flip the potatoes, add another glug of oil, and continue to cook on opposite side until golden brown and edges are crisp, about 5–6 minutes more.Transfer the potatoes back to the sheet tray, add a glug of oil to the pan, and repeat with the second half of the potatoes.While the potatoes fry, pick about ¼ cup of fresh oregano leaves from the stems and give it a rough chop. Toss the oregano into the bowl with the sausage, onions, and garlic.Once the potatoes have gotten all nice and crispy, season them with a sprinkle of kosher salt and plate half of them across a platter. Layer half of the sausage and onions on top of the potatoes, then repeat with the remaining potatoes and sausage.I like to serve this with some scrambled eggs when I’m feeling especially hungry. Eggs or not, I’ll always add a dollop of Greek yogurt. It’s not necessarily a ranch hand move, but look, I’m not going to push the cowboy references on you any further. You get it: Ranch stuff exists and hash is pretty darn great, whether you’re around a campfire or in the dwelling you pay monthly to live in.Want something a little less...hash-y? How about fried rice?Your Plans Can Wait—Tonight Is For Kielbasa Fried RiceBest eaten alone. On the couch. While watching a movie you've already seen.View StoryExplore Bon AppétitRent WeekBasicallyhashPotatoSausageOreganoRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-08", "author": ["Condé Nast", "Alex Delany"]}