{"id": "c4fe1b20d60fbe17cd42188d17c7104a", "url": "https://www.bonappetit.com/story/the-case-for-tahini-cookies", "year": 2021.0, "month": 7.0, "day": 4.0, "content": "These Tahini Cookies Win Best Supporting Role | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThese Earthy-Creamy Tahini Cookies Win Best Supporting RoleSometimes you need a dessert that doesn’t hog the spotlight but still wins fans.By Sonia ChopraJuly 22, 2021FacebookTwitterEmailPhoto by Laura Murray, styling by Judy ManciniFacebookTwitterEmailEvery other Wednesday, Bon Appétit executive editor Sonia Chopra shares what’s going on at BA—the stories she’s loved reading, the recipes she’s been making, and more. If you sign up for our newsletter, you’ll get her letter before everyone else.In my very early 20s, I went shopping with a roommate who was looking for a dress she could wear to other people’s birthdays. It couldn’t be too flashy or too colorful, because she didn’t want to be the center of attention—she wanted something neutral but cute, something that would look good in photos but not take anything away from her girlfriends on their special days.I thought she was being a little silly, honestly. But her neutral dress policy crosses my mind every so often, including last weekend, when I was asked to bring a dessert to an event that I knew would have a showstopper of a cake from a guest of honor. Whatever I brought needed to be good, but it also needed to play second fiddle to the real star.What’s a dessert that just gets the job done? Cookies, I figured, so I considered chocolate chip, peanut butter, snickerdoodle—and even party snickerdoodle. I obsessed over these pistachio thumbprints but didn’t want to make (or buy) pistachio paste. Finally, I landed on these tahini cookies, slightly bitter and not too sweet, topped with toasted sesame seeds. They are eggless and pantry staple–heavy, come together in one bowl, and bake up like a dream, plus they taste amazing without being too fancy. Make them the next time you want a tray of cookies to snack on all weekend, anytime you have a little extra tahini, or if you need to fulfill a highly specific potluck request like I did.I’d love to know your favorite cookie recipes and the last thing you made for a party, whenever that may have been. I’m sonia@bonappetit.com.All the cookies: 1 / 47ChevronChevronCoffee-Hazelnut BiscottiView RecipeExplore Bon AppétitCultureLetter From The EditorTahiniCookieRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-07-22", "author": ["Condé Nast", "Sonia Chopra"]}