{"id": "c501b12b8e431ab6c0e36a6034f4837f", "url": "https://www.bonappetit.com/story/bittersweet-quarantine-cooking", "year": 2020.0, "month": 6.0, "day": 4.0, "content": "I’ll Never Be Able to Cook the Bad News Away. But I Try Anyway | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureI’ll Never Be Able to Cook the Bad News Away. But I Try AnywayQuarantine has given me time to perfect my layer cake technique and finally learn how to use those pasta-making attachments on my stand mixer. But the victories are bittersweet.By Roxane GayJune 22, 2020FacebookTwitterEmailIllustration by Ana GalvañFacebookTwitterEmailBeef Wellington is a strange and incredibly labor-intensive dish to prepare—tenderloin wrapped in duxelles wrapped in prosciutto wrapped in puff pastry. When I attempted Gordon Ramsay’s recipe after years of listening to him bellow about the dish on Hell’s Kitchen, I also endeavored to make my own puff pastry (the Bon Appétit recipe, in fact) because surely that was feasible. Puff pastry comes from somewhere, after all.Turns out, there is a reason so many recipes call for store-bought. Puff pastry is a finicky thing to make—lots of folding and rolling layers of dough and butter with rounds of chilling in between. Every time I took it out of the refrigerator for more folding and rolling, it would come apart, butter oozing through the dough. I consulted Google as to how to remedy this and eventually it all worked out, but it was a trial, indeed.I have long enjoyed cooking, but during this pandemic, with a great deal of unstructured time on my hands and anxious energy to burn, I have taken to cooking and baking the most elaborate dishes, making every component from scratch, and carefully documenting the experience with my phone’s camera—partly for myself, and partly to post on Instagram, where unsolicited advisers do not hesitate to tell me when something looks ugly or explain how I am “doing it wrong.” I am not alone in all this pandemic kitchen activity. A great many people around the world are managing their stress with culinary labor.In the before, my fiancée, Debbie, and I mostly ate out at restaurants because we were too busy for anything else. For years I have yearned for the leisure to cook and bake, but my schedule has been too demanding. I live in Los Angeles and New York, where Debbie lives. I travel nearly every week for speaking engagements. I am working on too many projects—a pilot, a pitch for a new television show, a new comic book series, several books, freelance articles. There are a great many deadlines, most of which I watch pass me by as I struggle to catch up (which, likely, I never will). When I did have the time to cook, I didn’t have the energy, and when I had the energy, I didn’t have the time. But now, everything is upended. We are all moored in our homes, afraid of one another and what might befall us if we get too close.Having all this time to spend in the kitchen is bittersweet. I needed it because I was hurtling toward burnout, but I am still restless with nowhere to go, nowhere to be. I have the same amount of work but less pressure to contort myself to get that work done, and without that pressure, I don’t know how to function. Instead, the days stretch out, seemingly endless, my time my own to do with as I please. We are hunkered down in Los Angeles while our cats, Theo and Lew(cifer), are stuck in New York—being well taken care of by my cousin, but still. We miss them and worry they won’t remember us. When we FaceTime with them, they are largely indifferent, glancing at us on the tiny screen with practiced disdain.Meals are something tangible toward which I can direct my energies and, unlike current events, mostly manageable challenges. During isolation, I have made pretzels, bagels, cinnamon-raisin bread, scones, croissants, layer cakes, coffee cake, mint chocolate bars, cookies, eclairs, meringues, homemade pizza, tsoureki bread, chicken milanese, chicken tortilla soup, chicken fajitas with homemade tortillas, Mongolian beef, soufflés. I made an entire Passover meal—matzo ball soup with homemade matzo balls, a brisket, a potato kugel, apples and honey—for the first time in my life because my fiancée is Jewish. We sat down in our dining room and she looked over the meal, her eyes shining, and for a moment, life seemed almost normal, faith undeterred by calamity.I leave care packages on my porch for friends to pick up. I find myself browsing online for all manner of kitchen gadgets, thinking about how I might use a pasta drying rack or a sausage grinder. I watch hours and hours of The Great British Baking Show while standing at my kitchen island, kneading dough or slicing vegetables or assembling a potato-and-onion quiche. It is so very relaxing to have clearly defined tasks and instructions on how to perform those tasks. And while there have been plenty of mishaps (I roasted that Passover brisket for three hours too long and most of it was charcoal), there have also been delightful, delicious successes, like a three-layer strawberry shortcake with homemade whipped cream. In more fanciful moments, I muse to Debbie about going to culinary school and eventually starting my own bakery. This is an absurd fantasy, but with each passing day, it becomes more tempting.It is an immense privilege, and one I do not take for granted, having access to fresh food, having the money to buy it, having the leisure to track down ingredients, and the time to cook. I am overwhelmed by this privilege as I read the news each day, knowing that more than 22 million people are unemployed; that there are endless lines at food banks across the country; that people are getting sick and they are dying; and cities across the country are hampered by inadequate testing, no contact tracing, and an anemic federal response. It’s all too much, and feeling that way is also a privilege. As Debbie, a news junkie, watches Rachel Maddow update us on the latest travesties with tightly controlled, eloquent rage, I bake and cook as if that might temper the terrible news. It doesn’t, at all, but it is a distraction. It is a reminder that as the world falls apart, we still have basic needs—to nurture and be nurtured, to nourish and be nourished. We may be stuck at home, but we are well-fed.A month into quarantine, I decided to make my own pasta. This is not something I had ever accomplished before, but the KitchenAid mixer I got a few years ago did come with a set of pasta-making attachments, and there they were in the back of a cabinet. I read the instruction manual and found a recipe for making penne alla vodka. Then I was pouring flour onto my island, making a small well, and breaking four eggs into it. As I went from one step to the next and that mound of dough and egg began to more closely resemble what I know of pasta, I wasn’t thinking about a respiratory disease with no vaccine or the shattered global economy or the fact that I probably won’t have my main source of income (from public speaking to large crowds) until 2021. I wasn’t thinking about my mother’s late-stage lung cancer or my father’s undiagnosed illness and the added\nvulnerability of those conditions.Instead, I was intensely focused on the task at hand. Mixing dough, letting it rest, kneading dough, letting it rest, shaping it into disks, running it through the pasta machine once, twice, eight times until it was thin enough to read a newspaper through. It wasn’t a seamless process, but it\nwas reliably methodical.Once I had stretched out my pasta, I realized I didn’t have a garganelli board or a dowel to roll the small squares I cut. I ended up using a pencil, and I don’t know what kind of noodle I made but I do know it tasted great. I had to improvise, but that was also satisfying in and of itself—to adapt, to be able to adapt because I have learned so much. I can only hope I will be able to bring these skills beyond the kitchen, because eventually this pandemic will end. The world will be remade. We will all have to learn to live in that new world. We will have to adapt.Roxane Gay is the best-selling author of Hunger, Difficult Women, and Bad Feminist. She’s now at work on several new book, film, and television projects.Explore Bon AppétitCoronavirusFirst PersonRead MorecultureFrom Pandemic to Protests: How Food Businesses Are RespondingBy The Bon Appétit StaffCoronavirusThere's No Better Time to… Make a Big BatchBy Aliza AbarbanelLifestyleEverything Is Different So I'm Drinking a Wine That Doesn't ChangeBy Marissa A. RosscookingThe Only Time I Panic Is When These 5 Condiments Run LowBy Carla Lalli MusicRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-22", "author": ["Condé Nast", "Roxane Gay"]}