{"id": "c5038411f234b79d30e234093db18ac8", "url": "https://www.bonappetit.com/recipe/cinnamon-roll-pound-cake", "year": 2021.0, "month": 8.0, "day": 2.0, "content": "Cinnamon-Roll Pound Cake Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesSeptember 2021 IssueCinnamon-Roll Pound CakeBy Jocelyn Delk AdamsAugust 10, 20214.2(14)Read ReviewsTriangleEmailPinterestPrintPhoto by Oriana Koren, food styling by Lillian Kang, prop styling by Jillian KnoxEmailPinterestPrintEmailPinterestPrintThis cinnamon-roll-inspired cake from Jocelyn Delk Adams of Grandbaby Cakes is a fun twist on classic pound cake. Featured in Bryant Terry’s book Black Food and inspired by her grandmother, Big Mama (whose buttery cakes were famous in her hometown of Winona, Mississippi), the batter gets swirled with a brown sugar–cinnamon spice mixture. “Drizzled with cream cheese icing, it will remind you of those pillowy soft and fluffy cinnamon rolls you may have indulged in for breakfast,” Adams says.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronStand Mixer$460 At AmazonGet It Right Spatula$13 At BA MarketWire Rack$23 At BA MarketSmall Offset Spatula$6 At AmazonCake Tester$3 At AmazonIngredients12 - 16 Servingscake batterNonstick vegetable oil spray or unsalted butter (for pan)3cups (380 g) cake flour, sifted, plus more for pan1tsp. Diamond Crystal or ½ tsp.Morton kosher salt½tsp. baking soda1½cups (3 sticks) unsalted butter, room temperature2½cups (550 g) granulated sugar6large eggs, room temperature1cup sour cream, room temperature2Tbsp. vegetable oil1Tbsp. vanilla extractCinnamon Swirl⅓cup (40 g; firmly packed) light brown sugar5Tbsp. unsalted butter, melted1Tbsp. all-purpose flour1½tsp. ground cinnamon1tsp. vanilla extractIcing and assembly2oz. cream cheese, room temperature2Tbsp. unsalted butter, room temperature1½cups (165 g) powdered sugar¼cup chilled milk (whole, 2%, or unsweetened coconut)1tsp. vanilla extractSpecial EquipmentA 12-cup Bundt panPreparationcake batterStep 1Place a rack in upper third of oven; preheat to 350°. Generously coat pan with nonstick spray or butter, then dust with flour, tapping out excess. Whisk salt, baking soda, and 3 cups flour in a medium bowl to combine.Step 2Beat butter in a stand mixer fitted with the whisk attachment on high speed until light and smooth, about 1 minute. With motor running, gradually stream in granulated sugar and beat until mixture is very pale yellow and fluffy, about 5 minutes.Step 3Add eggs one at a time, beating well after each addition and scraping down sides of bowl with a rubber spatula as needed. Reduce mixer speed to low and, with motor running, gradually add flour mixture in 2 additions, beating just until incorporated after each addition. Beat in sour cream, oil, and vanilla, scraping down sides of bowl as needed, until combined (be careful not to overmix the batter).CINNAMON SWIRLStep 4Whisk brown sugar, butter, flour, cinnamon, and vanilla in a small bowl to combine. (This is your cinnamon mixture for swirling.)Step 5Scrape one third of batter into prepared pan. Drizzle half of cinnamon mixture over. Using a butter knife or skewer, swirl cinnamon mixture through batter. Top with half of remaining batter; drizzle remaining cinnamon mixture over and swirl together again. Scrape remaining cake batter into pan and smooth surface.Step 6Bake cake until a tester inserted into the center comes out with only a few moist crumbs attached, 80–90 minutes. Transfer pan to a wire rack and let cake cool in pan 10 minutes. Turn out cake onto rack (use a small offset spatula to loosen if needed); let cool completely.Icing and AssemblyStep 7Beat cream cheese and butter in the clean bowl of stand mixer fitted with clean whisk attachment on medium-high speed until combined, about 2 minutes.Step 8Reduce speed to medium and gradually add powdered sugar in 2 batches, scraping down sides of bowl as needed. Continue to beat until powdered sugar is incorporated, then increase speed to medium-high and stream in milk and vanilla. Beat until icing is smooth and pourable, about 2 minutes.Step 9Set rack with cooled cake inside a rimmed baking sheet and drizzle icing over cake, letting it drip down the sides. Transfer to the refrigerator and chill until icing is set, about 15 minutes.Step 10Transfer cake to a large plate to serve.Do Ahead: Cake can be made 3 days ahead. Transfer to an airtight container; cover and chill. Bring to room temperature before serving.Adapted with permission from Black Food: Stories, Art, and Recipes From Across the African Diaspora by Bryant Terry (4 Color Books). Copyright © 2021.\n\nBuy from Amazon or Bookshop.orgHow would you rate Cinnamon-Roll Pound Cake?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleDelicious.  Made this for my family a couple of times including my birthday and it was a  hit.  Co-workers enjoyed it as well. Doesn't need to bake for the full time.  Check it after about an hour.  aldrich4Canton, GA2/9/2022This cake is delicious.  My family loves it and I baked one and brought to work and my co workers loved it also.  80 mins is too long.  I checked mine at 60 and it was good.  Very moist.AnonymousCanton, GA10/8/2021This is a question, not a review. That's a LOT of butter to use! Do you think this recipe could be halved and baked in a loaf pan instead? It wouldn't be nearly as pretty as a bundt cake of course. Any other ideas for how to bake it if I were to halve the recipe? And would you recommend a different length for the baking time?BarbiToronto10/7/2021Took it out at 84 minutes and it was dry-ish. Suggest testing with toothpick at about 70-75 minutes. Also, the cinnamon swirl was pretty meager—suggest doubling it for a more unctuous result. Maybe even consider mixing some cinnamon into the flour coating for the pan. RobinYorba Linda, CA9/22/2021Perfect!!!!  Everyone at my brunch loved it!!  Already asking for more!!AnonymousOregon 9/6/2021Explore Bon AppétitCakeDessertCinnamonHerbs & SpicesCream CheeseCheeseNut-FreeVegetarianBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-08-10", "author": ["Condé Nast", "Jocelyn Delk Adams"]}