{"id": "c507fcecea161130d116eb6aa0e070a5", "url": "https://www.bonappetit.com/story/is-it-ever-ok-isolation", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Is It Ever Okay...To Hide Special Treats from Your Roommates In Isolation? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewsletterscultureIs It Ever Okay...To Hide Special Treats From Your Roommates in Isolation?Questionable etiquette for trying times. By Alex BeggsApril 9, 2020FacebookTwitterEmailPhoto by Chaloner Woods/Getty ImagesFacebookTwitterEmailWelcome to “Is It Ever Okay,” Bon Appétit’s questionable etiquette column. Have a question? Email staff.bonappetit@gmail.com.I don't know what time or day it is anymore. In this state of confusion, when is it appropriate to have a cocktail or a glass of wine? —Timeless TaliaWell, all of Europe seems to be able to have a glass of wine with lunch so I don’t know why the line of demarcation got officially drawn at 5:00 p.m. in the U.S. Have you ever had a crisp glass of Sancerre with a big lunch burrito? Heaven! Take a little nap afterward; set your Slack away message to “BRB” like a certain colleague of mine does when she’s definitely napping. It’s good for the immune system to rest, relax, and feel joy. However you need to do that, do that.We looooOooove cabbage around here.\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Sophie StrangioHow much cabbage is too much cabbage? —Cruciferous CamilleI can fit two heads into my crisper, so that seems like enough. It does keep FOR WEEKS, which is amazing. But the answer is three heads. Three is too much. Speaking of heads, don’t lose yours hoarding bulk vegetables (or anything, for that matter) you don’t have the physical or stomach space to store.Is it a big deal to eat expired canned soup? It seems wasteful to throw it out. —Dated DoreenThe expiration date on canned food is determined by the company that makes it, but most canned food can last much longer than that date (check out this app the UDSA made for more specific timelines). Today I learned that high-acid canned goods don’t last as long, fascinating! Everything you feel iffy about should get a look and smell test. But let this be a learning moment for you—go through that pantry and see what’s expiring in the next few months and put it on the counter. Eat it!How do I manage my newfound nightly ice cream consumption? I went from a Klondike bar to half a pint of Häagen-Dazs coffee ice cream. Sometimes I caramelize bananas and pour that over. —Overboard OtisNice touch with the caramelized bananas. That sounds like a smart way to get in a daily dose of fruit/potassium, IMO. Ice cream is crammed with bad-for-you sugar, which makes it hard for me to fall asleep, and you’re going with COFFEE ice cream too, so we might not be on the same page, philosophically. But if you’re cooking all your meals, otherwise eating your greenery, touching your toes twice a day—a little ice cream treat isn’t that big of a deal (me = not a dietician). Especially if the happiness payoff is so huge.Can I snack during Zoom meetings? I’m muted! —Chomping ChesterWhen I see someone snacking in a Zoom meeting all I want to know is “whatcha eatin?” It’s distracting! And some people are gross eaters, let’s be real. I’m already seeing inside the intimate space of your home, do I also need to see the inside of your mouth? I’m gently advocating for not snacking in professional meeting environments, but then again, I’m a person who feels self-conscious sipping from my Camp Snoopy water glass in video chats. I’d never fathom going full sandwich. But also: I’m not THAT busy. Are you?Preserved lemons got you perplexed? PUT IT IN BUTTER.\nWhat can I do with…. —Lotsa PeoplePreserved lemonsA cute salad dressing (chop ‘em up, add olive oil, honey, lemon juice, s+p)Blend with olive oil, lemon juice, and salt and serve with fishSlice the peels and toss with roasted potatoesCombine with spinach for a restaurant-y pasta dinnerWhole milk yogurtMake banana bread and freeze slices for impulse banana bread momentsUse in place of sour cream in these ridiculously good biscuits which you can freeze (before baking)Earl Grey yogurt cake obviously!!Crispy tachin isn’t really freezer material but you WILL eat ALL of it so don’t worry about leftoversThe best lentil salad to ever salad.\nPHOTO BY CHELSIE CRAIG, FOOD STYLING BY YEKATERINA BOYTSOVAFrench green lentilsOne of the greatest salads that ever salad-edMujadara makes me weak in the kneesMarinate ‘emCombine with greens and devour this toastLet Chris Morocco’s lentil burgers wow youChickpea flourPriya’s comforting kadhi!SOCCA time!Have a crispy fritter momentMake panisses, feel fancyRed curry pasteOther than make a quick curry, you mean?Try this INGENIOUS peanut dipMarinate some shrimp in itStir into this lentil soupNew recipe, must make.\nPhoto by Alex Lau, food styling by Susie Theodorou, prop styling by Elizabeth JaimeFresh fennel and no other produceThis recipe from pasta god Evan Funke is a MUSTOpen your mind to fennel dipTons of jamJAM TART. SHOWSTOPPER.Stir some into your gin and tonic (shrugs)Make a layer cake, use it as the filling, celebrate something!Plop onto boring oatmealSwirl into boring vanilla ice creamPinwheel cookies and linzer cookies are there for youParsleyTABBOULEHSalsa verde! Blend with tomatillos, other herbs, green chiles, avocado. (Or capers and walnuts, whoa!)Shove it in a jar with other herbs, feta, and olive oil for ~infused cheese~Make this lemony, almondy dressing for lentils/kale/grain saladsMeet Andy’s kuku sabzi, an amazing herb frittataGreen Sauce No. 4 (self-explanatory)Walnut pesto, freezable!Or throw it in the freezer in a bag labeled “future stock”Is it okay to hide special treats from your quarantine-mates? —Egotistical ElijahI used to consider an under-the-bed almond M&M stash a normal secret to have, but lately, I’m starting to think about how my selfish decisions affect other people. All of these downright heroic healthcare workers and tireless deliverypeople are out there risking their lives for us, and we’re conniving about hidden Cheez-Its? Is it possible that revealing and sharing the special treat might make your roommates so delighted that your own pleasure will multiply?? There’s a lot heavy thinkers have to say about American individualism in the time of Coronavirus; how our resistance to being told what to do is why the virus spread. But we’re just talking about snacks, aren’t we? Or...are we?Explore Bon AppétitIs It Ever OkayLeftoversEtiquetteRead MorecultureIs It Ever Okay...to Bring 11 Items to the 10 Items or Less Aisle?By Alex BeggsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-09", "author": ["Condé Nast", "Alex Beggs"]}