{"id": "c51a49189a5ea8a4d8787010f72a2f85", "url": "https://www.bonappetit.com/story/first-dates-olive-garden", "year": 2019.0, "month": 4.0, "day": 3.0, "content": "Why I Take All My First Dates to Olive Garden | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsWhy I Take All My First Dates to Olive GardenIt starts with free wine samples, endless breadsticks, and keeping my expectations low.By Kristen N. ArnettApril 16, 2019FacebookTwitterEmailPhoto by Cody JamesFacebookTwitterEmailWelcome to Red Sauce America, our coast-to-coast celebration of old-school Italian-American restaurants.When I meet women on dating apps, I always want to know if I can take them to the Olive Garden, my treat. It’s a solid opener; a way to know if we’re compatible. If they’re the right kind of woman for me, they’ll respond with an enthusiastic yes.The right kind of woman for me is someone who won’t give me a hard time about the things I like. The kind of woman who will let me pocket all the leftover breadsticks and doesn’t care if we only discuss our favorite sexual positions and what kind of appetizers look best off the limited-time-only menu. We’re at Olive Garden because it’s kitschy and cute. Nothing that happens needs to be a serious thing. It’s no big deal.Many people don’t know that Olive Garden began in 1982 as an independent restaurant in the Greater Orlando area. As a local who’s obsessed with talking and writing about Florida, I guess it makes sense that it’s a restaurant I’d frequent. The one I go to isn’t actually the original, but they’re all very much the same kinda place: same menu, same ’90s-style carpets, same matching uniforms on the waitstaff.At Olive Garden, the good times are as limitless as the free salad and breadsticks.\nPhoto by Cody JamesThere’s something comforting about the fact that my Olive Garden is located in the neighborhood where I grew up. It’s where my evangelical family and I used to eat together before we stopped speaking. Before I came out, before I stopped going to church, before I held them accountable for all the ways they’d silenced important parts of me. So yeah, Olive Garden reminds me of my family, which is painful, but it also reminds me of home—at least, an idea of what home could be: a never-changing place that isn’t ever going to foist anything new upon me. And there’s a Michaels across the parking lot, so after dinner, if I’m tipsy from my wines, plural, I can walk over and look at art supplies, which is always a very good time.What I’m saying is: I go to Olive Garden to chill out and avoid the problems in my life.We’re seated. Would you like some wine, I ask. I always want wine. What kind of wine do you like, she’ll ask, and I’ll smile and tell her I can’t tell the difference. All wines taste the same to me. But if we don’t tell our server that, we’ll get unlimited free samples. And I am all about unlimited free samples. Oh look, here come the breadsticks! Also free.Two people eating means you get three sticks total. I like to think Olive Garden did that on purpose, so that you’re forced to break bread with your date. You must share with each other, touch hands. It’s all very romantic, if romance is deciding who gets to take the bigger share of the carbs. Also, if I eat my first breadstick quick enough, I can pick up the second one before my date even notices it’s missing.All around us, families are sitting down together to eat and discuss their days. They’re talking about what the kids did at school, or maybe deciding what they’re gonna do as a family over the weekend. I myself am having dinner with a complete stranger I met on the internet, so I skip all the warm-hearted intimacy and jump straight into a terrible stand-up comedy routine. One night I made a pun so bad that a woman actually took out her phone and unmatched me right there at the table.Can you believe my boss did that? she asked at the end of a long story I wasn’t fully listening to. “I wouldn’t put it pasta!” I replied. Date over.I don’t know what I’m expecting to get from these outings. Despite the fact that when-you’re-here-you’re-family, I’m not looking to settle down with any of the women I bring to Olive Garden. In fact, I know that after we make out in the parking lot or hook up at her apartment, I’ll never see her again.But I like the routine of it. The fact that I don’t have to try so hard. Even if conversation lags, Olive Garden gives you opportunities to engage. I mean, they bring you a salad you’ve gotta serve yourself. So I take the tongs and mix everything around for a good while and then ask my date what she likes best. I don’t like olives so I’m always hoping she does, and I’m always hoping she loathes tomatoes so I can snag them. After the meal is through, the server brings out the check and tosses a fistful of Andes mints on the table. If you’re like me, you’ll make a joke about us being “mint to be” and the woman will be so disgusted with you that she’ll just let you take all of them for yourself. Olive Garden never changes and apparently neither do I.I can’t tell if I want to.I pay the check. It’s the least I can do. Then we walk out into the balmy Florida night, full of sauce and carbs and wine, and I’m ready to go home alone and think about all the weird things we saw happen in the restaurant, like that kid who crawled under several different tables and untied everyone’s shoelaces.Maybe the date could have turned into something bigger if I hadn’t made it so it couldn’t possibly. Maybe I could’ve rolled the dice on sustainable companionship if I weren’t so terrified of it backfiring. Maybe. But here’s what I do know: If I ask nicely enough, the restaurant will give me a packet of my very own warm breadsticks to take home. On the house. And if that’s not intimacy, I don’t know what is.Kristen Arnett is an essay and fiction writer based in Orlando, Florida. Her debut novel, Mostly Dead Things, will be published by Tin House Books in June.Explore Bon AppétitRestaurantsItalian AmericanRed SauceFloridaRead MorerestaurantsRed Sauce AmericaBy Bon AppétitRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-16", "author": ["Condé Nast", "Kristen N. Arnett"]}