{"id": "c52b40a7474c2efe9babe903f7039429", "url": "https://www.bonappetit.com/recipe/rice-bowls-with-flaky-cod", "year": 2018.0, "month": 10.0, "day": 4.0, "content": "Rice Bowls with Flaky Cod Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesRice Bowls with Flaky CodBy Chris MoroccoOctober 25, 20184.1(12)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsea Kyle, Food Styling by Susie TheodorouEmailPinterestPrintEmailPinterestPrintKedgeree, the traditional Anglo-Indian recipe that inspired this dish, often calls for smoked fish, but for a light weeknight meal, we prefer steaming fresh fish right on top of the rice.Ingredients2 servings2large eggs2Tbsp. ghee or extra-virgin olive oil2garlic cloves, crushed1tsp. (or more) curry powder¾cup basmati rice, rinsed, drained well25–6-oz. cod filletsKosher salt¼cup whole-milk Greek yogurt1talk celery, thinly sliced on a bias½cup cilantro leaves with tender stemsLime wedges (for serving)PreparationStep 1Cook eggs in a small saucepan of simmering water for 9 minutes. Transfer to a medium bowl of very cold water and let cool until just warm, about 3 minutes. Peel; set aside.Step 2Meanwhile, melt ghee in a large saucepan over medium heat. Cook garlic, tossing occasionally, until lightly browned, 4–5 minutes. Add curry powder, followed by rice and 1¼ cups water. Bring to a simmer, cover, reduce heat to low, and cook until rice is nearly tender, about 15 minutes.Step 3Season fish generously with salt and a pinch of curry powder, if desired. Lay fish over rice and continue to cook, covered, until rice is tender and fish flakes apart when poked with a finger or fork, 8–10 minutes.Step 4Divide yogurt among bowls. Top with fish and rice. Halve eggs and arrange alongside. Top with celery and cilantro. Serve with a lime wedge alongside.How would you rate  Rice Bowls with Flaky Cod?Leave a ReviewTell us what you thinkReviews (10)Back to TopTriangle*The yoghurt is a must and makes the dish* Cooked this tonight and it was very yummy. I may have waited to long to put my fish in to steam as my rice was nearly out of water but I just added a bit extra and it steamed up just fine. Definitely agree with the other reviewers - add more seasoning. I doubled the curry powder and added some cayenne pepper and forgot to add salt to the rice while cooking but I think that would have helped. But I added it after along with a splash of soy sauce and some sambal olek. I sauteed onion, bell pep and some kale on the side and mixed that in too. Hannahrs22Tampa, FL1/13/2021Haven't made this but looking to make — I think there's a type-o: \"Talk celery --> stalk celery\" Anonymous12/3/2020Absolutely delicious! Definitely needs a generous amount of salt added both while the rice cooks and when serving. AnonymousMinnesota6/7/2020This recipe has potential, it really does. But it misses the mark and comes out kind of bland. The combination of tangy yogurt, crunchy celery and bright cilantro is a delight. A few suggested modifications:\n\n- at least double the curry in the rice\n- add .5 tsp salt to the rice\n- chop the cilantro. These stems are just awkward.\n- add the fish 5 min before your rice is finished with the initial cooking time. \n\nAnonymousChicago, IL6/7/2020Who does your proofreading?\nSee this: 1 talk celery, thinly sliced on a bias\nAnonymousMaine5/11/2020Delicious, quick, and easy. It will be easy to riff on as well. I’ll definitely make this again! I left off the eggs and cilantro because I didn’t have them, but the yogurt is definitely not optional.AlektrikAtlanta, GA3/8/2020Loved this dish! It was very easy to make and very flavorful. As noted in another comment, I did use more salt, especially when cooking the rice. I also added a some sambal olek for a bit of kick. Definitely making this again! mhdsileskyAustin, TX6/22/2019what if you only had salmon? would you cook it the same way?Anonymous10/30/2018Delicious!  Loved the tang of the yogurt coupled with the fish and cilantro.AnonymousVermont10/29/2018Yes, I would make this again BUT I would add more salt.  It was flat as is and needed something more savory.  My first thoughts were to add some soy or fish sauce or to possibly marinate/season the fish more heavily.  Never the less I loved the ease of this recipe. justyntiSan Diego10/28/2018Explore Bon AppétitRice and Grain BowlCodFishSeafoodRiceRice & GrainsEasyQuickWeeknight MealsMainNut-FreeGluten-FreeHealthyishSteamBreakfastLunchDinnerRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-10-25", "author": ["Condé Nast", "Chris Morocco"]}