{"id": "c54b5876868ae9f341cba3f671c91da2", "url": "https://www.bonappetit.com/story/set-healthy-boundaries", "year": 2020.0, "month": 6.0, "day": 1.0, "content": "5 Ways to Set Healthy Boundaries Around News and Social Media | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyle5 Ways to Set Healthy Boundaries Around News and Social MediaStaying informed right now is crucial, but it can also be triggering—especially for those in the Black community. Here’s how to manage your media diet right now.By The Healthyish TeamJune 1, 2020FacebookTwitterEmailIllustration by Shanée Benjamin  FacebookTwitterEmailIn the last few weeks alone, we’ve seen footage of two white men killing Ahmaud Arbery, a police officer kneeling on George Floyd’s neck, law enforcement tear-gassing, pepper-spraying, and physically assaulting protestors, and cars and storefronts burning in cities from Denver to D.C. It feels impossible to look away and imperative to witness, but damn if it doesn’t take a toll.This is especially true for Black people, for reasons that are all too clear. “Hearing and seeing images of your people being brutalized messes with your mind and brings up feelings of fear and hopelessness,” says Camesha L. Jones LCSW. Unchecked, those feelings can lead to anxiety and depression as well as physical symptoms like headaches, shaking, trembling, racing thoughts, and sleep issues.Jones is a licensed therapist and the founder of Sista Afya, a Chicago-based organization supporting mental wellness for women of the African Diaspora. Recently, Sista Afya led a virtual support group to talk about how to confront the inundation of negative news—from COVID-19 to racial violence—and how to step away.After the support group, we reached out to Jones and asked her to share some of her strategies for dealing with news-induced anxiety right now.1. DisengageFor some people, turning their phone off for one full day a week is a great way to detox from news overload. For others, setting daily boundaries is more effective. Jones recommends making a schedule. For example, check the news (including social media!) only three times a day and at certain times. And set a limit on the amount of time you’ll spend on these platforms each day, like one hour max.2. DistractPay attention to your body while you’re consuming news and social media. If you’re starting to feel symptoms of anxiety like tension in your shoulders or tightness in your throat, it’s time to turn off the screen and temporarily redirect your attention. That could mean taking your dog for a walk or doing a simple chore or making a cup of tea. Jones emphasizes that this strategy is for the immediate short-term. “Distractions shouldn’t go on for days on end. The goal is to take your attention away from the news so you can begin to regulate your body and your emotions.”3. Self-SootheOnce you’ve distracted yourself successfully, do something that gives you a sense of calmness, joy, or peace. Jones suggests listening to music, reciting affirmations, or doing body awareness exercises. This is an important follow-up to distraction, says Jones, because it allows your body and mind to fully restore.4. Get Support Off-ScreenIt’s easy to use social media to stay connected, and, when we’re stuck at home, it’s often necessary. But, as we all know, it’s also easy to get trapped in the endless, anxious scroll. So be intentional when you go to tap that Twitter or Instagram app. Are you looking for information or connection? If the latter, could you get it in a different way? Could you text instead or even make a *gasp* phone call? If it’s safe to do so in your area, could you meet up IRL? “A friend called me the other day to ask how I was holding up, and that meant more to me than people posting comments on my Instagram account,” Jones says. “Going old-school can go a long way.”5. Follow Up With HopeLastly, says Jones, “consume the minimum amount of news you need to feel informed, then follow it up immediately with something that gives you hope.” That could be a small goal to accomplish that day, a plan with a friend, or a daydream about what a better future might be. “We’re not getting messages of hope or help from the news,” says Jones, so we have to take it upon ourselves to believe that things can change.Explore Bon AppétitHealthyishSelf CareInterviewsRead MoreLifestyle7 Virtual Mental Health Resources Supporting Black People Right NowBy Jesse SparksRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-06-01", "author": ["Condé Nast", "The Healthyish Team"]}