{"id": "c54fdedb5d85fb0c37f93bc7057e4fda", "url": "https://www.bonappetit.com/story/what-is-pepperoni", "year": 2021.0, "month": 11.0, "day": 3.0, "content": "What Is Pepperoni and How Do I Get The Best Stuff? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPepperoni Is for More Than Just PizzaAlt. title: The potential of pepperoni.By Nico AvalleNovember 17, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Cyd McDowell, Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.There are plenty of things you can put on a pizza, but no topping is as universal, as iconic, as quintessentially American pizza shop as pepperoni. Sliced thick or thin, this mild-spicy sausage brings a ton of savory goodness to any pizza party. But pepperoni doesn’t have to be kept in a box (even if it’s a box with a little plastic table in the middle to stop the cheese from getting stuck to the top). Think beyond pizza! This versatile ingredient presents a whole world of possibilities just waiting to be discovered.So what is pepperoni?Before it ends up at your slice shop, most pepperoni starts out as ground pork, beef, or a mixture of the two. Producers then add paprika, which helps give the sausage its characteristic deep red hue, as well as garlic and other aromatics like fennel seeds to up the flavor factor. Once it’s packaged into sausages, the mixture is aged for several days before being smoked and dried. Throughout this process the sausages undergo mild fermentation, during which lactic acid builds up, contributing to the deep tangy flavor, and water is lost, creating the dense, chewy texture we love.Pepperoni may sound 100% Italian, but it is an American invention. According to Angie Rito and Scott Tacinelli, writers of the cookbook Italian American and chef-owners behind New York’s Don Angie restaurant, there’s some mystery about where and when the sausage was first made, but it appeared sometime in the early 1900s in butcher shops and pizzerias in the US.Italian American: Red Sauce Classics and New Essentials$35 $30 at Amazon$35 $32 at Bookshop“It seems to be most closely related to a Neapolitan- or Calabrese-style dried salami that would have a lot of dried chiles in it,” Rito explains, noting that early waves of Italian migration predominantly came from the region’s southern territories. Without access to the same ingredients, early Italian American butchers had to adapt salami recipes based on what was on hand. “Paprika would have been more readily available and cheaper [in the United States],” says Rito, “and then people realized it was just delicious.”Enough about pizza! But also, would you look at that pizza?!\nPhoto by Emma Fishman, Food Styling by D'mytrek BrownHow can you cook with pepperoni?Even though pepperoni is nearly synonymous with pizza, you should keep an open mind about this bright red sausage’s potential. In Rito and Tacinelli’s recipe for Stuffed Mussels With Pepperoni Rice, fat is rendered out of finely chopped pepperoni and used to add a pop of color and flavor to arborio rice. “There’s something about the color that we like,” Tacinelli says. “We use it in ragùs and other sauces, rendering out that vibrant oil.” In their cookbook, Rito and Tacinelli use that same oil to create deeply crimson breadcrumbs, which they pour over salads to add a salty, spicy crunch.To eke out as much of that sweet, sweet grease as possible, you must first break down the sausage into smaller pieces. You can do this with a knife, but to get even more flavor from their pepperoni, Rito and Tacinelli use a meat grinder to return the sausage to a fine crumble. If you don’t have one at home, Tacinelli says a food processor works just as well.Of course, pepperoni is just as good if you don’t cook it before eating. Because dangerous microbes are killed during the curing process, it’s safe to eat the sausage raw (Tacinelli keeps a stick in the fridge for this exact reason). Put some out on your next charcuterie board or sub it in for salami to spice up hoagies and grinders.Where do I get the best pepperoni?For the real primo stuff, talk to the butcher at your local Italian grocer or deli about house-made sausages. But if you can’t find anything nearby, artisanal brands like Vermont Smoke & Cure and Citterio make great offerings available nationwide or for mail order.For most applications, however, Rito likes to keep it simple. “I think it’s a very nostalgic ingredient,” she says, “so I like to go for the most classic flavor possible.” That means reaching for grocery store and deli counter brands like Boar’s Head and Hormel, which are readily available nationwide and likely taste closest to the pepperoni of your childhood memories because they are the pepperoni of your childhood memories.The one caveat is that you should try to buy pepperoni in one piece, as a “stick” rather than in a bag. “When you get the presliced stuff, it’s already starting to oxidize,” says Rito, who prefers to buy the sausage with the casing intact. “That's how you're going to get the freshest flavor from the salami.” If you can’t find whole sticks of pepperoni in your grocery store’s fridges, Tacinelli suggests checking the deli counter, where you should be able to ask for a whole, half, or quarter stick.How can you make pepperoni cups?While wide and thin rounds of pepperoni will cover more surface area and give you a bit of pepperoni flavor in every bite, to generate pepperoni cups—the chewy, greasy bowls that are all the rage at spots like NYC’s Prince Street Pizza—you need smaller, fatter rounds.Getting the thickness right relies on a Goldilocks rule: Cut them too thin and the meat will stick to the cheese, but too thick and the edges will be too heavy to curl. According to J. Kenji López-Alt, you’ll want to use sausage with a natural or collagen casing that’s cut medium-thick—think 2–3 millimeters. It can take some practice though, so be ready to eat a lot of pepperoni while you learn. I know, poor you.Now about those mussels…Stuffed Mussels With Pepperoni RiceEven though we could devour every last one of these hearty stuffed mussels on our own, we recommend making this feast a group activity. View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-17", "author": ["Condé Nast", "Nico Avalle"]}