{"id": "c55479517ddbc96995424d616538acdd", "url": "https://www.bonappetit.com/recipe/low-commitment-wedding-soup", "year": 2018.0, "month": 4.0, "day": 4.0, "content": "Low-Commitment Wedding Soup Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesLow-Commitment Wedding SoupBy Claire SaffitzApril 24, 20184.7(74)Read ReviewsTriangleEmailPinterestPrintPhoto by Chelsie CraigEmailPinterestPrintEmailPinterestPrintThis recipe takes all the right shortcuts and none of the wrong ones. We doctor up sweet Italian sausage for the meatballs, opt for adding canned beans instead of boiling pasta in a separate pot, and still manage to make an uber-flavorful soup without having to call for boxed chicken stock. It's one-pot, one-bowl magic.All products featured on Bon Appétit are independently selected by our editors. However, when you buy something through the retail links below, we earn an affiliate commission.What you’ll needChevronChevronMeasuring Cups$18 At Bon Appétit MarketMeasuring Spoons$10 At Bon Appétit MarketChef's Knife$34.53 At AmazonMedium Bowl$17 At AmazonMicroplane$16 At AmazonPlate$55 At Bon Appétit MarketDutch Oven$80 At AmazonTongs$13 At AmazonCutting Board$10 At IKEAWooden Spoon$6 At AmazonColander$11 At AmazonSmall Saucepan$155 At AmazonBox Grater$13 At AmazonLadle$8 At AmazonIngredients8 servings1lb. sweet Italian sausage¾cup panko (Japanese breadcrumbs), divided6Tbsp. extra-virgin olive oil, divided8garlic cloves, dividedKosher salt1medium head of fennel with fronds2medium onions½tsp. crushed red pepper flakes½cup dry white wine14-oz. piece Parmesan with rind115-oz. can cannellini (white kidney) beans1small head of escarolePreparationStep 1Cut shallow slits in each sausage link, then remove sausage from casings; transfer sausage to a medium bowl. Add ½ cup panko, 2 Tbsp. oil, and 2 Tbsp. water. Peel and finely grate 1 garlic clove on a microplane into bowl. Season lightly with salt and mix with your hands until breadcrumbs are evenly distributed.Step 2Portion meat into small meatballs about 1\" in diameter (oil your hands to help with rolling if mixture gets sticky) and transfer to a plate.Step 3Heat 2 Tbsp. oil in a Dutch oven over medium. Add meatballs, spacing evenly apart, and cook undisturbed until first side is dark brown, about 5 minutes. Using tongs, turn meatballs and cook until other side is also well browned, about 4 minutes. Transfer back to plate and set aside.Step 4Remove pot from heat and prep the rest of the soup ingredients: First, remove fennel fronds from 1 head of fennel and save for garnishing the soup. Cut fennel head in half lengthwise. Cut a V-shaped notch in each half to remove the core. Place halves cut side down, then thinly slice crosswise.Step 5Peel and trim 2 onions. Cut in half lengthwise and coarsely chop.Step 6Smash 6 garlic cloves (keep remaining clove for the end) and peel.Step 7Place Dutch oven back over medium heat and add fennel, onion, and smashed garlic; season with salt and ½ tsp. red pepper flakes. Cook, stirring occasionally, until vegetables are golden brown and softened, 6–8 minutes.Step 8Stir in ½ cup wine and scrape bottom to dissolve any remaining stuck-on browned bits.Step 9Add 8 cups water; season generously with salt. Slice down along Parmesan rind to remove and add to soup; set cheese aside.Step 10Bring to a simmer, then reduce to a gentle simmer. Cook uncovered until broth is golden and flavorful, 25–30 minutes. Season with more salt if needed.Step 11Open 15-oz. can beans and pour into a strainer or small colander. Rinse beans and shake to remove excess water, then transfer to pot along with meatballs. Bring back to a simmer and cook, stirring occasionally, until broth is slightly thickened from beans and meatballs are cooked and have released some of their flavor into the broth, 10–15 minutes.Step 12While soup is simmering, separate leaves from 1 head of escarole and rinse to remove any dirt. Tear into small pieces, then stir into soup in batches to wilt. Remove soup from heat.Step 13Heat remaining 2 Tbsp. oil in a small saucepan over medium. Finely grate remaining 1 garlic clove into skillet. Add remaining ¼ cup panko. Season with salt and cook, stirring often, until panko is golden, about 4 minutes. Remove from heat.Step 14Prepare your other garnishes: Finely grate about ½ cup cheese from reserved hunk of Parmesan (you might not need it all). Finely chop fennel fronds.Step 15Taste soup and season with salt if needed. Ladle soup into bowls and top with chopped fronds, grated cheese, and toasted panko.How would you rate Low-Commitment Wedding Soup?Leave a ReviewTell us what you thinkReviews (34)Back to TopTriangleIt annoys me when people are like, \"This was great. Here are the changes I made that completely altered the recipe so that I'm not even eating what you're eating,\" but here I am, having done just that. I noticed people complaining about the wan flavor in previous comments, and I know just adding salt to water doesn't make water taste like anything other than salty water, so I replaced three cups of the water with unsalted, homemade vegetable broth. I'll probably just completely replace the water with that broth next time. I did vigorously salt the water, but perhaps maybe a little too much, so I'll be more careful with that next time. Also, I'm on food stamps, so I can't use wine. I substituted a quarter cup of champagne vinegar with a quarter cup of water for the white wine. I didn't have onions, so I used leeks. I also cooked it in a pressure cooker and used pre-ground sausage instead of links. I thought the meatballs were a little too springy, so I'll probably mix in a pound of turkey next time so I can also get more meatballs. Oh, lastly, I browned the meatballs in a mixture of butter and avocado oil but I drained most of that off when I browned the veggies. PossumPortland, OR3/2/2022I have to admit that I laughed when I read the title of this recipe!  Low-Commitment Wedding Soup?  Is that a commentary on the likelihood of a successful marriage?  But, whatever the chances for a happy marriage, this is a good, easy soup recipe.  It does need extra salt, as others have noted.LG damsBrainerd, MN2/2/2022This soup is fantastic! It will become a staple in our recipe go-tos. Anyone complaining about the broth not being flavorful didn't add enough salt - it's essentially a vegetable broth, and needs to be heavily salted. Doesn't taste right? Add another pinch until it does. A few additional things: we made it gluten free by subbing the meatball panko ingredient for equal parts almond flour. We like things a little spicy, so we also used hot italian sausage, which yielded still a mild heat. I did a lot of skimming off the top throughout the cooking process - foam but also an orange film. Last, I added a bit of gelatin; when I don't cook with bones I like to do this because it adds a hard-to-describe mouth feel that makes the soup surprisingly...just better.erikaaustin, TX1/17/2022So good. Used Italian chicken sausage, an extra can of beans, and a TON of kale instead of escarole. So tasty. AnonymousSan Francisco, CA12/11/2021This is neither low-commitment, nor \"uber-flavorful\". The broth alone takes 30 minutes to simmer, and after following the recipe exactly, I still only ended up with vaguely salty-spicy water, rather than a decent broth.BronwynVancouver, BC, Canada11/6/2021I'd give it five, but I did something out of character for me: I changed the recipe. I used my homemade chicken stock and water (I don't remember the quantities). I followed all other instructions. It is the perfect soup for a three-course winter lunch (a little amuse bouche while the soup is heating, soup for main, and fruit-based dessert. Your guests will go home satisfied ... and nap.AnonymousPhiladelphia, PA11/6/2021I have made this soup many times, I sometimes add carrots, and spinach .  I use chicken sausage, and no onions.  A pinch of red pepper flakes and I bit more parm rind.  This is only due to personal preference.  This soup is hearty and delish!   Anonymous0640910/30/2021Out. Of. This. World. I used my own meatball recipe - and chicken broth instead of water, but otherwise all the same. Oh, my gosh. So much flavor. Thank you! Molly H. Wake Forest, NC10/7/2021Yum! I keep the meatballs small to make them easier to eat with a spoon, use any chicken-stock I have on hand to sub some of the water, and double the beans. I've made this several times, it's a favorite for cool days!JSChicago, IL4/19/2021This is a great recipe. It took 20 minutes to prep and the rest was smooth sailing. I used radicchio instead of escarole and spicy sausage to add a little kick. I also had some chicken stock I used instead of all water. I will defiantly play around with this again. J BeansLA, CA3/7/2021Really nice soup! I also didn't have escarole (no do I really like wilted salad-y greens) and used spinach successfully.  Definitely adding this to the make-again pile.Melissa D.Philadelphia, PA2/1/2021Loved it! I made it with kale instead of escarole because it's what I had in the fridge. Also, I strained the fennel, onion, and garlic ( I also added some Aleppo pepper slices, about 1/2 a pepper- we like it spicy!) before I added in the meatballs, beans, and greens. PERFECTION. Shari NYC2/1/2021Loved it.  I did not have escarole available so I used spinach and it was great.  Super easy too.SybilDamascus, OR1/17/2021Loved it!  I veganised it by using beond meat sausage and it was devine.  I used Vegetable stock instead of water and substituted cheese with nutritional yeast.  Everyone enjoyed it. Natalya Washington DC 11/29/2020Made this soup tonight and it was a hit! I did 4 cups chicken broth/4 cups water instead of all water and when I make it again I will use all chicken broth, it definitely needs the flavor. I think I will also do a mix of ground pork and spicy italian sausage for the meatballs to give it a kick!AnonymousBrooklyn, NY10/14/2020Explore Bon AppétitSoupSoups and StewsItalianEuropeanSausageMeatEscaroleChicoryLeafy GreensVegetableWhite BeanBeanMainNut-FreeSimmerDinnerBasicallyRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-24", "author": ["Condé Nast", "Claire Saffitz"]}