{"id": "c55efa8da99bf87a5aabf42106902b90", "url": "https://www.bonappetit.com/story/pav-bhaji", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Pav Bhaji is My Ultimate Entertaining Secret | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingPav Bhaji is My Ultimate Entertaining SecretButtered buns, vegetable gravy, onions, and lime—who can resist the allure of a (vegetarian) Sloppy Joe?By Priya KrishnaDecember 12, 2018FacebookTwitterEmailPhoto by Chelsie Craig, Food Styling by Rhoda BooneFacebookTwitterEmailPriya Krishna’s cookbook Indian-ish, documenting her journey of learning to make the distinct, hybridized cuisine of her chic, extremely skilled-in-the-kitchen mom, Ritu, will be out from Houghton Mifflin Harcourt in April 2019. Follow her progress on Instagram @PKgourmet.We all have our party tricks. Mine is pav bhaji.These buttered buns topped with a spiced vegetable gravy, finely chopped red onions, and lime juice (think of it as a vegetarian sloppy joe) are that golden goose of an entertaining dish: It looks very impressive but takes little time to cook. It stands in for a complete meal, and it’s only one recipe. It satisfies a bunch of dietary restrictions. And, it can be mostly made ahead, while allowing for some guest participation (there’s nothing wrong with getting them to put in some work too). I can’t tell you how many times I’ve totally forgotten that I’d invited people over, whipped up pav bhaji (and only pav bhaji), and then been complimented as if I spent the whole day hovered over my stove.Though there are a lot of different versions of the dish out there—ones that use different spices and vegetables, and lots of butter (nothing wrong with that, obviously)—it is my aunt Sonia’s recipe, chock full of chunky veggies and spices you can really taste, that is the most deeply comforting to me. During my childhood, whenever my family would head to a dinner party at Sonia’s house, I’d secretly hope she was making her famous pav bhaji. She didn’t make it very often, so I’d always assumed it was something deeply time consuming and difficult—a special-occasion-only deal.So, when I asked Sonia for the recipe for my cookbook years later, I was surprised to find out that the whole thing came down to boiling a bunch of vegetables. Specifically: a handful of frozen peas and cauliflower florets, plus two Russet potatoes. Then you drain ’em. Peel and mash the potatoes (don’t sweat too much about lumps). Then, in a big pan over medium-high heat, add a tablespoon of olive oil, followed by ¾ teaspoon of ground turmeric, and a tablespoon of ground coriander. Throw in two chopped fresh Roma tomatoes, and stir until it becomes a chunky tomato sauce. Next, reduce the heat to medium-low, add your peas, cauliflower, potatoes, and a chopped green chile. Let that stew together for a few minutes. That’s your “bhaji.”Now, the “pav” part. Split eight buns of your choice in half. I like to use squishy, airy potato rolls, which are the best texture and resemble the traditional yeasted bun —plush, yet sturdy enough to hold up to all that gravy goodness. Butter each side. Toast ’em in a pan until golden brown. Have your guests—this will feed about four of them—assemble it all like open-faced sandwiches, with a spoonful of bhaji, plus finely chopped red onions and a squeeze of lime. Eat. Bask in all the flattery.After all these years, I now know that one my most nostalgia-inducing comforts was probably just Sonia’s party trick. It was likely the meal she’d make when she wanted to spend her evenings doing anything other than cooking—including liquoring up her guests and making fun of her husband, Sharad, whose jokes revolve entirely around puns.Pav bhaji was her little secret. And now, it’s mine!You can pre-order Priya’s upcoming cookbook Indian-ish on Amazon for $23. Woo hoo!Explore Bon AppétitIndianishVegetarianSandwichRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-12", "author": ["Condé Nast", "Priya Krishna"]}