{"id": "c566106d70db32ad38bbae43af0dccac", "url": "https://www.bonappetit.com/story/semolina-cake-is-great", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "This Semolina Cake Is Like the Early Setting Sun | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingThis Semolina Cake Is Like the Early Setting SunFood director Carla Lalli Music shares how this cake is \"citrus, spice, and everything nice\" in her weekly newsletter.By Carla Lalli MusicSeptember 13, 2018FacebookTwitterEmailBobbi LinFacebookTwitterEmailEvery Wednesday night, Bon Appétit food director Carla Lalli Music takes over our newsletter with a sleeper-hit recipe from the Test Kitchen vault. It gets better: If you sign up for our newsletter, you'll get this letter before everyone else.Sunset on summerFor some, fall’s first sighting of curled, browning, and desiccated leaves is a time of great joy. I’m not one of those people. My son peeks his head out of his teen-emo cave to happily refer to the colder, shorter days as “hoodie season.” If you follow a lot of food people on Instagram, you’ve recently seen posts from comrades on the west coast who are excited about pink-fleshed apples, and others baking Italian plums into buttery cakes. Maybe those people are sick of summer or maybe they’re cold-blooded animals to start with, but the fact is, we all eventually have to come to grips with Summer’s Bittersweet Demise.Want this letter before it hits the website? Sign up for our newsletter!Usually, I fight the coming wave of darkness. I buy flats of tomatoes and make giant batches of sauce for the freezer. I talk crap about the new-crop apples that everyone’s in a frenzy over, and throw a backyard grilling party instead. But this year, I’m going to try to embrace the golden hour that’s upon us by making Andy Baraghani’s very simple, very beautiful cake that has always reminded me of a big, fat, gorgeous sunset. This cake gets its sunny flavor from citrus, cardamom, and bay leaf, richness from yogurt in the batter, and its orange hue from semolina, which is a coarse version of the same wheat flour used to make pasta. Its flavor is mild, but the texture it gives the cake is unmistakable and worth seeking out (check a Middle Eastern grocer or a well-stocked bulk bin aisle). Even when baked, the semolina keeps its crunch, and gives the outside of this cake a sturdy crust, reminding me of the brittle dry wind that will soon be whipping through my nostrils and causing my knuckles to crack open.Cut into the cake though, and there is a moist dense crumb within, imbued with flavor from the bay leaf simple syrup that’s poured over the top when it comes out of the oven, and then left to soak in while it cools. The sweet citrusy flavor reminds me of a Creamsicle, and the warm, slightly sticky texture reminds me of the insane humidity of New York City in August.I hear you out there, questioning the sanity of a woman recommending a citrus cake in the middle of the fall harvest when there’s late-season stone fruit still available, fat figs around the corner, and—yes—fresh-picked apples at the market. I’d rather just rip the Band-Aid off this whole transition and go straight to winter, okay? Sue me.I’m not good with change, in general, and I’m really not good with any kind of change that is followed by five long months of root vegetables, because that’s what’s coming after this brief fall harvest hoo-ha. I’m trying to not mourn summer. I want to honor it with an extended sunset, in cake form. After all, I may or may not have bought some 2018-season apples myself this weekend, and it’s possible I made a giant pot of bean soup, too. Might as well get this over with.Get the recipe:Semolina Cake with OrangesExplore Bon AppétitCarla NewsletterRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-13", "author": ["Condé Nast", "Carla Lalli Music"]}