{"id": "c57fc98630f748f8fb0f886397f5b150", "url": "https://www.bonappetit.com/recipe/trail-mix-cookies", "year": 2020.0, "month": 4.0, "day": 2.0, "content": "Trail Mix Cookies Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesMay 2020 IssueTrail Mix CookiesBy Sohla El-WayllyApril 14, 20204.6(73)Read ReviewsTriangleEmailPinterestPrintPhotograph by Laura Murray. Food Styling by Yekaterina BoytsovaEmailPinterestPrintEmailPinterestPrintThese cookies are inspired by the most trusted human energy source: trail mix. They’re crammed with toasted nuts (such as walnuts, pecan, cashews), dried fruit (like apricots, raisins, and tart cherries), hearty oats, and chocolate.IngredientsMakes twelve 3\" cookies1½cups assorted raw nuts and seeds½cup (60 g) old-fashioned oats1large egg4Tbsp. unsalted butter, melted¼cup (packed; 50 g) dark brown sugar2Tbsp. (25 g) granulated sugar1½tsp. vanilla extract1tsp. kosher salt½tsp. baking soda¾cup assorted dried fruit (cut into ½\" pieces if large)¾cup chopped bittersweet chocolate bars or chips or disks½cup (63 g) all-purpose flourPreparationStep 1Place racks in upper and lower thirds of oven; preheat to 350°. Toast nuts and seeds and oats on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Transfer to a medium bowl; let cool.Step 2Meanwhile, mix egg, butter, brown sugar, granulated sugar, vanilla, salt, and baking soda in a large bowl; let sit until nuts are cool (this will make for a chewier cookie).Step 3Add dried fruit and chocolate to nut mixture; toss to combine. Give egg mixture a good stir, then stir in flour. Mix in nut mixture, smashing it against the sides of the bowl with a rubber spatula, until combined and mix-ins are evenly coated in dough. (It will look like too many mix-ins, but dough will come together as it chills.) Cover and chill at least 2 hours and up to 3 days.Step 4Reheat oven to 350°. Using a ⅓-cup measure or #16 cookie scoop, portion out dough, packing firmly, to make 12 cookies. Divide between 2 parchment-lined baking sheets as you go. Using measuring cup or your hand, press cookies into 2½\"-diameter disks about ¾\" thick; sprinkle with sea salt.Step 5Bake cookies, rotating baking sheets top to bottom and front to back once, until golden brown and no longer wet-looking, 11–13 minutes. Let cool on baking sheets.Step 6Do Ahead: Cookies can be made 1 week ahead. Store airtight at room temperature.How would you rate Trail Mix Cookies?Leave a ReviewTell us what you thinkReviews (42)Back to TopTriangleI have made these cookies over and over again. My family loves these! I use this recipe as a pantry clean out recipe. This time I used golden raisins, apricots, walnuts, almonds, sunflower seeds and shredded coconut. These are awesome, we eat them as a late night snack or a quick breakfast. They last a few days in an airtight container too.Charlize CantuChicago 3/8/2022These are so delicious. I used sunflower seeds, pistachios, pecans, hazel nuts, dried figs and 85% chocolate... I subbed half the flour for ww and also sprinkled sweetened coconut and turbinado on top. \n\nAlso, I made a double batch and spread it out on a silpat lined baking sheet to make squares cause I didn't feel like taking the time to scoop. \n\nSohla you never disappoint, you are my kind of chef. The wing it and enjoy kind.EricaCampbell, ca9/16/2021Been eyeballing this recipe for a while and I'm so glad I've finally made it. \n\nI was pretty skeptical looking at the dough, but it spread perfectly. I used cashews, dried papaya, pineapple, coconut, and dates, plus choco :) Also subbed turbinado sugar plus a little honey as I didn't have granulated or 'traditional' brown. JenNew York8/28/2021Fantastic recipe! I love how absolutely packed with oats, nuts, fruit, and chocolate it is! I'm really glad that the note about it seeming like there are too many add-ins was included because I was fearful of how chunky the mixture looked. Luckily it came out perfect and I've re-made this recipe several times over by now. The tip about pushing it against the side of the bowl to get it all covered in the actual cookie dough is also very helpful and key for me. AmandaToronto, ON7/20/2021Not sure what I did wrong here, but I ended up with more of a granola with soft nuts then any sort of cookie. Family loved it, but differently not what I pictured packing for our camping trip. Jess SellersChicago, IL6/25/2021Perfect.  Just.Perfect. I have searched high and low for some time for a cookie recipe like this. Other cookie recipes that incorporate oats add sooo much butter and so much sugar. This one met all my standards as far as ingredients and taste, and it really does taste like trail mix with all the saltiness typical of a trail mix. I did not add the extra salt to the cookies called for in Step 4, and I'm glad I left it out. The cookie batter itself had a good salt ratio, and I think that if the salt was halved or omitted, the cookie would still be delicious (and healthier).Phyllis CAtlanta, GA2/20/2021Must eat after they cool for best flavor, in my opinion. Making them again with pecans, cashews, cherries, pineapple and mango. Delicious!!AnonymousPage, AZ2/3/2021Made these as a clean-out-the-pantry recipe for an upcoming move. Pretty sure they’d be amazing with any combo. I only had 1/2c of dried fruit so I added 1/4c of shredded coconut. Good choice. Nuts and seeds were sesame, pumpkin, pistachio, and slivered almonds. Everything went together so well with the apricots and golden raisins I had. Seriously though, I think it would work with almost any combination you have on hand. AlexSeattle, WA1/24/2021WOW!! there are soooo good! I substituted the butter for coconut butter and used spelt flour and some leftover almond pulp that I had!\nI used sesame seeds, cashews, almonds, sunflower seeds and pecans. The fruits were raisins and apricots.\nwill be doing this recipe again and again!zeniaDubai1/14/2021These are really tasty, but next time I make them I'll probably only add 1/2 tsp of salt instead of a whole tsp. They're delicious and I like that they're salty like real trailmix, but I may edit down a bit anyway just so it's a bit less intense. Thanks for another great recipe :) AnonymousMaine10/14/2020These are so good! I made them 3 times the same week I found the recipe. I like mixing different ingredients. They are really nice with some lemon zest too. Thank you Solha!_ellaNorth Carolina8/1/2020I have made this recipe several times already, these are SO good. My partner is gluten-free and these work equally well with GF flour.AnonymousVancouver, Canada6/13/2020So good and I think if it as a feel good cookie because it’s full of protein and fruit.  I used apricots (which were amazing because they’re soft and gooey), mango, golden raisins, 1/2 walnuts, 1/2 cashews, a few peanuts.  I toasted the oats with my nuts because I thought that’s what I called for.  I did everything it called for, chilled overnight and they turned out great!  I took them as a power snack for protesting but I imagine they’re great for hiking and everything else - including breakfast cookie.  TootsalotHonolulu, HI6/7/2020SO DELICIOUS! I used a combo of pistachios, walnuts, pecans, and cashews with a combo of dried cherries, golden raisins, and dried apricots along with dark chocolate chips. They turned out fantastic and it was a great way to use up leftover pantry items. Definitely making these again!AnonymousCincinnati6/4/2020Really tasty. Went with slightly fewer chocolate chips. Worked out perfectly too. AnonymousEngland6/4/2020Explore Bon AppétitCookieDessertAmericanOatRice & GrainsChocolateOther IngredientsCashewNutWalnutPecanRaisinDried FruitFruitDried ApricotDried CherrySnackHealthyishBakingBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-14", "author": ["Condé Nast", "Sohla El-Waylly"]}