{"id": "c58474feeb36cf9142292dab35031583", "url": "https://www.bonappetit.com/story/cbd-tincture", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "This CBD Tincture Makes Me Super Productive… In a Chill Way | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopshoppingThis CBD Tincture Makes Me Super Productive… In a Chill WayCordial Organics CBD tincture is for getting stuff done without feeling like the Energizer Bunny.By Martine ThompsonApril 12, 2018FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailIn this special time that some have christened the “Cannabis Renaissance,” the non-psychoactive compound found in marijuana known as cannabidiol (CBD) has become something of a wellness darling. These days, we’re privy to a range of balms, oils, supplements, and infused foods that can seamlessly integrate cannabis into our lives. So, naturally, when I came across Cordial Organics’ CBD tincture “Balance” in a luxury cannabis subscription box, I was intrigued. How much relaxation could be had without the typical weed high, I wondered, as I took the recommended one—okay, a few more drops than one, I’m bad at moderation—under the tongue.Because this isn’t my first time at the cannabis-infused rodeo, I braced myself for a foul taste similar to that of a hash brownie or THC tincture, but it never came. As the bottle promises, my tongue was met with mint, a hint of lemon, and nothing more. This was a pleasant surprise, and it turned out to be a big plus when it came to adding the blend to tea, coffee, and smoothies—the flavor completely blended in.In about 20 minutes, I started feeling the effects. Hmm, placebo? Nope! Though initially I had my doubts. There wasn’t a giant “Woah, I’m feeling it” moment, I just suddenly felt up to doing things that I typically wouldn’t: Like taking an afternoon snooze (I’ve never been a nap person), which ended up being the best rest I’d had all week. Then, the surprising part: When I woke up, I knocked out housework I usually had to coax myself into doing after avoiding it for days.Everything about the experience was enjoyably subtle. While a THC high would creep up and transport me to a hazy state, leaving me brimming with fits of laughter, deep thought, and munchies, the CBD offered something new. It dissolved tension in my body and distributed a tranquility perfect for a productive day at the office, doing errands, or relaxing at home.Cordial Organics was founded by Desi McKinnon, a graphic designer with a passion for herbalism, and Shelly Phegley, a business manager and mother of three who authored The Book of Questions for New Parents. What the company gets right, beyond its effective products and clean #aesthetic, is the community they’ve created for people to learn and experiment without the stoner culture stereotype attached. They have carved out a space via their blog for customers to better understand the workings of CBD, from recipes to a primer on how cannabinoids impact mood, appetite, sleep, and immune function. And if this tincture ($48) isn’t your jam, the San Diego-based company also offers CBD facial oils, lip balms, rose and lavender hydrosols, bath salts, and herbal tinctures for pets(!) through their website.For those who find it difficult to intentionally relax—my fellow kin who love soothing self-care rituals in theory but struggle with it in practice; those who carry an unreasonable amount of tension in their neck and back from stress; and those whose bodies feel worn down from being overly active or intensely inactive over the years—the tincture is a good product to have in your wellness arsenal. It’s likely what you’ll grab on a random day, or even daily, when you’re looking to decompress with a clear head and ample energy. [Jenna from Lady Bird voice] Let’s CBD it up!Okay, before we all go ahead and CBD it up, consider consulting a medical practitioner and double-checking marijuana prohibition in your area. While CBD products are generally not known to produce negative side effects, everyone’s experience is unique. To learn more about how CBD works, check out this primer.Buy Cordial Organics \"Balance\" CBD Tincture, $48Explore Bon AppétitHealthyishMarijuanaCannabisShoppingRead MoreshoppingThe CBD Oil That's Giving Me a Better Night's SleepBy Christine MuhlkeRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-12", "author": ["Condé Nast", "Martine Thompson"]}