{"id": "c589a43f002c3fbf3c539260d54e8316", "url": "https://www.bonappetit.com/story/miso-questions-answered", "year": 2019.0, "month": 4.0, "day": 5.0, "content": "Your Most Pressing Miso Questions, Answered | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingYour Most Pressing Miso Questions, AnsweredEverything you need to know about buying, storing, and cooking with this pantry staple.By Sarah JampelApril 29, 2019FacebookTwitterEmailPhoto by Alex Lau, Food Styling by Lauren StanekFacebookTwitterEmailOkay, you’re onto us: You’ve noticed miso in a whole gamut of BA recipes, from noodles and salad to PB&J and sweet potato pie, and you’ve suspected that something is up. So yes, we’ll admit it: We add miso to nearly...everything. But for good reason! Miso, a fermented mixture of beans and grains that has been a fundamental ingredient in Japan for millennia, is salty, earthy, funky, and/or sweet—depending on the type you choose. But before we get to all that, let’s slow down and review some miso 101.First, how is miso made?The standard base comes from soybeans, but other cooked legumes work too. Those legumes are fermented with koji, which are grains—like rice, barley, or millet—inoculated with the mold Aspergillus oryzae. From there, all it takes is time.There are so many different kinds. How do I know what to buy?There are countless varieties of this Japanese fermented soybean paste, but generally deeper color = bolder flavor. Look for unpasteurized organic miso from small local producers and avoid stabilizers, alcohol, or other additives like MSG. The only ingredients should be soybeans, koji, grains, salt, and water.This miso pesto recipe is a real BA favorite.\nPhoto by Alex LauBut wait, I’m still overwhelmed.The shorthand way to comprehend the wide world of miso is to divide it into two major camps. Light miso (like shiro miso, for example) is pale in color, with a relatively short fermentation time; it’s sweet and mellow and great for dressings, glazes, and baking projects. Dark miso (like aka miso) has a longer fermentation time and higher salt content, making it punchier, richer, and more intense; use in hearty stews and braises.South River Miso has a bunch of different kinds, all fermented for varying lengths of time.\nPhoto by Chelsie CraigDo you have a favorite kind?We love South River Miso Co.’s small-batch miso, hand-crafted in Masachussetts the Japanese tradition. Read more about it here! Buy it: $11–$17 for 16 oz. on southrivermiso.com.Where do I store it?Miso will keep indefinitely in the fridge: Store in an airtight container, like the one it came in, with a piece of parchment paper or plastic wrap pressed against the surface.What do I do with it?You can use a dollop to amp up marinades, pestos, salad dressings, stir fries, mayo, or vegetable stock.Yep, there’s miso in there.\nPHOTO BY CHELSEA KYLE, FOOD STYLING BY FRANCES BOSWELLDo you have a salad dressing with miso you love?Purée 6 Tbsp. fresh lemon juice, 6 Tbsp. tahini, 1⁄4 cup extra-virgin olive oil, 2 Tbsp. white or yellow miso, 2 tsp. maple syrup, 11⁄2 tsp. onion powder, 1⁄2 tsp. garlic powder, and 1⁄2 cup water in a blender until smooth. Season with salt and pepper.Any other ideas?Salty, earthy, bitter, and toasty—miso is a perfect complement to brown butter, nuts, and caramel. We’ve worked it into blondies, cobblers, almond-butter cookies, and even doughnuts.Explore Bon AppétitMisoRead MorecookingAll of Your Canned Tomato Questions, AnsweredBy Sarah JampelcookingYour Most Pressing Maple Syrup Questions, AnsweredBy Sarah JampelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-04-29", "author": ["Condé Nast", "Sarah Jampel"]}