{"id": "c59fc317bd0f62d1517d864e296cbc32", "url": "https://www.bonappetit.com/story/middle-child-philadelphia-shirt", "year": 2019.0, "month": 11.0, "day": 1.0, "content": "This Restaurant Merch Makes Me Hungry | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsThis Restaurant Merch Makes Me HungryJust wearing this T-shirt reminds me of all the amazing sandwiches at Middle Child.By Alex DelanyNovember 5, 2019FacebookTwitterEmailPhoto by Alex LauFacebookTwitterEmailThis is Highly Recommend, a column dedicated to our very opinionated editors’ favorite things to eat, drink, and buy.There’s restaurant merch you’d like to have. And there’s restaurant merch you need to have. For me, everything at Philadelphia’s premier sandwich shop Middle Child falls in the latter category, starting with this rad T-shirt. Chef and co-owner Matt Cahn tapped local artist Eric Kenney, who goes by the name Heavy Slime, for the illustration and Press & Release Printing to make it.The shirt ($30) is sold only at the shop, and it’s as essential as a sandwich order. (We also like their tote!) That’s because wearing it is a declaration that you’re in on the fact that such a place exists, where the sandwiches are always of the highest quality (short rib corned beef Reuben!) and lunches are never depressing. Plus, there’s a cute, recognizable little smiley face, both on the front and the back, which will elicit a Go Birds! from any in-the-know Philly native. Wear it proudly.Go there: Middle ChildExplore Bon AppétitHighly RecommendRestaurantsPhiladelphiaShoppingRead MorecultureWhat Does Your Restaurant Tote Say About You?By Alex DelanycultureThe Hottest New Streetwear Brand Is Actually a RestaurantBy Emilia PetrarcaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-11-05", "author": ["Condé Nast", "Alex Delany"]}