{"id": "c5a50d6d863eefa0b4d1d4a4e7d0a3c1", "url": "https://www.bonappetit.com/story/dumpling-cooking-methods", "year": 2021.0, "month": 4.0, "day": 2.0, "content": "How to Cook Dumplings - How to Steam, Fry, and Boil Fresh Dumplings and Frozen Dumplings  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingSteam, Boil, Fry: The Many Ways to Cook a Dumpling ExplainedPick your mood—chewy, crispy, soupy, fancy—then pick your method.By Hetty McKinnonApril 11, 2021FacebookTwitterEmailPhoto by Isa Zapata, Food Styling by Pearl JonesFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Before you even start making your dumplings, first think about how you want to cook them. There are three basic ways: steaming, boiling, and steam-frying. There is also deep-frying or serving with a crispy lacy “skirt.”While the cooking method depends heavily upon your mood and what you are craving, it also depends on the shape of your dumpling. Some methods of cooking hinge on certain dumpling qualities, such as iron-clad seals to prevent bursting (boiling), flat bottoms that offer surface space to crisp up (pan-fried potstickers), or thicker skins to withstand the pressures of boiling.The following instructions are the same for fresh or frozen dumplings. Generally, I find that store-bought frozen dumplings are better suited to steaming and steam-frying, as their skins are often quite thin—make sure to check packet instructions to check the preferred cooking methods. Importantly, when cooking frozen dumplings (store-bought or homemade), do not defrost, so always cook them from frozen.SteamingSteaming will produce silky, tender dumplings with skin that is slightly firmer than that of boiled dumplings, but still stretchy. If you are making your own dumpling wrappers, use the hot water dough for this method, as this will give you a softer morsel. Find a bamboo or other basket steamer that fits over a saucepan, pot, or wok. My preferred vessel is a bamboo steamer—they are cheap to purchase and hold a good number of dumplings. The smell of dumplings steaming in bamboo is very nostalgic to me.Line the steaming vessel with parchment paper or Napa cabbage leaves. If you are using parchment paper, poke a few holes in it to let the steam through. Fill your pan or pot with water that is about 1 inch deep and bring to a boil. Place the steaming vessel over the boiling water, cover, and steam for about 10–15 minutes (this depends upon what you have inside—if you have raw ingredients like meat, steam for longer, whereas cooked ingredients will take less time). If you are using store-bought wrappers, the skin will become slightly transparent and you’ll be able to see the colors of the filling inside. Homemade wrappers won’t become transparent, but they will look plump and puffed.BoilingBoiled dumplings are wonderful served on their own with chile oil/crisp or black vinegar, or as part of a dumpling noodle soup. Wontons, for example, are the quintessential boiled dumpling. Growing up, my mother’s goldfish-shaped wontons were always made with the signature yellow-hued store-bought wrappers which are now sometimes sold as “Hong Kong Style Wonton Wrapper.”Of all the cooking methods, boiling applies the most pressure to the dumpling, which can cause them to burst and disintegrate in the water. I have personally experienced much dumpling loss. Most store-bought dumpling wrappers should hold up to boiling but they are delicate, so tread carefully. The key is to expel as much air as possible—after spooning the filling onto the wrapper and folding it over to seal, press out any extra air around the filling.Reducing the cooking temperature slightly can help too—the dumplings should be gently boiled rather than tossed around aggressively.If you are making homemade wrappers for boiled dumplings, use cold water (water straight from the tap is fine) as this will give you a thicker skin that’s more suitable for the pressures of boiling.Frozen dumplings can usually be boiled, but check packet instructions to make sure they are robust enough for this cooking method.Steam-frying (potsticker method)Steam-frying, or the potsticker method, is employed for dumplings like gyoza and gow gee (also known as jiaozi or guo tie). The dumplings are seared on their base to create a golden, crispy bottom, and then water is added, and they are covered to steam through. When the water evaporates, lift the lid and let them cook a moment longer. This method of double-frying is what gives potstickers their signature crispy crust.Most recipes will ask you to use a nonstick pan for steam-frying, as the dumplings have a tendency to stick. When you are starting out, this is definitely a good idea, but I most often use my well-seasoned cast-iron pan or my stainless steel skillet. The key is to heat your pan, especially if it’s stainless steel or cast iron, until it’s smoking (like, you can literally see the smoke coming off it) before adding the oil.To steam-fry, heat a large frying pan over medium-high and, when hot, drizzle with vegetable oil. Working in batches, add the dumplings, flat-side down, and cook until the bottoms of the dumplings are lightly browned—this should take 1–2 minutes (if there is too much heat, reduce to medium). Take care with this next step, as the water will bubble and splutter vigorously. It’s best to have your lid ready: Immediately add about 3 tablespoons of water to the pan, just enough to cover the base of the dumplings, then cover and cook for 3–4 minutes, or until the water has evaporated. Lift the lid and allow the dumpling to cook for another 30 seconds, to allow the bottoms to get extra crispy.Frozen dumplings are perfect for potstickers.Feeling fancy? Add a lacy skirtTo add a touch of fancy to your dumplings, add a crispy, lacy skirt. This is a simple process where the water that is normally added to steam potstickers is replaced by a cornstarch slurry. A nonstick pan is best for this cooking method.The most stylish skirt of the season!\nPhoto and Food Styling by Sohla El-Waylly This slurry recipe makes enough for one skillet of dumplings, usually 10–12. In a measuring jug (a liquid measurer will provide you with the most control when pouring the slurry into the pan), add the ¼ cup water, 1 tsp. cornstarch, 1 tsp. flour, ¼ tsp. white or apple cider vinegar, a small pinch of salt, and whisk to combine.Heat a 10–12 inch nonstick skillet on medium-high. Get a lid ready. When hot, add 2 Tbsp. neutral oil and place your dumplings into the skillet, lining them up in a circular pattern around the pan, making sure they are not touching one another. Whisk the batter again and pour straight into the skillet, making sure to distribute the slurry evenly to fill all the gaps between the dumplings. Cover with a lid, reduce heat to medium, and cook 4–5 minutes to allow slurry to evaporate. Remove lid—there will likely be parts of the slurry that haven’t cooked yet and still look pale so move the pan around over the heat to cook until the entire base is golden. Turn off heat. Carefully place a plate over the frypan and flip the dumplings onto the plate. Lift the pan and the dumplings should release easily.Time to cook!Pea and Ricotta Potstickers With Homemade Dumpling WrappersMaking fresh dumpling wrappers isn't hard when you have Hetty McKinnon to guide you. (But we won't tell if you use store-bought.)View RecipeTo Asia, With Love$43 at AmazonPartially excerpted from TO ASIA, WITH LOVE by Hetty McKinnon. Copyright 2020 by Hetty McKinnon. Published by Prestel, an imprint of Penguin Random House. Reprinted with permission.Explore Bon AppétitHow-ToRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-04-11", "author": ["Condé Nast", "Hetty Mckinnon"]}