{"id": "c5b0090d3627f689cbf4ed6a5e870891", "url": "https://www.bonappetit.com/recipe/grain-free-tahini-granola", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Grain-Free Tahini Granola Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesGrain-Free Tahini GranolaBy Andy BaraghaniApril 11, 20184.6(49)Read ReviewsTriangleEmailPinterestPrintPhoto by Alex Lau, Food Styling by Andy Baraghani, Prop Styling by Emily EisenEmailPinterestPrintEmailPinterestPrintIf you’re missing the oats in this gluten-free, make-ahead granola, simply swap out 1 cup of the nuts for ¾ cup rolled oats, but we like the fact that it's grain-free.IngredientsMakes about 6 cups3cups mixed raw nuts, such as pistachios, pecans, walnuts, and/or almonds1cup unsweetened coconut flakes¼cup pure maple syrup¼cup tahini2Tbsp. extra-virgin olive oil1¼tsp. kosher salt½tsp. ground cardamom or cinnamonPreparationStep 1Preheat oven to 300°. Line a rimmed baking sheet with parchment paper or foil. Toss nuts and coconut in a large bowl. Whisk maple syrup, tahini, oil, salt, and cardamom in a medium bowl until combined. Pour tahini syrup over nut mixture and toss with a spatula until evenly coated. Scrape onto prepared sheet. Bake granola, tossing and rotating sheet from front to back every 10–15 minutes, until golden brown, 30–35 minutes total.Step 2Let cool on baking sheet (granola will crisp as it cools), about 20 minutes. Break into pieces before serving.Step 3Do Ahead: Granola can be made 2 weeks ahead. Store in an airtight container at room temperature.How would you rate Grain-Free Tahini Granola?Leave a ReviewTell us what you thinkReviews (19)Back to TopTriangleI've made this a few times and love it. It's pretty flexible and hands off! As long as you have 4 cups of nuts/oats/seeds, it works. I like swapping some of the nuts and coconut for oats and sesame seeds. If you use regular table/fine grain (not kosher, which is a larger grain, i.e. less concentrated salt, and what the recipe calls for) salt, I find 1 tsp works. I also mix the tahini, oil, and maple syrup in a measuring cup, then mix it with the nut/oat mixture right on the sheet pan to avoid having to wash a bowl. Will probably not bother pre-made granola anymore, since this is so easy and customizable!Lucy11/18/2021I love granola but have never made it before seeing this recipe. Granola to me means Irish oats so I did add 3/4 cup. Left my raw almonds whole and coarsely chopped the raw pecans…1 1/2 cups each. Right out of the oven, I tossed in a whole cup of golden raisins.  I thought the salt was just right. Next time I will try the suggestion of additional tahini and maple syrup. BebePasadena, CA6/9/2021My go to granola.  I make this every couple of weeks. I always add the oats and often throw in some dried cherries 5 minutes before I take it out of the oven. I have tried so many granola recipes I can’t even count and this is by far my fave! This is the granola I give for gifts, it’s a beautiful way to say “ I appreciate you”. JunebugFairfield CT6/6/2021Agreed- cut the salt in half. And seriously, Im a southerner so I like salt. Also agreed- skip the olive oil. Add extra tahini instead. I doubled the cinnamon to 1tsp + 1/2 tsp cardamom. Plus... added 1 tsp cayenne... why not?!? I just ordered some excellent Vermont Grade B maple syrup... which hints at spicy. So cayenne made sense to me. After stirring everything together, I also added extra 2 tbsps each of tahini and maple syrup. What a great flavor combo! Also, I threw on some dark choco chips after it came out of the oven. Mmm.AnonymousKnoxville TN2/15/2021I thought this was delicious, but with a few modifications. Since I have no problem with oats, instead of 3 cups of nuts, I did 2 cups of oats and 1 cup of chopped walnuts/almonds. Instead of tahini plus olive oil, I did 6 tbsps of tahini with no olive oil. These changes worked really well, and the flavor of tahini was still there after baking and cooling. I really liked the cardamom in here and it complements the tahini well. I love sweet/salty stuff but it was a still tad too salty with 1 1/4 tsp salt, so I'd recommend either cutting down the salt or adding more maple syrup to balance out the saltiness. AnonymousLos Angeles, CA2/14/2021I am having a hard time staying away from it. I made it as written (- the 1/4 teaspoon salt) with Almonds, pecans and oats. Then sprinkled a tiny bit of Morton’s fine sea salt flakes on as it cooled.  And oh my goodness is it delicious. This is going to be a problem in my house. Jenn McGeorgeSan Rafael, Ca2/4/2021Delicious! Because the nuts I was using were already salted, I just sprinkled some flaky sea salt on top before putting in the oven but otherwise omitted the salt. WIll be making this over and over. AnonymousSan Francisco, CA2/3/2021Loved this granola and will make it again - I added in some diced up crystallized ginger and it really added to the overall flavor.   I am interested that other people thought it was too salty, I thought it was just right!  I am not sure some people realize the saltiness of one type of Kosher salt to another.  Diamond Crystal is much less salty than Morton Kosher, so if using Morton's you need about 1/2 the amount.  Not all Kosher salt is created equal!TracyLos Angeles1/29/2021Inedibly bad.  In hindsight, I'm shocked at all the high rankings. I'm a salt fiend--love the stuff.  Bacon, pretzels, caviar you name it, I love salt, but the called-for amount completely ruined this snack/dish. I had made a double batch, foolishly trusting the reviews (and I have found that typical, BA reviews *can* be trusted), and I ended up actually throwing it out, wasting all those nuts, not to mention the Tahini and everything else.  I couldn't gag it down.  I'd thought, when I tasted it, \"well, I'll do something with it and eat it,\" but after forcing myself to nibble on it all night, I finally decided that life's too short. No wonder several people were on about adding chocolate chips--you'd definitely need something, anything, to cut down on that salty taste.  The batch didn't taste like some trendy, mixed-flavors sweet/salty treat; it tasted like someone got into the cooking sherry and as a result spilled the salt shaker into the mix.  \n\nAnd yes--I double-checked all my measurements 3x, so I didn't use too much.  When I read the comment from another reviewer about ADDING flaky sea salt when cooling--I just cannot fathom it. They'd be FAR saltier than potato chips. I wish I'd noted the review saying to cut the salt in half--I'd go so far to say, cut it by 75% and then TASTE the tahini mixture before adding more.  (ESPECIALLY if you replace 1c nuts with 3/4c oatmeal!)\n\nAs another reviewer mentioned, the tahini was completely lost once cooked.  Almost a waste to use it.   \n\nI honestly can't understand all the great reviews.  IF you make this, remember, start out with 25% of the salt and I'd cut it even more if you replace some of the nuts with oats.  Don't end up throwing out your batch as I did.  Clancy CatPhoenix AZ1/29/2021It's mixed nuts, not granola... let's call it what it is.cwebbSan Diego1/25/2021This stuff is dangerous! Gonna have to hide it from myself so I’ll stop nibbling at it. Definitely add chocolate chips as someone else suggested. I also went with some oatmeal otherwise to me it’s not granola enough. Excellent!SRSDenver1/23/2021Do yourself a favor: add semi-sweet chocolate chips/chunks the last 3-5 minutes of baking.  And sprinkle some flaky sea salt on the whole thing when cooling. You can thank me later.Los Angeles, CA7/13/2020Highly addictive, but that's been my experience with most granola recipes with toasty nuts and coconut flakes. The tahini was nice pre-bake and post-bake but I think it got lost when it cooled, but maybe because I left out the cinnamon or cardamom? Either way, make it!AnonymousSan Jose, CA6/6/2020I'm not sure I'd necessarily call this a granola considering it's more like flavored nuts that omit oats, but whatever works. It's straightforward and absolutely delicious and I don't need to give it a name  anyway to know I'll be making it again for sure. AnonymousCA6/13/2019This granola is part of my meal prep routine. So good on everything from overnight oats, to yogurt, to just a handful when you need a snack. I always add in some sesame and chia seeds. This granola is THE BEST.MashaMDenver, CO6/11/2019Explore Bon AppétitGranolaPistachioNutPecanWalnutAlmondCoconutFruitTahiniCondiments, Sauces & PastesEasyGluten-FreeDairy-FreeVeganVegetarianHealthyishRoastBreakfastRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-09", "author": ["Condé Nast", "Andy Baraghani"]}