{"id": "c5b51949c9a2c8bafbcf1b5faac0753b", "url": "https://www.bonappetit.com/story/sonia-chopra-looking-to-the-future", "year": 2020.0, "month": 8.0, "day": 4.0, "content": "Looking to the Future at Bon Appétit | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureLooking to the Future at Bon AppétitExecutive editor Sonia Chopra is excited for what's coming next.By Sonia ChopraAugust 24, 2020FacebookTwitterEmailFacebookTwitterEmailI’m new to Bon Appétit and Epicurious, and I know I’m coming to the brand in a time of monumental change. I am excited to be here, and I look forward to learning from and working with the team as we build a new future together.When I took my first job in food media in 2012, people in and outside of my company thought I couldn’t do my reporting and editing gigs because I didn’t eat meat. It is incredible to look back at the last decade and realize how far we’ve come as an industry and how significantly the way we talk about food culture has evolved.Across food media, people have fought hard to have these conversations in a meaningful way. We have battled a historically singular lens on food culture. We have had endless conversations around word choice, photo selection, and representation. We have asked ourselves and our peers who we are telling stories for, and if those stories are reflective of the way all Americans cook and eat. Making impactful change can feel slow and frustrating, and I know there is still a lot of work to do. But I also know things are changing.Photo by Laura MurrayFrom 2017 to 2019, Bon Appétit advisor Marcus Samuelsson and I worked on a television show together, Eater and PBS’s No Passport Required, hosted by Marcus. I bring up the show a lot because its very premise—that immigrant food is American food—is proof, one data point among many, that people are starting to talk about food more globally and more thoughtfully.What really excites me about Bon Appétit and Epicurious is the immense potential to have those conversations about food culture with depth and with nuance. The work the team has already been doing speaks to this: Yes, immigrant food is American food. The next generation of Indigenous food is American food as well. Black barbecue is too. So are red sauce Italian joints and taco spots across the nation.Today is my first day, so I know I still have a lot to learn. But I am committed to inclusion and equality in the content we create and among the staff that creates it. I am here to build a team that is empathetic, respectful, and open to being challenged; that is paid fairly for their contributions; that represents the audience we hope to serve. I am looking forward to getting involved with diversity and inclusion efforts across the company and to leading collaborative working groups inside BA.I am committed to doing the work. And I can’t wait to see how we grow together.Recipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-08-24", "author": ["Condé Nast", "Sonia Chopra"]}