{"id": "c5dbf5c4aa25e378e92ade4ea207ef22", "url": "https://www.bonappetit.com/story/ghetto-gastro-toaster", "year": 2021.0, "month": 1.0, "day": 1.0, "content": "If Magneto Were A Toaster, He Would Be This Ghetto Gastro Toaster | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureIf Magneto Were A Toaster, He Would Be This ToasterIt's got super villain vibes and makes fantastic toast. By MacKenzie Chung FeganJanuary 7, 2021FacebookTwitterEmailPhoto by Kelly Marshall, courtesy Williams SonomaFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.This is Highly Recommend, a column dedicated to what people in the food industry are obsessed with eating, drinking, and buying right now.The CRUXGG SATA 2-Slice Toaster can generate electromagnetic fields strong enough to withstand the force of nuclear blasts. It can manipulate the earth’s polarity, allowing it to defy gravity. It speaks multiple languages, can resist telepathic attacks, and commands an army of persecuted mutants who refuse to be treated like second-class citizens. It also toasts bread.Okay, only the last bit is accurate, but this toaster is undeniably the X-Men’s sympathetic nemesis Magneto in countertop appliance form. It’s part of a seven-piece kitchenware collection, a collaboration between the Bronx creative and culinary collective Ghetto Gastro, appliance brand Crux, and Williams Sonoma. All sport a black-and-red color scheme and look like futuristic, sentient robots. The MUSA Air Pro is a combo air fryer-pressure cooker that has 11 different settings and may also be a Sith Lord. The BRED bread maker can turn out two-pound loaves in under two hours and bears a remarkable resemblance to Robocop.While there are a few features that set the SATA toaster apart from the two-slice machine you already have—a bagel and a gluten-free setting, extra-wide slots—no one is buying this thing because it’s revolutionizing the toast sector. They’re buying it, yes, because it’s matte black and glows red and looks cool, but also because of what Gastro Ghetto stands for. Chefs Jon Gray, Lester Walker, and Pierre Serrao work at the intersection of activism, design, and community empowerment. They bill themselves as the “Black Power kitchen of tomorrow,” and they’re just as at home talking about the benefits of a mostly plant-based diet as they are about systems of oppression. Come for the merch drops and sexed up waffle irons, stay for the discourse about red-lining, the prison-industrial complex, and food as a liberatory tool.So maybe the CRUGXGG SATA toaster can’t levitate. But Ghetto Gastro is fighting to dismantle the systemic marginalization of an historically oppressed community, and if that’s not some classic Magneto behavior, I don’t know what is.CRUXGG SATA 2-Slice Toaster$45 $36 at TargetExplore Bon AppétitHighly RecommendToolsShoppingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-01-07", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}