{"id": "c5e757e81c8d3b16e85202a5b028249b", "url": "https://www.bonappetit.com/story/bedtime-koththamalli", "year": 2021.0, "month": 6.0, "day": 3.0, "content": "How My Parents' Koththamalli Recipe Soothes Me to Sleep | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingHow My Parents’ Herbal Cure-All Soothes Me to SleepI grew up drinking a Sri Lankan brew of coriander, ginger, and cinnamon. Here’s my take on it.By Zinara Rathnayake June 17, 2021FacebookTwitterEmailPhotograph by Emma FishmanFacebookTwitterEmailFood is medicine in my Sri Lankan home. My parents infused their love and care for me and my sister into the food they cooked. Thaththa, my father, plated spicy sambals to comfort us during drowsy, sluggish sick days. Amma, my mother, blended leafy greens with coconut milk and cooked rice for warm glasses of kola kenda, a traditional herbal gruel we enjoyed most mornings. But whenever I came back home from school after getting soaked in a monsoonal summer downpour, my parents—fearing that I might get ill—would without fail leave a mug full of koththamalli by my bedroom door. The hot herbal drink was their sworn answer to everything: the early signs of a common cold, sneezing, and weary, run-down bodies.This quintessentially Sri Lankan cure-all has its roots tied to the island’s Tamil community. When the pandemic began, most Sri Lankans I knew brewed koththamalli and gulped it down every morning and night to boost immunity. As for me, I was looking for a caffeine-free nighttime drink, which is how this humble home remedy of my childhood became my go-to soothing bedtime tea. For the past year, it has been calming me and lulling me to sleep—and helping me feel closer to my parents as I weather the pandemic in a lockdown 80 miles away, in Colombo, Sri Lanka’s capital.Koththamalli literally translates to “coriander,” but we use more than just coriander when brewing it. The most common recipes of koththamalli include anti-inflammatory herbs and spices like dried coriander seeds, ginger, black pepper, and cinnamon. My father also adds a few cloves of peeled garlic to help fight cold symptoms, though for my bedtime concoction I tend to skip that step.Whenever I was ill as a kid, I despised the slightly bitter taste of koththamalli. So my thaththa mixed spoonfuls of sugar into it (without telling my amma, of course), and sometimes brought me a chunk of kithul palm jaggery (harvested from kithul palm trees that grow abundantly in Sri Lanka’s low wetlands) to have with it. Now in my 20s, I’ve come to love koththamalli’s slight bitterness, but I can confidently endorse my thaththa’s sweetened version too.Here’s how I make bedtime koththamalli:Start by rinsing ¼ cup coriander seeds in a colander before roasting them in a dry frying pan over medium-low heat for about five minutes, until seeds are dark brown. For this step, my thaththa used a rustic clay plan placed over a hearth outside our kitchen. These days, in my Colombo kitchen, I use a nonstick pan over my gas burner.Put the dry-roasted coriander seeds in a saucepan with 1½ cups water, two 1-inch pieces of peeled ginger, and a cinnamon stick. My favorite is Ceylon cinnamon, or “true cinnamon,” that is locally grown in Sri Lanka. (I also tend to avoid Cassia cinnamon as some research shows that excess use of it can be harmful.) Stir well before covering with a lid and simmering over medium-low heat for 10 minutes. Strain out the aromatics, pour the hot water into a mug, and enjoy before bed—or whenever you’re feeling under the weather.I drink my koththamalli warm without sugar, but if you don’t like the bitter notes or have a sweet tooth, you can add some coconut palm sugar or nibble a piece of palm jaggery between sips. I love to drink a mug every day as a soothing herbal tea; as we used to say as children, “a koththamalli a day keeps the doctor away.”Now, when I sip koththamalli in my bone china mug before bed, it takes me back to my childhood when I complained to my father about the drink’s bitter taste. As the memories come flooding, I smile, drifting off into peaceful sleep.Explore Bon AppétitHealthyishTeaRead MoreMoon MilkRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-06-17", "author": ["Condé Nast", "Zinara Rathnayake"]}