{"id": "c5eb57136aba91379c357a9175f8f458", "url": "https://www.bonappetit.com/story/food-industry-pop-ups-covid-19", "year": 2020.0, "month": 11.0, "day": 2.0, "content": "Their Restaurants Shut Down. They Got Laid Off. But They All Kept Cooking Through Pop Ups. | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsTheir Restaurants Shut Down. They Got Laid Off. But They All Kept Cooking.In the wake of chaos and closures, food industry folks have found each other to do the thing they miss through a new wave of pop-ups.By Emily WilsonNovember 12, 2020FacebookTwitterEmailWinner in Brooklyn has been using its space to host pop-ups from chefs who are out of work and looking for something new.Photo by Laura MurrayFacebookTwitterEmailKevin Hockin closed down Collage Coffee, his L.A. coffee shop, on March 19. With a light blue marker, he scribbled “We will reopen at a time that is less full of pandemic” onto a piece of paper, taped it to the shop’s window, and headed home. Less than two weeks later, he was researching how to build a wood-fired oven to put in his backyard and texting his friend Irfan Zaidi, a musician and Roberta’s alum, about making pizza. With everything on pause, he couldn’t sit still. In May, Side Pie was born.They served big blistered pies with toppings ranging from pepperoni, basil, and ricotta to kale, mushrooms, red onion, lemon oil, and parm. Customers picked up their orders through a slot carved into Hockin’s fence. Sasha Piligian—most recently the pastry chef at Lou, an all-day café and natural wine bar in Nashville—joined in to create seasonal slab pies and malted chocolate chip cookies for dessert. The community responded with open arms and regular orders, save for a difficult neighbor whose complaints to the health department eventually shut down the operation. Luckily they were able to find a solution. Before COVID hit, Hockin had acquired a restaurant space near his home in Altadena with plans to open a pizzeria called Deodara’s. Now the Side Pie team has relocated there and will be operating out of a custom-built trailer outfitted with a pizza oven. It’s parked outside of what would’ve been—and still might become—Deodora’s.Side Pie is one of many examples of food industry folks not just pivoting but reimagining their careers. They are restaurant workers who felt constrained by the hierarchical structure of kitchens, bound by their paychecks, and lacking time and energy to pursue their own culinary ideas. When they were furloughed in mid-March or the pandemic eventually caused the restaurants they were working at to close, they were faced with a sudden freedom. And instead of waiting for restaurants to reopen and jobs to resurface, they chose to chart new paths. That meant heeding to creative impulses and cooking food that’s deeply personal, continuing to make people happy, and doing it all on their own terms—through a new wave of pop-ups.Instagram contentThis content can also be viewed on the site it originates from.When Revelry, a Korean restaurant in Portland, Oregon, closed in June on account of lost business, its head chef Diane Lam finally went all-in on Sunshine Noodles, a Cambodian noodle pop-up she started last year with her friend David Sigal. Her boss, Rachel Yang, was the one who encouraged her to start it in the first place—as a way to explore a distinctive version of Lam’s heritage, like Yang had with Korean food at Revelry. “Sunshine Noodles was a way for me to kind of reconcile the things I couldn't do at Revelry,” Lam says.Her signature dish at Sunshine Noodles is Phnom Penh egg noodles, which come with slices of pork, wontons, yu choy, and chives in a rich pork-based broth she dreamed up when she was a kid, bored with the typical instant ramen flavors. For her it’s not only a reflection of her childhood but her distinctly cheerful personality. These days Lam is working on Sunshine Noodles full-time out of Psychic Bar, and she feels like it’s the right restaurant for right now.After losing her job, Lam knew that she needed to find a way to make money, but she didn’t want to work for anybody. She was tired of doing things out of necessity as opposed to motivation, and with the pandemic still at large, she wanted to have control over who she was in contact with. So she started talking to chef friends, also out of work, who inspire her and that she trusts. “They were all disheartened, and were open and willing to do something new and different,” she says. So Lam is using Sunshine Noodles as an incubator, bringing in industry friends to collaborate with her and giving them space to stage their own pop-ups. She partnered with Colin Yoshimoto, the head chef at Thai restaurant Eem, on a tasting menu centered around his homemade ramen noodles. “It’s a way for me to push my friends to be creative,” she says, especially for someone like Yoshimoto. He is currently restricted to a “utility program” at Eem, which includes making dishes better suited to takeout and plating food for al fresco diners with plasticware, similar to what Lam was executing at Revelry.“Before everyone came to work for us, they were in this limbo state where they weren’t sure what everything would look like,” she says. “But here we’ve created a place for how we want to feel. We try to do things that are inviting and fun and bright, and try to live with the pandemic as opposed to having it affect us.”Instagram contentThis content can also be viewed on the site it originates from.“It's just infinitely better to cook for yourself and do what you want to do,” says Bilal Ali, one of the trio behind Broke Ass Cooks. He, along with his roommates and former cooks at Commis, Hoang Le and Keone Koki, started their pop-up out of their backyard in Oakland. The name refers to the financial necessity from which the project sprouted from; the trio was laid off from their jobs back in March.“We’re used to working 16-hour days, six days of the week,” Le says. “We’re pretty much like family.” They were itching to collaborate on a concept that would draw on their upbringings: Ali is Eritrean, Le is Vietnamese, and Koki is Peruvian. Through Broke Ass Cooks, they could finally make the food they want to make—homemade soy milk sweetened with cane sugar, Peruvian chicken with fried yucca and aji amarillo—and have fun while they’re at it. Part of what was important to them in starting this pop-up was showing how restaurant work doesn’t have to be hyper-serious and all-consuming. “You can still make high-quality food and enjoy your life,” Ali says. Broke Ass Cooks began creating TikTok-style videos to share their story as three cooks trying to survive in a crumbling industry while paving their own way for a more sustainable future in restaurants.With diminished prospects for work and little money to their names, operating the pop-up illegally out of their home seemed the only feasible way to kickstart Broke Ass Cooks. But it was also a way for them to get involved in the politics of what it will take for the industry to survive—including the legalization of laws like AB-626, which allows cooks to produce and sell food from their homes, in California and beyond. “We have fear every day when we do this that we can get shut down at any moment,” Le says. “And if that happens, what do we have? Because the restaurant industry is in shambles. We’re trying to make sure the industry survives in whatever new form it's going to take on. That’s what we’re trying to figure out.”In September, Broke Ass Cooks got shut down by the health department. Since then, Ali and Koki have rebooted the pop-up to operate out of Berkeley’s Hidden Cafe under a new name: Michoz. (Le is no longer part of the project.) “We’re just trying to survive,” Koki says in a video they posted to announce the shutdown. “That’s what we do. We’re cooks.”Instagram contentThis content can also be viewed on the site it originates from.Even existing restaurants are embracing this spirit of collaboration, not just to stimulate creativity and connection in the era of social distancing but to pay it forward. “As a young cook, I never had the privilege or luxury to cook food of my own for guests,” says chef Daniel Eddy. He opened Winner, a café and bakery in Brooklyn, just days before restaurants and bars were forced to shutter all dine-in operations in mid-March. Since then he has been inviting out-of-work cooks to craft weekly set meals out of his space.“I kept getting phone calls from friends saying, ‘Hey, is there any way that I can help? I don’t know what to do, I’ve been stuck at home losing my mind,’” he recalls. Eddy was already planning to offer an affordable, ever-changing dinner option for families in the neighborhood, so he decided to introduce it as “Friends & Family Meal” featuring guest chefs like Amy Yi, who used it as a launching pad for her doshirak company, and Yara Herrara, a former Momofuku Ko cook who paid homage to her Mexican heritage with bass aguachile and potato-stuffed taquitos.The majority of the chefs who have guest-cooked at Winner weren’t friends of Eddy’s beforehand, but since the restaurant industry is one big interconnected web, there’s always at least one friend of a friend that can vouch for someone, which is enough for him. The only parameter he gives is that they put together a meal that they’d cook for their friends and family. How each chef wants to use the opportunity—whether it be as a testing ground for a new project or simply a way to flex their kitchen muscles—is up to them. “It was the first time where I felt like I actually had a chance to cook my personal recipes and I didn't have to ask permission if that was okay,” says Herrera. “And the turnout was surprisingly really, really good.” The experience led her to move towards doing her own thing, instead of jumping back into another restaurant environment where you’re required to “become the place yourself.” That means picking up private chef gigs here and there, and thinking about what comes next. “I wouldn't say I'm ready to open my own restaurant, but maybe a food stand or a residency at a pop-up, something like that,” she says.Pop-ups like this have become a radical way to challenge the status quo of restaurants, in which chefs are told to pay their dues “I cooked for almost a decade before I actually put a dish on the menu and saw how the ideas I had in my mind were going to be received,” Eddy says. “I think that’s a very old-school, antiquated way of doing things.” The mass lay-offs of restaurant workers triggered by the pandemic has seemingly leveled the playing field, according to these chefs. “There are really no rules, no matter what level of cooking you were at, everyone had to reset and rethink,” Herrara says. Yi agrees. “It feels like the wild, wild west—everyone is finding any other way they can make food, and it’s going as far as being a lunch lady, working in a dark kitchen, or at their house. It feels like the tech boom, where there are so many options, and given that COVID has made restaurants a really insecure option, we’re just seeing what else exists.”Instagram contentThis content can also be viewed on the site it originates from.Eight months into the pandemic, many restaurants are hanging on by a thread hoping for more relief with another stimulus package and gearing up to undergo a challenging winter season. Unemployment of the industry’s workers is still up by 9.1 percent since February. Even with expanded outdoor dining and the gradual reopening of indoor dining in certain states, “no business that was open a year ago is crushing it right now,” as Hockin puts it. “Everyone is suffering.”But what’s most salient about these groups is a trailblazing optimism. Hockin expects to start building out the interior of his restaurant in tandem with a safe reopening of indoor dining in Los Angeles, but he might end up combining Deodara’s with Side Pie. “We’re just going to go with the flow, see what makes sense. We have so many customers that are like, ‘This is the best pizza ever,’ so why would we change this?” he says.“Infectious” is the word that Lam used to describe the energy brewing at Sunshine Noodles. “When you see people who want to do more with the restrictions [at play] and being a place that can offer that and excite people, it’s been really healthy,” she says. Lam points out how the pandemic has caused certain folks to leave the industry entirely to pursue other professional avenues. But it’s also fostered a kind of rebirth for people like her who want to make it work.While access to capital will always be essential for chefs pursuing personal work, Yi thinks this time has “emboldened people to take a little bit more of a chance, regardless of whether they have money or not.” To continue onwards with these pop-ups is not only a way to exercise creative control and build a more progressive work culture, it’s also, for some, a more feasible pursuit than jumping back on board a potentially sinking ship, if and when jobs are even available.“People were forced to have jobs they didn’t necessarily love or like, and they were professionally burnt out or couldn’t leave because they were financially strapped, but then the pandemic really [brought] perspective,” Hockin says. Pop-ups like Side Pie, Sunshine Noodles, and the like have become a chance to start fresh. “This is a whole new world we’re living in,” he adds.Explore Bon AppétitRestaurantsChefsTrendsRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-11-12", "author": ["Condé Nast", "Emily Wilson"]}