{"id": "c5f2faa0a70bf30526eba8904e656d9d", "url": "https://www.bonappetit.com/story/nite-yun", "year": 2018.0, "month": 4.0, "day": 2.0, "content": "Nyum Bai Chef Nite Yun's Journey from Refugee Camp to Oakland Restaurateur | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprestaurantsChef Nite Yun's Journey from Refugee Camp to Oakland RestaurateurChef-owner of Nyum Bai is bringing rock-n-roll Cambodian culture to Oakland, CA.By Nite YunApril 11, 2018FacebookTwitterEmailPhoto by Haley MannixFacebookTwitterEmailNite Yun is the chef-owner of the lively new Oakland restaurant Nyum Bai, which celebrates the \"golden era\" of Cambodian culture through music and food. Yun was born in a Thai refugee camp, and made her way to the Bay Area before joining the La Cocina food incubator. Here, she tells her story and dream of sharing Cambodian culture through food.I was born in a refugee camp in Thailand after my parents fled the Khmer Rouge regime in Cambodia. My parents don’t talk much about escaping the war, so I had to piece the puzzle together with stories from my aunts and cousins. When my parents fled to Thailand, my mom was pregnant with my older brother, and he was born in the refugee camp. So was I. We stayed in the camp for five years, waiting to be sponsored to move to the U.S. Years later, when I went to visit my aunts in Battambang as an adult, two ladies appeared in front of their door and stood there, looking at me. I thought they were villagers, curious about anyone who looks a little different, but the way they stared stood out. When they left, my aunt told me these were actually my stepsisters. That’s how I found out my dad had another family before meeting my mom.When I was two, we were able to come to the U.S., and, after a few months in Texas, moved to Stockton, CA, where there’s a large Cambodian community. I didn’t have many American friends, nor did I hang out with the Cambodian kids. I was naturally quiet and kept to myself. When I got older and made more friends, I found out that other refugee kids had a very similar experience, not quite fitting in but trying to embrace their duality.Kids at my school watched cartoons and ate meatloaf and pizza while we ate dried fish and rice, sitting on the floor. I remember kids looking at my lunch box with a funny look, because  it smelled weird and looked weird. I just wanted a sandwich to take to school, to fit it. But I wasn’t totally ashamed; back then, I was going back and forth between two very different upbringings, identifying myself as a Cambodian first and foremost, but also as an American, and that’s how I think of myself now.At 19, I moved to the Bay Area and went to San Francisco State University to study nursing. At the time, I was growing increasingly curious about Cambodia and yearning to connect the dots of my family’s history. During senior year, while checking a patient’s vital signs, I realized that it’s not for me; I clearly didn’t care about the guy. That same day, I called my mom and told her I’m dropping out, and I immediately felt a sense of ease.Sach ko ang: grilled beef skewers, marinated in lemongrass paste and served with pickled papaya.\nPhoto by Haley MannixI went to visit Cambodia for the first time and fell in love with its purity and innocence. I felt a deep connection to the country, to its every nook and cranny, and discovering Cambodian food was a truly incredible experience. On my fourth visit, between odd jobs back in the U.S, I was slurping noodles and I had an epiphany; I couldn’t believe people in the States weren’t familiar with this amazing food, and the name of my future restaurant just came to me: Nyum Bai, or “let’s eat.”Upon coming back to the U.S, I wanted to apply to San Francisco’s La Cocina’s incubator, where food entrepreneurs from immigrant communities are taught all about owning a business, but I was scared because I knew the program was very competitive. When I got accepted, I cheesily thought it was meant to be: My dream of sharing Cambodian culture through food and capturing the good life my parents once had would become reality. The people at La Cocina were very supportive; they really helped me believe in myself. The first time I cooked for other people, I was so nervous; I’d never cooked for anyone but close friends before, not even my mom.I spent four years in the program before opening Nyum Bai. I’m so happy with how the restaurant came together. Both the food and the atmosphere are a tribute to the golden era of Cambodia, the ’50s and ’60s. That’s when Cambodia was a happening country, with lots of art and music. Music is totally essential for me, a workplace requirement really. We start playing Cambodian artists as soon as we open the doors every day. There are record covers decorating the walls, and they’re very special to me, almost like artifacts. I got them with help from the Mietophoum Khmer Archive, an organization dedicated to preserving Cambodian music. I even went to visit Sinan Keo, a Cambodian artist and refugee, in Long Beach, to look at his rare collection and borrow some record covers. Much like the music, the food is a celebration of my parents’ youth, of my youth.I’m especially excited about dishes like koh, a pork belly and coconut dip with vegetables, and machoo kroeung, the slow-cooked beef soup with water spinach and eggplant. These are classic Cambodian dishes I grew up eating, they have prahok, the traditional fermented fish paste in them, and the flavors are very nostalgic for me. But, without music, it it’s just half an experience.When my parents came to the restaurant opening, I could see they were proud of me and the restaurant, and happy to see all the people eating there. I use seasonal, local ingredients to bring traditional flavors to the plate, and my dad, a very good and critical cook, was impressed. I think my parents can see the bigger goal of Nyum Bai; it exists not because I can’t be a doctor or a lawyer, but because I have a deep passion for sharing their story. Cambodian cuisine is so interesting and delicious, and there’s no reason it can’t be as popular as any other cuisine in America. We’ve been in the shadow for so long.As told to Flora Tsapovsky.Explore Bon AppétitHealthyishCambodia OaklandChefsRestaurants + TravelRestaurants And TravelCaliforniaSan FranciscoRead MorecultureThe Refugee Juice Bar Owner Who's Defied Pretty Much Every Odd There IsBy Priya KrishnaRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-04-11", "author": ["Condé Nast", "Nite Yun"]}