{"id": "c606deae875e4a8af3c6bb0793fdaef6", "url": "https://www.bonappetit.com/recipe/spinach-yogurt-dip-with-sizzled-mint", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "Spinach-Yogurt Dip with Sizzled Mint Recipe | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShoprecipesFebruary 2018 IssueSpinach-Yogurt Dip with Sizzled MintBy Andy BaraghaniJanuary 9, 20185.0(8)Read ReviewsTriangleEmailPinterestPrintAlex LauEmailPinterestPrintEmailPinterestPrintOur version of this dip (called borani esfanaaj in Iran) uses spinach, but it can be made with cooked beets or roasted eggplant, too.Ingredients4 servings1cup walnuts8ounces baby spinach (about 10 cups)6tablespoons extra-virgin olive oil, divided1small onion, finely chopped2garlic cloves, thinly slicedKosher salt2tablespoons dried mint3cups plain whole-milk Greek yogurt1tablespoon fresh lemon juiceFreshly ground black pepperPreparationStep 1Preheat oven to 350°. Toast walnuts on a baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool; finely crush with the side of a chef’s knife.Step 2Place a medium skillet over medium heat and add ½ cup water. As soon as you see bubbles, add one-third of the spinach and cook, stirring occasionally, until most of the spinach is wilted, then add more. Continue to cook, stirring occasionally, until all the spinach is in the pan and wilted, 6–8 minutes. Transfer spinach to a bowl of ice water to stop the cooking and lock in its bright green color. Drain and squeeze out excess liquid. Finely chop spinach and set aside.Step 3Wipe out skillet and heat 2 Tbsp. oil over medium. Cook onion, stirring occasionally, until soft but without taking on any color, 6–8 minutes. Add garlic and a pinch of salt and cook, stirring occasionally, until garlic is softened, 2–3 minutes. Transfer to a small bowl.Step 4Heat remaining 4 Tbsp. oil in a small skillet over medium. Once oil begins to shimmer, remove from heat and stir in dried mint. The oil will sizzle immediately and the mint will become fragrant. Transfer to a small bowl; season with salt.Step 5Combine yogurt, lemon juice, onion mixture, half of the walnuts, and reserved spinach in a medium bowl. Taste and season with salt and pepper. Scrape\ninto a shallow serving bowl and use the back of a spoon to carve a few swirls into the dip. Top with remaining walnuts and spoon sizzled mint oil over.How would you rate Spinach-Yogurt Dip with Sizzled Mint?Leave a ReviewTell us what you thinkReviews (5)Back to TopTriangleI gotta admit that I really wasn't sure about this one as I was making it- but by the time I tasted it - it won me over. It's definitely way  more sophisticated and nuanced than the usual run of the mill spinach dip and a lot prettier. I served it  in a beautiful ceramic dish with a lid which did give it a bit \"wow\" factor.  That being said you swap convenience and time for that. Whether or not you and your guests will appreciate it  depends on yours/their degree of foodiness and preferences for novelty vs nostalgia.  Of note, we have a milk allergy in the house and I subbed in cashew yogurt. ALSO didn't have walnuts, so used pistachios instead (which I think made for a fantastic sub).  Maile KarrisSan Diego, CA12/26/2020My new spinach dip !  I used dried basil and nonfat greek yogurt because that was what I had, and it still came out amazing.  It's so much more flavorful but lighter than regular spinach dip which has cream cheese.  Next time, I would just add another handful or so of spinach.NeelSan Francisco, CA12/25/2020Awesome, make a day ahead as it tasted even better the next day. cevans63855Chicago5/6/2019Delicious! My mom loved it... With some salty cookies or on top of toast bread.GloomyMexico2/4/2019it was yum! Anonymous11/2/2018Explore Bon AppétitDipSpreadsMiddle EasternSpinachLeafy GreensVegetableMintHerbs & SpicesEasyQuickSnackStarterGluten-FreeVegetarianHealthyishRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-09", "author": ["Condé Nast", "Andy Baraghani"]}