{"id": "c61385c87833bf8564f2b3e1817c00bf", "url": "https://www.bonappetit.com/story/who-is-wellness-for-1", "year": 2018.0, "month": 9.0, "day": 2.0, "content": "Fariha Roisin: \"Wellness Was Never Meant For Me\" | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcultureI Never Thought Wellness Was Meant For MeWelcome to \"Who Is Wellness For?\" a new column by Fariha RóisínBy Fariha RóisínSeptember 14, 2018FacebookTwitterEmailPhoto by Emma FishmanFacebookTwitterEmailIn Who Is Wellness For?, writer and activist Fariha Róisín interviews people who are reshaping narratives about wellness for themselves and their communities. Róisín's first column is about her own struggle feel well while growing up in a family that didn't value self care.Growing up, I was taught that taking care of yourself was not important and that spending money on yourself was selfish.My dad was an academic who had to live in Abu Dhabi so he could pay off our family’s debts and mortgages; my mother was a part time day-care worker and part-time artist who suffered from a crippling cocktail of schizophrenia, bipolar, and borderline personality syndrome, and who regularly refused her medication because she said it numbed her feelings. She was also pathologically concerned with money. She had worked hard for the money she’d made, and she thought spending it on anything was a waste. Once, after she fell down some stairs and sprained her tailbone, my father, who was still with us in Sydney at the time, and I forced her to go to a Chinese massage therapist. She cried the whole way and refused to get a massage ever again because she didn’t think it was worth the thirty-or-so dollars.I come from immigrants who arrived in the West with nothing.They are also socialists—three generations back on my mother’s side—so my parents took pride in owning and needing very little. We were lower-middle class most of our lives, then suddenly in my early twenties we were solidly middle class, an ever-so-slight shift. We could now eat out more than just a handful of times a year, and we could each order a meal instead of three dishes to share among four people. We weren’t the brown family who ate every last bit of rice, fish or green curry off our plates. The anxiety of overspending, and the embarrassment of our parents not having enough money, was no longer there. Despite this newfound relative ease, the fear of money—and never having enough—was present at every meal.Where I come from, the feeling of abundance is a rarity.I knew early on that I wasn’t like my parents—I liked nice things. When I was 16, my dad called me a capitalist, and he meant it as a slur. I felt ashamed of wanting books, clothes, and shoes, things that were never in my parents’ grasps, and that shame kept me stifled. I didn’t think I deserved the nice things because my parents didn’t have them, so I started to punish myself when I felt that desire take hold. I would tell myself that I was too poor and worthless for life’s pleasures. That I was hardly worthy of being alive. That turned into cutting. As I got older, it turned into a drinking and drug habit. And then, when I was 25, I attempted suicide.I quickly realized after my suicide attempt that I didn’t actually want to die. In the midst of the pain, I decided to try to forgive myself for not being more like my family. Caring for myself, let alone “indulging,” didn’t come naturally. In the beginning, it was like trying to resuscitate something dead inside of me. But I wanted to invest in myself, so I began by absolving myself in the most basic way: What if it’s okay to take care of yourself? What if it’s okay to want money? Security? Nice things? It was a reclamation, a small way to decide on myself. That’s when I began to experience true wellness for the first time. It’s when I realized that I was worthy of the things that I wanted, and that it’s not “self indulgent” to like yourself and to care for yourself.It’s a never-ending process, but my own experience made me interested in learning about how other marginalized (especially black and brown) folks navigate the boundaries of wellness, especially when so many of us didn’t have access to it readily when growing up. By doing this, I want to redefine what wellness means. Why is it so conflated with wealth? And, how do we put wellness within reach for people without a lot of money, access, or other privileges? How do we teach self care to those who need it the most? How do we decide on ourselves when we’ve been taught not to?These are the questions I’ll explore in the next few months, in a series of conversations with people in the food and wellness spaces. We’ll talk about what wellness means to them, how they found their own forms of self care, and what they had to overcome to get there. Thanks for joining me, and stay tuned.Explore Bon AppétitWho Is Wellness ForessayRead MorecultureFariha Róisín on the Rituals (and Silk Pillowcases) That Help Her Get to SleepBy Martine ThompsonRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-09-14", "author": ["Condé Nast", "Fariha Róisín"]}