{"id": "c623dffdc17f8384d4ad4b5bd05fd0bb", "url": "https://www.bonappetit.com/story/all-edges-lasagna", "year": 2021.0, "month": 11.0, "day": 4.0, "content": "Every Piece Is an Edge Piece in This Roll-up Lasagna | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingEvery Piece Is an Edge Piece in This Roll-Up LasagnaThis recipe is like that all-corners brownie pan but for lasagna.By Antara SinhaNovember 28, 2021FacebookTwitterEmailPhotograph by Isa Zapata.  Food Styling by Cyd McDowell.  Prop Styling by Paige HicksFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.While many folks scramble for an edge piece, I’m usually the contrarian who opts for the gooey center. In a tray of brownies, I want the near pudding-like consistency of the middlemost piece. I dive right into the syrupy center of a piping hot fruit cobbler.The exception to the rule, however, is when cheese and pasta come into play. I always go for the almost-crunchy corner of ziti, the crusty piece of breadcrumbs and lacy cheese in baked macaroni, and, of course, the crisp, golden brown edge piece in a tray of lasagna.In this Spicy Skillet Lasagna With Ricotta and Spinach, with its beautifully furled rolled-up noodles, every serving is like a delightful edge piece from a traditional layered lasagna. Instead of baking lasagna sheets flat in a pan, associate food editor Rachel Gurjar opts for rolling the wavy noodles into pinwheels before arranging them in a skillet. After they’re smothered with a spicy homemade tomato sauce (more on that later) and a shower of Parmesan and baked, the ruffled tops of each sheet of pasta get that crave-worthy, crisp, baked-in cheesiness I'm always seeking.Cast Iron Skillet$30 at AmazonLike any great lasagna, it’s a labor of love—but it’s worth the final reveal. It starts with a homemade tomato sauce seasoned with plenty of red pepper flakes as well as a pinch of cumin. As a generally vegetarian-leaning person, I loved skipping the meat in this recipe and rolling up the thin slices of zucchini into each noodle. But if you’re craving something heftier, you could easily add browned ground beef or turkey to the tomato sauce.Apart from the sauce, the next most important component is, arguably, the cheese: Instead of a traditional béchamel, this skillet lasagna gets ricotta that’s blitzed in the food processor with Parmesan until it’s whipped and airy. Combine it with a spoonful of grated mozzarella and you get a melty, cheesy center in each roll-up, as well as a perfect cheese pull moment when you dive in with your fork.This recipe is now my unwavering go-to whenever I’m looking for a crowd-pleasing meal that won’t result in any unnecessary squabbles. There are enough edge pieces to go around!Will It Skillet?Spicy Skillet Lasagna With Ricotta and SpinachNo more fighting for those corner slices of lasagna—each serving of this skillet lasagna delivers that coveted mix of crispy and cheesy.View RecipeExplore Bon AppétitcookingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-11-28", "author": ["Condé Nast", "Antara Sinha"]}