{"id": "c633574f2d096e61aea5d6ebed82856c", "url": "https://www.bonappetit.com/story/cooking-switch-games", "year": 2021.0, "month": 10.0, "day": 1.0, "content": "4 Nintendo Switch Games for Food Lovers | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shopshopping4 Nintendo Switch Games for Food LoversFood in video games usually feels like an afterthought, but these Switch titles get it right.By Nico AvalleOctober 4, 2021FacebookTwitterEmailFacebookTwitterEmailAll products featured on Bon Appétit are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.When lockdown started, I spent hours in my kitchen playing games on my Nintendo Switch. In handheld mode, I could pass the time while soups simmered and bread doughs doubled in size by running laps in Mario Kart, exploring the world of Skyrim, or rehearsing Super Smash Bros. combos to unleash on my roommates. I’d always loved video games and cooking as separate hobbies, but enjoying both at once left me with a lingering question: Why does the food in video games pretty much always suck?To be clear, I don’t mean that food mechanics aren’t realistic enough. Like, in a medium where just about anything is possible, I don’t need to spend my time peeling potatoes and mincing garlic for a stew. My problem is that food and its associated pleasures almost always feel like an afterthought. In action games, food is usually the slow, crappy way to heal your character—the last resort when you’re out of medical kits or potions—and in survival games, eating is usually more of a resource management problem than a part of the game meant to surprise and delight. Almost universally, it feels like video game developers view food as nourishment and nothing more, dooming their characters to exist on pixelated meal replacement bars and nutrition shakes.Luckily, even if boring food in video games is a pattern, it’s not a rule. Some developers, both indie and triple-A, have found ways to make in-game eating feel exciting and worthwhile, proving that food-centric video games were possible all along. Just in time for the bigger, brighter OLED version of the Switch, these are a few of the titles that bridge the divide between my two favorite hobbies, each in their own special way. There’s something for everyone: Maybe they’ll get a gamer in your life more engaged around dinnertime. Maybe they’ll spark the same joy you experienced while playing Cooking Mama on your old DS. Maybe you need a game other than Animal Crossing to justify preordering Nintendo’s newest gadget. Whatever the case may be, to quote a famous plumber—and Chris Pratt, apparently—“Let’s-a-Go!”Four Player Co-op in Overcooked 2 from Team17 Studio and Ghost Town Games.Cooperative Kitchen Chaos: The Overcooked SeriesWhen I look for a new co-op game (for non-gamers, that’s a multiplayer game where everyone works together, short for “cooperative”), I have a few basic criteria. First and foremost is communication. Whether my friends and I are strategizing, adding commentary, or straight up yelling at each other, I want a game that gets us talking. Second, I love easy-to-learn controls so we can spend less time on tutorials and more time actually enjoying ourselves. Lastly, it needs to be more fun than just booting up Mario Kart, because let’s be honest, that game is perfect. On this scale, I’m happy to report that all three of the Overcooked games receive a perfect score.Overcooked places you in a series of cartoon kitchens, where you and your friends work together to fill customers’ orders as quickly as possible. You can choose an avatar from a list of adorable chefs, including anthropomorphic cats, sharks, birds, mice, and more. Like in a real restaurant, one player might be in charge of preparing meat while another chops veggies, cleans dishes, or plates each finished course. (All these tasks are accomplished by pressing and holding “X” in front of the appropriate station and ingredient—shallow learning curve: Check). Tickets come in too quickly for anyone to work alone, and the game ups the difficulty for each additional player you add, so teamwork and constant communication are essential for success. After 15 minutes or so, you’ll find yourself using kitchen lingo out of pure convenience: “Hot behind!” I say, dashing past my friend with a saucepan. “You call that a julienne, you fucking donkey?” she says, checking my knife skills. What fun!If that sounds too simple, don’t worry. Once you and your buddies get the hang of making burgers and simple pastas, the game starts throwing all kinds of fantastical wrenches in your well-oiled cooking machine. There’s a level that takes place in a Fantasia-esque wizard’s lair, where all of the furniture and appliances periodically dance around, forcing you to rejigger your workflow. Another kitchen is suspended from a blimp that’s navigating a thunderstorm, so you have to put out kitchen fires each time lightning strikes—but be careful not to neglect your customers! There are adorable bread zombies demanding “graaaiiins,” and an Indiana Jones*–*style canyon complete with minecarts to dodge and rickety bridges over bottomless pits. There are icebergs, castles, speedy food trucks, and so much more. It’s like competing on *Hell’s Kitchen…*if Hell’s Kitchen and Looney Tunes did a *Space Jam–*style crossover season (by the way, would watch).The first two games are loaded with fun, but the most recent release, Overcooked: All You Can Eat, comes with all of the old content plus a host of new levels.Overcooked! All You Can Eat$40 at AmazonMy humble farm on an autumn day in Stardew Valley from developers ConcernedApe and Sickhead Games.\nNot for Farmers Only: Stardew ValleyIf you haven’t let go of the cottagecore craze, this is the game for you. After inheriting the family farm, your character leaves an anonymous corporate job to live off the land in the titular village of Stardew Valley. You start small—a few tools, some seeds, and an overgrown plot of land—but with some patience, hard work, and help from your neighbors, you create the prairie home of your dreams. Want to raise goats to produce award winning chèvre? You can do that. Do you dream of owning a riverside vineyard? You can do that too. Want to channel Gerald Stratford and go all in on growing massive pumpkins and other big veg? You can and definitely should do that.As time passes in the game, seasons change and bring with them new crops to grow, new life milestones for your character and their neighbors, and new holidays to celebrate. It’s a game about community, and specifically about the way that food and the people who produce it are instrumental in building that community. Gifting your crops to villagers is a great way to befriend them, prompting new plot developments and dialogue options, and, in the case of the other bachelors and bachelorettes in town, the opportunity to fall in love and get married. Sure, the art is pixelated, but Stardew satisfies the very real part of my brain that wants to leap off the grid and start a new life on the range.The food connection already makes the game a winner, but what really makes Stardew Valley shine is the character of the village and its denizens, which are at risk of disappearing. In the background of the game, there’s a subtle conflict between the townsfolk and a tech monopoly that’s threatening to put the whole town out of business. You can allow the faceless company to outcompete the villagers—and profit in the process—or you can befriend your fellow residents, help their businesses survive, and invest your time, money, and energy in the town’s future. If you like that kind of David vs. Goliath morality tale as much as I do, be sure to buy the game at our Amazon affiliate link.Stardew Valley$15 at AmazonLink standing over a cooking pot in The Legend of Zelda: Breath of the Wild from Nintendo.\nFantasy for Foragers: The Legend of Zelda: Breath of the WildI won’t waste space explaining why Breath of the Wild is a perfect game. Plenty of critics more qualified than I am have already made that point, granting the title a nearly unbelievable 97% score on Metacritic, which the aggregator interprets as, and I quote, “universal acclaim.” What I can say is that I have put hundreds of hours into this game and still feel like there’s more to discover—and I think food is a big part of why, four years after BotW’s release, it hasn’t gotten old.Playing as the hero Link, your goal is to defeat an evil spirit named Ganon, fulfilling your destiny and saving the realm of Hyrule and its princess, Zelda, from an eternity of desolation, darkness, and destruction. But that can wait. BotW’s structure is loose and open—there’s no ticking clock, no fixed order or timeline needed to complete its many quests—which gives the player freedom to explore its open world as much as they please. And you won’t get far without cooking. Other than sleeping at the rare inn, food is the main way you replenish Link’s health, so as you venture farther into the wilderness of Hyrule, you’ll need to come prepared with skewers of meat, mushroom stir-fries, and a baked apple or two. Ingredients are available at shops in the game’s major cities, but for the most part you’re going to be collecting them yourself by gathering plants and hunting for game out in the wild.Where BotW stands apart from other adventure games, culinarily speaking, is that food is not only an essential tool for survival, but it’s also an engine for more exploration. While hunting for boar in the forest, you may stumble upon a bushel of spicy peppers. Cooked into a dish, these provide Link with frostbite resistance, which will allow you to explore frozen mountaintops without harm. There, you might find an herb with a cooling effect, giving you access to scorching hot deserts, where another new ingredient might point you in another new direction. Experimenting with new combinations of herbs and spices creates useful power-ups that boost strength in combat, speed, or stealth. Choose the wrong mix and you might end up with “Dubious Food,” BotW’s name for failed dishes and concoctions, a term I have co-opted for the messy kitchen experiments I throw away before ordering takeout at 9 p.m. Unlike in real life, however, I am never discouraged in BotW, a game which leaves me hungry, curious, and inspired by how much potential has been packed inside its sprawling, beautiful world.The Legend of Zelda: Breath of the Wild$60 $42 at AmazonThe opening screen of Cooking Simulator from Big Cheese Studio and Forever Entertainment\nZen and the Art of Kitchen Simulation: Cooking SimulatorI love high fantasy and sci-fi, genres that are the video game industry’s bread and butter, but they can also stress me out. Like, the suspense and drama of shows like Game of Thrones and Westworld absolutely have a time and place—but when I want to chill out, it’s Beat Bobby Flay all the way. There’s something very calming about a world where the rules are familiar and everything makes sense. When it comes to the games on my Switch, that’s where Cooking Simulator comes in.First person as an anonymous chef, the player preps ingredients, tidies up, and fills orders for an invisible front-of-house. True to its name, it’s a pretty realistic simulation of preparing food. A few things are simplified in the interest of time (salmon fillets bake in under two minutes, and most stews simmer for fewer than five, for example). Stakes exist—you have a limited budget for ingredients and tools, a clock ticks for every order, and critics review your restaurant every now and then, boosting or harming your reputation—but they’re mostly there just to keep things moving. If you’d prefer, the game has a sandbox mode, where you can remove the constraints of money and time altogether, allowing you to go through the motions of cooking your imaginary little dishes with no worries, no stress, and nothing to clean when you’re finished. Sure, I could get off of the couch and make real food in my real kitchen. But I only eat a few meals a day, groceries aren’t free, and my couch is comfy. Plus, I have not one but two (!) industrial ovens in Cooking Sim, and my landlord won’t answer my emails about putting a legit one in my apartment.In a nutshell, Cooking Sim is my unapologetic brain softener where nothing matters, and that’s the point. Even the things I don’t like—it feels like it was made for PC, so the controls on the Switch version are a bit clunky, and I still have trouble lining things up while chopping and pouring no matter how much I practice—are a constant reminder to step back and take stock. If I ruin a dish in the game, it costs me nothing, and no one has to suffer through a burnt dinner. None of this is real, I think, you’re doing this to relax. And I do.Cooking SimulatorShop Now at NintendoExplore Bon AppétitShoppingCultureRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2021-10-04", "author": ["Condé Nast", "Nico Avalle"]}