{"id": "c638ef1ca9da33d98556729bff7e0134", "url": "https://www.bonappetit.com/story/herbs-fire-season", "year": 2020.0, "month": 9.0, "day": 5.0, "content": "Herbs for Wildfire Smoke Exposure  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleHow to Use Herbs for Support During Fire SeasonThe founders of Oakland-based Five Flavors Herbs share how they use plant medicine to cope with the effects of wildfiresBy Aliza AbarbanelSeptember 29, 2020FacebookTwitterEmailChelsie CraigFacebookTwitterEmailEach fall, Oakland-based herbal pharmacy Five Flavor Herbs stocks up on mullein, marshmallow root, and wild cherry bark. These herbs are tools to protect against fire season, an annual necessity since nearby Santa Rosa was devastated by a series of wildfires in 2017.In 2020, over 3.5 million acres have burned in California alone—and brush fires continue to rage across the state and Oregon. The unprecedented scale of blazes sweeping across the West Coast, coupled with the COVID-19 pandemic, has infused new urgency into lung protection. Mutual aid organizations are stocking community fridges with free herb bundles, and herbalists are sharing tutorials for how to steam kitchen herbs like rosemary and thyme.Five Flavors Herbs’ cofounders, Ingrid Bauer, M.D., and husband and licensed acupuncturist-herbalist Benjamin Zappin, experienced the blaze firsthand. “We evacuated from our home here in Nevada City in mid-August when the Jones fire broke out a half mile from our house,” Bauer says. “When we came home, we experienced a couple weeks of very intense smoke from the Loyalton Fire and North Complex Fire.”Bauer and Zappin relied heavily on their herbal knowledge throughout the ordeal. Here, they share their best tips for using plant allies to cope with the effects of fire season.Make a cold-water extractionWhen the air is really filled with hot particulate matter, mucilaginous herbs like mullein, marshmallow root, and licorice root are useful tools for soothing irritated respiratory tissue. And no, they don’t have anything to do with mucus.“At a biochemical level, mucilaginous herbs have a high content of something called mucopolysaccharides, which is a long chain sugar that forms a goopy material in liquid,” Bauer says. “[Drinking them] will soothe both the respiratory and digestive tracts, which is helpful if your stomach is burning or irritated because you’re stressed out or not eating the ideal diet while evacuated.”Mucilages are a great candidate to brew at home because they can be extracted in cold water with very little effort. Put a heaping tablespoon of dry shredded marshmallow root into a quart jar, cover it with cold water, and soak overnight. In the morning strain the thick liquid and drink it, sweetened with a bit of honey if you like.Target your sinuses“My main problem was sinus congestion and allergic response to all the dust and smoke in the air,” Bauer says. “I was using a neti pot with a saltwater rinse and taking allergy-support herbs to reduce reactivity in the airway, like ambrosia (Editor’s note: It is also known as ragweed—beware if you’re allergic!) and a tincture blend that we make with that called Clear Passage. Sometimes, if things are really congested, I’ll put a few drops into the neti pot along with the salt water.”Steam smartlyHerbal steams are one of the most popular forms of plant-based respiratory support being shared online right now. Whether you’re using a diffuser, humidifier, or simply boiling a pot of water on the stove, the essential oils in plants like thyme and eucalyptus can help loosen up the phlegm so your body can naturally cough it out—and the steam is hydrating too.Stovetop steaming is perhaps the easiest method to nourish lungs. Fill a large pot with water and your preferred herbs, then boil. Bauer and Zappin recommend enlisting common herbs like rosemary, thyme, and eucalyptus—check a grocery store, or look for a local herbal mutual aid organization that might be coordinating deliveries of herb bundles, like Portland-based Herbs for Activists.Let the steam fill your room, or carefully drape a towel over your head to directly inhale for five minutes. “You have to be very careful not to burn yourself, especially if you’re using a towel as a tent over your head,” Bauer says. Make sure the water is turned off and test the steam temperature with your hand before putting your face over the pot. Avoid this technique if you have asthma or weakened lungs as the essential oils can be intense.Consider an oxymelOxymel—literally “acid and honey” in ancient Greek—is an herbal tonic made by infusing vinegar and honey with a wide variety of dried or fresh herbs, from parsley and thyme to ginger and garlic. Five Flavors Herbs has this recipe designed to support lungs with dried elecampane root, wild cherry bark, and mullein. “Elecampane is an important herb to highlight because it’s a wonderful respiratory support herb and expectorant to loosen up the phlegm—its warm and spicy flavor profile helps cut through,” Bauer says.Use herbs for your emotional health too“Dealing with a fire on top of COVID-19, everyone is really concerned, and it amplifies that sense of vulnerability,” Zappin says. He cites adaptogens as a useful way to cope with emotional distress while strengthening the body’s response to particulate matter, the microscopic matter found in smoke. “I find adaptogens like rhodiola, cordyceps, and holy basil really useful because they benefit respiration and aid in the body’s ability to get more oxygen,” he says.In addition to seeking a boost from plant medicine, consider enlisting some help to wind down. “During the week of evacuation, I leaned on my emergency nervines, like skullcap and kava kava,” Bauer says. “I used sleep herbs at night, like valerian and hops, because it was very difficult to sleep when you’re that worried about what might be happening to your neighbors and your home.”But start with one, and source with careHerb blends, often found in tinctures, provide a cumulative effect with very little effort, but it’s best to start using plant medicine strategically. “If people are trying out herbal medicine for the first time, go for individual extractions so you can get a sense of what each herb does,” Bauer says. “Experiment with a marshmallow cold infusion or a licorice tea or elecampane oxymel.” If you’re taking medications, check with your doctor or herbal practitioner to be sure there aren’t any contraindications or negative interactions.Many kitchen herbs, like rosemary and culinary sage, can be grown at home or purchased from a grocery store. Look for other plant medicine at local herb shops or small-scale growers, or source blends online through this BIPOC herbalist directory. “If you’re shopping online, look for certified organic and domestically grown if possible,” Bauer says. “It’s really cheap to buy herbs in bulk, so get together with your community or neighbors to buy some pounds of marshmallow root.”Explore Bon AppétitHealthyishSelf CareInterviewsRead MoreLifestyleThe Herbal Mutual Aid Network Creates Free Tinctures for Black OrganizersBy Aliza AbarbanelRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-09-29", "author": ["Condé Nast", "Aliza Abarbanel"]}