{"id": "c63ced8c07f8528f3c667207f60fcafe", "url": "https://www.bonappetit.com/story/eko-kitchen", "year": 2019.0, "month": 7.0, "day": 5.0, "content": "Eko Kitchen Is Bringing Nigerian Flavors to the Bay Area  | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopLifestyleMeet the 24-Year-Old Owner of Eko Kitchen, San Francisco's First Nigerian RestaurantSimileoluwa Adebajo quit her finance job to bring her jollof pasta and egusi soup to Bay Area eaters.By Flora TsapovskyJuly 31, 2019FacebookTwitterEmailPhoto by Alanna HaleFacebookTwitterEmailSimileoluwa Adebajo makes everything look easy. Smoked goat meat? “Oh, we got a smoker.” Opening a restaurant in San Francisco’s savage real estate market? “I got lucky; the owners of a shared kitchen space offered me a chance.” In reality, Adebajo’s path to opening Eko Kitchen, the city’s first exclusively Nigerian restaurant, is a tale of focus and determination, one that includes jollof parties for hungry students and copious amounts of organic palm oil held for questioning at U.S Customs. “It took a minute,” she smiles. No big deal.But it is. When Adebajo tweeted in April: “So I’ve quit my job as a financial analyst to open the first #Nigerian restaurant in the city of San Francisco. Tbh I’m not sure of exactly what I’m doing but I’ll do my best with what I have,” it was retweeted over 15,000 times and stacked up 2,000 replies (probably more by the time you read this). The food community in San Francisco, and around the country, was ready to show up in support. That’s how contagious Adebajo’s dreams are.Now Eko Kitchen shares its location with a casual Mexican restaurant that occupies the space during the week, while Eko opens Friday through Sunday. Every Friday, Adebajo and her team of five swoop in, decorate the walls with Nigerian art, adorn the tables with traditional figurines, and cover the bar in traditional woven cloth. By Monday it’s gone, until next week, hidden in the back of the restaurant. On the menu, however, dishes make a lasting impression. “My family is well-to-do, so my reality of Lagos isn’t everyone’s reality; there’s great income inequality [in Nigeria],” she says. “But everyone eats, and our food scene is so untapped. There’s very little representation of West African restaurants in the Bay Area.”Adebajo getting ready to eat Iyan (pounded yam) with Egusi soup and chicken\nPhoto by Alanna HaleAdebajo, 24, moved to San Francisco from Lagos to obtain a master’s degree in international development economics at USF. She started cooking for herself and friends, steadily increasing the circle of those who craved her jollof and plantains. “I figured if my classmates like the food, I must be doing something right. If I already cook so much, why not make it a legitimate business?” In June of last year, while working during the week as a financial analyst, she launched a weekend delivery service out of a shared kitchen space and threw occasional pop-up events. This spring, Adebajo found a permanent, if shared, home for Eko Kitchen. During the week she runs a corporate catering operation, providing staff lunches to tech companies and financial institutions.The colorful space is transformed on weekends.\nPhoto by Alanna HaleThe menu, different each day of the weekend, reflects the Lagos lifestyle. On Friday night it’s all about spicy and simple “beer parlor food,” according to Adebajo, like marinated skewered beef and “Nigerian Shawarma.” Saturdays, the menu is “relaxed, like you’re spending time with your Nigerian mother,” with comforting dishes like jollof pasta and chicken gizzards. And on Sunday—the night I went—following an unspoken Lagos tradition, rice dishes dominate along with heavier family-style meals. Shazam-worthy Nigerian hip-hop played in the background while I tried pounded Nigerian yam that came wrapped in plastic, like a ball of dough, alongside efo riro, a thick soup made with a fragrant pepper sauce, spinach, and fermented locust beans. The tiny round beans flavor many of the dishes with a hint of sour and bitter, and make the spices spicier. I ate sweet plantains, honey-glazed chicken wings, and moi moi, a steamed black-eyed-pea purée with mackerel that’s baked in banana leaves. The windowless restaurant was filled with Nigerian customers shrieking with joy at the sight of familiar dishes, and other couples and families who were here to try something new.The locust beans—iru in Yoruba—as well as the organic palm oil, are some of the ingredients Adebajo imports personally from Nigeria alongside Nigerian honey beans and yam tubers. “It’s really exciting that I’m able to make the dishes with authentic ingredients from Nigeria, straight from the farmers,” Adebajo says. To obtain cow skin—a common ingredient in the restaurant’s ayamase stew of beef, tripe, and cow skin—she sent quite a few emails to some surprised managers of beef-processing facilities before getting what she needed. Eventually, a Nigerian farmer in Sacramento understood her needs and became a regular supplier. “Customers often ask me what it is that they’re chewing and loving so much, and I go, ‘I’ll tell you if you really want to know!’” Adebajo laughs.Since that April tweet, Eko Kitchen continues to scale new heights, with no PR efforts or even a sign to mark its location. Another recent tweet describes Adebajo falling asleep while sitting down, fully clothed. But that won’t stop her: “My plan for the future is to continue to share Nigerian food with people in cities where there is a gap in the market for West African flavors,” she says. Easy, right?Explore Bon AppétitHealthyishBay AreaRestaurantsWest AfricanAfricanInterviewsRead MoreLifestyleWhy I Launched the First Indonesian Food Truck in San FranciscoBy Siska Silitonga MarcusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2019-07-31", "author": ["Condé Nast", "Flora Tsapovsky"]}