{"id": "c63ce38bd67c205cb87e0909db6f4c28", "url": "https://www.bonappetit.com/story/buy-fish-online", "year": 2020.0, "month": 5.0, "day": 1.0, "content": "Where To Buy Fish Online | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusWhere To Buy Fish OnlineStock up on salmon, swordfish, and shrimp from the comfort of your own home.By MacKenzie Chung FeganMay 6, 2020FacebookTwitterEmailFacebookTwitterEmailYou may not be able to take a leisurely trip to the fishmonger right now to examine today’s catch. But the good news is that the internet exists! We’ve rounded up some of the best places to buy fish online for that sheet pan salmon and clams arrabbiata you’re craving.We’ll level with you: It’s more difficult to get quality fish shipped to your door than it is to order meat online. And that’s because of a number of factors at play. Although not all farmed fish is bad (we recommend Seafood Watch to learn more about how to be a responsible consumer), much of the fish we stand by is wild-caught using sustainable fishing practices. That means that there’s a seasonality to many types of fish, and just like you can’t get wild ramps in January, you can’t get fresh Dungeness crab in September.Additionally, no one is interested in shipping salmon from Alaska to Florida via UPS Ground. Sending fish via next-day air comes at a price, which is why many of the purveyors on this list sell in bulk to make purchases more cost effective. Confused about what to do with ten pounds of halibut? Flash-frozen fish will keep in your freezer for months. If you’ve ever frozen fish at home yourself and been less than enthused with your thawed-out fillet, fear not; the fish you’re getting will have been rapidly frozen within hours of being caught, making for much better results. Just make sure you leave time for it to fully thaw in the fridge. Let’s get fishing, shall we?All products featured on bonappetit.com are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.Fresh Fish and SeafoodLummi Island WildWild-caught, sustainable seafood from the Pacific Northwest. Salmon are caught using a low-impact reefnetting technique traditionally used by indigenous peoples throughout the region. Fish are available portioned or as whole sides, individually or in bulk. Free shipping over $99.Vital ChoiceWild-caught seafood available a la carte or via subscription boxes. The wild salmon box, which comes with 14 portions, is $129, and shipping is free for orders over $99.Alaska Home PackMonthly, bimonthly, or quarterly subscriptions start at $230 for a 9- to 12-pound box of wild-caught, traceable, flash-frozen Alaskan seafood. One-time boxes also available featuring salmon, cod, halibut, and crab. Family-owned.FultonFishMarket.comAn extensive range of seafood—from swordfish to mussels to uni—sourced from New York’s Fulton Fish Market. Free shipping on orders over $125.Sena SeaWild-caught Alaska salmon, cod, and halibut—with flash-frozen and fresh shipping options—from a third-generation fishing family. Free shipping over $99.Aqua BestA second-generation, family-run business on Manhattan’s Lower East Side that formerly supplied Le Bernardin and now ships nationwide. Most of the seafood—which is sold a la carte—is sourced by directly contracting with fishing boats in order to ensure traceability.J&E GeneralWhole-animal butchers Erika Nakamura and Jocelyn Guest have partnered with sustainable fishmonger Greenpoint Fish & Lobster to offer seafood as part of their subscription meat service. Each $30 box includes a salmon fillet, a cod or pollock fillet, and six shrimp. Delivery to the New York area only. A fave of associate editor Hilary Cadigan.Browne Trading CompanyFresh seafood—from whole fish to Jumbo prawns to baby octopus—that, in normal times, graces the tables of restaurants like The Modern in New York. Some items are available frozen as well. Offering 10% off for new customers.Wild Alaskan CompanyMonthly seafood membership club starting at $132 for a pack of 12 portions. Select from salmon or white fish—both caught in the wild and shipped frozen—or choose a combo plan. Cancel or skip shipments any time.Feed the PartyResponsibly farmed, hormone- and antibiotic-free Verlasso salmon from Patagonia, sold by the side. Free shipping.SizzlefishA wide variety of flash-frozen, pre-portioned fish available either a la carte in bulk (most selections contain around a dozen 4-oz. portions) or via subscription plans. Fish is a mix of wild-caught and farmed. Free shipping on all orders, and 10% off for new customers.Pike Place Fish MarketWhole fish, fish fillets, Dungeness crab, and more, all sold by the pound and shipped via Goldbelly. Ask your mail carrier to toss the package to you like he’s a fishmonger slinging a fish and pretend you’re at the market in Seattle.Yama SeafoodBluefin tuna, hamachi, eel, and more from a distributor that services many of New York’s high-end sushi restaurants, as well as Atomix and Le Berdardin. Delivery to the New York area only. Recommended by digital restaurant editor Elyse Inamine.Honolulu Fish CompanyWild-caught Hawaiian fish—all caught by hook, not net—including opah, wahoo, and ahi. Many sashimi-grade options. Free shipping.Island Creek OystersYou’ll find these briny beauties from Duxbury, Massachusetts, on restaurant menus for $3.50 a pop (in the before times, at least). Buy them direct from the growers for a little over $1 each and have yourself an oyster party. Free overnight shipping.Learn how to shuck with Brad Leone\nCommunity Supported Fisheries (CSFs)You might be familiar with Community Supported Agriculture, whereby you purchase a “share” in a farm. By committing ahead of time, you help the farmer anticipate demand and raise working capital, and in exchange you get a portion of her crops throughout the growing season. Community Supported Fisheries work the same way—you invest in a fisherman or fishing collective, and they send you a share of their catch. Consider going in on a share with a friend or neighbor (more about how to do that safely here) if you don’t have freezer space for twenty pounds of fish.Taku River Reds SalmonBuy a share of traceable Alaska salmon and seafood through this CSF, a favorite of It’s Alive host Brad Leone. Pick from various types of salmon or a combo share that includes crab. Shares start at twenty pounds.Drifters FishShares in this husband-and-wife-run Alaska salmon CSF are only available to residents of Seattle and Western Washington, but smoked and tinned fish are on offer to the rest of us. Another Brad Leone pick.Sitka Salmon SharesShares of wild Alaskan seafood from this CSF, which start at $109 a month, run from June to December and can include salmon, halibut, crab, and albacore. BA readers can use offer code SITKA25 for a $25 discount on any 2020 Premium Sitka Seafood Share.Looking for where to order meat online? Right this way...Explore Bon AppétitShoppingCoronavirusRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-05-06", "author": ["Condé Nast", "Mackenzie Chung Fegan"]}