{"id": "c65de6fa8c00d2941d021996ab6db634", "url": "https://www.bonappetit.com/story/what-do-you-want-to-remember", "year": 2020.0, "month": 4.0, "day": 5.0, "content": "What Do You Want to Remember About This Time? | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopRecipesRestaurant DiariesWellnessVideosHow to HelpNewslettersCoronavirusWhat Do You Want to Remember About This Time?More specifically, what you did during it?By Amanda ShapiroApril 30, 2020FacebookTwitterEmailPhoto by Laura Murray FacebookTwitterEmailEvery week, Healthyish editor Amanda Shapiro talks about what she's seeing, eating, watching, and reading in the wellness world and beyond. Pro tip: If you sign up for the newsletter, you'll get the scoop before everyone else.Healthyish friends,Last week, I sat in the tiny square of open floor in my closet to record the latest episode of the Bon Appétit Foodcast. (Podcast producer Emma Wartzman told me to find a muffled place, and it was either there, surrounded by winter coats, or under my bed.) The episode is all about The Healthyish Guide to Being Alone, our month-long series about finding solitude when we’re together and togetherness when we’re apart. First I talked to one of my favorite humans, associate editor Christina Chaey, about the latest episode of My Brilliant Friend on HBO—I mean, we talked about meal prep for one! Okay, fine, we did both. Listen for the part where Christina says she pre-peels her garlic at the beginning of each week and my head audibly explodes.Then I called up one of my other favorite humans, Hawa Hassan—entrepreneur, chef, and cookbook author—who’s been bringing meals to hospital workers in Brooklyn with the help of a nearby restaurant. (You can read a condensed version of our chat on Healthyish.) I’ve been thinking a lot about the question she raised, What do you want to remember about this time and what you did during it?Are we going to remember it as a pleasant break from going to work? As one long stretch of boredom? Or, as Hawa says, “as a time when a group of people not only came together but actually stayed together, who voted in November, not for their personal interest, but for the collective, who stood ten toes down in their communities and really got involved.”Personally, I’m trying for Hawa’s option. That’s meant staying put in my apartment, which happens to be in one of the hardest-hit parts of the city, and, a couple times a week, bringing groceries to people who can’t risk leaving the house. It’s meant calling my family every day, and showing up for the people I love, and for my city, in the best ways I know how.Other Things I’m Consuming This WeekFirst and foremost, Vegetarian Carbonara, assuming there’s spaghetti at the grocery store this week.I don’t encourage you to read Cristina Cuomo’s virus-recovery strategy, but I do encourage you to read the story on Jezebel in which a doctor breaks down the good, the bad, and the batshit in her “treatment plan.” It’s impossible not to see how much this crisis has hurt disadvantaged populations, and this is the flip side of that coin: privilege, and the health benefits that come with it, have never been more clear.BuzzFeed writer Scaachi Koul’s essay for Healthyish, about how much she misses eating alone at restaurants, really struck a chord. “I miss eating...in the quiet din of a restaurant, after the lunch rush or whenever I choose, alone, pawing at a book and pretending I’ll read it, then listening to a podcast about 2 Live Crew instead.” Admit it: You’ve been there, and you miss it too.This miso chicken stir-fry has been making the rounds at BA, and so as not to feel left out, I cooked it too. I subbed boneless, skinless chicken thighs because that's what I had—and omitted the peas because that's what I didn't have. I also doubled the miso curry mixture because someone in the comments said they wished they did. Now I feel like a NYT Cooking commenter, but the point is this recipe rules.Christina Chaey’s latest newsletter was a step-by-step of how she threw a dinner party in isolation, and it gave me all kinds of sweet and nostalgic feels. I can’t say I’ve had the impulse to play dress-up in my own apartment, but the thought of fancy outfits paired with slippers and sock-feet is too charming to resist.Senior food editor Andy Baraghani’s final column on solo living is all about texting your ex, and it’s his best one yet, or maybe just the most, uh, relevant to me? Anyway! His advice is good for pandemic times but probably normal times too.Solo or not, if you’re a human being right now, you’re probably at least a little tired of cooking. So go read Kelsey McKinney’s story about how she clawed her way out of a deep cooking rut.Until next week,Amanda ShapiroHealthyish editorExplore Bon AppétitHealthyishCoronavirusHealthyish NewsletteressayRead MoreCoronavirusHawa Hassan Is Feeding Hospital Workers At the Epicenter of COVID-19By Amanda ShapiroRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2020-04-30", "author": ["Condé Nast", "Amanda Shapiro"]}