{"id": "c66048a3ce6b9f01bd23ec4b563e38d1", "url": "https://www.bonappetit.com/story/cheesy-cauliflower-baked-pasta-kid-approved", "year": 2018.0, "month": 1.0, "day": 2.0, "content": "The Cheesy Cauliflower Baked Pasta That My Kids Will Actually Eat | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch Shoptest-kitchenThe Cheesy Cauliflower Baked Pasta That My Kids Will Actually EatThree gooey cheeses distract tiny humans from the presence of a vegetable in this baked pasta.By Chris MoroccoJanuary 14, 2018FacebookTwitterEmailAlex LauFacebookTwitterEmailMy kids don't think I'm a very good cook. Being a food editor for seven years doesn’t buy you any street cred when it comes to the under-five set. The other night my son tasted a mozzarella stick for the first time (plain, mind you, because he won’t go near any red sauce that isn’t ketchup) and a few seconds later his whole body went rigid as his eyes started to water. “HE’S CHOKING!” I shouted as I barreled past our friends and tried to remember the trick to not cracking any ribs when giving kids the Heimlich maneuver. Nope. He just didn’t like the texture and gagged it back out into my hand. (Next year I will be doing Dry February instead of January, so there are 3 fewer days to have heart-palpitating events like that happen and not get a glass of wine afterwards.)No red sauce for the kids, thank you very much.\nAlex LauAnybody with kids in the two-to-six-year-old range will know what I am talking about. One day they'll happily eat mac and cheese and the next, they will only eat plain pasta with a side of string cheese. Mine will happily eat hummus, but refuse to go near a whole bean. My older son ate salami as a toddler, stopped for two years, and then picked it back up the night I thought he would become a mozzarella stick-eating statistic. Foods with multiple textures and foods with lots of stuff touching are all out. We have to leave buffer zones between meal components. We go through a lot of ketchup because sometimes a swipe of it is the only way to get them to taste something. As infuriating as it is to see my kids reject many of the foods I work so hard over, I refuse to give up and retreat to the safety of hot dogs and fish sticks.Rather than turn mealtimes into battlegrounds, though, I've adopted several techniques that over time have made a difference.Hummus—surprisingly kid-friendly. Here's our easiest way to make it.\nPhoto by Alex Lau, Styling by Sue LiI try to focus on making sure they are getting enough fruits and vegetables. If they are, then I don’t feel the need to sweat the un-touched chickpeas. Dessert (whether it's a cookie or just fancy yogurt with banana) is earned, not a given. Branding counts, too. As in, my kids have decided they don’t like cauliflower, but don’t seem so put off when we call it “white broccoli.”But sometimes you have to get sneaky. I make small healthyish tweaks to their favorite dishes and hope they'll be too hungry to notice. I slip in whole wheat pasta, roast potato “fries,” and hide vegetables in their penne. In those moments when I find myself coaxing peas into tubular pasta, I long for a dish we could all agree on and eat as a family.Turns out, I think I may have found just that in Cheesy Baked Pasta with Cauliflower. It's refined enough for the grownups, with a sneaky dose of vegetables for the kids.Close enough to fries.\nBen DeweyStart by cooking 1 lb. medium shells in boiling salted water for half the time the package directs (so they don’t overcook when baked).Drain, saving ½ cup pasta cooking water. Rinse pasta under cold running water to stop the cooking. Then mix 8 oz. coarsely grated low-moisture whole-milk mozzarella, 4 oz. coarsely grated provolone, 2 oz. coarsely grated sharp cheddar, 2 oz. grated Parmesan, one 14-oz. can cherry tomatoes, lightly crushed, 11⁄2 cups heavy cream, and reserved pasta cooking water in a large bowl; season with salt and pepper. Mix in pasta and 1⁄2 head of cauliflower, coarsely chopped. Transfer to a buttered 3-qt. baking dish; cover tightly with foil. At this point you can chill it for a day before baking.Bake at 350° until pasta is hot throughout (it should release steam when foil is lifted), 20–25 minutes. Uncover, increase heat to 425°, and continue to bake until sauce is bubbling and top is browned in spots, 25–30 minutes.Even if my kids wish there weren’t so much “stuff” in the noodles, this pasta gets them to the dinner table and keeps them there for a solid five minutes. And I definitely don’t mention that there is white broccoli in it.Get the recipe:Cheesy Baked Pasta with CauliflowerThis baked pasta is super-kid-friendly. (They won't be able to detect the cauliflower!)View RecipeExplore Bon AppétitCauliflowerKid-FriendlyFamily MealsWeeknightPastaCheeseRead Morerecipes37 Recipes to Trick Picky Eaters Into Trying New ThingsGallery37 SlidesBy Alyse WhitneycookingThe Chicken Katsu Recipe Every Kid (and Adult) Will LoveBy Adam RapoportcookingThese Chewy Grainy Bars Are the Perfect Portable SnackBy Liesel Daviscooking50 Things We Learned About Feeding Kids In the Past 6 YearsBy Jenny Rosenstrach and Andy WardRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-01-14", "author": ["Condé Nast", "Chris Morocco", "Andy Ward"]}