{"id": "c6723ce3be0583b8cea9397e34b738eb", "url": "https://www.bonappetit.com/story/party-tricks-alison-roman-shrimp-cocktail-party", "year": 2018.0, "month": 12.0, "day": 2.0, "content": "Ain't No Party Like a Shrimp Cocktail Party | Bon Appétit\n\n\n\n\nSkip to main contentOpen Navigation MenuMenuStory SavedTo revisit this article, visit My Profile, then View saved stories.Close AlertCloseStory SavedTo revisit this article, select My Account, then View saved storiesClose AlertCloseSign InSearchRecipesCookingCultureShoppingRestaurantsBA MarketVideosPodcastMerch ShopcookingAin't No Party Like a Shrimp Cocktail PartyMake shrimp cocktail at home, win holiday parties forever.By Alison RomanDecember 13, 2018FacebookTwitterEmailFacebookTwitterEmailWelcome to Party Tricks, a monthly column in which bestselling cookbook author and entertaining pro Alison Roman schools us on the fine art of having people over without pulling out your hair.Sure, alcohol is good, but have you ever had shrimp cocktail? No shade to a gallon of punch, but I’m pretty sure nobody has ever gotten a crippling hangover from a platter of perfectly poached shrimp dipped in a delightfully-sassy cocktail sauce. No, I’m not suggesting you replace booze with shrimp at your next party—because, uh, no that will not work—but I am suggesting that you make a giant platter of beautiful shrimp cocktail the centerpiece at your next holiday soiree.Why? Because it’s the kind of thing usually only ordered at restaurants to snack on during martini hour, with an elegant, retro campiness whose mere presence suggests “wow, this very sophisticated and festive person throws amazing parties.” While other snacks are not uninvited to this party, imagine, for a second, being so confident in the deliciousness of one snack, that it was all you served?Not. Bad. At. All.\nIn this fantasy fete, you are going to take time to poach large, unpeeled shrimp yourself in a large pot of salted, gently boiling water until bright pink (three to four minutes is all it takes). Once cooled, you’ll peel them and then devein if you like (this is a personal preference). Arrange them in a festive yet unfussy way inside a colander full of crushed or smaller cubes of ice and then place that in a bowl (as the ice melts, the water will drip down so your shrimp don’t sit in a bowlful of water). Serve with lots of lemon wedges and your now-famous House Special Cocktail Sauce, which is an elegant mix of ketchup seasoned with a tangy hot sauce (something like sambal, sriracha, or even Tabasco), fresh lemon, salt and pepper. (You can add prepared or freshly grated horseradish if you really want, but hot sauce should give you the kick and complexity you're after.)On the side you’ll want saltine crackers (because we like a good throwback AND a good cracker), and lots of briny olives and tiny pickles for alternative snacking. Be sure you set out a small bowl for pits and tails and other party detritus, because you're a good host. Finally, eat too much shrimp, and wake up the next morning with no regrets.Want a good shrimp cocktail recipe? We got that:BA’s Best Shrimp CocktailShrimp cocktail is all about the shrimp: big, fat, perfectly cooked gorgeous shrimp. Here’s how to do it.View RecipeExplore Bon AppétitShrimpParty TricksEntertainingRecipes you want to make. Cooking advice that works. Restaurant recommendations you trust.FacebookTwitterPinterestInstagramYouTubeMore from Bon AppétitMastheadNewsletter SignupBon Appétit Media KitContactSubscription FAQsCareersRSS FeedsSite MapAccessibility HelpCondé Nast StoreCondé Nast SpotlightDo Not Sell My Personal Info© 2022 Condé Nast. All rights reserved. Use of this site constitutes acceptance of our User Agreement and Privacy Policy and Cookie Statement and Your California Privacy Rights. Bon Appétit may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad ChoicesFood Innovation Group", "date": "2018-12-13", "author": ["Condé Nast", "Alison Roman"]}